{
  "title": "Paper_363",
  "abstract": "pmc J Exp Clin Cancer Res J Exp Clin Cancer Res 618 jeccr Journal of Experimental & Clinical Cancer Research : CR 0392-9078 1756-9966 BMC PMC12487091 PMC12487091.1 12487091 12487091 41029427 10.1186/s13046-025-03509-1 3509 1 Review Epigenetic regulation in gynecological cancers: a paradigm shift in immunotherapy strategies Zhao Chenyuan Liu Yang Cui Zhuo zcyhldsyy@163.com Huludao Central Hospital, Huludao, 125000 Liaoning China 30 9 2025 2025 44 478191 275 26 6 2025 10 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ Recent advances in immunotherapy have transformed the therapeutic landscape of gynecological cancers; however, durable responses remain limited by tumor heterogeneity and immune evasion mechanisms. Emerging evidence highlights epigenetic modifications comprising of DNA methylation, histone modifications, and RNA methylation as pivotal regulators of the tumor immune microenvironment and immunotherapy efficacy. This review comprehensively explores how these epigenetic alterations modulate immune cell infiltration, antigen presentation, immune checkpoint expression, and tumor immunogenicity across cervical, ovarian, and endometrial cancers. We also delineate the impact of specific epigenetic enzymes, such as DNMTs, HDACs, BET and RNA methyltransferases, in shaping immune responses and discuss the therapeutic potential of targeting these regulators to sensitize tumors to immune checkpoint inhibitors, cancer vaccines, cytokine based treatments and adoptive T-cell therapies. Furthermore, we examine the integration of epigenetic agents such as DNMT and HDAC inhibitors with immunotherapies in preclinical and clinical settings, emphasizing their synergistic capacity to overcome immunoresistance. By illuminating the interplay between epigenetic regulation and immune dynamics, this review underscores a paradigm shift toward precision immunoepigenetic strategies, offering a promising framework for enhancing therapeutic outcomes in gynecological malignancies. Graphical Abstract  Keywords Epigenetic Gynecological cancer Immunotherapy TIME pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Italian National Cancer Institute ‘Regina Elena’ 2025 Introduction Gynecological cancers, ovarian, cervical, and endometrial, pose significant challenges due to their molecular complexity, aggressive behavior, and therapy resistance. These cancers drive global morbidity and mortality through genetic and epigenetic alterations that promote tumor growth and immune evasion [ 1 2 3 4 5 6 Epigenetic mechanisms, such as DNA methylation, histone modifications, acetylation, methylation, lactylation, and RNA methylation, regulate gene expression without altering DNA sequences, significantly impacting the tumor immune microenvironment (TIME) [ 7 8 9 10 11 12 14 15 16 Epidrugs like DNMTi and HDACi are gaining attention for their ability to reverse epigenetic silencing, upregulate tumor antigens, and enhance immune effector function, sensitizing tumors to chemotherapy and ICIs [ 17 18 19 20 21 The synergistic potential of epidrugs lies in their ability to address both chemoresistance and immune suppression, offering a dual mechanism to improve therapeutic outcomes. By targeting epigenetic modifications, these therapies can upregulate immune-related genes, increase tumor-associated antigen expression, and improve immune effector function, thereby sensitizing tumors to ICIs and other immune-based approaches. Moreover, epigenetic profiling offers opportunities to identify biomarkers for patient stratification and predict treatment responses, paving the way for precision oncology. This article provides a comprehensive examination of the interplay between epigenetic regulation and immune responses in gynecological cancers. Through an in-depth review of preclinical studies, clinical trials, and emerging therapeutic combinations, we underscore the transformative potential of integrating epigenetic interventions with immunotherapy to overcome resistance, enhance anti-tumor immunity, and ultimately improve survival and quality of life for patients facing these formidable diseases and to drive a paradigm shift toward personalized, immune-centric therapeutic strategies. An overview of immunotherapy in gynecological cancers Immunotherapy has transformed the treatment of gynecological cancers, including ovarian, cervical, and endometrial malignancies, by leveraging immune mechanisms to target tumors. This section reviews key immunotherapeutic strategies—cytokine therapy, cancer vaccines, ICIs, and CAR T-cell therapy—highlighting their mechanisms, efficacy, and challenges in these cancers. Cytokine therapy Interferons (IFN) Interferons (IFN-α and IFN-γ) exhibit cytotoxic and immunomodulatory effects in gynecological cancers. In cervical cancer, IFN-α and IFN-γ induce apoptosis in HeLa cells and long-term G1 cell cycle arrest, mediated by p57 and p27 [ 22 23 24 25 Interleukins Interleukins modulate immune responses in gynecological cancers. In cervical cancer, IL-33 promotes immune evasion via IL-13 and M-MDSCs, while IL-24 inhibits proliferation and enhances apoptosis in SiHa and HeLa cells [ 26 27 28 29 Cancer vaccines Cancer vaccines stimulate tumor-specific immune responses in gynecological cancers. In ovarian cancer, a phase I trial of a personalized dendritic cell (DC) vaccine (OCDC) elicited robust T-cell responses, extending survival when combined with bevacizumab and cyclophosphamide [ 30 31 32 Immune checkpoint inhibitors The advent of ICIs has revolutionized cancer treatment, significantly enhancing clinical outcomes across various cancer types. The most prominent immune checkpoint molecules currently include programmed death-1 (PD-1), programmed Cell Death Ligand 1 (PD-L1), and cytotoxic T-lymphocyte–associated Antigen 4 (CTLA-4), with several well-established drugs widely employed in therapy. Additionally, emerging checkpoint inhibitors, such as B and T lymphocyte attenuators, are being explored and assessed for their potential in advancing anti-cancer immunotherapy [ 33 PD-1 or PD-L1 Inhibitors PD-1/PD-L1 inhibitors disrupt immunosuppressive signaling, enhancing T-cell activity in gynecological cancers. In ovarian cancer, anti-PD-L1 antibodies increased T-cell infiltration and survival in preclinical models [ 34 35 36 37 38 39 40 41 42 CTLA-4 inhibitors Immune checkpoint therapies use monoclonal antibodies to enhance anti-tumor immunity by targeting pathways like CTLA-4, a T-cell receptor that inhibits activation by binding B7 proteins and boosts regulatory T-cell suppression [ 43 44 45 Combining PD-1 or PD-L1 Inhibitors and CTLA-4 Inhibitors Immunotherapy, particularly PD-1/PD-L1 and CTLA-4 checkpoint inhibitors, has transformed gynecological cancer treatment, showing efficacy in uterine, ovarian, and endometrial cancers [ 46 47 In recurrent, metastatic, or persistent cervical cancer (R/M CC), combining PD-1/PD-L1 and CTLA-4 inhibitors addresses limited treatment options. A phase II trial of balstilimab (anti-PD-1) and zalifrelimab (anti-CTLA-4) in 155 women with R/M CC achieved a 25.6% ORR, with 10 complete responses And 22 partial responses, higher in PD-L1-positive tumors [ 48 49 50 51 52 In endometrial cancer, PD-1/PD-L1 and CTLA-4 inhibitors tackle complex immunotherapy responses, especially in MMR-proficient, PD-L1-negative tumors. A stage IV case showed a durable partial response to nivolumab And ipilimumab beyond 12 months [ 53 54 Chimeric antigen receptor-T cell therapy Adoptive cell therapy (ACT) utilizes tumor-reactive immune cells to target cancer cells with specific surface markers. It includes allogeneic and transgenic T-cell therapies, such as CAR-T and TCR therapies, where T cells are genetically modified to express CARs or T-cell receptors (TCRs) to enhance tumor targeting [ 55 CAR-T cell therapy, a key immunotherapeutic approach, modifies T cells to target tumor-associated antigens, showing promise for gynecological cancers. T cells are extracted, engineered with a CAR (antigen-binding domain, hinge, transmembrane domain, and signaling domains like CD28, 4-1BB, CD3ζ), and reinfused to attack cancer cells expressing antigens like MUC16, FOLR1, or EpCAM. This triggers cytotoxicity and cytokine release, though challenges like tumor heterogeneity and immunosuppression persist [ 56 57 25 26 27 28 29 31 32 Epigenetic modification-mediated regulation of immune components, TIME, and immunotherapy in gynecological cancers DNA methylation DNA methylation is a pivotal epigenetic mechanism that significantly influences gene expression in gynecological cancers. This process involves the addition of a methyl group to the 5′ position of cytosine within CpG islands, forming 5-methylcytosine (5mC), a modification primarily catalyzed by DNA methyltransferases (DNMTs), which act as the writers, of methylation marks [ 58 59 60 61 , 62 63 64 . In cervical cancer, DNA methylation profoundly regulates immune components and immunotherapy responses by altering the expression of key immune genes within the TIME, contributing to immune evasion and tumor progression [ 65 66 67 68 69 70 Ovarian cancer exhibits distinct methylation patterns that shape the TIME and influence immunotherapy outcomes . 71 , 72 73 . 74 SALL4 SALL4 75 Targeting methylation patterns with demethylating agents could restore immune activation, potentially enhancing ICI efficacy, offering a promising avenue for personalized therapies in endometrial cancer. Linking these cancers, DNA methylation emerges as a common thread modulating the TIME across gynecological malignancies. In cervical cancer, hypermethylation of immune-activating genes like IFN-γ and APM components fosters immune evasion, while in ovarian cancer, hypomethylation enhances immunogenicity, impacting ICI responses. Endometrial cancer highlights hypomethylation-driven immunosuppression via VTCN1, underscoring the need for tailored epigenetic interventions (Table 1 , Table 1 Epigenetic modifications and their Immune-related effects in gynecologic cancers Methylation Epigenetic modification Targeted by epigenetic modification Downstream immune components Cancer type and cell lines Study type Highlights Ref ↑Methylation BRCA1 PD-L1 Ovarian Observational cross-sectional analytical study “BRCA1 hypermethylation linked to serous ovarian cancer, no correlation with PD-L1 expression.” [ 88 ↑Methylation ↓CD8 + tumor-infiltrating lymphocytes (TILs), ↓TAP1 high-grade serous carcinoma (HGSC) Retrospective cohort study with molecular and clinical e analyses “Higher methylation impairs antigen presentation, promoting immune evasion.” [ 89 ↓Methylation ↑KP-OVA-52 Ovarian SK-OV-3 And SNU 840 In vitro “Demethylation induces KP-OVA-52, a potential immunotherapy target.” [ 90 ↑Methylation Protein arginine methyltransferase 5 (PRMT5) IFN-γ, ↓TNF-α and ↓granzyme B in T cells JAK/↑STAT1/↑PD-L1 ↑TIM-3 Cervical Siha, Ms751, HeLa, and Hela229 In vitro and in vivo “PRMT5 knockdown enhances T-cell response, regulates PD-L1 via STAT1.” [ 11 ↑Methylation Erb-B2 Receptor Tyrosine Kinase 3 (ERBB3) ↑MDSC, M1 to M2 polaryzation, ↓IFN-γ ↑TIGIT, ↑CTLA4, ↑PD-L1 CXCL9, CXCR5 CESC AV3, Hela Retrospective observational with bioinformatics analysis “ERBB3 methylation correlates with immunosuppressive TIME.” [ 91 Methylation V-Set Domain Containing T Cell Activation Inhibitor 1 (VTCN1), PD-L1, CTLA4 Endometrial Retrospective observational with bioinformatics analysis “High methylation age deceleration linked to VTCN1-driven immunoexclusion.” [ 92 ↑Methylation PARVG, SYNE4, CDO1 ↓T cells CD8, ↓Eosinophils and ↓Neutrophils, ↑M2 macrophages and ↑M0 macrophages ↓CTLA4, ↓PD1, ↓PD-L1, and ↓PD-L2 UCEC Retrospective observational cohort study with bioinformatic “Hypermethylation increases immunosuppression, higher TMB.” [ 93 ↑Methylation Capping actin protein, gelsolin-like (CAPG) ↓IL8, ↓TNF, ↓TLR4 ↑Plasma cells, ↑CD8 T cells, ↑follicular helper T cells, ↑M0 macrophages, ↑M1 macrophages, and ↑macrophages ↓Naive B cells, ↓resting CD4 memory T cells, ↓eosinophils, ↓resting mast cells, and ↓resting NK cells UCEC Ishikawa Retrospective observational cohort study with bioinformatics In vitro “CAPG methylation impacts immune response and ferroptosis.” [ 94 ↑Methylation MutL protein homolog 1 (MLH1) ↑PD-1/PD-L1 Endometrial Retrospective observational cohort “MLH1 methylation enhances PD-1/PD-L1 in immune cells.” [ 95 ↑Methylation ↓Methylation ↓MSX1, IL18BP ↑SLC9A1, MARVELD1, PI3, MFAP4 ↑IL-18, ↓T-cell activity ↓MHC-I, ↓PD-L1, ↓LAG3 Ovarian OVCAR3 Retrospective observational cohort study with bioinformatics In vitro “Hypomethylation promotes tumor growth, hypermethylation impairs immunity.” [ 96 ↑Methylation ↑ZC3H13, YTHDC1 (no effect), and ↑METTL14 ↑PD-L1, ↑CD4 + T cells, ↓macrophages, NK cells Endometrial Ishikawa, HEC-1A In vitro “METTL14/ZC3H13 loss drives immune evasion via m6A reduction.” [ 97 Acetylation ↑Acetylation ↑PD-L1 ↓B cells, ↓CD4 + and CD8 + T cells, and ↓cancer-associated fibroblasts (CAF) CESC CC7T/VGH, CaSki Retrospective observational cohort study with bioinformatics In vitro “ACSS2 upregulation promotes immunosuppressive TIME.” [ 86 ↑Acetylation GALNT6A, DNAJA1, PRDX5, SERPINB9, FOXO1, ACSM3 M2/Tregs PD-1/PD-L1, CD8 +/M1 Ovarian Retrospective observational cohort study with bioinformatic “C1 pattern predicts better ICB response, C3 linked to proliferation.” [ 83 ↑Acetylation FOXP1 ↑PD‐L1, CTLA4, CXCL9, ARG1 ↑Treg infiltration, ↑CD4 + T, ↓M1 infiltration Cervical SiHa and CaSki In vitro and in vivo “NAT10/ac4C enhances immunosuppression via glycolytic reprogramming.” [ 98 m6A and m1A modification m6A m6A regulators METTL3/m6A/MDSCs, M1 to M2 macrophage polarization, IL-1β, CCL2 and CXCL2 Ovarian ID8 In vitro and in vivo “METTL3 knockout shifts macrophages to M2, promoting tumor growth.” [ 99 m6A m6A regulators T-cell immunoreceptor with Ig and ITIM domains (TIGIT), CD8 + + UCEC In vitro and in vivo “TIGIT strongly tied to immune function, impacts infiltration.” [ 100 ↓m6a m6A regulators ↑HLA, ↑PD-1, ↑CTLA-4 ↑CD4 +/CD8 + T cells and dendritic cells Ovarian Retrospective observational with bioinformatics analysis “Low m6A enhances immune activation, better immunotherapy response.” [ 101 ↓m6a m6A regulator: RBM15 ↓NK cell, ↑PD-L1 UCEC Retrospective observational with bioinformatics analysis “RBM15-mediated m6A inhibits NK cell activation, promotes PD-L1.” [ 102 m1A m6A regulators CTLA4, PD-1 Ovarian Retrospective observational with bioinformatics “High m1A score predicts better anti-PD-1/CTLA-4 response.” [ 103 ↑m6A ↓CTLA-4, ↓PD-1, and ↓PD-L1 CESC Retrospective observational with bioinformatics “Low m6A score linked to higher TMB, better immunotherapy response.” [ 104 Acetylation Within mammalian cells, DNA is tightly packaged into chromatin, wrapped around histone proteins that undergo various posttranslational modifications. Among these, acetylation of lysine residues on histones H3 and H4 is a key regulator. This process, driven by histone acetyltransferases (HATs), adds acetyl groups, loosening chromatin structure and enhancing gene accessibility at promoter or enhancer regions, thereby promoting gene expression. Conversely, HDACs remove these acetyl groups, condensing chromatin and silencing gene activity [ 76 77 78 , 79 In cervical cancer, acetylation drives epigenetic mechanisms that influence immunotherapy outcomes. The nicotinamide adenine dinucleotide (NAD +)-dependent deacetylase Sirtuin 1 (SIRT1), within the NAMPT/SIRT1 metabolic axis, deacetylates H3K27, modulating PD-L1 nuclear localization and expression. This axis contributes to resistance against immune checkpoint inhibitors, underscoring acetylation’s pivotal role in immunotherapy strategies [ 80 81 82 In epithelial ovarian carcinoma (EOC), acetylation patterns profoundly influence immune cell dynamics and therapeutic responses [ 9 . 83 85 , 86 87 Acetylation emerges as a cornerstone of epigenetic regulation in gynecological cancers, intricately Linking chromatin remodeling, metabolic reprogramming, And immune modulation. As indicated in Table 1, its ability to shape TIME, regulate immune checkpoint pathways, an influence therapeutic responses underscores its potential as both a biomarker and therapeutic target. By driving immunotherapy efficacy, acetylation offers a pathway to overcome resistance and enhance patient outcomes, particularly through personalized strategies informed by acetylation patterns. Future research should focus on elucidating the molecular mechanisms underlying acetylation’s interactions with TMB and TIME, validating these findings in larger clinical cohorts, and developing targeted inhibitors, such as those for SIRT1 or ESCO1, to complement ICB therapies. As precision oncology advances, harnessing acetylation’s regulatory power promises to transform the therapeutic landscape for cervical and ovarian cancers, paving the way for more effective and individualized treatments. Histone methylation Histone methylation serves as a critical epigenetic mechanism, distinct from histone acetylation, that intricately regulates gene expression through the addition or removal of methyl groups on specific histone residues. This process varies in complexity depending on the targeted amino acid and the degree of methylation [ 105 106 107 108 In cervical cancer, histone methylation significantly shapes the TIME and immunotherapy potential through mutations in epigenetic regulators like MLL2, a histone methyltransferase that methylates H3K4. Studies have shown that MLL2 mutations are associated with poor survival, likely due to aberrant H3K4 methylation, which alters the epigenetic landscape and promotes cancer progression. These mutations disrupt normal histone modification patterns, potentially suppressing genes involved in immune activation. Additionally, mutations in other epigenetic regulators, such as EP300, CREBBP, and SETD2, often occur near phosphorylation sites, further dysregulating histone methylation and chromatin condensation. This dysregulation impairs antigen presentation and immune cell recruitment, creating an immunosuppressive TIME. Notably, the immunogenicity of mutations in cervical cancer, driven by altered histone methylation, generates neo-epitopes that can be recognized by T cells, suggesting that targeting these epigenetic changes could enhance immunotherapy efficacy. For instance, Chromatin Immunoprecipitation followed by sequencing (ChIP-seq) for H3K4me3 could identify specific methylation patterns to guide immunotherapeutic strategies [ 109 110 In ovarian cancer, histone methylation regulates the TIME and immunotherapy efficacy through the actions of methyltransferases like SETDB1 and demethylases like KDM5A [ 111 112 111 112 111 The interconnected roles of histone methylation in cervical and ovarian cancers highlight its broader significance in gynecological malignancies. In both cancers, dysregulated histone methylation contributes to immune evasion by altering the TIME , . Histone lactylation Histone lactylation, a novel epigenetic modification involving the attachment of lactate to lysine residues on histones, has emerged as a critical regulator of gene expression in cancer, particularly in the TIME [ 113 114 115 116 117 In ovarian cancer, histone lactylation significantly influences immunotherapy outcomes by regulating PD-L1 expression through metabolic and epigenetic pathways. Lactate dehydrogenase B (LDHB) enhances glycolysis and lactate production, leading to increased histone lactylation at the PD-L1 promoter, which upregulates PD-L1 expression. This upregulation suppresses T-cell activation, facilitating immune evasion by ovarian cancer cells [ 116 118 116 117 119 117 The broader implications of histone lactylation extend to the metabolic adaptability of gynecological tumors. Tumor cells exploit anaerobic glycolysis and lactate fermentation, catalyzed by LDHA and LDHB, to thrive in hypoxic conditions. This metabolic flexibility not only supports energy production but also drives epigenetic changes that enhance immune evasion. In cervical cancer, the lactate shuttle enables aerobic cancer cells to utilize lactate from hypoxic cells, further amplifying histone lactylation and gene expression changes. Similarly, in ovarian cancer, lactate-induced STING-dependent innate immune responses and PD-L1 upregulation create a feedback loop that sustains immunosuppression. By targeting histone lactylation , N6-methyladenosine and N1-methyladenosine RNA modifications, notably N6-methyladenosine (m6A) and N1-methyladenosine (m1A), are key epigenetic regulators of gene expression and cellular processes in gynecological cancers. These modifications, part of the epitranscriptome, involve the addition of chemical groups to RNA nucleotides, modulating post-transcriptional regulation [ 120 121 122 123 The tumor TIME in gynecological cancers is profoundly influenced by m6A and m1A modifications, which regulate immune cell infiltration and activation. In ovarian cancer, m6A regulators such as METTL3 and ALKBH5 modulate immune checkpoint expression, including PD-L1, impacting T-cell function and infiltration. ALKBH5, for instance, upregulates PD-L1 in macrophages, suppressing immune effector cells within the TIME [ 124 103 125 126 125 127 102 128 The therapeutic potential of targeting m6A and m1A modifications extends to improving drug sensitivity and immunotherapy outcomes in gynecological cancers. In ovarian cancer, RRGs like DNMT1 and METTL3 are implicated in resistance to cisplatin and paclitaxel, while m1A regulators such as TRMT10C influence tumor proliferation. Small-molecule drugs, including resveratrol and amodiaquine, show preclinical promise by targeting these modifications to inhibit tumor growth and enhance immune responses. In cervical cancer, a prognostic signature comprising METTL16, YTHDF1, and ZC3H13 predicts survival and immunotherapy response, with high-risk scores indicating worse outcomes. Similarly, in endometrial cancer, m6Ascore serves as an independent prognostic indicator, aiding patient stratification for immunotherapy. By integrating molecular signatures with clinical data, m6A and m1A modifications provide a robust framework for precision oncology, enabling personalized therapies that harness epigenetic regulation to optimize immunotherapy efficacy across gynecological cancers. Epigenetic regulators in shaping the tumor immune microenvironment and immunotherapy response in gynecological cancers DNMT and DNMT inhibitors DNMTs are pivotal epigenetic regulators that orchestrate gene expression by catalyzing the methylation of cytosine residues in CpG dinucleotides, a process integral to cellular differentiation And development. Since their discovery in the 1970s, three primary DNMT isoforms—DNMT1, DNMT3A, and DNMT3B—have been extensively studied [ 18 129 129 2 Table 2 Effects of HDAC and DNMT inhibitors on immune modulation of gynecological cancers Epigenetic regulator Immune component targets Cancer types and cell lines Highlights Ref HDAC1i + DNMT1i ↑4-1BB ligand (4-1BBL/CD157) and OX-40 ligand (OX-40L/CD252) ↓PD-L1/CD274 Ovarian A2780 “Knockdown of HDAC1 or DNMT1 expression, and pharmacological inhibition of DNMT or HDAC enzymatic activity, significantly increase OX-40L And 4-1BBL expression in chemoresistant cells. This study suggests that loss of histone acetylation and accumulation of DNA methylation correlates with suppressed expression of OX-40L And 4-1BBL in chemoresistant ovarian cancer cells, assosiat with promoted cytotoxic T-cells activity.” [ 15 HDACi + DNMTi ↑CIITA, CD74, and MHC II Ovarian A2780.IP2 and A2780.CP20 “Combination treatment showed higher MHC II protein expression than with single agent treatment. In patient-derived xenografts, CIITA, CD74, and MHC II mRNA transcripts were significantly increased after combination treatment.” [ 151 HDACi + DNMTi ↑CCL5, TNF-α and IFN-γ ↓IL-10 Ovarian OVCAR-3, SKOV-3, A2780 “The treated bulk T cells, CD8 + T cells, and CD4 + T cells showed anti-tumor cytokines, including CCL5, TNF-α and IFN-γ, were upregulated while the pro-tumor cytokine IL-10 was downregulated. These changes were evident at the transcript and secreted cytokine level, pointing to transcriptional upregulation of the target genes. This study demonstrates direct activation of T cells by DNMTis and HDACis and provides mechanistic insight into the role of epigenetic therapies in the murine model.” [ 152 HDACi ↓IKK/↑IL-8/CXCL8 Ovarian SKOV3, CAOV3, and OVCAR3 “HDAC inhibition specifically induces IL-8/CXCL8 expression in EOC cells and that the mechanism involves IKK, suggesting that using IKK inhibitors may increase the effectiveness of HDAC inhibitors when treating ovarian cancer and other solid tumors characterized by increased IL-8/CXCL8 expression.” [ 153 HDACi ↓IL-6, IL-8, IL-1B and CXCL1 Ovarian In vivo “ARID1A recruits the Sin3A-HDAC complex to suppress cytokine gene expression. HDAC inhibitors would not be effective for OCCC, and could even cause unfavorable outcomes.” [ 154 HDACi ↑NKT, and CD8 + ↑PSMB10, NKG7, ↑CCL5, ↑CD27, ↑HLA-DQA1, and HLA-DQB1 Ovarian In vivo “Increased HDAC expression was linked to reduced infiltration of natural killer (NK), NKT, and CD8 + + + [ 16 HDACi KANSL1 Ovarian “Histone acetylase and methylation complex gene KANSL1 [ 155 DNMTi ↑Cytotoxic CD8 + T, ↑type I IFN Ovarian A2780, SKOV3, Kuramochi “Combining Adar1 loss and DNMTi elicited the most robust antitumor response and transformed the immune microenvironment with increased recruitment and activation of tumor-specific, cytotoxic CD8 + T cells.” [ 156 In ovarian cancer, DNMTis profoundly reshape the TIME, fostering an immunogenic landscape conducive to anti-tumor responses. Research demonstrates that SGI-110 induces hypomethylation of CTA promoters, such as NY-ESO-1 and MAGE-A, in EOC cell lines and tumor-bearing murine models, resulting in robust mRNA and protein expression. This upregulation enhances tumor cell recognition by antigen-specific CD8 + T cells, particularly when paired with NY-ESO-1-directed vaccines, leading to delayed tumor growth compared to standalone treatments [ 19 130 The immunomodulatory potential of DNMTs extends to their interplay with RNA editing enzymes, notably adenosine deaminase acting on RNA 1 (ADAR1), offering novel therapeutic avenues [ 131 132 133 134 In endometrial cancer, particularly MMRd subtypes, DNMTis address TIME heterogeneity to optimize ICI efficacy [ 135 136 135 The cohesive impact of DNMTis across gynecological cancers lies in their ability to reprogram the TIME through interconnected mechanisms: enhancing CTA and HLA class I expression, amplifying IFN signaling, polarizing macrophages toward tumoricidal phenotypes, and boosting chemokine-driven immune cell infiltration. By linking innate and adaptive immunity, DNMTis synergize with vaccines, ICIs, and emerging targets like ADAR1 inhibitors, offering a versatile platform for combination therapies. Their efficacy in overcoming immune evasion, particularly in TP53-mutant ovarian cancers and MMRd endometrial cancers, positions DNMTis as cornerstone agents in personalized immunotherapy. Future research should explore optimal DNMTi combinations with other epigenetic modifiers, such as histone deacetylase inhibitors, to further potentiate immunogenicity and address TIME immunosuppression comprehensively. Ultimately, DNMTis represent a transformative force in gynecological cancer immunotherapy, bridging epigenetic regulation with immune activation to improve clinical outcomes. HDAC and HDAC inhibitors HDACs are a family of enzymes critical to epigenetic regulation, governing gene expression by removing acetyl groups from histone proteins, thereby condensing chromatin and typically suppressing transcription [ 137 10 138 In cervical cancer, studies utilizing the TC-1 tumor model demonstrate that combining HDACi, such as suberoylanilide hydroxamic acid (SAHA, or Vorinostat), with bortezomib, a proteasome inhibitor, yields synergistic antitumor effects. This combination significantly increases E7-specific CD8 + T-cell populations in the spleen, circulation, and tumor, enhancing immune activation and rendering tumor cells more susceptible to T-cell-mediated killing [ 139 140 141 139 Transitioning to ovarian cancer, HDACi demonstrate parallel immune-modulatory effects within the TIME (Table 2 142 143 144 145 146 Researchers combined HLA ligandomics with immunogenicity analysis on serous ovarian cancer (OvCa) samples and found few consistently presented proteins, primarily housekeeping genes, along with HDAC1. HDAC1 promotes tumor growth by suppressing tumor suppressor genes. Four HDAC1/2 peptides—EYSKQMQRF (HLA-A24), LPHAPGVQM (HLA-B07), RMLPHAPGV, and YTTDRVMTV (HLA-A02)—were identified, with A02 peptides present in HLA-A*02-negative patients, possibly through HLA-E presentation. HLA ligandome comparison revealed that one-third of benign ovarian sample proteins were also found in all OvCa samples, mostly housekeeping genes. HDAC1 peptides RMLPHAPGV and EYSKQMQRF appeared infrequently in benign samples but often in malignant ones, supporting the targeting of HDAC1, particularly as ovaries are resected during OvCa surgery. In vitro, LPHAPGVQM and RMLPHAPGV primed CD8 + T cells to lyse HDAC1 + OvCa cells, with RMLPHAPGV exhibiting multifunctionality, although it was absent in TILs from three OvCa patients, possibly due to immune escape or low affinity, indicating a need for peptide vaccination. Prior peptide vaccines (e.g., NY-ESO-1, p53) elicited immune responses but lacked clinical benefit, likely due to inadequate antigen selection based on gene expression rather than HLA presentation. NY-ESO-1, expressed in 43% of OvCa, has no detected HLA ligands. In refining this, researchers analyzed the OvCa HLA ligandome for universal peptides. HDAC1 overexpression was linked to worse survival, offset by high CD3 + TILs, where HDAC1 was rare, supporting its vaccine potential [ 147 148 Collectively, these findings weave a cohesive narrative: HDACs suppress antitumor immunity in gynecological cancers by altering the TIME, while HDACi counteract this by enhancing antigen presentation, invigorating CD8 + T-cell responses, and destabilizing immunosuppressive networks (Fig. 1 Fig. 1 HDAC-mediated epigenetic regulation and its immunomodulatory effects in gynecological cancers. HDACs suppress gene expression by removing acetyl groups from histones, contributing to immune evasion and tumor progression. HDACi, such as SAHA/vorinostat, restore acetylation, enhancing tumor antigen presentation and immune recognition. This leads to upregulation of HLA molecules, stimulation of CTL responses, and activation of NK and CD8⁺ T cells. HDACi also alter chemokine profiles, suppress pro-tumor cytokines, IL-6, IL-8, and promote antitumor immunity, thereby reshaping the tumor immune components and potentiating the effects of immunotherapies in cervical and ovarian cancers. Black arrows indicate natural progression or activation pathways, while green arrows represent inhibitory effects of specific agents, such as the NF-κB inhibitor IKK-IV Combining HDACi and DNMTi The synergy of DNMTi and HDACi in combination therapy with immunotherapy lies in their complementary mechanisms that simultaneously enhance immune activation, dismantle immunosuppressive barriers, and optimize the tumor’s susceptibility to immune checkpoint blockade [ 149 20 Further evidence of synergy comes from studies combining azacitidine with Nexturastat A, an HDAC6i, which revealed additive reductions in PD-L1 and DNMT1 expression across multiple ovarian cancer cell lines. This dual targeting not only enhances immune recognition by lowering immunosuppressive signals but also reinforces epigenetic reprogramming to sustain antitumor immunity. For instance, the unexpected reduction of DNMT1 by Nexturastat A suggests a broader epigenetic crosstalk that amplifies azacitidine’s effects, potentially through shared pathways like p53 signaling, which regulates IFN-stimulated genes and pro-apoptotic responses. Additionally, the combination increased CXCL10 levels in both cell culture and ascites fluid, promoting immune cell recruitment and correlating with reduced tumor burden in models like ID8-VEGF-Defensin, which mirrors human ovarian cancer dynamics. These findings underscore the potential for DNMTi and HDAC6i to reshape the TIME in a way that maximizes the efficacy of anti-PD-1 therapy, creating a robust and sustained immune response [ 21 150 As illustrated in Fig. 2 Fig. 2 Epigenetic modulation of the TIME in gynecological cancers via EHMT inhibition. Tumor cells in gynecological malignancies leverage EHMT1/2-mediated H3K9me2 deposition to repress immune-stimulatory genes, including CXCL9 and CXCL10, facilitating immune evasion through chromatin compaction and gene silencing. EHMTi, using agents such as HKMTI-1–005 and EZM8266, reverses this suppression, enhancing IFNγ-mediated chemokine expression. This leads to increased CXCR3 + immune cell infiltration—including dendritic cells, NK cells, and cytotoxic CD8⁺ T cells—while reducing immunosuppressive CD4⁺ Tregs. Concurrently, EHMTi alleviates promoter hypermethylation and augments transposable element expression, thereby triggering antiviral mimicry pathways and amplifying interferon responses EHMT and EHMT inhibitor Euchromatin histone methyltransferase (EHMT), encompassing EHMT1 and EHMT2, is a critical epigenetic regulator responsible for depositing the repressive histone mark H3K9me2, which silences gene expression by compacting chromatin [ 157 158 159 Research utilizing the ID8 Trp53-/- murine ovarian cancer model has demonstrated that a novel dual EHMT2/EZH2 inhibitor, HKMTI-1–005, significantly upregulates chemokine expression, including cxcl9, cxcl10, and ccl5, following IFNγ stimulation in vitro. In vivo, this inhibitor extended survival, reduced ascites accumulation, and shifted the TIME toward an immunostimulatory state, marked by increased infiltration of effector CD8 + T cells, NK cells, and DCs, alongside a reduction in immunosuppressive Tregs. These findings suggest that EHMT inhibition disrupts the tumor’s ability to maintain an immune-evasive niche, paving the way for enhanced immune recognition and attack. This immune remodeling links directly to the previous discussion of EHMT’s repressive role, illustrating how its inhibition can transform the TIME into a more favorable landscape for immunotherapy [ 160 Expanding on this, studies of PARPi-resistant ovarian cancer models further highlight EHMT’s involvement in therapy resistance and its therapeutic potential when inhibited. Elevated EHMT1/2 expression and H3K9me2 levels in PARPi-resistant cells associate with suppressed transposable element (TE) expression, which, when derepressed by EHMTi, triggers a viral mimicry response. This response, mediated by dsRNA sensors RIGI and MDA5, activates interferon signaling pathways, boosting the expression of T-cell-recruiting cytokines and reducing tumor burden in immunocompetent models. Notably, in vivo experiments with PARPi-resistant ID8 TP53-/-/BRCA2-/- syngeneic models confirmed that both single EHMTi and combined EHMTi/PARPi treatments significantly reduced tumor growth, with effects partially dependent on CD8 + T cells. This dependency underscores a critical connection between EHMT inhibition and immune activation, building on the earlier evidence of chemokine-driven immune cell recruitment [ 161 162 The mechanistic insights into EHMTi’s action further elucidate its immunotherapeutic promise. EHMT inhibition not only reduces H3K9me2 but also alters chromatin accessibility at TE loci, directly binding EHMT2 to these regions and promoting an open chromatin state that favors immune gene expression. In PARPi-resistant contexts, the interplay between EHMTi-induced TE reactivation and PARPi-driven DNA damage amplifies interferon responses via distinct pathways—MDA5 sensing TE-derived dsRNA and RIGI detecting PARPi-induced DNA:RNA hybrids. This dual activation enhances the immunostimulatory milieu, as seen in reduced tumor proliferation (via Ki67 staining) and increased cytokine production (e.g., CCL5, CXCL10, TNFα) in syngeneic models. These molecular shifts tie into the observed immune cell dynamics, offering a cohesive narrative of how EHMTi bridges epigenetic regulation with immune effector functions [ 163 164 To sum up, EHMT governs an epigenetic landscape that suppresses anti-tumor immunity in gynecological cancers, particularly through silencing chemokines and TEs critical for immune engagement. Its inhibition with EHMTi reverses this suppression, reactivating immune signaling, reducing tumor burden, and enhancing CD8 + T-cell-dependent responses in both PARPi-sensitive and resistant settings (Fig. 3 Fig. 3 Mechanistic overview of BETi in modulating the TIME in gynecological cancers. BET proteins (BRD2, BRD3, BRD4, BRDT) are epigenetic readers that bind acetylated histones to regulate gene transcription. BET inhibitors such as i-BET151, ABBV-075, and JQ1 disrupt this interaction, leading to enhanced histone acetylation and altered gene expression. In ovarian and other gynecological cancers, BETi exert antitumor effects by promoting tumor cell apoptosis and reducing immune-suppressive CCR2⁺/CD68⁺ macrophages. They reprogram macrophages from an M2-like (protumor) to M1-like (antitumor) phenotype, disrupt PD-L1 expression, and inhibit immune escape. These changes collectively enhance CD8⁺ T cell infiltration, cytotoxic function, and immunogenic cancer cell death, offering a promising strategy to sensitize “cold” tumors to immunotherapy BET and BET inhibitors The bromodomain and extraterminal (BET) protein family, comprising BRD2, BRD3, BRD4, and the testis-specific BRDT, is an epigenetic regulators that bind acetylated lysine residues on histones and transcription factors to modulate gene expression [ 165 166 167 168 Studies have demonstrated that BETi, such as i-BET151 and JQ1, exert potent antitumor effects by targeting bromodomain-containing proteins [ 169 170 171 Furthermore, BETi regulate immune checkpoint pathways, notably PD-L1 (encoded by CD274), a direct transcriptional target of BRD4 [ 172 173 In summary, BETi’s role in immunotherapy of gynecological cancers, particularly ovarian cancer, lies in their multifaceted ability to target epigenetic regulation and the TIME. From inducing tumor cell apoptosis and reducing metastases to reprogramming macrophages, modulating Tregs, and suppressing PD-L1, BETi like i-BET151, ABBV-075, and JQ1 offer a comprehensive strategy to enhance antitumor immunity (Fig. 4 Fig. 4 Mechanistic overview of EZH2-mediated epigenetic regulation and its immunotherapeutic implications in gynecological cancers. EZH2, a core component of the PRC2 complex, catalyzes H3K27me3 to silence tumor suppressor genes, such as TIMP2, thereby enhancing PD-L1 expression through NF-κB activation and promoting immune evasion. EZH2 also modulates promoter methylation dynamics, influencing chemokine expression like CCL22 and CXCL10, which shapes the immune microenvironment by recruiting immunosuppressive cells, Tregs and M2 macrophages, or enhancing cytotoxic lymphocyte infiltration. Inhibition of EZH2 and co-regulators like USP7 or G9A reverses these effects—restoring immune surveillance, reducing TAM polarization, and enhancing CAR-T cell efficacy. This positions EZH2 inhibition as a dual-action strategy targeting both tumor-intrinsic growth and immune evasion pathways in gynecological malignancies EZH2i: an inhibitor of histone methyltransferase Epigenetic regulation plays a pivotal role in the carcinogenesis of gynecological cancers, with Enhancer of zeste homolog 2 (EZH2) emerging as a critical epigenetic modulator. As the catalytic subunit of Polycomb Repressive Complex 2 (PRC2), EZH2 mediates H3K27me3, silencing tumor suppressor genes while promoting cell proliferation, migration, and immune evasion [ 174 175 176 177 The role of EZH2 in modulating the TIME extends to ovarian cancer, where its inhibition synergizes with other epigenetic therapies to reshape immune landscapes. Dual blockade of EZH2 and the histone methyltransferase G9A (using inhibitors like HKMTI-1–005) has been shown to reprogram the TIME by increasing cytotoxic lymphocytes and NK cells while depleting immunosuppressive Tregs and TAMs. This combinatorial approach also impedes monocyte-to-macrophage differentiation and downregulates MARCO, a macrophage receptor linked to pro-tumor polarization. Transcriptomic analyses reveal that dual EZH2/G9A inhibition activates endogenous retroviruses (ERVs) and chemokine networks like as CXCL10, fostering a more immunogenic milieu. These findings underscore the dual utility of EZH2 inhibitors: they not only suppress tumor-intrinsic proliferation but also remodel the TIME to favor immune-mediated clearance, offering a strategic advantage in immunotherapy-resistant ovarian cancer [ 178 179 In summary, EZH2 inhibitors hold transformative potential in gynecological cancer therapy by reshaping the TIME and augmenting immunotherapy. As shown in Fig. 5 Fig. 5 Mechanistic overview of EZH2-mediated epigenetic regulation and its immunotherapeutic implications in gynecological cancers. EZH2, a core component of the PRC2 complex, catalyzes H3K27me3 to silence tumor suppressor genes, such as TIMP2, thereby enhancing PD-L1 expression through NF-κB activation and promoting immune evasion. EZH2 also modulates promoter methylation dynamics, influencing chemokine expression like CCL22 and CXCL10, which shapes the immune microenvironment by recruiting immunosuppressive cells, Tregs and M2 macrophages, or enhancing cytotoxic lymphocyte infiltration. Inhibition of EZH2 and co-regulators like USP7 or G9A reverses these effects—restoring immune surveillance, reducing TAM polarization, and enhancing CAR-T cell efficacy. This positions EZH2 inhibition as a dual-action strategy targeting both tumor-intrinsic growth and immune evasion pathways in gynecological malignancies LSD1 Lysine-specific histone demethylase 1 (LSD1/KDM1A), the first histone demethylase identified, plays a pivotal role in the epigenetic regulation of gene expression and is frequently dysregulated in gynecological cancers such as cervical and ovarian cancers [ 180 181 182 183 LSD1 exerts direct and indirect regulatory effects on immune checkpoints, notably CD47 and PD-L1, which mediate tumor immune escape via the SIRPα/CD47 and PD-1/PD-L1 pathways, respectively [ 184 185 In ovarian cancer, moderate overexpression of LSD1, particularly in stage IIIC and high-grade tumors, is linked to aggressive tumor signatures, including upregulated cell cycle genes and downregulated immune response genes, which correlate with poorer survival in some cohorts [ 186 187 Acetylation plays a critical role in immunotherapy by modulating chromatin accessibility and gene expression within the TIME. While LSD1 primarily regulates methylation, its inhibition indirectly influences acetylation dynamics through interactions with HDACs and SWI/SNF complexes, which recruit acetyltransferases [ 188 189 LSD1’s multifaceted role in gynecological cancers bridges epigenetic regulation and immune modulation. Its inhibition not only disrupts tumor-promoting methylation but also enhances acetylation-dependent immunogenicity, reshaping the TIME to favor immune surveillance. By targeting LSD1, particularly in combination with checkpoint inhibitors, therapeutic strategies can exploit these epigenetic-immune axes to improve outcomes in cervical and ovarian cancers. The interplay between LSD1, SWI/SNF, and acetylation underscores a promising frontier for precision immunotherapy, warranting further exploration in clinical settings. Therapeutic approach Epidrugs and ICIs Immunotherapy approaches that target the PD-L1/PD-1 pathway have shown impressive results in treating various cancers. However, due to the diverse nature of tumors and individual immune responses, PD-L1/PD-1 inhibitors often yield slow response rates in many patients [ 190 191 192 In gynecological cancers, particularly ovarian HGSC, epidrugs such as azacitidine and HDAC inhibitors play a pivotal role in ICI therapy by counteracting the immunosuppressive TME [ 193 194 NCT02900560 195 196 The role of specific HDAC inhibitors, such as ACY1215, an HDAC6 inhibitor, further illustrates epidrugs’ therapeutic potential in ICI therapy for gynecological cancers with ARID1A mutations [ 197 198 197 Beyond anti-PD-1 therapy, epidrugs like decitabine demonstrate synergy with anti-CTLA-4 in epithelial ovarian cancer, as evidenced by orthotopic mouse models using the BR5FVB1-Akt cell line. Decitabine treatment upregulates immune-related genes, including CCL2, CCL5, CXCL10, and Tnfsf18 (GitrL), which enhance NK and CD8 + T cell infiltration And function. This leads to reduced tumor growth, delayed ascites formation, And fewer MDSCs, with 40% of treated mice achieving complete responses. The combination of decitabine and anti-CTLA-4 sustains a prolonged cytotoxic lymphocyte response, increasing IFNγ and TNFα production and promoting effector T cell differentiation. DAC also induces CD80 expression on cancer cells, amplifying tumor-specific cytotoxic T lymphocyte responses. These effects are distinct from azacitidine, as decitabine directly augments NK cell cytotoxicity without impairing function, further emphasizing epidrugs’ versatility in enhancing immunotherapy by modulating both innate and adaptive immunity [ 170 In conclusion, epidrugs such as azacitidine, decitabine, and HDAC inhibitors significantly enhance ICI therapy in gynecological cancers by reprogramming the immunosuppressive TME, upregulating immune-related genes, and promoting effector T and NK cell infiltration and activity. These agents demonstrate particular promise in ARID1A-mutated tumors and platinum-resistant ovarian cancers, offering a robust strategy to overcome immunotherapy resistance (Table 3 Table 3 Epigenetic drug combinations and their immunomodulatory effects in ovarian cancer Epigenetic drugs Immunotherapy Dosage Combination immunotherapy Immune Target of Epidrug Cancer and cell types Study highlights Ref Nexturastat A 5-azacytidine HDAC6i DNMTi Varying levels 500 nM ICI: anti-PD-1 ↑Type I interferon response, ↑cytokine and chemokine expression, and ↑MHC I antigen presentation complex, ↑IFNg + CD8, NK, and NKT ↓MDSCs and PD-1 hi Ovarian A2780, Hey, Kuramochi, TykNu, SKOV3, IGROV-1 CR, SKOV3 CR In vitro and in vivo “Combining DNMTi and HDAC6i in ovarian cancer cell lines enhanced immunogenicity, increasing type I interferon signaling, cytokine production, and MHC I expression more than either treatment alone. However, in the ID8 MOSE Trp53 −/− mouse model, this combination only modestly improved survival while promoting a more immunogenic tumor microenvironment Adding anti-PD-1 therapy did not improve outcomes, likely due to the extremely high PD-L1 levels induced by the DNMTi + HDAC6i combination, which may have hindered the efficacy of immune checkpoint blockade.” [ 21 Azacitidine DNMTi ICI: anti-CTLA4 and anti-PD-1 ↑β2 microglobulin (β2m), CTLA4, PD-1, PD-L1 High-grade serous ovarian cancer (HGSOC) KURAMOCHI, OVSAHO, COV362, OVCAR4, COV318, TYKNU, OVKATE, and OAW28 In vitro “Sequential azacitidine and platinum-based chemotherapy on HGSOC can increase expression of transcripts associated with immune responses, whilst occurring in parallel to decreased proliferation and/or increased cell death, therefore priming platinum-resistant HGSOC for increased response to CPI immunotherapy.” [ 215 5-azacytidine Givinostat DNMTi HDACi ICI: anti-PD-1 ↑T and NK cells, ↓macrophages Ovarian MOSEC, Roby-ID8-luc2, Roby-ID8-nonluc, and ID8-VEGF-defensin In vitro and in vivo “Combining 5-azacytidine and givinostat enhances ovarian cancer response to immune checkpoint blockade by modulating both tumor cells, inducing immune gene upregulation, apoptosis, and interferon signaling, and immune cells, activating T/NK cells and reducing macrophages in the tumor microenvironment, ultimately reducing tumor burden and improving survival in immunocompetent mouse models.” [ 216 UNC0642, EZM8266 Euchromatic histone lysine methyltransferases 1/2 inhibitor(EHMT1/2i) 1 μmol/L ↑CD8 T-cell Ovarian PEO1, Kuramochi, OVCA420, and HGS2 In vitro and in vivo “Combinatory EHMT and PARP inhibition stimulates a cell-autologous immune response in vitro, is an effective therapy for reducing PARPi-resistant ovarian tumor growth in vivo, and promotes antitumor immunity activity in the tumor microenvironment of patient-derived ex vivo ovarian cancer tissues.” [ 163 Entinostat, Givinostat 5-azacytidine HDAC6i DNMTi ICI: anti-PD-1 ↑T and NK cells ↓MDSCs HGSC In vitro and in vivo “Tumor cells treated with AZA effectively recruit a higher number of immune cells to the tumor ascites. HDACis and anti-PD1 are less effective in this regard when administered as single agents; however, this effect is significantly enhanced when used in combination with a demethylating agent.” [ 194 5-azacytidine DNMTi ICI: Pembrolizumab (anti-PD-1) ↑IFNG, ↑CXCL13, ↑CXCR5, ↑CD8 T cell and NK cell Ovarian Phase II clinical trial “The combination of azacitidine and pembrolizumab reshapes the tumor microenvironment by enhancing inflammatory and immune responses, potentially improving efficacy in platinum-resistant ovarian cancer” [ 195 Decitabine DNMTi 1.0 mg/kg ICI: anti-CTLA-4 ↑NK cells, CD8 + Ovarian BR5FVB1-Akt In vitro and in vivo “Low-dose decitabine treatment increases the expression of chemokines that recruit NK cells and CD8 + [ 217 Decitabine DNMTi 1 μM daily CAR-T cells chondroitin sulfate proteoglycan 4 (CSPG4) Ovarian SKOV-3, Caov-3 In vitro “Decitabine-mediated upregulation of CSPG4 on SKOV-3 ovarian cancer cells enables antigen-specific targeting using CSPG4-CAR-T cells resulting in effective CSPG4-directed target cell killing even in the presence of Decitabine.” [ 210 Decitabine DNMTi 0.015–32 μΜ ↑MHC-class I and ↑PD-L1, ↑IFN-related genes Cervical CaSki, C33A In vitro “Decitabine treatment significantly reduces cell viability, induces G2/M phase cell cycle arrest and apoptosis and increases response to chemotherapy. Furthermore, the prolonged upregulation of MHC-class I and PD-L1 in CC cells has been demonstrated.” [ 218 Decitabine DNMTi 1.25 mg/kg CD3, CD4 and CD8 + T cells, IFN-γ and MIP-1β Ovarian ID8-RFP In vitro and in vivo “ The outcome of combination treatment decitabine and selinexor was accompanied by an increase in granzyme B secretion in CD8 + T cells and by a significant release of all the macrophage and T cell cytokines.” [ 219 Entinostat HDACi 5 μM ICI: anti-PD-1 ↑IFNγ + + + + + + + + + Ovarian SKOV3, OVCAR5 and CAOV3 In vitro and in vivo “Niraparib, a PARPi, combined with Entinostat induced HRD-EXCUTE by activating the cGAS-STING pathway and increasing the histone acetylation. The combination therapy could enhance the cytotoxicity of immune cells and promote pro-immune cells infiltrating into ascites, resulting in inhibited ovarian cancer growth.” [ 220 ACY1215 HDACi 50 mg/kg daily ICI: anti-PD-L1 ↑IFNγ + Ovarian clear cell carcinoma OVCA429 In vitro and in vivo “Inhibition of HDAC6 synergizes with anti-PD-L1 immune checkpoint blockade in ovarian cancer with ARID1A inactivation. ARID1A directly repressed the transcription of CD274 [ 197 Vorinostat HDAC6i 10 nM ↓IL-10, ↓CD206, ↓M2 macrophage polarization Endometrial IOSE, 12Z, TOV-21 G, TOV-112D In vitro and in vivo “ARID1A6488delG/HDAC6 induced M2 polarization of macrophages through the production of IL-10. Vorinostat inhibited cell growth and blocked the activity of HDAC6, significantly reducing the size of ovarian tumors by inhibiting the polarization of M2 macrophages in mice.” [ 221 Vorinostat HDAC6i 10 μM ↑MHC Class I Polypeptide-Related Sequence A (MICA), ↑NK cell-mediated killing of cancer cells Cervical SiHa and HeLa In vitro and in vivo “Vorinostat suppressed the proliferation, migration, and invasion of cervical cancer cells while inducing apoptosis and S-phase cell-cycle arrest, downregulating the PI3K/Akt signaling pathway, upregulating MICA expression both in vitro and in vivo, and enhancing NK-92 cell-mediated cytotoxicity by modulating the PI3K/Akt pathway.” [ 222 Vorinostat HDAC6i 2.5 µmol/l AA98: an anti-CD146 monoclonal antibody ↑CD146 Ovarian A2780, SKOV3 and Caov3 In vitro and in vivo “Targeting CD146 substantially enhanced vorinostat-induced killing by suppressing the activation of Akt pathways in ovarian cancer cells. AA98, in combination with vorinostat, significantly inhibited cell proliferation and increased apoptosis. In vivo, AA98 synergized with vorinostat to inhibit tumor growth and prolong survival in ovarian cancer.” [ 204 Romidepsin HDAC6i CAR-T cells ↑IFN- γ, ↑IL-2, ↑killer cell lectin-like receptor subfamily K member 1 ligands (NKG2DL), ↑pore-forming protein (PFP) Ovarian serous cystadenocarcinoma SKOV3 In vitro “Upregulating the expression of antigens of ovarian cancer cells can enhance the cytotoxicity of CAR-T cells. Targeting NKG2DL by NKG2D-NKG2DL binding in CAR-T cell design is promising when combined with romidepsin.” [ 212 Panobinostat HDACi 50 nM T cell, CD274/PD-L1, TNFSF9 and IL-8, CXCL3 HGSOC SKOV-3 In vitro “Olaparib And panobinostat treatment significantly reduced the expression of 20 genes, including BRCA1, BRCA2, and WEE1. Examples of other significantly enriched functional pathways were cytokine secretion, inflammatory response genes, T cell activation, and immune cell recruitment. Consistent with these RNA-seq data, the combined treatment significantly reduced ID8-luc tumor burden and cell growth, while increasing apoptosis and DNA damage.” [ 223 Epidrugs and monoclonal antibodies Epigenetic modulators, or epidrugs, have emerged as promising agents in enhancing the efficacy of monoclonal antibody (mAb) therapies across various cancers, including hematological malignancies [ 199 200 201 In gynecological cancers, particularly ovarian cancer, HDACis like vorinostat have shown significant promise as second-line therapies due to their tumor-specific action [ 202 203 204 205 The integration of epidrugs like HDACis with mAb therapies in gynecological cancers represents a novel therapeutic frontier. By targeting protective mechanisms such as CD146 induction and modulating key signaling pathways like Akt, these combinations can overcome drug resistance and enhance tumor cell killing. However, the development of optimal HDACi-based regimens requires rigorous clinical trials to refine dosing and combination strategies, as current approaches remain largely empirical. Preclinical studies, such as those combining vorinostat and AA98, provide a foundation for designing mechanism-based therapies that maximize the immunotherapeutic potential of epidrugs. Continued research into epigenetic-immunotherapy synergies will be crucial for improving outcomes in patients with advanced gynecological cancers (Table 4 Table 4 Summary of clinical trials evaluating epigenetic therapies in gynecological cancers Drug Class Drug(s) Cancer Type Trial Phase Status Key Outcomes PMID HDAC Inhibitor Belinostat Ovarian (EOC, LMP) II Completed PR: 1 (LMP, unconfirmed), SD: 10 (LMP), 9 (EOC), Median PFS: 13.4 months (LMP), 2.3 months (EOC) 20,304,628 HDAC Inhibitor Vorinostat + Carboplatin + Paclitaxel Ovarian (Platinum-Sensitive) II Completed ORR: 62.2%, CR: 14, PR: 19, Median PFS: 11.6 months, Median OS: 40.6 months 38,337,591 HDAC Inhibitor Belinostat + Carboplatin + Paclitaxel Ovarian (EOC) Ib/II Completed ORR: 43%, CR: 3, PR: 12, Median PFS: 48% at 6 months 22,694,911 DNA Hypomethylating Agent Decitabine + Carboplatin Ovarian (Partially Platinum-Sensitive) II Completed ORR: 6/13 (combination) vs 9/14 (carboplatin alone), Median PFS: not reported 24,642,620 BET Inhibitor RO6870810 + Atezolizumab Ovarian, TNBC Ib Terminated PR: 2 (5.6%), Limited antitumor activity, High immune-related AEs 40,102,759 Immune Checkpoint Inhibitor Pembrolizumab Endometrial (MSI-H) II Completed ORR: 58%, 100% (Lynch-like) vs 44% (sporadic), Median PFS: 100% vs 30% at 3 years 33,932,502 Epidrugs and CAR-T cells therapy Epigenetic modifications play a pivotal role in regulating gene expression, and their dysregulation is a hallmark of many cancers, including gynecological malignancies. Epidrugs, such as DNMTis and HDACis, have emerged as powerful tools to enhance the efficacy of immunotherapies, particularly CAR-T cell therapy, by modulating the tumor microenvironment and immune cell function [ 206 207 208 209 In gynecological cancers, particularly ovarian cancer, epidrugs such as decitabine And romidepsin have been instrumental in enhancing CAR T-cell therapy by upregulating target Antigens on tumor cells. Decitabine, a DNMTi, has been shown to induce the expression of chondroitin sulfate proteoglycan 4 (CSPG4) on ovarian cancer cells, such as SKOV-3, in a dose-dependent manner. By demethylating the CSPG4 promoter, decitabine converts over 50% of treated ovarian cancer cells into CSPG4-positive targets, enabling effective targeting by CSPG4-specific CAR T-cells. This approach marks the first demonstration of de novo CSPG4 upregulation followed by successful CAR T-cell-mediated cytotoxicity, highlighting decitabine’s role in creating inducible secondary antigens for immunotherapy. Importantly, the antigen-specific killing of decitabine-treated ovarian cancer cells is not impaired by the presence of the drug, and optimal dosing regimens (1 µM Daily for 5–8 days) have been established to maximize CSPG4 expression [ 210 211 Similarly, romidepsin, an HDACi, has been utilized to enhance the expression of NKG2D ligands (NKG2DL), such as MICA/MICB, on ovarian cancer cells, thereby improving the efficacy of NKG2DL-targeting CAR T-cells. By increasing antigen density, romidepsin significantly enhances immune synapse formation, leading to near-saturation killing effects at high effector-to-target ratios. This approach not only boosts cytotoxicity but also allows for the use of fewer CAR T-cells, potentially reducing the risk of cytokine release syndrome, a major clinical challenge [ 212 213 214 Altogether, epidrugs like decitabine and romidepsin represent a transformative approach in gynecological CAR T-cell therapy by epigenetically reprogramming tumor cells to express target antigens, thereby enhancing the specificity and efficacy of engineered T-cells. Their ability to upregulate antigens such as CSPG4 and NKG2DL addresses the critical challenge of low antigen density in solid tumors, while their compatibility with combinational strategies offers hope for overcoming tumor heterogeneity (Table 3). Future research should focus on validating these findings in vivo, particularly through comprehensive screening of primary ovarian cancer cells for epidrugs’ inducibility and assessing off-tumor effects in normal tissues. Integrating epidrugs with immune checkpoint inhibitors and advanced CAR T-cell engineering platforms, such as mRNA-based or dual-targeting systems, holds promise for developing more effective and safer immunotherapies. By harnessing the power of epigenetic regulation, epidrugs pave the way for personalized and precise treatments for gynecological cancers, potentially improving outcomes for patients with limited therapeutic options. Clinical trials Gynecological cancers, including ovarian and endometrial carcinomas, pose significant therapeutic challenges due to their resistance to conventional treatments like chemotherapy and radiation [ 3 224 225 226 227 228 When combined with immunotherapy, epidrugs aim to reprogram the tumor microenvironment to enhance immune recognition and overcome resistance to ICIs [ 229 NCT02901899 72 230 The complexity of epidrug-immunotherapy combinations is further highlighted by biomarker-driven studies. A phase II study ( NCT02899793 231 In conclusion, epidrugs offer significant potential in gynecological immunotherapy by altering epigenetic barriers to immune activation and sensitizing tumors to ICIs and chemotherapy. Clinical trials demonstrate modest efficacy but highlight challenges, including toxicity and context-dependent outcomes. Future efforts should focus on optimizing epidrug regimens, leveraging biomarkers for patient selection, and developing safer combinations to improve therapeutic outcomes in gynecological cancers. Conclusion and perspective The integration of epigenetic regulation into immunotherapy strategies has ushered in a transformative era, redefining therapeutic approaches for these cancers. This review has comprehensively explored the critical role of epigenetic modifications encompassing DNA methylation, histone acetylation, histone methylation, RNA methylation, and histone lactylation in shaping the TIME and enhancing the efficacy of immunotherapies such as ICIs, cancer vaccines, cytokine-based therapies, and CAR T-cell therapies. By dynamically modulating immune cell infiltration, antigen presentation, immune checkpoint expression, and tumor immunogenicity, epigenetic mechanisms provide a robust framework for overcoming immunoresistance and improving clinical outcomes. The evidence highlights the immunosuppressive consequences of aberrant epigenetic alterations, such as hypermethylation of immune-activating genes (e.g., IFN-γ, TAP1) and hypoacetylation driven by HDACs, which impair anti-tumor immunity in gynecological cancers. Conversely, hypomethylation of immunosuppressive genes like as VTCN1 and PD-L1 and acetylation-driven activation of immune checkpoints facilitate immune evasion. Preclinical and clinical studies demonstrate that epigenetic inhibitors, including DNMTi, HDACi, and BET inhibitors, can reprogram the TIME to enhance tumor immunogenicity. For example, DNMTi such as guadecitabine upregulate interferon pathways and neoantigen expression, sensitizing tumors to PD-1/PD-L1 blockade, while HDACi like vorinostat and belinostat restore MHC class II expression and promote CD8 + T-cell infiltration (Table 2 3 However, significant Limitations And challenges hinder the seamless translation of epigenetic-immunotherapy combinations into routine clinical practice. First, clinical trials have revealed variable efficacy And toxicity profiles. For instance, the phase II study combining guadecitabine with pembrolizumab in platinum-resistant ovarian cancer reported a modest response rate of 6.6%, with only two partial responses, despite evidence of immune priming through LINE1 hypomethylation And increased cytotoxic T-cell activity. Similarly, the phase 1b study of the BET inhibitor RO6870810 with atezolizumab was terminated early due to severe immune-related adverse events, including systemic immune activation, And a lack of synergistic Antitumor effects, with a response rate of only 5.6%. These findings underscore the challenge of achieving optimal therapeutic synergy while managing toxicity, which may arise from non-specific epigenetic modulation or unintended immune suppression. Second, the context-dependent effects of epidrugs, influenced by tumor subtype, epigenetic profile, and immune landscape, complicate their application. For example, the efficacy of DNMTi varies between hypermethylated and hypomethylated ovarian cancer subtypes, and the immunosuppressive effects of BET inhibitors in some settings highlight the need for precise patient stratification. Third, suboptimal dosing and delivery remain critical barriers. The early termination of a trial combining decitabine with carboplatin due to high toxicity (60% grade 3/4 neutropenia) and reduced efficacy illustrates the difficulty in balancing epigenetic reprogramming with tolerable pharmacokinetics. Tumor penetration challenges further limit the ability of epidrugs to effectively target the TIME, particularly in solid tumors with dense stromal barriers. Fourth, the lack of robust biomarkers to predict response to epigenetic-immunotherapy combinations hampers personalized treatment. While MSI-H endometrial cancers and high tumor mutational burden are associated with better ICI responses, epigenetic biomarkers remain underexplored, and their integration into clinical decision-making is nascent. Finally, the complexity of the TIME, driven by interactions between epigenetic modifications, metabolic reprogramming (e.g., Warburg effect, lactate-driven histone lactylation), and immune cell dynamics, poses a challenge in designing combination therapies that comprehensively address all immunosuppressive mechanisms. These limitations highlight the need for rigorous optimization of epidrug regimens, improved delivery systems, and advanced biomarker discovery to maximize clinical impact. Looking forward, the future of immunoepigenetic strategies in gynecological cancers lies in precision oncology. Advances in high-throughput sequencing, spatial transcriptomics, and multi-omics integration offer unprecedented opportunities to map epigenetic landscapes and their interactions with immune components, facilitating the identification of novel biomarkers and therapeutic targets. The development of next-generation epidrugs with enhanced specificity, such as selective HDAC6 inhibitors or EZH2 inhibitors, promises to minimize off-target effects and improve therapeutic indices. Furthermore, integrating epigenetic therapies with emerging immunotherapies, such as bispecific antibodies such as cadonilimab and dual-target CAR-T cells, could address tumor heterogeneity and antigen escape, enhancing response durability. Multi-omics approaches, combining epigenomic, transcriptomic, and proteomic data, will be crucial in elucidating the molecular underpinnings of immunotherapy resistance and tailoring combination regimens to individual patients. Additionally, innovative drug delivery systems, such as nanoparticle-based carriers, could improve tumor penetration and reduce systemic toxicity, addressing current limitations in epidrug administration. In conclusion, the convergence of epigenetic regulation and immunotherapy represents a paradigm shift in the management of gynecological cancers. By targeting epigenetic mechanisms to reprogram the TIME, these strategies offer a promising avenue to overcome resistance, enhance anti-tumor immunity, and improve survival outcomes. Despite challenges in efficacy, toxicity, and biomarker development, continued investment in translational research, clinical trials, and precision medicine approaches will be essential to fully realize the potential of immunoepigenetic therapies. As the field advances, the integration of epigenetic interventions with immunotherapy holds the promise of transforming gynecological oncology, delivering personalized, effective, and durable treatments to patients facing these devastating diseases. Declaration of generative AI and AI-assisted technologies in the writing process During the preparation of this work, the authors used ChatGPT by OpenAI to improve paper readability. After using this tool/service, the authors reviewed and edited the content as needed and took full responsibility for the publication's content. Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements None. Authors'contributions CZ and YL wrote the article; CZ prepared the figures and tables; ZC designed and revised the article. All the authors studied and approved the final manuscript. The authors declare that all data were generated in-house and that no paper mill was used. Funding Not applicable. Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Priyadarshini S, Swain PK, Agarwal K, Jena D, Padhee S. Trends in gynecological cancer incidence, mortality, and survival among elderly women: A SEER study. AGING Med 2024;7:179–88. 10.1002/agm2.12297. 10.1002/agm2.12297 PMC11077337 38725691 2. Fabbro M, Colombo P-E, Leaha CM, Rouanet P, Carrère S, Quenet F, et al. Conditional Probability of Survival and Prognostic Factors in Long-Term Survivors of High-Grade Serous Ovarian Cancer. Cancers (Basel) 2020;12. 10.3390/cancers12082184. 10.3390/cancers12082184 PMC7465919 32764409 3. Zhang C Sheng Y Sun X Wang Y New insights for gynecological cancer therapies: from molecular mechanisms and clinical evidence to future directions Cancer Metastasis Rev 2023 42 891 925 10.1007/s10555-023-10113-2 37368179 PMC10584725 Zhang C, Sheng Y, Sun X, Wang Y. New insights for gynecological cancer therapies: from molecular mechanisms and clinical evidence to future directions. Cancer Metastasis Rev. 2023;42:891–925. 10.1007/s10555-023-10113-2. 37368179 10.1007/s10555-023-10113-2 PMC10584725 4. Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 209 249 33538338 10.3322/caac.21660 Sung H, Ferlay J, Siegel RL, Laversanne M, Soerjomataram I, Jemal A, et al. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2021;71:209–49. 33538338 10.3322/caac.21660 5. S TK. Cervical Cancer. N Engl J Med 2025;392:56–71. 10.1056/NEJMra2404457. 10.1056/NEJMra2404457 39752299 6. Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 229 263 10.3322/caac.21834 38572751 Bray F, Laversanne M, Sung H, Ferlay J, Siegel RL, Soerjomataram I, et al. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2024;74:229–63. 10.3322/caac.21834. 38572751 10.3322/caac.21834 7. Dang T Guan X Cui L Ruan Y Chen Z Zou H Epigenetics and immunotherapy in colorectal cancer: progress and promise Clin Epigenetics 2024 16 123 10.1186/s13148-024-01740-9 39252116 PMC11385519 Dang T, Guan X, Cui L, Ruan Y, Chen Z, Zou H, et al. Epigenetics and immunotherapy in colorectal cancer: progress and promise. Clin Epigenetics. 2024;16:123. 10.1186/s13148-024-01740-9. 39252116 10.1186/s13148-024-01740-9 PMC11385519 8. Chang H Wang D Xia W Pan X Huo W Xu S Epigenetic disruption and glucose homeostasis changes following low-dose maternal bisphenol A exposure Toxicol Res (Camb) 2016 5 1400 1409 10.1039/c6tx00047a 30090444 PMC6061978 Chang H, Wang D, Xia W, Pan X, Huo W, Xu S, et al. Epigenetic disruption and glucose homeostasis changes following low-dose maternal bisphenol A exposure. Toxicol Res (Camb). 2016;5:1400–9. 10.1039/c6tx00047a. 30090444 10.1039/c6tx00047a PMC6061978 9. Yano M Yasuda M Sakaki M Nagata K Fujino T Arai E Association of histone deacetylase expression with histology and prognosis of ovarian cancer Oncol Lett 2018 15 3524 3531 10.3892/ol.2018.7726 29456726 PMC5795841 Yano M, Yasuda M, Sakaki M, Nagata K, Fujino T, Arai E, et al. Association of histone deacetylase expression with histology and prognosis of ovarian cancer. Oncol Lett. 2018;15:3524–31. 10.3892/ol.2018.7726. 29456726 10.3892/ol.2018.7726 PMC5795841 10. Ramarao-Milne P, Kondrashova O, Barry S, Hooper JD, Lee JS, Waddell N. Histone Modifying Enzymes in Gynaecological Cancers. Cancers (Basel) 2021;13. 10.3390/cancers13040816. 10.3390/cancers13040816 PMC7919659 33669182 11. Jiang Y Yuan Y Chen M Li S Bai J Zhang Y PRMT5 disruption drives antitumor immunity in cervical cancer by reprogramming T cell-mediated response and regulating PD-L1 expression Theranostics 2021 11 9162 9176 10.7150/thno.59605 34522232 PMC8419032 Jiang Y, Yuan Y, Chen M, Li S, Bai J, Zhang Y, et al. PRMT5 disruption drives antitumor immunity in cervical cancer by reprogramming T cell-mediated response and regulating PD-L1 expression. Theranostics. 2021;11:9162–76. 10.7150/thno.59605. 34522232 10.7150/thno.59605 PMC8419032 12. Chan S, Cheng A, La Thangue N, Kerr D. Epigenetic therapeutics to overcome resistance against immune checkpoint inhibitors (ICI) in hepatocellular carcinoma (HCC): a proof-of-concept clinical trial. Lancet Reg Heal – West Pacific 2025;55. 10.1016/j.lanwpc.2024.101425. 13. You L, Han Q, Zhu L, Zhu Y, Bao C, Yang C, et al. Decitabine-Mediated Epigenetic Reprograming Enhances Anti-leukemia Efficacy of CD123-Targeted Chimeric Antigen Receptor T-Cells. Front Immunol 2020;11. 10.3389/fimmu.2020.01787 PMC7461863 32973749 14. Kartikasari AER, Prakash MD, Cox M, Wilson K, Boer JC, Cauchi JA, et al. Therapeutic Cancer Vaccines—T Cell Responses and Epigenetic Modulation. Front Immunol 2019;9. 10.3389/fimmu.2018.03109 PMC6357987 30740111 15. Cacan E Epigenetic-mediated immune suppression of positive co-stimulatory molecules in chemoresistant ovarian cancer cells Cell Biol Int 2017 41 328 339 10.1002/cbin.10729 28074529 Cacan E. Epigenetic-mediated immune suppression of positive co-stimulatory molecules in chemoresistant ovarian cancer cells. Cell Biol Int. 2017;41:328–39. 10.1002/cbin.10729. 28074529 10.1002/cbin.10729 16. Yan M, Cao H, Tao K, Xiao B, Chu Y, Ma D, et al. HDACs alters negatively to the tumor immune microenvironment in gynecologic cancers. Gene 2023;885:147704. 10.1016/j.gene.2023.147704. 10.1016/j.gene.2023.147704 37572797 17. Ji Y Xiao C Fan T Deng Z Wang D Cai W The epigenetic hallmarks of immune cells in cancer Mol Cancer 2025 24 66 10.1186/s12943-025-02255-4 40038722 PMC11881328 Ji Y, Xiao C, Fan T, Deng Z, Wang D, Cai W, et al. The epigenetic hallmarks of immune cells in cancer. Mol Cancer. 2025;24:66. 10.1186/s12943-025-02255-4. 40038722 10.1186/s12943-025-02255-4 PMC11881328 18. Kim DJ. The Role of the DNA Methyltransferase Family and the Therapeutic Potential of DNMT Inhibitors in Tumor Treatment. Curr Oncol 2025;32. 10.3390/curroncol32020088. 10.3390/curroncol32020088 PMC11854558 39996888 19. Srivastava P Paluch BE Matsuzaki J James SR Collamat-Lai G Taverna P Immunomodulatory action of the DNA methyltransferase inhibitor SGI-110 in epithelial ovarian cancer cells and xenografts Epigenetics 2015 10 237 246 10.1080/15592294.2015.1017198 25793777 PMC4623048 Srivastava P, Paluch BE, Matsuzaki J, James SR, Collamat-Lai G, Taverna P, et al. Immunomodulatory action of the DNA methyltransferase inhibitor SGI-110 in epithelial ovarian cancer cells and xenografts. Epigenetics. 2015;10:237–46. 10.1080/15592294.2015.1017198. 25793777 10.1080/15592294.2015.1017198 PMC4623048 20. Stone ML Chiappinelli KB Li H Murphy LM Travers ME Topper MJ Epigenetic therapy activates type I interferon signaling in murine ovarian cancer to reduce immunosuppression and tumor burden Proc Natl Acad Sci 2017 114 E10981 E10990 10.1073/pnas.1712514114 29203668 PMC5754782 Stone ML, Chiappinelli KB, Li H, Murphy LM, Travers ME, Topper MJ, et al. Epigenetic therapy activates type I interferon signaling in murine ovarian cancer to reduce immunosuppression and tumor burden. Proc Natl Acad Sci. 2017;114:E10981–90. 10.1073/pnas.1712514114. 29203668 10.1073/pnas.1712514114 PMC5754782 21. Moufarrij S Srivastava A Gomez S Hadley M Palmer E Austin PT Combining DNMT and HDAC6 inhibitors increases anti-tumor immune signaling and decreases tumor burden in ovarian cancer Sci Rep 2020 10 3470 10.1038/s41598-020-60409-4 32103105 PMC7044433 Moufarrij S, Srivastava A, Gomez S, Hadley M, Palmer E, Austin PT, et al. Combining DNMT and HDAC6 inhibitors increases anti-tumor immune signaling and decreases tumor burden in ovarian cancer. Sci Rep. 2020;10:3470. 10.1038/s41598-020-60409-4. 32103105 10.1038/s41598-020-60409-4 PMC7044433 22. Shi W-Y, Cao C, Liu L. Interferon α Induces the Apoptosis of Cervical Cancer HeLa Cells by Activating both the Intrinsic Mitochondrial Pathway and Endoplasmic Reticulum Stress-Induced Pathway. Int J Mol Sci 2016;17. 10.3390/ijms17111832. 10.3390/ijms17111832 PMC5133833 27827850 23. Green DS Husain SR Johnson CL Sato Y Han J Joshi B Combination immunotherapy with IL-4 Pseudomonas exotoxin and IFN-α and IFN-γ mediate antitumor effects in vitro and in a mouse model of human ovarian cancer Immunotherapy 2019 11 483 496 10.2217/imt-2018-0158 30860437 PMC6439502 Green DS, Husain SR, Johnson CL, Sato Y, Han J, Joshi B, et al. Combination immunotherapy with IL-4 Pseudomonas exotoxin and IFN-α and IFN-γ mediate antitumor effects in vitro and in a mouse model of human ovarian cancer. Immunotherapy. 2019;11:483–96. 10.2217/imt-2018-0158. 30860437 10.2217/imt-2018-0158 PMC6439502 24. Windbichler GH Hausmaninger H Stummvoll W Graf AH Kainz C Lahodny J Interferon-gamma in the first-line therapy of ovarian cancer: a randomized phase III trial Br J Cancer 2000 82 1138 1144 10.1054/bjoc.1999.1053 10735496 PMC2363351 Windbichler GH, Hausmaninger H, Stummvoll W, Graf AH, Kainz C, Lahodny J, et al. Interferon-gamma in the first-line therapy of ovarian cancer: a randomized phase III trial. Br J Cancer. 2000;82:1138–44. 10.1054/bjoc.1999.1053. 10735496 10.1054/bjoc.1999.1053 PMC2363351 25. Green DS Ning F Duemler A Myers TG Trewhitt K Ekwede I Intraperitoneal Monocytes plus IFNs as a Novel Cellular Immunotherapy for Ovarian Cancer: Mechanistic Characterization and Results from a Phase I Clinical Trial Clin Cancer Res an Off J Am Assoc Cancer Res 2023 29 349 363 10.1158/1078-0432.CCR-22-1893 PMC9851980 36099324 Green DS, Ning F, Duemler A, Myers TG, Trewhitt K, Ekwede I, et al. Intraperitoneal Monocytes plus IFNs as a Novel Cellular Immunotherapy for Ovarian Cancer: Mechanistic Characterization and Results from a Phase I Clinical Trial. Clin Cancer Res an Off J Am Assoc Cancer Res. 2023;29:349–63. 10.1158/1078-0432.CCR-22-1893. 10.1158/1078-0432.CCR-22-1893 PMC9851980 36099324 26. Wang B, Zhu Y, Zhang Y, Ru Z, Chen L, Zhang M, et al. Hyperactivity of the IL-33-ILC2s-IL-13-M-MDSCs axis promotes cervical cancer progression. Int Immunopharmacol 2025;144:113693. 10.1016/j.intimp.2024.113693. 10.1016/j.intimp.2024.113693 39615114 27. Zhou C Tuong ZK Frazer IH Papillomavirus Immune Evasion Strategies Target the Infected Cell and the Local Immune System Front Oncol 2019 9 682 10.3389/fonc.2019.00682 31428574 PMC6688195 Zhou C, Tuong ZK, Frazer IH. Papillomavirus Immune Evasion Strategies Target the Infected Cell and the Local Immune System. Front Oncol. 2019;9:682. 10.3389/fonc.2019.00682. 31428574 10.3389/fonc.2019.00682 PMC6688195 28. Bai Y Li H Lv R Interleukin-17 activates JAK2/STAT3, PI3K/Akt and nuclear factor-κB signaling pathway to promote the tumorigenesis of cervical cancer Exp Ther Med 2021 22 1291 10.3892/etm.2021.10726 34630646 PMC8461522 Bai Y, Li H, Lv R. Interleukin-17 activates JAK2/STAT3, PI3K/Akt and nuclear factor-κB signaling pathway to promote the tumorigenesis of cervical cancer. Exp Ther Med. 2021;22:1291. 10.3892/etm.2021.10726. 34630646 10.3892/etm.2021.10726 PMC8461522 29. Zeng X, Zhang Z, Gao Q-Q, Wang Y-Y, Yu X-Z, Zhou B, et al. Clinical Significance of Serum Interleukin-31 and Interleukin-33 Levels in Patients of Endometrial Cancer: A Case Control Study. Dis Markers 2016;2016:9262919. 10.1155/2016/9262919. 10.1155/2016/9262919 PMC4906189 27340318 30. Tanyi JL, Chiang CL-L, Chiffelle J, Thierry A-C, Baumgartener P, Huber F, et al. Personalized cancer vaccine strategy elicits polyfunctional T cells and demonstrates clinical benefits in ovarian cancer. Npj Vaccines 2021;6:36. 10.1038/s41541-021-00297-5. 10.1038/s41541-021-00297-5 PMC7960755 33723260 31. Koeneman BJ, Schreibelt G, Gorris MAJ, Hins - de Bree S, Westdorp H, Ottevanger PB, et al. Dendritic cell vaccination combined with carboplatin/paclitaxel for metastatic endometrial cancer patients: results of a phase I/II trial. Front Immunol 2024; 15. 10.3389/fimmu.2024.1368103 PMC10912556 38444861 32. Brown TA, Byrd K, Vreeland TJ, Clifton GT, Jackson DO, Hale DF, et al. Final analysis of a phase I/IIa trial of the folate-binding protein-derived E39 peptide vaccine to prevent recurrence in ovarian and endometrial cancer patients. Cancer Med 2019;8:4678–87. 10.1002/cam4.2378. 10.1002/cam4.2378 PMC6712444 31274231 33. Nasso C Silvia P Sara Elena R Veronica E Francesca R Ilaria C Immune checkpoint inhibitors in gynecological cancers: a narrative review on the practice-changing trials Immunotherapy 2025 17 57 66 10.1080/1750743X.2025.2460964 39893504 PMC11834418 Nasso C, Silvia P, Sara Elena R, Veronica E, Francesca R, Ilaria C, et al. Immune checkpoint inhibitors in gynecological cancers: a narrative review on the practice-changing trials. Immunotherapy. 2025;17:57–66. 10.1080/1750743X.2025.2460964. 39893504 10.1080/1750743X.2025.2460964 PMC11834418 34. Mony JT Zhang L Ma T Grabosch S Tirodkar TS Brozick J Anti-PD-L1 prolongs survival and triggers T cell but not humoral anti-tumor immune responses in a human MUC1-expressing preclinical ovarian cancer model Cancer Immunol Immunother 2015 64 1095 1108 10.1007/s00262-015-1712-6 25998800 PMC4545381 Mony JT, Zhang L, Ma T, Grabosch S, Tirodkar TS, Brozick J, et al. Anti-PD-L1 prolongs survival and triggers T cell but not humoral anti-tumor immune responses in a human MUC1-expressing preclinical ovarian cancer model. Cancer Immunol Immunother. 2015;64:1095–108. 10.1007/s00262-015-1712-6. 25998800 10.1007/s00262-015-1712-6 PMC4545381 35. Wang Y Han J Wang D Cai M Xu Y Hu Y Anti-PD-1 antibody armored γδ T cells enhance anti-tumor efficacy in ovarian cancer Signal Transduct Target Ther 2023 8 399 10.1038/s41392-023-01646-7 37857598 PMC10587135 Wang Y, Han J, Wang D, Cai M, Xu Y, Hu Y, et al. Anti-PD-1 antibody armored γδ T cells enhance anti-tumor efficacy in ovarian cancer. Signal Transduct Target Ther. 2023;8:399. 10.1038/s41392-023-01646-7. 37857598 10.1038/s41392-023-01646-7 PMC10587135 36. Jian X Zhang J Huang Y Duan J Linghu H Li R Early salvage therapy with anti-PD-1 antibody Camrelizumab in patients with advanced cervical cancer: a retrospective study Clin Transl Oncol 2025 27 693 698 10.1007/s12094-024-03610-5 39033255 Jian X, Zhang J, Huang Y, Duan J, Linghu H, Li R. Early salvage therapy with anti-PD-1 antibody Camrelizumab in patients with advanced cervical cancer: a retrospective study. Clin Transl Oncol. 2025;27:693–8. 10.1007/s12094-024-03610-5. 39033255 10.1007/s12094-024-03610-5 37. Yang J Yu H Zhang Y Zhu M Zhang M Wang Q Efficacy of PD-1 or PD-L1 inhibitors for the therapy of cervical cancer with varying PD-L1 expression levels: a single-arm meta-analysis Front Oncol 2024 14 1454372 10.3389/fonc.2024.1454372 39228980 PMC11368785 Yang J, Yu H, Zhang Y, Zhu M, Zhang M, Wang Q. Efficacy of PD-1 or PD-L1 inhibitors for the therapy of cervical cancer with varying PD-L1 expression levels: a single-arm meta-analysis. Front Oncol. 2024;14:1454372. 10.3389/fonc.2024.1454372. 39228980 10.3389/fonc.2024.1454372 PMC11368785 38. O’Malley DM, Oaknin A, Monk BJ, Selle F, Rojas C, Gladieff L, et al. Phase II study of the safety and efficacy of the anti-PD-1 antibody balstilimab in patients with recurrent and/or metastatic cervical cancer. Gynecol Oncol 2021;163:274–80. 10.1016/j.ygyno.2021.08.018. 10.1016/j.ygyno.2021.08.018 34452745 39. An J Tang J Li BX Xiong H Qiu H Luo L Efficacy and Safety of the Anti–PD-L1 mAb Socazolimab for Recurrent or Metastatic Cervical Cancer: a Phase I Dose-Escalation and Expansion Study Clin Cancer Res 2022 28 5098 5106 10.1158/1078-0432.CCR-22-1280 36136294 An J, Tang J, Li BX, Xiong H, Qiu H, Luo L, et al. Efficacy and Safety of the Anti–PD-L1 mAb Socazolimab for Recurrent or Metastatic Cervical Cancer: a Phase I Dose-Escalation and Expansion Study. Clin Cancer Res. 2022;28:5098–106. 10.1158/1078-0432.CCR-22-1280. 36136294 10.1158/1078-0432.CCR-22-1280 40. Oaknin A Anna VT Lucy G Vanessa S Cara M Jubilee B Clinical Activity and Safety of the Anti-PD-1 Monoclonal Antibody Dostarlimab for Patients with Recurrent or Advanced dMMR Endometrial Cancer Futur Oncol 2021 17 3781 3785 10.2217/fon-2021-0598 34427115 Oaknin A, Anna VT, Lucy G, Vanessa S, Cara M, Jubilee B, et al. Clinical Activity and Safety of the Anti-PD-1 Monoclonal Antibody Dostarlimab for Patients with Recurrent or Advanced dMMR Endometrial Cancer. Futur Oncol. 2021;17:3781–5. 10.2217/fon-2021-0598. 10.2217/fon-2021-0598 34427115 41. Berton D, Pautier P, Lorusso D, Gennigens C, Gladieff L, Kryzhanivska A, et al. Antitumor activity and safety of the PD-1 inhibitor retifanlimab in patients with recurrent microsatellite instability-high or deficient mismatch repair endometrial cancer: Final safety and efficacy results from cohort H of the POD1UM-101 phase I study. Gynecol Oncol 2024;186:191–8. 10.1016/j.ygyno.2024.05.025. 10.1016/j.ygyno.2024.05.025 38824752 42. Oaknin A Duska LR Sullivan RJ Pothuri B Ellard SL Leath CA III <strong>Preliminary safety, efficacy, and pharmacokinetic/pharmacodynamic characterization from GARNET, a phase I/II clinical trial of the anti–PD-1 monoclonal antibody, TSR-042, in patients with recurrent or advanced MSI-h and MSS endometrial canc Gynecol Oncol 2019 154 17 10.1016/j.ygyno.2019.04.044 Oaknin A, Duska LR, Sullivan RJ, Pothuri B, Ellard SL, Leath CA III, et al. <strong>Preliminary safety, efficacy, and pharmacokinetic/pharmacodynamic characterization from GARNET, a phase I/II clinical trial of the anti–PD-1 monoclonal antibody, TSR-042, in patients with recurrent or advanced MSI-h and MSS endometrial canc. Gynecol Oncol. 2019;154:17. 10.1016/j.ygyno.2019.04.044. 43. Shiravand Y Khodadadi F Kashani SMA Hosseini-Fard SR Hosseini S Sadeghirad H Immune Checkpoint Inhibitors in Cancer Therapy Curr Oncol 2022 29 3044 3060 10.3390/curroncol29050247 35621637 PMC9139602 Shiravand Y, Khodadadi F, Kashani SMA, Hosseini-Fard SR, Hosseini S, Sadeghirad H, et al. Immune Checkpoint Inhibitors in Cancer Therapy. Curr Oncol. 2022;29:3044–60. 10.3390/curroncol29050247. 35621637 10.3390/curroncol29050247 PMC9139602 44. Tosti G Cocorocchio E Pennacchioli E Anti-cytotoxic T lymphocyte antigen-4 antibodies in melanoma Clin Cosmet Investig Dermatol 2013 6 245 256 10.2147/CCID.S24246 24204168 PMC3804494 Tosti G, Cocorocchio E, Pennacchioli E. Anti-cytotoxic T lymphocyte antigen-4 antibodies in melanoma. Clin Cosmet Investig Dermatol. 2013;6:245–56. 10.2147/CCID.S24246. 24204168 10.2147/CCID.S24246 PMC3804494 45. Friese C Harbst K Borch TH Westergaard MCW Pedersen M Kverneland A CTLA-4 blockade boosts the expansion of tumor-reactive CD8+ tumor-infiltrating lymphocytes in ovarian cancer Sci Rep 2020 10 3914 10.1038/s41598-020-60738-4 32127601 PMC7054305 Friese C, Harbst K, Borch TH, Westergaard MCW, Pedersen M, Kverneland A, et al. CTLA-4 blockade boosts the expansion of tumor-reactive CD8+ tumor-infiltrating lymphocytes in ovarian cancer. Sci Rep. 2020;10:3914. 10.1038/s41598-020-60738-4. 32127601 10.1038/s41598-020-60738-4 PMC7054305 46. Stefanoudakis D, Karopoulou E, Matsas A, Katsampoula GA, Tsarna E, Stamoula E, et al. Immunotherapy in Cervical and Endometrial Cancer: Current Landscape and Future Directions. Life (Basel, Switzerland) 2024;14. 10.3390/life14030344. 10.3390/life14030344 PMC10971314 38541669 47. You W, Zhou Z, Li Z, Yan J, Wang Y. From foe to friend: Rewiring oncogenic pathways through artificial selenoprotein to combat immune-resistant tumor. J Pharm Anal 2025:101322. 10.1016/j.jpha.2025.101322. 48. O’Malley DM Oaknin A Monk BJ Leary A Selle F Alexandre J LBA34 Single-agent anti-PD-1 balstilimab or in combination with anti-CTLA-4 zalifrelimab for recurrent/metastatic (R/M) cervical cancer (CC): Preliminary results of two independent phase II trials Ann Oncol 2020 31 S1164 S1165 10.1016/j.annonc.2020.08.2264 O’Malley DM, Oaknin A, Monk BJ, Leary A, Selle F, Alexandre J, et al. LBA34 Single-agent anti-PD-1 balstilimab or in combination with anti-CTLA-4 zalifrelimab for recurrent/metastatic (R/M) cervical cancer (CC): Preliminary results of two independent phase II trials. Ann Oncol. 2020;31:S1164–5. 10.1016/j.annonc.2020.08.2264. 49. O’Malley DM Neffa M Monk BJ Melkadze T Huang M Kryzhanivska A Dual PD-1 and CTLA-4 Checkpoint Blockade Using Balstilimab and Zalifrelimab Combination as Second-Line Treatment for Advanced Cervical Cancer: An Open-Label Phase II Study J Clin Oncol 2021 40 762 771 10.1200/JCO.21.02067 34932394 PMC8887945 O’Malley DM, Neffa M, Monk BJ, Melkadze T, Huang M, Kryzhanivska A, et al. Dual PD-1 and CTLA-4 Checkpoint Blockade Using Balstilimab and Zalifrelimab Combination as Second-Line Treatment for Advanced Cervical Cancer: An Open-Label Phase II Study. J Clin Oncol. 2021;40:762–71. 10.1200/JCO.21.02067. 34932394 10.1200/JCO.21.02067 PMC8887945 50. Fan S Wang T Zhang Q Wang J Su J Liu Z Safety and clinical activity of cadonilimab, an anti PD-1/CTLA-4 bispecific antibody, for patients with persistent, recurrent, or metastatic cervical cancer (R/M CC): A retrospective, real-world study J Clin Oncol 2024 42 e17522 e17522 10.1200/JCO.2024.42.16_suppl.e17522 Fan S, Wang T, Zhang Q, Wang J, Su J, Liu Z. Safety and clinical activity of cadonilimab, an anti PD-1/CTLA-4 bispecific antibody, for patients with persistent, recurrent, or metastatic cervical cancer (R/M CC): A retrospective, real-world study. J Clin Oncol. 2024;42:e17522–e17522. 10.1200/JCO.2024.42.16_suppl.e17522. 51. Ribeiro de Souza B, Oliveira G, Leme G, Brum Reis I, Augusto Tossini Cabral F, Lima Baggio de Paula J, et al. Evaluation of PD-1/PD-L1 and CTLA-4 immune checkpoints and angiogenic activity in ovarian cancer after oncotherad immunotherapy associated to erythropoietin. J Clin Oncol 2025;40:e17560–e17560. 10.1200/JCO.2022.40.16_suppl.e17560. 52. Chae YK Othus M Patel SP Wilkinson KJ Whitman-Purves EM Lea J SWOG/NCI Phase II Dual Anti–CTLA-4/PD-1 Blockade in Rare Tumors: Nonepithelial Ovarian Cancer Clin Cancer Res 2024 30 5593 5600 10.1158/1078-0432.CCR-24-0606 39417692 PMC11737520 Chae YK, Othus M, Patel SP, Wilkinson KJ, Whitman-Purves EM, Lea J, et al. SWOG/NCI Phase II Dual Anti–CTLA-4/PD-1 Blockade in Rare Tumors: Nonepithelial Ovarian Cancer. Clin Cancer Res. 2024;30:5593–600. 10.1158/1078-0432.CCR-24-0606. 39417692 10.1158/1078-0432.CCR-24-0606 PMC11737520 53. Oh MS, Chae YK. Deep and Durable Response With Combination CTLA-4 and PD-1 Blockade in Mismatch Repair (MMR)-proficient Endometrial Cancer. J Immunother 2019;42. 10.1097/CJI.0000000000000244 30247204 54. Yuan Z Zu G Sun X Papasavvas E Lu L Cassel J Abstract 4185: Neutralizing human IFN-β combined with anti-human PD-L1 and anti-human CTLA-4 treatment increased control of endometrial tumor growth in a novel HLA-A matched BLT humanized mice Cancer Res 2024 84 4185 10.1158/1538-7445.AM2024-4185 Yuan Z, Zu G, Sun X, Papasavvas E, Lu L, Cassel J, et al. Abstract 4185: Neutralizing human IFN-β combined with anti-human PD-L1 and anti-human CTLA-4 treatment increased control of endometrial tumor growth in a novel HLA-A matched BLT humanized mice. Cancer Res. 2024;84:4185. 10.1158/1538-7445.AM2024-4185. 55. Xu M-Y Zeng N Liu C-Q Sun J-X An Y Zhang S-H Enhanced cellular therapy: revolutionizing adoptive cellular therapy Exp Hematol Oncol 2024 13 47 10.1186/s40164-024-00506-6 38664743 PMC11046957 Xu M-Y, Zeng N, Liu C-Q, Sun J-X, An Y, Zhang S-H, et al. Enhanced cellular therapy: revolutionizing adoptive cellular therapy. Exp Hematol Oncol. 2024;13:47. 10.1186/s40164-024-00506-6. 38664743 10.1186/s40164-024-00506-6 PMC11046957 56. Yao CD Davis KL Correlative studies reveal factors contributing to successful CAR-T cell therapies in cancer Cancer Metastasis Rev 2024 44 15 10.1007/s10555-024-10232-4 39625613 Yao CD, Davis KL. Correlative studies reveal factors contributing to successful CAR-T cell therapies in cancer. Cancer Metastasis Rev. 2024;44:15. 10.1007/s10555-024-10232-4. 39625613 10.1007/s10555-024-10232-4 57. Cutri-French C, Nasioudis D, George E, Tanyi JL. CAR-T Cell Therapy in Ovarian Cancer: Where Are We Now? Diagnostics 2024;14. 10.3390/diagnostics14080819. 10.3390/diagnostics14080819 PMC11049291 38667465 58. Smith ZD Hetzel S Meissner A DNA methylation in mammalian development and disease Nat Rev Genet 2025 26 7 30 10.1038/s41576-024-00760-8 39134824 Smith ZD, Hetzel S, Meissner A. DNA methylation in mammalian development and disease. Nat Rev Genet. 2025;26:7–30. 10.1038/s41576-024-00760-8. 39134824 10.1038/s41576-024-00760-8 59. Akhavan-Niaki H Samadani AA DNA Methylation and Cancer Development: Molecular Mechanism Cell Biochem Biophys 2013 67 501 513 10.1007/s12013-013-9555-2 23508887 Akhavan-Niaki H, Samadani AA. DNA Methylation and Cancer Development: Molecular Mechanism. Cell Biochem Biophys. 2013;67:501–13. 10.1007/s12013-013-9555-2. 23508887 10.1007/s12013-013-9555-2 60. Zhang X Zhang Y Wang C Wang X TET (Ten-eleven translocation) family proteins: structure, biological functions and applications Signal Transduct Target Ther 2023 8 297 10.1038/s41392-023-01537-x 37563110 PMC10415333 Zhang X, Zhang Y, Wang C, Wang X. TET (Ten-eleven translocation) family proteins: structure, biological functions and applications. Signal Transduct Target Ther. 2023;8:297. 10.1038/s41392-023-01537-x. 37563110 10.1038/s41392-023-01537-x PMC10415333 61. Schwarzenbach H, Gahan PB. DNA Methylation and Anticancer Drug Resistance in Gynecological Tumors . Cancer Screen Prev n.d.;1:47–63. 10.14218/CSP.2022.00004. 62. Kommoss FKF Stichel D Schrimpf D Kriegsmann M Tessier-Cloutier B Talhouk A DNA methylation-based profiling of uterine neoplasms: a novel tool to improve gynecologic cancer diagnostics J Cancer Res Clin Oncol 2020 146 97 104 10.1007/s00432-019-03093-w 31768620 PMC11804624 Kommoss FKF, Stichel D, Schrimpf D, Kriegsmann M, Tessier-Cloutier B, Talhouk A, et al. DNA methylation-based profiling of uterine neoplasms: a novel tool to improve gynecologic cancer diagnostics. J Cancer Res Clin Oncol. 2020;146:97–104. 10.1007/s00432-019-03093-w. 31768620 10.1007/s00432-019-03093-w PMC11804624 63. Mehdi A, Rabbani SA. Role of Methylation in Pro- and Anti-Cancer Immunity. Cancers (Basel) 2021;13. 10.3390/cancers13030545. 10.3390/cancers13030545 PMC7867049 33535484 64. Ressler JM Tomasich E Hatziioannou T Ringl H Heller G Silmbrod R DNA Methylation Signatures Correlate with Response to Immune Checkpoint Inhibitors in Metastatic Melanoma Target Oncol 2024 19 263 275 10.1007/s11523-024-01041-4 38401029 PMC10963567 Ressler JM, Tomasich E, Hatziioannou T, Ringl H, Heller G, Silmbrod R, et al. DNA Methylation Signatures Correlate with Response to Immune Checkpoint Inhibitors in Metastatic Melanoma. Target Oncol. 2024;19:263–75. 10.1007/s11523-024-01041-4. 38401029 10.1007/s11523-024-01041-4 PMC10963567 65. Xu W Xu M Wang L Zhou W Xiang R Shi Y Integrative analysis of DNA methylation and gene expression identified cervical cancer-specific diagnostic biomarkers Signal Transduct Target Ther 2019 4 55 10.1038/s41392-019-0081-6 31871774 PMC6908647 Xu W, Xu M, Wang L, Zhou W, Xiang R, Shi Y, et al. Integrative analysis of DNA methylation and gene expression identified cervical cancer-specific diagnostic biomarkers. Signal Transduct Target Ther. 2019;4:55. 10.1038/s41392-019-0081-6. 31871774 10.1038/s41392-019-0081-6 PMC6908647 66. Ma D Jiang C Hu X Liu H Li Q Li T Methylation Patterns of the IFN-γ Gene in Cervical Cancer Tissues Sci Rep 2014 4 6331 10.1038/srep06331 25208560 PMC4160705 Ma D, Jiang C, Hu X, Liu H, Li Q, Li T, et al. Methylation Patterns of the IFN-γ Gene in Cervical Cancer Tissues. Sci Rep. 2014;4:6331. 10.1038/srep06331. 25208560 10.1038/srep06331 PMC4160705 67. Hasim A Abudula M Aimiduo R Ma J-Q Jiao Z Akula G Post-transcriptional and epigenetic regulation of antigen processing machinery (APM) components and HLA-I in cervical cancers from Uighur women PLoS ONE 2012 7 e44952 10.1371/journal.pone.0044952 23024775 PMC3443204 Hasim A, Abudula M, Aimiduo R, Ma J-Q, Jiao Z, Akula G, et al. Post-transcriptional and epigenetic regulation of antigen processing machinery (APM) components and HLA-I in cervical cancers from Uighur women. PLoS ONE. 2012;7: e44952. 10.1371/journal.pone.0044952. 23024775 10.1371/journal.pone.0044952 PMC3443204 68. Wang Y Liu X Li Y Li O The paradox of IL-10-mediated modulation in cervical cancer (Review) Biomed Rep 2013 1 347 351 10.3892/br.2013.69 24648946 PMC3916998 Wang Y, Liu X, Li Y, Li O. The paradox of IL-10-mediated modulation in cervical cancer (Review). Biomed Rep. 2013;1:347–51. 10.3892/br.2013.69. 24648946 10.3892/br.2013.69 PMC3916998 69. Liu B, Zhai J, Wang W, Liu T, Liu C, Zhu X, et al. Identification of Tumor Microenvironment and DNA Methylation-Related Prognostic Signature for Predicting Clinical Outcomes and Therapeutic Responses in Cervical Cancer. Front Mol Biosci 2022;9. 10.3389/fmolb.2022.872932 PMC9061945 35517856 70. Zhang L Tian S Pei M Zhao M Wang L Jiang Y Crosstalk between histone modification and DNA methylation orchestrates the epigenetic regulation of the costimulatory factors, Tim-3 and galectin-9, in cervical cancer Oncol Rep 2019 42 2655 2669 10.3892/or.2019.7388 31661141 PMC6859457 Zhang L, Tian S, Pei M, Zhao M, Wang L, Jiang Y, et al. Crosstalk between histone modification and DNA methylation orchestrates the epigenetic regulation of the costimulatory factors, Tim-3 and galectin-9, in cervical cancer. Oncol Rep. 2019;42:2655–69. 10.3892/or.2019.7388. 31661141 10.3892/or.2019.7388 PMC6859457 71. Jia W Li N Wang J Gong X Ouedraogo SY Wang Y Immune-related gene methylation prognostic instrument for stratification and targeted treatment of ovarian cancer patients toward advanced 3PM approach EPMA J 2024 15 375 404 10.1007/s13167-024-00359-3 38841623 PMC11148001 Jia W, Li N, Wang J, Gong X, Ouedraogo SY, Wang Y, et al. Immune-related gene methylation prognostic instrument for stratification and targeted treatment of ovarian cancer patients toward advanced 3PM approach. EPMA J. 2024;15:375–404. 10.1007/s13167-024-00359-3. 38841623 10.1007/s13167-024-00359-3 PMC11148001 72. Matei D Pant A Moroney JW Fleming GF Tanner E Swetzig WM Phase II trial of guadecitabine priming and pembrolizumab in platinum resistant recurrent ovarian cancer J Clin Oncol 2025 38 6025 10.1200/JCO.2020.38.15_suppl.6025 Matei D, Pant A, Moroney JW, Fleming GF, Tanner E, Swetzig WM, et al. Phase II trial of guadecitabine priming and pembrolizumab in platinum resistant recurrent ovarian cancer. J Clin Oncol. 2025;38:6025. 10.1200/JCO.2020.38.15_suppl.6025. 73. Chiappinelli KB, Baylin SB. Inhibiting DNA methylation improves antitumor immunity in ovarian cancer. J Clin Invest 2022;132. 10.1172/JCI160186. 10.1172/JCI160186 PMC9282922 35838045 74. Dai F Wu J Deng Z Li H Tan W Yuan M Integrated Bioinformatic Analysis of DNA Methylation and Immune Infiltration in Endometrial Cancer Biomed Res Int 2022 2022 5119411 10.1155/2022/5119411 35774278 PMC9237709 Dai F, Wu J, Deng Z, Li H, Tan W, Yuan M, et al. Integrated Bioinformatic Analysis of DNA Methylation and Immune Infiltration in Endometrial Cancer. Biomed Res Int. 2022;2022:5119411. 10.1155/2022/5119411. 35774278 10.1155/2022/5119411 PMC9237709 75. Yao-Chung L, Junsu K, Emiliano F, Zhijian X, V. LY, Y. FM, et al. Demethylation and Up-Regulation of an Oncogene after Hypomethylating Therapy. N Engl J Med 2022;386:1998–2010. 10.1056/NEJMoa2119771. 10.1056/NEJMoa2119771 PMC9514878 35613022 76. Zhou M-M Cole PA Targeting lysine acetylation readers and writers Nat Rev Drug Discov 2025 24 112 133 10.1038/s41573-024-01080-6 39572658 PMC11798720 Zhou M-M, Cole PA. Targeting lysine acetylation readers and writers. Nat Rev Drug Discov. 2025;24:112–33. 10.1038/s41573-024-01080-6. 39572658 10.1038/s41573-024-01080-6 PMC11798720 77. Dai Q, Ye Y. Development and Validation of a Novel Histone Acetylation-Related Gene Signature for Predicting the Prognosis of Ovarian Cancer. Front Cell Dev Biol 2022;10. 10.3389/fcell.2022.793425 PMC8894724 35252174 78. Liu S, Chang W, Jin Y, Feng C, Wu S, He J, et al. The function of histone acetylation in cervical cancer development. Biosci Rep 2019;39:BSR20190527. 10.1042/BSR20190527. 10.1042/BSR20190527 PMC6465204 30886064 79. Lu J, He X, Zhang L, Zhang R, Li W. Acetylation in Tumor Immune Evasion Regulation. Front Pharmacol 2021;12. 10.3389/fphar.2021.771588 PMC8645962 34880761 80. Lu X, Jin P, Tang Q, Zhou M, Xu H, Su C, et al. NAD(+) Metabolism Reprogramming Drives SIRT1-Dependent Deacetylation Inducing PD-L1 Nuclear Localization in Cervical Cancer. Adv Sci (Weinheim, Baden-Wurttemberg, Ger 2025:e2412109. 10.1002/advs.202412109. 10.1002/advs.202412109 PMC12005810 39988985 81. Qi X, Zhou J, Wang X, Shen Y, Cao Y, Jiang L, et al. HPV E6/E7-Induced Acetylation of a Peptide Encoded by a Long Non-Coding RNA Inhibits Ferroptosis to Promote the Malignancy of Cervical Cancer. Adv Sci (Weinheim, Baden-Wurttemberg, Ger 2025;12:e2414018. 10.1002/advs.202414018. 10.1002/advs.202414018 PMC11905060 39836502 82. Liu P-W Liu Z-Y Deng S-J Zhang X Wang Z-B Wu N-Y A Pyroptosis-Related LncRNA Signature for Predicting Prognosis, Immune Features and Drug Sensitivity in Ovarian Cancer Onco Targets Ther 2025 18 585 601 10.2147/OTT.S491130 40291608 PMC12034292 Liu P-W, Liu Z-Y, Deng S-J, Zhang X, Wang Z-B, Wu N-Y, et al. A Pyroptosis-Related LncRNA Signature for Predicting Prognosis, Immune Features and Drug Sensitivity in Ovarian Cancer. Onco Targets Ther. 2025;18:585–601. 10.2147/OTT.S491130. 40291608 10.2147/OTT.S491130 PMC12034292 83. Wang X Li X Wei L Yu Y Hazaisihan Y Tao L Acetylation model predicts prognosis of patients and affects immune microenvironment infiltration in epithelial ovarian carcinoma J Ovarian Res 2024 17 150 10.1186/s13048-024-01449-6 39030559 PMC11264718 Wang X, Li X, Wei L, Yu Y, Hazaisihan Y, Tao L, et al. Acetylation model predicts prognosis of patients and affects immune microenvironment infiltration in epithelial ovarian carcinoma. J Ovarian Res. 2024;17:150. 10.1186/s13048-024-01449-6. 39030559 10.1186/s13048-024-01449-6 PMC11264718 84. Borley J Brown R Epigenetic mechanisms and therapeutic targets of chemotherapy resistance in epithelial ovarian cancer Ann Med 2015 47 359 369 10.3109/07853890.2015.1043140 26158617 Borley J, Brown R. Epigenetic mechanisms and therapeutic targets of chemotherapy resistance in epithelial ovarian cancer. Ann Med. 2015;47:359–69. 10.3109/07853890.2015.1043140. 26158617 10.3109/07853890.2015.1043140 85. Zhou J Guo Z Peng X Wu B Meng Q Lu X Chrysotoxine regulates ferroptosis and the PI3K/AKT/mTOR pathway to prevent cervical cancer J Ethnopharmacol 2025 338 119126 10.1016/j.jep.2024.119126 39557107 Zhou J, Guo Z, Peng X, Wu B, Meng Q, Lu X, et al. Chrysotoxine regulates ferroptosis and the PI3K/AKT/mTOR pathway to prevent cervical cancer. J Ethnopharmacol. 2025;338: 119126. 10.1016/j.jep.2024.119126. 39557107 10.1016/j.jep.2024.119126 86. Li C-J, Chiu Y-H, Chang C, Chang Y-CI, Sheu JJ-C, Chiang A-J. Acetyl Coenzyme A Synthase 2 Acts as a Prognostic Biomarker Associated with Immune Infiltration in Cervical Squamous Cell Carcinoma. Cancers (Basel) 2021;13. 10.3390/cancers13133125. 10.3390/cancers13133125 PMC8269092 34206705 87. Ye C Cheng Y Qian X Zhong B Ma J Guo H The CDK4/6 Inhibitor Palbociclib Induces Cell Senescence of High-grade Serous Ovarian Cancer Through Acetylation of p53 Biochem Genet 2024 62 5115 5128 10.1007/s10528-024-10704-w 38388849 Ye C, Cheng Y, Qian X, Zhong B, Ma J, Guo H. The CDK4/6 Inhibitor Palbociclib Induces Cell Senescence of High-grade Serous Ovarian Cancer Through Acetylation of p53. Biochem Genet. 2024;62:5115–28. 10.1007/s10528-024-10704-w. 38388849 10.1007/s10528-024-10704-w 88. Zhu X Zhao L Lang J The BRCA1 Methylation and PD-L1 Expression in Sporadic Ovarian Cancer Int J Gynecol Cancer Off J Int Gynecol Cancer Soc 2018 28 1514 1519 10.1097/IGC.0000000000001334 PMC6166706 30045136 Zhu X, Zhao L, Lang J. The BRCA1 Methylation and PD-L1 Expression in Sporadic Ovarian Cancer. Int J Gynecol Cancer Off J Int Gynecol Cancer Soc. 2018;28:1514–9. 10.1097/IGC.0000000000001334. 10.1097/IGC.0000000000001334 PMC6166706 30045136 89. Wang C Block MS Cunningham JM Sherman ME McCauley BM Armasu SM Methylation Signature Implicated in Immuno-Suppressive Activities in Tubo-Ovarian High-Grade Serous Carcinoma Cancer Epidemiol Biomarkers Prev a Publ Am Assoc Cancer Res Cosponsored by Am Soc Prev Oncol 2023 32 542 549 10.1158/1055-9965.EPI-22-0941 PMC10073286 36790339 Wang C, Block MS, Cunningham JM, Sherman ME, McCauley BM, Armasu SM, et al. Methylation Signature Implicated in Immuno-Suppressive Activities in Tubo-Ovarian High-Grade Serous Carcinoma. Cancer Epidemiol Biomarkers Prev a Publ Am Assoc Cancer Res Cosponsored by Am Soc Prev Oncol. 2023;32:542–9. 10.1158/1055-9965.EPI-22-0941. 10.1158/1055-9965.EPI-22-0941 PMC10073286 36790339 90. Kim K-M Song M-H Kim M-J Daudi S Miliotto A Old L A novel cancer/testis antigen KP-OVA-52 identified by SEREX in human ovarian cancer is regulated by DNA methylation Int J Oncol 2012 41 1139 1147 10.3892/ijo.2012.1508 22684412 PMC4144267 Kim K-M, Song M-H, Kim M-J, Daudi S, Miliotto A, Old L, et al. A novel cancer/testis antigen KP-OVA-52 identified by SEREX in human ovarian cancer is regulated by DNA methylation. Int J Oncol. 2012;41:1139–47. 10.3892/ijo.2012.1508. 22684412 10.3892/ijo.2012.1508 PMC4144267 91. Yang X Chen Y Li M Zhu W ERBB3 methylation and immune infiltration in tumor microenvironment of cervical cancer Sci Rep 2022 12 8112 10.1038/s41598-022-11415-1 35581263 PMC9114106 Yang X, Chen Y, Li M, Zhu W. ERBB3 methylation and immune infiltration in tumor microenvironment of cervical cancer. Sci Rep. 2022;12:8112. 10.1038/s41598-022-11415-1. 35581263 10.1038/s41598-022-11415-1 PMC9114106 92. Hao J Liu T Xiu Y Yuan H Xu D High DNA methylation age deceleration defines an aggressive phenotype with immunoexclusion environments in endometrial carcinoma Front Immunol 2023 14 1208223 10.3389/fimmu.2023.1208223 37388735 PMC10303802 Hao J, Liu T, Xiu Y, Yuan H, Xu D. High DNA methylation age deceleration defines an aggressive phenotype with immunoexclusion environments in endometrial carcinoma. Front Immunol. 2023;14:1208223. 10.3389/fimmu.2023.1208223. 37388735 10.3389/fimmu.2023.1208223 PMC10303802 93. Liu J Ji C Wang Y Zhang C Zhu H Identification of methylation-driven genes prognosis signature and immune microenvironment in uterus corpus endometrial cancer Cancer Cell Int 2021 21 365 10.1186/s12935-021-02038-z 34246261 PMC8272318 Liu J, Ji C, Wang Y, Zhang C, Zhu H. Identification of methylation-driven genes prognosis signature and immune microenvironment in uterus corpus endometrial cancer. Cancer Cell Int. 2021;21:365. 10.1186/s12935-021-02038-z. 34246261 10.1186/s12935-021-02038-z PMC8272318 94. Liu J, Zhu W, Xia L, Zhu Q, Mao Y, Shen Y, et al. Identification of CAPG as a potential prognostic biomarker associated with immune cell infiltration and ferroptosis in uterine corpus endometrial carcinoma. Front Endocrinol (Lausanne) 2024;15. 10.3389/fendo.2024.1452219 PMC11588481 39600941 95. Kim J, Kong JK, Yang W, Cho H, Chay DB, Lee BH, et al. DNA Mismatch Repair Protein Immunohistochemistry and MLH1 Promotor Methylation Testing for Practical Molecular Classification and the Prediction of Prognosis in Endometrial Cancer. Cancers (Basel) 2018;10. 10.3390/cancers10090279. 10.3390/cancers10090279 PMC6162750 30134578 96. Tan M Wang S Li F Xu H Gao J Zhu L A methylation-driven genes prognostic signature and the immune microenvironment in epithelial ovarian cancer Carcinogenesis 2022 43 635 646 10.1093/carcin/bgac048 35639961 Tan M, Wang S, Li F, Xu H, Gao J, Zhu L. A methylation-driven genes prognostic signature and the immune microenvironment in epithelial ovarian cancer. Carcinogenesis. 2022;43:635–46. 10.1093/carcin/bgac048. 35639961 10.1093/carcin/bgac048 97. Ma J, Yang D, Ma X-X. Immune infiltration-related N6-methyladenosine RNA methylation regulators influence the malignancy and prognosis of endometrial cancer. Aging (Albany NY) 2021;13:16287–315. 10.18632/aging.203157. 10.18632/aging.203157 PMC8266343 34230220 98. Chen X, Hao Y, Liu Y, Zhong S, You Y, Ao K, et al. NAT10/ac4C/FOXP1 Promotes Malignant Progression and Facilitates Immunosuppression by Reprogramming Glycolytic Metabolism in Cervical Cancer. Adv Sci (Weinheim, Baden-Wurttemberg, Ger 2023;10:e2302705. 10.1002/advs.202302705. 10.1002/advs.202302705 PMC10646273 37818745 99. Wang J Ling D Shi L Li H Peng M Wen H METTL3-mediated m6A methylation regulates ovarian cancer progression by recruiting myeloid-derived suppressor cells Cell Biosci 2023 13 202 10.1186/s13578-023-01149-6 37932814 PMC10629157 Wang J, Ling D, Shi L, Li H, Peng M, Wen H, et al. METTL3-mediated m6A methylation regulates ovarian cancer progression by recruiting myeloid-derived suppressor cells. Cell Biosci. 2023;13:202. 10.1186/s13578-023-01149-6. 37932814 10.1186/s13578-023-01149-6 PMC10629157 100. Fang F Wang P Huang H Ye M Liu X Li Q m(6)A RNA methylation regulator-based signature for prognostic prediction and its potential immunological role in uterine corpus endometrial carcinoma BMC Cancer 2022 22 1364 10.1186/s12885-022-10490-x 36581816 PMC9801604 Fang F, Wang P, Huang H, Ye M, Liu X, Li Q. m(6)A RNA methylation regulator-based signature for prognostic prediction and its potential immunological role in uterine corpus endometrial carcinoma. BMC Cancer. 2022;22:1364. 10.1186/s12885-022-10490-x. 36581816 10.1186/s12885-022-10490-x PMC9801604 101. Gu J, Bi F. Significance of N6-Methyladenosine RNA Methylation Regulators in Immune Infiltrates of Ovarian Cancer. Front Genet 2021;12. 10.3389/fgene.2021.671179 PMC8295008 34306015 102. Li K Shu S Zou J Li M Liu Z m(6)A regulator-mediated methylation modification patterns and tumor immune microenvironment characterization in endometrial cancer Genes Dis 2023 10 2278 2281 10.1016/j.gendis.2023.01.021 37554195 PMC10404963 Li K, Shu S, Zou J, Li M, Liu Z. m(6)A regulator-mediated methylation modification patterns and tumor immune microenvironment characterization in endometrial cancer. Genes Dis. 2023;10:2278–81. 10.1016/j.gendis.2023.01.021. 37554195 10.1016/j.gendis.2023.01.021 PMC10404963 103. Liu J, Chen C, Wang Y, Qian C, Wei J, Xing Y, et al. Comprehensive of N1-Methyladenosine Modifications Patterns and Immunological Characteristics in Ovarian Cancer. Front Immunol 2021;12. 10.3389/fimmu.2021.746647 PMC8588846 34777359 104. Zhang W, Xiao P, Tang J, Wang R, Wang X, Wang F, et al. m6A Regulator-Mediated Tumour Infiltration and Methylation Modification in Cervical Cancer Microenvironment. Front Immunol 2022;13. 10.3389/fimmu.2022.888650 PMC9098799 35572541 105. Rajendran P Prasad M Ali EM Sekar R AlZahrani AM Karobari MI Molecular insight into histone methylation as a novel target for oral squamous cell carcinoma: future hope in personalised medicine J Cancer 2025 16 1575 1590 10.7150/jca.103243 39991574 PMC11843246 Rajendran P, Prasad M, Ali EM, Sekar R, AlZahrani AM, Karobari MI, et al. Molecular insight into histone methylation as a novel target for oral squamous cell carcinoma: future hope in personalised medicine. J Cancer. 2025;16:1575–90. 10.7150/jca.103243. 39991574 10.7150/jca.103243 PMC11843246 106. Bu S, Ye T, Gao H, Song H, Zhu Y. Histone methylation and acetylation in cancer: mechanism, progression, and targets 2025;27:29–43. 10.1515/oncologie-2024-0324. 107. Xiao C, Fan T, Zheng Y, Tian H, Deng Z, Liu J, et al. H3K4 trimethylation regulates cancer immunity: a promising therapeutic target in combination with immunotherapy. J Immunother Cancer 2023;11. 10.1136/jitc-2022-005693. 10.1136/jitc-2022-005693 PMC10414074 37553181 108. Sun W, Lv S, Li H, Cui W, Wang L. Enhancing the Anticancer Efficacy of Immunotherapy through Combination with Histone Modification Inhibitors. Genes (Basel) 2018;9. 10.3390/genes9120633. 10.3390/genes9120633 PMC6315613 30558227 109. Li X Emerging role of mutations in epigenetic regulators including MLL2 derived from The Cancer Genome Atlas for cervical cancer BMC Cancer 2017 17 252 10.1186/s12885-017-3257-x 28390392 PMC5385072 Li X. Emerging role of mutations in epigenetic regulators including MLL2 derived from The Cancer Genome Atlas for cervical cancer. BMC Cancer. 2017;17:252. 10.1186/s12885-017-3257-x. 28390392 10.1186/s12885-017-3257-x PMC5385072 110. Su Luyang Xu Ren RY Shixia Z Liyun S Cuiqiao M 5-Methylcytosine methylation predicts cervical cancer prognosis, shaping immune cell infiltration J Int Med Res 2025 53 03000605251328301 10.1177/03000605251328301 40219803 PMC12033582 Su Luyang Xu, Ren RY, Shixia Z, Liyun S, Cuiqiao M, et al. 5-Methylcytosine methylation predicts cervical cancer prognosis, shaping immune cell infiltration. J Int Med Res. 2025;53:03000605251328301. 10.1177/03000605251328301. 40219803 10.1177/03000605251328301 PMC12033582 111. Yang H Sui L Cai C Chu H Diao Y SETDB1 promotes progression through upregulation of SF3B4 expression and regulates the immunity in ovarian cancer J Ovarian Res 2024 17 34 10.1186/s13048-024-01358-8 38317200 PMC10840244 Yang H, Sui L, Cai C, Chu H, Diao Y. SETDB1 promotes progression through upregulation of SF3B4 expression and regulates the immunity in ovarian cancer. J Ovarian Res. 2024;17:34. 10.1186/s13048-024-01358-8. 38317200 10.1186/s13048-024-01358-8 PMC10840244 112. Liu H Lin J Zhou W Moses R Dai Z Kossenkov AV KDM5A Inhibits Antitumor Immune Responses Through Downregulation of the Antigen-Presentation Pathway in Ovarian Cancer Cancer Immunol Res 2022 10 1028 1038 10.1158/2326-6066.CIR-22-0088 35726891 PMC9357105 Liu H, Lin J, Zhou W, Moses R, Dai Z, Kossenkov AV, et al. KDM5A Inhibits Antitumor Immune Responses Through Downregulation of the Antigen-Presentation Pathway in Ovarian Cancer. Cancer Immunol Res. 2022;10:1028–38. 10.1158/2326-6066.CIR-22-0088. 35726891 10.1158/2326-6066.CIR-22-0088 PMC9357105 113. Zhu Y Fu Y Liu F Yan S Yu R Appraising histone H4 lysine 5 lactylation as a novel biomarker in breast cancer Sci Rep 2025 15 8205 10.1038/s41598-025-92666-6 40065036 PMC11893895 Zhu Y, Fu Y, Liu F, Yan S, Yu R. Appraising histone H4 lysine 5 lactylation as a novel biomarker in breast cancer. Sci Rep. 2025;15:8205. 10.1038/s41598-025-92666-6. 40065036 10.1038/s41598-025-92666-6 PMC11893895 114. Zhou J Ma X Liu X Liu Y Fu J Qi Y The impact of histone lactylation on the tumor microenvironment and metabolic pathways and its potential in cancer therapy Genes Genomics 2024 46 991 1011 10.1007/s13258-024-01554-2 39127851 Zhou J, Ma X, Liu X, Liu Y, Fu J, Qi Y, et al. The impact of histone lactylation on the tumor microenvironment and metabolic pathways and its potential in cancer therapy. Genes Genomics. 2024;46:991–1011. 10.1007/s13258-024-01554-2. 39127851 10.1007/s13258-024-01554-2 115. Cai Q, Deng W, Zou Y, Chen Z-S, Tang H. Histone lactylation as a driver of metabolic reprogramming and immune evasion. Med Rev 2024. 10.1515/mr-2024-0091 PMC12207202 40600185 116. Hu X Zhenqiang H Li L LDHB Mediates Histone Lactylation to Activate PD-L1 and Promote Ovarian Cancer Immune Escape Cancer Invest 2025 43 70 79 10.1080/07357907.2024.2430283 39587817 Hu X, Zhenqiang H, Li L. LDHB Mediates Histone Lactylation to Activate PD-L1 and Promote Ovarian Cancer Immune Escape. Cancer Invest. 2025;43:70–9. 10.1080/07357907.2024.2430283. 39587817 10.1080/07357907.2024.2430283 117. Yang X, Zhang W, Zhu W. Profiling of immune responses by lactate modulation in cervical cancer reveals key features driving clinical outcome. Heliyon 2023;9. 10.1016/j.heliyon.2023.e14896. 10.1016/j.heliyon.2023.e14896 PMC10161385 37151676 118. Xu X, Pan X, Fan Z, Xia J, Ren X. Lactate dehydrogenase B as a metabolism-related marker for immunotherapy in head and neck squamous cell carcinoma. Cell Signal 2024;120:111200. 10.1016/j.cellsig.2024.111200. 10.1016/j.cellsig.2024.111200 38719019 119. Xiang H, Tang H, He Q, Sun J, Yang Y, Kong L, et al. NDUFA8 is transcriptionally regulated by EP300/H3K27ac and promotes mitochondrial respiration to support proliferation and inhibit apoptosis in cervical cancer. Biochem Biophys Res Commun 2024;693:149374. 10.1016/j.bbrc.2023.149374. 10.1016/j.bbrc.2023.149374 38096616 120. Huang W, Kong F, Li R, Chen X, Wang K. Emerging Roles of m6A RNA Methylation Regulators in Gynecological Cancer. Front Oncol 2022;12. 10.3389/fonc.2022.827956 PMC8831694 35155260 121. Li J, Zhang H, Wang H. N1-methyladenosine modification in cancer biology: Current status and future perspectives. Comput Struct Biotechnol J 2022;20:6578–85. 10.1016/j.csbj.2022.11.045. 10.1016/j.csbj.2022.11.045 PMC9712505 36467585 122. Zhang C, Liu N. N6-methyladenosine (m6A) modification in gynecological malignancies. J Cell Physiol 2022;237:3465–79. 10.1002/jcp.30828. 10.1002/jcp.30828 35802474 123. He W, Hong X, Chen G, Luo X, Lin Y. RNA modifications in gynecological cancer: current status and future directions. Front Med 2024;11. 10.3389/fmed.2024.1314075 PMC10853395 38343637 124. Zheng P Li N Zhan X Ovarian cancer subtypes based on the regulatory genes of RNA modifications: Novel prediction model of prognosis Front Endocrinol (Lausanne) 2022 13 972341 10.3389/fendo.2022.972341 36545327 PMC9760687 Zheng P, Li N, Zhan X. Ovarian cancer subtypes based on the regulatory genes of RNA modifications: Novel prediction model of prognosis. Front Endocrinol (Lausanne). 2022;13: 972341. 10.3389/fendo.2022.972341. 36545327 10.3389/fendo.2022.972341 PMC9760687 125. Ji H Zhang J-A Liu H Li K Wang Z-W Zhu X Comprehensive characterization of tumor microenvironment and m6A RNA methylation regulators and its effects on PD-L1 and immune infiltrates in cervical cancer Front Immunol 2022 13 976107 10.3389/fimmu.2022.976107 36091006 PMC9458859 Ji H, Zhang J-A, Liu H, Li K, Wang Z-W, Zhu X. Comprehensive characterization of tumor microenvironment and m6A RNA methylation regulators and its effects on PD-L1 and immune infiltrates in cervical cancer. Front Immunol. 2022;13: 976107. 10.3389/fimmu.2022.976107. 36091006 10.3389/fimmu.2022.976107 PMC9458859 126. Gao Y Qi G Yu L m6A modification of RNA in cervical cancer: role and clinical perspectives RNA Biol 2024 21 994 1006 10.1080/15476286.2024.2408707 PMC11445900 39344658 Gao Y, Qi G, Yu L. m6A modification of RNA in cervical cancer: role and clinical perspectives. RNA Biol. 2024;21:994–1006. 10.1080/15476286.2024.2408707. 10.1080/15476286.2024.2408707 PMC11445900 39344658 127. Liu J Eckert MA Harada BT Liu S-M Lu Z Yu K m6A mRNA methylation regulates AKT activity to promote the proliferation and tumorigenicity of endometrial cancer Nat Cell Biol 2018 20 1074 1083 10.1038/s41556-018-0174-4 30154548 PMC6245953 Liu J, Eckert MA, Harada BT, Liu S-M, Lu Z, Yu K, et al. m6A mRNA methylation regulates AKT activity to promote the proliferation and tumorigenicity of endometrial cancer. Nat Cell Biol. 2018;20:1074–83. 10.1038/s41556-018-0174-4. 30154548 10.1038/s41556-018-0174-4 PMC6245953 128. Chen S Chen Y Yu L Hu X YTHDC1 inhibits cell proliferation and angiogenesis in cervical cancer by regulating m6A modification of SOCS4 mRNA Mol Cell Toxicol 2024 20 533 540 10.1007/s13273-023-00360-3 Chen S, Chen Y, Yu L, Hu X. YTHDC1 inhibits cell proliferation and angiogenesis in cervical cancer by regulating m6A modification of SOCS4 mRNA. Mol Cell Toxicol. 2024;20:533–40. 10.1007/s13273-023-00360-3. 129. Lyko F The DNA methyltransferase family: a versatile toolkit for epigenetic regulation Nat Rev Genet 2018 19 81 92 10.1038/nrg.2017.80 29033456 Lyko F. The DNA methyltransferase family: a versatile toolkit for epigenetic regulation. Nat Rev Genet. 2018;19:81–92. 10.1038/nrg.2017.80. 29033456 10.1038/nrg.2017.80 130. Travers M Brown SM Dunworth M Holbert CE Wiehagen KR Bachman KE DFMO and 5-Azacytidine Increase M1 Macrophages in the Tumor Microenvironment of Murine Ovarian Cancer Cancer Res 2019 79 3445 3454 10.1158/0008-5472.CAN-18-4018 31088836 PMC6606334 Travers M, Brown SM, Dunworth M, Holbert CE, Wiehagen KR, Bachman KE, et al. DFMO and 5-Azacytidine Increase M1 Macrophages in the Tumor Microenvironment of Murine Ovarian Cancer. Cancer Res. 2019;79:3445–54. 10.1158/0008-5472.CAN-18-4018. 31088836 10.1158/0008-5472.CAN-18-4018 PMC6606334 131. Tyagi SC Smolenkova I Zheng Y Singh M Epigenetic Control of Hyperuricemia and Gout by Gene Writer DNMT1 and RNA Editor ADAR1: Mechanism of Gout and Amyloid Dissolution in Down Syndrome Biochem Genet 2025 10.1007/s10528-025-11038-x 39881080 Tyagi SC, Smolenkova I, Zheng Y, Singh M. Epigenetic Control of Hyperuricemia and Gout by Gene Writer DNMT1 and RNA Editor ADAR1: Mechanism of Gout and Amyloid Dissolution in Down Syndrome. Biochem Genet. 2025. 10.1007/s10528-025-11038-x. 39881080 10.1007/s10528-025-11038-x 132. Uchida H, Ito S. Differential regulation of expression of RNA-editing enzymes, ADAR1 and ADAR2, by 5-aza-2′-deoxycytidine and trichostatin A in human neuronal SH-SY5Y cells. Neuroreport 2015;26. 10.1097/WNR.0000000000000474 26485095 133. Gomez S, Cox OL, Walker RR 3rd, Rentia U, Hadley M, Arthofer E, et al. Inhibiting DNA methylation and RNA editing upregulates immunogenic RNA to transform the tumor microenvironment and prolong survival in ovarian cancer. J Immunother Cancer 2022;10. 10.1136/jitc-2022-004974. 10.1136/jitc-2022-004974 PMC9644370 36343976 134. Cox OL. The Role of TP53, ADAR1, and T Cells in the Interferon Response to DNMTi Therapy in Ovarian Cancer Model 2024. 135. Guo J Tang B Fu J Zhu X Xie W Wang N High-plex spatial transcriptomic profiling reveals distinct immune components and the HLA class I/DNMT3A/CD8 modulatory axis in mismatch repair-deficient endometrial cancer Cell Oncol (Dordrecht, Netherlands) 2024 47 573 585 10.1007/s13402-023-00885-8 PMC11090934 37847338 Guo J, Tang B, Fu J, Zhu X, Xie W, Wang N, et al. High-plex spatial transcriptomic profiling reveals distinct immune components and the HLA class I/DNMT3A/CD8 modulatory axis in mismatch repair-deficient endometrial cancer. Cell Oncol (Dordrecht, Netherlands). 2024;47:573–85. 10.1007/s13402-023-00885-8. 10.1007/s13402-023-00885-8 PMC11090934 37847338 136. Grau Bejar JF, Yaniz Galende E, Zeng Q, Genestie C, Rouleau E, de Bruyn M, et al. Immune predictors of response to immune checkpoint inhibitors in mismatch repair-deficient endometrial cancer. J Immunother Cancer 2024;12. 10.1136/jitc-2024-009143. 10.1136/jitc-2024-009143 PMC11218029 38955419 137. Chen Y Su J Li S Chen F Zhang Y Wang X Structural Modifications and Prospects of Histone Deacetylase (HDAC) Inhibitors in Cancer Curr Med Chem 2025 10.2174/0109298673332285241104091609 39806953 Chen Y, Su J, Li S, Chen F, Zhang Y, Wang X, et al. Structural Modifications and Prospects of Histone Deacetylase (HDAC) Inhibitors in Cancer. Curr Med Chem. 2025. 10.2174/0109298673332285241104091609. 39806953 10.2174/0109298673332285241104091609 138. Psilopatis I, Pergaris A, Giaginis C, Theocharis S. Histone Deacetylase Inhibitors: A Promising Therapeutic Alternative for Endometrial Carcinoma. Dis Markers 2021;2021:7850688. 10.1155/2021/7850688. 10.1155/2021/7850688 PMC8604582 34804263 139. Huang Z Peng S Knoff J Lee SY Yang B Wu T-C Combination of proteasome and HDAC inhibitor enhances HPV16 E7-specific CD8+ T cell immune response and antitumor effects in a preclinical cervical cancer model J Biomed Sci 2015 22 7 10.1186/s12929-014-0111-1 25591912 PMC4298946 Huang Z, Peng S, Knoff J, Lee SY, Yang B, Wu T-C, et al. Combination of proteasome and HDAC inhibitor enhances HPV16 E7-specific CD8+ T cell immune response and antitumor effects in a preclinical cervical cancer model. J Biomed Sci. 2015;22:7. 10.1186/s12929-014-0111-1. 25591912 10.1186/s12929-014-0111-1 PMC4298946 140. Mora-García M de L, Duenas-González A, Hernández-Montes J, De la Cruz-Hernández E, Pérez-Cárdenas E, Weiss-Steider B, et al. Up-regulation of HLA class-I antigen expression and antigen-specific CTL response in cervical cancer cells by the demethylating agent hydralazine and the histone deacetylase inhibitor valproic acid. J Transl Med 2006;4:55. 10.1186/1479-5876-4-55. 10.1186/1479-5876-4-55 PMC1781077 17192185 141. Coronel J Cetina L Pacheco I Trejo-Becerril C González-Fierro A de la Cruz-Hernandez E A double-blind, placebo-controlled, randomized phase III trial of chemotherapy plus epigenetic therapy with hydralazine valproate for advanced cervical cancer Preliminary results Med Oncol 2011 28 Suppl 1 S540 S546 10.1007/s12032-010-9700-3 20931299 Coronel J, Cetina L, Pacheco I, Trejo-Becerril C, González-Fierro A, de la Cruz-Hernandez E, et al. A double-blind, placebo-controlled, randomized phase III trial of chemotherapy plus epigenetic therapy with hydralazine valproate for advanced cervical cancer. Preliminary results Med Oncol. 2011;28(Suppl 1):S540–6. 10.1007/s12032-010-9700-3. 20931299 10.1007/s12032-010-9700-3 142. McCaw TR Goel N Brooke DJ Katre AA Londoño AI Smith HJ Class I histone deacetylase inhibition promotes CD8 T cell activation in ovarian cancer Cancer Med 2021 10 709 717 10.1002/cam4.3337 33369199 PMC7877343 McCaw TR, Goel N, Brooke DJ, Katre AA, Londoño AI, Smith HJ, et al. Class I histone deacetylase inhibition promotes CD8 T cell activation in ovarian cancer. Cancer Med. 2021;10:709–17. 10.1002/cam4.3337. 33369199 10.1002/cam4.3337 PMC7877343 143. Tang Z, Ding S, Huang H, Luo P, Qing B, Zhang S, et al. HDAC1 triggers the proliferation and migration of breast cancer cells via upregulation of interleukin-8 2017;398:1347–56. 10.1515/hsz-2017-0155. 10.1515/hsz-2017-0155 28779562 144. Gatla HR, Zou Y, Uddin MM, Vancurova I. Epigenetic regulation of interleukin-8 expression by class I HDAC and CBP in ovarian cancer cells. Oncotarget 2017;8:70798–810. 10.18632/oncotarget.19990. 10.18632/oncotarget.19990 PMC5642595 29050320 145. Qiu J, Xu Q, Panah T, Morshed AKMH, Wang X, Zhou F, et al. Reactive oxygen species mediate ovarian cancer development, platinum resistance, and angiogenesis via CXCL8 and GSK-3β/p70S6K1 axis. Genes Dis 2025;12:101378. 10.1016/j.gendis.2024.101378. 10.1016/j.gendis.2024.101378 PMC11629555 39660100 146. Ghahfarrokhi SSM, Karimi P, Mahdigholi F-S, Haji Abdolvahab M. Vaccination and personalized cancer vaccines focusing on common cancers in women: A narrative review. Pathol - Res Pract 2025;270:155983. 10.1016/j.prp.2025.155983. 10.1016/j.prp.2025.155983 40262377 147. Peper JK Bösmüller H-C Schuster H Gückel B Hörzer H Roehle K HLA ligandomics identifies histone deacetylase 1 as target for ovarian cancer immunotherapy Oncoimmunology 2016 5 e1065369 10.1080/2162402X.2015.1065369 27467910 PMC4910750 Peper JK, Bösmüller H-C, Schuster H, Gückel B, Hörzer H, Roehle K, et al. HLA ligandomics identifies histone deacetylase 1 as target for ovarian cancer immunotherapy. Oncoimmunology. 2016;5: e1065369. 10.1080/2162402X.2015.1065369. 27467910 10.1080/2162402X.2015.1065369 PMC4910750 148. Song D-G Ye Q Santoro S Fang C Best A Powell DJJ Chimeric NKG2D CAR-expressing T cell-mediated attack of human ovarian cancer is enhanced by histone deacetylase inhibition Hum Gene Ther 2013 24 295 305 10.1089/hum.2012.143 23297870 PMC3609608 Song D-G, Ye Q, Santoro S, Fang C, Best A, Powell DJJ. Chimeric NKG2D CAR-expressing T cell-mediated attack of human ovarian cancer is enhanced by histone deacetylase inhibition. Hum Gene Ther. 2013;24:295–305. 10.1089/hum.2012.143. 23297870 10.1089/hum.2012.143 PMC3609608 149. Yang Z, Chu B, Tu Y, Li L, Chen D, Huang S, et al. Dual inhibitors of DNMT and HDAC remodels the immune microenvironment of colorectal cancer and enhances the efficacy of anti-PD-L1 therapy. Pharmacol Res 2024;206:107271. 10.1016/j.phrs.2024.107271. 10.1016/j.phrs.2024.107271 38906202 150. Srivastava AP Moufarrij SM Hadley M Chisholm S Lopez-Acevedo M Villagra A Abstract 1395: HDAC6 and DNMT inhibition affect immunogenicity of ovarian cancer cells: A rationale for combining epigenetic and immune therapy in ovarian cancer Cancer Res 2018 78 1395 10.1158/1538-7445.AM2018-1395 Srivastava AP, Moufarrij SM, Hadley M, Chisholm S, Lopez-Acevedo M, Villagra A, et al. Abstract 1395: HDAC6 and DNMT inhibition affect immunogenicity of ovarian cancer cells: A rationale for combining epigenetic and immune therapy in ovarian cancer. Cancer Res. 2018;78:1395. 10.1158/1538-7445.AM2018-1395. 151. Turner TB, Meza-Perez S, Londoño A, Katre A, Peabody JE, Smith HJ, et al. Epigenetic modifiers upregulate MHC II and impede ovarian cancer tumor growth. Oncotarget 2017;8:44159–70. 10.18632/oncotarget.17395. 10.18632/oncotarget.17395 PMC5546470 28498806 152. Cox OL, Gomez S, Grundy EE, Chiappinelli KB. Combination epigenetic therapy activates immune cells in a murine model of ovarian cancer. J Immunol 2023;210:245.21–245.21. 10.4049/jimmunol.210.Supp.245.21. 153. Gatla HR Zou Y Uddin MM Singha B Bu P Vancura A Histone Deacetylase (HDAC) Inhibition Induces IκB Kinase (IKK)-dependent Interleukin-8/CXCL8 Expression in Ovarian Cancer Cells J Biol Chem 2017 292 5043 5054 10.1074/jbc.M116.771014 28167529 PMC5377816 Gatla HR, Zou Y, Uddin MM, Singha B, Bu P, Vancura A, et al. Histone Deacetylase (HDAC) Inhibition Induces IκB Kinase (IKK)-dependent Interleukin-8/CXCL8 Expression in Ovarian Cancer Cells. J Biol Chem. 2017;292:5043–54. 10.1074/jbc.M116.771014. 28167529 10.1074/jbc.M116.771014 PMC5377816 154. Kim M Lu F Zhang Y Loss of HDAC-Mediated Repression and Gain of NF-κB Activation Underlie Cytokine Induction in ARID1A- and PIK3CA-Mutation-Driven Ovarian Cancer Cell Rep 2016 17 275 288 10.1016/j.celrep.2016.09.003 27681437 PMC7734570 Kim M, Lu F, Zhang Y. Loss of HDAC-Mediated Repression and Gain of NF-κB Activation Underlie Cytokine Induction in ARID1A- and PIK3CA-Mutation-Driven Ovarian Cancer. Cell Rep. 2016;17:275–88. 10.1016/j.celrep.2016.09.003. 27681437 10.1016/j.celrep.2016.09.003 PMC7734570 155. Fejzo MS Chen H-W Anderson L McDermott MSJ Karlan B Konecny GE Analysis in epithelial ovarian cancer identifies <em>KANSL1</em> as a biomarker and target gene for immune response and HDAC inhibition Gynecol Oncol 2021 160 539 546 10.1016/j.ygyno.2020.11.008 33229045 Fejzo MS, Chen H-W, Anderson L, McDermott MSJ, Karlan B, Konecny GE, et al. Analysis in epithelial ovarian cancer identifies <em>KANSL1</em> as a biomarker and target gene for immune response and HDAC inhibition. Gynecol Oncol. 2021;160:539–46. 10.1016/j.ygyno.2020.11.008. 33229045 10.1016/j.ygyno.2020.11.008 156. Gomez SA. Epigenetic Activation of Transposable Elements to Reverse Immune Evasion in Ovarian Cancer 2023. 157. Kang Z Fu P Ma H Li T Lu K Liu J Distinct functions of EHMT1 and EHMT2 in cancer chemotherapy and immunotherapy BioRxiv Prepr Serv Biol 2023 10.1101/2023.10.03.560719 Kang Z, Fu P, Ma H, Li T, Lu K, Liu J, et al. Distinct functions of EHMT1 and EHMT2 in cancer chemotherapy and immunotherapy. BioRxiv Prepr Serv Biol. 2023. 10.1101/2023.10.03.560719. 158. Rugo HS Jacobs I Sharma S Scappaticci F Paul TA Jensen-Pergakes K The Promise for Histone Methyltransferase Inhibitors for Epigenetic Therapy in Clinical Oncology: A Narrative Review Adv Ther 2020 37 3059 3082 10.1007/s12325-020-01379-x 32445185 PMC7467409 Rugo HS, Jacobs I, Sharma S, Scappaticci F, Paul TA, Jensen-Pergakes K, et al. The Promise for Histone Methyltransferase Inhibitors for Epigenetic Therapy in Clinical Oncology: A Narrative Review. Adv Ther. 2020;37:3059–82. 10.1007/s12325-020-01379-x. 32445185 10.1007/s12325-020-01379-x PMC7467409 159. Lu A, Haines B, Zhang W, Zhang M, Whittington DA, Dam Ferdinez ML, et al. 792 TNG917: a potent and orally active inhibitor of euchromatic histone lysine methyltransferases (EHMT1/2) for the treatment of immune-cold tumors. J Immunother Cancer 2024;12:A897 LP-A897. 10.1136/jitc-2024-SITC2024.0792. 160. Spiliopoulou P Spear S Dowson S Mason S Blyth K Fuchter M Inhibiting Ehmt2 and Ezh2 histone methyltransferases alters the immune microenvironment in a Trp53-/- murine ovarian cancer model Ann Oncol 2019 30 v784 10.1093/annonc/mdz268.073 Spiliopoulou P, Spear S, Dowson S, Mason S, Blyth K, Fuchter M, et al. Inhibiting Ehmt2 and Ezh2 histone methyltransferases alters the immune microenvironment in a Trp53-/- murine ovarian cancer model. Ann Oncol. 2019;30: v784. 10.1093/annonc/mdz268.073. 161. Nguyen L Watson ZL Woodruff ER Jordan KR Chuong E Bitler BG Abstract B009: Dual PARP and EHMT1/2 inhibition induces an interferon response and anti-tumor immunity in ovarian cancer Cancer Res 2024 84 B009 B009 10.1158/1538-7445.OVARIAN23-B009 Nguyen L, Watson ZL, Woodruff ER, Jordan KR, Chuong E, Bitler BG. Abstract B009: Dual PARP and EHMT1/2 inhibition induces an interferon response and anti-tumor immunity in ovarian cancer. Cancer Res. 2024;84:B009–B009. 10.1158/1538-7445.OVARIAN23-B009. 162. Nguyen LL Watson ZL Ortega R Woodruff ER Jordan KR Iwanaga R Combinatory EHMT and PARP inhibition induces an interferon response and a CD8 T cell-dependent tumor regression in PARP inhibitor-resistant models BioRxiv Prepr Serv Biol 2023 10.1101/2023.02.23.529773 Nguyen LL, Watson ZL, Ortega R, Woodruff ER, Jordan KR, Iwanaga R, et al. Combinatory EHMT and PARP inhibition induces an interferon response and a CD8 T cell-dependent tumor regression in PARP inhibitor-resistant models. BioRxiv Prepr Serv Biol. 2023. 10.1101/2023.02.23.529773. 163. Nguyen LL Watson ZL Ortega R Woodruff ER Jordan KR Iwanaga R Combining EHMT and PARP Inhibition: A Strategy to Diminish Therapy-Resistant Ovarian Cancer Tumor Growth while Stimulating Immune Activation Mol Cancer Ther 2024 23 1332 1347 10.1158/1535-7163.MCT-23-0613 38714351 PMC11543919 Nguyen LL, Watson ZL, Ortega R, Woodruff ER, Jordan KR, Iwanaga R, et al. Combining EHMT and PARP Inhibition: A Strategy to Diminish Therapy-Resistant Ovarian Cancer Tumor Growth while Stimulating Immune Activation. Mol Cancer Ther. 2024;23:1332–47. 10.1158/1535-7163.MCT-23-0613. 38714351 10.1158/1535-7163.MCT-23-0613 PMC11543919 164. Nachiyappan A, Gupta N, Taneja R. EHMT1/EHMT2 in EMT, cancer stemness and drug resistance: emerging evidence and mechanisms. FEBS J 2022;289:1329–51. 10.1111/febs.16334. 10.1111/febs.16334 34954891 165. Ji Y, Chen W, Wang X. Bromodomain and Extraterminal Domain Protein 2 in Multiple Human Diseases. J Pharmacol Exp Ther 2024;389:277–88. 10.1124/jpet.123.002036. 10.1124/jpet.123.002036 38565308 166. Wang Z-Q Zhang Z-C Wu Y-Y Pi Y-N Lou S-H Liu T-B Bromodomain and extraterminal (BET) proteins: biological functions, diseases and targeted therapy Signal Transduct Target Ther 2023 8 420 10.1038/s41392-023-01647-6 37926722 PMC10625992 Wang Z-Q, Zhang Z-C, Wu Y-Y, Pi Y-N, Lou S-H, Liu T-B, et al. Bromodomain and extraterminal (BET) proteins: biological functions, diseases and targeted therapy. Signal Transduct Target Ther. 2023;8:420. 10.1038/s41392-023-01647-6. 37926722 10.1038/s41392-023-01647-6 PMC10625992 167. Xiang H Xiao Y Li F Li C Liu L Deng T Development and validation of an interpretable model integrating multimodal information for improving ovarian cancer diagnosis Nat Commun 2024 15 2681 10.1038/s41467-024-46700-2 38538600 PMC10973484 Xiang H, Xiao Y, Li F, Li C, Liu L, Deng T, et al. Development and validation of an interpretable model integrating multimodal information for improving ovarian cancer diagnosis. Nat Commun. 2024;15:2681. 10.1038/s41467-024-46700-2. 38538600 10.1038/s41467-024-46700-2 PMC10973484 168. Andrikopoulou A Liontos M Koutsoukos K Dimopoulos M-A Zagouri F Clinical perspectives of BET inhibition in ovarian cancer Cell Oncol 2021 44 237 249 10.1007/s13402-020-00578-6 33469840 Andrikopoulou A, Liontos M, Koutsoukos K, Dimopoulos M-A, Zagouri F. Clinical perspectives of BET inhibition in ovarian cancer. Cell Oncol. 2021;44:237–49. 10.1007/s13402-020-00578-6. 10.1007/s13402-020-00578-6 33469840 169. Karakashev S Zhu H Yokoyama Y Zhao B Fatkhutdinov N Kossenkov AV BET Bromodomain Inhibition Synergizes with PARP Inhibitor in Epithelial Ovarian Cancer Cell Rep 2017 21 3398 3405 10.1016/j.celrep.2017.11.095 29262321 PMC5745042 Karakashev S, Zhu H, Yokoyama Y, Zhao B, Fatkhutdinov N, Kossenkov AV, et al. BET Bromodomain Inhibition Synergizes with PARP Inhibitor in Epithelial Ovarian Cancer. Cell Rep. 2017;21:3398–405. 10.1016/j.celrep.2017.11.095. 29262321 10.1016/j.celrep.2017.11.095 PMC5745042 170. Liu A Fan D Wang Y The BET bromodomain inhibitor i-BET151 impairs ovarian cancer metastasis and improves antitumor immunity Cell Tissue Res 2018 374 577 585 10.1007/s00441-018-2906-y 30182276 Liu A, Fan D, Wang Y. The BET bromodomain inhibitor i-BET151 impairs ovarian cancer metastasis and improves antitumor immunity. Cell Tissue Res. 2018;374:577–85. 10.1007/s00441-018-2906-y. 30182276 10.1007/s00441-018-2906-y 171. Wu Y Jennings NB Sun Y Dasari SK Bayraktar E Corvigno S Targeting CCR2+ macrophages with BET inhibitor overcomes adaptive resistance to anti-VEGF therapy in ovarian cancer J Cancer Res Clin Oncol 2022 148 803 821 10.1007/s00432-021-03885-z 35094142 PMC8930900 Wu Y, Jennings NB, Sun Y, Dasari SK, Bayraktar E, Corvigno S, et al. Targeting CCR2+ macrophages with BET inhibitor overcomes adaptive resistance to anti-VEGF therapy in ovarian cancer. J Cancer Res Clin Oncol. 2022;148:803–21. 10.1007/s00432-021-03885-z. 35094142 10.1007/s00432-021-03885-z PMC8930900 172. Liu K, Zhou Z, Gao H, Yang F, Qian Y, Jin H, et al. JQ1, a BET-bromodomain inhibitor, inhibits human cancer growth and suppresses PD-L1 expression. Cell Biol Int 2019;43:642–50. 10.1002/cbin.11139. 10.1002/cbin.11139 30958600 173. Zhu H Bengsch F Svoronos N Rutkowski MR Bitler BG Allegrezza MJ BET Bromodomain Inhibition Promotes Anti-tumor Immunity by Suppressing PD-L1 Expression Cell Rep 2016 16 2829 2837 10.1016/j.celrep.2016.08.032 27626654 PMC5177024 Zhu H, Bengsch F, Svoronos N, Rutkowski MR, Bitler BG, Allegrezza MJ, et al. BET Bromodomain Inhibition Promotes Anti-tumor Immunity by Suppressing PD-L1 Expression. Cell Rep. 2016;16:2829–37. 10.1016/j.celrep.2016.08.032. 27626654 10.1016/j.celrep.2016.08.032 PMC5177024 174. Xu M, Xu C, Wang R, Tang Q, Zhou Q, Wu W, et al. Treating human cancer by targeting EZH2. Genes Dis 2025;12:101313. 10.1016/j.gendis.2024.101313. 10.1016/j.gendis.2024.101313 PMC11870178 40028035 175. Li N Geng F Liang S-M Qin X USP7 inhibits TIMP2 by up-regulating the expression of EZH2 to activate the NF-κB/PD-L1 axis to promote the development of cervical cancer Cell Signal 2022 96 110351 10.1016/j.cellsig.2022.110351 35523402 Li N, Geng F, Liang S-M, Qin X. USP7 inhibits TIMP2 by up-regulating the expression of EZH2 to activate the NF-κB/PD-L1 axis to promote the development of cervical cancer. Cell Signal. 2022;96: 110351. 10.1016/j.cellsig.2022.110351. 35523402 10.1016/j.cellsig.2022.110351 176. Wang Q, Sudan K, Schmoeckel E, Kost BP, Kuhn C, Vattai A, et al. CCL22-Polarized TAMs to M2a Macrophages in Cervical Cancer In Vitro Model. Cells 2022;11. 10.3390/cells11132027. 10.3390/cells11132027 PMC9265611 35805111 177. Zhang L Tian S Chang J Quan S Yang T Zhao M Activation of the CCL22/CCR4 causing EMT process remodeling under EZH2-mediated epigenetic regulation in cervical carcinoma J Cancer 2024 15 6299 6314 10.7150/jca.101881 39513112 PMC11540513 Zhang L, Tian S, Chang J, Quan S, Yang T, Zhao M, et al. Activation of the CCL22/CCR4 causing EMT process remodeling under EZH2-mediated epigenetic regulation in cervical carcinoma. J Cancer. 2024;15:6299–314. 10.7150/jca.101881. 39513112 10.7150/jca.101881 PMC11540513 178. Spiliopoulou P Spear S Mirza H Garner I McGarry L Grundland-Freile F Dual G9A/EZH2 Inhibition Stimulates Antitumor Immune Response in Ovarian High-Grade Serous Carcinoma Mol Cancer Ther 2022 21 522 534 10.1158/1535-7163.MCT-21-0743 35131874 PMC9377747 Spiliopoulou P, Spear S, Mirza H, Garner I, McGarry L, Grundland-Freile F, et al. Dual G9A/EZH2 Inhibition Stimulates Antitumor Immune Response in Ovarian High-Grade Serous Carcinoma. Mol Cancer Ther. 2022;21:522–34. 10.1158/1535-7163.MCT-21-0743. 35131874 10.1158/1535-7163.MCT-21-0743 PMC9377747 179. Porazzi P Nason S Yang Z Carturan A Ghilardi G Guruprasad P EZH1/EZH2 inhibition enhances adoptive T cell immunotherapy against multiple cancer models Cancer Cell 2025 43 537 551.e7 10.1016/j.ccell.2025.01.013 39983725 Porazzi P, Nason S, Yang Z, Carturan A, Ghilardi G, Guruprasad P, et al. EZH1/EZH2 inhibition enhances adoptive T cell immunotherapy against multiple cancer models. Cancer Cell. 2025;43:537-551.e7. 10.1016/j.ccell.2025.01.013. 39983725 10.1016/j.ccell.2025.01.013 180. Chen C Ge J Lu Q Ping G Yang C Fang X Expression of Lysine-specific demethylase 1 in human epithelial ovarian cancer J Ovarian Res 2015 8 28 10.1186/s13048-015-0155-1 25956476 PMC4429353 Chen C, Ge J, Lu Q, Ping G, Yang C, Fang X. Expression of Lysine-specific demethylase 1 in human epithelial ovarian cancer. J Ovarian Res. 2015;8:28. 10.1186/s13048-015-0155-1. 25956476 10.1186/s13048-015-0155-1 PMC4429353 181. Hosseini A Minucci S A Comprehensive Review of Lysine-Specific Demethylase 1 and its Roles in Cancer Epigenomics 2017 9 1123 1142 10.2217/epi-2017-0022 28699367 Hosseini A, Minucci S. A Comprehensive Review of Lysine-Specific Demethylase 1 and its Roles in Cancer. Epigenomics. 2017;9:1123–42. 10.2217/epi-2017-0022. 28699367 10.2217/epi-2017-0022 182. Beilner D Kuhn C Kost BP Jückstock J Mayr D Schmoeckel E Lysine-specific histone demethylase 1A (LSD1) in cervical cancer J Cancer Res Clin Oncol 2020 146 2843 2850 10.1007/s00432-020-03338-z 32725356 PMC7519903 Beilner D, Kuhn C, Kost BP, Jückstock J, Mayr D, Schmoeckel E, et al. Lysine-specific histone demethylase 1A (LSD1) in cervical cancer. J Cancer Res Clin Oncol. 2020;146:2843–50. 10.1007/s00432-020-03338-z. 32725356 10.1007/s00432-020-03338-z PMC7519903 183. Lee DY Salahuddin T Iqbal J Lysine-Specific Demethylase 1 (LSD1)-Mediated Epigenetic Modification of Immunogenicity and Immunomodulatory Effects in Breast Cancers Curr Oncol 2023 30 2127 2143 10.3390/curroncol30020164 36826125 PMC9955398 Lee DY, Salahuddin T, Iqbal J. Lysine-Specific Demethylase 1 (LSD1)-Mediated Epigenetic Modification of Immunogenicity and Immunomodulatory Effects in Breast Cancers. Curr Oncol. 2023;30:2127–43. 10.3390/curroncol30020164. 36826125 10.3390/curroncol30020164 PMC9955398 184. Qin Y Vasilatos SN Chen L Wu H Cao Z Fu Y Inhibition of histone lysine-specific demethylase 1 elicits breast tumor immunity and enhances antitumor efficacy of immune checkpoint blockade Oncogene 2019 38 390 405 10.1038/s41388-018-0451-5 30111819 PMC6336685 Qin Y, Vasilatos SN, Chen L, Wu H, Cao Z, Fu Y, et al. Inhibition of histone lysine-specific demethylase 1 elicits breast tumor immunity and enhances antitumor efficacy of immune checkpoint blockade. Oncogene. 2019;38:390–405. 10.1038/s41388-018-0451-5. 30111819 10.1038/s41388-018-0451-5 PMC6336685 185. Xu S Wang X Yang Y Li Y Wu S LSD1 silencing contributes to enhanced efficacy of anti-CD47/PD-L1 immunotherapy in cervical cancer Cell Death Dis 2021 12 282 10.1038/s41419-021-03556-4 33731702 PMC7969769 Xu S, Wang X, Yang Y, Li Y, Wu S. LSD1 silencing contributes to enhanced efficacy of anti-CD47/PD-L1 immunotherapy in cervical cancer. Cell Death Dis. 2021;12:282. 10.1038/s41419-021-03556-4. 33731702 10.1038/s41419-021-03556-4 PMC7969769 186. Meng F Sun G Zhong M Yu Y Brewer AM Inhibition of DNA methyltransferases, histone deacetylases and lysine-specific demethylase-1 suppresses the tumorigenicity of the ovarian cancer ascites cell line SKOV3 Int J Oncol 2013 43 495 502 10.3892/ijo.2013.1960 23709006 Meng F, Sun G, Zhong M, Yu Y, Brewer AM. Inhibition of DNA methyltransferases, histone deacetylases and lysine-specific demethylase-1 suppresses the tumorigenicity of the ovarian cancer ascites cell line SKOV3. Int J Oncol. 2013;43:495–502. 10.3892/ijo.2013.1960. 23709006 10.3892/ijo.2013.1960 187. Soldi R Ghosh Halder T Weston A Thode T Drenner K Lewis R The novel reversible LSD1 inhibitor SP-2577 promotes anti-tumor immunity in SWItch/Sucrose-NonFermentable (SWI/SNF) complex mutated ovarian cancer PLoS ONE 2020 15 e0235705 10.1371/journal.pone.0235705 32649682 PMC7351179 Soldi R, Ghosh Halder T, Weston A, Thode T, Drenner K, Lewis R, et al. The novel reversible LSD1 inhibitor SP-2577 promotes anti-tumor immunity in SWItch/Sucrose-NonFermentable (SWI/SNF) complex mutated ovarian cancer. PLoS ONE. 2020;15: e0235705. 10.1371/journal.pone.0235705. 32649682 10.1371/journal.pone.0235705 PMC7351179 188. Li Y Wang B Zheng Y Kang H He A Zhao L The multifaceted role of post-translational modifications of LSD1 in cellular processes and disease pathogenesis Genes Dis 2025 12 101307 10.1016/j.gendis.2024.101307 40028036 PMC11870172 Li Y, Wang B, Zheng Y, Kang H, He A, Zhao L, et al. The multifaceted role of post-translational modifications of LSD1 in cellular processes and disease pathogenesis. Genes Dis. 2025;12: 101307. 10.1016/j.gendis.2024.101307. 40028036 10.1016/j.gendis.2024.101307 PMC11870172 189. Konovalov S Garcia-Bassets I Analysis of the levels of lysine-specific demethylase 1 (LSD1) mRNA in human ovarian tumors and the effects of chemical LSD1 inhibitors in ovarian cancer cell lines J Ovarian Res 2013 6 75 10.1186/1757-2215-6-75 24165091 PMC4176291 Konovalov S, Garcia-Bassets I. Analysis of the levels of lysine-specific demethylase 1 (LSD1) mRNA in human ovarian tumors and the effects of chemical LSD1 inhibitors in ovarian cancer cell lines. J Ovarian Res. 2013;6:75. 10.1186/1757-2215-6-75. 24165091 10.1186/1757-2215-6-75 PMC4176291 190. Huang R, Nakamura B, Senguttuvan R, Li Y-J, Martincuks A, Bakkar R, et al. A Critical Role of Intracellular PD-L1 in Promoting Ovarian Cancer Progression. Cells 2025;14. 10.3390/cells14040314. 10.3390/cells14040314 PMC11853747 39996786 191. Dai M Liu M Yang H Küçük C You H New insights into epigenetic regulation of resistance to PD-1/PD-L1 blockade cancer immunotherapy: mechanisms and therapeutic opportunities Exp Hematol Oncol 2022 11 101 10.1186/s40164-022-00356-0 36384676 PMC9667634 Dai M, Liu M, Yang H, Küçük C, You H. New insights into epigenetic regulation of resistance to PD-1/PD-L1 blockade cancer immunotherapy: mechanisms and therapeutic opportunities. Exp Hematol Oncol. 2022;11:101. 10.1186/s40164-022-00356-0. 36384676 10.1186/s40164-022-00356-0 PMC9667634 192. Li X, Li Y, Dong L, Chang Y, Zhang X, Wang C, et al. Decitabine priming increases anti–PD-1 antitumor efficacy by promoting CD8+ progenitor exhausted T cell expansion in tumor models. J Clin Invest 2023;133. 10.1172/JCI165673. 10.1172/JCI165673 PMC10065084 36853831 193. Lu Y Chan Y-T Tan H-Y Li S Wang N Feng Y Epigenetic regulation in human cancer: the potential role of epi-drug in cancer therapy Mol Cancer 2020 19 79 10.1186/s12943-020-01197-3 32340605 PMC7184703 Lu Y, Chan Y-T, Tan H-Y, Li S, Wang N, Feng Y. Epigenetic regulation in human cancer: the potential role of epi-drug in cancer therapy. Mol Cancer. 2020;19:79. 10.1186/s12943-020-01197-3. 32340605 10.1186/s12943-020-01197-3 PMC7184703 194. Stone ML Chiappinelli KB Li H Murphy L Topper M Baylin S Abstract 4907: Epigenetic treatment of ovarian cancer cells increases immune cell recruitment to the tumor microenvironment: implications for response to immune checkpoint therapy Cancer Res 2016 76 4907 10.1158/1538-7445.AM2016-4907 Stone ML, Chiappinelli KB, Li H, Murphy L, Topper M, Baylin S, et al. Abstract 4907: Epigenetic treatment of ovarian cancer cells increases immune cell recruitment to the tumor microenvironment: implications for response to immune checkpoint therapy. Cancer Res. 2016;76:4907. 10.1158/1538-7445.AM2016-4907. 195. Landon BV Kaleka G Balan A Boland JL Cherry C Pereira G Abstract 7551: Combined epigenetic therapy and immune checkpoint blockade drive reshaping of the tumor microenvironment of platinum resistant ovarian cancer Cancer Res 2024 84 7551 10.1158/1538-7445.AM2024-7551 Landon BV, Kaleka G, Balan A, Boland JL, Cherry C, Pereira G, et al. Abstract 7551: Combined epigenetic therapy and immune checkpoint blockade drive reshaping of the tumor microenvironment of platinum resistant ovarian cancer. Cancer Res. 2024;84:7551. 10.1158/1538-7445.AM2024-7551. 196. Shu M Fan Z Huang B Wang C Retrospective analysis of clinical features of pembrolizumab induced psoriasis Invest New Drugs 2025 43 582 587 10.1007/s10637-025-01536-5 40304864 Shu M, Fan Z, Huang B, Wang C. Retrospective analysis of clinical features of pembrolizumab induced psoriasis. Invest New Drugs. 2025;43:582–7. 10.1007/s10637-025-01536-5. 40304864 10.1007/s10637-025-01536-5 197. Fukumoto T Fatkhutdinov N Zundell JA Tcyganov EN Nacarelli T Karakashev S HDAC6 Inhibition Synergizes with Anti-PD-L1 Therapy in ARID1A-Inactivated Ovarian Cancer Cancer Res 2019 79 5482 5489 10.1158/0008-5472.CAN-19-1302 31311810 PMC6825538 Fukumoto T, Fatkhutdinov N, Zundell JA, Tcyganov EN, Nacarelli T, Karakashev S, et al. HDAC6 Inhibition Synergizes with Anti-PD-L1 Therapy in ARID1A-Inactivated Ovarian Cancer. Cancer Res. 2019;79:5482–9. 10.1158/0008-5472.CAN-19-1302. 31311810 10.1158/0008-5472.CAN-19-1302 PMC6825538 198. Wen Y Ye S Li Z Zhang X Liu C Wu Y HDAC6 inhibitor ACY-1215 enhances STAT1 acetylation to block PD-L1 for colorectal cancer immunotherapy Cancer Immunol Immunother 2024 73 7 10.1007/s00262-023-03624-y 38231305 PMC10794344 Wen Y, Ye S, Li Z, Zhang X, Liu C, Wu Y, et al. HDAC6 inhibitor ACY-1215 enhances STAT1 acetylation to block PD-L1 for colorectal cancer immunotherapy. Cancer Immunol Immunother. 2024;73:7. 10.1007/s00262-023-03624-y. 38231305 10.1007/s00262-023-03624-y PMC10794344 199. Mazzone R Zwergel C Mai A Valente S Epi-drugs in combination with immunotherapy: a new avenue to improve anticancer efficacy Clin Epigenetics 2017 9 59 10.1186/s13148-017-0358-y 28572863 PMC5450222 Mazzone R, Zwergel C, Mai A, Valente S. Epi-drugs in combination with immunotherapy: a new avenue to improve anticancer efficacy. Clin Epigenetics. 2017;9:59. 10.1186/s13148-017-0358-y. 28572863 10.1186/s13148-017-0358-y PMC5450222 200. Shi W, Han X, Yao J, Yang J, Shi Y. Combined effect of histone deacetylase inhibitor suberoylanilide hydroxamic acid and anti-CD20 monoclonal antibody rituximab on mantle cell lymphoma cells apoptosis. Leuk Res 2012;36:749–55. 10.1016/j.leukres.2012.01.027. 10.1016/j.leukres.2012.01.027 22475365 201. Choudhry P Mariano MC Geng H Martin TG 3rd Wolf JL Wong SW DNA methyltransferase inhibitors upregulate CD38 protein expression and enhance daratumumab efficacy in multiple myeloma Leukemia 2020 34 938 941 10.1038/s41375-019-0587-5 31595037 PMC7214267 Choudhry P, Mariano MC, Geng H, Martin TG 3rd, Wolf JL, Wong SW, et al. DNA methyltransferase inhibitors upregulate CD38 protein expression and enhance daratumumab efficacy in multiple myeloma. Leukemia. 2020;34:938–41. 10.1038/s41375-019-0587-5. 31595037 10.1038/s41375-019-0587-5 PMC7214267 202. Modesitt SC Sill M Hoffman JS Bender DP A phase II study of vorinostat in the treatment of persistent or recurrent epithelial ovarian or primary peritoneal carcinoma: a Gynecologic Oncology Group study Gynecol Oncol 2008 109 182 186 10.1016/j.ygyno.2008.01.009 18295319 Modesitt SC, Sill M, Hoffman JS, Bender DP. A phase II study of vorinostat in the treatment of persistent or recurrent epithelial ovarian or primary peritoneal carcinoma: a Gynecologic Oncology Group study. Gynecol Oncol. 2008;109:182–6. 10.1016/j.ygyno.2008.01.009. 18295319 10.1016/j.ygyno.2008.01.009 203. El Omari N, Khalid A, Makeen HA, Alhazmi HA, Albratty M, Mohan S, et al. Stochasticity of anticancer mechanisms underlying clinical effectiveness of vorinostat. Heliyon 2024;10. 10.1016/j.heliyon.2024.e33052. 10.1016/j.heliyon.2024.e33052 PMC11253278 39021957 204. Ma X Wang J Liu J Mo Q Yan X Ma D Targeting CD146 in combination with vorinostat for the treatment of ovarian cancer cells Oncol Lett 2017 13 1681 1687 10.3892/ol.2017.5630 28454309 PMC5403387 Ma X, Wang J, Liu J, Mo Q, Yan X, Ma D, et al. Targeting CD146 in combination with vorinostat for the treatment of ovarian cancer cells. Oncol Lett. 2017;13:1681–7. 10.3892/ol.2017.5630. 28454309 10.3892/ol.2017.5630 PMC5403387 205. Ma X Liu J Wu J Yan X Wu P Liu Y Synergistic Killing Effect between Vorinostat and Target of CD146 in Malignant Cells Clin Cancer Res 2010 16 5165 5176 10.1158/1078-0432.CCR-09-3174 20884621 Ma X, Liu J, Wu J, Yan X, Wu P, Liu Y, et al. Synergistic Killing Effect between Vorinostat and Target of CD146 in Malignant Cells. Clin Cancer Res. 2010;16:5165–76. 10.1158/1078-0432.CCR-09-3174. 20884621 10.1158/1078-0432.CCR-09-3174 206. Veschi V, Turdo A, Stassi G. Novel insights into cancer stem cells targeting: CAR-T therapy and epigenetic drugs as new pillars in cancer treatment. Front Mol Med 2023;3. 10.3389/fmmed.2023.1120090 PMC11285630 39086678 207. VanNoy EL Yi Z Lee A El Ghorayeb L Chiappinelli K Haydar D Abstract B021: Epigenetic reprogramming with DNA methylation inhibitors during CAR T cell manufacturing enhances anti-tumor activity, persistence, and cytotoxicity against solid and brain tumors Cancer Res 2025 85 B021 B021 10.1158/1538-7445.DNAMETHYLATION-B021 VanNoy EL, Yi Z, Lee A, El Ghorayeb L, Chiappinelli K, Haydar D. Abstract B021: Epigenetic reprogramming with DNA methylation inhibitors during CAR T cell manufacturing enhances anti-tumor activity, persistence, and cytotoxicity against solid and brain tumors. Cancer Res. 2025;85:B021–B021. 10.1158/1538-7445.DNAMETHYLATION-B021. 208. Jo D-H, Kaczmarek S, Khan AUH, Pervin J, Clark DM, Gadde S, et al. Entinostat, a histone deacetylase inhibitor, enhances CAR-NK cell anti-tumor activity by sustaining CAR expression. Front Immunol 2025; 16. 10.3389/fimmu.2025.1533044 PMC11925867 40124378 209. Osei-Hwedieh D, Fan S, Ferrone S, Wang X, Schwab J, He L, et al. Hdac Inhibitor (Saha) Enhances B7-H3-Specific Car T Cell Cytotoxic Efficacy Against Chondrosarcoma Cells and Prolongs Survival in an Orthotopic Mouse Model. 2024. 10.2139/ssrn.4853690. 210. Harrer DC, Schenkel C, Berking C, Herr W, Abken H, Dörrie J, et al. Decitabine-Mediated Upregulation of CSPG4 in Ovarian Carcinoma Cells Enables Targeting by CSPG4-Specific CAR-T Cells. Cancers (Basel) 2022;14. 10.3390/cancers14205033. 10.3390/cancers14205033 PMC9599610 36291817 211. Xu Y, Jiang J, Wang Y, Wang W, Li H, Lai W, et al. Engineered T Cell Therapy for Gynecologic Malignancies: Challenges and Opportunities. Front Immunol 2021;12. 10.3389/fimmu.2021.725330 PMC8353443 34386017 212. Wang L, Lin X, Yu L, Sun P. Romidepsin Enhances the Killing Ability of NKG2D-CAR-T Cells through Enhanced Expression of NKG2DL against Ovarian Cancer Cells. CEOG 2022;49:227. 213. Li L-H, Zhang P-R, Cai P-Y, Li Z-C. Histone deacetylase inhibitor, Romidepsin (FK228) inhibits endometrial cancer cell growth through augmentation of p53-p21 pathway. Biomed Pharmacother 2016;82:161–6. 10.1016/j.biopha.2016.04.053. 10.1016/j.biopha.2016.04.053 27470351 214. El Omari N, Lee L-H, Bakrim S, Makeen HA, Alhazmi HA, Mohan S, et al. Molecular mechanistic pathways underlying the anticancer therapeutic efficiency of romidepsin. Biomed Pharmacother 2023;164:114774. 10.1016/j.biopha.2023.114774. 10.1016/j.biopha.2023.114774 37224749 215. Wong-Brown MW van der Westhuizen A Bowden NA Sequential azacitidine and carboplatin induces immune activation in platinum-resistant high-grade serous ovarian cancer cell lines and primes for checkpoint inhibitor immunotherapy BMC Cancer 2022 22 100 10.1186/s12885-022-09197-w 35073851 PMC8787901 Wong-Brown MW, van der Westhuizen A, Bowden NA. Sequential azacitidine and carboplatin induces immune activation in platinum-resistant high-grade serous ovarian cancer cell lines and primes for checkpoint inhibitor immunotherapy. BMC Cancer. 2022;22:100. 10.1186/s12885-022-09197-w. 35073851 10.1186/s12885-022-09197-w PMC8787901 216. Stone ML. COMBINATION EPIGENETIC THERAPY CAN SENSITIZE OVARIAN CANCER TO IMMUNE CHECKPOINT THERAPY 2017. 217. Wang L Amoozgar Z Huang J Saleh MH Xing D Orsulic S Decitabine Enhances Lymphocyte Migration and Function and Synergizes with CTLA-4 Blockade in a Murine Ovarian Cancer Model Cancer Immunol Res 2015 3 1030 1041 10.1158/2326-6066.CIR-15-0073 26056145 Wang L, Amoozgar Z, Huang J, Saleh MH, Xing D, Orsulic S, et al. Decitabine Enhances Lymphocyte Migration and Function and Synergizes with CTLA-4 Blockade in a Murine Ovarian Cancer Model. Cancer Immunol Res. 2015;3:1030–41. 10.1158/2326-6066.CIR-15-0073. 26056145 10.1158/2326-6066.CIR-15-0073 218. Alexandraki A, Strati K. Decitabine Treatment Induces a Viral Mimicry Response in Cervical Cancer Cells and Further Sensitizes Cells to Chemotherapy. Int J Mol Sci 2022;23. 10.3390/ijms232214042. 10.3390/ijms232214042 PMC9692951 36430521 219. Stiff PJ, Mehrotra S, Potkul RK, Banerjee S, Walker C, Drakes ML. Selinexor in Combination with Decitabine Attenuates Ovarian Cancer in Mice. Cancers (Basel) 2023;15. 10.3390/cancers15184541. 10.3390/cancers15184541 PMC10526280 37760508 220. Yang D Huang F-X Wei W Li Q-Q Wu J-W Huang Y Loss of HRD functional phenotype impedes immunotherapy and can be reversed by HDAC inhibitor in ovarian cancer Int J Biol Sci 2023 19 1846 1860 10.7150/ijbs.79654 37063431 PMC10092773 Yang D, Huang F-X, Wei W, Li Q-Q, Wu J-W, Huang Y, et al. Loss of HRD functional phenotype impedes immunotherapy and can be reversed by HDAC inhibitor in ovarian cancer. Int J Biol Sci. 2023;19:1846–60. 10.7150/ijbs.79654. 37063431 10.7150/ijbs.79654 PMC10092773 221. Hsieh T-H Hsu C-Y Wu C-W Wang S-H Yeh C-H Cheng K-H Vorinostat decrease M2 macrophage polarization through ARID1A(6488delG)/HDAC6/IL-10 signaling pathway in endometriosis-associated ovarian carcinoma Biomed Pharmacother 2023 161 114500 10.1016/j.biopha.2023.114500 36958195 Hsieh T-H, Hsu C-Y, Wu C-W, Wang S-H, Yeh C-H, Cheng K-H, et al. Vorinostat decrease M2 macrophage polarization through ARID1A(6488delG)/HDAC6/IL-10 signaling pathway in endometriosis-associated ovarian carcinoma. Biomed Pharmacother. 2023;161: 114500. 10.1016/j.biopha.2023.114500. 36958195 10.1016/j.biopha.2023.114500 222. Xia C, He Z, Cai Y, Liang S. Vorinostat upregulates MICA via the PI3K/Akt pathway to enhance the ability of natural killer cells to kill tumor cells. Eur J Pharmacol 2020;875:173057. 10.1016/j.ejphar.2020.173057. 10.1016/j.ejphar.2020.173057 32135122 223. Wilson AJ Dai X Liu Q Hiebert S Crispens M Khabele D Abstract A32: Combination panobinostat and olaparib treatment promotes DNA damage and antitumor immunity in ovarian cancer Clin Cancer Res 2020 26 A32 A32 10.1158/1557-3265.OVCA19-A32 Wilson AJ, Dai X, Liu Q, Hiebert S, Crispens M, Khabele D. Abstract A32: Combination panobinostat and olaparib treatment promotes DNA damage and antitumor immunity in ovarian cancer. Clin Cancer Res. 2020;26:A32–A32. 10.1158/1557-3265.OVCA19-A32. 224. Jose A, Shenoy P V, Malik Y, Keni SS, Arya N, Kolathur KK. Epigenetic Therapy in Cervical Cancer BT - Epigenetics of Cervical Cancer. In: Kabekkodu SP, Chatterjee A, Chakrabarty S, editors., Singapore: Springer Nature Singapore; 2025, p. 153–85. 10.1007/978-981-96-3985-4_11. 225. Mackay HJ Hirte H Colgan T Covens A MacAlpine K Grenci P Phase II trial of the histone deacetylase inhibitor belinostat in women with platinum resistant epithelial ovarian cancer and micropapillary (LMP) ovarian tumours Eur J Cancer 2010 46 1573 1579 10.1016/j.ejca.2010.02.047 20304628 PMC3244274 Mackay HJ, Hirte H, Colgan T, Covens A, MacAlpine K, Grenci P, et al. Phase II trial of the histone deacetylase inhibitor belinostat in women with platinum resistant epithelial ovarian cancer and micropapillary (LMP) ovarian tumours. Eur J Cancer. 2010;46:1573–9. 10.1016/j.ejca.2010.02.047. 20304628 10.1016/j.ejca.2010.02.047 PMC3244274 226. Meteran H, Knudsen AØ, Jørgensen TL, Nielsen D, Herrstedt J. Carboplatin plus Paclitaxel in Combination with the Histone Deacetylate Inhibitor, Vorinostat, in Patients with Recurrent Platinum-Sensitive Ovarian Cancer. J Clin Med 2024;13. 10.3390/jcm13030897. 10.3390/jcm13030897 PMC10856581 38337591 227. Dizon DS Damstrup L Finkler NJ Lassen U Celano P Glasspool R Phase II activity of belinostat (PXD-101), carboplatin, and paclitaxel in women with previously treated ovarian cancer Int J Gynecol Cancer Off J Int Gynecol Cancer Soc 2012 22 979 986 10.1097/IGC.0b013e31825736fd 22694911 Dizon DS, Damstrup L, Finkler NJ, Lassen U, Celano P, Glasspool R, et al. Phase II activity of belinostat (PXD-101), carboplatin, and paclitaxel in women with previously treated ovarian cancer. Int J Gynecol Cancer Off J Int Gynecol Cancer Soc. 2012;22:979–86. 10.1097/IGC.0b013e31825736fd. 10.1097/IGC.0b013e31825736fd 22694911 228. Glasspool RM Brown R Gore ME Rustin GJS McNeish IA Wilson RH A randomised, phase II trial of the DNA-hypomethylating agent 5-aza-2’-deoxycytidine (decitabine) in combination with carboplatin vs carboplatin alone in patients with recurrent, partially platinum-sensitive ovarian cancer Br J Cancer 2014 110 1923 1929 10.1038/bjc.2014.116 24642620 PMC3992493 Glasspool RM, Brown R, Gore ME, Rustin GJS, McNeish IA, Wilson RH, et al. A randomised, phase II trial of the DNA-hypomethylating agent 5-aza-2’-deoxycytidine (decitabine) in combination with carboplatin vs carboplatin alone in patients with recurrent, partially platinum-sensitive ovarian cancer. Br J Cancer. 2014;110:1923–9. 10.1038/bjc.2014.116. 24642620 10.1038/bjc.2014.116 PMC3992493 229. Liang Y, Wang L, Ma P, Ju D, Zhao M, Shi Y. Enhancing anti-tumor immune responses through combination therapies: epigenetic drugs and immune checkpoint inhibitors. Front Immunol 2023;14. 10.3389/fimmu.2023.1308264 PMC10704038 38077327 230. Marbach D Brouer-Visser J Brennan L Wilson S Davydov II Staedler N Immune modulation in solid tumors: a phase 1b study of RO6870810 (BET inhibitor) and atezolizumab (PD-L1 inhibitor) BMC Cancer 2025 25 500 10.1186/s12885-025-13851-4 40102759 PMC11916277 Marbach D, Brouer-Visser J, Brennan L, Wilson S, Davydov II, Staedler N, et al. Immune modulation in solid tumors: a phase 1b study of RO6870810 (BET inhibitor) and atezolizumab (PD-L1 inhibitor). BMC Cancer. 2025;25:500. 10.1186/s12885-025-13851-4. 40102759 10.1186/s12885-025-13851-4 PMC11916277 231. Bellone S Roque DM Siegel ER Buza N Hui P Bonazzoli E A phase II evaluation of pembrolizumab in recurrent microsatellite instability-high (MSI-H) endometrial cancer patients with Lynch-like versus MLH-1 methylated characteristics ( NCT02899793 Ann Oncol Off J Eur Soc Med Oncol 2021 32 1045 1046 10.1016/j.annonc.2021.04.013 PMC9465821 33932502 Bellone S, Roque DM, Siegel ER, Buza N, Hui P, Bonazzoli E, et al. A phase II evaluation of pembrolizumab in recurrent microsatellite instability-high (MSI-H) endometrial cancer patients with Lynch-like versus MLH-1 methylated characteristics ( NCT02899793 10.1016/j.annonc.2021.04.013 PMC9465821 33932502 ",
  "metadata": {
    "Title of this paper": "A phase II evaluation of pembrolizumab in recurrent microsatellite instability-high (MSI-H) endometrial cancer patients with Lynch-like versus MLH-1 methylated characteristics (",
    "Journal it was published in:": "Journal of Experimental & Clinical Cancer Research : CR",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487091/"
  }
}