{
  "title": "Paper_619",
  "abstract": "pmc J Biol Chem J Biol Chem 567 jbc The Journal of Biological Chemistry 0021-9258 1083-351X American Society for Biochemistry and Molecular Biology PMC12481917 PMC12481917.1 12481917 12481917 40825507 10.1016/j.jbc.2025.110607 S0021-9258(25)02458-5 110607 1 Research Article Andrographolide modulates glucose metabolism in visceral adipose tissue in an Alzheimer's disease obese mouse model Ormazabal Paulina 1 ‡ Gherardelli Camila 2 ‡ Pinto Cristina 3 Servili Evrim 4 Mendez-Orellana Carolina 5 6 Wong G. William 7 8 Contreras-Díaz Roberto 9 Cisternas Pedro pcisternasf@udla.cl 10 ∗ Inestrosa Nibaldo C. nibaldo.inestrosa@umag.cl 2 3 ∗ 1 2 3 4 5 6 7 8 9 10 ∗ pcisternasf@udla.cl nibaldo.inestrosa@umag.cl ‡ These authors contributed equally to this work. 10 2025 16 8 2025 301 10 497570 110607 3 4 2025 30 7 2025 16 08 2025 01 10 2025 01 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Midlife obesity and high adiposity are recognized as risk factors for Alzheimer's disease (AD), with visceral adipose tissue (VAT) playing a central role due to its endocrine and metabolic activity. Disturbances in VAT metabolism and adipokine secretion exacerbate AD pathology. Andrographolide (Andro), known for its anti-diabetic properties, enhances neuronal glucose uptake and alleviates AD pathology. However, its effects on VAT metabolism in AD remain unexplored. This study aimed to investigate the impact of Andro on glucose metabolism in VAT using a high-fat diet (HFD)-induced obesity model in AD mice (APP/PS1). APP/PS1 mice were fed an HFD and received Andro injections (2 mg/kg, three times a week for 16 weeks). VAT samples were analyzed for glucose uptake, glycolytic rate, pentose phosphate flux, ADP-ATP levels, gene expression, and enzymatic activity of glucose metabolic regulators. In APP/PS1 mice, HFD significantly increased glucose uptake and reduced GLUT4 expression in VAT, effects counteracted by Andro ( p p p p Keywords Alzheimer's disease andrographolide obesity visceral adipose tissue glucose metabolism pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations Aβ amyloid-β AD for Alzheimer's disease AMPK AMP-activated protein kinase Andro Andrographolide Cyt cytochalasin G6PDH glucose-6-phosphate dehydrogenase Glut4 glucose transporter 4 HFD high-fat diet HK hexokinase NCD normal chow diet PFK-1 phosphofructokinase 1 PPP Pentose phosphate pathway VAD visceral adipose tissue Reviewed by members of the JBC Editorial Board. Edited by Qi-Qun Tang Alzheimer's disease (AD) is the most prevalent senile dementia, marked by a gradual cognitive decline ( 1 2 3 4 5 6 7 8 9 10 In recent years, metabolic disorders, such as obesity, diabetes, and hypertension, have emerged as significant risk factors for the development of dementia ( 11 12 13 14 15 16 17 18 19 20 21 15 22 23 24 25 26 27 28 29 30 Andrographolide (Andro), a labdane diterpene and the primary active component of Andrographis paniculata in vivo in vitro 31 32 33 34 35 36 37 38 Results Andro reduces glucose uptake in VAT of HFD-fed animals To study the impact of Andro on glucose metabolism in VAT, we subjected four-month-old APP/PS1 animals to two dietary regimens: a normal chow diet (NCD) and a high-fat diet (HFD), both accompanied by 4 months of intraperitoneal Andro injections ( Fig. 1 A Fig. 1 B Table 1 14 Fig. 1 C Fig. 1 D E Fig. 1 F Fig. 1 G Figure 1 Andro reduces glucose uptake in VAT of HFD-fed animals. A B post hoc C 14 post hoc D 14 post hoc E 14 post hoc F G post hoc Table 1 Metabolic and liver function parameters in APP/PS1 mice under different dietary conditions Blood parameters NCD NCD + Androndro HFD HFD + Andro Glucose (mg/ml) 93.2 ± 9.2 91.3 ± 5.8 140 ± 20.7 121.7 ± 19.8 Cholesterol (mg/dl) 124.7 ± 7.7 121 ± 11.3 191.3 ± 15 150.2 ± 12.8 ∗∗∗ HOMA-IR 0.2 ± 0.02 0.2 ± 0.01 1.3 ± 0.2 0.8 ± 0.1 ∗∗∗ Triglycerides (mg/dl) 87.3 ± 7 86 ± 5.8 166.8 ± 21.3 139.6 ± 11.4 ∗ Insulin (mU/L) 0.7 ± 0.08 0.7 ± 0.05 3.7 ± 0.4 2.7 ± 0.3 ∗∗∗ Alkaline phosphatase (UI/L) 74.72 ± 16.4 92.9 ± 12.3 85.5 ± 13.5 84.1 ± 12.5 AST (UI/L) 93.3 ± 11.3 96.4 ± 9.4 92.5 ± 6.8 87.7 ± 8.1 Values are presented as mean ± SD for each experimental group: normal chow diet (NCD), NCD + andrographolide (Andro), high-fat diet (HFD), and HFD + Andro. Statistical significance was assessed by one-way ANOVA followed by Bonferroni’s post hoc ∗ p p p HFD-induced glycolysis is reversed by Andro, promoting the PPP pathway Due to the observed effect on glucose metabolism and to further characterize the impact of HFD and Andro on VAT on glucose metabolic pathways, we also investigated the rate of glycolysis in VAT. Our findings revealed a 3.5-fold increase in the rate of glycolysis in the VAT of HFD-fed animals compared to those on the NCD ( Fig. 2 A Fig. 2 B via 14 14 14 2 Fig. 2 C Fig. 2 D Figure 2 HFD promotes glycolysis in VAT and Andro mitigates this effect. A 3 2 post hoc B post hoc C 14 2 14 14 post hoc D post hoc Andro induces a decrease in ATP synthesis in the VAT of HFD-fed mice Next, to explore the impact of the observed glycolytic changes on ATP synthesis, we assessed ATP concentrations in VAT. Our findings indicated no alterations in ATP levels in the VAT among the NCD groups ( Fig. 3 A Fig. 3 B Fig. 3 C Figure 3 Andro decreases ATP synthesis in VAT of HFD-fed mice. A B C post hoc Andro decreases the activity of glucose metabolic regulators in VAT To further investigate the impact of Andro on VAT, we also analyzed the activity of key metabolic regulators involved in glucose metabolism. We assessed the activity of phosphofructokinase 1 (PFK-1), AMP-activated protein kinase (AMPK), and pyruvate kinase. No significant differences in PFK-1, AMPK, and pyruvate kinase activities were observed when VAT was treated with Andro in NCD-fed mice compared to the control group ( Fig. 4 A C Fig. 4 A C Figure 4 Andro decreases the activity of glucose metabolic regulators in VAT. A post hoc B post hoc C post hoc Insulin reduces the effect of Andro on glucose uptake in HFD-fed animals Next, we then monitored the uptake of glucose using various glucose uptake modulators or inhibitors such as lithium, insulin, cytochalasin (Cyt) B, or Cyt E. Given insulin’s role in regulating glucose uptake by promoting the glucose transporter 4 (Glut4) translocation to the cell membrane, we next explore the effect of insulin on glucose uptake ( 39 Fig. 5 40 41 42 Figure 5 Andro reduces glucose uptake in the VAT of HFD-fed mice in the presence of insulin and lithium. post hoc Andro regulates the mRNA expression of different metabolic genes in VAT Previous studies have shown that Andro alters the expression of various metabolic genes in the brain ( 43 Fig. 6 A Fig. 6 B Figure 6 Andro regulates the mRNA expression of different metabolic genes in VAT. A B C D E F G H I post hoc Subsequently, we examined the effect of Andro on the expression of key metabolic regulators, such as AMPK, PFK-1, Akt, HK, and pyruvate kinase. A slight but significant upregulation of AMPK was observed after Andro treatment in the NCD-fed animals, compared to the untreated animals ( Fig. 6 C Fig. 6 D 44 45 46 45 46 Fig. 6 E Fig. 6 F G In addition to these metabolic regulators, we also evaluated the mRNA expression of tumor necrosis factor alpha (TNF-α), a key pro-inflammatory cytokine associated with metabolic inflammation in adipose tissue ( 47 48 Figure 6 H Fig. 6 I Discussion Obesity and an increase in VAT mass have been linked to cognitive impairment ( 27 49 50 51 52 53 54 55 56 57 58 59 60 61 62 An unexpected finding was the elevated basal glucose uptake levels observed in HFD animals, compared to those on the NCD. This observation aligns with previous studies indicating increased glucose uptake in adipocytes derived from mice with obesity and in patients with diabetes mellitus ( 63 64 65 28 66 67 68 69 70 71 72 73 70 74 64 75 76 77 64 77 It is noteworthy that HFD stimulated glycolysis and reduced PPP, whereas Andro administration resulted in the opposite effect. Previous studies have indicated that hypoxia, a condition occurring in adipose tissue during obesity, not only increases glucose uptake but also upregulates the expression of various glycolysis-related genes, including Hexokinase and PFK-1 ( 78 79 75 80 In several AD models, impaired glucose metabolism in the brain has been consistently reported ( 81 82 83 84 85 10 36 41 86 87 88 89 90 91 The activation of AMPK, an enzyme that acts as an energy sensor, promotes glucose uptake and the generation of cellular ATP, while reducing ATP consumption ( 92 93 94 95 96 97 98 99 100 101 Additionally, ATP has been shown to play a significant proinflammatory role ( 102 103 Interestingly, we observed a reduction in glucose uptake in VAT together with reduced blood glucose concentration after Andro treatment. Previous studies conducted by our group and others have demonstrated that Andro promotes glucose uptake in a variety of tissues, including brain, pre- and mature adipocytes ( 31 33 36 38 62 104 105 106 Several studies have suggested that cognitive decline is exacerbated by insulin resistance, leading to a reduction of gray matter volume in several brain regions ( 107 108 109 110 111 112 113 114 115 116 Consistent with the glucose-related effects observed in VAT, our findings also revealed that Andrographolide significantly reduced the expression of TNF-α in HFD-fed mice. This result supports the anti-inflammatory potential of Andrographolide in adipose tissue, in agreement with previous reports demonstrating its ability to suppress inflammatory mediators in metabolic and neurodegenerative contexts ( 117 118 119 Additionally, the inclusion of hepatic enzyme measurements in the current study provides further insight into the systemic metabolic impact of Andrographolide. The absence of significant alterations in these markers across groups suggests that Andrographolide does not induce hepatotoxicity and may preserve liver function under high-fat diet conditions, further supporting its metabolic safety profile. While our study represents the first exploration of Andro on VAT and its effects on AD, it comes with certain limitations. Although we demonstrated the restoration of adipocyte function after Andro treatment, we did not analyze its effect on AD. In earlier studies, both we and others have highlighted the positive implications of Andro in AD pathology ( 62 120 121 122 123 124 125 Previous studies have shown that Andrographolide can modulate key metabolic signaling pathways in wild-type models, including the activation of Wnt/β-catenin signaling in C57BL/6J mice ( 123 36 Although body weight was not significantly reduced by Andrographolide treatment, our findings suggest that the compound improves glucose metabolism in VAT through tissue-specific actions, independent of overall body weight changes. This interpretation aligns with recent clinical studies showing that metabolic benefits can occur without weight loss, even under stable body weight conditions ( 126 A limitation of our study is the absence of a wild-type (WT) HFD-fed control group, which restricts our ability to fully discriminate between metabolic alterations driven by the APP/PS1 genotype and those induced solely by high-fat diet exposure. Nonetheless, evidence from previous studies in WT animals by Tapia-Rojas et al. 127 In summary, exploring the impact of Andro on adipose tissue metabolism yields promising insights into its potential applications, particularly in the context of AD. The observed improvements in glucose metabolism within VAT suggest a multifaceted impact of Andro on cellular responses. Considering the established connection between metabolic dysregulation, obesity, and the risk of developing AD, interventions that target adipose tissue functionality hold substantial promise. Thus, the dual role of Andro in mitigating both metabolic and neurodegenerative aspects of AD positions it as a valuable pharmacological candidate for further research. Experimental procedures Animals and ethical standards Male APP/PS1 (RRID: MMRRC_34829-JAX) were used in this study. APP/PS1 animals co-express the Swedish (K594M/N595L) mutation of a chimeric mouse/human APP (Mo/HuAPP695swe) together with the human exon-9-deleted variant of PS1 ( 128 129 Fig. 1 A 123 130 Biochemical analysis After treatments, glucose, cholesterol, insulin, triglycerides, alkaline phosphatase, and aspartate aminotransferase (AST) were measured from blood samples obtained from 5 to 6 mice per group. Intracardiac blood was collected before decapitation, after 6 h of fasting. Serum samples were obtained and stored at −20 °C for later analysis. Glucose levels were measured according to the hexokinase/G-6-PDH method using Architect Analyzer (Abbott Laboratories). Insulin levels were measured via 131 132 133 Glucose uptake analysis The VAT was prepared according to standard procedures. Briefly, VAT samples were washed with washing buffer (15 mM HEPES [#H3375, Sigma Millipore], 135 mM NaCl [#s3014], 5 mM KCl [#P5405], 1.8 mM CaCl 2 2 14 2 36 2 3 Determination of the glycolytic rate Glycolytic rates were determined as previously described ( 122 2 4 2 4 4 2 14 3 2 Hexokinase activity To measure the hexokinase activity, the VAT was washed with PBS, treated with trypsin/EDTA, and centrifuged at 500 g g + 2 10 Pentose phosphate pathway (PPP) measurement Glucose oxidation via 14 2 14 14 122 2 14 14 2 4 14 2 Determination of G6PDH activity VAT tissue samples were washed with PBS, collected by trypsinization (0.25% trypsin- 0.2% EDTA (w/v)), and pelleted. The tissue samples were then resuspended in isolation medium (250 mM sucrose, 20 mM HEPES, 10 mM KCl, 1.5 mM MgCl 2 g g 134 Quantification of ADP and ATP levels ATP and ADP levels were measured using an ATP determination kit [#A22066, Invitrogen/Molecular Probes] or an ADP assay Kit [#ab83359, Abcam, Cambridge, United Kingdom], respectively. The ADP/ATP ratio was measured accordingly ( 122 AMPK, phosphofructokinase-1 (PFK-1), and pyruvate kinase Activity AMPK activity was measured by ELISA according to the manufacturer’s instructions [#KHO0651, ThermoFisher Scientific]. PFK-1 activity was measured using a Colorimetric Assay Kit [#K776, BioVision] ( 135 136 137 Quantitative real-time PCR (qRT-PCR) RNA was isolated from VAT and reverse transcribed into cDNA [#18091050, Invitrogen]. Quantitative real-time RT–PCR (qRT–PCR) was conducted using SYBR master mix [#4368577, ThermoFisher Scientific], with the program recommended by the manufacturer and as published previously ( 138 Table S1 Statistical analysis All Statistics were performed using the software Prism 9 (GraphPad). The results are expressed as means ± standard deviation (SD). Data were analyzed by one or two-way analysis of variance (ANOVA), followed by Bonferroni’s post hoc p p p Data availability Data will be made available on request. Supporting information This article contains supporting information Conflict of interest The authors declare that they do not have any conflicts of interest with the content of this article. References 1 Serrano-Pozo A. Frosch M.P. Masliah E. Hyman B.T. Neuropathological alterations in Alzheimer disease Cold Spring Harb Perspect. Med. 1 2011 a006189 10.1101/cshperspect.a006189 PMC3234452 22229116 2 Henstridge C.M. Hyman B.T. Spires-Jones T.L. Beyond the neuron–cellular interactions early in Alzheimer disease pathogenesis Nat. Rev. Neurosci. 2019 10.1038/s41583-018-0113-1 PMC6545070 30643230 3 Long J.M. Holtzman D.M. Alzheimer disease: an update on pathobiology and treatment strategies Cell 179 2019 312 339 31564456 10.1016/j.cell.2019.09.001 PMC6778042 4 Protas H.D. Chen K. Langbaum J.B.S. Fleisher A.S. Alexander G.E. Lee W. Posterior cingulate glucose metabolism, hippocampal glucose metabolism, and hippocampal volume in cognitively normal, late-middle-aged persons at 3 levels of genetic risk for alzheimer disease JAMA Neurol. 70 2013 320 325 23599929 10.1001/2013.jamaneurol.286 PMC3745014 5 Mosconi L. Pupi A. De Leon M. Brain glucose hypometabolism and oxidative stress in preclinical Alzheimer’s disease Ann. N. Y. Acad. Sci. 1147 2008 180 195 19076441 10.1196/annals.1427.007 PMC2661241 6 Willette A.A. Bendlin B.B. Starks E.J. Birdsill A.C. Johnson S.C. Christian B.T. Association of insulin resistance with cerebral glucose uptake in late middle-aged adults at risk for Alzheimer disease JAMA Neurol. 72 2015 1013 1020 26214150 10.1001/jamaneurol.2015.0613 PMC4570876 7 Chen Z. Zhong C. Decoding Alzheimer’s disease from perturbed cerebral glucose metabolism: implications for diagnostic and therapeutic strategies Prog. Neurobiol. 108 2013 21 43 23850509 10.1016/j.pneurobio.2013.06.004 8 Gejl M. Brock B. Egefjord L. Vang K. Rungby J. Gjedde A. Blood-brain glucose transfer in Alzheimer’s disease: effect of GLP-1 analog treatment Sci. Rep. 7 2017 1 10 29235507 10.1038/s41598-017-17718-y PMC5727512 9 Niccoli T. Cabecinha M. Tillmann A. Kerr F. Wong C.T. Cardenes D. Increased glucose transport into neurons rescues Aβ toxicity in Drosophila Curr. Biol. 26 2016 2291 2300 27524482 10.1016/j.cub.2016.07.017 PMC5026704 10 Cisternas P. Zolezzi J.M. Martinez M. Torres V.I. Wong G.W. Inestrosa N.C. Wnt-induced activation of glucose metabolism mediates the in vivo neuroprotective roles of Wnt signaling in Alzheimer disease J. Neurochem. 149 2019 54 72 30300917 10.1111/jnc.14608 PMC7680578 11 Craft S. The role of metabolic disorders in Alzheimer disease and vascular dementia: two roads converged Arch. Neurol. 66 2009 300 305 10.1001/archneurol.2009.27 PMC2717716 19273747 12 Rios J.A. Cisternas P. Arrese M. Barja S. Inestrosa N.C. Ríos J.A. Is Alzheimer’s disease related to metabolic syndrome? A Wnt signaling conundrum Prog. Neurobiol. 121 2014 125 146 25084549 10.1016/j.pneurobio.2014.07.004 13 NCD Risk Factor Collaboration (NCD-RisC) Worldwide trends in underweight and obesity from 1990 to 2022: a pooled analysis of 3663 population-representative studies with 222 million children, adolescents, and adults Lancet 403 2024 1027 1050 38432237 10.1016/S0140-6736(23)02750-2 PMC7615769 14 Koliaki C. Dalamaga M. Liatis S. Update on the obesity epidemic: after the sudden rise, is the upward trajectory beginning to flatten? Curr. Obes. Rep. 12 2023 514 527 37779155 10.1007/s13679-023-00527-y PMC10748771 15 Flores-Cordero J.A. Pérez-Pérez A. Jiménez-Cortegana C. Alba G. Flores-Barragán A. Sánchez-Margalet V. Obesity as a risk factor for dementia and alzheimer’s disease: the role of leptin Int. J. Mol. Sci. 23 2022 5202 35563589 10.3390/ijms23095202 PMC9099768 16 Whitmer R.A. Gunderson E.P. Barrett-Connor E. Quesenberry C.P. Yaffe K. Obesity in middle age and future risk of dementia: a 27 year longitudinal population based study Br. Med. J. 330 2005 1360 1362 15863436 10.1136/bmj.38446.466238.E0 PMC558283 17 Xu W.L. Atti A.R. Gatz M. Pedersen N.L. Johansson B. Fratiglioni L. Midlife overweight and obesity increase late-life dementia risk: a population-based twin study Neurology 76 2011 1568 1574 21536637 10.1212/WNL.0b013e3182190d09 PMC3100125 18 Fitzpatrick A.L. Kuller L.H. Lopez O.L. Diehr P. O’Meara E.S. Longstreth W.T. Jr. Midlife and late-life obesity and the risk of dementia: cardiovascular health study Arch. Neurol. 66 2009 336 342 19273752 10.1001/archneurol.2008.582 PMC3513375 19 Ishii M. Iadecola C. Adipocyte-derived factors in age-related dementia and their contribution to vascular and Alzheimer pathology Biochim. Biophys. Acta Mol. Basis Dis. 2016 10.1016/j.bbadis.2015.10.029 PMC4821723 26546479 20 Parimisetty A. Dorsemans A.C. Awada R. Ravanan P. Diotel N. Lefebvre d’Hellencourt C. Secret talk between adipose tissue and central nervous system via secreted factors-an emerging frontier in the neurodegenerative research J. Neuroinflammation 2016 10.1186/s12974-016-0530-x PMC4806498 27012931 21 Kawai T. Autieri M.V. Scalia R. Adipose tissue inflammation and metabolic dysfunction in obesity Am. J. Physiol. Cell Physiol. 2021 10.1152/ajpcell.00379.2020 PMC8294624 33356944 22 Kiliaan A.J. Arnoldussen I.A.C. Gustafson D.R. Adipokines: a link between obesity and dementia? Lancet Neurol. 13 2014 913 923 25142458 10.1016/S1474-4422(14)70085-7 PMC4228955 23 Forny-Germano L. De Felice F.G. Do Nascimento Vieira M.N. The role of leptin and adiponectin in obesity-associated cognitive decline and Alzheimer’s disease Front. Neurosci. 12 2019 1027 30692905 10.3389/fnins.2018.01027 PMC6340072 24 Misiak B. Leszek J. Kiejna A. Metabolic syndrome, mild cognitive impairment and Alzheimer’s disease-The emerging role of systemic low-grade inflammation and adiposity Brain Res. Bull 89 2012 144 149 22921944 10.1016/j.brainresbull.2012.08.003 25 Ly M. Yu G.Z. Mian A. Cramer A. Meysami S. Merrill D.A. Neuroinflammation: a modifiable pathway linking obesity, Alzheimer’s disease, and depression Am. J. Geriatr. Psychiatry 31 2023 853 866 37365110 10.1016/j.jagp.2023.06.001 PMC10528955 26 Carvalho A.F. Rocha D.Q.C. McIntyre R.S. Mesquita L.M. Köhler C.A. Hyphantis T.N. Adipokines as emerging depression biomarkers: a systematic review and meta-analysis J. Psychiatr. Res. 59 2014 28 37 25183029 10.1016/j.jpsychires.2014.08.002 27 Kim S. Yi H.A. Won K.S. Lee J.S. Kim H.W. Association between visceral adipose tissue metabolism and Alzheimer’s disease pathology Metabolites 2022 10.3390/metabo12030258 PMC8949138 35323701 28 Wondmkun Y.T. Obesity, insulin resistance, and type 2 diabetes: Associations and therapeutic implications Diabetes Metab. Syndr. Obes. 13 2020 3611 3616 33116712 10.2147/DMSO.S275898 PMC7553667 29 González-Muniesa P. Mártinez-González M.A. Hu F.B. Després J.P. Matsuzawa Y. Loos R.J.F. Obesity Nat. Rev. Dis. Primers 2017 10.1038/nrdp.2017.34 28617414 30 Kellar D. Craft S. Brain insulin resistance in Alzheimer’s disease and related disorders: mechanisms and therapeutic approaches Lancet Neurol. 2020 10.1016/S1474-4422(20)30231-3 PMC9661919 32730766 31 Chen C.C. Lii C.K. Lin Y.H. Shie P.H. Yang Y.C. Huang C.S. Andrographis paniculata improves insulin resistance in high-fat diet-induced obese mice and TNFα-treated 3T3-L1 adipocytes Am. J. Chin. Med. 48 2020 1073 1090 32668968 10.1142/S0192415X20500524 32 Lin F.L. Wu S.J. Lee S.C. Ng L.T. Antioxidant, antioedema and analgesic activities of Andrographis paniculata extracts and their active constituent andrographolide Phytother. Res. 23 2009 958 964 19142986 10.1002/ptr.2701 33 Astuti N.T. Novitasari P.R. Tjandrawinata R. Nugroho A.E. Pramono S. Anti-diabetic effect of andrographolide from Sambiloto herbs (Andrographis paniculata (Burm.f.) Nees) through the expression of PPARγ and GLUT-4 in adipocytes Indones J. Biotechnol. 27 2022 203 211 34 Nugroho A.E. Andrie M. Warditiani N.K. Siswanto E. Pramono S. Lukitaningsih E. Antidiabetic and antihiperlipidemic effect of Andrographis paniculata (Burm. f.) Nees and andrographolide in high-fructose-fat-fed rats Indian J. Pharmacol. 44 2012 377 381 22701250 10.4103/0253-7613.96343 PMC3371463 35 Burgos R.A. Alarcón P. Quiroga J. Manosalva C. Hancke J. Andrographolide, an anti-inflammatory multitarget drug: all roads lead to cellular metabolism Molecules 2021 10.3390/MOLECULES26010005 PMC7792620 33374961 36 Gherardelli C. Cisternas P. Gutiérrez J. Martinez M. Inestrosa N.C. Andrographolide restores glucose uptake in rat hippocampal neurons J. Neurochem. 157 2021 1222 1233 33124061 10.1111/jnc.15229 37 Chen Z. Tang W.-J. Zhou Y.-H. Chen Z.-M. Liu K. Andrographolide inhibits non-small cell lung cancer cell proliferation through the activation of the mitochondrial apoptosis pathway and by reprogramming host glucose metabolism Ann. Transl. Med. 9 2021 1701 34988210 10.21037/atm-21-5975 PMC8667159 38 Liao J. Yang Z. Yao Y. Yang X. Shen J. Zhao P. Andrographolide promotes uptake of glucose and GLUT4 transport through the PKC pathway in L6 cells Pharmaceuticals 2022 10.3390/ph15111346 PMC9698946 36355518 39 Chang L. Chiang S.H. Saltiel A.R. Insulin signaling and the regulation of glucose transport Mol. Med. 2004 10.2119/2005-00029.Saltiel PMC1431367 16307172 40 Kohno T. Shiga T. Toyomaki A. Kusumi I. Matsuyama T. Inoue T. Effects of lithium on brain glucose metabolism in healthy men J. Clin. Psychopharmacol. 27 2007 698 702 18004140 10.1097/jcp.0b013e31815a23c2 41 Gherardelli C. Cisternas P. Inestrosa N.C. Lithium enhances hippocampal glucose metabolism in an in vitro mice model of Alzheimer’s disease Int. J. Mol. Sci. 2022 10.3390/ijms23158733 PMC9368914 35955868 42 Hollander E. Buchsbaum M.S. Haznedar M.M. Berenguer J. Berlin H.A. Chaplin W. FDG-PET study in pathological gamblers: 1. Lithium increases orbitofrontal, dorsolateral and cingulate metabolism Neuropsychobiology 58 2008 37 47 18781089 10.1159/000154478 43 Gherardelli C. Cisternas P. Vera-Salazar R.F. Mendez-Orellana C. Inestrosa N.C. Age- and sex-associated glucose metabolism decline in a mouse model of Alzheimer’s disease J. Alzheimer Dis. 87 2022 901 917 10.3233/JAD-215273 35404275 44 Huang X. Liu G. Guo J. Su Z.Q. The PI3K/AKT pathway in obesity and type 2 diabetes Int. J. Biol. Sci. 14 2018 1483 1496 30263000 10.7150/ijbs.27173 PMC6158718 45 Manning B.D. Toker A. AKT/PKB signaling: navigating the network Cell 2017 10.1016/j.cell.2017.04.001 PMC5546324 28431241 46 Miao R. Fang X. Wei J. Wu H. Wang X. Tian J. Akt: a potential drug target for metabolic syndrome Front. Physiol. 2022 10.3389/fphys.2022.822333 PMC8940245 35330934 47 Xu S. Lu F. Gao J. Yuan Y. Inflammation-mediated metabolic regulation in adipose tissue Obes. Rev. 2024 10.1111/OBR.13724 38408757 48 Lu D. He A. Tan M. Mrad M. El Daibani A. Hu D. Liver ACOX1 regulates levels of circulating lipids that promote metabolic health through adipose remodeling Nat. Commun. 2024 10.1038/S41467-024-48471-2 PMC11101658 38760332 49 Kim Y.J. Kim S.M. Jeong D.H. Lee S.K. Ahn M.E. Ryu O.H. Associations between metabolic syndrome and type of dementia: analysis based on the National Health Insurance Service database of Gangwon province in South Korea Diabetol. Metab. Syndr. 2021 10.1186/s13098-020-00620-5 PMC7789546 33407809 50 Diehl-Wiesenecker E. Von Armin C.A.F. Dupuis L. Müller H.P. Ludolph A.C. Kassubek J. Adipose tissue distribution in patients with Alzheimer’s disease: a whole body MRI case-control study J. Alzheimer’s Dis. 48 2015 825 832 26402111 10.3233/JAD-150426 51 Clark L.R. Koscik R.L. Allison S.L. Berman S.E. Norton D. Carlsson C.M. Hypertension and obesity moderate the relationship between β-amyloid and cognitive decline in midlife Alzheimer’s Demen. 15 2019 418 428 10.1016/j.jalz.2018.09.008 PMC6408972 30367828 52 Papachristou E. Ramsay S.E. Lennon L.T. Papacosta O. Iliffe S. Whincup P.H. The relationships between body composition characteristics and cognitive functioning in a population-based sample of older British men BMC Geriatr. 2015 10.1186/s12877-015-0169-y PMC4687114 26692280 53 Nyberg C.K. Fjell A.M. Walhovd K.B. Level of body fat relates to memory decline and interacts with age in its association with hippocampal and subcortical atrophy Neurobiol. Aging 91 2020 112 124 32224068 10.1016/j.neurobiolaging.2019.10.005 54 Yu J.T. Xu W. Tan C.C. Andrieu S. Suckling J. Evangelou E. Evidence-based prevention of Alzheimer’s disease: systematic review and meta-analysis of 243 observational prospective studies and 153 randomised controlled trials J. Neurol. Neurosurg. Psychiatry 2020 10.1136/jnnp-2019-321913 PMC7569385 32690803 55 Bracko O. Vinarcsik L.K. Cruz Hernández J.C. Ruiz-Uribe N.E. Haft-Javaherian M. Falkenhain K. High fat diet worsens Alzheimer’s disease-related behavioral abnormalities and neuropathology in APP/PS1 mice, but not by synergistically decreasing cerebral blood flow Sci. Rep. 2020 10.1038/s41598-020-65908-y PMC7303150 32555372 56 van Galen K.A. Schrantee A. ter Horst K.W. la Fleur S.E. Booij J. Constable R.T. Brain responses to nutrients are severely impaired and not reversed by weight loss in humans with obesity: a randomized crossover study Nat. Metab. 5 2023 1059 1072 37308722 10.1038/s42255-023-00816-9 57 Fain J.N. Madan A.K. Hiler M.L. Cheema P. Bahouth S.W. Comparison of the release of adipokines by adipose tissue, adipose tissue matrix, and adipocytes from visceral and subcutaneous abdominal adipose tissues of obese humans Endocrinology 145 2004 2273 2282 14726444 10.1210/en.2003-1336 58 Anand S.S. Friedrich M.G. Lee D.S. Awadalla P. Després J.P. Desai D. Evaluation of adiposity and cognitive function in adults JAMA Netw. Open 5 2022 e2146324 10.1001/jamanetworkopen.2021.46324 PMC8808326 35103790 59 Oliveras-Cañellas N. Castells-Nobau A. de la Vega-Correa L. Latorre-Luque J. Motger-Albertí A. Arnoriaga-Rodriguez M. Adipose tissue coregulates cognitive function Sci. Adv. 2023 10.1126/sciadv.adg4017 PMC10421051 37566655 60 Michailidis M. Tata D.A. Moraitou D. Kavvadas D. Karachrysafi S. Papamitsou T. Antidiabetic drugs in the treatment of Alzheimer’s disease Int. J. Mol. Sci. 2022 10.3390/ijms23094641 PMC9102472 35563031 61 Boccardi V. Murasecco I. Mecocci P. Diabetes drugs in the fight against Alzheimer’s disease Ageing Res. Rev. 2019 10.1016/j.arr.2019.100936 31330313 62 Cisternas P. Oliva C.A. Torres V.I. Barrera D.P. Inestrosa N.C. Presymptomatic treatment with andrographolide improves brain metabolic markers and cognitive behavior in a model of early-onset Alzheimer’s disease Front Cell Neurosci. 13 2019 295 31379502 10.3389/fncel.2019.00295 PMC6657419 63 Czech M.P. Richardson D.K. Becker S.G. Walters C.G. Gitomer W. Heinrich J. Insulin response in skeletal muscle and fat cells of the genetically obese Zucker rat Metabolism 1978 10.1016/S0026-0495(78)80013-4 723645 64 Talior I. Yarkoni M. Bashan N. Eldar-Finkelman H. Increased glucose uptake promotes oxidative stress and PKC-δ activation in adipocytes of obese, insulin-resistant mice Am. J. Physiol. Endocrinol. Metab. 285 2003 E295 E302 12857675 10.1152/ajpendo.00044.2003 65 Sinha M.K. Raineri-Maldonado C. Buchanan C. Pories W.J. Carter-Su C. Pilch P.F. Adipose tissue glucose transporters in NIDDM. Decreased levels of muscle/fat isoform Diabetes 40 1991 472 477 2010047 10.2337/diab.40.4.472 66 Stolic M. Russell A. Hutley L. Fielding G. Hay J. MacDonald G. Glucose uptake and insulin action in human adipose tissue- Influence of BMI, anatomical depot and body fat distribution Int. J. Obes. 26 2002 17 23 10.1038/sj.ijo.0801850 11791142 67 Molina J.M. Ciaraldi T.P. Brady D. Olefsky J.M. Decreased activation rate of insulin-stimulated glucose transport in adipocytes from obese subjects Diabetes 38 1989 991 995 2666204 10.2337/diab.38.8.991 68 Kahn B.B. Adipose tissue, inter-organ communication, and the path to type 2 diabetes: the 2016 banting medal for scientific achievement lecture Diabetes 68 2019 3 14 30573674 10.2337/dbi18-0035 PMC6302542 69 Hussey S.E. McGee S.L. Garnham A. Wentworth J.M. Jeukendrup A.E. Hargreaves M. Exercise training increases adipose tissue GLUT4 expression in patients with type 2 diabetes Diabetes Obes. Metab. 13 2011 959 962 21615668 10.1111/j.1463-1326.2011.01426.x 70 Abel E.D. Peroni O. Kim J.K. Kim Y.B. Boss O. Hadro E. Adipose-selective targeting of the GLUT4 gene impairs insulin action in muscle and liver Nature 409 2001 729 733 11217863 10.1038/35055575 71 Miura T. Suzuki W. Ishihara E. Arai I. Ishida H. Seino Y. Impairment of insulin-stimulated GLUT4 translocation in skeletal muscle and adipose tissue in the Tsumura Suzuki obese diabetic mouse: a new genetic animal model of type 2 diabetes Eur. J. Endocrinol. 145 2001 785 790 11720905 10.1530/eje.0.1450785 72 Favaretto F. Milan G. Collin G.B. Marshall J.D. Stasi F. Maffei P. GLUT4 defects in adipose tissue are early signs of metabolic alterations in alms1GT/GT, a mouse model for obesity and insulin resistance PLoS One 2014 10.1371/journal.pone.0109540 PMC4192353 25299671 73 Maianu L. Keller S.R. Garvey W.T. Adipocytes exhibit abnormal subcellular distribution and translocation of vesicles containing glucose transporter 4 and insulin-regulated aminopeptidase in type 2 diabetes mellitus: implications regarding defects in vesicle trafficking J. Clin. Endocrinol. Metab. 86 2001 5450 5456 11701721 10.1210/jcem.86.11.8053 74 Shepherd P.R. Gnudi L. Tozzo E. Yang H. Leach F. Kahn B.B. Adipose cell hyperplasia and enhanced glucose disposal in transgenic mice overexpressing GLUT4 selectively in adipose tissue J. Biol. Chem. 268 1993 22243 22246 8226728 75 Yin J. Gao Z. He Q. Zhou D. Guo Z. Ye J. Role of hypoxia in obesity-induced disorders of glucose and lipid metabolism in adipose tissue Am. J. Physiol. Endocrinol. Metab. 2009 10.1152/ajpendo.90760.2008 PMC2645021 19066318 76 Pedersen O. Kahn C.R. Kahn B.B. Divergent regulation of the Glut 1 and Glut 4 glucose transporters in isolated adipocytes from Zucker rats J. Clin. Invest. 89 1992 1964 1973 1534819 10.1172/JCI115804 PMC295898 77 Chadt A. Al-Hasani H. Glucose transporters in adipose tissue, liver, and skeletal muscle in metabolic health and disease Pflugers Arch. 472 2020 1273 1298 32591906 10.1007/s00424-020-02417-x PMC7462924 78 Trayhurn P. Hypoxia and adipocyte physiology: implications for adipose tissue dysfunction in obesity Annu. Rev. Nutr. 34 2014 207 236 24819450 10.1146/annurev-nutr-071812-161156 79 Wang B. Wood I.S. Trayhurn P. PCR arrays identify metallothionein-3 as a highly hypoxia-inducible gene in human adipocytes Biochem. Biophys. Res. Commun. 368 2008 88 93 18206644 10.1016/j.bbrc.2008.01.036 PMC2635530 80 Wood I.S. Wang B. Lorente-Cebrián S. Trayhurn P. Hypoxia increases expression of selective facilitative glucose transporters (GLUT) and 2-deoxy-d-glucose uptake in human adipocytes Biochem. Biophys. Res. Commun. 361 2007 468 473 17658463 10.1016/j.bbrc.2007.07.032 PMC2211375 81 Butterfield D.A. Halliwell B. Oxidative stress, dysfunctional glucose metabolism and Alzheimer disease Nat. Rev. Neurosci. 2019 10.1038/s41583-019-0132-6 PMC9382875 30737462 82 [preprint] Minhas P.S. Jones J.R. Latif-Hernandez A. Sugiura Y. Durairaj A.S. Uenaka T. Restoring hippocampal glucose metabolism rescues cognition across Alzheimer’s disease pathologies bioRxiv 2024 10.1101/2024.06.23.598940 PMC12313320 39172838 83 Mosconi L. Glucose metabolism in normal aging and Alzheimer’s disease: methodological and physiological considerations for PET studies Clin. Transl. Imaging 1 2013 1 25 10.1007/s40336-013-0026-y PMC3881550 24409422 84 Mosconi L. Brain glucose metabolism in the early and specific diagnosis of Alzheimer’s disease: FDG-PET studies in MCI and AD Eur. J. Nucl. Med. Mol. Imaging 32 2005 486 510 15747152 10.1007/s00259-005-1762-7 85 Mosconi L. Berti V. Glodzik L. Pupi A. De Santi S. de Leon M.J. Pre-clinical detection of Alzheimer’s disease using FDG-PET, with or without amyloid imaging J. Alzheimer Dis. 23 2010 843 854 10.3233/JAD-2010-091504 PMC3038340 20182025 86 Cisternas P. Inestrosa N.C. Brain glucose metabolism: role of Wnt signaling in the metabolic impairment in Alzheimer’s disease Neurosci. Biobehav Rev. 80 2017 316 328 28624434 10.1016/j.neubiorev.2017.06.004 87 Rodriguez-rodriguez P. Almeida A. Bolaños J.P. Neurochemistry International Brain energy metabolism in glutamate-receptor activation and excitotoxicity : role for APC/C-Cdh1 in the balance glycolysis/pentose phosphate pathway Neurochem. Int. 62 2013 750 756 23416042 10.1016/j.neuint.2013.02.005 88 Bolanos J.P. Almeida A. The pentose-phosphate pathway in neuronal survival against nitrosative stress IUBMB Life. 62 2010 14 18 19937972 10.1002/iub.280 89 Bolaños J.P. Delgado-Esteban M. Herrero-Mendez A. Fernandez-Fernandez S. Almeida A. Regulation of glycolysis and pentose-phosphate pathway by nitric oxide: impact on neuronal survival Biochim. Biophys. Acta 1777 2008 789 793 18455501 10.1016/j.bbabio.2008.04.011 90 Rodriguez-Rodriguez P. Fernandez E. Bolaños J.P. Underestimation of the pentose-phosphate pathway in intact primary neurons as revealed by metabolic flux analysis J. Cereb. Blood Flow Metab. 33 2013 1843 1845 24064491 10.1038/jcbfm.2013.168 PMC3851909 91 Trushina E. Alzheimer’s disease mechanisms in peripheral cells: Promises and challenges Alzheimer’s Demen. 5 2019 652 10.1016/j.trci.2019.06.008 PMC6838468 31720366 92 Hardie D.G. AMP-activated protein kinase-an energy sensor that regulates all aspects of cell function Genes Dev. 2011 10.1101/gad.17420111 PMC3185962 21937710 93 Mihaylova M.M. Shaw R.J. The AMP-activated protein kinase (AMPK) signaling pathway coordinates cell growth, autophagy, & metabolism Nat. Cell Biol. 13 2011 1016 1023 21892142 10.1038/ncb2329 PMC3249400 94 Salt I.P. Connell J.M.C. Gould G.W. 5-Aminoimidazole-4-carboxamide ribonucleoside (AICAR) inhibits insulin-stimulated glucose transport in 3T3-L1 adipocytes Diabetes 49 2000 1649 1656 11016448 10.2337/diabetes.49.10.1649 95 Lindholm C.R. Ertel R.L. Bauwens J.D. Schmuck E.G. Mulligan J.D. Saupe K.W. A high-fat diet decreases AMPK activity in multiple tissues in the absence of hyperglycemia or systemic inflammation in rats J. Physiol. Biochem. 69 2013 165 175 22941749 10.1007/s13105-012-0199-2 PMC3644018 96 Liu P. Wang Z.H. Kang S.S. Liu X. Xia Y. Chan C.B. High-fat diet-induced diabetes couples to Alzheimer’s disease through inflammation-activated C/EBPβ/AEP pathway Mol. Psychiatry 27 2022 3396 3409 35546632 10.1038/s41380-022-01600-z PMC10032575 97 Gauthier M.S. O’Brien E.L. Bigornia S. Mott M. Cacicedo J.M. Xu X.J. Decreased AMP-activated protein kinase activity is associated with increased inflammation in visceral adipose tissue and with whole-body insulin resistance in morbidly obese humans Biochem. Biophys. Res. Commun. 404 2011 382 387 21130749 10.1016/j.bbrc.2010.11.127 PMC3061625 98 Pollard A.E. Martins L. Muckett P.J. Khadayate S. Bornot A. Clausen M. AMPK activation protects against diet-induced obesity through Ucp1-independent thermogenesis in subcutaneous white adipose tissue Nat. Metab. 2019 10.1038/s42255-019-0036-9 PMC6420092 30887000 99 Mottillo E.P. Desjardins E.M. Crane J.D. Smith B.K. Green A.E. Ducommun S. Lack of adipocyte AMPK exacerbates insulin resistance and hepatic steatosis through Brown and beige adipose tissue function Cell Metab. 24 2016 118 129 27411013 10.1016/j.cmet.2016.06.006 PMC5239668 100 Sell H. Dietze-Schroeder D. Eckardt K. Eckel J. Cytokine secretion by human adipocytes is differentially regulated by adiponectin, AICAR, and troglitazone Biochem. Biophys. Res. Commun. 343 2006 700 706 16563350 10.1016/j.bbrc.2006.03.010 101 Orci L. Cook W.S. Ravazzola M. Wang M.Y. Park B.H. Montesano R. Rapid transformation of white adipocytes into fat-oxidizing machines Proc. Natl. Acad. Sci. U. S. A. 101 2004 2058 2063 14769942 10.1073/pnas.0308258100 PMC357051 102 Cauwels A. Rogge E. Vandendriessche B. Shiva S. Brouckaert P. Extracellular ATP drives systemic inflammation, tissue damage and mortality Cell Death Dis. 2014 10.1038/cddis.2014.70 PMC3973196 24603330 103 Rani V. Verma R. Kumar K. Chawla R. Role of pro-inflammatory cytokines in Alzheimer’s disease and neuroprotective effects of pegylated self-assembled nanoscaffolds Curr. Res. Pharmacol. Drug Discov. 2023 10.1016/j.crphar.2022.100149 PMC9804106 36593925 104 Jin L. Shi G. Ning G. Li X. Zhang Z. Andrographolide attenuates tumor necrosis factor-alpha-induced insulin resistance in 3T3-L1 adipocytes Mol. Cell Endocrinol. 2011 10.1016/j.mce.2010.10.005 20943205 105 Yu B.C. Hung C.R. Chen W.C. Cheng J.T. Antihyperglycemic effect of andrographolide in streptozotocin-induced diabetic rats Planta Med. 69 2003 1075 1079 14750020 10.1055/s-2003-45185 106 Thakur S. Dhapola R. Sarma P. Medhi B. Reddy D.H.K. Neuroinflammation in Alzheimer’s disease: current progress in molecular signaling and therapeutics Inflammation 2023 10.1007/s10753-022-01721-1 35986874 107 Lee J. Kim J. Shin S.A. Park S. Yoon D.H. Kim H. Moderating effect of insulin resistance on the relationship between gray matter volumes and cognitive function J. Clin. Med. 2018 10.3390/jcm7110413 PMC6262494 30400348 108 Banks W.A. Owen J.B. Erickson M.A. Insulin in the brain: there and back again Pharmacol. Ther. 2012 10.1016/j.pharmthera.2012.07.006 PMC4134675 22820012 109 Hierro-Bujalance C. del Marco A. José Ramos-Rodríguez J. Infante-Garcia C. Bella Gomez-Santos S. Herrera M. Cell proliferation and neurogenesis alterations in Alzheimer’s disease and diabetes mellitus mixed murine models J. Neurochem. 154 2020 673 692 32068886 10.1111/jnc.14987 110 Imamura T. Yanagihara Y.T. Ohyagi Y. Nakamura N. Iinuma K.M. Yamasaki R. Insulin deficiency promotes formation of toxic amyloid-β42 conformer co-aggregating with hyper-phosphorylated tau oligomer in an Alzheimer’s disease model Neurobiol. Dis. 2020 10.1016/j.nbd.2020.104739 31927145 111 Soto M. Cai W. Konishi M. Kahn C.R. Insulin signaling in the hippocampus and amygdala regulates metabolism and neurobehavior Proc. Natl. Acad. Sci. U. S. A. 116 2019 6379 6384 30765523 10.1073/pnas.1817391116 PMC6442573 112 Guo S. Decoding insulin resistance and metabolic syndrome for promising therapeutic intervention J. Endocrinol. 2014 10.1530/JOE-13-0584 PMC4068335 24431466 113 Saltiel A.R. Kahn C.R. Insulin signalling and the regulation of glucose and lipid metabolism Nature 414 2001 799 806 11742412 10.1038/414799a 114 Osorio-Fuentealba C. Contreras-Ferrat A.E. Altamirano F. Espinosa A. Li Q. Niu W. Electrical stimuli release ATP to increase GLUT4 translocation and glucose uptake via PI3Kγ-Akt-AS160 in skeletal muscle cells Diabetes 62 2013 1519 1526 23274898 10.2337/db12-1066 PMC3636621 115 Ramachandran V. Saravanan R. Glucose uptake through translocation and activation of GLUT4 in PI3K/Akt signaling pathway by asiatic acid in diabetic rats Hum. Exp. Toxicol. 34 2015 884 893 26286522 10.1177/0960327114561663 116 Osqueei M.R. Mahmoudabadi A.Z. Bahari Z. Meftahi G.H. Movahedi M. Taghipour R. Eryngium billardieri extract affects cardiac gene expression of master regulators of cardiomyaopathy in rats with high fatdiet-induced insulin resistance Clin. Nutr. ESPEN 56 2023 59 66 37344084 10.1016/j.clnesp.2023.04.016 117 Sani D. Khatab N.I.O. Kirby B.P. Yong A. Hasan S. Basri H. A standardised Andrographis paniculata Burm. Nees aqueous extract prevents Lipopolysaccharide-induced cognitive deficits through suppression of inflammatory cytokines and oxidative stress mediators J. Adv. Res. 16 2019 87 97 30899592 10.1016/j.jare.2018.11.005 PMC6412812 118 Yang M.Y. Yu Q.L. Huang Y.S. Yang G. Neuroprotective effects of andrographolide derivative CX-10 in transient focal ischemia in rat: involvement of Nrf2/AE and TLR/NF-κB signaling Pharmacol. Res. 144 2019 227 234 31028905 10.1016/j.phrs.2019.04.023 119 Hotamisligil G.S. Shargill N.S. Spiegelman B.M. Adipose expression of tumor necrosis factor-α: Direct role in obesity-linked insulin resistance Science 259 1993 87 91 7678183 10.1126/science.7678183 120 Rivera D.S. Lindsay C. Codocedo J.F. Morel I. Pinto C. Cisternas P. Andrographolide recovers cognitive impairment in a natural model of Alzheimer’s disease (Octodon degus) Neurobiol. Aging 46 2016 204 220 27505720 10.1016/j.neurobiolaging.2016.06.021 121 Arredondo S.B. Reyes D.T. Herrera-Soto A. Mardones M.D. Inestrosa N.C. Varela-Nallar L. Andrographolide promotes hippocampal neurogenesis and spatial memory in the APPswe/PS1ΔE9 mouse model of Alzheimer’s disease Sci. Rep. 2021 10.1038/s41598-021-01977-x PMC8616902 34824314 122 Cisternas P. Gherardelli C. Gutierrez J. Salazar P. Mendez-Orellana C. Wong G.W. Adiponectin and resistin modulate the progression of Alzheimer's disease in a metabolic syndrome model Front Endocrinol (Lausanne) 14 2023 1237796 10.3389/fendo.2023.1237796 PMC10507329 37732123 123 Tapia-Rojas C. Schüller A. Lindsay C.B. Ureta R.C. Mejias-reyes C. Hancke J. Andrographolide activates the canonical Wnt signalling pathway by a mechanism that implicates the non-ATP competitive inhibition of GSK-3β: autoregulation of GSK-3β in vivo Biochem. J. 466 2015 415 430 25423492 10.1042/BJ20140207 124 Serrano F.G. Tapia-Rojas C. Carvajal F.J. Hancke J. Cerpa W. Inestrosa N.C. Andrographolide reduces cognitive impairment in young and mature AβPPswe/PS-1 mice Mol. Neurodegener. 2014 10.1186/1750-1326-9-61 PMC4414355 25524173 125 Ju Y. Gu L. Hu M. Zheng M. Zhou X. Li Q. Andrographolide exerts a neuroprotective effect by regulating the LRP1-mediated PPARγ/NF-κB pathway Eur. J. Pharmacol. 2023 10.1016/j.ejphar.2023.175756 37179044 126 Ahn C. Ryan B.J. Schleh M.W. Varshney P. Ludzki A.C. Gillen J.B. Exercise training remodels subcutaneous adipose tissue in adults with obesity even without weight loss J. Physiol. 600 2022 2127 2146 35249225 10.1113/JP282371 PMC9058215 127 Tapia-rojas C. Sch A. Lindsay C.B. Ureta R.C. Hancke J. Melo F. Andrographolide activates the canonical Wnt signalling pathway by a mechanism that implicates the non-ATP competitive inhibition of GSK-3 β : autoregulation of GSK-3 β in vivo Biochem. J. 430 2015 415 430 10.1042/BJ20140207 25423492 128 Radde R. Bolmont T. Kaeser S.A. Coomaraswamy J. Lindau D. Stoltze L. Abeta42-driven cerebral amyloidosis in transgenic EMBO Rep. 7 2006 940 946 16906128 10.1038/sj.embor.7400784 PMC1559665 129 Maia L.F. Kaeser S.A. Reichwald J. Hruscha M. Martus P. Staufenbiel M. Changes in amyloid-β and tau in the cerebrospinal fluid of transgenic mice overexpressing amyloid precursor protein Sci. Transl. Med. 2013 10.1126/scitranslmed.3006446 23863834 130 Lindsay C.B. Zolezzi J.M. Rivera D.S. Cisternas P. Bozinovic F. Inestrosa N.C. Andrographolide reduces neuroinflammation and oxidative stress in aged Octodon degus Mol. Neurobiol. 57 2020 1131 1145 31701436 10.1007/s12035-019-01784-6 131 Malo M.S. A high level of intestinal alkaline phosphatase is protective against type 2 diabetes mellitus irrespective of obesity EBioMedicine 2 2015 2016 2023 26844282 10.1016/j.ebiom.2015.11.027 PMC4703762 132 Lentjes E.G. Harff G.A. Backer E.T. Evaluation of the Hitachi 704 automatic analyzer Clin. Chem. 33 1987 2089 2092 3677384 133 Salazar P. Cisternas P. Codocedo J.F. Inestrosa N.C. Induction of hypothyroidism during early postnatal stages triggers a decrease in cognitive performance by decreasing hippocampal synaptic plasticity Biochim. Biophys. Acta Mol. Basis Dis. 1863 2017 870 883 28088629 10.1016/j.bbadis.2017.01.002 134 Tsai C.S. Chen Q. Purification and kinetic characterization of 6-phosphogluconate dehydrogenase from Schizosaccharomyces pombe Biochem. Cell Biol. 76 1998 107 113 10099784 135 Thurley K. Herbst C. Wesener F. Koller B. Wallach T. Maier B. Principles for circadian orchestration of metabolic pathways Proc. Natl. Acad. Sci. U. S. A. 2017 10.1073/pnas.1613103114 PMC5321018 28159888 136 Das Gupta K. Shakespear M.R. Curson J.E.B. Murthy A.M.V. Iyer A. Hodson M.P. Class IIa histone deacetylases drive toll-like receptor-inducible glycolysis and macrophage inflammatory responses via pyruvate kinase M2 Cell Rep. 30 2020 2712 2728.e8 32101747 10.1016/j.celrep.2020.02.007 137 Cheng J. Huang Y. Zhang X. Yu Y. Wu S. Jiao J. TRIM21 and PHLDA3 negatively regulate the crosstalk between the PI3K/AKT pathway and PPP metabolism Nat. Commun. 2020 10.1038/s41467-020-15819-3 PMC7170963 32312982 138 Martinez M. Torres V.I. Vio C.P. Inestrosa N.C. Canonical Wnt signaling modulates the expression of pre- and postsynaptic components in different temporal patterns Mol. Neurobiol. 57 2020 1389 1404 31745835 10.1007/s12035-019-01785-5 Supporting information  Table S1 Author contributions P. O., C. G., R. C-D., P. C., and E. S. writing–original draft; P. O., N. C. I., and P. C. visualization; P. O., C. G., R. C-D., P. C., and C. M. O. methodology; P. O., C. G., R. C-D., and C. M. O. investigation; P. O., R. C-D., N. C. I., E. S., and C. M. O. funding acquisition; P. O., C. G., R. C-D., and C. P. data curation; C. G., P. C., and G. W. W. validation; C. G., P. C., C. P., C. M. O., and G. W. W. formal analysis; C. G. and P. C. conceptualization; N. C. I. writing–review & editing; N. C. I., P. C. supervision. Funding and additional information This work was supported by grants from the Basal Center of Excellence in Aging and Regeneration The Role of K+ on Hypertension and Cognition The Role of Lithium in Human Health and Disease Fondo interdisciplina del departamento Ciencias de la salud, P. Universidad Católica de Chile 10.13039/100004408 Centro Interuniversitario de Envejecimiento Saludable FONDECYT Postdoctoral Fellowship 3240187 FONDECYT Iniciación 11230668 ",
  "metadata": {
    "Title of this paper": "Canonical Wnt signaling modulates the expression of pre- and postsynaptic components in different temporal patterns",
    "Journal it was published in:": "The Journal of Biological Chemistry",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481917/"
  }
}