{
  "title": "Paper_599",
  "abstract": "pmc BMC Cancer BMC Cancer 16 bmccanc BMC Cancer 1471-2407 BMC PMC12482282 PMC12482282.1 12482282 12482282 41029537 10.1186/s12885-025-14795-5 14795 1 Research The diagnostic performance of a noninvasive urine-based methylation biomarkers Vimentin/POU4F2 to detect bladder carcinoma Zhang Jialong 1 Cheng Xiaowei 2 Huang Cong 1 Xu Yuchen 1 He Jun 1 Xu Hanjiang ayxuhanjiang@126.com 1 Tai Sheng taisheng@ahmu.edu.cn 1 Wei Yujun weiyujun81@163.com yujun.wei@anlongen.com 3 1 https://ror.org/03t1yn780 grid.412679.f 0000 0004 1771 3402 Department of Urology, The First Affiliated Hospital of Anhui Medical University, 2 3 30 9 2025 2025 25 478185 1460 30 4 2025 1 8 2025 30 09 2025 01 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background Bladder carcinoma (BC) is a malignant tumor that originates from the epithelial cells of the urinary system. Currently, the main diagnostic methods suffer from disadvantages including being invasive, having high costs, and low sensitivity and specificity. Therefore, there is an urgent need to develop a non-invasive, high-performance method for diagnosing BC. Materials and methods We developed a urine DNA detection panel utilizing two methylation biomarkers for the diagnosis of BC. A total of 467 urine samples were collected from the First Affiliated Hospital of Anhui Medical University for DNA methylation analysis. The methylation levels of Vimentin and POU class 4 homeobox 2 gene (POU4F2) were analyzed in a training set of 306 urine samples (92 cases and 214 controls), and in an independent validation set of 161 urine samples (59 cases and 102 controls) using Real-Time PCR (RT-PCR). Results The Vimentin/POU4F2 combined methylation panel achieved an AUC of 0.935 (95% CI: 0.889–0.981), with sensitivity, specificity, and accuracy of 86.44% (95% CI: 0.772–0.957), 96.08% (95% CI: 0.923–0.998), and 92.55% (95% CI: 0.886–0.965) for diagnosing BC. Notably, for patients with stage I and low-grade BC, the sensitivity was 90.00% for both. Additionally, it demonstrated specificities of 96.30% and 95.83% for patients with other urinary diseases and malignancies in other systems. Conclusions Our study provides evidence that the two-gene methylation panel based on urine DNA detection demonstrates strong performance in diagnosing BC with high sensitivity and accuracy, offering a promising strategy for early screening and adjunctive diagnosis of BC. Supplementary Information The online version contains supplementary material available at 10.1186/s12885-025-14795-5. Keywords Bladder urothelial carcinoma Urine Methylation biomarkers Vimentin POU4F2 Hefei Municipal Key Technology Research and Development Program GJ2022SM01 Key Scientific Research Foundation of the Education Department of Anhui Province 2024AH050828 Research Fund of Anhui Institute of Translational Medicine No. 2023zhyx-B03 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Urothelial carcinomas (UCs) are malignant tumors that occur in the urothelium, and are among the most common malignant tumors in the urogenital system [ 1 2 3 4 Currently, BC screening methods primarily include cystourethroscopy, ultrasound, urine cytology, and computed tomography/computed tomography urography (CT/CTU). Although cystourethroscopy is the gold standard for diagnosing BC [ 5 6 7 8 9 10 In recent years, an increasing number of studies have found that the epigenetic molecular regulatory network plays a significant role in tumor development and progression [ 11 12 13 14 15 16 17 18 19 20 The POU class 4 homeobox 2 gene (POU4F2), also known as BRN3B, belongs to the POU-domain transcription factor family and encodes a protein that plays a crucial role in regulating gene expression [ 21 18 22 23 24 25 26 27 28 In this study, we aimed to develop a non-invasive liquid biopsy assay capable of distinguishing BC from other urinary diseases using a combined Vimentin/POU4F2 methylation panel. The methylation panel demonstrated high sensitivity, specificity, and accuracy in detecting BC, particularly in stage I patients, indicating its strong potential for early screening and diagnosis. However, its diagnostic performance requires further testing with larger, independent clinical cohorts. Materials and methods Sample size for adequate sensitivity/specificity The formula for estimating the required sample size at a (1-α) % confidence level is derived as follows: P represents the pre-determined value of sensitivity (or specificity); Z 1-α/2  \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\mathrm n=\\;\\frac{\\left({\\mathrm Z}_{1-\\mathrm\\alpha/2}\\right)^2\\mathrm P\\left(1-\\mathrm P\\right)}{\\triangle^2}$$\\end{document} Primer and probe design Primer and probe design: Primers and probes for Vimentin and POU4F2 were designed based on the DNA sequences after bisulfite conversion, targeting the dense CpG island regions in the gene promoter areas (Vimentin: Chr10 + 17,270,244–17272636; POU4F2: Chr7: + 147,559,626–147,560,645) (Fig. S1 and S2). All primers were validated for product specificity using melting curve analysis and gel electrophoresis. Primer and probe design principles: The probes spanned ≥ 3 CpG sites, with the 5’ end labeled with FAM/ROX and the 3’ end quenched with BHQ1/BHQ2. Primer length ranged from 18 to 22 bp, with a Tm value of 58 ± 2 °C, and primer dimers as well as non-specific amplification were minimized (verified using Oligo 7 software). Study design and participants We conducted a retrospective diagnostic study using urine samples, which were divided into training and validation sets for model development. Urine samples from 151 BC patients, 218 patients with other urinary diseases, 86 patients with malignancies in other systems, and 12 healthy individuals were collected from the First Affiliated Hospital of Anhui Medical University and split into training and validation sets at a 2:1 ratio. The training set ( n n 1 Fig. 1 Study flow of participants in the study. A total of 467 urine samples were collected; methylation levels of Vimentin and POU4F2 were analyzed in 306 samples and subsequently validated in 161 samples using RT-PCR. All samples were obtained from the First Affiliated Hospital of Anhui Medical University, with ethical approval granted by its Medical Ethics Committee All participants underwent standard urological evaluations, including cystoscopy and computed tomography urography. BC diagnoses were made by attending physicians and confirmed through histopathological evaluation. The control group consisted of patients with other urinary diseases, without cystoscopically visible or histopathologically confirmed BC, and with no prior history of the disease. Meanwhile, urine samples from patients with malignancies in other systems, confirmed through histopathological or imaging examinations, were classified as the interference group. The interference group, experimental group, and control group samples were used not only for model training and fitting (for regression models) but also for post-model validation to assess the predictive performance and robustness of the established regression model. Sample processing and DNA extraction Morning urine samples from cancer patients were collected prior to any surgical or therapeutic intervention. Approximately 100–200 mL of urine was collected and stored in collection tubes (Anhui Anlong Gene Technology Co., Ltd., Anhui, China). Freshly collected 100 mL urine samples were gently mixed, transferred to 50 mL centrifuge tubes, and centrifuged at 3500 rpm for 10 min using a benchtop centrifuge. The supernatant was discarded, and the cell pellets at the bottom were collected. One milliliter of PBS was added to the pellets, mixed, and centrifuged at 3500 rpm for 2 min. The supernatant was discarded, yielding purified urine cell pellets. DNA was extracted from the cell pellets using the Nucleic Acid Extraction and Purification Kit (Magnetic bead method) (Anhui Anlong Gene Technology Co., Ltd.). The purified DNA was transferred to a new tube and stored at −20 °C for subsequent methylation analysis. Urine cell sediments obtained by centrifugation can be stored at −70 °C ± 10 ℃ or lower for up to 12 months. DNA methylation analysis The methylation status of two genes was analyzed by RT-PCR using ACTB as the reference gene [ 29 Statistical analysis Receiver operating characteristic (ROC) curves were used to evaluate the sensitivity, specificity, and accuracy of single or combined biomarkers for the classification of BC using IBM SPSS Statistics 24 (IBM, New York, NY). For single-gene performance analysis, the comparative Ct (ΔCt) method was used to calculate the Ct values of the target genes, based on the Ct values of the Vimentin and POU4F2 genes. A ΔCt Vimentin POU4F2 POU4F2 Vimentin P −ABI7500 P P Sensitivity was defined as the proportion of correctly identified positive BC samples among all BC samples. Specificity was defined as the proportion of correctly identified negative samples among all normal/benign urinary disease and other malignancy samples. Positive predictive value (PPV; the probability that the disease is present given a positive test result) and negative predictive value (NPV; the probability that the disease is absent given a negative test result) were also calculated. The association between test positivity and demographic characteristics was assessed using the Chi-square test. Statistical significance was defined as P Results ROC analysis of Vimentin and POU4F2 methylation biomarkers The methylation levels of Vimentin and POU4F2 biomarkers in urine cell pellets from BC cases, controls, and interference groups were analyzed using RT-PCR. Results showed that mean ∆CT values of Vimentin (4.61) and POU4F2 (5.20) were significantly lower in cases compared to controls (13.73 and 11.66, respectively) (Fig. 2 2 Fig. 2 Methylation level distribution and diagnostic performance analysis of Vimentin and POU4F2, as well as the combined two-gene methylation panel, in BC cases and controls. A B A B C D E D E F G I G H I ROC analysis demonstrated the diagnostic efficacy of Vimentin and POU4F2 methylation in urine DNA, with AUCs of 0.926 (95% CI: 0.889–0.963) and 0.928 (95% CI: 0.895–0.961), respectively, for identifying BC (Fig. 2 2 2 2 Additionally, the diagnostic performance of the validation set was marginally lower compared to that of the training set. The sensitivity, specificity and accuracy of Vimentin were 83.05% (95% CI: 0.735–0.926), 88.24% (95% CI: 0.820–0.945) and 86.34% (95% CI: 0.808–0.919), with an AUC of 0.912 (95% CI: 0.858–0.967) (Fig. 2 2 2 Diagnostic value of Vimentin/POU4F2 combined methylation biomarkers in urine DNA Currently, the main screening methods for BC have notable limitations, including overdiagnosis, low sensitivity, and high false-positive rates. These limitations hinder effective early-stage detection, reducing the reliability and utility of early screening. Given the high false-positive rates and overdiagnosis associated with imaging-based screening, unnecessary invasive procedures should be minimized, particularly in patients with benign urinary conditions. The PPV and NPV of Vimentin were 80.33% (95% CI: 0.703–0.904) and 90.00% (95% CI: 0.841–0.959), respectively. For POU4F2, the PPV and NPV were 72.86% (95% CI: 0.624–0.834) and 91.21% (95% CI: 0.853–0.971), respectively (Fig. 3 3 Fig. 3 Distributions of PPV and NPV for Vimentin, POU4F2, and the combined Vimentin/POU4F2 methylation panel in the training and validation sets. A B A B C Diagnostic performance of the dual-gene methylation panel in different subtypes A comprehensive analysis was conducted to evaluate potential biases and diagnostic efficacy in demographic and clinicopathological characteristics, including age, gender, and tumor stage, of the Vimentin/POU4F2 combined methylation panel in urine DNA. Detailed data results are provided in Table S2. ROC analysis demonstrated that, when differentiating BC from patients with other urinary diseases, the AUCs of the two-gene methylation panel in the validation set were 0.936 (95% CI: 0.889–0.984) (Fig. 4 4 4 4 4 4 Fig. 4 Diagnostic performance of the dual-gene methylation panel across different subtypes. A B C D E F G F G In the age and gender analysis, the AUCs of the Vimentin/POU4F2 methylation panel for BC patients aged ≥ 50 years in the validation set were 0.947 (95% CI: 0.907–0.987) (Fig. 4 4 4 Discussion BC is one of the most prevalent malignancies of the urinary system, with both morbidity and mortality rates consistently increasing each year [ 30 3 31 27 Reliable clinical biomarkers for tumors should, ideally, be non-invasive, demonstrating high specificity and sensitivity, thus offering clinicians a useful tool to overcome the limitations of cystourethroscopy and imaging, and to prioritize patients for invasive diagnostic interventions [ 28 32 33 34 Previous studies have indicated that most patients are hesitant to replace cystoscopy with urinary tests that have sensitivities lower than 90%. In this retrospective biomarker study, we developed a novel methylation marker panel comprising Vimentin/POU4F2 for detecting BC, achieving an AUC of 0.935, with sensitivity, specificity, and accuracy of 86.44%, 96.08% and 92.55% for diagnosing BC (Fig. 2 4 4 2 3 Interestingly, our study identified a significant correlation between the methylation status of Vimentin/POU4F2 and physiological age. The positivity rate for Vimentin/POU4F2 combined methylation was higher in patients aged 50 years or older. It is well established that age significantly influences DNA methylation. Numerous studies have shown that aging is associated with changes in tumor suppressor genes and global genome hypomethylation [ 35 36 37 Limitations and strengths of the study Nevertheless, several limitations of this study warrant consideration. First, the applicability of the Vimentin/POU4F2 methylation panel to other urothelial carcinomas—such as ureteral, renal pelvic, and upper tract tumors—remains to be determined. Future studies should include urine samples from a broader range of urothelial carcinoma patients to further evaluate the panel’s diagnostic performance. Second, this study employed a case–control design. To enhance clinical relevance and validate our findings, a large multicenter trial is warranted. A head-to-head comparison between the Vimentin/POU4F2 panel and urine cytology in matched samples is essential to fully assess their relative clinical utility. However, due to the study’s focus on biomarker discovery, model construction, and internal validation, cytology tests were not conducted concurrently on the same sample sets owing to design and resource constraints. A rigorous head-to-head comparison with urine cytology will be performed in a large, independent external validation cohort. Key strengths of this study include the strong diagnostic performance of novel urinary methylation markers and the practicality of home-based sample collection with remote laboratory submission. This renders the approach widely applicable and truly non-invasive for routine clinical use. Additionally, the method requires only two methylation markers and one reference gene in a simplified, cost-effective PCR assay, enabling rapid deployment in routine diagnostic laboratories. Conclusion In conclusion, the Vimentin/POU4F2 methylation biomarkers exhibit high specificity, sensitivity, and diagnostic value for non-invasive BC detection, supporting their cost-effective clinical applicability. Collectively, these findings indicate that urinary gDNA methylation biomarkers offer a reliable, non-invasive, and cost-effective adjunct for future BC diagnosis. Supplementary Information  Supplementary Material 1. Abbreviations BC Bladder carcinoma POU4F2 POU class 4 homeobox 2 gene RT-PCR Real-Time PCR ROC Receiver operator characteristic PPV Positive predictive value NPV Negative predictive value AUC Area under the curve CI Confidence interval Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Jialong Zhang and Xiaowei Cheng contributed equally to this work. Acknowledgements We thank all healthy volunteers, patients, and their families for their voluntary, participation in this study, as well as the investigators and research staff involved in this study. Authors’ contributions W, T and X conceived and designed the study. Z analyzed the data, and wrote the manuscript. Z, C and H performed the experiments. W, T and X revised the manuscript. X and H collected the data. All authors helped to the data interpretation and manuscript writing and reviewing and approved the final manuscript. Funding Our research was funded by the Research Fund of Anhui Institute of Translational Medicine (No. 2023zhyx-B03), the Hefei Municipal Key Technology Research and Development Program (GJ2022SM01), and the Key Scientific Research Foundation of the Education Department of Anhui Province (2024AH050828). Data availability The datasets used and analyzed during the current study are available from the corresponding author on reasonable request. Subjects’ data are not publicly available as they contain information that could compromise participants’ consent and confidentiality. Declarations Ethics approval and consent to participate The participants were enrolled at the First Affiliated Hospital of Anhui Medical University. All subjects signed the informed consent before urine collection, and they were informed of the usage of urine and the test results. Ethical approval was granted by the Medical Ethics Committees of the First Affiliated Hospital of Anhui Medical University, and all procedures adhered to the ethical standards outlined in the Declaration of Helsinki (or other relevant guidelines). Additional documentation (e.g., consent forms) can be provided upon request. Consent for publication Not Applicable. Competing interests The authors declare no competing interests. References 1. Connors D Allen J Alvarez JD International liquid biopsy standardization alliance white paper Crit Rev Oncol Hematol 2020 156 103112 10.1016/j.critrevonc.2020.103112 33035734 Connors D, Allen J, Alvarez JD, et al. International liquid biopsy standardization alliance white paper. Crit Rev Oncol Hematol. 2020;156:103112. 33035734 10.1016/j.critrevonc.2020.103112 2. Ma N Jeffrey SS Deciphering cancer clues from blood Science 2020 367 6485 1424 1425 10.1126/science.abb0736 32217712 Ma N, Jeffrey SS. Deciphering cancer clues from blood. Science. 2020;367(6485):1424–5. 32217712 10.1126/science.abb0736 3. Babjuk M Burger M Capoun O European Association of Urology Guidelines on Non-muscle-invasive Bladder Cancer (Ta, T1, and Carcinoma in Situ) Eur Urol 2022 81 1 75 94 10.1016/j.eururo.2021.08.010 34511303 Babjuk M, Burger M, Capoun O, et al. European Association of Urology Guidelines on Non-muscle-invasive Bladder Cancer (Ta, T1, and Carcinoma in Situ). Eur Urol. 2022;81(1):75–94. 34511303 10.1016/j.eururo.2021.08.010 4. Wu X Sheng X Molecular subtyping in urothelial carcinoma treatment Cancer Cell 2024 42 12 1993 1996 10.1016/j.ccell.2024.11.001 39658539 Wu X, Sheng X. Molecular subtyping in urothelial carcinoma treatment. Cancer Cell. 2024;42(12):1993–6. 39658539 10.1016/j.ccell.2024.11.001 5. Wang Z Shi H Xu Y Intravesical Therapy for Upper Urinary Tract Urothelial Carcinoma: A Comprehensive Review Cancers (Basel) 2023 15 20 5020 10.3390/cancers15205020 37894387 PMC10605447 Wang Z, Shi H, Xu Y, et al. Intravesical Therapy for Upper Urinary Tract Urothelial Carcinoma: A Comprehensive Review. Cancers (Basel). 2023;15(20):5020. 37894387 10.3390/cancers15205020 PMC10605447 6. Svatek RS Hollenbeck BK Holmäng S The economics of bladder cancer: costs and considerations of caring for this disease Eur Urol 2014 66 2 253 262 10.1016/j.eururo.2014.01.006 24472711 Svatek RS, Hollenbeck BK, Holmäng S, et al. The economics of bladder cancer: costs and considerations of caring for this disease. Eur Urol. 2014;66(2):253–62. 24472711 10.1016/j.eururo.2014.01.006 7. He H Han C Hao L Zang G ImmunoCyt test compared to cytology in the diagnosis of bladder cancer: A meta-analysis Oncol Lett 2016 12 1 83 88 10.3892/ol.2016.4556 27347104 PMC4906922 He H, Han C, Hao L, Zang G. ImmunoCyt test compared to cytology in the diagnosis of bladder cancer: A meta-analysis. Oncol Lett. 2016;12(1):83–8. 27347104 10.3892/ol.2016.4556 PMC4906922 8. Cellina M Cè M Rossini N Computed Tomography Urography: State of the Art and Beyond Tomography 2023 9 3 909 930 10.3390/tomography9030075 37218935 PMC10204399 Cellina M, Cè M, Rossini N, et al. Computed Tomography Urography: State of the Art and Beyond. Tomography. 2023;9(3):909–30. 37218935 10.3390/tomography9030075 PMC10204399 9. Yafi FA Brimo F Steinberg J Prospective analysis of sensitivity and specificity of urinary cytology and other urinary biomarkers for bladder cancer Urol Oncol 2015 33 2 66.e25 31 10.1016/j.urolonc.2014.06.008 25037483 Yafi FA, Brimo F, Steinberg J, et al. Prospective analysis of sensitivity and specificity of urinary cytology and other urinary biomarkers for bladder cancer. Urol Oncol. 2015;33(2):66.e25-31. 25037483 10.1016/j.urolonc.2014.06.008 10. Messer J Shariat SF Brien JC Urinary cytology has a poor performance for predicting invasive or high-grade upper-tract urothelial carcinoma BJU Int 2011 108 5 701 705 10.1111/j.1464-410X.2010.09899.x 21320275 Messer J, Shariat SF, Brien JC, et al. Urinary cytology has a poor performance for predicting invasive or high-grade upper-tract urothelial carcinoma. BJU Int. 2011;108(5):701–5. 21320275 10.1111/j.1464-410X.2010.09899.x 11. Hanahan D Hallmarks of Cancer: New Dimensions Cancer Discov 2022 12 1 31 46 10.1158/2159-8290.CD-21-1059 35022204 Hanahan D. Hallmarks of Cancer: New Dimensions. Cancer Discov. 2022;12(1):31–46. 35022204 10.1158/2159-8290.CD-21-1059 12. Shi H Wang MX Caldwell CW CpG islands: their potential as biomarkers for cancer Expert Rev Mol Diagn 2007 7 5 519 531 10.1586/14737159.7.5.519 17892361 Shi H, Wang MX, Caldwell CW. CpG islands: their potential as biomarkers for cancer. Expert Rev Mol Diagn. 2007;7(5):519–31. 17892361 10.1586/14737159.7.5.519 13. Gontero P Montanari E Roupret M Comparison of the performances of the ADXBLADDER test and urinary cytology in the follow-up of non-muscle-invasive bladder cancer: a blinded prospective multicentric study BJU Int 2021 127 2 198 204 10.1111/bju.15194 32745350 PMC7891338 Gontero P, Montanari E, Roupret M, et al. Comparison of the performances of the ADXBLADDER test and urinary cytology in the follow-up of non-muscle-invasive bladder cancer: a blinded prospective multicentric study. BJU Int. 2021;127(2):198–204. 32745350 10.1111/bju.15194 PMC7891338 14. Ma L Guo H Zhao Y Liquid biopsy in cancer: current status, challenges and future prospects Nature 2024 9 336 10.1038/s41392-024-02021-w PMC11609310 39617822 Ma L, Guo H, Zhao Y, et al. Liquid biopsy in cancer: current status, challenges and future prospects. Nature. 2024;9:336. 10.1038/s41392-024-02021-w PMC11609310 39617822 15. Alix-Panabières C Marchetti D Lang JE Liquid biopsy: from concept to clinical application Sci Rep 2023 13 1 21685 10.1038/s41598-023-48501-x 38066040 PMC10709452 Alix-Panabières C, Marchetti D, Lang JE. Liquid biopsy: from concept to clinical application. Sci Rep. 2023;13(1):21685. 38066040 10.1038/s41598-023-48501-x PMC10709452 16. Hayashi Y Fujita K Matsuzaki K Diagnostic potential of TERT promoter and FGFR3 mutations in urinary cell-free DNA in upper tract urothelial carcinoma Cancer Sci 2019 110 5 1771 1779 10.1111/cas.14000 30887605 PMC6501003 Hayashi Y, Fujita K, Matsuzaki K, et al. Diagnostic potential of TERT promoter and FGFR3 mutations in urinary cell-free DNA in upper tract urothelial carcinoma. Cancer Sci. 2019;110(5):1771–9. 30887605 10.1111/cas.14000 PMC6501003 17. Zhang C Xu X Wang T Lu Y Lu Z Wang T Pan Z Clinical performance and utility of a noninvasive urine-based methylation biomarker: TWIST1/Vimentin to detect urothelial carcinoma of the bladder Sci Rep 2024 14 1 7941 10.1038/s41598-024-58586-7 38575639 PMC10995167 Zhang C, Xu X, Wang T, Lu Y, Lu Z, Wang T, Pan Z. Clinical performance and utility of a noninvasive urine-based methylation biomarker: TWIST1/Vimentin to detect urothelial carcinoma of the bladder. Sci Rep. 2024;14(1):7941. 38575639 10.1038/s41598-024-58586-7 PMC10995167 18. Wu Y Jiang G Zhang N Liu S Lin X Perschon C Zheng SL Ding Q Wang X Na R HOXA9, PCDH17, POU4F2, and ONECUT2 as a Urinary Biomarker Combination for the Detection of Bladder Cancer in Chinese Patients with Hematuria Eur Urol Focus 2020 6 2 284 291 10.1016/j.euf.2018.09.016 30309818 Wu Y, Jiang G, Zhang N, Liu S, Lin X, Perschon C, Zheng SL, Ding Q, Wang X, Na R, et al. HOXA9, PCDH17, POU4F2, and ONECUT2 as a Urinary Biomarker Combination for the Detection of Bladder Cancer in Chinese Patients with Hematuria. Eur Urol Focus. 2020;6(2):284–91. 30309818 10.1016/j.euf.2018.09.016 19. Xu C Zeng Q Hou J Gao L Zhang Z Xu W Yang B Sun Y Utility of a modality combining FISH and cytology in upper tract urothelial carcinoma detection in voided urine samples of Chinese patients Urology 2011 77 3 636 641 10.1016/j.urology.2010.07.498 21256577 Xu C, Zeng Q, Hou J, Gao L, Zhang Z, Xu W, Yang B, Sun Y. Utility of a modality combining FISH and cytology in upper tract urothelial carcinoma detection in voided urine samples of Chinese patients. Urology. 2011;77(3):636–41. 21256577 10.1016/j.urology.2010.07.498 20. Yang J Niu H Huang Y Yang K A Systematic Analysis of the Relationship of CDH13 Promoter Methylation and Breast Cancer Risk and Prognosis PLoS ONE 2016 11 5 e0149185 10.1371/journal.pone.0149185 27153114 PMC4859545 Yang J, Niu H, Huang Y, Yang K. A Systematic Analysis of the Relationship of CDH13 Promoter Methylation and Breast Cancer Risk and Prognosis. PLoS ONE. 2016;11(5):e0149185. 27153114 10.1371/journal.pone.0149185 PMC4859545 21. Deng M Yang H Xie X Liang G Gan L Comparative expression analysis of POU4F1, POU4F2 and ISL1 in developing mouse cochleovestibular ganglion neurons Gene Expr Patterns 2014 15 1 31 37 10.1016/j.gep.2014.03.001 24709358 PMC4065884 Deng M, Yang H, Xie X, Liang G, Gan L. Comparative expression analysis of POU4F1, POU4F2 and ISL1 in developing mouse cochleovestibular ganglion neurons. Gene Expr Patterns. 2014;15(1):31–7. 24709358 10.1016/j.gep.2014.03.001 PMC4065884 22. Pérez-Sala D Oeste CL Martínez AE Vimentin filament organization and stress sensing depend on its single cysteine residue and zinc binding Nature Commun 2015 6 7287 10.1038/ncomms8287 26031447 PMC4458873 Pérez-Sala D, Oeste CL, Martínez AE, et al. Vimentin filament organization and stress sensing depend on its single cysteine residue and zinc binding. Nature Commun. 2015;6:7287. 26031447 10.1038/ncomms8287 PMC4458873 23. Poddar NK Agarwal D Agrawal Y Deciphering the enigmatic crosstalk between prostate cancer and Alzheimer's disease: A current update on molecular mechanisms and combination therapy Biochim Biophys Acta Mol Basis Dis 2022 1868 11 166524 10.1016/j.bbadis.2022.166524 35985445 Poddar NK, Agarwal D, Agrawal Y, et al. Deciphering the enigmatic crosstalk between prostate cancer and Alzheimer’s disease: A current update on molecular mechanisms and combination therapy. Biochim Biophys Acta Mol Basis Dis. 2022;1868(11):166524. 35985445 10.1016/j.bbadis.2022.166524 24. Usman S Waseem NH Nguyen TKN Vimentin Is at the Heart of Epithelial Mesenchymal Transition (EMT) Mediated Metastasis Cancers (Basel) 2021 13 19 4985 10.3390/cancers13194985 34638469 PMC8507690 Usman S, Waseem NH, Nguyen TKN, et al. Vimentin Is at the Heart of Epithelial Mesenchymal Transition (EMT) Mediated Metastasis. Cancers (Basel). 2021;13(19):4985. 34638469 10.3390/cancers13194985 PMC8507690 25. Monteiro-Reis S Leça L Almeida M Accurate detection of upper tract urothelial carcinoma in tissue and urine by means of quantitative GDF15, TMEFF2 and VIM promoter methylation Eur J Cancer 2014 50 1 226 233 10.1016/j.ejca.2013.08.025 24100025 Monteiro-Reis S, Leça L, Almeida M, et al. Accurate detection of upper tract urothelial carcinoma in tissue and urine by means of quantitative GDF15, TMEFF2 and VIM promoter methylation. Eur J Cancer. 2014;50(1):226–33. 24100025 10.1016/j.ejca.2013.08.025 26. Costa VL Henrique R Danielsen SA Three epigenetic biomarkers, GDF15, TMEFF2, and VIM, accurately predict bladder cancer from DNA-based analyses of urine samples Clin Cancer Res 2010 16 23 5842 5851 10.1158/1078-0432.CCR-10-1312 20975101 Costa VL, Henrique R, Danielsen SA, et al. Three epigenetic biomarkers, GDF15, TMEFF2, and VIM, accurately predict bladder cancer from DNA-based analyses of urine samples. Clin Cancer Res. 2010;16(23):5842–51. 20975101 10.1158/1078-0432.CCR-10-1312 27. Elsawy AA Harraz AM Ghobrial FK Abdullatef M Ali-El-Dein B Diagnostic performance and predictive capacity of early urine cytology after transurethral resection of nonmuscle invasive bladder cancer: A prospective study Urol Oncol 2020 38 12 935.e1 935.e8 10.1016/j.urolonc.2020.06.012 32654947 Elsawy AA, Harraz AM, Ghobrial FK, Abdullatef M, Ali-El-Dein B. Diagnostic performance and predictive capacity of early urine cytology after transurethral resection of nonmuscle invasive bladder cancer: A prospective study. Urol Oncol. 2020;38(12):935.e1-935.e8. 32654947 10.1016/j.urolonc.2020.06.012 28. Lee HH Kim SH Review of non-invasive urinary biomarkers in bladder cancer Transl Cancer Res 2020 9 10 6554 6564 10.21037/tcr-20-1990 35117265 PMC8798424 Lee HH, Kim SH. Review of non-invasive urinary biomarkers in bladder cancer. Transl Cancer Res. 2020;9(10):6554–64. 35117265 10.21037/tcr-20-1990 PMC8798424 29. Snellenberg S De Strooper LM Hesselink AT Development of a multiplex methylation-specific PCR as candidate triage test for women with an HPV-positive cervical scrape BMC Cancer 2012 12 551 10.1186/1471-2407-12-551 23176198 PMC3517769 Snellenberg S, De Strooper LM, Hesselink AT, et al. Development of a multiplex methylation-specific PCR as candidate triage test for women with an HPV-positive cervical scrape. BMC Cancer. 2012;12:551. 23176198 10.1186/1471-2407-12-551 PMC3517769 30. Sung H Ferlay J Siegel RL Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J Clin 2021 71 3 209 249 33538338 10.3322/caac.21660 Sung H, Ferlay J, Siegel RL, et al. Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries. CA Cancer J Clin. 2021;71(3):209–49. 33538338 10.3322/caac.21660 31. Koh HH Lee MJ Park NJ Impact of Implementing the Paris System for Reporting Urinary Cytology: A Single-institutional Experience With Emphasis on Diagnostic Yield of High-grade Urothelial Carcinoma and Low-grade Urothelial Neoplasm Anticancer Res 2020 40 6 3477 3484 10.21873/anticanres.14334 32487647 Koh HH, Lee MJ, Park NJ, et al. Impact of Implementing the Paris System for Reporting Urinary Cytology: A Single-institutional Experience With Emphasis on Diagnostic Yield of High-grade Urothelial Carcinoma and Low-grade Urothelial Neoplasm. Anticancer Res. 2020;40(6):3477–84. 32487647 10.21873/anticanres.14334 32. Chou R Gore JL Buckley D Fu R Gustafson K Griffin JC Urinary Biomarkers for Diagnosis of Bladder Cancer: A Systematic Review and Meta-analysis Ann Intern Med 2015 163 12 922 931 10.7326/M15-0997 26501851 Chou R, Gore JL, Buckley D, Fu R, Gustafson K, Griffin JC, et al. Urinary Biomarkers for Diagnosis of Bladder Cancer: A Systematic Review and Meta-analysis. Ann Intern Med. 2015;163(12):922–31. 26501851 10.7326/M15-0997 33. Zhu H Wang G Qian J Transcription factors as readers and effectors of DNA methylation Nat Rev Genet 2016 17 9 551 565 10.1038/nrg.2016.83 27479905 PMC5559737 Zhu H, Wang G, Qian J. Transcription factors as readers and effectors of DNA methylation. Nat Rev Genet. 2016;17(9):551–65. 27479905 10.1038/nrg.2016.83 PMC5559737 34. Halling KC King W Sokolova IA A comparison of cytology and fluorescence in situ hybridization for the detection of urothelial carcinoma J Urol 2000 164 5 1768 1775 10.1016/S0022-5347(05)67104-2 11025767 Halling KC, King W, Sokolova IA, et al. A comparison of cytology and fluorescence in situ hybridization for the detection of urothelial carcinoma. J Urol. 2000;164(5):1768–75. 11025767 35. Seale K Horvath S Teschendorff A Making sense of the ageing methylome Nat Rev Genet 2022 23 10 585 605 10.1038/s41576-022-00477-6 35501397 Seale K, Horvath S, Teschendorff A, et al. Making sense of the ageing methylome. Nat Rev Genet. 2022;23(10):585–605. 35501397 10.1038/s41576-022-00477-6 36. Bell CG Lowe R Adams PD DNA methylation aging clocks: challenges and recommendations Genome Biol 2019 20 1 249 10.1186/s13059-019-1824-y 31767039 PMC6876109 Bell CG, Lowe R, Adams PD, et al. DNA methylation aging clocks: challenges and recommendations. Genome Biol. 2019;20(1):249. 31767039 10.1186/s13059-019-1824-y PMC6876109 37. Lu AT Fei Z Haghani A Universal DNA methylation age across mammalian tissues Nat Aging 2023 3 9 1144 1166 10.1038/s43587-023-00462-6 37563227 PMC10501909 Lu AT, Fei Z, Haghani A, et al. Universal DNA methylation age across mammalian tissues. Nat Aging. 2023;3(9):1144–66. 37563227 10.1038/s43587-023-00462-6 PMC10501909 ",
  "metadata": {
    "Title of this paper": "Universal DNA methylation age across mammalian tissues",
    "Journal it was published in:": "BMC Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482282/"
  }
}