{
  "title": "Paper_860",
  "abstract": "pmc JTO Clin Res Rep JTO Clin Res Rep 4097 jtocrr JTO Clinical and Research Reports 2666-3643 Elsevier PMC12478256 PMC12478256.1 12478256 12478256 41031047 10.1016/j.jtocrr.2025.100844 S2666-3643(25)00061-X 100844 1 Original Article Evaluation of the Safety, Pharmacokinetics, and Antitumor Activity of Tusamitamab Ravtansine in Patients With Nonsquamous NSCLC With High or Moderate Expression of Carcinoembryonic Antigen-Related Cell Adhesion Molecule 5 Gazzah Anas MD Anas.gazzah@gustaveroussy.fr a ∗ Ricordel Charles MD, PhD b Italiano Antoine MD, PhD c d Cho Byoung Chul MD, PhD e Calvo Emiliano MD, PhD f Kim Dong-Wan MD, PhD g Helissey Carole MD h Kim Jin-Soo MD, PhD i Villar Maria Vieito MD j Ghiringhelli Francois HDR k Moreno Victor MD, PhD l Cousin Sophie MD m Paz-Ares Luis MD, PhD n Fagniez Nathalie Pharm D o Chadjaa Mustapha MD p Bauchet Anne-Laure DECVP, PhD q Soufflet Christine MD p Masson Nina MSc r Barlesi Fabrice MD, PhD s t u v a b c d e f g h i j k l m n o p q r s t u v ∗ Anas.gazzah@gustaveroussy.fr 10 2025 15 5 2025 6 10 496429 100844 3 1 2025 30 3 2025 27 4 2025 15 05 2025 30 09 2025 01 10 2025 © 2025 by the International Association for the Study of Lung Cancer. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Introduction Tusamitamab ravtansine is an antibody-drug conjugate targeting cells expressing carcinoembryonic antigen-related cell adhesion molecule 5 (CEACAM5) with a maytansinoid payload, DM4. This phase 1b dose-expansion study ( NCT02187848 Methods Patients aged above or equal to 18 years with advanced or metastatic NSq NSCLC, life expectancy more than or equal to 12 weeks, and high (≥2+ intensity in ≥50% of tumor cells) or moderate (≥2+ intensity in 1%–49% of tumor cells) CEACAM5 expression (assessed by immunohistochemistry) received intravenous tusamitamab ravtansine 100 mg/m 2 Results A total of 64 patients with high and 28 with moderate CEACAM5 expression received a median of 8.0 (1–69) and 4.5 (1–38) treatment cycles, respectively. High expressors had 13 confirmed partial responses and 28 stable diseases (objective response rate, 20.3%; 95% confidence interval [CI]: 12.3%–31.7%, p p Treatment-emergent adverse events (AEs) occurred in 78.3% of patients (72/92), 37.0% (34/92) of patients required dose modifications, and 5.4% (5/92) discontinued treatment. The most common treatment-emergent AEs included asthenia (37.0%), keratitis (29.3%), and dyspnea (23.9%). Corneal AEs occurred in 38.0% (35/92), typically grade 1/2, reversible, and manageable by dose modifications. Conclusions Tusamitamab ravtansine demonstrated a favorable safety profile, objective responses, and antitumor activity in patients with high CEACAM5-expressing NSq NSCLC. Keywords Antibody-drug conjugate Carcinoembryonic antigen-related cell adhesion molecule 5 Non–small cell lung cancer Phase 1 study Tusamitamab ravtansine pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Lung cancer is the leading cause of cancer mortality worldwide. 1 2 3 4 5 6 Antibody-drug conjugates (ADCs) are a promising therapeutic approach to improve outcomes in patients with advanced metastatic cancer. 7 7 8 , 9 9 , 10 11 12 13 Tusamitamab ravtansine (SAR408701) is an ADC that comprises a humanized anti-CEACAM5 antibody joined by a cleavable N-succinimidyl 4-(2-pyridyldithio)butyrate linker to a cytotoxic maytansinoid payload (DM4) with a mean drug-to-antibody ratio of 3.8. 14 9 , 14 15 16 Tusamitamab ravtansine exhibited antitumor activity in vitro and in patient-derived xenograft models, 9 14 17 The safety, dose-limiting toxicity (DLT), and maximum tolerated dose of tusamitamab ravtansine were determined in a first-in-human phase 1/1b study in patients with advanced solid tumors ( ClinicalTrials.gov NCT02187848 17 , 18 2 17 2 Methods Study Design This study in patients with solid tumors comprised a phase 1 dose-escalation part previously reported 17 Fig. 1 Figure 1 Study design. CEACAM5, carcinoembryonic antigen-related cell adhesion molecule 5; MTD, maximum tolerated dose; NSq NSCLC, nonsquamous NSCLC; Q2W, every 2 weeks. Patients Patients eligible for the NSq NSCLC dose-expansion part of the trial were at least 18 years of age, had an Eastern Cooperative Oncology Group performance status of 0 or 1, and had locally advanced or metastatic NSq NSCLC for which no standard alternative therapy was available. Patients were required to have at least one measurable lesion by Response Evaluation Criteria in Solid Tumours (RECIST) version 1.1 19 Supplementary Materials 9 Patients were excluded if they had poor organ function, low bone marrow reserve, known or symptomatic brain metastasis (other than totally resected or previously irradiated and non-progressive/relapsing), an expected life expectancy less than 12 weeks, a history of or unresolved corneal disorders, or if they had previously received CEACAM5-targeted or maytansinoid-based therapy. Treatment Intravenous tusamitamab ravtansine 100 mg/m 2 Supplementary Materials End Points The primary end point was the objective response rate (ORR), defined as the percentage of patients with a confirmed objective response (OR) of complete response (CR) or partial response (PR) by RECIST version 1.1 criteria. 19 Assessments Tumor assessments were performed at least every 4 cycles, and tumor growth rate was assessed using RECIST version 1.1. 20 Safety was assessed by physical examination, laboratory tests, and adverse event (AE) reports. AEs were graded according to the National Cancer Institute Common Terminology for Adverse Events (version 4.03) and coded using the Medical Dictionary for Regulatory Activities (version 23.1). Ophthalmologic assessments are described in the Supplementary Materials Tusamitamab ravtansine plasma concentrations were determined by a validated immunoassay (lower limit of quantitation [LLOQ] 0.500 μg/mL) that detects ADCs with at least 1 DM4 moiety. Plasma concentrations of DM4 and Me-DM4 were determined by a validated liquid-chromatography–tandem mass spectrometry assay (LC-MS/MS, LLOQ 0.200 ng/mL). Pharmacokinetic parameters were calculated by standard noncompartmental analysis. Immunogenicity assessments are described in the Supplementary Materials Data Analysis The primary efficacy analysis used the all-treated population (patients who received at least one dose of tusamitamab ravtansine) by CEACAM5 expression cohort (high or moderate). DOR was calculated for patients with a confirmed response, and the median TTP was estimated using the Kaplan-Meier method. Tumor shrinkage was evaluated using the response-evaluable population (treated patients with measurable disease at study entry and at least one post-baseline assessable tumor assessment). The PK population comprised patients with at least one drug concentration measurement after study drug administration. The ORR and 95% confidence intervals (CIs) were estimated using the Wilson score interval. A binomial test against the null hypothesis (response rate = 5%) was performed using a one-sided test with an alpha level of 0.025. A post hoc analysis using the Kaplan-Meier method evaluated progression-free survival (PFS). Results Of 888 patients with NSq NSCLC who were prescreened for CEACAM5 expression, 172 patients (19.4%) had high CEACAM5 expression and 210 (23.6%) had moderate CEACAM5 expression. From these individuals with NSq NSCLC, 80 patients with high CEACAM5 expression and 44 with moderate CEACAM5 expression were screened, of whom 64 and 28 patients, respectively, were enrolled. The first patients were enrolled on January 2, 2017, and the last patient received cycle 1 on October 8, 2019; the data cutoff date was November 19, 2020. Known or symptomatic brain metastases or leptomeningeal carcinomatosis were the most common reason for exclusion (six and four patients with high and moderate CEACAM5 expression, respectively). At the data cutoff, six patients (9.4%) with high CEACAM5 expression and one patient (3.6%) with moderate CEACAM5 expression remained on treatment. All patients had metastatic and measurable disease, and most patients had received at least three previous regimens, including previous anti-programmed cell death protein 1/programmed cell death ligand 1 (anti–PD-1/PD-L1) treatment, and had discontinued their most recent regimen because of disease progression ( Table 1 Table 1 Baseline Demographics and Patient Characteristics Parameters High CEACAM5 Expression n Moderate CEACAM5 Expression n Age, y, median (range) 61.5 (41–91) 64.5 (31–73) Age group, y, n <65 39 (60.9) 14 (50.0) ≥65 to <75 17 (26.6) 14 (50.0) ≥75 8 (12.5) 0 Female, n 27 (42.2) 18 (64.3) Race, n White 52 (81.3) 25 (89.3) Asian 12 (18.8) 3 (10.7) ECOG PS, n 0 19 (29.7) 7 (25.0) 1 45 (70.3) 20 (71.4) 2 0 0 3 0 1 (3.6%) Organs involved (≥20% in either group), a n Lung 57 (89.1) 24 (85.7) Lymph node 33 (51.6) 21 (75.0) Bone 23 (35.9) 7 (25.0) Pleura 20 (31.3) 5 (17.9) Liver 17 (26.6) 6 (21.4) Brain 13 (20.3) 4 (14.3) Number of prior regimens, median (range) 3 (1–10) 3 (1–8) Number of prior regimens, n 1 2 (3.1) 1 (3.6) 2 18 (28.1) 9 (32.1) ≥3 44 (68.8) 18 (64.3) Prior anti–PD-1/PD-L1 treatment, n 45 (70.3) 24 (85.7) Discontinuation of last regimen due to disease progression 51 (79.7) 22 (78.6) CEACAM5 expression (intensity 2+/3+) b ≥80% 34 (53.1) — 50% to <80% 30 (46.9) — <50% — 28 (100) Circulating CEA ≥5 μg/L, n 53 (85.5) 23 (82.1) CEA, carcinoembryonic antigen; CEACAM5, carcinoembryonic antigen-related cell adhesion molecule 5; ECOG PS, Eastern Cooperative Oncology Group performance status; PD-1/PD-L1, programmed cell death protein 1/programmed cell death ligand 1. a Organs involved include target or nontarget lesions as defined by Response Evaluation Criteria in Solid Tumours version 1.1 and reported by study investigators at baseline. b CEACAM5 expression was assessed on the most recently available archival tissue sample ( Supplementary Materials Limited data were available for molecular alterations at baseline, which were collected as part of patient history; however, among those who were evaluated, the most common molecular alterations involved KRAS EGFR Supplementary Table 1 The median duration of study treatment at the data cutoff was 3.9 months (range 0.5–35.5 mo) in patients with high CEACAM5 expression and 2.3 months (0.5–20.9 mo) in patients with moderate CEACAM5 expression. The median number of treatment cycles was 8.0 (range 1.0–69.0) and 4.5 (1.0–38.0) per patient, respectively. In patients with high CEACAM5 expression, cycle delays, dose reduction, and dose interruptions occurred in 45.3%, 12.5%, and 1.6% of patients, respectively; corresponding values in patients with moderate CEACAM5 expression were 35.7%, 10.7%, and 0%. Reasons for discontinuation for patients with high and moderate CEACAM5 expression, respectively, included disease progression (54 [84.4%] and 23 [82.1%] patients), AEs (3 [4.7%] and 2 [7.1%] patients), and other reasons (1 [1.6%] and 2 [7.1%] patients). Antitumor Activity Among 64 patients with high CEACAM5 expression, the best overall responses were confirmed PRs in 13 patients (ORR, 20.3% [95% CI: 12.3%–31.7%]) and stable disease (SD) in 28 patients (43.8%) ( Table 2 Figure 2 A–C Table 2 Best Overall Response in Patients With NSCLC With High and Moderate CEACAM5 Expression Parameters, n Patients With High CEACAM5 Expression a n Patients With Moderate CEACAM5 Expression b n Best overall response Complete response (CR) c 0 0 Partial response (PR) c 13 (20.3) 2 (7.1) Stable disease (SD) 28 (43.8) 15 (53.6) Progressive disease (PD) 16 (25.0) 8 (28.6) Not evaluable d 7 (10.9) 3 (10.7) Disease control rate (CR, PR, and SD) 41 (64.1) 17 (60.7) Objective response rate (confirmed CR and PR) 13 (20.3) 2 (7.1) 95% CI, % (12.3–31.7) (2.0–22.7)  p e <0.0001 0.4117 CEACAM5, carcinoembryonic antigen-related cell adhesion molecule 5; CI, confidence interval; CR, complete response; PD, progressive disease; PR, partial response; SD, stable disease. a Defined as more than or equal to 2+ staining intensity in more than or equal to 50% of the tumor cell population, as assessed by immunohistochemistry. b Defined as more than or equal to 2+ staining intensity in 1% to 49% of the tumor cell population. c Confirmation of response was required (a second examination was performed at least 4 wk apart). d Includes patients with no post-baseline evaluation due to early death or early progression based on symptomatic deterioration. e Binomial test against the null hypothesis of response rate of 5% performed using a one-sided 0.025 alpha level. Figure 2 Relative change from baseline in sum of tumor diameters over time in patients with nonsquamous NSCLC who were treated with tusamitamab ravtansine 100 mg/m 2 A, B A n B n C n n In patients with moderate CEACAM5 expression ( n Table 2 Fig. 2 B In a post hoc analysis, median PFS was 3.7 months (95% CI: 2.7–5.1) and 2.8 months (95% CI: 1.7–3.7) in patients with high and moderate CEACAM5 expression, respectively ( Supplementary Fig. 1 Among patients with high CEACAM5 expression, a confirmed objective response (OR) was observed in eight of 34 patients (23.5%; 95% CI: 12.4%–40.0%) with CEACAM5 expression in ≥80% of tumor cells, and in five of 30 patients (16.7%; 95% CI: 7.3%–33.6%) with CEACAM5 expression in 50% to <80% of tumor cells. Among patients with high CEACAM5 expression and evaluable tumors, mean (standard deviation) relative change from baseline in the sum of tumor diameters was −13.2% (29.6%) for patients with CEACAM5 intensity ≥2+ in ≥80% of tumor cells ( n n Fig. 2 C Patients with OR are grouped by prognostic factors at baseline in Supplementary Table 2 In post hoc analyses of response in patients with NSCLC with EGFR KRAS EGFR KRAS KRAS Treatment-Emergent Adverse Events All patients ( N Table 3 Table 3 Adverse Events Event Patients, n N Any TEAE 92 (100) TEAE grade ≥3 50 (54.3) TEAE grades 3–4 49 (53.3) TEAE grade 5 7 (7.6) Any serious TEAE 41 (44.6) Any treatment-related AE 72 (78.3) Treatment-related AE grade ≥3 18 (19.6) Treatment-related AE grades 3–4 18 (19.6) Treatment-related AE grade 5 0 Any serious treatment-related AE 4 (4.3) Any TEAE leading to dose modification a 34 (37.0) Any TEAE leading to permanent treatment discontinuation 5 (5.4) TEAEs occurring in ≥10% of patients All grades Grade ≥3 Asthenia 34 (37.0) 4 (4.3) Keratitis 27 (29.3) 10 (10.9) Dyspnea 22 (23.9) 11 (12.0) Decreased appetite 21 (22.8) 0 Diarrhea 21 (22.8) 1 (1.1) Keratopathy 14 (15.2) 2 (2.2) Cough 14 (15.2) 0 Nausea 13 (14.1) 1 (1.1) Arthralgia 13 (14.1) 0 Peripheral sensory neuropathy 12 (13.0) 0 Constipation 10 (10.9) 0 Hematological TEAEs b Anemia 3 (3.3) 2 (2.2) Lymphopenia 1 (1.1) 1 (1.1) Neutropenia 1 (1.1) 0 Neutrophil count decreased 1 (1.1) 0 Platelet count decreased 1 (1.1) 0 AE, adverse event; TEAE, treatment-emergent adverse event. a Dose reductions and/or interruptions and/or delayed treatment cycles. b Includes all blood and lymphatic system disorders (system organ class) and all investigations related to blood/lymphatic systems that were recorded by the investigator as a TEAE (defined as laboratory abnormalities considered to be medically relevant). There were 35 patients (38.0%) who experienced at least one corneal TEAE (11 experienced at least one grade 3 event). These included 27 patients (29.3%) with keratitis (10 with grade 3 events), 14 (15.2%) with keratopathy (two with grade 3 events), and one (1.1%) with superior limbic keratoconjunctivitis. No grade 4 (e.g., blindness, perforation) or serious corneal TEAEs occurred. All corneal TEAEs were treatment related. The first occurrence of corneal TEAEs was at cycle 2 in 11 patients, cycle 3 in five patients, and later in 19 patients. Among 35 patients with corneal TEAEs, dose modifications were implemented in 25; however, no patient required permanent discontinuation of the study drug. At the data cutoff, 25 patients had recovered, nine had not, and the outcome of one patient was unknown. No patient had a corneal event that resulted in permanent sequalae. The median time to recovery was 22 days (range, 8–264 d) in 17 patients with high CEACAM5 expression and 16.5 days (range, 8–30 d) in eight patients with moderate CEACAM5 expression. Mean exposure to tusamitamab ravtansine during cycle 1 was higher in patients with corneal AEs than that in those without corneal AEs ( Supplementary Fig. 2 Approximately half (7/13; 53.8%) of the patients with high CEACAM5 expression and a PR had a corneal event. Among patients with high CEACAM5 and corneal AEs, a PR was observed in five of 17 patients (29.4%; 95% CI: 13.3%–53.1%) with grade 1 to 2 corneal events and in two of nine patients (22.2%; 95% CI: 6.3%–54.7%) with grade 3 corneal events. In contrast, six of 38 patients (15.8%; 95% CI: 7.4%–30.4%) with high CEACAM5 expression and no corneal event had a PR. Both patients with moderate CEACAM5 expression and a PR had a corneal event (one each grade 2 and grade 3). Pharmacokinetics Maximum plasma concentrations of tusamitamab ravtansine were generally observed close to the end of the infusion, whereas those of DM4 and Me-DM4 occurred after (approximately 5 and 48 h, respectively) ( Fig. 3 Supplementary Tables 3 4 Supplementary Table 3 Supplementary Tables 3 4 21 Figure 3 Mean plasma concentration of tusamitamab ravtansine, its payload DM4, and its metabolite Me-DM4 at cycle 1 in patients with high CEACAM5 expression. CEACAM5, carcinoembryonic antigen-related cell adhesion molecule 5; DM4, maytansine derivative; Me-DM4, methylated-DM4. Immunogenicity Treatment-induced antitherapeutic antibodies were observed in seven patients with high CEACAM5 expression and one patient with moderate CEACAM5 expression. Patients Treated Long Term As of April 2022, 11 of 92 patients with high ( n n Supplementary Table 5 Supplementary Fig. 3 n Supplementary Fig. 4 n Supplementary Table 6 Corneal TEAEs were observed in eight of 11 patients who received tusamitamab ravtansine for at least 12 months, four of whom experienced grade 3 events; the first occurrence of any corneal TEAE ranged from cycle 2 to 6. Among patients treated for at least 12 months, corneal TEAEs were managed by treatment modifications in seven patients; no corneal TEAE led to permanent treatment discontinuation. Discussion The results of this study demonstrated that tusamitamab ravtansine 100 mg/m 2 The AE profile of patients with NSq NSCLC in this study was generally consistent with observations in previously described cohorts from this phase 1/1b study. 17 , 18 Corneal events were established as the main DLT of tusamitamab ravtansine in the phase 1 dose-escalation part of this study and were confirmed in subsequent dose-escalation cohorts that received alternative dosing regimens of tusamitamab ravtansine. 17 , 18 17 , 18 22 17 In the NSq NSCLC cohorts in this study, 38.0% of patients experienced at least one corneal TEAE, including keratitis, keratopathy, and superior limbic keratoconjunctivitis. Approximately half of these events occurred for the first time during the first four treatment cycles. Consistent with previous findings, all corneal events were nonserious and were typically manageable by dose modification (dose reductions and/or cycle delays). Corneal AEs have been reported previously for ADCs containing DM4 and other anti-tubulin payloads. 23 , 24 24 , 25 In this study, seven patients experienced grade 5 TEAEs, but no grade 5 TRAEs were reported, indicating that fatal events were not treatment related. These events were likely due to disease progression or other underlying factors. Tusamitamab ravtansine 100 mg/m 2 CEACAM5 expression status was determined prospectively by either local or central immunohistochemical analysis of tumor tissue, primarily on archival samples. However, IHC tests have some limitations. Expression of CEACAM5 in the archival sample may not reflect CEACAM5 expression at study initiation. Furthermore, CEACAM5 expression assessed in an archival sample from one biopsy location may not reflect that of the advanced or metastatic disease. Further investigations are needed to assess potential changes in CEACAM5 expression during the course of the disease. Overall, approximately 20% of patients in this phase 1/1b study who were prescreened for CEACAM5 expression had high CEACAM5 expression. The prevalence of high CEACAM5 expression in this study is consistent with the approximately 25% of patients with NSCLC having high CEACAM5 expression in a recently reported single-center study and the approximately 28% of tumor specimens with strong-to-moderate IHC staining in lung adenocarcinoma human tumor tissues. 9 , 26 In a post hoc analysis, we analyzed the potential relationship between efficacy and toxicity (i.e., corneal AEs), which has been reported for diverse anticancer therapies. 27 17 Additional analyses of other characteristics of patients with NSCLC who responded to tusamitamab ravtansine, including previous treatment with an anti-tubulin agent and molecular alterations present at baseline, did not reveal any obvious differences in confirmed ORR compared with that in nonresponders. Notably, among patients with high CEACAM5 expression, those without previous anti-tubulin treatment had a greater confirmed ORR than those with previous anti-tubulin treatment (28.0% versus 15.4%). No patients in this trial experienced a CR; however, achievement of a PR is likely clinically meaningful considering that the participants had advanced or metastatic disease and were heavily pretreated (at least two previous lines of chemotherapy). In this context, patients with high CEACAM5 expression who had a confirmed PR ( n n On the basis of the results of this phase 1/1b study, the efficacy and safety of tusamitamab ravtansine were explored in patients with NSCLC and CEACAM5 expression in subsequent studies. The phase 3 CARMEN-LC03 study ( NCT04154956 NCT04394624 NCT04524689 Our study has few limitations. This was a phase 1 study with relatively small number of patients and heavily pretreated participants. The study was not designed to statistically compare outcomes between the moderate and high CEACAM5 expression groups. It also lacked control group. In conclusion, the results of this dose-expansion study demonstrate that when administered as monotherapy, tusamitamab ravtansine 100 mg/m 2 CRediT Authorship Contribution Statement Anas Gazzah Charles Ricordel Antoine Italiano Byoung Chul Cho Emiliano Calvo Dong-Wan Kim Maria Vieito Francois Ghiringelli Victor Moreno Sophie Cousin Luis Paz-Ares Nathalie Fagniez Mustapha Chadjaa Anne-Laure Bauchet Christine Soufflet Nina Masson Fabrice Barlesi Disclosure Dr. Gazzah has received travel, accommodation, and congress registration expenses from Boehringer Ingelheim, Novartis, Pfizer, Roche, and Sanofi; has served in a consultant/expert role for Novartis; has served as principal/subinvestigator of clinical trials for Aduro Biotech, Agios Pharmaceuticals, Amgen, Argenx BVBA, Arno Therapeutics, Astex Pharmaceuticals, AstraZeneca, AVEO, Bayer Healthcare AG, BBB Technologies BV, BeiGene, BioAlliance Pharma, BioNTech AG, Blueprint Medicines, Boehringer Ingelheim, Bristol Myers Squibb, CA, Celgene Corporation, Chugai Pharmaceutical Co., Clovis Oncology, Daiichi Sankyo, Debiopharm S.A., Eisai, Exelixis, Forma, GamaMabs, Genentech, Inc., Gilead Sciences, Inc., GlaxoSmithKline, Glenmark Pharmaceuticals, H3 Biomedicine, Inc., Hoffmann-La Roche AG, Incyte Corporation, Innate Pharma, IRIS Servier, Janssen, Kura Oncology, Kyowa Kirin Pharm, Lilly, Loxo Oncology, Lytix Biopharma AS, MedImmune, Menarini Ricerche, Merck Sharp & Dohme Chibret, Merrimack Pharmaceuticals, Merus, Millennium Pharmaceuticals, Nanobiotix, Nektar Therapeutics, Novartis Pharma, OCTIMET Oncology NV, OncoEthix, OncoMed, Oncopeptides, Onyx Therapeutics, Orion Pharma, Oryzon Genomics, Pfizer, PharmaMar, Pierre Fabre, Rigontec GmbH, Roche, Sanofi Aventis, Sierra Oncology, Taiho Pharmaceutical, Tesaro, Inc., Tioma Therapeutics, Inc., and Xencor; has received research grants from AstraZeneca Bristol Myers Squibb Boehringer Ingelheim 10.13039/100007013 F. Hoffmann-La Roche 10.13039/100004336 Novartis 10.13039/100004326 Bayer 10.13039/100009947 Merck Sharp & Dohme 10.13039/100017239 BeiGene START References 1 Sung H. Ferlay J. Siegel R.L. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 71 2021 209 249 33538338 10.3322/caac.21660 2 Duma N. Santana-Davila R. Molina J.R. Non-small cell lung cancer: epidemiology, screening, diagnosis, and treatment Mayo Clin Proc 94 2019 1623 1640 31378236 10.1016/j.mayocp.2019.01.013 3 Siegel R.L. Miller K.D. Wagle N.S. Jemal A. Cancer statistics, 2023 CA Cancer J Clin 73 2023 17 48 36633525 10.3322/caac.21763 4 Abernethy A.P. Arunachalam A. Burke T. Real-world first-line treatment and overall survival in non-small cell lung cancer without known EGFR ALK PLoS One 12 2017 e0178420 10.1371/journal.pone.0178420 PMC5482433 28644837 5 Nadler E. Espirito J.L. Pavilack M. Boyd M. Vergara-Silva A. Fernandes A. Treatment patterns and clinical outcomes among metastatic non-small-cell lung cancer patients treated in the community practice setting Clin Lung Cancer 19 2018 360 370 29576407 10.1016/j.cllc.2018.02.002 6 Simeone J.C. Nordstrom B.L. Patel K. Klein A.B. Treatment patterns and overall survival in metastatic non-small-cell lung cancer in a real-world, US setting Future Oncol 15 2019 3491 3502 31497994 10.2217/fon-2019-0348 7 Desai A. Abdayem P. Adjei A.A. Planchard D. Antibody-drug conjugates: a promising novel therapeutic approach in lung cancer Lung Cancer 163 2022 96 106 34942494 10.1016/j.lungcan.2021.12.002 8 Hammarström S. The carcinoembryonic antigen (CEA) family: structures, suggested functions and expression in normal and malignant tissues Semin Cancer Biol 9 1999 67 81 10202129 10.1006/scbi.1998.0119 9 Decary S. Berne P.F. Nicolazzi C. Preclinical activity of SAR408701: a novel anti-CEACAM5-maytansinoid antibody-drug conjugate for the treatment of CEACAM5-positive epithelial tumors Clin Cancer Res 26 2020 6589 6599 33046521 10.1158/1078-0432.CCR-19-4051 10 Zhang X. Han X. Zuo P. Zhang X. Xu H. CEACAM5 stimulates the progression of non-small-cell lung cancer by promoting cell proliferation and migration J Int Med Res 48 2020 300060520959478 10.1177/0300060520959478 PMC7536504 32993395 11 Hu R. Huffman K.E. Chu M. Zhang Y. Minna J.D. Yu Y. Quantitative secretomic analysis identifies extracellular protein factors that modulate the metastatic phenotype of non-small cell lung cancer J Proteome Res 15 2016 477 486 26736068 10.1021/acs.jproteome.5b00819 PMC5001500 12 Papadaki M.A. Messaritakis I. Fiste O. Assessment of the efficacy and clinical utility of different circulating tumor cell (CTC) detection assays in patients with chemotherapy-naive advanced or metastatic non-small cell lung cancer (NSCLC) Int J Mol Sci 22 2021 925 33477700 10.3390/ijms22020925 PMC7831933 13 Lung Cancer Cohort Consortium (LC3) The blood proteome of imminent lung cancer diagnosis Nat Commun 14 2023 3042 37264016 10.1038/s41467-023-37979-8 PMC10235023 14 Pouzin C. Gibiansky L. Fagniez N. Chadjaa M. Tod M. Nguyen L. Integrated multiple analytes and semi-mechanistic population pharmacokinetic model of tusamitamab ravtansine, a DM4 anti-CEACAM5 antibody-drug conjugate J Pharmacokinet Pharmacodyn 49 2022 381 394 35166967 10.1007/s10928-021-09799-0 PMC9098589 15 Remillard S. Rebhun L.I. Howie G.A. Kupchan S.M. Antimitotic activity of the potent tumor inhibitor maytansine Science 189 1975 1002 1005 1241159 10.1126/science.1241159 16 Erickson H.K. Widdison W.C. Mayo M.F. Tumor delivery and in vivo processing of disulfide-linked and thioether-linked antibody-maytansinoid conjugates Bioconjug Chem 21 2010 84 92 19891424 10.1021/bc900315y 17 Gazzah A. Bedard P.L. Hierro C. Safety, pharmacokinetics, and antitumor activity of the anti-CEACAM5-DM4 antibody-drug conjugate tusamitamab ravtansine (SAR408701) in patients with advanced solid tumors: first-in-human dose-escalation study Ann Oncol 33 2022 416 425 35026412 10.1016/j.annonc.2021.12.012 18 Tabernero J. Bedard P.L. Bang Y.J. Tusamitamab ravtansine in patients with advanced solid tumors: phase I study of safety, pharmacokinetics, and antitumor activity using alternative dosing regimens Cancer Res Commun 3 2023 1662 1671 37645622 10.1158/2767-9764.CRC-23-0284 PMC10461573 19 Eisenhauer E.A. Therasse P. Bogaerts J. New response evaluation criteria in solid tumours: revised RECIST guideline (version 1.1) Eur J Cancer 45 2009 228 247 19097774 10.1016/j.ejca.2008.10.026 20 Ferté C. Fernandez M. Hollebecque A. Tumor growth rate is an early indicator of antitumor drug activity in phase I clinical trials Clin Cancer Res 20 2014 246 252 24240109 10.1158/1078-0432.CCR-13-2098 PMC3947306 21 Pouzin C. Tod M. Chadjaa M. Fagniez N. Nguyen L. Covariate analysis of tusamitamab ravtansine, a DM4 anti-CEACAM5 antibody-drug conjugate, based on first-in-human study CPT Pharmacometrics Syst Pharmacol 11 2022 384 394 35191618 10.1002/psp4.12769 PMC8923727 22 Gazzah A. Tabernero J. Italiano A. Phase 1/2 study of tusamitamab ravtansine in patients with advanced solid tumors: pooled safety analysis of corneal adverse events JCO 41 2023 e15003 23 Donaghy H. Effects of antibody, drug and linker on the preclinical and clinical toxicities of antibody-drug conjugates mAbs 8 2016 659 671 27045800 10.1080/19420862.2016.1156829 PMC4966843 24 Mahalingaiah P.K. Ciurlionis R. Durbin K.R. Potential mechanisms of target-independent uptake and toxicity of antibody-drug conjugates Pharmacol Ther 200 2019 110 125 31028836 10.1016/j.pharmthera.2019.04.008 25 Zhao H. Atkinson J. Gulesserian S. Modulation of macropinocytosis-mediated internalization decreases ocular toxicity of antibody-drug conjugates Cancer Res 78 2018 2115 2126 29382707 10.1158/0008-5472.CAN-17-3202 26 Lefebvre A.M. Adam J. Nicolazzi C. The search for therapeutic targets in lung cancer: preclinical and human studies of carcinoembryonic antigen-related cell adhesion molecule 5 expression and its associated molecular landscape Lung Cancer 184 2023 107356 10.1016/j.lungcan.2023.107356 37660479 27 Milano G. Innocenti F. Lacarelle B. Ciccolini J. “No pain, no gain” still true with immunotherapy: when the finger shows the moon, look at the moon Crit Rev Oncol Hematol 127 2018 1 5 29891106 10.1016/j.critrevonc.2018.04.003 Supplementary Data  Supplementary Material Acknowledgments Additional analyses and critical review of this manuscript were provided by Dr. Jon Zugazagoitia, 12 de Octubre Hospital, Madrid, Spain. Medical writing assistance was provided by Blair Jarvis, MSc, and Elizabeth Strickland, PhD, of inScience Communications (Philadelphia, PA) in accordance with current Good Publication Practice guidelines and funded by 10.13039/100004339 Sanofi This work was supported by Sanofi. Cite this article as: Gazzah A, Ricordel C, Italiano A, et al. Evaluation of the safety, pharmacokinetics, and antitumor activity of tusamitamab ravtansine in patients with nonsquamous NSCLC with high or moderate expression of carcinoembryonic antigen-related cell adhesion molecule 5. JTO Clin Res Rep Note: To access the supplementary material accompanying this article, visit the online version of the JTO Clinical and Research Reports www.jtocrr.org https://doi.org/10.1016/j.jtocrr.2025.100844 ",
  "metadata": {
    "Title of this paper": "“No pain, no gain” still true with immunotherapy: when the finger shows the moon, look at the moon",
    "Journal it was published in:": "JTO Clinical and Research Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478256/"
  }
}