{
  "title": "Paper_669",
  "abstract": "pmc J Nutr Health Aging J Nutr Health Aging 4760 jnha The Journal of Nutrition, Health & Aging 1279-7707 1760-4788 Elsevier PMC12481054 PMC12481054.1 12481054 12481054 40974696 10.1016/j.jnha.2025.100685 S1279-7707(25)00210-6 100685 1 Original Article Applicability and predictive validity of the global leadership initiative on malnutrition criteria for older patients with sepsis according to different muscle mass assessment methods Shang Na shn369@126.com a Li Qiujing jinggreat@126.com b Zhou Haijing odyssey0808@sina.cn a Zhang Xiangqun 13671180605@163.com a Guo Shubin shubin007@yeah.net a * Mei Xue meixue91@yeah.net a * a b ⁎ shubin007@yeah.net meixue91@yeah.net 11 2025 19 9 2025 29 11 496278 100685 14 5 2025 11 9 2025 11 9 2025 19 09 2025 01 10 2025 01 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Objectives To evaluate the applicability of the Global Leadership Initiative on Malnutrition (GLIM) criteria in older patients with sepsis and to compare the predictive validity for 28-day mortality of different muscle mass assessment methods in the emergency department. Design Prospective cohort study. Setting Emergency department. Patients Older patients (≥65 years) with sepsis. Measurements Muscle mass was assessed using three methods: (1) the skeletal muscle index at the third lumbar vertebra (L3) on computed tomography (CT) scans; (2) calf circumference (CC), and (3) mid-upper-arm circumference (MAC). Cox regression analysis was performed to assess the association between the GLIM criteria and 28-day all-cause mortality. Additionally, the C-statistic, net reclassification improvement (NRI), and integrated discrimination improvement (IDI) were used to evaluate the predictive validity of the three instruments. Survival curves were assessed using the Kaplan–Meier method and compared using the log-rank test. Results A total of 598 patients with sepsis were included. The prevalence of malnutrition according to GLIM-CT, GLIM-CC, and GLIM-MAC was 53.3%, 63.0%, and 40.8%, respectively. Cox regression analysis revealed that the GLIM criteria were independent risk factors for all-cause 28-day mortality. Incorporation of GLIM-CT, GLIM-CC, or GLIM-MAC into a base model significantly improved the C-statistic. The model including GLIM-CT had the highest C-statistic, improving the C-statistic of the base model from 0.780 (95% confidence interval [CI]: 0.741−0.819) to 0.823 (95% CI: 0.789−0.857). This improvement in risk prediction was also confirmed via category-free NRI and IDI, suggesting that GLIM-CT had the best performance. Kaplan–Meier survival analysis showed that patients with malnutrition defined according to the GLIM criteria had a greater probability of 28-day mortality (log-rank, P Conclusion Malnutrition, defined via any of the three methods, was predictive of 28-day mortality among older patients with sepsis in the emergency department. GLIM-CT had the best predictive validity. Keywords Malnutrition Global leadership initiative on malnutrition Sepsis Older adults pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction According to Sepsis-3.0 criteria, sepsis is defined as a life-threatening organ dysfunction caused by a dysregulated host response to infection [ 1 2 3 4 5 Among the abovementioned risk factors, malnutrition is a major health problem worldwide, especially in older adults [ 6 7 [8] [9] [10] 1 Table 1 11 Table 1 Phenotypic and etiologic criteria for the diagnosis of malnutrition within this study. Table 1 Phenotypic criteria Etiologic criteria Weight loss Low BMI(kg/m 2 Reduced muscle mass Reduced food intake or assimilation Disease burden/inflammation >5% within past 6 months, or >10% beyond 6 months <18.5 if <70 years, or <20 if >70 years L3 SMI: <28.6 cm 2 2 ≤50% of the intake with respect to the usual in the last week or any reduction >2 weeks or the presence of diseases that alter the absorption of food All patients with sepsis based on acute disease Abbreviations: L3 SMI, skeletal mass index of the third lumbar vertebra; CC, calf circumference; MAC, mid-upper arm circumference. Although reduced muscle mass is one of the GLIM phenotypic criteria, no unified standard exists for its measurement and definition in clinical practice. The GLIM recommends use of the fat-free mass index, measured using dual-energy absorptiometry (DXA), bioelectrical impedance analysis (BIA), computed tomography (CT), or magnetic resonance imaging (MRI). When these tools are unavailable, standard anthropometric measures such as the mid-upper-arm circumference (MAC) or calf circumference (CC) can also be used. Functional assessments such as hand-grip strength (HGS) may serve as supportive proxies. Each assessment tool has limitations and advantages, and whether these tools accurate reflect reduced muscle mass and can be used to further evaluate malnutrition status is unclear, especially for older patients with sepsis in emergency settings. Therefore, the purpose of this study was to explore the application of malnutrition, as defined by the GLIM criteria, according to different muscle mass measurement tools among older patients with sepsis in the emergency department, and to compare their predictive validity for 28-day mortality. 2 Material and methods 2.1 Population This prospective, observational cohort study was conducted in a tertiary-care, university-affiliated hospital in Beijing. Consecutive patients aged ≥65 years who were admitted to the emergency department from January 2022 to November 2022 were eligible for this study. During the study period, only patients without coronavirus disease 2019 were admitted to our hospital, whereas those who tested positive were transferred to government-designated hospitals. This study was approved by the institutional review board of Beijing Chao-Yang Hospital affiliated to Capital Medical University (approval number: 2022-ke-430, August 1, 2022) and conducted in accordance with the amended Declaration of Helsinki. This study was registered at www.chictr.org.cn The inclusion criteria were as follows: ( The exclusion criteria were as follows: (1) discharged or transferred within 24 h of admission; (2) pre-existing or acute peripheral neuromuscular diseases; (3) CT imaging data that did not meet the quality checks; (4) incomplete clinical information; (5) radiotherapy and chemotherapy administered for tumors; (6) cachexia; (7) severe edema of the lower limbs. 2.2 GLIM diagnostic scheme of malnutrition 2.2.1 Risk Screening for malnutrition using Nutritional Risk Screening 2002 The first step in the assessment of malnutrition was risk screening to identify those who were at risk of malnutrition by using the Nutritional Risk Screening 2002 (NRS2002). Patients with a score ≥3 were deemed to have a high risk of malnutrition [ 12 2.2.2 Diagnostic assessment criteria of malnutrition 2.2.2.1 Phenotypic criteria Weight loss (%): Involuntary weight loss was defined as >5% weight loss within the past 6 months or >10% weight loss over a longer period. Low BMI (kg/m 2 2 2 11 Reduced muscle mass: Recommendations for measurement methods for muscle mass include DXA, BIA, CT, and MRI. When these techniques are not available, anthropometric measures, such as the MAC or CC may be used. In this study, we applied the following three methods to evaluate muscle loss and the standard operating procedures were as follows. 1) CT: Plain abdominal CT scans were performed within 24 h of admission, and images retrieved from the institutional picture archiving and communication system were analyzed using AW Volume Share 7 (GE HealthCare, Chicago, IL, USA). The built-in CT histogram software “X Section” on the workstation was used to manually delineate regions of interest at the midpoint of the L3 region, and the skeletal mass area (SMA) was automatically calculated by the software. The CT threshold for the L3 SMA was set to −29 to 150 Hounsfield units [ 13 2 2 14 2 2 15 2) CC: With the patient in the supine position with their feet spread shoulder-width apart, non-elastic tape was used to measure the maximum circumference of both calves. We used BMI-adjusted CC values for patients outside the normal BMI range (18–24.9 kg/m 2 2 2 2 16 17 3) MAC: Patients were asked to raise their arms to shoulder level, with the elbow bent 90 °. In this position, patients were asked to flex their biceps, and the maximum circumference of the biceps was measured. The average of two measurements was calculated and used for analyses. The GLIM-MAC threshold was <21 cm, as recommended in previous studies [ 18 19 2.2.2.2 Etiologic criteria As all patients in this study had sepsis, all met this criterion because they were diagnosed with acute disease. 2.2.3 Diagnosis of malnutrition according to GLIM criteria Weight loss, low BMI, and reduced muscle mass are classified as phenotypic criteria, while reduced food intake/assimilation and disease burden/inflammatory response are categorized as etiologic criteria ( Table 1 Table 1 2.3 Study protocol Patient characteristics, including age, gender, BMI, chronic diseases (such as hypertension, diabetes mellitus, coronary artery disease, cerebrovascular disease, chronic kidney disease, and chronic pulmonary disease), sites of infection (e.g., the lungs, abdomen, and urinary tract), and laboratory indicators were collected upon admission. The Charlson Comorbidity Index (CCI) was calculated for the chronic disease burden, and the SOFA score was calculated to assess disease severity. All data were collected within 24 h of admission. 2.4 Outcome measures The outcome measure was 28-day all-cause mortality, which was ascertained from the patients’ electronic medical records or via telephonic follow-up. 2.5 Statistical analysis Descriptive statistics are reported as the mean (standard deviation) for normally distributed variables, median (lower quartile [Q L U P P 2.6 Sample size Sample size calculation has not been explicitly conducted before initiating this study. Nevertheless, previous studies have reported a close association between malnutrition and mortality. Among critically ill patients, the mortality rate in the malnourished group ranges from 37.8% to 65%, while that in the non-malnourished group ranges from 10.6% to 28% [ 20 21 22 n = Z 1 - α / 2 2 p ( 1 - p ) + Z 1 - β p 1 1 - p 1 + p 2 ( 1 - p 2 ) 2 ( p 1 - p 2 ) 2 Notes: n represents the required sample size per group, p 1 2 3 Results 3.1 Baseline characteristics In this study, 598 older participants were included, of whom 329 (55.0%) were men. The median (interquartile range) age was 76.0 (16.0) years, and the BMI was 23.0 (5.1) kg/m 2 Table 2 P Table 2 Baseline characteristics of participants (N = 598). Table 2 Parameter Total (n = 598) GLIM-CT (n = 319) GLIM-CC (n = 377) GLIM-MAC (n = 244) General characteristics Age, year, median (Q L U 76 (69, 85) 80 (72, 86) 80 (72, 86) 79 (72, 85) Male, n (%) 329 (55.2) 173 (49.9) 174 (50.1) 174 (50.1) BMI, kg/m 2 23.0 (5.1) 21.5 (4.5) 22.0 (5.0) 24.2 (4.2) Commodities (n,%) Hypertension (n,%) 332 (55.5) 177 (55.5) 215 (57.0) 128 (52.5) Diabetes mellitus (n,%) 220 (36.8) 108 (33.9) 131 (34.7) 78 (32.0) Coronary artery disease (n,%) 188 (31.4) 94 (29.5) 117 (31.0) 78 (32.0) Chronic kidney disease (n,%) 101 (16.9) 54 (16.9) 64 (17.0) 37 (15.2) Cerebrovascular disease (n,%) 171 (28.6) 103 (32.3) 121 (32.1) 79 (32.4) Chronic pulmonary disease (n,%) 68 (11.4) 39 (12.2) 49 (13.0) 30 (12.3) Sites of Infection, n (%) Lung 251 (42.0) 158 (49.5) 183 (48.5) 121 (49.6) Intra-abdominal infection 235 (39.3) 107 (33.5) 126 (33.4) 85 (34.8) Urinary infection 100 (16.7) 46 (14.4) 60 (15.9) 32 (13.1) Others 12 (2.0) 8 (2.5) 8 (2.1) 6 (2.5) Laboratory indicators White blood cell, ×10 9 L U 10.5 (7.2, 14.6) 10.6 (7.4, 15.4) 10.7 (7.5, 14.6) 10.2 (7.3, 15.3) Hemoglobin, g/L, median (Q L U 11 7 (97, 136) 116 (93, 134) 116 (93, 135) 114 (91, 132) Platelet, ×10 9 L U 189 (137, 252) 206 (140, 272) 196 (138, 265) 201 (141, 275) Serum albumin, g/dl (Q L U 36.0 (31.3, 40.5) 34.7 (30.7, 38.5) 35.0 (30.9, 39.4) 34.3 (30.7, 38.5) Scores CCI, median (Q L U 5 (4, 7) 6 (4, 6) 6 (5, 7) 6 (5, 7) SOFA, median (Q L U 4 (2, 7) 5 (3, 7) 5 (3, 7) 5 (3, 7) Abbreviations: Q L U 3.2 Predictive validity of GLIM criteria During follow-up, the 28-day all-cause mortality rate was 30.3% (181 patients died). Univariable Cox regression analysis showed that malnutrition defined according to the three different instruments for muscle mass assessment (GLIM-CT, GLIM-CC, and GLIM-MAC) was independently associated with 28-day mortality (Hazrd Ratio, HR = 4.917, 2.908, and 2.670 respectively; P P P P Table 3 Fig. 1 Table 3 Three approaches of GLIM criteria and its association with 28-day all-cause mortality. Table 3 Model 1 Model 2 HR 95% CI P HR 95% CI P GLIM-CT 4.917 3.384–7.143 <0.001 4.439 3.053–6.454 <0.001 GLIM-CC 2.908 2.002–4.223 <0.001 1.956 1.326–2.885 0.001 GLIM-MAC 2.670 1.982–3.598 <0.001 2.288 1.692–3.093 <0.001 Model 1, unadjusted model; Model 2, adjusted for age, gender, hemoglobin, albumin, CCI and SOFA. Abbreviations: HR, hazard ratio; CI, confidence interval. Fig. 1 Kaplan–Meier survival curves of malnutrition defined by GLIM criteria. Fig. 1 3.3 Comparison of the three muscle mass assessment methods A base model including age, gender, hemoglobin level, albumin concentration, CCI, and SOFA score was constructed, and the C-statistic for the prediction of 28-day mortality was 0.780 (95% CI: 0.741−0.819). Incorporation of GLIM-CT, GLIM-CC, or GLIM-MAC into the base model significantly improved the C-statistic to 0.823 (95% CI: 0.789−0.857), 0.802 (95% CI: 0.765−0.839), and 0.801 (95% CI: 0.764−0.838), respectively (all P Table 4 P P Table 4 Validity of three models of GLIM criteria for 28-day all-cause mortality. Table 4 C-statistic(95%CI) P NRI(95%CI) P IDI(95%CI) P Base Model 0.780 (0.741–0.819) – – – – – Base Model + GLIM-CT 0.823 (0.789–0.857) <0.001 −0.071 (−0.094, −0.049) <0.001 −0.799 (−0.947, −0.651) <0.001 Base Model + GLIM-CC 0.802 (0.765–0.839) <0.001 −0.023 (−0.036, −0.010) <0.001 −0.510 (−0.660, −0.361) <0.001 Base Model + GLIM-MAC 0.801 (0.764–0.838) <0.001 −0.033 (−0.049, −0.017) <0.001 −0.557 (−0.723, −0.388) <0.001 GLIM-CT - GLIM-CC 0.021 (0.001, 0.040) 0.036 −0.049 (−0.066, −0.031) <0.001 −0.788 (−0.937, −0.640) <0.001 GLIM-CT - GLIM-MAC 0.021 (0.001, 0.042) 0.042 −0.039 (−0.056, −0.021) <0.001 −0.518 (−0.687, −0.348) <0.001 GLIM-CC - GLIM-MAC 0.001 (−0.017, 0.018) 0.950 0.010 (−0.005, 0.025) 0.189 −0.030 (−0.179, 0.118) 0.076 Base Model included: age, gender, hemoglobin, albumin, CCI and SOFA. Abbreviations: NRI, net reclassification improvement; IDI, integrated discrimination improvement; CI, confidence interval. For pairwise comparisons between the instruments, the C-statistic of the model including GLIM-CT was higher than those including GLIM-CC and GLIM-MAC ( P P P P P P P Taken together, the addition of any of the three instruments into the base Cox regression model significantly improved its predictive ability for 28-day mortality in older patients with sepsis in the emergency department; the model including GLIM-CT had the highest C-statistic, and its predictive validity was further confirmed via category-free NRI and IDI. 4 Discussion In the fast-paced emergency department, the identification of malnutrition is crucial yet challenging. In this study, we used three types of muscle mass assessment methods (CT, CC, and MAC) to diagnose malnutrition in older patients with sepsis in an emergency department, according to the GLIM criteria. Malnutrition diagnosed according to each of these methods was independently associated with an adverse clinical outcome. Additionally, a comparison of the predictive validity of the three methods demonstrated that GLIM-CT had the strongest predictive ability for all-cause 28-day mortality. To the best of our knowledge, this is the first study in which the applicability and validity of malnutrition as defined according to the GLIM criteria was explored among older patients in acute care settings in China. Previous studies have revealed a wide range of prevalence of malnutrition (12%–87%), depending on the heterogeneity of the study population, diagnostic criteria, and clinical setting [ 23 24 11 17 P 25 Muscle mass assessment is an essential component of the GLIM criteria, and previous studies have indicated that it enhances the overall performance of the GLIM criteria [ 26 27 24 28 17 29 30 31 19 32 Our study has certain limitations. First, it was a single-center study conducted in the emergency department, and only older patients with sepsis who underwent abdominal CT were included, which might have led to selection bias and must be considered when our results are interpreted. Second, patients with geriatric syndromes, such as frailty, polypharmacy, and dysphagia, were not included in the analysis, all of which may affect nutritional status and clinical outcomes. Third, as we did not incorporate the GLIM thresholds for muscle mass reduction as measured via DXA or BIA recommended in GLIM criteria, we were unable to estimate the accuracy of the three methods used in this study for the assessment of malnutrition. Meanwhile, we did not measure the concurrent validity of the GLIM criteria with other nutritional assessments, such as the subjective global assessment. Finally, the severity of malnutrition was not assessed because no cutoffs for the stratification of moderate or severe reductions in muscle mass have been identified. Therefore, large-scale, multi-center studies are needed to determine cut-offs for different techniques and validate different assessment tools in clinical settings. 5 Conclusion Malnutrition, defined via any of the three GLIM-related measurement methods, was prevalent among older patients with sepsis in the emergency department and was associated with 28-day mortality. GLIM-CT, using L3 SMI for the assessment of muscle mass reduction, had the best predictive validity. This study provides novel evidence for the application and validity of the GLIM criteria by emergency physicians among older patients with sepsis. Furthermore, it may be of use for risk stratification, clinical decision-making, and evidence-based allocation of resources in clinical practice. CRediT authorship contribution statement Na Shang was responsible for proposing the study protocol and data organization, as well as completing the drafting of the article. Qiujing Li participated in data analysis and the revision of the paper. Haijiang Zhou and Xiangqun Zhang were in charge of providing resource support and verifying the research results. Guo Shubin and Mei Xue contributed to the proofreading, reviewing, and providing academic guidance. Ethics approval and consent to participate This study was approved by the institutional review board of Beijing Chao-Yang Hospital affiliated to Capital Medical University (approval number: 2022-ke-430, August 1, 2022) and conducted in accordance with the amended Declaration of Helsinki. This study was registered at www.chictr.org.cn Declaration of Generative AI and AI-assisted technologies in the writing process I have not used any AI at all. Funding This work was supported by the Capital’s Funds for Health Improvement and Research 2024-2-2034 Availability of data and materials The data that support the findings of this study are available from the corresponding author upon reasonable request. Declaration of competing interest No potential conflicts of interest related to this article are reported. References 1 Singer M. Deutschman C.S. Seymour C.W. Shankar-Hari M. Annane D. Bauer M. The third international consensus definitions for sepsis and septic shock (Sepsis-3) Jama 315 8 2016 801 810 10.1001/jama.2016.0287 26903338 PMC4968574 2 Long B. Gottlieb M. Emergency medicine updates: management of sepsis and septic shock Am J Emerg Med 90 2025 179 191 10.1016/j.ajem.2025.01.054 39904062 3 Rowe T.A. McKoy J.M. Sepsis in older adults Infect Dis Clin North Am 31 4 2017 731 742 10.1016/j.idc.2017.07.010 29079157 4 Sivayoham N. Blake L.A. Tharimoopantavida S.E. Chughtai S. Hussain A.N. Rhodes A. Treatment variables associated with outcome in emergency department patients with suspected sepsis Ann Intensive Care 10 1 2020 136 10.1186/s13613-020-00747-8 33052499 PMC7560670 5 Ibarz M. Haas L.E.M. Ceccato A. Artigas A. The critically ill older patient with sepsis: a narrative review Ann Intensive Care 14 1 2024 6 10.1186/s13613-023-01233-7 38200360 PMC10781658 6 Crichton M. Craven D. Mackay H. Marx W. de van der Schueren M. Marshall S. A systematic review, meta-analysis and meta-regression of the prevalence of protein-energy malnutrition: associations with geographical region and sex Age Ageing 48 1 2019 38 48 10.1093/ageing/afy144 30188972 7 Leij-Halfwerk S. Verwijs M.H. van Houdt S. Borkent J.W. Guaitoli P.R. Pelgrim T. Prevalence of protein-energy malnutrition risk in European older adults in community, residential and hospital settings, according to 22 malnutrition screening tools validated for use in adults ≥65 years: a systematic review and meta-analysis Maturitas 126 2019 80 89 10.1016/j.maturitas.2019.05.006 31239123 8 Daud M. Ullah F. Uzair M. Siddiq A. Siddiq U. Riaz F.B. Malnutrition and Its Influence on Sepsis Outcomes in Elderly Patients Cureus 16 6 2024 e63433 10.7759/cureus.63433 PMC11284507 39077281 9 Bellanti F. Lo Buglio A. Quiete S. Vendemiale G. Malnutrition in Hospitalized Old Patients: Screening and Diagnosis, Clinical Outcomes, and Management Nutrients 14 4 2022 10.3390/nu14040910 PMC8880030 35215559 10 Norman K. Haß U. Pirlich M. Malnutrition in older adults-recent advances and remaining challenges Nutrients 13 8 2021 10.3390/nu13082764 PMC8399049 34444924 11 Cederholm T. Jensen G.L. Correia M. Gonzalez M.C. Fukushima R. Higashiguchi T. GLIM criteria for the diagnosis of malnutrition - A consensus report from the global clinical nutrition community Clin Nutr 38 1 2019 1 9 10.1016/j.clnu.2018.08.002 30181091 12 Kondrup J. Rasmussen H.H. Hamberg O. Stanga Z. Nutritional risk screening (NRS 2002): a new method based on an analysis of controlled clinical trials Clin Nutr 22 3 2003 321 336 10.1016/s0261-5614(02)00214-5 12765673 13 Mourtzakis M. Prado C.M. Lieffers J.R. Reiman T. McCargar L.J. Baracos V.E. A practical and precise approach to quantification of body composition in cancer patients using computed tomography images acquired during routine care Appl Physiol Nutr Metab 33 5 2008 997 1006 10.1139/h08-075 18923576 14 Prado C.M. Lieffers J.R. McCargar L.J. Reiman T. Sawyer M.B. Martin L. Prevalence and clinical implications of sarcopenic obesity in patients with solid tumours of the respiratory and gastrointestinal tracts: a population-based study Lancet Oncol 9 7 2008 629 635 10.1016/s1470-2045(08)70153-0 18539529 15 Kong M. Geng N. Zhou Y. Lin N. Song W. Xu M. Defining reference values for low skeletal muscle index at the L3 vertebra level based on computed tomography in healthy adults: a multicentre study Clin Nutr 41 2 2022 396 404 10.1016/j.clnu.2021.12.003 34999334 16 Gonzalez M.C. Mehrnezhad A. Razaviarab N. Barbosa-Silva T.G. Heymsfield S.B. Calf circumference: cutoff values from the NHANES 1999-2006 Am J Clin Nutr 113 6 2021 1679 1687 10.1093/ajcn/nqab029 33742191 PMC8433492 17 Compher C. Cederholm T. Correia M. Gonzalez M.C. Higashiguch T. Shi H.P. Guidance for assessment of the muscle mass phenotypic criterion for the Global Leadership Initiative on Malnutrition diagnosis of Malnutrition JPEN J Parenter Enteral Nutr 46 6 2022 1232 1242 10.1002/jpen.2366 35437785 18 Ito R. Hiraiwa H. Araki T. Mizutani T. Kazama S. Kimura Y. Prognostic value of Malnutrition evaluated using the Global Leadership Initiative on Malnutrition criteria and its association with psoas muscle volume in non-ischemic dilated cardiomyopathy Heart Vessels 37 12 2022 2002 2012 10.1007/s00380-022-02113-z 35699761 19 Hu Y. Zhang C. Zou C. Yang H. Chen Y. Liang T. Anthropometric measures and physical examination could be used to assess phenotypic GLIM (Global leadership initiative on malnutrition) criteria in heart failure patients Nutr Metab Cardiovasc Dis 33 12 2023 2419 2427 10.1016/j.numecd.2023.07.034 37788948 20 Díaz G. Correia M.I.T.D. Gonzalez M.C. Reyes M. The global leadership initiative on malnutrition criteria for the diagnosis of malnutrition in patients admitted to the intensive care unit: a systematic review and meta-analysis Clin Nutr. 42 2 2023 182 189 10.1016/j.clnu.2022.12.007 36599273 21 Lew C.C.H. Yandell R. Fraser R.J.L. Chua A.P. Chong M.F.F. Miller M. Association between malnutrition and clinical outcomes in the intensive care unit: a systematic review [Formula: see text] JPEN J Parenter Enteral Nutr. 41 5 2017 744 758 10.1177/0148607115625638 26838530 22 Sahai H. Khurshid A. Formulae and tables for the determination of sample sizes and power in clinical trials for testing differences in proportions for the two-sample design: a review Stat Med. 15 1 1996 1 21 10.1002/(SICI)1097-0258(19960115)15:1&#x0003c;1::AID-SIM134&#x0003e;3.0.CO;2-E 8614740 23 Fontane L. Reig M.H. Garcia-Ribera S. Herranz M. Miracle M. Chillaron J.J. Validity and applicability of the Global Leadership Initiative on Malnutrition (GLIM) criteria in patients hospitalized for acute medical conditions Nutrients 15 18 2023 10.3390/nu15184012 PMC10535463 37764796 24 Narayan S.K. Gudivada K.K. Krishna B. Assessment of nutritional status in the critically ill Indian J Crit Care Med 24 Suppl 4 2020 S152 s156 10.5005/jp-journals-10071-23617 33354033 PMC7724950 25 Ji T. Li Y. Liu P. Zhang Y. Song Y. Ma L. Validation of GLIM criteria on malnutrition in older Chinese inpatients Front Nutr 9 2022 969666 10.3389/fnut.2022.969666 PMC9521176 36185642 26 Wang Y. Chen X. Wang Y. Liu Z. Fang Y. Peng Z. Body Composition Measurement Improved Performance of GLIM Criteria in Diagnosing Malnutrition Compared to PG-SGA in Ambulatory Cancer Patients: a prospective cross-sectional study Nutrients 13 8 2021 10.3390/nu13082744 PMC8400685 34444902 27 Kiss N. Steer B. de van der Schueren M. Loeliger J. Alizadehsani R. Edbrooke L. Machine learning models to predict outcomes at 30-days using Global Leadership Initiative on Malnutrition combinations with and without muscle mass in people with cancer J Cachexia Sarcopenia Muscle 14 4 2023 1815 1823 10.1002/jcsm.13259 37259678 PMC10401541 28 Díaz G. Correia M.I.T.D. Gonzalez M.C. Reyes M. The global leadership initiative on malnutrition criteria for the diagnosis of malnutrition in patients admitted to the intensive care unit: A systematic review and meta-analysis Clin Nutr 42 2 2023 182 189 10.1016/j.clnu.2022.12.007 36599273 29 Gonzalez M.C. Barbosa-Silva T.G. Heymsfield S.B. Bioelectrical impedance analysis in the assessment of sarcopenia Curr Opin Clin Nutr Metab Care 21 5 2018 366 374 10.1097/mco.0000000000000496 29957677 30 Walowski C.O. Braun W. Maisch M.J. Jensen B. Peine S. Norman K. Reference Values for Skeletal Muscle Mass - Current Concepts and Methodological Considerations Nutrients 12 3 2020 10.3390/nu12030755 PMC7146130 32178373 31 Beaudart C. McCloskey E. Bruyère O. Cesari M. Rolland Y. Rizzoli R. Sarcopenia in daily practice: assessment and management BMC Geriatr 16 1 2016 170 10.1186/s12877-016-0349-4 27716195 PMC5052976 32 Beretta M.V. Rodrigues T.D.C. Steemburgo T. Validity of the Global Leadership Initiative on Malnutrition criteria using calf circumference in the prediction of in-hospital mortality in older surgical patients: a secondary analysis of A cohort study JPEN J Parenter Enteral Nutr 47 6 2023 773 782 10.1002/jpen.2526 37246959 Acknowledgments None. 1 BIA, bioelectrical impedance analysis; BMI, body mass index; CC, calf circumference; CCI, Charlson Comorbidity Index; CI, confidence interval; CT, computed tomography; DXA, dual-energy absorptiometry; ESPEN, European Society for Parenteral and Enteral Nutrition; GLIM, Global Leadership Initiative on Malnutrition; HGS, hand-grip strength; HR, hazard ratio; IDI, integrated discrimination improvement; L3, third lumbar vertebra; MAC, mid-upper-arm circumference MRI, magnetic resonance imaging; NRI, net reclassification improvement; SMA, skeletal mass area; SMI, skeletal mass index; SOFA, sequential organ failure assessment ",
  "metadata": {
    "Title of this paper": "Validity of the Global Leadership Initiative on Malnutrition criteria using calf circumference in the prediction of in-hospital mortality in older surgical patients: a secondary analysis of A cohort study",
    "Journal it was published in:": "The Journal of Nutrition, Health & Aging",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481054/"
  }
}