{
  "title": "Paper_976",
  "abstract": "pmc World J Stem Cells 1470 wjsc WJSC World Journal of Stem Cells 1948-0210 Baishideng Publishing Group Inc PMC12476803 PMC12476803.1 12476803 12476803 41025103 10.4252/wjsc.v17.i9.106282 jWJSC.v17.i9.eid106282 1 Basic Study Bone marrow mesenchymal stem cell-derived exosomal lactate dehydrogenase A promotes tendon-bone healing via Zhang T et al Zhang Ting Department of Orthopedics, The Affiliated Lihuili Hospital of Ningbo University, Ningbo 315211, Zhejiang Province, China Huang Qing Department of Gynaecology, The Affiliated Lihuili Hospital of Ningbo University, Ningbo 315211, Zhejiang Province, China Gan Kai-Feng Department of Orthopedics, The Affiliated Lihuili Hospital of Ningbo University, Ningbo 315211, Zhejiang Province, China. gankaifeng@163.com Author contributions: Zhang T designed the study; Huang Q conduced the experiments; Gan KF wrote the manuscript. Corresponding author: Kai-Feng Gan, Department of Orthopedics, The Affiliated Lihuili Hospital of Ningbo University, No. 57 Xingning Road, Ningbo 315211, Zhejiang Province, China. gankaifeng@163.com 26 9 2025 26 9 2025 17 9 497739 106282 26 2 2025 27 3 2025 5 9 2025 26 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ BACKGROUND Anterior cruciate ligament reconstruction (ACLR) is the dominant clinical modality for the treatment of anterior cruciate ligament injuries. The success of ACLR is largely dependent on tendon-bone healing, and stem cell biotherapies are often used to facilitate this process. Histone lactylation modifications are involved in the regulation of various diseases. Lactate dehydrogenase A (LDHA) has been shown to play an important role in exosomes. AIM To explore the regulation of tendon-bone healing after ACLR by LDHA in exosomes derived from bone marrow mesenchymal stem cells (BMSC-Exos). METHODS BMSC-Exos and LDHA were characterized and analyzed by transmission electron microscopy, qNano, immunofluorescence and western blotting assay. The corresponding low expression cell lines were obtained using RNA interference transfection; LDHA expression in rat bone tissues after ACLR was analyzed by western blotting. The volume of newborn bone tissues was monitored by micro-computed tomography imaging. Tendon and fibrocartilage regeneration were further analyzed and calculated by histological analysis, including hematoxylin and eosin and Safranin O-Fast green staining, respectively; LDHA levels of chondrocyte stem cells (CSPCs) after co-incubation with BMSC-Exos were analyzed by western blotting. Extracellularly secreted lactic acid content was determined by lactate assay kit. Cell viability was assessed by cell counting kit 8 assay, and the proliferation and differentiation ability of cells was further examined by the expression of collagen II, SOX9 and aggrecan. Histone H3K18 lactylation modification was analyzed by western blotting. H3K18 La binding on bone morphogenetic protein 7 (BMP7) promoter was analyzed by chromatin immunoprecipitation-quantitative polymerase chain reaction; BMP7 promoter activity was analyzed by dual luciferase reporter gene; BMP7 protein expression was analyzed using quantitative polymerase chain reaction and western blotting. Then, the proliferation of CSPCs promoted by BMSC-Exos LDHA was analyzed by protein expression levels of LDHA, BMP7, collagen II, SOX9, aggrecan, extracellular lactate content, and cell counting kit 8 assay. RESULTS The spherical nanosized BMSC-Exos could be uptaken by CSPCs. LDHA was highly expressed in BMSC-Exos, which could infiltrate into the bone tissue of ACLR rats and promoted the generation of new bone tissue, as well as significantly increased the regeneration of tendon and fibrocartilage. Co-incubation of CSPCs with high-expressing LDHA BMSC-Exos increased the secretion of lactate content from CSPCs, cell viability, and the expression of markers related to cell proliferation and differentiation, including collagen II, SOX9, and aggrecan; LDHA in BMSC-Exos upregulated BMP7 through histone H3K18 lactate modification; high LDHA expression reversed the knockdown of BMP7, further increasing the proliferation and differentiation of CSPCs, thereby inducing cartilage formation. CONCLUSION LDHA in BMSC-Exos promotes BMP7 expression via Tendon-bone healing Bone mesenchymal stromal cells Exosome Lactate dehydrogenase A Histone lactylation modification Cartilage fragments pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: via INTRODUCTION Anterior cruciate ligament (ACL) injury is the most common knee sports injury, and its incidence has been steadily increasing in recent years. In the last decade, arthroscopic ACL reconstruction (ACLR) of the knee has been recognized as an effective treatment for ACL rupture[ 1 2 3 4 5 Emerging evidence suggests that metabolic-epigenetic crosstalk may play a pivotal role in tissue repair. Among these mechanisms, histone lactylation - a novel post-translational modification driven by lactate - has recently been implicated in regulating cellular plasticity and repair processes. Histone lactylation modifies lysine residues on histones through lactate-derived lactyl groups, directly linking cellular metabolism to epigenetic gene regulation. While initially discovered in immune modulation and tumor microenvironments, its potential role in musculoskeletal repair remains unexplored. The discovery and investigation of cartilage-derived stem cells or cartilage-derived stem/progenitor cells have created a new path for the treatment of cartilage lesions from different perspectives[ 6 7 8 9 et al 10 Bone marrow mesenchymal stem cells (BMSCs) are pluripotent stem cells with the potential to differentiate directionally into tissues such as bone, cartilage, tendon, muscle, etc. 11 12 et al 13 14 16 Notably, the metabolic activity of BMSC-Exos may extend beyond traditional paracrine signaling. Lactate dehydrogenase A (LDHA), a key enzyme in lactate metabolism, is enriched in BMSC-Exos and regulates lactate production - a substrate for histone lactylation[ 17 18 19 19 20 MATERIALS AND METHODS Cell culture and treatment  Extraction of chondrocyte stem cells: 2  Extraction of BMSCs: 2 Cell viability assay CSPCs viability assay was performed by Cell Counting Kit-8 (Beyotime, China). First, CSPCs with or without bone morphogenetic protein 7 small interfering RNA (BMP7-siRNA) were inoculated into a 96-well plate and then incubated with BMSC-Exos with or without LDHA-siRNA overnight. For lactate rescue experiments, cells were co-treated with 5-20 mmol/L sodium lactate (Sigma, MA, United States) or 10 mmol/L FX11 (LDHA inhibitor). Then the cell supernatant was aspirated and 10 μL of cell counting kit 8 solution was added, followed by continued incubation for 4 hours. Finally, the absorbance at 450 nm was measured under an enzyme meter. SiRNA construction and transduction For the establishment of siRNA knockdown cell lines, cells were transfected with LDHA-siRNA, BMP7-siRNA LDHB-siRNA (to exclude LDH isoform interference) or only siRNA (siNC group) using the Lipofectamine TM Experimental animals All rats (8-week-old SD rats, male, 250-300 g) were purchased. The study was approved by the Affiliated Lihuili Hospital of Ningbo University Medical Ethics Committee for Laboratory Animals and complied with the Guidelines for the Management and Use of Laboratory Animals. All animals were housed in a specific pathogen-free environment for one week before subsequent experimental studies. For the construction of the ACLR model, rats were anesthetized using sodium pentobarbital (intraperitoneal injection, 40 mg/kg), and then the shoulder joint was incised, the trapezius muscle was pulled back, and the unilateral ACL was excised. Four weeks later, the autologous tendon was grafted and fixed into the bone tunnel on the femoral and tibial sides using surgical sutures. After surgery, the incision was sutured, and the rats were allowed to move and eat freely. A total of 36 rats were randomly divided into 3 groups ( n Western blotting analysis Cellular protein samples of different groups were extracted using RIPA lysate and protein concentration was determined by BCA kit, followed by sodium-dodecyl sulfate gel electrophoresis, and then polyvinylidene fluoride membrane was used for membrane transfer. The polyvinylidene fluoride membrane was placed in goat serum for sealing, and then the corresponding primary antibody, HRP-labeled goat anti-rabbit or goat anti-mouse secondary antibody were added for incubation, respectively. Finally, the ECL luminescent solution was evenly added to the membrane and the target bands were imaged using a chemiluminescence instrument. Primary antibodies included: LDHA (1:1000, Abcam ab52488, United Kingdom); H3K18 La (1:500, PTM Bio PTM-1401, China); BMP7 (1:1000, Santa Cruz sc-514365, TX, United States); p-Smad1/5/8 (1:1000, Cell Signaling 13820, MA, United States); CD63 (1:1000, System Biosciences EXOAB-CD63A-1, CA, United States); CD81 (1:1000, System Biosciences EXOAB-CD81A-1. CA, United States); calnexin (1:1000, negative control, Abcam ab22595, United Kingdom). Micro-computed tomography imaging The micro-computed tomography (micro-CT) system was used to analyze and evaluate new bone formation in tendon terminals of ACLR rats after injection of BMSC-Exos with high or low expression of LDHA. The parameters of micro-CT were 11.5 μm voxel size, 45 KVp, 100 μA, and 231 ms exposure time/view. Then we selected a cylindrical region of interest with a diameter of 1.2 mm and a height of 2 mm (bone trabeculae within the humeral head near the point of tendon attachment within approximately 1 mm and proximal to the growth plate) to calculate bone mineral density. Extracellular lactate content analysis CSPCs were cultured in 24-well plates and then co-incubated with BMSC-Exos knocking down LDHA or silencing BMP7 for 24 hours, respectively. And then the supernatant medium was collected and centrifuged to separate the cell debris and floating cells, following the secreted lactic acid in the medium was measured using a 1:20 dilution of L-lactate assay kit I. DMEM in 10% FBS was used as a control to subtract the influence of background. Quantitative real-time polymerase chain reaction Trizol reagent was used to extract and isolate total RNA from differently treated BMSC-Exos and CSPCs. Then, cDNA was synthesized by reverse transcription of mRNA using SuperScript III reverse transcriptase and Oligo(dT)18 primer. Next, a SYBR Green amplification kit was utilized to analysis the cDNA by quantitative polymerase chain reaction (PCR) in a PCR detection system. All experiments were repeated three times. Chromatin immunoprecipitation-quantitative PCR The enrichment of H3K18 Lactylationon the BMP7 promoter was determined using the chromatin immunoprecipitation assay kit according to the manufacturer’s protocol. Briefly, CSPCS was fixed, lysed and sonicated into chromatin with an average size of 500 bp, and then the chromatin was spun at 4 °C for 8 hours with anti-H3K18 La antibody (PTM Bio, China) or immunoglobulin G control. Quantitative PCR primers flanking the BMP7 promoter Smad-binding element were designed (forward: 5’-GCGAGCTCGGTACCCGG-3’; reverse: 5’-TCCCCCGGGCTGCAGGA-3’). The immunoprecipitated DNA was then purified with RNAase A and proteinase K, respectively, and the purified DNA was evaluated with specific primers and the level of BMP7 was detected by PCR. BMP7 promoter activity assay For the BMP7 promoter activity assay, CSPCs were seeded in 6-well plates and cultured for 24 hours before transfection. The cells were then transfected with the BMP7 promoter-luciferase reporter (pGL3-BMP7-Smad-binding element) and Smad1/5/8 dominant-negative plasmid (Addgene #31737, MA, United States) using Lipofectamine 2000. After 48 hours of incubation, cells were lysed, and firefly/Renilla luciferase activity was measured using the Dual-Luciferase ® Immunofluorescence staining Firstly, lip-loving fluorescent PKH dye (PKH-26) was used to label BMSC-Exos, and then labeled BMSC-Exos were incubated with CSPCs for 24 hours. Then after fixation with paraformaldehyde and washing with PBS, the nuclei were labeled with 4’,6-diamidino-2-phenylindole (1:1000, Solarbio, China). Finally, the internalization of BMSC-Exos was analyzed by a confocal fluorescence microscope. Immunohistochemistry staining The samples were decalcified and dehydrated, embedded in paraffin wax to make paraffin sections, which were then cut into 5-μm sections on a microtome, followed by hematoxylin and eosin (H&E) staining using H&E staining solutions, and Safranin O-Fast green (SOFG) staining using Senna-Fast Green staining solution SOFG, respectively. Staining was performed according to the procedure provided by the reagent vendor. For H&E staining, a scoring system was used to assess regeneration of tendons for CSPCs, vascular distribution, and collagen fiber orientation. For SOFG staining, ImageJ software was applied to quantify the total area of regenerated fibrocartilage. Nano-flow cytometry detection of BMSC-Exos  Reagents and instruments: g  BMSC-Exos sample preparation: g g g g 12  Nano-flow cytometry detection: g Statistical analysis Data in this study were obtained from five parallel experiments and presented as mean ± SD. The Graphpad and SPSS 22.0 software were used to analyze the data. Comparisons between two groups of data were analyzed by unpaired t post hoc a P RESULTS Identification of LDHA in BMSC-Exos Morphological analysis of BMSC-Exos by transmission electron microscopy showed that BMSC-Exos presented rounded particles, and qNano analysis indicated that its size was approximately about 100 nm (Figure 1A B Supplementary Figure 1 1C 1D Figure 1  Exosomes derived from bone marrow mesenchymal stem cells highly expresses lactate dehydrogenase A. BMSC-Exos promotes tendon-bone healing in rats after ACLR Then the in vivo 2A 2B vs 3 vs 3 c P vs c P 2C 2D 1 Figure 2  Exosomes derived from bone marrow mesenchymal stem cells promotes anterior cruciate ligament reconstruction tendon bone healing. Table 1 Micro-computed tomography quantitative analysis of tendon-bone healing  Group  BMD (g/cm 3  BV/TV (%)  Tb.Th (mm) PBS control 0.15 ± 0.03 18.7 ± 3.2 0.09 ± 0.02 BMSC-Exos 0.31 ± 0.04 a 35.6 ± 4.5 a 0.15 ± 0.03 a BMSC-Exos shLDHA 0.16 ± 0.03 b 19.2 ± 2.8 b 0.09 ± 0.01 b a  P vs b  P vs Data are mean ± SD ( n BMSC-Exos promoted the proliferation and differentiation of CSPCs CSPCs isolated from rat knee cartilage fragments were co-incubated with BMSC-Exos with and without knockdown of LDHA, respectively, and then protein expression levels of LDHA in CSPCs were analyzed by western blotting. CSPCs treated with BMSC-Exos showed elevated level of LDHA expression (Figure 3A 3B 3C 3D 2 Figure 3  Exosomes derived from bone marrow mesenchymal stem cells promotes the proliferation and differentiation of chondrocyte stem cells. a P vs b P vs Table 2 Experimental replication and statistical power  Assay  Sample size ( n  Independent repeats  Power analysis ( α β  In vivo 12/group 3 Effect size = 1.8, power = 0.85 CCK-8 6 wells/group 5 Effect size = 1.5, power = 0.91 qPCR 3 replicates 5 Effect size = 1.2, power = 0.88 WB 3 replicates 5 Effect size = 1.3, power = 0.89 Power analysis was performed using G*Power 3.1. ACLR: Anterior cruciate ligament reconstruction; CCK-8: Cell counting kit 8; qPCR: Quantitative polymerase chain reaction; WB: Western blotting. LDHA upregulates BMP7 via histone H3K18 lactylation modification in BMSC-Exos To explore the potential mechanism by which LDHA regulates tendon-bone healing, we analyzed the protein expression levels of the H3K18 Lactylation modification in CSPCs. As shown in Figure 4A 4A Supplementary Figure 2A Supplementary Figure 2B Supplementary Figure 2C 4B 4C 4D E in vitro Supplementary Figure 3A and B Supplementary Figure 3C Figure 4  Lactate dehydrogenase A regulates H3K18 Lactylation and bone morphogenetic protein 7 expression in chondrocyte stem cells. a P vs b P vs Histone lactylation modification of LDHA in BMSC-Exos promotes CSPCs proliferation CSPCs were transfected with si-BMP7 to knock down their expression for further investigate the role of LDHA on cartilage formation. CSPCs with and without transfection of BMP7-short hairpin RNA were co-cultured with BMSC-Exos with and without knockdown of LDHA in chondrogenic medium, respectively. As shown in Figure 5A 5A 5B 5C 5D Supplementary Figure 4 Figure 5  Exosomes derived from bone marrow mesenchymal stem cells lactate dehydrogenase A promotes chondrocyte stem cells proliferation by upregulating bone morphogenetic protein 7. b P vs DISCUSSION ACL is one of the critical stabilizing structures of the knee joint, and ACL rupture is a common locomotor system injury. With the continuous improvement of clinical research, ACLR is the preferred treatment modality for ACL rupture[ 21 22 23 24 26 Stem cells, with their unlimited self-dividing ability and multiple differentiation potentials, play a role in the tendon-bone healing process. A large number of studies have demonstrated that stem cells have an obvious enhancement and promotion effect on tendon-bone healing. Li et al 27 et al 15 via 5 28 29 et al 30 In the present study, we confirmed the high expression of LDHA in BMSC-Exos. The proliferation of chondrocytes migrating from cartilage debris was clearly observed in CSPCs by western blotting analysis as well as cell counting kit 8 assay, enhancing the expression of collagen-II, SOX9 and aggrecan, accompanied by an increase in lactate content. Furthermore, in the in vivo 31 32 Clinical translation and future directions Our findings hold significant translational potential for ACLR. First, BMSC-Exos could be developed as an intra-articular injectable therapeutic agent to augment tendon-bone healing. The exosomal LDHA-lactylation-BMP7 axis identified here provides a druggable target: Localized delivery of LDHA-enriched exosomes ( e.g., via e.g., via However, there are still many limitations here, such as the fact that the effect of LDHA in BMSC-Exos on cartilage debris was only validated in CSPCs and SD rats. While our study included a PBS-injected control group to account for potential effects of intra-articular injection procedures, the absence of an untreated ACLR group (no injection) limits our ability to fully distinguish between the mechanical impact of PBS injection and the natural healing process. Future studies should incorporate both untreated and vehicle control groups to dissect injection-related confounding factors. In the future, a large number of clinical trials are still needed to confirm the mechanism study of biological intervention in tendon-bone healing, so as to provide help and guidance for clinical treatment, accelerate the rapid recovery of patients and improve their quality of life. CONCLUSION In conclusion, our results suggest that BMSC-Exos can significantly promote tendon-bone healing, which is mainly achieved by the high expression of LDHA in BMSC-Exos up-regulating the expression of BMP7 through histone H3K18 Lactylation modification. These findings pave the way for developing LDHA-targeted exosome therapies to improve ACLR outcomes, with a clear roadmap for preclinical optimization and clinical translation.  Institutional review board statement:  Institutional animal care and use committee statement:  Conflict-of-interest statement:  ARRIVE guidelines statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Diermeier TA Rothrauff BB Engebretsen L Lynch A Svantesson E Hamrin Senorski EA Meredith SJ Rauer T Ayeni OR Paterno M Xerogeanes JW Fu FH Karlsson J Musahl V Panther Symposium ACL Treatment Consensus Group Treatment after ACL injury: Panther Symposium ACL Treatment Consensus Group Br J Sports Med 2021 55 14 22 32661128 10.1136/bjsports-2020-102200 2 van Meer BL Waarsing JH van Eijsden WA Meuffels DE van Arkel ER Verhaar JA Bierma-Zeinstra SM Reijman M Bone mineral density changes in the knee following anterior cruciate ligament rupture Osteoarthritis Cartilage 2014 22 154 161 24269632 10.1016/j.joca.2013.11.005 3 de Andrade ALL Sardeli AV Garcia TA Livani B Belangero WD PRP does not improve the objective outcomes of anterior cruciate ligament reconstruction: a systematic review and meta-analysis Knee Surg Sports Traumatol Arthrosc 2021 29 3049 3058 33169180 10.1007/s00167-020-06348-z 4 Hao ZC Wang SZ Zhang XJ Lu J Stem cell therapy: a promising biological strategy for tendon-bone healing after anterior cruciate ligament reconstruction Cell Prolif 2016 49 154 162 26929145 10.1111/cpr.12242 PMC6496206 5 Zhang C Jiang C Jin J Lei P Cai Y Wang Y Cartilage fragments combined with BMSCs-Derived exosomes can promote tendon-bone healing after ACL reconstruction Mater Today Bio 2023 23 100819 10.1016/j.mtbio.2023.100819 PMC10550801 37810754 6 Barbero A Ploegert S Heberer M Martin I Plasticity of clonal populations of dedifferentiated adult human articular chondrocytes Arthritis Rheum 2003 48 1315 1325 12746904 10.1002/art.10950 7 Seol D McCabe DJ Choe H Zheng H Yu Y Jang K Walter MW Lehman AD Ding L Buckwalter JA Martin JA Chondrogenic progenitor cells respond to cartilage injury Arthritis Rheum 2012 64 3626 3637 22777600 10.1002/art.34613 PMC4950521 8 Marmotti A Bonasia DE Bruzzone M Rossi R Castoldi F Collo G Realmuto C Tarella C Peretti GM Human cartilage fragments in a composite scaffold for single-stage cartilage repair: an in vitro study of the chondrocyte migration and the influence of TGF-β1 and G-CSF Knee Surg Sports Traumatol Arthrosc 2013 21 1819 1833 23143386 10.1007/s00167-012-2244-7 9 Jiang Y Cai Y Zhang W Yin Z Hu C Tong T Lu P Zhang S Neculai D Tuan RS Ouyang HW Human Cartilage-Derived Progenitor Cells From Committed Chondrocytes for Efficient Cartilage Repair and Regeneration Stem Cells Transl Med 2016 5 733 744 27130221 10.5966/sctm.2015-0192 PMC4878331 10 Zhang C Pan J Chen JD Zhang YJ Gu PC Lin XJ Cai YZ The Effect of Cartilage Fragments on Femoral Tunnel Widening After Anterior Cruciate Ligament Reconstruction: A Prospective Randomized Controlled Study Arthroscopy 2018 34 2218 2227 29730208 10.1016/j.arthro.2018.03.011 11 Čamernik K Zupan J Complete Assessment of Multilineage Differentiation Potential of Human Skeletal Muscle-Derived Mesenchymal Stem/Stromal Cells Methods Mol Biol 2019 2045 131 144 30499024 10.1007/7651_2018_200 12 Han L Liu H Fu H Hu Y Fang W Liu J Exosome-delivered BMP-2 and polyaspartic acid promotes tendon bone healing in rotator cuff tear via Smad/RUNX2 signaling pathway Bioengineered 2022 13 1459 1475 35258414 10.1080/21655979.2021.2019871 PMC8805918 13 Ouyang HW Goh JC Lee EH Use of bone marrow stromal cells for tendon graft-to-bone healing: histological and immunohistochemical studies in a rabbit model Am J Sports Med 2004 32 321 327 14977654 10.1177/0095399703258682 14 Harrell CR Jovicic N Djonov V Volarevic V Therapeutic Use of Mesenchymal Stem Cell-Derived Exosomes: From Basic Science to Clinics Pharmaceutics 2020 12 474 32456070 10.3390/pharmaceutics12050474 PMC7313713 15 Huang Y He B Wang L Yuan B Shu H Zhang F Sun L Bone marrow mesenchymal stem cell-derived exosomes promote rotator cuff tendon-bone healing by promoting angiogenesis and regulating M1 macrophages in rats Stem Cell Res Ther 2020 11 496 33239091 10.1186/s13287-020-02005-x PMC7687785 16 Yao X Li C Lactate dehydrogenase A mediated histone lactylation induced the pyroptosis through targeting HMGB1 Metab Brain Dis 2023 38 1543 1553 36870018 10.1007/s11011-023-01195-6 17 Gan X Hu J Pang Q Yan R Bao Y Liu Y Song J Wang Z Sun W Huang F Cai C Wang L LDHA-mediated M2-type macrophage polarization via tumor-derived exosomal EPHA2 promotes renal cell carcinoma progression Mol Carcinog 2024 63 1486 1499 38780182 10.1002/mc.23737 18 Wang N Wang W Wang X Mang G Chen J Yan X Tong Z Yang Q Wang M Chen L Sun P Yang Y Cui J Yang M Zhang Y Wang D Wu J Zhang M Yu B Histone Lactylation Boosts Reparative Gene Activation Post-Myocardial Infarction Circ Res 2022 131 893 908 36268709 10.1161/CIRCRESAHA.122.320488 19 Khan F Lin Y Ali H Pang L Dunterman M Hsu WH Frenis K Grant Rowe R Wainwright DA McCortney K Billingham LK Miska J Horbinski C Lesniak MS Chen P Lactate dehydrogenase A regulates tumor-macrophage symbiosis to promote glioblastoma progression Nat Commun 2024 15 1987 38443336 10.1038/s41467-024-46193-z PMC10914854 20 Dai M Wang L Yang J Chen J Dou X Chen R Ge Y Lin Y LDHA as a regulator of T cell fate and its mechanisms in disease Biomed Pharmacother 2023 158 114164 36916398 10.1016/j.biopha.2022.114164 21 Marieswaran M Jain I Garg B Sharma V Kalyanasundaram D A Review on Biomechanics of Anterior Cruciate Ligament and Materials for Reconstruction Appl Bionics Biomech 2018 2018 4657824 29861784 10.1155/2018/4657824 PMC5971278 22 Matsumoto T Takayama K Hayashi S Niikura T Matsushita T Kuroda R Therapeutic potential of vascular stem cells for anterior cruciate ligament reconstruction Ann Transl Med 2019 7 S286 32016005 10.21037/atm.2019.11.79 PMC6976481 23 Bi F Shi Z Jiang S Guo P Yan S Intermittently administered parathyroid hormone [1-34] promotes tendon-bone healing in a rat model Int J Mol Sci 2014 15 17366 17379 25268612 10.3390/ijms151017366 PMC4227167 24 Liu Y Wang L Li S Zhang T Chen C Hu J Sun D Lu H Mechanical stimulation improves rotator cuff tendon-bone healing via activating IL-4/JAK/STAT signaling pathway mediated macrophage M2 polarization J Orthop Translat 2022 37 78 88 36262964 10.1016/j.jot.2022.08.008 PMC9550856 25 Geng R Lin Y Ji M Chang Q Li Z Xu L Zhang W Lu J MFG-E8 promotes tendon-bone healing by regualting macrophage efferocytosis and M2 polarization after anterior cruciate ligament reconstruction J Orthop Translat 2022 34 11 21 35615640 10.1016/j.jot.2022.04.002 PMC9109120 26 Chen W Sun Y Gu X Cai J Liu X Zhang X Chen J Hao Y Chen S Conditioned medium of human bone marrow-derived stem cells promotes tendon-bone healing of the rotator cuff in a rat model Biomaterials 2021 271 120714 33610048 10.1016/j.biomaterials.2021.120714 27 Li Z Li Q Tong K Zhu J Wang H Chen B Chen L BMSC-derived exosomes promote tendon-bone healing after anterior cruciate ligament reconstruction by regulating M1/M2 macrophage polarization in rats Stem Cell Res Ther 2022 13 295 35841008 10.1186/s13287-022-02975-0 PMC9284827 28 Valvona CJ Fillmore HL Nunn PB Pilkington GJ The Regulation and Function of Lactate Dehydrogenase A: Therapeutic Potential in Brain Tumor Brain Pathol 2016 26 3 17 26269128 10.1111/bpa.12299 PMC8029296 29 Wu H Wang Y Ying M Jin C Li J Hu X Lactate dehydrogenases amplify reactive oxygen species in cancer cells in response to oxidative stimuli Signal Transduct Target Ther 2021 6 242 34176927 10.1038/s41392-021-00595-3 PMC8236487 30 Arra M Swarnkar G Ke K Otero JE Ying J Duan X Maruyama T Rai MF O'Keefe RJ Mbalaviele G Shen J Abu-Amer Y LDHA-mediated ROS generation in chondrocytes is a potential therapeutic target for osteoarthritis Nat Commun 2020 11 3427 32647171 10.1038/s41467-020-17242-0 PMC7347613 31 Klatte-Schulz F Pauly S Scheibel M Greiner S Gerhardt C Hartwig J Schmidmaier G Wildemann B Characteristics and stimulation potential with BMP-2 and BMP-7 of tenocyte-like cells isolated from the rotator cuff of female donors PLoS One 2013 8 e67209 23825642 10.1371/journal.pone.0067209 PMC3692432 32 Chubinskaya S Hurtig M Rueger DC OP-1/BMP-7 in cartilage repair Int Orthop 2007 31 773 781 17687553 10.1007/s00264-007-0423-9 PMC2266666 Data sharing statement The datasets used and analysed during the current study are available from the corresponding author on reasonable request. ",
  "metadata": {
    "Title of this paper": "OP-1/BMP-7 in cartilage repair",
    "Journal it was published in:": "World Journal of Stem Cells",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476803/"
  }
}