{
  "title": "Paper_575",
  "abstract": "pmc BMC Cancer BMC Cancer 16 bmccanc BMC Cancer 1471-2407 BMC PMC12482856 PMC12482856.1 12482856 12482856 41029239 10.1186/s12885-025-14875-6 14875 1 Research A CT-based radiomics nomogram incorporating adipose tissue to differentiate invasive adenocarcinomas among part-solid pulmonary nodules Qin Ling 1 Zhao Lin 2 Li Xue-meng 2 Jia Qing-chun 2 Liu Zeng-yao 3 Miao Shi-di 4 Zhang Xin 2 Li Yuan-zhou 5 Wang Rui-tao ruitaowang@126.com 2 Fu Shuang fushuang.721@163.com 2 1 https://ror.org/05jscf583 grid.410736.7 0000 0001 2204 9268 Department of Pathology, Harbin Medical University Cancer Hospital, Harbin Medical University, 2 https://ror.org/05jscf583 grid.410736.7 0000 0001 2204 9268 Department of Internal Medicine, Harbin Medical University Cancer Hospital, Harbin Medical University, 3 https://ror.org/05vy2sc54 grid.412596.d 0000 0004 1797 9737 Department of Interventional Medicine, First Affiliated Hospital of Harbin Medical University, Harbin Medical University, 4 https://ror.org/04e6y1282 grid.411994.0 0000 0000 8621 1394 School of Computer Science and Technology, Harbin University of Science and Technology, 5 https://ror.org/05jscf583 grid.410736.7 0000 0001 2204 9268 Department of Radiology, Harbin Medical University Cancer Hospital, Harbin Medical University, 30 9 2025 2025 25 478185 1471 28 8 2024 18 8 2025 30 09 2025 01 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Accurately assessing the invasiveness of lung adenocarcinoma with part-solid pulmonary nodules is pivotal for the treatment. Recent studies have highlighted the crucial role of adipose in the growth and invasion of tumors. This study aimed to develop and validate a model by integrating radiomic features from intrathoracic adipose tissue (IAT) with clinical factors to classify lung adenocarcinoma invasiveness. Methods 608 patients with lung adenocarcinomas were enrolled in three different centers. Radiomic features were extracted from nodules and IAT in computed tomography images. Multivariable logistic regression analysis was used to develop a nomogram model. The nomogram's performance was assessed utilizing accuracy, discrimination, and clinical benefits. The net reclassification index (NRI) and integrated discrimination improvement (IDI) were applied to evaluate changes in model performance after the addition of IAT features. Results The nomogram, incorporating nodule and IAT signature with nodular diameter, was constructed in the training dataset. The nomogram demonstrated area under the receiver operating curve values of 0.927 (95% CI: 0.872,0.983), 0.945 (95% CI: 0.902,0.988), and 0.917 (95% CI: 0.871,0.962) in the internal validation and two external validation cohorts, respectively. The nomogram showed good calibration (Hosmer-Lemeshow test, P>0.05), and adding the IAT signatures did improve nomogram performance in all cohorts (all NRI and IDI >0, P<0.05). Decision curve and stratification analysis revealed that the nomogram was clinically useful and had potential generalization ability. Conclusions The nomogram, consisting of nodule signature, IAT signature, and clinical factors, could individualize the classification of invasive adenocarcinomas with part-solid pulmonary nodules. Supplementary Information The online version contains supplementary material available at 10.1186/s12885-025-14875-6. Keywords Part-solid pulmonary nodules Invasiveness Lung adenocarcinomas Radiomics nomogram Adipose tissue Climbing program of Harbin Medical University Cancer Hospital PDTS2024B-01 Wang Rui-tao pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Adenocarcinomas comprise nearly 40% of all lung cancers, with the majority of early-stage cases presenting as subsolid nodules on thin-slice computed tomography (CT) scans [ 1 2 3 4 5 6 7 Recent studies have shown an association between adipose tissue inflammation and the progression of cancer [ 8 10 11 12 13 14 15 16 17 18 19 Radiomics has been applied in developing diagnostic models for discriminating nodular invasiveness [ 20 22 20 21 23 24 p Nomograms have been widely acknowledged as dependable tools for quantifying risk by incorporating crucial factors in oncologic prognoses [ 25 26 Materials and methods Study population This retrospective study evaluated 608 lung adenocarcinoma patients who underwent curative surgical resection. Data was gathered from three medical centers. Detailed inclusion/exclusion criteria and enrollment process are provided in Supplementary A1 and Fig. 1  Fig. 1 Flow diagram of the study population. (CT, computed tomography; AIS, adenocarcinoma in situ; IA, invasive adenocarcinoma; MIA, minimally invasive adenocarcinoma) Data collection and ROI acquisition procedure Clinical variables collected included age, gender, body mass index (BMI), smoking history, and family history of lung cancer. Additionally, CT features of pulmonary nodules were documented, covering the location, long axial diameter, shape (round/oval or irregular), margin (smooth or spiculated), and pleural indentation (yes or no). Solid component size was not quantified due to technical variability in segmentation thresholds across CT platforms and A‌merican ‌C‌ollege of ‌R‌adiology guidance for sub-3 mm components [ 27 2  Fig. 2 Deep learning and radiomics workflow in this study. (CT, computed tomography; ROI, region of interest; ICC, intraclass/interclass correlation coefficient; PCA, principal component analysis; LASSO, least absolute shrinkage and selection operator; SVM, support vector machine; RF, random forest; ROC, receiver operating curve; NRI, net reclassification index; IDI, integrated discrimination improvement) ‌For ROI delineation‌, reader 1 manually segmented tumors using ‌3D Slicer (version 4.10.2; www.slicer.org/ 28 29 30 Feature extraction and radiomic signature building Radiomic features from tumors were extracted using the Pyradiomics library (version 3.0.1) in Python. For methodological rigor‌, we followed radiomics-specific guidelines for feature stability assessment [ 31 Model construction and performance evaluation In the primary cohort, statistically significant clinicopathological variables were identified using univariate analysis ( P Statistical analysis Descriptive statistics were reported as means with standard deviations or medians (interquartile range) for continuous variables, and percentages for categorical variables. Student’s t-test or Mann-Whitney U test was used to determine the difference in continuous variables between the two groups. The Fisher’s exact test, or Chi-square test, was conducted to compare categorical variables. Quantitative comparison of AUCs was carried out by the Delong test. All statistical tests were performed using R software (version 4.3.1; http://www.Rproject.org P Results Clinical characteristics 608 patients (395 [65.0%] women) were included in the study, with a median age of 57.26 ± 9.13 years. 448 (73.7%) were diagnosed with invasive adenocarcinoma based on pathological findings. The clinicopathological characteristics for the training cohort, internal validation cohort, and two external validation cohorts are summarized in Table 1  Table 1 Baseline characteristics of patients Variables Training cohort N Internal validation cohort N External validation cohort 1 N External validation cohort 2 N AIS or MIA N IA N P AIS or MIA N IA N P AIS or MIA N IA N P AIS or MIA N IA N P Gender 0.003 0.320 0.369 0.856 Female 40 (83.3) 117 (59.4) 11 (61.1) 66 (75.9) 22 (57.9) 48 (68.6) 35 (62.5) 56 (59.6) Male 8 (16.7) 80 (40.6) 7 (38.9) 21 (24.1) 16 (42.1) 22 (31.4) 21 (37.5) 38 (40.4) Age (years) 53.12 ± 10.23 57.75 ± 8.27 0.001 58.72 ± 8.94 57.09 ± 9.30 0.497 56.32 ± 10.57 57.14 ± 8.24 0.654 57.66 ± 10.87 58.44 ± 8.73 0.632 BMI (kg/m 2 23.92 ± 3.20 24.23 ± 2.89 0.510 24.11 ± 2.62 24.68 ± 3.16 0.474 24.29 ± 2.85 23.33 ± 2.94 0.110 23.88 ± 2.70 24.13 ± 2.95 0.607 Smokers 0.056 1.000 0.398 No 43 (89.6) 149 (75.6) 14 (77.8) 69 (79.3) 32 (84.2) 58 (82.9) 1.000 46 (83.6) 71 (76.3) Yes 5 (10.4) 48 (24.4) 4 (22.2) 18 (20.7) 6 (15.8) 12 (17.1) 9 (16.4) 22 (23.7) Patients with family history 0.832 0.318 NA 1.000 No 44 (91.7) 176 (89.3) 14 (77.8) 78 (89.7) 38 (100.0) 70 (100.0) 53 (94.6) 90 (95.7) Yes 4 (8.3) 21 (10.7) 4 (22.2) 9 (10.3) 0 (0.0) 0 (0.0) 3 (5.4) 4 (4.3) Maximal diameter (mm) 10.77 ± 3.52 17.20 ± 6.09 < 0.001 11.89 ± 4.46 16.02 ± 5.75 0.005 10.37 ± 3.98 17.46 ± 6.52 < 0.001 12.61 ± 9.65 17.56 ± 7.20 0.001 Lesion location in upper lobe 0.892 0.501 0.095 0.362 No 14 (29.2) 62 (31.5) 7 (38.9) 24 (27.6) 14 (36.8) 39 (55.7) 3 (5.4) 2 (2.1) Yes 34 (70.8) 135 (68.5) 11 (61.1) 63 (72.4) 24 (63.2) 31 (44.3) 53 (94.6) 92 (97.9) Lesion shape 0.365 0.680 0.009 0.629 Round/oval 8 (16.7) 21 (10.7) 2 (11.1) 8 (9.2) 13 (34.2) 8 (11.4) 2 (3.6) 2 (2.1) Irregular 40 (83.3) 176 (89.3) 16 (88.9) 79 (90.8) 25 (65.8) 62 (88.6) 54 (96.4) 92 (97.9) Lesion margin 0.131 1.000 1.000 1.000 Smooth 48 (100.0) 185 (93.9) 18 (100.0) 85 (97.7) 35 (92.1) 63 (90.0) 56 (100.0) 93 (98.9) Spiculated 0 (0.0) 12 (6.1) 0 (0.0) 2 (2.3) 3 (7.9) 7 (10.0) 0 (0.0) 1 (1.1) Present pleural indentation 1.000 0.171 0.250 0.373 No 48 (100.0) 193 (98.0) 17 (94.4) 87 (100.0) 34 (91.9) 57 (82.6) 55 (98.2) 94 (100.0) Yes 0 (0.0) 4 (2.0) 1 (5.6) 0 (0.0) 3 (8.1) 12 (17.4) 1 (1.8) 0 (0.0) BMI AIS MIA IA Feature selection and radiomic signature building After assessing reproducibility, 1064 radiomic features (including 296 nodule features and 768 IAT features) were selected. From the least absolute shrinkage and selection operator analysis, 5 nodule radiomic features with non-zero weights were selected as the final nodule radiomic features. Similarly, 55 IAT radiomic features with non-zero weights were selected as the final IAT radiomic features (Figure S3). We compared three methods for signature building and found the SVM and random forest were the best for nodule and IAT features, respectively (Table S2). As shown in Supplementary A7, nodule signatures were built using SVM. The output of the nodule signature was generated as a function of a nonlinear combination of the 5 selected nodule radiomic features. Similarly, the IAT radiomic signature was built using the random forest. Diagnostic validation of radiomic signature The nodule signature yielded AUCs of 0.788 (95% CI: 0.678–0.898), 0.797 (95% CI: 0.709–0.884), and 0.798 (95% CI: 0.724–0.871) in the internal validation and two external validation cohorts, respectively. For invasiveness prediction, the IAT radiomic signature achieved satisfying performance, with AUCs of 0.885 (95% CI: 0.811–0.959), 0.869 (95% CI: 0.789–0.948), and 0.843 (95% CI: 0.775–0.911) in the internal validation and two external validation cohorts, respectively (Figure S4). Radiomics nomogram construction In the training cohort, univariate analysis showed that age, gender, smokers, and maximal diameter were significantly related to invasiveness. Crucially, there were no statistically significant differences in baseline information observed among the training and validation cohorts in Center 1 (Table S3). Multivariate analysis identified maximal diameter as the significant independent clinical factor for predicting invasiveness (Table S4). Therefore, maximal diameter, nodule signature, and the IAT radiomic signature were fused as a nomogram (Fig. 3  Fig. 3 A nomogram that incorporates the nodule and adipose tissue signatures and clinical factors Performance and validation of the radiomics nomogram The nomogram demonstrated superior discrimination power for predicting invasiveness in the training cohort (AUC = 0.978, 95% CI: 0.958–0.999). In the validation datasets, the nomogram yielded high discriminative performance, with AUC values of 0.927 (95% CI: 0.87–0.983), 0.945 (95% CI: 0.902–0.988), and 0.917 (95% CI: 0.871–0.962) for the training, internal, and external test sets, respectively (Fig. 4  Fig. 4 The nomogram’s performance was evaluated in terms of accuracy, discrimination, and clinical benefits Receiver operating characteristic curves of the radiomics nomogram in the different cohorts ( A B C D The calibration curves revealed good agreement between the predicted and expected probabilities for predicting invasiveness in the training and validation cohorts (Fig. 4 P P Incremental predictive value of adipose signature The discriminative performance of single or combined predictors is summarized in Table 2 3 P P P P  Table 2 The predictive performance of single or combined predictors in different cohorts AUC ACC (%) SEN (%) SPE (%) PPV (%) NPV (%) Training cohort Maximal diameter (mm) 0.825(0.764,0.885) 70.6(70.4,70,8) 68.0(61.5,74.5) 81.2(70.2,92.3) 93.7(89.7,97.7) 38.2(28.8,47.7) Nodule signature 0.850(0.792,0.908) 80.8(80.7,80.9) 81.2(75.8,86.7) 79.2(67.7,90.7) 94.1(90.6,97.7) 50.7(39.4,62.0) Adipose signature 0.966(0.947,0.986) 89.8(89.7,89.9) 88.3(83.8,92.8) 95.8(90.2,100.0) 98.9(97.3,100.0) 66.7(55.5,77.8) Model 1 0.864(0.811,0.917) 79.2(79.1,79.3) 78.7(73.0,84.4) 81.2(70.2,92.3) 94.5(91.0,98.0) 48.1(37.3,59.0) Model 2 (nomogram) 0.978(0.958,0.999) 94.7(94.7,94.7) 94.4(91.2,97.6) 95.8(90.2,100.0) 98.9(97.5,100.0) 80.7(70.5,90.9) Internal validation cohort Maximal diameter (mm) 0.739(0.614,0.864) 60.0(59.6,60.4) 54.0(43.6,64.5) 88.9(74.4,100.0) 95.9(90.4,100.0) 28.6(16.7,40.4) Nodule signature 0.788(0.678,0.898) 74.3(73.9,74.6) 72.4(63.0,81.8) 83.3(66.1,100.0) 95.5(90.4,100.0) 38.5(23.2,53.7) Adipose signature 0.885(0.811,0.959) 72.4(72.0,72.8) 67.8(58.0,77.6) 94.4(83.9,100.0) 98.3(95.1,100.0) 37.8(23.6,51.9) Model 1 0.790(0.681,0.898) 70.5(70.1,70.9) 66.7(56.8,76.6) 88.9(74.4,100.0) 96.7(92.1,100.0) 35.6(21.6,49.5) Model 2 (nomogram) 0.927(0.872,0.983) 86.7(86.5,86.9) 86.2(79.0,93.5) 88.9(74.4,100.0) 97.4(93.8,100.0) 57.1(38.8,75.5) External validation cohort 1 Maximal diameter (mm) 0.817(0.736,0.898) 75.9(75.6,76.3) 74.3(64.0,84.5) 78.9(66.0,91.9) 86.7(78.1,95.3) 62.5(48.8,76.2) Nodule signature 0.797(0.709,0.884) 75.0(74.7,75.3) 74.3(64.0,84.5) 76.3(62.8,89.8) 85.2(76.3,94.1) 61.7(47.8,75.6) Adipose signature 0.869(0.789,0.948) 86.1(85.9,86.3) 92.9(86.8,98.9) 73.7(59.7,87.7) 86.7(79.0,94.4) 84.8(72.6,97.1) Model 1 0.820(0.737,0.902) 77.8(77.5,78.1) 75.7(65.7,85.8) 81.6(69.3,93.9) 88.3(80.2,96.5) 64.6(51.1,78.1) Model 2 (nomogram) 0.945(0.902,0.988) 88.0(87.8,88.2) 84.3(75.8,92.8) 94.7(87.6,100.0) 96.7(92.3,100.0) 76.6(64.5,88.7) External validation cohort 2 Maximal diameter (mm) 0.770(0.687,0.853) 75.9(75.7,76.2) 77.0(68.2,85.9) 74.0(61.8,86.2) 83.8(75.7,91.8) 64.9(52.5,77.3) Nodule signature 0.798(0.724,0.871) 74.0(73.7,74.3) 70.2(61.0,79.5) 80.4(70.0,90.8) 85.7(77.9,93.5) 61.6(50.5,72.8) Adipose signature 0.843(0.775,0.911) 81.3(81.1,81.5) 86.2(79.2,93.1) 73.2(61.6,84.8) 84.4(77.1,91.6) 75.9(64.5,87.3) Model 1 0.827(0.756,0.899) 75.9(75.7,76.2) 71.3(61.8,80.8) 84.0(73.8,94.2) 88.6(81.1,96.0) 62.7(51.1,74.3) Model 2 (nomogram) 0.917(0.871,0.962) 84.7(84.5,84.9) 88.5(81.8,95.2) 78.0(66.5,89.5) 87.5(68.3,90.9) 79.6(68.3,90.9) Model 1: maximal diameter + nodule signature Model 2: maximal diameter + nodule signature + adipose signature; 95% confidence intervals are included in brackets AUC , ACC , SEN , SPE , PPV , NPV  Table 3 Evaluating the improved performance of models by adding adipose signature NRI P IDI P Improved AUC Training cohort Model 1 Reference Reference Reference Model 2 (nomogram) 0.658(0.544,0.772) < 0.001 0.465(0.407,0.523) < 0.001 0.114 Internal validation cohort Model 1 Reference Reference Reference Model 2 (nomogram) 0.751(0.579,0.923) < 0.001 0.513(0.413,0.614) < 0.001 0.137 External validation cohort 1 Model 1 Reference Reference Reference Model 2 (nomogram) 0.614(0.455,0.772) < 0.001 0.281(0.223,0.340) < 0.001 0.125 External validation cohort 2 Model 1 Reference Reference Reference Model 2 (nomogram) 0.407(0.179,0.635) 0.001 0.200(0.138,0.263) < 0.001 0.090 95% confidence intervals are included in brackets Model 1: maximal diameter + nodule signature Model 2: maximal diameter + nodule signature + adipose signature NRI IDI AUC Clinical use The decision curve analysis (DCA) for the discriminative model derived from the nomogram is presented in Fig. 4 Discussion We developed a non-invasive nomogram through deep learning and radiomics analysis based on CT images and independently validated its ability for individualized prediction of the invasiveness of lung adenocarcinomas. Moreover, the inclusion of the IAT radiomic signature in the nomogram resulted in a substantial enhancement in both accuracy and discrimination ability. To the best of our knowledge, this is the first study to integrate IAT radiomic features into a predictive model specifically for discriminating invasive adenocarcinomas among part-solid pulmonary nodules. While prior research has explored radiomic analysis of adipose tissue—such as mediastinal fat for lung nodule malignancy [ 32 33 The decision of resection strategy for adenocarcinomas is a pivotal issue in clinical practice. Accurate assessment of tumor invasiveness is beneficial for determining the most suitable treatment approach. Moreover, we incorporated IAT radiomic features into a CT-based deep-learning nomogram to differentiate granulomas from lung adenocarcinomas in our previous study [ 30 20 21 23 Our results suggest that IAT may contribute to differentiating invasive adenocarcinoma among part-solid pulmonary nodules, though the underlying mechanism remains unclear. Recent studies have shown that lung adipose depots are crucial for regulating alveolar lipid homeostasis and pulmonary surfactant production [ 34 35 36 37 37 38 39 40 10 41 10 42 43 9 Notably, this study employed a deep learning method for adipose tissue feature extraction. The selected imaging features were complementary rather than redundant. Our nomogram, which incorporated IAT signatures, demonstrated promising performance in predicting invasiveness, with AUCs exceeding 0.900. The prediction model outperformed both the single nodule signature and the clinical model across all cohorts. Furthermore, the NRI and IDI confirmed that the improved discriminative performance was due to feature integration rather than model overfitting. The DCA demonstrated robust clinical utility for the nomogram across threshold probabilities (p t t t t t t t t While solid component measurement informs guidelines, our whole-nodule radiomic approach provided superior diagnostic accuracy for 6–30 mm part-solid nodules without this parameter. This aligns with Wu et al.‘s demonstration that radiomics capture invasiveness biology more comprehensively than linear measurements [ 44 While CT imaging provides excellent structural quantification of adipose tissue depots through differential Hounsfield unit analysis, enabling precise measurement of visceral and subcutaneous adipose tissue volumes, several important limitations must be acknowledged. CT excels at volumetric assessment but cannot characterize critical functional aspects of adipose tissue biology, including inflammation status, fibrotic changes, or metabolic activity, which require alternative imaging approaches like MRI or molecular imaging techniques [ 45 46 Our data indicate that IAT signatures complement predictions of invasiveness in lung adenocarcinoma. The nomogram is a useful tool for forecasting invasive malignancy, aiding individualized management decisions. However, this study has Limitations. First, its retrospective design necessitates validation of the findings through a prospective clinical trial. Second, the ROI delineation was performed on a single slice, which may not fully represent the entire tumor. Further exploration using 3D analysis of the entire tumor is warranted. The model development did not include serial CT scans for chronological comparison of part-solid pulmonary nodules, which future studies should address with time-series analysis. Third, the lack of solid component quantification precludes direct comparison with size-based guidelines. Future studies should integrate standardized segmentation protocols. Fourth, our study’s focus on invasion status rather than histologic subtypes reflects real-world clinical priorities in surgical decision-making. Although subtype quantification would offer more predictive detail, its resource-intensive nature and institutional variations currently limit widespread utility. Future work harmonizing radiomics with comprehensive molecular subtyping is warranted. In conclusion, we developed and validated a CT-based nomogram using deep learning and radiomics analysis for differentiating invasive adenocarcinoma among part-solid pulmonary nodules. The proposed nomogram, which integrates IAT signatures and nodule imaging signatures along with clinical factors, demonstrates significant potential for clinical application. Supplementary Information  Supplementary Material 1. Abbreviations AUC Area under the receiver operating curve BMI Body mass index DCA Decision curve analysis HU Hounsfield unit IAT Intrathoracic adipose tissue IDI Integrated discrimination improvement NRI Net reclassification index ROI Region of interest SVM Support vector machine Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Ling Qin, Lin Zhao, and Xue-meng Li contributed equally to this work and share first authorship. Acknowledgements Not applicable. Authors’ contributions SF and RTW designed the study. LQ, LZ, and XML analyzed and interpreted the data. LQ, LZ, XML, QCJ, ZYL, SDM, XZ, YZL, RTW, and SF collected the data on lung cancer, and LQ, LZ, and XML were the major contributors to writing the manuscript. All authors read and approved the final manuscript. Funding This work was supported by Climbing program of Harbin Medical University Cancer Hospital (PDTS2024B-01) and Haiyan Foundation of Harbin Medical University Cancer Hospital (JJQN2023-04). Data availability The datasets used and/or analyzed during the current study are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate This study was conducted in accordance with the Declaration of Helsinki. The study was carried out after approval from the Institutional Review Board of three centers [The Institutional Ethics Review Board of Harbin Medical University Cancer Hospital (KY2022-10); The Institutional Ethics Review Board of Second Affiliated Hospital of Harbin Medical University (KY2022-219); The Institutional Ethics Review Board of First Affiliated Hospital of Harbin Medical University (IRB-AF/SC-04/02.0)]. Since it was a retrospective study, informed consent from all participants was exempted by the Ethics Committee of three centers. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Siegel RL Miller KD Fuchs HE Jemal A Cancer statistics, 2022 CA Cancer J Clin 2022 72 1 7 33 35020204 10.3322/caac.21708 Siegel RL, Miller KD, Fuchs HE, Jemal A. Cancer statistics, 2022. CA Cancer J Clin. 2022;72(1):7–33. 35020204 10.3322/caac.21708 2. Kim HY Shim YM Lee KS Han J Yi CA Kim YK Persistent pulmonary nodular ground-glass opacity at thin-section CT: histopathologic comparisons Radiology 2007 245 1 267 75 17885195 10.1148/radiol.2451061682 Kim HY, Shim YM, Lee KS, Han J, Yi CA, Kim YK. Persistent pulmonary nodular ground-glass opacity at thin-section CT: histopathologic comparisons. Radiology. 2007;245(1):267–75. 17885195 10.1148/radiol.2451061682 3. Travis WD Brambilla E Noguchi M Nicholson AG Geisinger KR Yatabe Y Beer DG Powell CA Riely GJ Van Schil PE International association for the study of lung cancer/American thoracic society/European respiratory society international multidisciplinary classification of lung adenocarcinoma J Thorac Oncol 2011 6 2 244 85 21252716 10.1097/JTO.0b013e318206a221 PMC4513953 Travis WD, Brambilla E, Noguchi M, Nicholson AG, Geisinger KR, Yatabe Y, Beer DG, Powell CA, Riely GJ, Van Schil PE, et al. International association for the study of lung cancer/American thoracic society/European respiratory society international multidisciplinary classification of lung adenocarcinoma. J Thorac Oncol. 2011;6(2):244–85. 21252716 10.1097/JTO.0b013e318206a221 PMC4513953 4. Murakami S Ito H Tsubokawa N Mimae T Sasada S Yoshiya T Miyata Y Yokose T Okada M Nakayama H Prognostic value of the new IASLC/ATS/ERS classification of clinical stage IA lung adenocarcinoma Lung Cancer 2015 90 2 199 204 26341957 10.1016/j.lungcan.2015.06.022 Murakami S, Ito H, Tsubokawa N, Mimae T, Sasada S, Yoshiya T, Miyata Y, Yokose T, Okada M, Nakayama H. Prognostic value of the new IASLC/ATS/ERS classification of clinical stage IA lung adenocarcinoma. Lung Cancer. 2015;90(2):199–204. 26341957 10.1016/j.lungcan.2015.06.022 5. Zhang Y Ma X Shen X Wang S Li Y Hu H Chen H Surgery for pre- and minimally invasive lung adenocarcinoma J Thorac Cardiovasc Surg 2022 163 2 456 64 33485660 10.1016/j.jtcvs.2020.11.151 Zhang Y, Ma X, Shen X, Wang S, Li Y, Hu H, Chen H. Surgery for pre- and minimally invasive lung adenocarcinoma. J Thorac Cardiovasc Surg. 2022;163(2):456–64. 33485660 10.1016/j.jtcvs.2020.11.151 6. Yoshiya T Mimae T Tsutani Y Tsubokawa N Sasada S Miyata Y Kushitani K Takeshima Y Murakami S Ito H Prognostic role of subtype classification in small-sized pathologic N0 invasive lung adenocarcinoma Ann Thorac Surg 2016 102 5 1668 73 27344277 10.1016/j.athoracsur.2016.04.087 Yoshiya T, Mimae T, Tsutani Y, Tsubokawa N, Sasada S, Miyata Y, Kushitani K, Takeshima Y, Murakami S, Ito H, et al. Prognostic role of subtype classification in small-sized pathologic N0 invasive lung adenocarcinoma. Ann Thorac Surg. 2016;102(5):1668–73. 27344277 10.1016/j.athoracsur.2016.04.087 7. Yanagawa N Shiono S Abiko M Ogata SY Sato T Tamura G New IASLC/ATS/ERS classification and invasive tumor size are predictive of disease recurrence in stage I lung adenocarcinoma J Thorac Oncol 2013 8 5 612 8 23584293 10.1097/JTO.0b013e318287c3eb Yanagawa N, Shiono S, Abiko M, Ogata SY, Sato T, Tamura G. New IASLC/ATS/ERS classification and invasive tumor size are predictive of disease recurrence in stage I lung adenocarcinoma. J Thorac Oncol. 2013;8(5):612–8. 23584293 10.1097/JTO.0b013e318287c3eb 8. Lengyel E Makowski L DiGiovanni J Kolonin MG Cancer as a matter of fat: the crosstalk between adipose tissue and tumors Trends Cancer 2018 4 5 374 84 29709261 10.1016/j.trecan.2018.03.004 PMC5932630 Lengyel E, Makowski L, DiGiovanni J, Kolonin MG. Cancer as a matter of fat: the crosstalk between adipose tissue and tumors. Trends Cancer. 2018;4(5):374–84. 29709261 10.1016/j.trecan.2018.03.004 PMC5932630 9. Quail DF Dannenberg AJ The obese adipose tissue microenvironment in cancer development and progression Nat Rev Endocrinol 2019 15 3 139 54 30459447 10.1038/s41574-018-0126-x PMC6374176 Quail DF, Dannenberg AJ. The obese adipose tissue microenvironment in cancer development and progression. Nat Rev Endocrinol. 2019;15(3):139–54. 30459447 10.1038/s41574-018-0126-x PMC6374176 10. Li B Sun S Li JJ Yuan JP Sun SR Wu Q Adipose tissue macrophages: implications for obesity-associated cancer Mil Med Res 2023 10 1 1 36593475 10.1186/s40779-022-00437-5 PMC9809128 Li B, Sun S, Li JJ, Yuan JP, Sun SR, Wu Q. Adipose tissue macrophages: implications for obesity-associated cancer. Mil Med Res. 2023;10(1): 1. 36593475 10.1186/s40779-022-00437-5 PMC9809128 11. Koenen M Hill MA Cohen P Sowers JR Obesity, adipose tissue and vascular dysfunction Circ Res 2021 128 7 951 68 33793327 10.1161/CIRCRESAHA.121.318093 PMC8026272 Koenen M, Hill MA, Cohen P, Sowers JR. Obesity, adipose tissue and vascular dysfunction. Circ Res. 2021;128(7):951–68. 33793327 10.1161/CIRCRESAHA.121.318093 PMC8026272 12. Bunnell BA Martin EC Matossian MD Brock CK Nguyen K Collins-Burow B Burow ME The effect of obesity on adipose-derived stromal cells and adipose tissue and their impact on cancer Cancer Metastasis Rev 2022 41 3 549 73 35999486 10.1007/s10555-022-10063-1 Bunnell BA, Martin EC, Matossian MD, Brock CK, Nguyen K, Collins-Burow B, Burow ME. The effect of obesity on adipose-derived stromal cells and adipose tissue and their impact on cancer. Cancer Metastasis Rev. 2022;41(3):549–73. 35999486 10.1007/s10555-022-10063-1 13. Moraes JA Encarnacao C Franco VA Xavier Botelho LG Rodrigues GP Ramos-Andrade I Barja-Fidalgo C Renovato-Martins M Adipose tissue-derived extracellular vesicles and the tumor microenvironment: revisiting the hallmarks of cancer Cancers (Basel) 2021 10.3390/cancers13133328 34283044 PMC8268128 Moraes JA, Encarnacao C, Franco VA, Xavier Botelho LG, Rodrigues GP, Ramos-Andrade I, Barja-Fidalgo C, Renovato-Martins M. Adipose tissue-derived extracellular vesicles and the tumor microenvironment: revisiting the hallmarks of cancer. Cancers (Basel). 2021. 10.3390/cancers13133328. 34283044 10.3390/cancers13133328 PMC8268128 14. Gillies RJ Kinahan PE Hricak H Radiomics: images are more than pictures, they are data Radiology 2016 278 2 563 77 26579733 10.1148/radiol.2015151169 PMC4734157 Gillies RJ, Kinahan PE, Hricak H. Radiomics: images are more than pictures, they are data. Radiology. 2016;278(2):563–77. 26579733 10.1148/radiol.2015151169 PMC4734157 15. Li X Zhang N Hu C Lin Y Li J Li Z Cui E Shi L Zhuang X Li J CT-based radiomics signature of visceral adipose tissue for prediction of disease progression in patients with crohn’s disease: a multicentre cohort study EClinicalMedicine 2023 56 101805 36618894 10.1016/j.eclinm.2022.101805 PMC9816914 Li X, Zhang N, Hu C, Lin Y, Li J, Li Z, Cui E, Shi L, Zhuang X, Li J, et al. CT-based radiomics signature of visceral adipose tissue for prediction of disease progression in patients with crohn’s disease: a multicentre cohort study. EClinicalMedicine. 2023;56: 101805. 36618894 10.1016/j.eclinm.2022.101805 PMC9816914 16. Kotanidis CP Antoniades C Perivascular fat imaging by computed tomography (CT): a virtual guide Br J Pharmacol 2021 178 21 4270 90 34296764 10.1111/bph.15634 PMC8856184 Kotanidis CP, Antoniades C. Perivascular fat imaging by computed tomography (CT): a virtual guide. Br J Pharmacol. 2021;178(21):4270–90. 34296764 10.1111/bph.15634 PMC8856184 17. Oikonomou EK Williams MC Kotanidis CP Desai MY Marwan M Antonopoulos AS Thomas KE Thomas S Akoumianakis I Fan LM A novel machine learning-derived radiotranscriptomic signature of perivascular fat improves cardiac risk prediction using coronary CT angiography Eur Heart J 2019 40 43 3529 43 31504423 10.1093/eurheartj/ehz592 PMC6855141 Oikonomou EK, Williams MC, Kotanidis CP, Desai MY, Marwan M, Antonopoulos AS, Thomas KE, Thomas S, Akoumianakis I, Fan LM, et al. A novel machine learning-derived radiotranscriptomic signature of perivascular fat improves cardiac risk prediction using coronary CT angiography. Eur Heart J. 2019;40(43):3529–43. 31504423 10.1093/eurheartj/ehz592 PMC6855141 18. Wu JM Li YP Wu DP Schoepf UM Zhao PM Goller MM Li JM Tian JM Shen MM Cao KP The role of epicardial fat radiomic profiles for atrial fibrillation identification and recurrence risk with coronary CT angiography Br J Radiol 2024 97 1154 341 52 38308034 10.1093/bjr/tqad046 Wu JM, Li YP, Wu DP, Schoepf UM, Zhao PM, Goller MM, Li JM, Tian JM, Shen MM, Cao KP, et al. The role of epicardial fat radiomic profiles for atrial fibrillation identification and recurrence risk with coronary CT angiography. Br J Radiol. 2024;97(1154):341–52. 38308034 10.1093/bjr/tqad046 19. Szabo L Salih A Pujadas ER Bard A McCracken C Ardissino M Antoniades C Vago H Maurovich-Horvat P Merkely B Radiomics of pericardial fat: a new frontier in heart failure discrimination and prediction Eur Radiol 2024 34 6 4113 26 37987834 10.1007/s00330-023-10311-0 PMC11166856 Szabo L, Salih A, Pujadas ER, Bard A, McCracken C, Ardissino M, Antoniades C, Vago H, Maurovich-Horvat P, Merkely B, et al. Radiomics of pericardial fat: a new frontier in heart failure discrimination and prediction. Eur Radiol. 2024;34(6):4113–26. 37987834 10.1007/s00330-023-10311-0 PMC11166856 20. Wang YW Wang JW Yang SX Qi LL Lin HL Zhou Z Yu YZ Proposing a deep learning-based method for improving the diagnostic certainty of pulmonary nodules in CT scan of chest Eur Radiol 2021 31 11 8160 7 33956178 10.1007/s00330-021-07919-5 Wang YW, Wang JW, Yang SX, Qi LL, Lin HL, Zhou Z, Yu YZ. Proposing a deep learning-based method for improving the diagnostic certainty of pulmonary nodules in CT scan of chest. Eur Radiol. 2021;31(11):8160–7. 33956178 10.1007/s00330-021-07919-5 21. de Margerie-Mellon C Chassagnon G Artificial intelligence: a critical review of applications for lung nodule and lung cancer Diagn Interv Imaging 2023 104 1 11 7 36513593 10.1016/j.diii.2022.11.007 de Margerie-Mellon C, Chassagnon G. Artificial intelligence: a critical review of applications for lung nodule and lung cancer. Diagn Interv Imaging. 2023;104(1):11–7. 36513593 10.1016/j.diii.2022.11.007 22. Heuvelmans MA van Ooijen PMA Ather S Silva CF Han D Heussel CP Hickes W Kauczor HU Novotny P Peschl H Lung cancer prediction by deep learning to identify benign lung nodules Lung Cancer 2021 154 1 4 33556604 10.1016/j.lungcan.2021.01.027 Heuvelmans MA, van Ooijen PMA, Ather S, Silva CF, Han D, Heussel CP, Hickes W, Kauczor HU, Novotny P, Peschl H, et al. Lung cancer prediction by deep learning to identify benign lung nodules. Lung Cancer. 2021;154:1–4. 33556604 10.1016/j.lungcan.2021.01.027 23. Yoo H Kim KH Singh R Digumarthy SR Kalra MK Validation of a deep learning algorithm for the detection of malignant pulmonary nodules in chest radiographs JAMA Netw Open 2020 3 9 e2017135 32970157 10.1001/jamanetworkopen.2020.17135 PMC7516603 Yoo H, Kim KH, Singh R, Digumarthy SR, Kalra MK. Validation of a deep learning algorithm for the detection of malignant pulmonary nodules in chest radiographs. JAMA Netw Open. 2020;3(9):e2017135. 32970157 10.1001/jamanetworkopen.2020.17135 PMC7516603 24. Jia QC Niu Y Xuan QF Miao SD Huang WJ Liu PP Liu L Xie HB Wang QJ Liu ZY Incorporating adipose tissue into a CT-based deep learning nomogram to differentiate granulomas from lung adenocarcinomas iScience 2024 27 10 110733 39474083 10.1016/j.isci.2024.110733 PMC11519438 Jia QC, Niu Y, Xuan QF, Miao SD, Huang WJ, Liu PP, Liu L, Xie HB, Wang QJ, Liu ZY, et al. Incorporating adipose tissue into a CT-based deep learning nomogram to differentiate granulomas from lung adenocarcinomas. iScience. 2024;27(10): 110733. 39474083 10.1016/j.isci.2024.110733 PMC11519438 25. Liang W Zhang L Jiang G Wang Q Liu L Liu D Wang Z Zhu Z Deng Q Xiong X Development and validation of a nomogram for predicting survival in patients with resected non-small-cell lung cancer J Clin Oncol 2015 33 8 861 9 25624438 10.1200/JCO.2014.56.6661 Liang W, Zhang L, Jiang G, Wang Q, Liu L, Liu D, Wang Z, Zhu Z, Deng Q, Xiong X, et al. Development and validation of a nomogram for predicting survival in patients with resected non-small-cell lung cancer. J Clin Oncol. 2015;33(8):861–9. 25624438 10.1200/JCO.2014.56.6661 26. Valentini V van Stiphout RG Lammering G Gambacorta MA Barba MC Bebenek M Bonnetain F Bosset JF Bujko K Cionini L Nomograms for predicting local recurrence, distant metastases, and overall survival for patients with locally advanced rectal cancer on the basis of European randomized clinical trials J Clin Oncol 2011 29 23 3163 72 21747092 10.1200/JCO.2010.33.1595 Valentini V, van Stiphout RG, Lammering G, Gambacorta MA, Barba MC, Bebenek M, Bonnetain F, Bosset JF, Bujko K, Cionini L, et al. Nomograms for predicting local recurrence, distant metastases, and overall survival for patients with locally advanced rectal cancer on the basis of European randomized clinical trials. J Clin Oncol. 2011;29(23):3163–72. 21747092 10.1200/JCO.2010.33.1595 27. Yap WK Shih MC Kuo C Pai PC Chou WC Chang KP Tsai MH Tsang NM Development and validation of a nomogram for assessing survival in patients with metastatic lung cancer referred for radiotherapy for bone metastases JAMA Netw Open 2018 1 6 e183242 30646236 10.1001/jamanetworkopen.2018.3242 PMC6324455 Yap WK, Shih MC, Kuo C, Pai PC, Chou WC, Chang KP, Tsai MH, Tsang NM. Development and validation of a nomogram for assessing survival in patients with metastatic lung cancer referred for radiotherapy for bone metastases. JAMA Netw Open. 2018;1(6):e183242. 30646236 10.1001/jamanetworkopen.2018.3242 PMC6324455 28. Lin CH Yan JL Yap WK Kang CJ Chang YC Tsai TY Chang KP Liao CT Hsu CL Chou WC Prognostic value of interim CT-based peritumoral and intratumoral radiomics in laryngeal and hypopharyngeal cancer patients undergoing definitive radiotherapy Radiother Oncol 2023 189 109938 37806562 10.1016/j.radonc.2023.109938 Lin CH, Yan JL, Yap WK, Kang CJ, Chang YC, Tsai TY, Chang KP, Liao CT, Hsu CL, Chou WC, et al. Prognostic value of interim CT-based peritumoral and intratumoral radiomics in laryngeal and hypopharyngeal cancer patients undergoing definitive radiotherapy. Radiother Oncol. 2023;189: 109938. 37806562 10.1016/j.radonc.2023.109938 29. Kwack WG Kang YS Jeong YJ Oh JY Cha YK Kim JS Yoon YS Association between thoracic fat measured using computed tomography and lung function in a population without respiratory diseases J Thorac Dis 2019 11 12 5300 9 32030247 10.21037/jtd.2019.11.54 PMC6988047 Kwack WG, Kang YS, Jeong YJ, Oh JY, Cha YK, Kim JS, Yoon YS. Association between thoracic fat measured using computed tomography and lung function in a population without respiratory diseases. J Thorac Dis. 2019;11(12):5300–9. 32030247 10.21037/jtd.2019.11.54 PMC6988047 30. Jia Q-c, Niu Y, Xuan Q-f, Miao S-d, Huang W-j, Liu P-p, Liu L, Xie H-b, Wang Q-j, Liu Z-y, et al. Incorporating adipose tissue into a CT-based deep learning nomogram to differentiate granulomas from lung adenocarcinomas. iScience. 2024. 10.1016/j.isci.2024.110733. 10.1016/j.isci.2024.110733 PMC11519438 39474083 31 Yap WK, Hsiao IT, Yap WL, Tsai TY, Lu YA, Yang CK, Peng MT, Su EL, Cheng SC. A radiotherapy dose map-guided deep learning method for predicting pathological complete response in esophageal cancer patients after neoadjuvant chemoradiotherapy followed by surgery. Biomedicines. 2023. 10.3390/biomedicines11113072. 10.3390/biomedicines11113072 PMC10669191 38002072 32. Qi H Xuan Q Liu P An Y Huang W Miao S Wang Q Liu Z Wang R Deep learning radiomics features of mediastinal fat and pulmonary nodules on lung CT images distinguish benignancy and malignancy Biomedicines 2024 10.3390/biomedicines12081865 39200329 PMC11352131 Qi H, Xuan Q, Liu P, An Y, Huang W, Miao S, Wang Q, Liu Z, Wang R. Deep learning radiomics features of mediastinal fat and pulmonary nodules on lung CT images distinguish benignancy and malignancy. Biomedicines. 2024. 10.3390/biomedicines12081865. 39200329 10.3390/biomedicines12081865 PMC11352131 33. Zhang Z Zhao X Gu J Chen X Wang H Zuo S Zuo M Wang J Spectral CT radiomics features of the tumor and perigastric adipose tissue can predict lymph node metastasis in gastric cancer Abdom Radiol 2025 50 8 3435 46 10.1007/s00261-025-04807-0 PMC12267316 39862285 Zhang Z, Zhao X, Gu J, Chen X, Wang H, Zuo S, Zuo M, Wang J. Spectral CT radiomics features of the tumor and perigastric adipose tissue can predict lymph node metastasis in gastric cancer. Abdom Radiol. 2025;50(8):3435–46. 10.1007/s00261-025-04807-0 PMC12267316 39862285 34. Lv YQ Dhlamini Q Chen C Li X Bellusci S Zhang JS FGF10 and lipofibroblasts in lung homeostasis and disease: insights gained from the adipocytes Front Cell Dev Biol 2021 9 645400 34124037 10.3389/fcell.2021.645400 PMC8189177 Lv YQ, Dhlamini Q, Chen C, Li X, Bellusci S, Zhang JS. FGF10 and lipofibroblasts in lung homeostasis and disease: insights gained from the adipocytes. Front Cell Dev Biol. 2021;9:645400. 34124037 10.3389/fcell.2021.645400 PMC8189177 35. Thijs W Alizadeh Dehnavi R Hiemstra PS de Roos A Melissant CF Janssen K Tamsma JT Rabe KF Association of lung function measurements and visceral fat in men with metabolic syndrome Respir Med 2014 108 2 351 7 24239315 10.1016/j.rmed.2013.10.003 Thijs W, Alizadeh Dehnavi R, Hiemstra PS, de Roos A, Melissant CF, Janssen K, Tamsma JT, Rabe KF. Association of lung function measurements and visceral fat in men with metabolic syndrome. Respir Med. 2014;108(2):351–7. 24239315 10.1016/j.rmed.2013.10.003 36. Elliot JG Donovan GM Wang KCW Green FHY James AL Noble PB Fatty airways: implications for obstructive disease Eur Respir J 2019 10.1183/13993003.00857-2019 31624112 Elliot JG, Donovan GM, Wang KCW, Green FHY, James AL, Noble PB. Fatty airways: implications for obstructive disease. Eur Respir J. 2019. 10.1183/13993003.00857-2019. 31624112 10.1183/13993003.00857-2019 37. Watanabe M Caruso D Tuccinardi D Risi R Zerunian M Polici M Pucciarelli F Tarallo M Strigari L Manfrini S Visceral fat shows the strongest association with the need of intensive care in patients with COVID-19 Metabolism 2020 111 154319 32712222 10.1016/j.metabol.2020.154319 PMC7377788 Watanabe M, Caruso D, Tuccinardi D, Risi R, Zerunian M, Polici M, Pucciarelli F, Tarallo M, Strigari L, Manfrini S, et al. Visceral fat shows the strongest association with the need of intensive care in patients with COVID-19. Metabolism. 2020;111:154319. 32712222 10.1016/j.metabol.2020.154319 PMC7377788 38. Seo BR Bhardwaj P Choi S Gonzalez J Andresen Eguiluz RC Wang K Mohanan S Morris PG Du B Zhou XK Obesity-dependent changes in interstitial ECM mechanics promote breast tumorigenesis Sci Transl Med 2015 7 301 301ra130 26290412 10.1126/scitranslmed.3010467 PMC4837896 Seo BR, Bhardwaj P, Choi S, Gonzalez J, Andresen Eguiluz RC, Wang K, Mohanan S, Morris PG, Du B, Zhou XK, et al. Obesity-dependent changes in interstitial ECM mechanics promote breast tumorigenesis. Sci Transl Med. 2015;7(301): 301ra130. 26290412 10.1126/scitranslmed.3010467 PMC4837896 39. Weisberg SP McCann D Desai M Rosenbaum M Leibel RL Ferrante AW Jr. Obesity is associated with macrophage accumulation in adipose tissue J Clin Invest 2003 112 12 1796 808 14679176 10.1172/JCI19246 PMC296995 Weisberg SP, McCann D, Desai M, Rosenbaum M, Leibel RL, Ferrante AW Jr. Obesity is associated with macrophage accumulation in adipose tissue. J Clin Invest. 2003;112(12):1796–808. 14679176 10.1172/JCI19246 PMC296995 40. Prieur X Mok CY Velagapudi VR Nunez V Fuentes L Montaner D Ishikawa K Camacho A Barbarroja N O’Rahilly S Differential lipid partitioning between adipocytes and tissue macrophages modulates macrophage lipotoxicity and M2/M1 polarization in obese mice Diabetes 2011 60 3 797 809 21266330 10.2337/db10-0705 PMC3046840 Prieur X, Mok CY, Velagapudi VR, Nunez V, Fuentes L, Montaner D, Ishikawa K, Camacho A, Barbarroja N, O’Rahilly S, et al. Differential lipid partitioning between adipocytes and tissue macrophages modulates macrophage lipotoxicity and M2/M1 polarization in obese mice. Diabetes. 2011;60(3):797–809. 21266330 10.2337/db10-0705 PMC3046840 41. Howe LR Subbaramaiah K Hudis CA Dannenberg AJ Molecular pathways: adipose inflammation as a mediator of obesity-associated cancer Clin Cancer Res 2013 19 22 6074 83 23958744 10.1158/1078-0432.CCR-12-2603 PMC3891839 Howe LR, Subbaramaiah K, Hudis CA, Dannenberg AJ. Molecular pathways: adipose inflammation as a mediator of obesity-associated cancer. Clin Cancer Res. 2013;19(22):6074–83. 23958744 10.1158/1078-0432.CCR-12-2603 PMC3891839 42. Zoico E Rizzatti V Darra E Budui SL Franceschetti G Vinante F Pedrazzani C Guglielmi A De Manzoni G Mazzali G Morphological and functional changes in the peritumoral adipose tissue of colorectal cancer patients Obesity 2017 25 Suppl 2 S87 94 29086519 10.1002/oby.22008 Zoico E, Rizzatti V, Darra E, Budui SL, Franceschetti G, Vinante F, Pedrazzani C, Guglielmi A, De Manzoni G, Mazzali G, et al. Morphological and functional changes in the peritumoral adipose tissue of colorectal cancer patients. Obesity. 2017;25(Suppl 2):S87-94. 29086519 10.1002/oby.22008 43. Seki T Yang Y Sun X Lim S Xie S Guo Z Xiong W Kuroda M Sakaue H Hosaka K Brown-fat-mediated tumour suppression by cold-altered global metabolism Nature 2022 608 7922 421 8 35922508 10.1038/s41586-022-05030-3 PMC9365697 Seki T, Yang Y, Sun X, Lim S, Xie S, Guo Z, Xiong W, Kuroda M, Sakaue H, Hosaka K, et al. Brown-fat-mediated tumour suppression by cold-altered global metabolism. Nature. 2022;608(7922):421–8. 35922508 10.1038/s41586-022-05030-3 PMC9365697 44. Wu G Woodruff HC Shen J Refaee T Sanduleanu S Ibrahim A Leijenaar RTH Wang R Xiong J Bian J Diagnosis of invasive lung adenocarcinoma based on chest CT radiomic features of part-solid pulmonary nodules: a multicenter study Radiology 2020 297 2 451 8 32840472 10.1148/radiol.2020192431 Wu G, Woodruff HC, Shen J, Refaee T, Sanduleanu S, Ibrahim A, Leijenaar RTH, Wang R, Xiong J, Bian J, et al. Diagnosis of invasive lung adenocarcinoma based on chest CT radiomic features of part-solid pulmonary nodules: a multicenter study. Radiology. 2020;297(2):451–8. 32840472 10.1148/radiol.2020192431 45. Neeland IJ Yokoo T Leinhard OD Lavie CJ 21st century advances in multimodality imaging of obesity for care of the cardiovascular patient JACC Cardiovasc Imaging 2021 14 2 482 94 32305476 10.1016/j.jcmg.2020.02.031 PMC7554055 Neeland IJ, Yokoo T, Leinhard OD, Lavie CJ. 21st century advances in multimodality imaging of obesity for care of the cardiovascular patient. JACC Cardiovasc Imaging. 2021;14(2):482–94. 32305476 10.1016/j.jcmg.2020.02.031 PMC7554055 46. Iacobellis G Epicardial fat links obesity to cardiovascular diseases Prog Cardiovasc Dis 2023 78 27 33 37105279 10.1016/j.pcad.2023.04.006 Iacobellis G. Epicardial fat links obesity to cardiovascular diseases. Prog Cardiovasc Dis. 2023;78:27–33. 37105279 10.1016/j.pcad.2023.04.006 ",
  "metadata": {
    "Title of this paper": "Epicardial fat links obesity to cardiovascular diseases",
    "Journal it was published in:": "BMC Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482856/"
  }
}