{
  "title": "Paper_1071",
  "abstract": "pmc Insights Imaging Insights Imaging 1720 insights Insights into Imaging 1869-4101 Springer PMC12474818 PMC12474818.1 12474818 12474818 41006794 10.1186/s13244-025-02097-0 2097 1 Original Article Intratumoral heterogeneity score enhances invasiveness prediction in pulmonary ground-glass nodules via stacking ensemble machine learning Zuo Zhichao 1 Zeng Ying 1 Deng Jinqiu 2 Lin Shanyue 3 Qi Wanyin 4 Fan Xiaohong fanxiaohong@zjnu.edu.cn 5 http://orcid.org/0000-0003-1596-8965 Feng Yujie fengyujie@smail.xtu.edu.cn 6 1 https://ror.org/02dx2xm20 grid.452911.a 0000 0004 1799 0637 Department of Radiology, Xiangtan Central Hospital, 2 https://ror.org/00xsfaz62 grid.412982.4 0000 0000 8633 7608 School of Mathematics and Computational Science, Xiangtan University, 3 https://ror.org/000prga03 grid.443385.d 0000 0004 1798 9548 Department of Radiology, Affiliated Hospital of Guilin Medical University, 4 https://ror.org/0014a0n68 grid.488387.8 Department of Radiology, The Affiliated Hospital of Southwest Medical University, 5 https://ror.org/01vevwk45 grid.453534.0 0000 0001 2219 2654 College of Mathematical Medicine, Zhejiang Normal University, 6 https://ror.org/01dzed356 grid.257160.7 0000 0004 1761 0331 College of Information and Intelligence, Hunan Agricultural University, 26 9 2025 12 2025 16 478243 209 23 4 2025 11 9 2025 26 09 2025 28 09 2025 29 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Objectives The preoperative differentiation of adenocarcinomas in situ, minimally invasive adenocarcinoma, and invasive adenocarcinoma using computed tomography (CT) is crucial for guiding clinical management decisions. However, accurately classifying ground-glass nodules poses a significant challenge. Incorporating quantitative intratumoral heterogeneity scores may improve the accuracy of this ternary classification. Materials and methods In this multicenter retrospective study, we developed ternary classification models by leveraging insights from both base and stacking ensemble machine learning models, incorporating intratumoral heterogeneity scores along with clinical-radiological features to distinguish adenocarcinomas in situ, minimally invasive adenocarcinoma, and invasive adenocarcinoma. The machine learning models were trained, and final model selection depended on maximizing the macro-average area under the curve (macro-AUC) in both the internal and external validation sets. Results Data from 802 patients from three centers were divided into a training set ( n n Conclusion The stacking classifier, recognized as the optimal algorithm for integrating the intratumoral heterogeneity score and clinical-radiological features, effectively served as a ternary classification model for assessing the invasiveness of lung adenocarcinoma in chest CT images. Critical relevance statement Our stacking classifier integrated intratumoral heterogeneity scores and clinical-radiological features to improve the ternary classification of lung adenocarcinoma invasiveness (adenocarcinomas in situ/minimally invasive adenocarcinoma/invasive adenocarcinoma), aiding in precise diagnosis and clinical decision-making for ground-glass nodules. Key Points  The intratumoral heterogeneity score effectively assessed the invasiveness of lung adenocarcinoma. The stacking classifier outperformed other methods for this ternary classification task. Intratumoral heterogeneity score, nodule size, nodule type, and age predict invasiveness. Graphical Abstract  Keywords Intratumoral heterogeneity score Stacking classifier Ternary classification model Ground-glass nodules Invasiveness pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © European Society of Radiology (ESR) 2025 Introduction Lung cancer is a leading cause of cancer-related mortality worldwide, with lung adenocarcinoma (LUAD) being the most prevalent histological subtype [ 1 2 3 4 5 7 Current challenges in predicting invasiveness primarily stem from overlapping CT features among pGGN subtypes. Traditional diagnostic methods that depend on nodule size or morphological characteristics (e.g., lobulation and spiculation) have demonstrated limited effectiveness [ 8 9 12 9 10 11 12 13 14 15 16 17 18 19 21 The intratumoral heterogeneity (ITH) score is an innovative quantitative imaging biomarker that provides a robust framework for assessing heterogeneity in pulmonary nodules through the computational analysis of CT-derived pixel patterns [ 22 25 22 25 In this study, we used both base and stacking ensemble machine learning techniques to integrate the ITH score and clinical-radiological features, thereby developing ternary classification models aimed at enhancing the preoperative prediction of invasiveness in LUADs presenting as GGNs [ 26 27 Materials and methods Patient enrollment This multicenter retrospective study was approved by the Institutional Review Boards of Xiangtan Central Hospital (No. 2021-07-009), Affiliated Hospital of Guilin Medical University (No. 2023YJSLL-121), and Affiliated Hospital of Southwest Medical University (No. KY2020147), in compliance with the Declaration of Helsinki. Owing to the retrospective design and anonymization of patient data, informed consent was waived for this study. Eligible participants were selected based on the following criteria: (1) histopathologically confirmed LUADs presenting as GGNs on preoperative thin-section CT scans (slice thickness ≤ 1.5 mm); (2) nodule diameters measuring 5–30 mm; and (3) no prior biopsy or chemoradiotherapy. The exclusion criteria were as follows: (1) suboptimal quality of imaging or pathological data, (2) a CT scan-to-surgery interval > 6 months, and (3) presence of multifocal primary lung cancers or lung metastatic disease. Overall, 802 eligible patients from three medical centers were enrolled. Among them, 682 consecutively recruited patients from centers 1 and 2 were randomly divided into training ( n n 1 CT radiological feature evaluation The CT acquisition protocols in this multicenter study adhered to the standardized parameters established in our previous investigation [ 24 Several radiological characteristics, including nodule size and type, location, margin, shape, and lobulation, spiculation, vascular convergence, vacuole, and pleural indentation signs, were assessed in accordance with the eighth edition of the Tumor, Node, Metastasis (TNM) classification for lung cancer [ 28 1 ITH score calculation Following the completion of lung nodule segmentation (Supplementary Material 2 Referring to previous reports [ 22 25 22 https://pypi.org/project/ITHscore 22 25 1 1 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${{\\rm{I}}}{{\\rm{T}}}{{\\rm{H}}}\\,{{\\rm{s}}}{{\\rm{c}}}{{\\rm{o}}}{{\\rm{r}}}{{\\rm{e}}}=1-\\frac{1}{{S}_{{{\\rm{t}}}{{\\rm{o}}}{{\\rm{t}}}{{\\rm{a}}}{{\\rm{l}}}}}\\sum \\limits_{{{\\rm{i}}}=1}^{{{\\rm{V}}}}\\frac{{S}_{1},max}{{n}_{{{\\rm{i}}}}}$$\\end{document} I T H s c o r e = 1 − 1 S t o t a l ∑ i = 1 V S 1 , m a x n i V V 5 S total n i i S i, i Ternary classification models based on ensemble stacking classifier To predict the invasiveness of LUADs manifesting as GGNs, the inputs for the ternary classification model included the ITH score; clinical variables, such as age and sex; and CT radiological features. The detailed framework, illustrated in Fig. 1 26 27 29 31 Fig. 1 Schematic representation of the stacking classifier architecture Radiomics analysis Radiomic analysis follows a structured pipeline comprising three main phases: feature extraction, dimensionality optimization, and predictive modeling [ 21 32 3 Model selection protocol Base and ensemble machine learning models were developed using the training set. The performance of these models was quantitatively evaluated, with the macro-average receiver operating characteristic (ROC) curve and area under the curve (macro-AUC) serving as the primary evaluation metrics. The macro-AUC metric assesses the performance of each label independently and averages the scores across all labels. Secondary validation metrics included diagnostic accuracy, precision, recall, and F1-score, which were used to assess classification consistency. The final model was selected based on maximizing macro-AUC stability and achieving a value > 0.75 across both internal test and external validation sets [ 33 Model interpretation using the SHapley Additive exPlanation (SHAP) framework We used SHAP to quantify feature contributions and uncover nonlinear relationships among the ITH scores, clinical-radiological features, and invasiveness predictions in GGNs associated with LUADs to enhance the clinical interpretability of our ensemble models. This approach aligns with the recent methodological advancements in explainable machine learning for medical imaging biomarkers [ 23 34 4 Statistical analysis All statistical analyses and modeling were performed using R (version 3.6.3; R Foundation for Statistical Computing) and Python (version 3.11.0; Python Software Foundation). A detailed protocol is provided in Supplementary Material 5 Results Patient characteristics The training set included 477 patients, 90 (18.9%) of whom were diagnosed with AIS; 163 (34.2%), with MIA; and 224 (46.9%), with IAC. The internal validation set comprised 205 patients, of whom 41 (20.0%) were diagnosed with AIS; 65 (31.7%), with MIA; and 99 (48.3%), with IAC. The external validation set comprised 120 patients, of whom 30 (25.0%) were diagnosed with AIS; 38 (31.7%), with MIA; and 52 (43.3%), with IAC. Detailed characteristics of the enrolled patients are presented in Table 1 p 1 Table 1 Comparative analysis of clinical-radiological characteristics across training, internal test, and external validation sets Variables Total ( n Training set ( n Internal test set ( n External validation set ( n p Sex, n 0.601 Female 559 (69.7) 334 (70) 138 (67.3) 87 (72.5) Male 243 (30.3) 143 (30) 67 (32.7) 33 (27.5) Age (y), Median (Q1, Q3) 57 (49, 65) 57 (50, 65) 56 (48, 66) 57.5 (49, 66) 0.62 Nodule size (mm), Median (Q1, Q3) 15.3 (10.8, 20.6) 15.8 (11.2, 21.1) 14.4 (10.8, 20) 14.8 (11.1, 19.6) 0.176 Nodule type, n 0.562 pGGN 538 (67.1) 314 (65.8) 139 (67.8) 85 (70.8) PSN 264 (32.9) 163 (34.2) 66 (32.2) 35 (29.2) Location, n 0.198 RUL 290 (36.2) 177 (37.1) 75 (36.6) 38 (31.7) RML 129 (16.1) 70 (14.7) 33 (16.1) 26 (21.7) RLL 52 (6.5) 24 (5) 18 (8.8) 10 (8.3) LUL 223 (27.8) 145 (30.4) 48 (23.4) 30 (25) LLL 108 (13.5) 61 (12.8) 31 (15.1) 16 (13.3) Margin, n 0.071 Well-defined 595 (74.2) 340 (71.3) 162 (79) 93 (77.5) Ill-defined 207 (25.8) 137 (28.7) 43 (21) 27 (22.5) Shape, n 0.229 Regular 473 (59) 270 (56.6) 130 (63.4) 73 (60.8) Irregular 329 (41) 207 (43.4) 75 (36.6) 47 (39.2) Lobulation sign, n 0.656 Absent 426 (53.1) 247 (51.8) 113 (55.1) 66 (55) Present 376 (46.9) 230 (48.2) 92 (44.9) 54 (45) Spiculation sign, n 0.262 Absent 501 (62.5) 294 (61.6) 137 (66.8) 70 (58.3) Present 301 (37.5) 183 (38.4) 68 (33.2) 50 (41.7) Vascular convergence sign, n 0.107 Absent 182 (22.7) 96 (20.1) 55 (26.8) 31 (25.8) Present 620 (77.3) 381 (79.9) 150 (73.2) 89 (74.2) Vacuole sign, n 0.412 Absent 661 (82.4) 389 (81.6) 168 (82) 104 (86.7) Present 141 (17.6) 88 (18.4) 37 (18) 16 (13.3) Pleural indentation sign, n 0.082 Absent 399 (49.8) 229 (48) 99 (48.3) 71 (59.2) Present 403 (50.2) 248 (52) 106 (51.7) 49 (40.8) Label, n 0.633 AIS 161 (20) 90 (18.9) 41 (20) 30 (25) MIA 266 (33.2) 163 (34.2) 65 (31.7) 38 (31.7) IAC 375 (46.8) 224 (46.9) 99 (48.3) 52 (43.3)  pGGN PSN AIS MIA IAC RUL RLL RML LUL LLL ITH score variability across AIS, MIA, and IAC Representative visualizations of the ITH scores for the postoperative diagnoses of AIS, MIA, and IAC are shown in Supplementary Fig. 2 2a–c p p Fig. 2 Comparative analysis of intratumoral heterogeneity scores among adenocarcinoma in situ, minimally invasive adenocarcinoma, and invasive adenocarcinoma across the training ( a b c Diagnostic performance We used the ITH score along with clinical-radiological features as input variables for both base and ensemble machine learning models to predict the invasiveness of LUADs presenting as GGNs in our ternary classification task. Table 2 3a, b 3 Fig. 3 Receiver operating characteristic curve for the stacking classifier’s ternary classification, depicted in the internal test ( a b Table 2 Assessment of diagnostic efficacy across diverse machine learning approaches Model Accuracy Recall Precision F1-score Macro-AUC Internal test set RF 0.6146 0.6146 0.5991 0.5931 0.7785 XGB 0.6000 0.6000 0.5904 0.5925 0.7705 LGBM 0.5805 0.5805 0.5611 0.5685 0.7605 GBM 0.5756 0.5756 0.5585 0.5639 0.7557 AdaBoost 0.5366 0.5366 0.5293 0.5317 0.7320 CatBoost 0.6195 0.6195 0.6000 0.6058 0.7760 Stacking classifier 0.6244 0.6244 0.5146 0.5619 0.7850 External validation set RF 0.5750 0.5750 0.5509 0.5516 0.7616 XGB 0.5667 0.5667 0.5708 0.5547 0.7272 LGBM 0.5500 0.5500 0.5522 0.5395 0.7293 GBM 0.5833 0.5833 0.5750 0.5545 0.7468 AdaBoost 0.5167 0.5167 0.4863 0.4948 0.7076 CatBoost 0.5833 0.5833 0.5775 0.5761 0.7679 Stacking classifier 0.5750 0.5750 0.4458 0.4995 0.7717 The bold values indicate the highest Macro-AUC achieved among all machine learning models, both on the Internal Test Set and the External Validation Set. Specifically, the Stacking classifier attained the highest Macro-AUC of 0.7850 internally and 0.7717 externally, highlighting its superior overall diagnostic performance. AUC GBDT AdaBoost XGBoost LightGBM CatBoost RF Figure 4a, b Fig. 4 Confusion matrix for the stacking classifier’s binary classification, depicted in the internal test ( a b Subgroup analysis revealed notable differences in the diagnostic performance of the stacking classifier between the pGGN and PSN subtypes (Supplementary Figs. 4 5 6 Model interpretation Figure 5 Fig. 5 Comprehensive elucidation of the stacking classifier through SHapley Additive exPlanation values, illustrated via a bar graph and a detailed rose plot view The four most influential features—ITH score, nodule size, nodule type, and age—consistently exhibited significantly higher contribution values than the other variables did in the SHAP-based feature subset identification (Fig. 6 Fig. 6 Assessment of the contributions of various features to the model’s predictive performance, accompanied by their respective macro-area under the curve scores Comparing the performance of the stacking classifier, radiomics model, and ITH score The radiomics model (Supplementary Fig. 6 3 7 7 Table 3 Comparative evaluation of diagnostic performance among stacking classifier, ITH score, and radiomics model in internal and external validation sets Model Accuracy Recall Precision F1-score Macro-AUC Internal test set Stacking classifier 0.6244 0.6244 0.5146 0.5619 0.7850 Radiomics model 0.4829 0.4829 0.4781 0.4372 0.6515 ITH score 0.6098 0.4931 0.4000 0.4416 0.7435 External validation set Stacking classifier 0.5750 0.5750 0.4458 0.4995 0.7717 Radiomics model 0.4167 0.4167 0.3345 0.3457 0.6161 ITH score 0.5417 0.4615 0.5132 0.4075 0.7116 AUC ITH Discussion We implemented both base and ensemble machine learning models to integrate clinical-radiological features with the ITH score. The stacking classifier demonstrated the highest predictive performance for the ternary classification model. Additionally, three binary classification models were developed: the stacking classifier exhibited superior performance in predicting IAC, moderate performance in predicting AIS, and the lowest performance in predicting MIA. The ITH score outperformed the traditional radiomics models in ternary classification tasks, whereas the stacking classifier surpassed both methods for the same classification tasks, aligning with the findings of prior research [ 22 25 Although radiomics models excel at extracting quantitative imaging features, they often assume uniform tumor heterogeneity, overlooking localized morphological and textural variations that may indicate invasive potential [ 9 10 22 25 The stacking classifier integrates features from various base models and utilizes a trainable meta-model, such as logistic regression, to capture nonlinear interactions. This enhances interpretability and robustness by leveraging the strengths of multiple base models while mitigating their weaknesses, thereby providing a solid foundation for the integration of multimodal biomarkers [ 29 31 35 The stacking-classifier-based ternary classification framework was decomposed into three binary models, precisely stratifying the performance levels. Similar to the stacking classifier results, the subgroup analysis of pGGNs revealed superior discriminative capacity in predicting IAC, moderate efficacy in identifying AIS, and diminished effectiveness in classifying MIA, mirroring the biological continuum of tumor aggressiveness. High model confidence correlates strongly with histopathologically confirmed invasiveness in IAC, whereas low-risk predictions align with indolent AIS phenotypes. The model’s diagnostic limitations for MIA stem from inherent biological ambiguity, as intermediate pathological characteristics (lepidic growth with invasion ≤ 5 mm) create an overlapping feature space that complicates binary classification [ 28 In this study, the SHAP-based interpretability analysis identified four dominant features with significantly high SHAP values: ITH score, nodule size, nodule type, and age. The ITH score has emerged as the most influential predictor, underscoring its established role in quantifying tumor heterogeneity—a critical biomarker reflecting biological processes, such as dysregulated angiogenesis and heterogeneous cellular proliferation. Nodule size reflects an infiltrative invasive growth pattern according to the eighth edition of the TNM classification for lung cancer [ 28 36 37 36 37 This study has some limitations. First, the retrospective multicenter design introduced heterogeneity in CT acquisition protocols due to variations in scanner manufacturers across institutions, affecting texture feature extraction and model generalizability. Second, although the stacked ensemble architecture demonstrated valuable diagnostic utility for preoperatively stratifying GGN pulmonary nodules, its implementation requires segregated training datasets for each hierarchical layer and substantial computational resources for multi-algorithm integration, thereby increasing the computational demands and algorithmic complexity. Third, the exclusive focus on surgically resected specimens introduced spectrum bias, as non-operatively managed cases (which may represent indolent phenotypes) were systematically excluded. Finally, the absence of longitudinal postoperative surveillance data limited the assessment of prognostic model validity regarding clinical outcomes beyond histopathological classifications. Conclusion A stacking-classifier-based ternary classification framework significantly enhanced the preoperative invasive assessment of GGNs by integrating multiple data streams. Incorporating parameters such as ITH score, nodule size, nodule type, and age provides valuable insights into clinical-radiological characteristics and tumor heterogeneity. This study may revolutionize clinical decision-making, as this approach may facilitate the development of personalized management strategies for early-stage lung cancer, addressing critical unmet needs in precision oncology. Supplementary information  ELECTRONIC SUPPLEMENTARY MATERIAL Abbreviations AIS Adenocarcinoma in situ AUC Area under the curve CT Computed tomography GGN Ground-glass nodule ITH Intratumoral heterogeneity IAC Invasive adenocarcinoma LUAD Lung adenocarcinoma MIA Minimally invasive adenocarcinoma PSN Part-solid nodule pGGN Pure ground-glass nodule ROC Receiver operating characteristic SHAP Shapley Additive Explanation Publisher’s Note Zhichao Zuo, Ying Zeng and Jinqiu Deng contributed equally to this work. Supplementary information The online version contains supplementary material available at 10.1186/s13244-025-02097-0. Acknowledgements We express our gratitude to Editage ( https://app.editage.cn/ Author contributions Yujie Feng and Xiaohong Fan were responsible for the conceptualization and design of the study. Shanyue Lin and Wanyin Qi contributed to data collection and analysis. Yujie Feng and Xiaohong Fan provided critical revisions and gave final approval for the manuscript. All authors have read and approved the final version of the manuscript. Funding The authors state that this work has not received any funding. Data availability The data that support the findings of this study are available from the corresponding author upon reasonable request. Declarations Ethics approval and consent to participate This multicenter retrospective study received approval from the institutional review boards of Xiangtan Central Hospital (No. 2021-07-009), the Affiliated Hospital of Guilin Medical University (No. 2023YJSLL-121), and the Affiliated Hospital of Southwest Medical University (No. KY2020147) in compliance with the Declaration of Helsinki (2013 revision). Consent for publication Due to the retrospective design and the anonymization of patient data, informed consent was waived for this study. Competing interests The authors declare that they have no competing interests. References 1. Zhang C Zhang J Xu FP Genomic landscape and immune microenvironment features of preinvasive and early invasive lung adenocarcinoma J Thorac Oncol 2019 14 1912 1923 10.1016/j.jtho.2019.07.031 31446140 PMC6986039 Zhang C, Zhang J, Xu FP et al (2019) Genomic landscape and immune microenvironment features of preinvasive and early invasive lung adenocarcinoma. J Thorac Oncol 14:1912–1923 31446140 10.1016/j.jtho.2019.07.031 PMC6986039 2. Hattori A Matsunaga T Hayashi T Takamochi K Oh S Suzuki K Prognostic impact of the findings on thin-section computed tomography in patients with subcentimeter non-small cell lung cancer J Thorac Oncol 2017 12 954 962 10.1016/j.jtho.2017.02.015 28257958 Hattori A, Matsunaga T, Hayashi T, Takamochi K, Oh S, Suzuki K (2017) Prognostic impact of the findings on thin-section computed tomography in patients with subcentimeter non-small cell lung cancer. J Thorac Oncol 12:954–962 28257958 10.1016/j.jtho.2017.02.015 3. Zuo Z Zeng W Peng K Development of a novel combined nomogram integrating deep-learning-assisted CT texture and clinical-radiological features to predict the invasiveness of clinical stage IA part-solid lung adenocarcinoma: a multicentre study Clin Radiol 2023 78 e698 e706 10.1016/j.crad.2023.07.002 37487842 Zuo Z, Zeng W, Peng K et al (2023) Development of a novel combined nomogram integrating deep-learning-assisted CT texture and clinical-radiological features to predict the invasiveness of clinical stage IA part-solid lung adenocarcinoma: a multicentre study. Clin Radiol 78:e698–e706 37487842 10.1016/j.crad.2023.07.002 4. Woo W Kang DY Cha YJ Histopathologic fate of resected pulmonary pure ground glass nodule: a systematic review and meta-analysis J Thorac Dis 2024 16 924 934 10.21037/jtd-23-1089 38505083 PMC10944737 Woo W, Kang DY, Cha YJ et al (2024) Histopathologic fate of resected pulmonary pure ground glass nodule: a systematic review and meta-analysis. J Thorac Dis 16:924–934 38505083 10.21037/jtd-23-1089 PMC10944737 5. Saji H Okada M Tsuboi M Segmentectomy versus lobectomy in small-sized peripheral non-small-cell lung cancer (JCOG0802/WJOG4607L): a multicentre, open-label, phase 3, randomised, controlled, non-inferiority trial Lancet 2022 399 1607 1617 10.1016/S0140-6736(21)02333-3 35461558 Saji H, Okada M, Tsuboi M et al (2022) Segmentectomy versus lobectomy in small-sized peripheral non-small-cell lung cancer (JCOG0802/WJOG4607L): a multicentre, open-label, phase 3, randomised, controlled, non-inferiority trial. Lancet 399:1607–1617 35461558 10.1016/S0140-6736(21)02333-3 6. Dai C Shen J Ren Y Choice of surgical procedure for patients with non-small-cell lung cancer ≤ 1 cm or > 1 to 2 cm among lobectomy, segmentectomy, and wedge resection: a population-based study J Clin Oncol 2016 34 3175 3182 10.1200/JCO.2015.64.6729 27382092 Dai C, Shen J, Ren Y et al (2016) Choice of surgical procedure for patients with non-small-cell lung cancer ≤ 1 cm or > 1 to 2 cm among lobectomy, segmentectomy, and wedge resection: a population-based study. J Clin Oncol 34:3175–3182 27382092 10.1200/JCO.2015.64.6729 7. Altorki N Wang X Kozono D Lobar or sublobar resection for peripheral stage IA non-small-cell lung cancer N Engl J Med 2023 388 489 498 10.1056/NEJMoa2212083 36780674 PMC10036605 Altorki N, Wang X, Kozono D et al (2023) Lobar or sublobar resection for peripheral stage IA non-small-cell lung cancer. N Engl J Med 388:489–498 36780674 10.1056/NEJMoa2212083 PMC10036605 8. Hoye J Solomon J Sauer TJ Robins M Samei E Systematic analysis of bias and variability of morphologic features for lung lesions in computed tomography J Med Imaging (Bellingham 2019 6 013504 30944842 10.1117/1.JMI.6.1.013504 PMC6434334 Hoye J, Solomon J, Sauer TJ, Robins M, Samei E (2019) Systematic analysis of bias and variability of morphologic features for lung lesions in computed tomography. J Med Imaging (Bellingham 6:013504 30944842 10.1117/1.JMI.6.1.013504 PMC6434334 9. Gillies RJ Kinahan PE Hricak H Radiomics: images are more than pictures, they are data Radiology 2016 278 563 577 10.1148/radiol.2015151169 26579733 PMC4734157 Gillies RJ, Kinahan PE, Hricak H (2016) Radiomics: images are more than pictures, they are data. Radiology 278:563–577 26579733 10.1148/radiol.2015151169 PMC4734157 10. Zuo Z Deng J Ge W Quantifying intratumoral heterogeneity within sub-regions to predict high-grade patterns in clinical stage I solid lung adenocarcinoma BMC Cancer 2025 25 51 10.1186/s12885-025-13445-0 39789523 PMC11720805 Zuo Z, Deng J, Ge W et al (2025) Quantifying intratumoral heterogeneity within sub-regions to predict high-grade patterns in clinical stage I solid lung adenocarcinoma. BMC Cancer 25:51 39789523 10.1186/s12885-025-13445-0 PMC11720805 11. Gong J Liu J Hao W A deep residual learning network for predicting lung adenocarcinoma manifesting as ground-glass nodule on CT images Eur Radiol 2020 30 1847 1855 10.1007/s00330-019-06533-w 31811427 Gong J, Liu J, Hao W et al (2020) A deep residual learning network for predicting lung adenocarcinoma manifesting as ground-glass nodule on CT images. Eur Radiol 30:1847–1855 31811427 10.1007/s00330-019-06533-w 12. Ni Y Yang Y Zheng D Xie Z Huang H Wang W The invasiveness classification of ground-glass nodules using 3D attention network and HRCT J Digit Imaging 2020 33 1144 1154 10.1007/s10278-020-00355-9 32705434 PMC7649842 Ni Y, Yang Y, Zheng D, Xie Z, Huang H, Wang W (2020) The invasiveness classification of ground-glass nodules using 3D attention network and HRCT. J Digit Imaging 33:1144–1154 32705434 10.1007/s10278-020-00355-9 PMC7649842 13. Landreneau RJ Normolle DP Christie NA Recurrence and survival outcomes after anatomic segmentectomy versus lobectomy for clinical stage I non-small-cell lung cancer: a propensity-matched analysis J Clin Oncol 2014 32 2449 2455 10.1200/JCO.2013.50.8762 24982447 PMC4121502 Landreneau RJ, Normolle DP, Christie NA et al (2014) Recurrence and survival outcomes after anatomic segmentectomy versus lobectomy for clinical stage I non-small-cell lung cancer: a propensity-matched analysis. J Clin Oncol 32:2449–2455 24982447 10.1200/JCO.2013.50.8762 PMC4121502 14. Yotsukura M Asamura H Motoi N Long-term prognosis of patients with resected adenocarcinoma in situ and minimally invasive adenocarcinoma of the lung J Thorac Oncol 2021 16 1312 1320 10.1016/j.jtho.2021.04.007 33915249 Yotsukura M, Asamura H, Motoi N et al (2021) Long-term prognosis of patients with resected adenocarcinoma in situ and minimally invasive adenocarcinoma of the lung. J Thorac Oncol 16:1312–1320 33915249 10.1016/j.jtho.2021.04.007 15. Ding H Xia W Zhang L CT-based deep learning model for invasiveness classification and micropapillary pattern prediction within lung adenocarcinoma Front Oncol 2020 10 1186 10.3389/fonc.2020.01186 32775302 PMC7388896 Ding H, Xia W, Zhang L et al (2020) CT-based deep learning model for invasiveness classification and micropapillary pattern prediction within lung adenocarcinoma. Front Oncol 10:1186 32775302 10.3389/fonc.2020.01186 PMC7388896 16. Zuo Z Wang P Zeng W Qi W Zhang W Measuring pure ground-glass nodules on computed tomography: assessing agreement between a commercially available deep learning algorithm and radiologists’ readings Acta Radiol 2023 64 1422 1430 10.1177/02841851221135406 36317301 Zuo Z, Wang P, Zeng W, Qi W, Zhang W (2023) Measuring pure ground-glass nodules on computed tomography: assessing agreement between a commercially available deep learning algorithm and radiologists’ readings. Acta Radiol 64:1422–1430 36317301 10.1177/02841851221135406 17. Xu Y Li Y Yin H Tang W Fan G Consecutive serial non-contrast CT scan-based deep learning model facilitates the prediction of tumor invasiveness of ground-glass nodules Front Oncol 2021 11 725599 10.3389/fonc.2021.725599 34568054 PMC8461974 Xu Y, Li Y, Yin H, Tang W, Fan G (2021) Consecutive serial non-contrast CT scan-based deep learning model facilitates the prediction of tumor invasiveness of ground-glass nodules. Front Oncol 11:725599 34568054 10.3389/fonc.2021.725599 PMC8461974 18. Wang J Chen X Lu H Feature-shared adaptive-boost deep learning for invasiveness classification of pulmonary subsolid nodules in CT images Med Phys 2020 47 1738 1749 10.1002/mp.14068 32020649 Wang J, Chen X, Lu H et al (2020) Feature-shared adaptive-boost deep learning for invasiveness classification of pulmonary subsolid nodules in CT images. Med Phys 47:1738–1749 32020649 10.1002/mp.14068 19. Zhao W Yang J Sun Y 3D deep learning from CT scans predicts tumor invasiveness of subcentimeter pulmonary adenocarcinomas Cancer Res 2018 78 6881 6889 10.1158/0008-5472.CAN-18-0696 30279243 Zhao W, Yang J, Sun Y et al (2018) 3D deep learning from CT scans predicts tumor invasiveness of subcentimeter pulmonary adenocarcinomas. Cancer Res 78:6881–6889 30279243 10.1158/0008-5472.CAN-18-0696 20. Yanagawa M Niioka H Hata A Application of deep learning (3-dimensional convolutional neural network) for the prediction of pathological invasiveness in lung adenocarcinoma: a preliminary study Medicine (Baltimore) 2019 98 e16119 10.1097/MD.0000000000016119 31232960 PMC6636940 Yanagawa M, Niioka H, Hata A et al (2019) Application of deep learning (3-dimensional convolutional neural network) for the prediction of pathological invasiveness in lung adenocarcinoma: a preliminary study. Medicine (Baltimore) 98:e16119 31232960 10.1097/MD.0000000000016119 PMC6636940 21. Pan Z Hu G Zhu Z Predicting invasiveness of lung adenocarcinoma at chest CT with deep learning ternary classification models Radiology 2024 311 e232057 10.1148/radiol.232057 38591974 Pan Z, Hu G, Zhu Z et al (2024) Predicting invasiveness of lung adenocarcinoma at chest CT with deep learning ternary classification models. Radiology 311: e232057 38591974 10.1148/radiol.232057 22. Li J Qiu Z Zhang C ITHscore: comprehensive quantification of intra-tumor heterogeneity in NSCLC by multi-scale radiomic features Eur Radiol 2023 33 893 903 10.1007/s00330-022-09055-0 36001124 Li J, Qiu Z, Zhang C et al (2023) ITHscore: comprehensive quantification of intra-tumor heterogeneity in NSCLC by multi-scale radiomic features. Eur Radiol 33:893–903 36001124 10.1007/s00330-022-09055-0 23. Zheng H Chen W Qi W Liu H Zuo Z Enhancing the prediction of the invasiveness of pulmonary adenocarcinomas presenting as pure ground-glass nodules: integrating intratumor heterogeneity score with clinical-radiological features via machine learning in a multicenter study Digit Health 2024 10 20552076241289181 10.1177/20552076241289181 39381817 PMC11459516 Zheng H, Chen W, Qi W, Liu H, Zuo Z (2024) Enhancing the prediction of the invasiveness of pulmonary adenocarcinomas presenting as pure ground-glass nodules: integrating intratumor heterogeneity score with clinical-radiological features via machine learning in a multicenter study. Digit Health 10:20552076241289181 39381817 10.1177/20552076241289181 PMC11459516 24. Qi H Zuo Z Lin S Assessment of intratumor heterogeneity for preoperatively predicting the invasiveness of pulmonary adenocarcinomas manifesting as pure ground-glass nodules Quant Imaging Med Surg 2025 15 272 286 10.21037/qims-24-734 39839051 PMC11744125 Qi H, Zuo Z, Lin S et al (2025) Assessment of intratumor heterogeneity for preoperatively predicting the invasiveness of pulmonary adenocarcinomas manifesting as pure ground-glass nodules. Quant Imaging Med Surg 15:272–286 39839051 10.21037/qims-24-734 PMC11744125 25. Zhang J Sha J Liu W Zhou Y Liu H Zuo Z Quantification of intratumoral heterogeneity: distinguishing histological subtypes in clinical T1 stage lung adenocarcinoma presenting as pure ground-glass nodules on computed tomography Acad Radiol 2024 31 4244 4255 10.1016/j.acra.2024.04.008 38627129 Zhang J, Sha J, Liu W, Zhou Y, Liu H, Zuo Z (2024) Quantification of intratumoral heterogeneity: distinguishing histological subtypes in clinical T1 stage lung adenocarcinoma presenting as pure ground-glass nodules on computed tomography. Acad Radiol 31:4244–4255 38627129 10.1016/j.acra.2024.04.008 26. Ren Y Zhang L Suganthan PN Ensemble classification and regression - recent developments, applications and future directions IEEE Comput Intell Mag 2016 11 41 53 10.1109/MCI.2015.2471235 Ren Y, Zhang L, Suganthan PN (2016) Ensemble classification and regression - recent developments, applications and future directions. IEEE Comput Intell Mag 11:41–53 27. Zhang M Zheng Y Maidaiti X Liang B Wei Y Sun F Integrating machine learning into statistical methods in disease risk prediction modeling: a systematic review Health Data Sci 2024 4 0165 10.34133/hds.0165 39050273 PMC11266123 Zhang M, Zheng Y, Maidaiti X, Liang B, Wei Y, Sun F (2024) Integrating machine learning into statistical methods in disease risk prediction modeling: a systematic review. Health Data Sci 4:0165 39050273 10.34133/hds.0165 PMC11266123 28. Minato H Katayanagi K Kurumaya H Verification of the eighth edition of the UICC-TNM classification on surgically resected lung adenocarcinoma: Comparison with previous classification in a local center Cancer Rep 2022 5 e1422 10.1002/cnr2.1422 PMC8789611 34169671 Minato H, Katayanagi K, Kurumaya H et al (2022) Verification of the eighth edition of the UICC-TNM classification on surgically resected lung adenocarcinoma: Comparison with previous classification in a local center. Cancer Rep 5:e1422 10.1002/cnr2.1422 PMC8789611 34169671 29. Zhong J Zeng X Cao W Semisupervised multiple choice learning for ensemble classification IEEE Trans Cybern 2022 52 3658 3668 10.1109/TCYB.2020.3016048 32924945 Zhong J, Zeng X, Cao W et al (2022) Semisupervised multiple choice learning for ensemble classification. IEEE Trans Cybern 52:3658–3668 32924945 10.1109/TCYB.2020.3016048 30. Ling T Zuo Z Huang M Ma J Wu L Stacking classifiers based on integrated machine learning model: fusion of CT radiomics and clinical biomarkers to predict lymph node metastasis in locally advanced gastric cancer patients after neoadjuvant chemotherapy BMC Cancer 2025 25 834 10.1186/s12885-025-14259-w 40329193 PMC12057267 Ling T, Zuo Z, Huang M, Ma J, Wu L (2025) Stacking classifiers based on integrated machine learning model: fusion of CT radiomics and clinical biomarkers to predict lymph node metastasis in locally advanced gastric cancer patients after neoadjuvant chemotherapy. BMC Cancer 25:834 40329193 10.1186/s12885-025-14259-w PMC12057267 31. Mahajan P, Uddin S, Hajati F, Moni MA (2023) Ensemble learning for disease prediction: a review. Healthcare 11:1808 10.3390/healthcare11121808 PMC10298658 37372925 32. Karthik KV Rajalingam A Shivashankar M Ganjiwale A Recursive feature elimination-based biomarker identification for open neural tube defects Curr Genomics 2022 23 195 206 10.2174/1389202923666220511162038 36777008 PMC9878829 Karthik KV, Rajalingam A, Shivashankar M, Ganjiwale A (2022) Recursive feature elimination-based biomarker identification for open neural tube defects. Curr Genomics 23:195–206 36777008 10.2174/1389202923666220511162038 PMC9878829 33. Obuchowski NA Bullen JA Receiver operating characteristic (ROC) curves: review of methods with applications in diagnostic medicine Phys Med Biol 2018 63 07tr01 10.1088/1361-6560/aab4b1 29512515 Obuchowski NA, Bullen JA (2018) Receiver operating characteristic (ROC) curves: review of methods with applications in diagnostic medicine. Phys Med Biol 63:07tr01 29512515 10.1088/1361-6560/aab4b1 34. Azodi CB Tang J Shiu SH Opening the black box: interpretable machine learning for geneticists Trends Genet 2020 36 442 455 10.1016/j.tig.2020.03.005 32396837 Azodi CB, Tang J, Shiu SH (2020) Opening the black box: interpretable machine learning for geneticists. Trends Genet 36:442–455 32396837 10.1016/j.tig.2020.03.005 35. Li Y Ding J Wu K Ensemble machine learning classifiers combining CT radiomics and clinical-radiological features for preoperative prediction of pathological invasiveness in lung adenocarcinoma presenting as part-solid nodules: a multicenter retrospective study Technol Cancer Res Treat 2025 24 15330338251351365 10.1177/15330338251351365 40525253 PMC12174711 Li Y, Ding J, Wu K et al (2025) Ensemble machine learning classifiers combining CT radiomics and clinical-radiological features for preoperative prediction of pathological invasiveness in lung adenocarcinoma presenting as part-solid nodules: a multicenter retrospective study. Technol Cancer Res Treat 24:15330338251351365 40525253 10.1177/15330338251351365 PMC12174711 36. Xiong TW Gan H Lv FJ Zhang XC Fu BJ Chu ZG Artificial intelligence-measured nodule mass for determining the invasiveness of neoplastic ground glass nodules Quant Imaging Med Surg 2024 14 6698 6710 10.21037/qims-24-665 39281163 PMC11400670 Xiong TW, Gan H, Lv FJ, Zhang XC, Fu BJ, Chu ZG (2024) Artificial intelligence-measured nodule mass for determining the invasiveness of neoplastic ground glass nodules. Quant Imaging Med Surg 14:6698–6710 39281163 10.21037/qims-24-665 PMC11400670 37. Sun JD Sugarbaker E Byrne SC Clinical outcomes of resected pure ground-glass, heterogeneous ground-glass, and part-solid pulmonary nodules AJR Am J Roentgenol 2024 222 e2330504 10.2214/AJR.23.30504 38323785 PMC11161307 Sun JD, Sugarbaker E, Byrne SC et al (2024) Clinical outcomes of resected pure ground-glass, heterogeneous ground-glass, and part-solid pulmonary nodules. AJR Am J Roentgenol 222:e2330504 38323785 10.2214/AJR.23.30504 PMC11161307 ",
  "metadata": {
    "Title of this paper": "Clinical outcomes of resected pure ground-glass, heterogeneous ground-glass, and part-solid pulmonary nodules",
    "Journal it was published in:": "Insights into Imaging",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474818/"
  }
}