{
  "title": "Paper_920",
  "abstract": "pmc Plant Biol (Stuttg) Plant Biol (Stuttg) 379 blackwellopen PLB Plant Biology (Stuttgart, Germany) 1435-8603 1438-8677 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12477316 PMC12477316.1 12477316 12477316 40523082 10.1111/plb.70064 PLB70064 PlaBio-2025-01-0035-RP.R1 1 Research Article Research Article Responses of grapevine cells to physiological doses of ethanol, including induced resistance to heat stress Grapevine responses to ethanol Diot, Madignier, Di Valentin, Djari, Maza, Chen, Blanchet & Chervin Diot A.  1  2 Madignier G.  1  3 Di Valentin O. https://orcid.org/0009-0003-7853-7131  1 Djari A.  1 Maza E.  1 Chen Y.  4 Blanchet S.  2 Chervin C. https://orcid.org/0000-0002-0913-6815  1 christian.chervin@toulouse-inp.fr   1 Laboratoire de Recherche en Sciences Végétales–Génomique et Biotechnologie des Fruits‐UMR5546, Institut Polytechnique de Toulouse Université de Toulouse, CNRS Toulouse France   2 CNRS, Station d'Ecologie Théorique et Expérimentale (UAR 2029) Moulis France   3 Fondation Jean Poupelain Javrezac France   4 Zhejiang‐Malaysia Joint Research Laboratory for Agricultural Product Processing and Nutrition, College of Food Science and Engineering Ningbo University Ningbo China * Correspondence christian.chervin@toulouse-inp.fr 16 6 2025 10 2025 27 6 497748 10.1111/plb.v27.6 1187 1201 20 1 2025 19 5 2025 29 09 2025 30 09 2025 30 09 2025 © 2025 The Author(s). Plant Biology https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract  Grapevine is naturally exposed to stresses like heat, drought, and hypoxia. A recent study found very low oxygen levels inside grape berries, linked to ethanol content. Other studies have established a link between ethanol and tolerance to various stresses: heat, drought and high salinity. The causes of such tolerances are not well understood. In our study, 3‐week‐old Gamay calli, Vitis vinifera After 6 h, ethanol addition led to 386 differentially expressed genes (DEGs), with notable upregulation of genes related to heat response, especially small Heat Shock Proteins (sHSPs). Further experiments showed that ethanol priming in grape cells or in Arabidopsis This study supports the idea that ethanol priming helps protect plants against heat stress and provides a valuable RNA‐seq dataset for further research into the underlying mechanisms, where sHSPs play a potentially crucial role in this adaptive response. Ethanol priming enhances heat tolerance in grapevine cells, offering a novel strategy for improving plant resilience to climate stress. Cell cultures ethanol hormesis RNA‐seq small heat shock proteins Vitis vinifera Fondation Jean Poupelain Occitanie Region OxyFruit ANR École Universitaire de Recherche TULIP‐GS ANR‐18‐EURE‐0019 Labex TULIP 10.13039/100018956 ANR‐10‐LABX‐41 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  Editor: INTRODUCTION Hypoxia in plant cells is caused by insufficient oxygen availability (Loreti & Perata 2020 et al 2022 2024 et al 2021 et al 2017 et al 2022 2023 2003 et al 2018 et al 2000 Vicia faba Pisum sativum et al 2002 2009 Zea mays 2021 et al 2018 Low oxygen concentrations induce cellular stress related to decreased ATP production, depletion of energy reserves and accumulation of metabolic end‐products, notably ethanol (Jethva et al 2022 et al 1995 et al 2024 1982 The impact of ethanol on plant physiology, particularly at low doses, is an emerging area of research as a potential molecular marker of hypoxia (Diot et al 2024 et al 2022 Arabidopsis thaliana et al 2024 et al 2022 Arabidopsis et al 2022 Matsui et al 2022 Arabidopsis 2015 2020 et al 2006 et al 2014 In the present study, we investigate the impact of ethanol at a physiological dose, 1 mM, on gene transcript expression in grapevine cell cultures, as Xiao et al 2018 2008 et al 2004 2013 After characterizing the physiological endogenous concentrations of oxygen and ethanol in these cell cultures, we carried out a whole‐genome transcriptomic study using RNA‐seq. Among the gene families upregulated by a physiological dose of ethanol, we identified genes encoding HSPs. Following this observation, a series of metabolite leakage measurements confirmed the protective role of ethanol priming on grapevine cells exposed to heat shock, as initially described by Matsui et al 2022 MATERIAL AND METHODS Plant material Experiments were performed on a grapevine model. Cells from the berry of Vitis vinifera et al 1993 S1 −1 −1 A complementary experiment was performed on Arabidopsis thaliana −1 −1 Characterization of cell cultures of V. vinifera Callus development monitoring Calli were grown in Petri dishes for 5 weeks and photographed at 0, 7, 14, 21, 28 and 35 days. The selected calli were representative of the observed general development. For each time point, the average callus weight was measured using a microscale. Calli grown for 14 and 35 days were harvested for cross‐sections and photographed using the Axio Zoom.V16 microscope (ZEISS, Jena, Germany). Endogenous ethanol measurements At different stages, calli were frozen in liquid nitrogen. Each callus was ground to a fine powder and aliquoted at 200 mg sample −1 g Endogenous oxygen measurements Dissolved oxygen in grapevine calli was measured using a Clark O 2 6 7 6 −1 2 2  EtOH RNA We selected the callus stage (i.e., 21 days; Fig. 1A 1C S2 Fig. 1 (A) Photographs of Gamay calli at 0 day, 7 days, 14 days, 21 days, 28 days, and 35 days after subculturing onto Petri dishes. The calli selected are representative of the general development observed. Scale: orange bar represents 1 cm. (B) Dissolved O 2 n n P  RNA Frozen callus samples were homogenized to powder with a ball mill TissueLyser II (Qiagen, Hilden, Germany) by applying one cycle of 1 min at 250 Hz. Total RNA from individual calli was extracted using 160 mg frozen powder and the Promega ReliaPrep™ RNA Tissue Miniprep System kit (Promega, France; Ref. Z6112) following the manufacturer's protocol, optimized for RNA extractions of grapevine cell cultures (supplementary protocol available on request from the corresponding author). RNAs underwent DNAse treatment with the Invitrogen ezDNase™ Enzyme kit to remove genomic DNA contamination from RNA preparations, following the manufacturer's kit protocol. For each sample, quantity and purity were first assessed by measuring optical density (OD) at 260 nm and 280 nm with a NanoDrop ® Samples with a RIN > 8.8 were selected and then aliquoted to obtain 20 μL RNA samples at 50 ng μL −1  RNA Selected RNA samples were sent to Novogene Bioinformatics Technology (Beijing, China) for cDNA library construction and sequencing on the IlluminaNovaSeq 6000 platform (Illumina, San Diego, CA, USA), achieving an average depth of 20 million paired‐end reads per sample. For each of the four conditions, three biological replicates were sent. Raw sequences corresponding to paired‐end reads (2 × 150 bp) were treated as described by Althiab‐Almasaud et al 2021 et al 2023 et al 2002 GSE275842 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE275842 V. vinifera et al 2024 S3A,B Differential expression and downstream analyses Differential expression (DE) analysis was conducted following the method of Chirinos et al 2023 https://www.r‐project.org/ et al 2013 et al 2014 P Identification and annotation of DEGs The functional annotation of the DEGs was retrieved from the VitExpress transcriptomic platform (Djari et al 2024 et al 2017 https://www.grape.resources.gbfwebtools.fr/converter https://mapman.gabipd.org/home et al 2019 https://www.grape.resources.gbfwebtools.fr/extractSequences https://blast.ncbi.nlm.nih.gov/Blast.cgi Gene ontology enrichment analysis Gene ontology (GO) enrichment analysis was performed with R using the enrichGO function from clusterProfiler package v. 4.10.1. Specifically, GO analysis was conducted separately on both the upregulated and downregulated DEG lists obtained from the comparison between EtOH‐treated and control calli. Only DEGs with a |Log2FoldChange| > 2 were selected. Ethanol priming and heat‐shock treatments For V. vinifera S1 For A thaliana et al 2022 Arabidopsis Measurements of cellular leakage after HS To assess cell damage caused by heat stress in V. vinifera A. thaliana et al 2015 For Vitis et al 2018 g et al 2001 et al 2015 For Arabidopsis et al 2018 et al 2022 Arabidopsis Determination of anthocyanin content This protocol was adapted from Vitrac et al 2000 V. vinifera g Absorbance of the anthocyanin extract was measured at 535 nm. Anthocyanin content was calculated using the molar extinction coefficient (log ε = 4.53) reported by Vitrac et al 2000 Total polyphenol index determination The Total Polyphenol Index (TPI) is a measure used to quantify the total amount of polyphenolic compounds present in a sample. The TPI method relies on absorption of benzene rings at 280 nm, a characteristic feature of polyphenols. This protocol was adapted from Cetó et al 2012 Statistical analyses All data in Figs. 1 4 P RESULTS  V. vinifera Fig. 1A S2 We then characterized levels of oxygen in grapevine calli during 5 weeks of development on growth medium. Fig. 1B 2 2 −1 −1 2 S3 S4 1C V. vinifera A small exogenous EtOH To investigate the impact of a physiological dose of EtOH on the V. vinifera 2A 2A S5 Fig. 2 (A) Principal Components Analysis (PCA) of transcriptomic profiles of Gamay grape cell cultures 6 and 24 h after 0 mM control (green and dark green) or 1 mM (orange and red) ethanol treatment, with each symbol representing a replicate. (B) Volcano plot at 6 h post‐treatment. (C) Volcano plot at 24 h post‐treatment. Both plots display differential gene expression for 24,655 genes from cell cultures treated with 1 mM EtOH versus control cultures. Each point represents a gene: the x‐axis shows the log2FoldChange (LFC) comparing EtOH‐treated cells to control cells, while the y‐axis represents the −log10 of adjusted P P P P P To further refine our analysis, we applied more stringent criteria to DEGs: we selected genes with a |Log2FoldChange| > 2, in addition to requiring an adjusted P S4 2C,D 2D Ethanol treatment within the physiological range significantly upregulated small HSP Considering the higher number of DEGs at 6 h compared to 24 h post‐treatment, we decided to focus on responses 6 h after treatment. Complete lists of the 386 functionally annotated DEGs are available in Table S5 S5 S5B 3A P 3B P S6 S7 Fig. 3 Dot plots of the Gene Ontology (GO) enrichment analysis of (A) upregulated DEGs and (B) downregulated DEGs for the comparison of 1 mM EtOH versus 0 mM at 6 h post‐treatment. DEGs used for the GO enrichment analysis are genes with P P Genes annotated as “response to heat” (GO:0009408) and “response to temperature stimulus” (GO:0009266), “protein self‐association” (GO:0043621) and “unfolded protein binding” (GO:0051082) were the most represented, with a gene ratio of 0.158, among the 132 upregulated DEGs (Fig. 3A 3B We then examined the specific genes comprising the enriched families in both DEGs lists. First, we examined specific genes in the upregulated enriched family associated with the GO term “Response to heat”. This list included 15 DEGs (Fig. 3C P S8 3C P −12 We then examined the specific genes comprising the downregulated enriched family associated with the GO term “Secondary metabolism process”. This list included 16 DEGs (Fig. S6 P S9 S6 Ethanol‐priming reduced heat‐induced cell leakage Following the observation that 1 mM EtOH significantly upregulated sHSPs in the GO analysis, we looked for thermotolerance phenotypes in ethanol‐primed calli after heat stress. We chose a 10‐fold increment for ethanol concentration to analyse the dose–response effect. This allowed us to extend the concentration range around 1 mM, thus accommodating potential variations in the phenotype (Fig. 4 4A–C Fig. 4 Damage induced by heat stress in Vitis vinifera Arabidopsis thaliana Material and Methods n P Arabidopsis Material and Methods n P Overall, calli primed with 1 and 10 mM EtOH showed strong reductions in absorbance of 35%–45% compared with the HS control. This shows that priming grapevine cell cultures with low physiological doses of ethanol (i.e., 0.1 to 10 mM) reduce cell leakage after exposure to a mild heat shock. Moreover, a complementary experiment on A. thaliana 4D Arabidopsis Ethanol‐priming does not impact polyphenol content in grapevine calli As shown in Fig. 3B S6 S7 S7A S7B DISCUSSION Grapevine cell cultures, a model experiencing hypoxia and ethanol accumulation Xiao et al. ( 2018 1B,C et al 1995 S4 et al 2019 et al 2024 Low exogenous applications of EtOH We found small changes in ethanol concentration generate rapid responses at the transcriptome level in Gamay cell cultures. In the PCA plot (Fig. 2A in vitro 2D 2D 2C 2B 2D et al 2019 3B 3A 3A et al 2019 1993 3C Response of grapevine cells to physiological ethanol levels: Upregulation of small heat shock protein transcripts The genes associated with the GO terms “Response to heat” and “Response to temperature stimulus” were the most statistically overrepresented 6 h after a 1 mM EtOH treatment, notably sHSPs (Fig. 3C et al 2011 et al 2007 The sHSPs HSPs are classified into five subfamilies based on molecular weight: Hsp100, Hsp90, Hsp70, Hsp60, and sHSPs (Sun & MacRae 2005 1991 1988 et al 2019 2015 et al 1995 1997 et al 2016 et al 2019 et al 2013 et al 2006 Class CI and CII sHSPs In Fig. 3C 2013 et al 2010 et al 2000 et al 2004 Small changes in ethanol concentration confer thermotolerance to grapevine calli by reducing cell leakage, as confirmed using Arabidopsis Our model is a cell culture rich in anthocyanins (Guan et al 2016 et al 2021 et al 2015 et al 2005 Vitis et al 2015 et al 2015 S1 4A–C Arabidopsis 4D et al 2004 et al 2012 et al 2018 et al 2002 Plants have evolved many mechanisms for adaptation to dynamic and adverse environmental conditions. They have also acquired a form of ‘stress memory’, retaining the response to an initial stress that can prime responses to a second stress, allowing a rapid and strong response (Savvides et al 2016 et al 2020 et al 2024 et al 2022 1983 Saccharomyces cerevisiae et al 1982  Timeframe of responses et al 2022 1982 4A–C 1991 1991 Arabidopsis Response of grapevine to physiological doses of ethanol: Downregulation of key polyphenol‐related transcripts, without effecting anthocyanin and polyphenol content The downregulation of secondary metabolism is a classic plant response to stress (Bilgin et al 2010 et al 2012 et al 2019 S7 et al 2016 Plant response to ethanol displays hormesis, and ethanol might be a messenger of hypoxia or other stresses Because the sHSP subfamily was extremely overexpressed in the RNA‐seq experiment, and to examine physiological response of cell cultures to low doses of ethanol, we assessed cell damage from a heat shock in calli primed with different ethanol concentrations. The results (Fig. 4A–C 2002 2003 2022 2002 2003 et al 2023 2008 et al 2020 3B 4 et al 1978 −1 et al 1985 et al 2019 −1 4 Arabidopsis Further research is needed to explore ethanol‐induced hormesis in plants, specifically to elucidate how stimulation and inhibition vary with ethanol concentration. While the inhibition observed at high concentrations is expected, as it aligns with the onset of toxicity, the stimulation effect at low concentrations warrants more detailed investigation. Considering ethanol as a small molecule with significant diffusive capacity, notably through membranes, and considering its hydrophobic nature, the manner by which cells perceive small variations in ethanol concentration remains a matter of research and debate (Diot et al 2024 CONCLUSIONS We demonstrated that grapevine cells can sense ethanol at a physiological concentration, inducing a strong and rapid transcriptomic response, typical for stressors. This transcriptomic response has physiological repercussions, as evidenced by thermotolerance biphasic dose–response curves, suggesting that ethanol could act as a molecular messenger in stressful situations in plants, rather than just being an end‐product metabolite of hypoxic metabolism. Harnessing this response could be promising in preparing plants for more challenging stress. Indeed, plants biosynthesize phytohormones and other metabolites to adapt to adverse environments. Recent studies have demonstrated that exogenous treatment with chemical compounds enhance abiotic stress tolerance by inducing molecular and physiological defence mechanisms, a process known as chemical priming (Sako et al 2020 AUTHOR CONTRIBUTIONS CC, YC and AD developed the project concept and research design. AD performed the experiments. GM and AD performed the RNA‐seq data cleaning, reads alignment and quality assessment of reads. AD, EM and GM performed analyses in RODV, GM and AD made the R graphs. AD and CC wrote the original draft. All co‐authors contributed to editing the manuscript. AD, SB and CC were involved in funding acquisition, CC and SB were involved in AD PhD supervision. FUNDING INFORMATION This study was supported by the École Universitaire de Recherche TULIP‐GS (ANR‐18‐EURE‐0019), which provided half of a PhD grant to A. Diot and a full PhD grant to Olivia D.V. All authors are also grateful to the Occitanie Region for funding the other half of the PhD grant to A. Diot. The research was also partly funded by the VitiFunGen project supported by the Fondation Jean Poupelain (Cognac, France), the Labex TULIP (ANR‐10‐LABX‐41) and by OxyFruit ANR (ANR‐23‐CE20‐0001). Additionally, we thank the Université Paul Sabatier, CNRS, and Toulouse INP for their contributions to our research. CONFLICT OF INTEREST STATEMENT The authors declare they have no conflicts of interest. Supporting information  Fig. S1.  Fig. S2. Vitis vinifera  Fig. S3. 2 Vitis vinifera  Fig. S4.  Fig. S5.  Fig. S6.  Fig. S7.  Table S1.  Table S2.  Table S3.  Table S4.  Table S5.  Table S6.  Table S7.  Table S8.  Table S9. ACKNOWLEDGEMENTS We thank EUR TULIP and the Occitanie Region for the PhD grant to A. Diot. We also thank P. Thuleau for providing the A. thaliana https://bioinfo.genotoul.fr/ DATA AVAILABILITY STATEMENT The raw data underlying this article have been deposited in NCBI's Gene Expression Omnibus (Edgar et al 2002 GSE275842 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE275842 References Abbas M. Sharma G. Dambire C. Marquez J. Alonso‐Blanco C. Proaño K. Holdsworth M.J. 2022 An oxygen‐sensing mechanism for angiosperm adaptation to altitude Nature 606 565 569 10.1038/s41586-022-04740-y 35650430 PMC9200633 Agathokleous E. Kitao M. Calabrese E.J. 2020 Hormesis: highly generalizable and beyond laboratory Trends in Plant Science 25 1076 1086 10.1016/j.tplants.2020.05.006 32546350 Aghdam M.S. Sevillano L. Flores F.B. Bodbodak S. 2013 Heat shock proteins as biochemical markers for postharvest chilling stress in fruits and vegetables Scientia Horticulturae 160 54 64 10.1016/j.scienta.2013.05.020 Alkorta I. Epelde L. Garbisu C. 2017 Environmental parameters altered by climate change affect the activity of soil microorganisms involved in bioremediation FEMS Microbiology Letters 364 fnx200 10.1093/femsle/fnx200 28961781 Althiab‐Almasaud R. Chen Y. Maza E. Djari A. Frasse P. Mollet J.C. Mazars C. Jamet E. Chervin C. 2021 Ethylene signaling modulates tomato pollen tube growth through modifications of cell wall remodeling and calcium gradient The Plant Journal 107 893 908 10.1111/tpj.15353 34036648 Altschuler M. Mascarenhas J.P. 1982 Heat shock proteins and effects of heat shock in plants Plant Molecular Biology 1 103 115 10.1007/BF00024974 24317892 Baird N.A. Turnbull D.W. Johnson E.A. 2006 Induction of the heat shock pathway during hypoxia requires regulation of heat shock factor by hypoxia‐inducible factor‐1 The Journal of Biological Chemistry 281 38675 38681 10.1074/jbc.M608013200 17040902 Basha E. Jones C. Wysocki V. Vierling E. 2010 Mechanistic differences between two conserved classes of small heat shock proteins found in the plant cytosol Journal of Biological Chemistry 285 11489 11497 10.1074/jbc.M109.074088 20145254 PMC2857027 Bashir K. Todaka D. Rasheed S. Matsui A. Ahmad Z. Sako K. Utsumi Y. Vu A.T. Tanaka M. Takahashi S. Ishida J. 2022 Ethanol‐mediated novel survival strategy against drought stress in plants Plant and Cell Physiology 63 1181 1192 10.1093/pcp/pcac114 36003026 PMC9474946 Bhattacharya S. Bhattacharya N.C. Bhatnagar V.B. 1985 Effect of ethanol, methanol and acetone on rooting etiolated cuttings of Vigna radiata in presence of sucrose and auxin Annals of Botany 55 143 145 10.1093/oxfordjournals.aob.a086885 Bilgin D.D. Zavala J.A. Zhu J.I.N. Clough S.J. Ort D.R. DeLucia E.H. 2010 Biotic stress globally downregulates photosynthesis genes Plant, Cell & Environment 33 1597 1613 10.1111/j.1365-3040.2010.02167.x 20444224 Borisjuk L. Rolletschek H. 2009 The oxygen status of the developing seed New Phytologist 182 17 30 10.1111/j.1469-8137.2008.02752.x 19207684 Brazel A.J. Graciet E. 2023 Complexity of abiotic stress stimuli: mimicking hypoxic conditions experimentally on the basis of naturally occurring environments Plant abiotic stress signaling Springer New York, USA 23 48 10.1007/978-1-0716-3044-0_2 36944871 Bui L.T. Novi G. Lombardi L. Iannuzzi C. Rossi J. Santaniello A. Mensuali A. Corbineau F. Giuntoli B. Perata P. Zaffagnini M. 2019 Conservation of ethanol fermentation and its regulation in land plants Journal of Experimental Botany 70 1815 1827 10.1093/jxb/erz052 30861072 PMC6436157 Calabrese E.J. Baldwin L.A. 2002 Defining hormesis Human and Experimental Toxicology 21 91 97 10.1191/0960327102ht217oa 12102503 Calabrese E.J. Baldwin L.A. 2003 Ethanol and hormesis Critical Reviews in Toxicology 33 407 424 10.1080/713611043 12809430 Canaguier A. Grimplet J. Di Gaspero G. Scalabrin S. Duchêne E. Choisne N. Mohellibi N. Guichard C. Rombauts S. Le Clainche I. Berard A. 2017 A new version of the grapevine reference genome assembly (12X.v2) and of its annotation (VCost.v3) Genomics Data 14 56 10.1016/j.gdata.2017.09.002 28971018 PMC5612791 Cetó X. Gutiérrez J.M. Gutiérrez M. Céspedes F. Capdevila J. Mínguez S. Jiménez‐Jorquera C. Del Valle M. 2012 Determination of total polyphenol index in wines employing a voltammetric electronic tongue Analytica Chimica Acta 732 172 179 10.1016/j.aca.2012.02.026 22688049 Chapra S.C. Camacho L.A. McBride G.B. 2021 Impact of global warming on dissolved oxygen and BOD assimilative capacity of the world's rivers: modeling analysis Watermark 13 2408 10.3390/w13172408 Chen Y. Chen X. Wang H. Bao Y. Zhang W. 2014 Examination of the leaf proteome during flooding stress and the induction of programmed cell death in maize Proteome Science 12 33 10.1186/1477-5956-12-33 25028572 PMC4099015 Chervin C. Elkereamy A. Roustan J.P. Faragher J.D. Latché A. Pech J.C. Bouzayen M. 2001 An ethanol spray at veraison enhances colour in red wines Australian Journal of Grape and Wine Research 7 144 145 10.1111/j.1755-0238.2001.tb00202.x Chirinos X. Ying S. Rodrigues M.A. Maza E. Djari A. Hu G. Liu M. Purgatto E. Fournier S. Regad F. Bouzayen M. 2023 Transition to ripening in tomato requires hormone‐controlled genetic reprogramming initiated in gel tissue Plant Physiology 191 610 625 10.1093/plphys/kiac464 36200876 PMC9806557 Choi M.R. Jung K.H. Park J.H. Das N.D. Chung M.K. Choi I.G. Lee B.C. Park K.S. Chai Y.G. 2011 Ethanol‐induced small heat shock protein genes in the differentiation of mouse embryonic neural stem cells Archives of Toxicology 85 293 304 10.1007/s00204-010-0591-z 20871982 Daniel K. Hartman S. 2024 How plant roots respond to waterlogging Journal of Experimental Botany 75 511 525 10.1093/jxb/erad332 37610936 Das A.K. Anik T.R. Rahman M.M. Keya S.S. Islam M.R. Rahman M.A. Sultana S. Ghosh P.K. Khan S. Ahamed T. Ghosh T.K. 2022 Ethanol treatment enhances physiological and biochemical responses to mitigate saline toxicity in soybean Plants 11 272 10.3390/plants11030272 35161252 PMC8838166 Diot A. Groth G. Blanchet S. Chervin C. 2024 Responses of animals and plants to physiological doses of ethanol: a molecular messenger of hypoxia? FEBS Journal 291 1102 1110 10.1111/febs.17056 38232057 Djari A. Madignier G. Di Valentin O. Gillet T. Frasse P. Djouhri A. Hu G. Julliard S. Liu M. Zhang Y. Regad F. 2024 Haplotype‐resolved genome assembly and implementation of VitExpress, an open interactive transcriptomic platform for grapevine Proceedings of the National Academy of Sciences of the United States of America 121 e2403750121 10.1073/pnas.2403750121 38805269 PMC11161759 Dukowic‐Schulze S. van der Linde K. 2021 Oxygen, secreted proteins and small RNAs: mobile elements that govern anther development Plant Reproduction 34 1 19 10.1007/s00497-020-00401-0 33492519 PMC7902584 Edgar R. Domrachev M. Lash A.E. 2002 Gene expression omnibus: NCBI gene expression and hybridization array data repository Nucleic Acids Research 30 207 210 10.1093/nar/30.1.207 11752295 PMC99122 Erofeeva E.A. 2022 Hormesis in plants: its common occurrence across stresses Current Opinion in Toxicology 30 100333 10.1016/j.cotox.2022.02.006 Geigenberger P. 2003 Response of plant metabolism to too little oxygen Current Opinion in Plant Biology 6 247 256 10.1016/s1369-5266(03)00038-4 12753974 Geigenberger P. Fernie A.R. Gibon Y. Christ M. Stitt M. 2000 Metabolic activity decreases as an adaptive response to low internal oxygen in growing potato tubers Biological Chemistry 381 723 740 10.1515/BC.2000.093 11030430 Guan J.C. Jinn T.L. Yeh C.H. Feng S.P. Chen Y.M. Lin C.Y. 2004 Characterization of the genomic structures and selective expression profiles of nine class I small heat shock protein genes clustered on two chromosomes in rice ( Oryza sativa Plant Molecular Biology 56 795 809 10.1007/s11103-004-5182-z 15803416 Guan L. Dai Z. Wu B.H. Wu J. Merlin I. Hilbert G. Renaud C. Gomès E. Edwards E. Li S.H. Delrot S. 2016 Anthocyanin biosynthesis is differentially regulated by light in the skin and flesh of white‐fleshed and teinturier grape berries Planta 243 23 41 10.1007/s00425-015-2391-4 26335854 Haslbeck M. Vierling E. 2015 A first line of stress defense: small heat shock proteins and their function in protein homeostasis Journal of Molecular Biology 427 1537 1548 10.1016/j.jmb.2015.02.002 25681016 PMC4360138 Hellwig S. Drossard J. Twyman R.M. Fischer R. 2004 Plant cell cultures for the production of recombinant proteins Nature Biotechnology 22 1415 1422 10.1038/nbt1027 15529167 Hu C. Yang J. Qi Z. Wu H. Wang B. Zou F. Mei H. Liu J. Wang W. Liu Q. 2022 Heat shock proteins: biological functions, pathological roles, and therapeutic opportunities MedComm 3 e161 10.1002/mco2.161 35928554 PMC9345296 Ilík P. Špundová M. Šicner M. Melkovičová H. Kučerová Z. Krchňák P. Fürst T. Večeřová K. Panzarová K. Benediktyová Z. Trtílek M. 2018 Estimating heat tolerance of plants by ion leakage: a new method based on gradual heating New Phytologist 218 1278 1287 10.1111/nph.15097 29573424 Janowska M.K. Baughman H.E. Woods C.N. Klevit R.E. 2019 Mechanisms of small heat shock proteins Cold Spring Harbor Perspectives in Biology 11 a034025 10.1101/cshperspect.a034025 30833458 PMC6771367 Jethva J. Schmidt R.R. Sauter M. Selinski J. 2022 Try or die: dynamics of plant respiration and how to survive low oxygen conditions Plants 11 205 10.3390/plants11020205 35050092 PMC8780655 Jiang X. Feng K. Yang X. 2015 In vitro antifungal activity and mechanism of action of tea polyphenols and tea saponin against Rhizopus stolonifer Journal of Molecular Microbiology and Biotechnology 25 269 276 10.1159/000430866 26138353 Kimmerer T.W. Kozlowski T.T. 1982 Ethylene, ethane, acetaldehyde, and ethanol production by plants under stress Plant Physiology 69 840 847 10.1104/pp.84.4.1204 16662306 PMC426315 Kong J. Wu J. Guan L. Hilbert G. Delrot S. Fan P. Liang Z. Wu B. Matus J.T. Gomès E. Dai Z. 2021 Metabolite analysis reveals distinct spatio‐temporal accumulation of anthocyanins in two teinturier variants of cv. ‘Gamay’ grapevines ( Vitis vinifera Planta 253 1 18 10.1007/s00425-021-03613-4 33788027 Kuo H.F. Tsai Y.F. Young L.S. Lin C.Y. 2000 Ethanol treatment triggers a heat shock‐like response but no thermotolerance in soybean (Glycine max cv. Kaohsiung No. 8) seedlings Plant, Cell & Environment 23 1099 1108 10.1046/j.1365-3040.2000.00621.x Lambri M. Torchio F. Colangelo D. Segade S.R. Giacosa S. De Faveri D.M. Gerbi V. Rolle L. 2015 Influence of different berry thermal treatment conditions, grape anthocyanin profile, and skin hardness on the extraction of anthocyanin compounds in the colored grape juice production Food Research International 77 584 590 10.1016/j.foodres.2015.08.027 Lee G.J. Pokala N. Vierling E. 1995 Structure and in vitro molecular chaperone activity of cytosolic small heat shock proteins from pea Journal of Biological Chemistry 270 10432 10438 10.1074/jbc.270.18.10432 7737977 Lee G.J. Roseman A.M. Saibil H.R. Vierling E. 1997 A small heat shock protein stably binds heat‐denatured model substrates and can maintain a substrate in a folding‐competent state EMBO Journal 16 659 671 10.1093/emboj/16.3.659 9034347 PMC1169668 Li G.C. 1983 Induction of thermotolerance and enhanced heat shock protein synthesis in Chinese hamster fibroblasts by sodium arsenite and by ethanol Journal of Cellular Physiology 115 116 122 10.1002/jcp.1041150203 6841458 Lindquist S. Craig E.A. 1988 The heat‐shock proteins Annual Review of Genetics 22 631 677 10.1146/annurev.ge.22.120188.003215 2853609 Liu G.T. Wang J.F. Cramer G. Dai Z.W. Duan W. Xu H.G. Wu B.H. Fan P.G. Wang L.J. Li S.H. 2012 Transcriptomic analysis of grape ( Vitis vinifera BMC Plant Biology 12 1 10 10.1186/1471-2229-12-174 23016701 PMC3497578 Loreti E. Perata P. 2020 The many facets of hypoxia in plants Plants 9 745 10.3390/plants9060745 32545707 PMC7356549 Love M.I. Huber W. Anders S. 2014 Moderated estimation of fold change and dispersion for RNA‐seq data with DESeq2 Genome Biology 15 1 21 10.1186/s13059-014-0550-8 PMC4302049 25516281 Matsui A. Todaka D. Tanaka M. Mizunashi K. Takahashi S. Sunaoshi Y. Tsuboi Y. Ishida J. Bashir K. Kikuchi J. Kusano M. 2022 Ethanol induces heat tolerance in plants by stimulating unfolded protein response Plant Molecular Biology 110 131 145 10.1007/s11103-022-01291-8 35729482 Maza E. Frasse P. Senin P. Bouzayen M. Zouine M. 2013 Comparison of normalization methods for differential gene expression analysis in RNA‐seq experiments: a matter of relative size of studied transcriptomes Communicative & Integrative Biology 6 e25849 10.4161/cib.25849 26442135 PMC3918003 McLoughlin F. Basha E. Fowler M.E. Kim M. Bordowitz J. Katiyar‐Agarwal S. Vierling E. 2016 Class I and II small heat shock proteins together with HSP101 protect protein translation factors during heat stress Plant Physiology 172 1221 1236 10.1104/pp.16.00536 27474115 PMC5047077 Meitha K. Agudelo‐Romero P. Signorelli S. Gibbs D.J. Considine J.A. Foyer C.H. Considine M.J. 2018 Developmental control of hypoxia during bud burst in grapevine Plant, Cell & Environment 41 1154 1170 10.1111/pce.13141 29336037 Middleton W. Jarvis B.C. Booth A. 1978 The effects of ethanol on rooting and carbohydrate metabolism in stem cuttings of Phaseolus aureus New Phytologist 81 279 285 10.1111/j.1469-8137.1978.tb02633.x Park C.J. Seo Y.S. 2015 Heat shock proteins: a review of the molecular chaperones for plant immunity Plant Pathology Journal 31 323 333 10.5423/ppj.rw.08.2015.0150 26676169 PMC4677741 Parsell D.A. Lindquist S. 1993 The function of heat‐shock proteins in stress tolerance: degradation and reactivation of damaged proteins Annual Review of Genetics 27 437 496 10.1146/annurev.ge.27.120193.002253 8122909 Patra M. Salonen E. Terama E. Vattulainen I. Faller R. Lee B.W. Holopainen J. Karttunen M. 2006 Under the influence of alcohol: the effect of ethanol and methanol on lipid bilayers Biophysical Journal 90 1121 1135 10.1529/biophysj.105.062364 16326895 PMC1367264 Pignataro L. Miller A.N. Ma L. Midha S. Protiva P. Herrera D.G. Harrison N.L. 2007 Alcohol regulates gene expression in neurons via activation of heat shock factor 1 Journal of Neuroscience 27 12957 12966 10.1523/jneurosci.4142-07.2007 18032669 PMC6673276 Plesset J. Palm C. McLaughlin C.S. 1982 Induction of heat shock proteins and thermotolerance by ethanol in Saccharomyces cerevisiae Biochemical and Biophysical Research Communications 108 1340 1345 10.1016/0006-291X(82)92147-7 6758774 Raymond P. Saglio P. Ricard B. 1995 Réponse au manque d'oxygène dans les tissus végétaux Cahiers Agricultures 4 343 350 https://revues.cirad.fr/index.php/cahiers‐agricultures/article/view/29908/29668 Rolletschek H. Borisjuk L. Koschorreck M. Wobus U. Weber H. 2002 Legume embryos develop in a hypoxic environment Journal of Experimental Botany 53 1099 1107 10.1093/jexbot/53.371.1099 11971921 Sako K. Nguyen H.M. Seki M. 2020 Advances in chemical priming to enhance abiotic stress tolerance in plants Plant and Cell Physiology 61 1995 2003 10.1093/pcp/pcaa119 32966567 Sato F. 2013 Characterization of plant functions using cultured plant cells, and biotechnological applications Bioscience, Biotechnology, and Biochemistry 77 1 9 10.1271/bbb.120759 23291765 Savvides A. Ali S. Tester M. Fotopoulos V. 2016 Chemical priming of plants against multiple abiotic stresses: mission possible? Trends in Plant Science 21 329 340 10.1016/j.tplants.2015.11.003 26704665 Schwacke R. Ponce‐Soto G.Y. Krause K. Bolger A.M. Arsova B. Hallab A. Gruden K. Stitt M. Bolger M.E. Usadel B. 2019 MapMan4: a refined protein classification and annotation framework applicable to multi‐omics data analysis Molecular Plant 12 879 892 10.1016/j.molp.2019.01.003 30639314 Scott B.R. 2008 Low‐dose‐radiation stimulated natural chemical and biological protection against lung cancer Dose‐Response 6 299 318 10.2203/dose-response.07-025.scott 18846259 PMC2564762 Smetanska I. 2008 Production of secondary metabolites using plant cell cultures Advances in Biochemical Engineering/Biotechnology 111 187 228 10.1007/10_2008_103 18594786 Sun Y. MacRae T.H. 2005 Small heat shock proteins: molecular structure and chaperone function Cellular and Molecular Life Sciences 62 2460 2476 10.1007/s00018-005-5190-4 16143830 PMC11138385 Todaka D. Quynh D.T.N. Tanaka M. Utsumi Y. Utsumi C. Ezoe A. Takahashi S. Ishida J. Kusano M. Kobayashi M. Saito K. 2024 Application of ethanol alleviates heat damage to leaf growth and yield in tomato Frontiers in Plant Science 15 1325365 10.3389/fpls.2024.1325365 38439987 PMC10909983 Triantaphylides C. Nespoulous L. Chervin C. 1993 Ammonium requirement for radiation‐induced accumulation of polyamines in suspension‐cultured grape cells Physiologia Plantarum 87 389 395 10.1111/j.1399-3054.1993.tb01746.x Tsvetkova N.M. Horváth I. Török Z. Wolkers W.F. Balogi Z. Shigapova N. Crowe L.M. Tablin F. Vierling E. Crowe J.H. Vigh L. 2002 Small heat‐shock proteins regulate membrane lipid polymorphism Proceedings of the National Academy of Sciences 99 13504 13509 10.1073/pnas.192468399 PMC129703 12368478 Ul H.S. Khan A. Ali M. Khattak A.M. Gai W.X. Zhang H.X. Wei A.M. Gong Z.H. 2019 Heat shock proteins: dynamic biomolecules to counter plant biotic and abiotic stresses International Journal of Molecular Sciences 20 5321 10.3390/ijms20215321 31731530 PMC6862505 Vierling E. 1991 The roles of heat shock proteins in plants Annual Review of Plant Physiology and Plant Molecular Biology 42 579 620 10.1146/annurev.pp.42.060191.003051 Vitrac X. Larronde F. Krisa S. Decendit A. Deffieux G. Mérillon J.M. 2000 Sugar sensing and Ca2+−calmodulin requirement in Vitis vinifera Phytochemistry 53 659 665 10.1016/s0031-9422(99)00620-2 10746878 Wang B. Lin L. Yuan X. Zhu Y. Wang Y. Li D. He J. Xiao Y. 2023 Low‐level cadmium exposure induced hormesis in peppermint young plant by constantly activating antioxidant activity based on physiological and transcriptomic analyses Frontiers in Plant Science 14 1088285 10.3389/fpls.2023.1088285 36755692 PMC9899930 Wang W. Vinocur B. Shoseyov O. Altman A. 2004 Role of plant heat‐shock proteins and molecular chaperones in the abiotic stress response Trends in Plant Science 9 244 252 10.1016/j.tplants.2004.03.006 15130550 Waters E.R. 2013 The evolution, function, structure, and expression of the plant sHSPs Journal of Experimental Botany 64 391 403 10.1093/jxb/ers355 23255280 Waters E.R. Vierling E. 2020 Plant small heat shock proteins–evolutionary and functional diversity New Phytologist 227 24 37 10.1111/nph.16536 32297991 Wu Z. Yang L. Jiang L. Zhang Z. Song H. Rong X. Han Y. 2019 Low concentration of exogenous ethanol promoted biomass and nutrient accumulation in oilseed rape ( Brassica napus Plant Signaling & Behavior 14 1681114 10.1080/15592324.2019.1681114 31642378 PMC6866684 Xiao Z. Rogiers S.Y. Sadras V.O. Tyerman S.D. 2018 Hypoxia in grape berries: the role of seed respiration and lenticels on the berry pedicel and the possible link to cell death Journal of Experimental Botany 69 2071 2083 10.1093/jxb/ery039 29415235 PMC6018838 Zhang J.H. Huang W.D. Liu Y.P. Pan Q.H. 2005 Effects of temperature acclimation pretreatment on the ultrastructure of mesophyll cells in young grape plants ( Vitis vinifera Journal of Integrative Plant Biology 47 959 970 10.1111/j.1744-7909.2005.00109.x ",
  "metadata": {
    "Title of this paper": "Effects of temperature acclimation pretreatment on the ultrastructure of mesophyll cells in young grape plants (",
    "Journal it was published in:": "Plant Biology (Stuttgart, Germany)",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477316/"
  }
}