{
  "title": "Paper_864",
  "abstract": "pmc STAR Protoc STAR Protoc 3946 starprot STAR Protocols 2666-1667 Elsevier PMC12478239 PMC12478239.1 12478239 12478239 40966091 10.1016/j.xpro.2025.104042 S2666-1667(25)00448-4 104042 1 Protocol In vivo Wang Yuqi wangyuqi@westlake.edu.cn 1 2 5 6 ∗ Hu Mangze 1 3 5 Zou Yilong zouyilong@westlake.edu.cn 1 2 ∗∗ Wang Xi wangxi@westlake.edu.cn 2 4 7 ∗∗∗ 1 2 3 4 ∗ wangyuqi@westlake.edu.cn ∗∗ zouyilong@westlake.edu.cn ∗∗∗ wangxi@westlake.edu.cn 5 These authors contributed equally 6 Technical contact 7 Lead contact 19 12 2025 17 9 2025 6 4 497571 104042 17 09 2025 30 09 2025 30 09 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary In vivo in vitro in vivo For complete details on the use and execution of this protocol, please refer to Wang et al. 1 Graphical abstract Highlights • Detailed protocol for in vivo • Combines library design, in vivo • Examples for target identification and functional validation Publisher’s note: Undertaking any experimental protocol requires adherence to local institutional guidelines for laboratory safety and ethics. In vivo in vitro in vivo Subject areas Cancer Metabolism CRISPR pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Before you begin While single-cell RNA-seq and spatial omics have advanced our understanding of cellular heterogeneity and tissue organization in disease, these methods remain largely descriptive. In contrast, high-throughput genetic screens directly connect gene function to phenotypic outcomes within pathologically relevant tissue contexts. In vivo in vivo This protocol provides a detailed description of a robust in vivo in vivo Figure 1 in vivo Figure 1 Experimental design and timeline for in vivo The iteratively selected ovarian cancer metastasis model used in this protocol was established by intraperitoneal injection of ES-2-MC2-Hep cells, which exhibit high metastatic potential in both the liver and lung. These cells were isolated from the metastatic livers of nude mice previously injected intraperitoneally with ES-2-MC1-Hep cells, which, in turn, were derived from the metastatic livers of nude mice injected with ES-2 cells ( Figure 2 Figure 2 Development of a high-efficiency ovarian cancer metastasis model using an iterative selection strategy, related to before you begin This figure was reused from Wang et al. (2025). (A) Schematic overview of the iterative in vivo (B) Representative pseudocolor ex vivo (C) Bar graph depicting the metastatic penetrance of ES-2-MC2-Hep cells in the lung and liver, respectively. n = 13 from two independent batches of experiments. Institutional permissions All animal experiments were performed in compliance with ethical guidelines and approved by the Institutional Animal Care and Use Committee (IACUC) of Westlake University. Researchers must obtain appropriate institutional approval before implementing this protocol. Preparation of STE (sodium-Tris-EDTA) buffer To maximize genomic DNA (gDNA) extraction efficiency and prevent gDNA loss, an in-house high-salt precipitation method was employed for gDNA extraction from cells. 1 Reagent Final concentration Amount NaCl (1 M) 0.1 M 10 mL Tris-HCl (pH=8.0, 1 M) 0.01 M 1 mL EDTA (pH=8.0, 0.5 M) 1 mM 200 μL ddH 2 N/A 88.8 mL Total N/A 100 mL Software  Timing: 30 min 1. Install a conda virtual environment. Check if conda is installed and available. If it does not return the installed version of conda, follow the installation guide at https://www.anaconda.com/ $ conda --version 2. Install and activate MAGeCK using conda. $ conda install -c bioconda -c conda-forge mageck $ source activate mageckenv 3. Install R and R packages MAGeCK-Flute, clusterprofiler, ggplot2. $ R > if (!requireNamespace(\"BiocManager\", quietly = TRUE) install.packages(\"BiocManager\") > BiocManager::install(\"MAGeCKFlute\") > BiocManager::install(\"clusterprofiler\") > BiocManager::install(\"ggplot2\") Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies Rabbit monoclonal anti-NMNAT1 Cell Signaling Technology (CST) Cat# 98354S, 1:1,000 dilution β-actin (8H10D10) mouse mAb Cell Signaling Technology (CST) Cat# 3700S, 1:5,000 dilution IRDye 800CW goat-anti-rabbit LI-COR Cat# 926-32211, 1:10,000 dilution IRDye 680RD donkey-anti-mouse LI-COR Cat# 926-68072, 1:10,000 dilution Bacterial and virus strains Endura electrocompetent cells LGC (Lucigen) Cat# 60242-2 Biological samples Nude mouse livers and lungs Human cancer cell line-derived xenograft models N/A Chemicals, peptides, and recombinant proteins RPMI medium 1640 basic (1X) Gibco Cat# C11875500BT DMEM basic (1X) Gibco Cat# C11995500BT Opti-MEM (1X) Gibco Cat# 31985-070 Trypsin Gibco Cat# 25200 Penicillin-streptomycin Gibco Cat# 15140122 FBS Cellmax Cat# SA211.02 Puromycin Gibco Cat# A11138-03 D-luciferin, sodium salt Yeasen Cat# 40901ES03 NEBNext high-fidelity 2X PCR master mix NEB Cat# M0541L Bsm NEB Cat# R0739L NovoRec Plus one step PCR cloning kit Novoprotein Cat# NR005 Proteinase K TIANGEN Cat# U8507 Red cell lysis Beyotime Cat# C3702 cOmplete tablets EASYpack Roche Cat# 04693116001 Lipofectamine 2000 Invitrogen Cat# 11668-019 Polybrene MilliporeSigma Cat# TR-1003-G Critical commercial assays Tumor dissociation kit (human) Miltenyi Biotec Cat# 130-095-929 Lenti-X GoStix Plus kit Takara Cat# 631280 QIAquick PCR purification kit QIAGEN Cat# 28104 QIAquick gel extraction kit QIAGEN Cat# 28706 QIAGEN plasmid plus maxi kit QIAGEN Cat# 12963 Qubit 1X dsDNA HS assay kit Invitrogen Cat# Q33231 SYBR Green I Yeasen Cat# 10222ES60 1 Kb DNA ladder TransGen Biotech Cat# BM201-01 Deposited data Metabolic Mini-pool CRISPR in vivo Wang et al. 1 GEO: GSE279723 Experimental models: Cell lines Human clear-cell ovarian carcinoma cell: ES-2 ATCC Cat# CRL-1978, RRID:CVCL_3509 HEK-293T NICR 1101HUM-PUMC000010 Experimental models: Organisms/strains Mouse: BALB/c nude SHANGHAI SLAC LABORATORY ANIMAL Female, 6–8 weeks Oligonucleotides Array-F N/A TAACTTGAAAGTATTTCGATTTCTTGGCTTT Array-R N/A ACTTTTTCAAGTTGATAACGGACTAGCCTT NGS-Lib-Fwd-1 N/A AATGATACGGCGACCACCGAGATCTACACTCTTTCCC NGS-Lib-Fwd-2 N/A AATGATACGGCGACCACCGAGATCTACACTCTTTCCCT NGS-Lib-Fwd-3 N/A AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTA NGS-Lib-Fwd-4 N/A AATGATACGGCGACCACCGAGATCTACACTCTTTCCCT NGS-Lib-Fwd-5 N/A AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTA NGS-Lib-Fwd-6 N/A AATGATACGGCGACCACCGAGATCTACACTCTTTCCCT NGS-Lib-Fwd-7 N/A AATGATACGGCGACCACCGAGATCTACACTCTTTCC NGS-Lib-Fwd-8 N/A AATGATACGGCGACCACCGAGATCTACACTCTTTCCC NGS-Lib-Fwd-9 N/A AATGATACGGCGACCACCGAGATCTACACTCTTTCCC NGS-Lib-Fwd-10 N/A AATGATACGGCGACCACCGAGATCTACACTCTTTCCC NGS-Lib-Rev N/A CAAGCAGAAGACGGCATACGAGATNNNNNNNNGTG sg NMNAT1 N/A AATGGGTGGAAGTTGATACA sg NMNAT1 N/A ACACCATCAAGAGAAATTGG sg NMNAT1 N/A ACTCATTCCTGCCTATCACC sg NMNAT1 N/A TGAAGACATCACCCAAATCG Recombinant DNA pLenti-CRISPR-v2 Addgene Cat# 52961 Human pooled mini-CRISPR library Wang et al. 1 N/A pLP1 Beijing Zoman Biotechnology Cat# ZK838 pLP2 Beijing Zoman Biotechnology Cat# ZK839 pLP/VSVG Beijing Zoman Biotechnology Cat# ZK840 Software and algorithms BioRender BioRender http://biorender.com/ Adobe Illustrator Adobe www.adobe.com R v.4.2.3 R https://www.r-project.org/ MAGeCK v.0.5.9.4 Li et al. 2 https://sourceforge.net/p/mageck/wiki/ MAGeCK-Flute v.2.8.0 Wang et al. 3 https://bioconductor.org/packages/release/bioc/html/MAGeCKFlute.html clusterProfiler v.4.12.6 Yu et al. 4 https://bioconductor.org/packages/release/bioc/html/clusterProfiler.html ggplot2 v.3.5.2 ISBN 978-3-319-24277-4 https://cran.r-project.org/web/packages/ggplot2/index.html Other gentleMACS C tube Miltenyi Biotec Cat# 130-093-237 gentleMACS Octo dissociator with heaters Miltenyi Biotec Cat# 130-096-427 Qubit 4 Invitrogen Cat# Q33238 Gemini X2 electroporation system BTX Cat# 45-2040 Biospace Optima Biospace Lab Photon Imager Optima Illumina HiSeq X Illumina N/A NanoDrop spectrophotometer Thermo Fisher Scientific NanoDrop One C Step-by-step method details Custom sgRNA library design and construction  Timing: 4 weeks The protocol begins with custom sgRNA library construction, including 1) designing sgRNAs for target genes of interest; 2) synthesizing, amplifying, and purifying oligo pools; 3) cloning into lentiviral backbones; and 4) transformation and plasmid preparation. Quality control involves NGS verification of sgRNA distribution and mapping efficiency. This standardized 4-week workflow ensures representation of all designed guides while minimizing bias for downstream screening applications. 1. Prepare the target gene list of interest according to the purpose of the study. Note: https://geneontology.org/ https://www.genome.jp/kegg/ 2. Select sgRNAs for each gene in the list using software tools including CRISPick ( https://portals.broadinstitute.org/gppx/crispick/public CRITICAL: in vivo CRITICAL: CRITICAL: Note: tracr https://portals.broadinstitute.org/gpp/public/ 5 , 6 3. Synthesize the pooled sgRNA oligo library as a custom DNA array using a commercial high-throughput synthesis service (for instance, GeneWiz or GenScript). 4. PCR amplification of pooled oligo library for integration. a. Prepare the PCR master mix using the components listed below: Reagent Amount NEBNext High Fidelity PCR Master Mix, 2× 25 μL Pooled oligo library template from Step 2 (25 ng/ L) 1 μL Array-F 1.25 μL Array-R 1.25 μL ddH 2 21.5 μL Total 50 μL Note: b. Perform PCR programs using the following cycling conditions. Steps Temperature Time Cycles Initial Denaturation 98°C 30 sec 1 Denaturation 98°C 10 sec 25 cycles Annealing 63°C 10 sec Extension 72°C 15 sec Final extension 72°C 2 min 1 Hold 4°C Forever CRITICAL: c. Run the amplified DNA on a 2% (wt/vol) agarose gel in a TAE buffer with SYBR Green dye. Note: d. Carefully excise the target band-containing gel fragment and purify the PCR products using the QIAGEN Gel Extraction Kit according to the manufacturer’s manual and use Qubit fluorometer to quantify the concentration of the DNA products. 5. Prepare the linearized backbone. a. Digest the pLentiCRISPR-v2 plasmids with restriction enzyme Esp Bsm Reagent Amount FastDigest Buffer, 10× 2 μL Library Plasmid Backbone 1–2 μL FastDigest Esp Bsm 1 μL FastAP Thermosensitive Alkaline phosphatase 1 μL DTT, 100 mM 0.2 μL ddH 2 13.8–14.8 μL Total 20 μL b. Incubate the digestion mix at 37°C for 1–2 h. c. Run the double-strand fragments on a 1.2% (wt/vol) agarose gel in TAE buffer with SYBR Green dye. d. Carefully excise the target band-containing gel fragment and purify the PCR products using the QIAGEN Gel Extraction Kit according to the manufacturer’s manual and use Qubit fluorometer to quantify the concentration of the products. 6. Use HiFi DNA assembly mix to ligate the pooled insert with the backbone vector. a. Prepare the master mix for HiFi reactions at 4°C according to the below table. Reagent Amount NEB HiFi Assembly Master Mix, 2× 10 μL Digested pLentiCRISPR_v2 backbone from Step 5 330 ng sgRNA library insert from Step 4 50 ng ddH 2 X μL Total 20 μL Note: b. Incubate the HiFi assembly reaction at 50°C for 1 h after the preparation of the master mix is completed. Note: 7. Purify and concentrate the assembled plasmids. a. Prepare the mix according to the following table: Reagent Amount HiFi Assembly Reaction Product 20 μL Pre-cooled isopropanol 20 μL GlycoBlue Coprecipitant 0.2 μL NaCl solution, 5 M 0.4 μL Total 40.6 μL b. Pipette and incubate the mix at −20°C for 1 h and centrifuge at >15,000 g c. Remove the supernatant and wash the DNA pellets with pre-cooled 80% ethanol (v/v) twice. Note: d. Centrifuge at 12,000 g e. Carefully remove the residual ethanol and dry for 20 min. Resolve the DNA pellet in 5 μL of pre-warmed Ultrapure water (65°C) and use Qubit fluorometer to quantify the DNA concentration. f. Dilute the library DNA to 50–100 ng/μL with Ultrapure water. CRITICAL: CRITICAL: Figure 3 Note: Figure 3 Determining assembly efficiency by gel electrophoresis, related to step 7 sgRNA library insert (∼140 bp), digested pLentiCRISPR_v2 backbone (∼13,000 bp), and HiFi assembly reaction product were resolved on a 2% TAE agarose gel. Electrophoresis was performed at 120 V for 30 min in 1× TAE buffer, followed by SYBR green staining and UV visualization. 1 Kb DNA ladder were included for size validation. 8. Electroporate the library DNA prepared above using Endura ElectroCompetent cells according to the manufacturer’s manual. a. Thoroughly chill 1.5 mL microcentrifuge tubes and electroporation cuvettes on ice before use. b. Thaw Endura electrocompetent cells completely on ice, then aliquot 25 μL of cells into the pre-chilled 1.5 mL tubes. c. Add 1 μL of library DNA to the 25 μL of cells while keeping the mixture on ice. d. Gently transfer the 25 μL cell/DNA mixture into a pre-chilled electroporation cuvette, avoiding the introduction of air bubbles. e. Conduct electroporation using the Gemini X2 Electroporation System (BTX, Cat# 45-2040) with the following settings: 10 μF, 600 Ohms, 1800 Volts, and a pulse duration of 10 milliseconds. f. Immediately add 1 mL Recovery Buffer to the cuvette. g. Transfer the cell suspension to a culture tube and incubate at 37°C with shaking at 225 rpm for 1 h. CRITICAL: Note: Note: Stbl 9. Prepare the counting plate and transfer the electroporated cells to large LB plates. a. Prepare serial dilutions of electroporated cells: i. Create 1,000× dilution by mixing 10 μL electroporated cells with 990 μL LB medium (mix thoroughly by pipetting). ii. Prepare 10,000× dilution by adding 100 μL of the 1,000× dilution to 900 μL LB medium. iii. Plate 100 μL aliquots from both dilutions on pre-warmed LB agar plates (100-mm Petri dish) as the counting plates to determine electroporation efficiency. iv. Count the colony numbers on the 10,000 diluted plate and multiply 10,000 as the total colony numbers. b. Transfer the remained liquid in the raw tube to pre-warmed LB plates (245 ∗ 245 mm) and spread them evenly. c. Incubate all LB agar plates for 8–12 h at 37°C. CRITICAL: 10. Collect E.coli a. Calculate the electroporation efficiency by counting plates. Proceed with the following steps only if the electroporation coverage is over 500-fold. For example, at least 5 million colonies should be harvested for a library containing 10,000 sgRNAs. b. Evenly add 15 mL LB medium onto the Large LB plate, then shake horizontally at 80 rpm for 15 min at 25°C. Collect the medium carefully. c. Repeat Step 10b. Collect the medium into the same 50 mL tube. Centrifuge at 5,000 g for 10 min at 25°C. d. Extract the library plasmids using QIAGEN Plasmid Plus Max Kit according to the manufacturer’s manual. CRITICAL: Note: Note: 11. Prepare samples for next-generation sequencing to quantify the relative abundances and distribution of sgRNAs in the library. a. Use PCR to amplify the sgRNA target regions with sgRNA sequencing primers. Prepare the master mix and perform the PCR reaction using the following tables, respectively: Reagent Amount KAPA HiFi HotStart ReadyMix, 2× 25 μL Template from Step 10d or Step 18h 50 ng (for plasmid library from Step 10d), 3–5 μg (for gDNA from Step 18h) NGS-Lib-Fwd 1 μL NGS-Lib-Rev 1 μL ddH 2 X μL Total 50 μL Steps Temperature Time Cycles Initial Denaturation 95°C 5 min 1 Denaturation 98°C 20 sec 25 cycles Annealing 60°C 15 sec Extension 72°C 15 sec Final extension 72°C 2 min 1 Hold 4°C forever CRITICAL: b. Pool the PCR reactions and purify the PCR products using the QIAquick PCR Purification Kit according to the manufacturer’s directions. Quantify the DNA concentration by Qubit fluorometer. c. Run the purified products on the 2% (w/v) agarose gel. Cast the gel to collect the bands ranging from 260 to 270 bp for purification by QIAquick Gel Extraction Kit according to the manufacturer’s directions. d. Quantify the DNA concentration by Qubit fluorometer. e. Perform sgRNA sequencing on an Illumina HiSeq X platform using 2×150 bp reads with P7 indexing. We recommend obtaining more than 100× coverage per sgRNA. 12. Analyzing the sgRNA distribution in the plasmid library using the MAGeCK algorithm. a. Download the raw sequencing data (.fastq files). b. Calculate the sgRNA counts by mageck-count using the following scripts. Optimal parameters and annotations are also listed below. $ mageck count -l library.txt -n plasmid.library –sample-label plasmid –fastq filename.R1.fastq.gz –fastq-2 filename.R2.fastq.gz –norm-method none Parameter Explanation Annotation -l File containing the sgRNA IDs, sequences and target gene symbols, either in .csv or .txt format – -n Prefix of the output file – --sample label Sample name of each input Separate the sample names by comma (,) when simultaneously inputting multiple libraries. --fastq .fastq filename Separate the sample by space; separate technical replicates by a comma (,) in the case of inputting multiple libraries simultaneously. --norm-method Method of normalization, including the “none” (no normalization), “median” (median normalization), “total” (normalization with total sgRNA counts), and “control” (normalization with provided control matrix specified by optional parameter --control-sgrna) For quality control of the plasmid library, we recommend calculating the sgRNA counts without normalization. --control-sgrna (optional parameters) File containing the non-targeting sgRNA IDs Use this parameter only if the –norm-method specifies the “control”. c. Determine the quality of the library using the parameters from the count_summary.txt, including the Mapping Reads/Total Reads, Gini Index, and Zero Counts. d. Draw density plots or histograms to depict the distribution of sgRNA counts. CRITICAL: Figure 3 In vivo  Timing: 7 weeks The in vivo 13. Generate lentiviral particles containing the CRISPR library for subsequent cell infection. a. Plate 5 million HEK293-T cells into one 15-cm dish with 26 mL complete DMEM medium (10% FBS + 1% Pen/Strep). b. Culture cells in a 37°C incubator with 5% CO 2 7 c. At 8 h post-transfection, replace the medium containing transfection reagent with fresh complete DMEM medium (10% FBS + 1% Pen/Strep). d. Incubate HEK293-T cells for 48 h and collect the supernatant. Filter the supernatant with a 0.45-μm filter and store the lentiviruses at −80°C. 14. Determine the viral titer to optimize the infection condition and ensure efficient delivery of the CRISPR library. a. Seed cells of interest at 20% confluence in 10-cm culture dishes and incubate for 24 h to ensure complete cell adhesion. b. Perform preliminary lentiviral transductions using a viral dilution series supplemented with 8 μg/mL polybrene to establish optimal infection conditions for achieving a final multiplicity of infection (MOI) of 0.1–0.5. c. Following an 8–12 h incubation period, refresh the complete DMEM medium (10% FBS + 1% Pen/Strep) to remove polybrene. d. 48 h post-infection, harvest cells, determine the initial cell count (n0) and initiate puromycin selection. Maintain cells by refreshing the medium every 48 h. e. Following 3 days of selection, terminate the antibiotic treatment and quantify the surviving cells (nt). f. Calculate the multiplicity of infection (MOI) using the formula: MOI = nt/n0. CRITICAL: 15. Infect cells with the pooled library according to the previously tested infection rate. Repeat steps 14a–14e. Note: 16. Inject transduced cells into mice via the appropriate route (e.g., intravenous, subcutaneous, or intraperitoneal) for disease modeling. a. After 2–7 days of antibiotic selection (puromycin, in this case), cells were washed with PBS, digested with trypsin and harvested by the complete medium. Wash the cell pellets with PBS twice and resuspend them in PBS buffer. b. Quantify and collect sufficient cells as a pre-injection group. c. Dilute cells in PBS buffer to 1–10 million cells per milliliter, depending on the size of the customized library and the injection methods. CRITICAL: 7 d. Inject cells into mice using the proposed injection method. 17. Harvest target tissues from the animals and dissociate into single-cell suspensions for downstream analysis. a. Starting 3–7 days post-injection, monitor tumors every 2–3 days using vernier calipers (physical dimensions) or bioluminescence imaging (luminescent models). b. Euthanize mice when any of the following humane endpoints are reached: 1) Primary tumor diameter ≥ 20 mm; 2) > 20% body weight loss in 72 h; 3) severe clinical symptoms (lethargy, impaired mobility, or neurological deficits). c. Aseptically harvest target tissues, place them in ice-cold PBS and mince tissues into <2 mm 3 Note: d. Centrifuge cell suspensions at 300 g g e. Aspirate the supernatant and retain the cell pellet for either cryopreservation or immediate culture. Optional: in vitro in vitro 18. Isolate gDNA from the dissociated tissues or cells to prepare for sgRNA detection and quantitation. a. For lysis of 4 × 10 6 b. Add 350 μL saturated NaCl solution (∼26% w/v, saturated in water at 20°C) to the lysed samples and vortex for thorough mixing. c. Add 400 μL of chloroform to each sample and vortex for thorough mixing. d. Centrifuge samples at 12,000 g e. Add 400 μL of isopropanol to the supernatant and mix thoroughly, centrifuge the samples at 12,000 g f. Discard the supernatant and wash the gDNA pellets twice with ice-cold 75% ethanol. Place the tube in the fume hood to air-dry. g. Redissolve gDNA pellets by adding 100–200 μL of pre-warmed (65°C) Ultrapure water once they transition from milky white to slightly translucent. h. Quantify the DNA concentration using a Nanodrop Spectrophotometer. 19. Perform PCR to enrich the sgRNA-containing regions, preparing the samples for sequencing (see Step 11a). CRITICAL: 20. Prepare sequencing samples following the same steps at 11b–d. Computational data analysis for screening results  Timing: 1 week CRISPR screening, particularly in vivo in vivo in vivo in vivo 2 , 3 7 8 9 , 10 , 11 21. Download the fastq or fastq.gz files and store them in the same path. 22. Calculate the sgRNA counts by mageck-count using the following scripts. Note: $ mageck count -l mini_pool.csv -n minipool_control --norm-method control --control-sgrna sg_control.txt --sample-label pre_injection_1,pre_injection_2,pre_injection_3,pre_injection_4,s.c_1,s.c_2,s.c_3,s.c_4,liver_1,liver_2,liver_3,liver_4,lung_1,lung_2,lung_3,lung_4 --fastq HFL-1_S1_L001_R1_001.fastq.gz HFL-2_S12_L001_R1_001.fastq.gz HFL-3_S16_L001_R1_001.fastq.gz HFL-4_S17_L001_R1_001.fastq.gz HFL-9_S22_L001_R1_001.fastq.gz HFL-10_S2_L001_R1_001.fastq.gz HFL-11_S3_L001_R1_001.fastq.gz HFL-12_S4_L001_R1_001.fastq.gz HFL-13_S5_L001_R1_001.fastq.gz HFL-14_S6_L001_R1_001.fastq.gz HFL-15_S7_L001_R1_001.fastq.gz HFL-16_S8_L001_R1_001.fastq.gz HFL-17_S9_L001_R1_001.fastq.gz HFL-18_S10_L001_R1_001.fastq.gz HFL-19_S11_L001_R1_001.fastq.gz HFL-20_S13_L001_R1_001.fastq.gz --fastq-2 HFL-1_S1_L001_R2_001.fastq.gz HFL-2_S12_L001_R2_001.fastq.gz HFL-3_S16_L001_R2_001.fastq.gz HFL-4_S17_L001_R2_001.fastq.gz HFL-9_S22_L001_R2_001.fastq.gz HFL-10_S2_L001_R2_001.fastq.gz HFL-11_S3_L001_R2_001.fastq.gz HFL-12_S4_L001_R2_001.fastq.gz HFL-13_S5_L001_R2_001.fastq.gz HFL-14_S6_L001_R2_001.fastq.gz HFL-15_S7_L001_R2_001.fastq.gz HFL-16_S8_L001_R2_001.fastq.gz HFL-17_S9_L001_R2_001.fastq.gz HFL-18_S10_L001_R2_001.fastq.gz HFL-19_S11_L001_R2_001.fastq.gz HFL-20_S13_L001_R2_001.fastq.gz CRITICAL: CRITICAL: 23. Determine gene essentiality using the provided scripts with either RRA (Robust Rank Aggregation) or MLE (Maximum-Likelihood Estimation). $ mageck test -k mini_pool.count_normalized.txt -n rra_test_liver1 --norm-method control --control-sgrna sg_control.txt -t liver_1 -c s.c_1 Or $ mageck test -k mini_pool.count_normalized.txt -n rra_test_liver --norm-method control --control-sgrna sg_control.txt -t liver_1,liver_2,liver_3,liver_4 -c s.c_1,s.c_2,s.c_3,s.c_4 –paired $ mageck mle -k mini_pool.count_normalized.txt -n metastasis -d design_matrix.txt --norm-method control --control-sgrna sg_control.txt Parameter Explanation Annotation -k Input file name Output file from the megeck count module. -n Prefix of the output file - -t Sample names of treatment experiments Separate the sample names by comma (,) -c Sample names of control group Separate the sample names by comma (,) --norm-method Method of normalization, including the “none” (no normalization), “median” (median normalization), “total” (normalization with total sgRNA counts), “control” (normalization with provided control matrix specified by optional parameter --control-sgrna) We recommend using the “median” or “control” parameters, according to the option selected in the mageck count module. --control-sgrna (optional) File containing the non-targeting sgRNA IDs Use this parameter only if the –norm-method specifies the “control”. --paired (optional) Paired sample comparisons We recommend using this parameter for paired comparison. CRITICAL: CRITICAL: in vivo in vitro in vitro in vivo in vitro in vivo in vivo in vitro 24. Visualize the results by MAGeCK-Flute in R using the following codes (a. for RRA; b for MLE) ( Figure 4 a. RRA. > library(MAGeCKFlute) > library(clusterProfiler) > library(ggplot2) > setwd(\"filepath\") > gene.df <- read.table(\"sample.matrix.control.gene_summary.txt\", sep = \"∖t\", header = T) > sgrna.df <- read.table(\"sample.matrix.control.sgrna_summary.txt\", sep = \"∖t\", header = T) > FluteRRA(gene.df, sgrna.df, proj=\"sample\", incorporateDepmap = T, organism=\"hsa\", outdir = \"./\") b. MLE. > library(MAGeCKFlute) > library(clusterProfiler) > library(ggplot2) > setwd(\"filepath\") > mle.df <- read.table(\"sample.matrix.mle.gene_summary.txt\", sep = \"∖t\", header = T) > FluteMLE(file3, treatname=\"sample1\", ctrlname=\"sample2\", proj=\"sample\", organism=\"hsa\") Parameter Explanation Annotation -k Input file name Output file from the mageck count module -n Prefix of the output file - -d Design matrix of conditions. Example table is represented as below. Sample names in row, conditions in column. Use 1 or 0 to distinguish the conditions among samples. --norm-method Method of normalization, including the “none” (no normalization), “median” (median normalization), “total” (normalization with total sgRNA counts), “control” (normalization with provided control matrix specified by optional parameter --control-sgrna) We recommend using the “median” or “control” parameters, according to the option selected in the mageck count module. --control-sgrna (optional) File containing the non-targeting sgRNA IDs Use this parameter only if the –norm-method specifies the “control”. Samples Baseline in.vivo_growth liver_mets lung_mets pre_injection_1 1 0 0 0 s.c_1 1 1 0 0 liver_1 1 0 1 0 lung_1 0 0 0 1 or Samples Baseline in.vivo_growth liver_mets lung_mets pre_injection_1 1 0 0 0 pre_injection_2 1 0 0 0 pre_injection_3 1 0 0 0 pre_injection_4 1 0 0 0 s.c_1 1 1 0 0 s.c_2 1 1 0 0 s.c_3 1 1 0 0 s.c_4 1 1 0 0 liver_1 1 0 1 0 liver_2 1 0 1 0 liver_3 1 0 1 0 liver_4 1 0 1 0 lung_1 1 0 0 1 lung_2 1 0 0 1 lung_3 1 0 0 1 lung_4 1 0 0 1 CRITICAL: https://www.bioconductor.org/packages/release/bioc/vignettes/MAGeCKFlute/inst/doc/MAGeCKFlute.html Note: in vivo i. Employ multiple parallel cohorts (e.g., biologically adequate group sizes). ii. Track tumor progression rigorously (e.g., bioluminescence imaging or tumor volumetry). iii. Harvest tissues at matched disease stages (e.g., group mice with comparable metastasis burden at endpoint). iv. Aggregate sgRNA counts (MAGeCK) within stage-matched groups; for low-input samples (e.g., disseminated metastases), pooled gDNA analysis is permissible. v. Compare metastatic vs. primary tumor samples within stage-matched groups to minimize false negatives from progression-related heterogeneity. vi. Integrate cross-group differential analyses and prioritize candidate genes based on biological relevance. Figure 4 Quality assessment of the custom sgRNA library, related to expected outcomes This figure was reused from Wang et al. (2025). (A) Lorenz curve analysis of sgRNA distribution in the custom sgRNA library. (B) Composition analysis of targeting and non-targeting sgRNA in the custom sgRNA library. Functional validation of candidate genes associated with the screening phenotype  Timing: 7–8 weeks This step facilitates validation of the robustness of the screen and enables selection of high-confidence candidate genes for subsequent functional and mechanistic studies involving the screening phenotype. Our screening results identified NMNAT1 NMNAT1 25. Construct the plasmids inserted with individual sgRNAs targeting NMNAT1. a. Top- and bottom-strand oligonucleotides corresponding to 4 individual NMNAT1 Sequence name Targeted gene Strand Species Sequence (5′ – 3′) V2-sg NMNAT1 NMNAT1 Top Homo sapiens CACCGAATGGGTGGAAGTTGATACA V2-sg NMNAT1 NMNAT1 Top Homo sapiens CACCGACACCATCAAGAGAAATTGG V2-sg NMNAT1 NMNAT1 Top Homo sapiens CACCGACTCATTCCTGCCTATCACC V2-sg NMNAT1 NMNAT1 Top Homo sapiens CACCGTGAAGACATCACCCAAATCG V2-sg NMNAT1 NMNAT1 Bottom Homo sapiens AAACCGATTTGGGTGATGTCTTCAC V2-sg NMNAT1 NMNAT1 Bottom Homo sapiens AAACGGTGATAGGCAGGAATGAGTC V2-sg NMNAT1 NMNAT1 Bottom Homo sapiens AAACCCAATTTCTCTTGATGGTGTC V2-sg NMNAT1 NMNAT1 Bottom Homo sapiens AAACTGTATCAACTTCCACCCATTC b. Transform the Gibson assembly reaction mixture into Stbl3 c. Verify the correct insertion of sgRNAs by sequencing using the U6 promoter forward primer. 26. Generate ES-2-MC2-Hep cell lines expressing sgRNAs targeting NMNAT1. a. Transfect the HEK293-T cells (maintained in DMEM with 10% FBS) with the plasmid using Lipofectamine-2000. b. After 48 h, collect the virus-containing supernatant and determine lentivirus titer using the Lenti-X GoStix Plus kit. c. Perform viral transduction by incubating ES-2-MC2-Hep cells (20%–30% confluency in 6-well plates) with virus supernatant in 8 μg/mL polybrene-containing medium for 24 h. d. After infection, replace the viral medium with fresh medium and culture for another 24 h before selecting stable transfectants with 1–2 μg/mL puromycin. e. Expand ES-2-MC2-Hep cells expressing sg NMNAT1 β 27. Intraperitoneally implant 1 × 10 6 NMNAT1 28. After tumor growth and metastasis development, euthanize several tumor-bearing mice at least 14 days post-implantation and collect the lung and liver tissues for subsequent ex vivo 29. Acquire the BLI images using a BioSpace Optima small animal imaging system for 1 min and quantify the normalized photon counts. 30. To validate the role of NMNAT1 ex vivo NMNAT1 Figure 5 Figure 5 In vivo NMNAT1 (A) Bar graph comparing Gini coefficients quantifying sgRNA distribution equality in ES-2-MC2-Hep cells across experimental conditions: pre-injection, subcutaneous tumors, and liver/lung metastasis from the in vivo (B) Cumulative frequency distribution of normalized sgRNA counts in ES-2-MC2-Hep cells across experimental conditions: pre-injection, subcutaneous tumors, and liver/lung metastasis from the in vivo (C) Scatter plot showing the rank and log 2 in vivo NMNAT1 Expected outcomes The protocol is designed to generate a high-quality custom sgRNA library with balanced representation of all sgRNAs. Prior to the experiment, we anticipate successful PCR amplification and efficient insertion of sgRNA fragments into the plasmid backbone. The library should exhibit minimal bias, as confirmed by a Lorenz curve with an AUC near 0.5 and symmetrical histograms of sgRNA counts ( Figures 4 in vivo Figures 5 NMNAT1 Figure 5 NMNAT1 in vivo ex vivo Figures 6 Figure 6 Experimental validation of the metastasis-promoting function of NMNAT1 This figure was reused from Wang et al. (2025). (A) Immunoblot analysis of NMNAT1 knockout efficiency in ES-2-MC2-Hep cells expressing NMNAT1 (B–C) Liver (B) and lung (C) metastatic burden quantification by ex vivo NMNAT1 p Limitations While this protocol aims to provide a versatile framework for various experimental scenarios, certain limitations warrant consideration due to technical constraints and research scope. Microenvironmental complexity In vivo Protocol scope and extensions The current protocol focuses on lentiviral transduction of cancer cells in vitro in vivo Troubleshooting Problem 1 The major bottleneck in custom library preparation involves optimizing two critical efficiencies: (1) sgRNA fragment assembly and (2) bacterial electroporation. For large libraries, even modest reductions in either parameter dramatically decrease clone diversity and library complexity, limiting experimental utility. Potential solution Execute parallel assembly reactions to maximize integrated sgRNA libraries (Step 6), followed by DNA concentration (ethanol precipitation/commercial kits) (Step 7). Electroporate at 100–200 ng/μL using high-efficiency cells (>10 9 Problem 2 A significant technical challenge of in vivo Potential solution To address this challenge, we recommend a multi-step purification approach: First, use specialized tissue dissociation kits combined with lysis buffers to remove hematopoietic cell contamination (Step 17d). For enhanced purity, implement fluorescence-activated cell sorting (FACS) using either pre-introduced fluorescent markers or cell surface-specific antibodies. As an alternative approach, consider short-term in vitro Problem 3 While we have established a streamlined pipeline for CRISPR screen data analysis here, the mathematical modeling required to integrate sgRNA differential effects and calculate gene essentiality remains inherently complex. This complexity is further confounded by the physiological intricacies of in vivo Potential solution For effective CRISPR screen analysis using mathematical modeling, we emphasize two priorities: (1) enhancing raw data quality through stringent experimental controls and (2) optimizing study design for MAGeCK compatibility. While alternative analytical methods exist for specialized cases, most researchers benefit most from robust data generation and proper experimental design. Complex applications may require collaboration with computational biologists to evaluate alternative approaches. Resource availability Lead contact Further information and requests for resources and reagents should be directed to and will be fulfilled by the lead contact, Xi Wang ( wangxi@westlake.edu.cn Technical contact Technical questions on executing this protocol should be directed to and will be addressed by the technical contact, Yuqi Wang ( wangyuqi@westlake.edu.cn Materials availability This study did not generate new reagents. Data and code availability The datasets used in this paper have been listed in key resources table Acknowledgments We thank the Westlake University Laboratory Animal Resource Center and Biomedical Research Core Facilities for technical support and Repugene (Hangzhou), Inc. for DNA-sequencing services. We thank members of the Wang and Zou labs for discussion and daily support. This work was supported by the National Key Research and Development Program of China 2023YFA0914900 R&D Program of Zhejiang 2024SSYS0036 Westlake Laboratory of Life Sciences and Biomedicine 2024SSYS0033 2024SSYS0034 Westlake Education Foundation Westlake University Research Center for Industries of the Future National Natural Science Foundation of China 82273257 and 32450793 Author contributions Y.W. and M.H. performed the experiments. M.H. and X.W. performed the data analysis. X.W. and Y.Z. conceived and supervised the project. The authors co-wrote the manuscript. Declaration of interests Y.Z. is a consultant for Keen Therapeutics. References 1 Wang Y. Hu M. Cao J. Wang F. Han J.R. Wu T.W. Li L. Yu J. Fan Y. Xie G. ACSL4 and polyunsaturated lipids support metastatic extravasation and colonization Cell 188 2025 412 429.e27 39591965 10.1016/j.cell.2024.10.047 2 Li W. Xu H. Xiao T. Cong L. Love M.I. Zhang F. Irizarry R.A. Liu J.S. Brown M. Liu X.S. MAGeCK enables robust identification of essential genes from genome-scale CRISPR/Cas9 knockout screens Genome Biol. 15 2014 554 25476604 10.1186/s13059-014-0554-4 PMC4290824 3 Wang B. Wang M. Zhang W. Xiao T. Chen C.-H. Wu A. Wu F. Traugh N. Wang X. Li Z. Integrative analysis of pooled CRISPR genetic screens using MAGeCKFlute Nat. Protoc. 14 2019 756 780 30710114 10.1038/s41596-018-0113-7 PMC6862721 4 Yu G. Wang L.-G. Han Y. He Q.-Y. clusterProfiler: an R package for comparing biological themes among gene clusters OMICS 16 2012 284 287 22455463 10.1089/omi.2011.0118 PMC3339379 5 Chen B. Gilbert L.A. Cimini B.A. Schnitzbauer J. Zhang W. Li G.-W. Park J. Blackburn E.H. Weissman J.S. Qi L.S. Huang B. Dynamic imaging of genomic loci in living human cells by an optimized CRISPR/Cas system Cell 155 2013 1479 1491 24360272 10.1016/j.cell.2013.12.001 PMC3918502 6 Hsu P.D. Scott D.A. Weinstein J.A. Ran F.A. Konermann S. Agarwala V. Li Y. Fine E.J. Wu X. Shalem O. DNA targeting specificity of RNA-guided Cas9 nucleases Nat. Biotechnol. 31 2013 827 832 23873081 10.1038/nbt.2647 PMC3969858 7 Morgens D.W. Deans R.M. Li A. Bassik M.C. Systematic comparison of CRISPR/Cas9 and RNAi screens for essential genes Nat. Biotechnol. 34 2016 634 636 27159373 10.1038/nbt.3567 PMC4900911 8 Hart T. Moffat J. BAGEL: a computational framework for identifying essential genes from pooled library screens BMC Bioinf. 17 2016 164 10.1186/s12859-016-1015-8 PMC4833918 27083490 9 Wang X. Tokheim C. Gu S.S. Wang B. Tang Q. Li Y. Traugh N. Zeng Z. Zhang Y. Li Z. In vivo CRISPR screens identify the E3 ligase Cop1 as a modulator of macrophage infiltration and cancer immunotherapy target Cell 184 2021 5357 5374.e22 34582788 10.1016/j.cell.2021.09.006 PMC9136996 10 Li Y. Ran Q. Duan Q. Jin J. Wang Y. Yu L. Wang C. Zhu Z. Chen X. Weng L. 7-Dehydrocholesterol dictates ferroptosis sensitivity Nature 626 2024 411 418 38297130 10.1038/s41586-023-06983-9 PMC11298758 11 Su P. Liu Y. Chen T. Xue Y. Zeng Y. Zhu G. Chen S. Teng M. Ci X. Guo M. In vivo CRISPR screens identify a dual function of MEN1 in regulating tumor-microenvironment interactions Nat. Genet. 56 2024 1890 1902 39227744 10.1038/s41588-024-01874-9 PMC11387198 ",
  "metadata": {
    "Title of this paper": "In vivo CRISPR screens identify a dual function of MEN1 in regulating tumor-microenvironment interactions",
    "Journal it was published in:": "STAR Protocols",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478239/"
  }
}