{
  "title": "Paper_26",
  "abstract": "pmc Future Oncol Future Oncol 3069 futoncol Future Oncology 1479-6694 1744-8301 Taylor & Francis PMC12490388 PMC12490388.1 12490388 12490388 40888418 10.1080/14796694.2025.2550826 2550826 1 Version of Record Review Article Drug Evaluation Repurposing nirogacestat, a gamma secretase enzyme inhibitor in desmoid tumors G. TANSIR ET AL. FUTURE ONCOLOGY Tansir Ghazal  a Rastogi Sameer  a Gounder Mrinal M.  b a All India Institute of Medical Sciences New Delhi India b Memorial Sloan Kettering Cancer Center and Weill Cornell Medical College New York NY USA CONTACT Mrinal M. Gounder gounderm@mskcc.org NY USA 1 9 2025 2025 21 23 498190 2985 2993 01 09 2025 03 10 2025 03 10 2025 Integra 16 9 2025 Integra 16 9 2025 03 6 2025 19 8 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group. 2025 The Author(s) https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivatives License ( http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT The gamma secretase (GS) enzyme controls cell–cell adhesion, neural stem cell proliferation, neo-angiogenesis, spinal maturation, and metabolism of amyloid precursor proteins (APP). Pathological production of abnormal amyloid-beta isoforms and senile plaques serves as the basis for pathogenesis of Alzheimer’s disease (AD). GS enzyme inhibitors such as semagacestat and avagacestat were explored in AD but the studies were paused because of adverse events attributed to their influence on the Notch pathway. Crosstalk between Notch and Wnt signaling pathways created a potential role for GS inhibitors in the treatment of malignancies such as glioblastoma multiforme, pancreatic, and breast cancers. In a phase I study on nirogacestat among refractory solid malignancies, overall response rate (ORR) of 71.4% was observed in desmoid tumor (DT). The pivotal DeFi phase III trial established superiority of nirogacestat in terms of progression-free survival and ORR, reducing the likelihood of progression by 71%. Emphasis was placed on patient-reported outcomes (PRO) including the DT-specific tool, GOunder/Desmoid Tumor Research Foundation DEsmoid Symptom Scale (GODDESS). Nirogacestat received Food and Drug Administration (FDA) approval in November 2023 and European Commission approval in August 2025 for adults with progressing desmoid tumors (DT) who require systemic treatment. Further studies are underway to investigate other GS inhibitors such as AL-102 in the management of DT. Plain Language Summary The role of the enzyme gamma secretase (GS) was discovered in various processes of adhesion between various cells, formation of blood vessels and development of new nerve systems. This enzyme has been found to have a role in the onset and worsening of Alzheimer’s disease (AD), which is a type of dementia. Some clinical trials examined if GS-inhibiting drugs could help in the treatment of AD but were not pursued further due to significant side effects. However, in another study, it was discovered that the same class of medications was able to act against the rare disease known as desmoid tumor (DT). One of these drugs, nirogacestat, was initially examined in a small study which included patients with various cancers, including DT. The patients in this study had different types of cancers which had failed previous treatments. Among these patients, those with DT experienced good treatment outcome with 71.4% showing reduction in size of the tumor using nirogacestat. Being a rare disease, conducting trials with a greater number of patients was difficult in DT because of various reasons such as patients being scattered across countries, doctors being unaware of treatment options and the lesser efforts from the pharmaceutical industry. The patient advocacy group Desmoid Tumor Research Foundation (DTRF) came to the fore to help overcome these difficulties and act as a platform for the patients and physicians to help in collaborations and conduct further studies. Encouraging findings were obtained and finally the pivotal clinical trial (DeFi study) which demonstrated that nirogacestat was a new, superior treatment option for DT. Nirogacestat also improved the quality of life of the enrolled patients, which is an important factor in chronic diseases such as DT. The results of this study paved the way for the Food and Drugs Administration (FDA) approval of nirogacestat in the management of DT. We present the journey of these GS inhibitors, from the biological aspect to its role in the treatment of DT. KEYWORDS Desmoid gamma secretase inhibitor drug development rare tumors patient advocacy MSKCC Mrinal Gounder was supported by an institutional grant to MSKCC (P30 CA008748/CA/NCI NIH-HHS). Funding to permit Open Access for this article was provided by SpringWorks Therapueutics, however the funder had no role in the study design, data collection, data analysis, decision to publish, or preparation of manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Desmoid tumors (DT) are mesenchymal monoclonal lesions with a locally aggressive and recurrent nature [ 1 2 1 3 4 5 6 7 8 1.1. The physiology of the gamma secretase enzyme GS is an intramembrane enzyme complex which acts as an aspartyl protease involved in multiple physiological processes. GS belongs to the group of intramembrane cleaving proteases (i-CLIPs) which primarily functions by regulated intramembrane proteolysis [ 9 10–15 16 Figure 1 Figure 1. A mechanistic overview of Wnt/β-catenin pathway working in cross-talk with notch signaling pathway involved in desmoid tumor. (A) Upon binding of Wnt to Frizzled and LRP 5/6 heterodimeric receptor, there is phosphorylation of LRP 5/6 and disheveled, leading to removal of Axin from the APC-CK1-GSK 3β complex. This leads to inhibition of ubiquitin-mediated proteolytic degradation of β-catenin leading to its stabilization and accumulation in the cytoplasm. The β-catenin leads to increased transcription activation of multiple genes producing proteins such as COX-2, MMP, VEGF, WISP-1, CD44, HES-1 which play pivotal roles in cell proliferation, fibrosis, angiogenesis, and inflammation. Mutations in APC or CTNNB1 lead to continuation of transcription of Wnt-targeted genes in a Wnt-independent manner. (B) An inciting event in sporadic desmoid tumor (such as trauma, pregnancy, unknown factors) or FAP-associated disease harboring APC mutations leads to formation of MSCs in stem cell-like state and a stable, activated β-catenin. The increased β-catenin due to CTNNB1 or APC-mutations also keeps JAG-1 upregulated in cases of FAP mutation-associated desmoid tumors. Components of Notch receptor include PEN-1/2, NCT, APH-1 (1a/1b), PEN-2. Binding of Jagged-1/Delta-like 1 ligands to Notch receptors leads to sequential cleavage by ADAM 10/17 followed by gamma secretase enzyme. Release of NICD leads to increased transcription of Notch-target genes such as HES-1 and HEY-1. Gamma secretase also activates CD44, which in combination with HA forms the CD44-HA complex. This complex reduces cell adhesion, loss of cell polarity, and increased cell migration. Abbreviations: ADAM 10/17: A Disintegrin and Metalloprotease 10/17; APC: Adenomatous polyposis coli; CD44: Cluster of differentiation 44; CK1: Casein kinase 1; COX-2: Cyclooxygenase-2; FAP: Familial adenomatous polyposis; GSK-3β: Glycogen synthase kinase-3β; HA: Hyaluronate; HES-1: Hairy and enhancer of split-1; HEY-1: Hairy enhancer of split related with YRPW motif-1; JAG1: Jagged1; LRP: Lipoprotein receptor-related proteins 5/6; MMP2: Matrix metalloproteinase-2; MSC: Mesenchymal stem cells; NICD: Notch intracellular domain; VEGF: Vascular endothelial growth factor. Presenilin-1: This is the most critical and catalytic subunit, which depends on the maturity of the GS complex for its functioning. It exists in the form of N-terminal (NTF) and C-terminal (CTF) fragments that interact with presenilin enhancer-2 (PEN-2) and Anterior pharynx defective-1a (APH-1a) PEN-2 APH-1a: This component helps in the assembly and stabilization of the GS complex, along with working in tandem with other subunits. Nicastrin (NCT): This is a type-1 transmembrane glycoprotein that regulates the entry of the bulky substrates into the active site of the GS enzyme. The physiological role of the GS enzyme commences upon cleavage of the substrate protein that leads to downstream translocation of the product into the nucleus and regulation of transcription. One of the most studied substrates metabolized by this pathway is the Notch and APP proteins. After cleavage, Notch protein is converted to the Notch intracellular domain (NICD) which thereby controls the processes of cell proliferation, cell survival, positioning, and differentiation ( Figure 1 9 17 18–20 21 1.2. Exploring the role of GS inhibitors in Alzheimer’s disease GS plays an important role in the onset and development of AD production because this enzyme is a part of the last processing step of the APP [ 22 22 Considering this as the key pathogenic event in the onset and progression of AD, the pathway of APP metabolism has been a subject of therapeutic investigation [ 7 23 24 25 25 26 27 2. Preclinical information on GS inhibition in oncology There is currently evolving knowledge on the association of GS in oncology through proteins such as Notch, ErbB4, CD44, cadherins, VEGFR1, IGFR1 and MUC1 [ 8 28 29 30 min/+ 31 32–36 The role of GS and its accompanying pathways in the development of cancer became the subject of therapeutic interest for anti-cancer strategies. Pre-clinical evidence exhibited potential activity of GS inhibitors in cancers such as Kaposi’s sarcoma, multiple myeloma, glioblastoma, ovarian cancer, lung cancer and pancreatic cancer [ 37–42 43–45 46 3. Nirogacestat – the pharmacology of a GS inhibitor that forayed into treatment of desmoid tumors An oral GS inhibitor, nirogacestat, was initially studied for the treatment of AD but did not advance from preclinical to clinical settings due to toxicities noted with other medicines of the same class [ 47 48 Nirogacestat (then PF-03084014) was first investigated in a phase I study with 64 patients with various refractory solid malignancies including 14.1% patients with DT [ 49 50 51 This unexpected response produced with nirogacestat in patients with DT piqued interest in better understanding the biology of this phenomenon. The role of dysregulated Wnt signaling is implicated in DT pathogenesis both in germline and sporadic cases. Sporadic cases of DT occur due to mutation of the beta-catenin oncogene CTNNB1 gene leading to its constitutive activation, while germline cases occur in 5–10% due to mutation of the APC gene which itself is a regulator of beta-catenin degradation [ 52 53 54 55 56 57–60 61 62 63 64 65 Figure 1 GS inhibitors could thereby play a potential therapeutic role in DT because of the cross-links between Notch and Wnt signaling, and the involvement of GS in the Notch pathway [ 21 30 31 66 31 The encouraging outcomes in the phase I study warranted a phase II trial, however certain challenges were encountered in the course of this development. Research into rare diseases, such as DT with around 1000–1650 cases diagnosed annually, can suffer from issues such as reduced clinician awareness, misdiagnosis, less industry interest, and difficulties in recruitment [ 67 68 69 70 The success of this phase II study lays in the conduct of a single-center trial on a rare condition, which informed the need for a phase III trial in DT. The trial also emphasized the need for DT-specific PRO tools because ultimately the quality of life (QoL) was the more relevant metric as opposed to other endpoints such as RECIST-based ORR, progression-free survival (PFS) and overall survival (OS) in this chronic disease. The planning of a phase III trial was interrupted by the de-prioritization of nirogacestat development for DT. Following efforts by clinicians and researchers in academia, Pfizer’s out-licensing rights of nirogacestat, and engagement of investors, SpringWorks Therapeutics was founded [ 66 71 3.1. Conduct of the pivotal phase III trial and the ultimate FDA approval for nirogacestat in DT Prior to the phase III study of nirogacestat, the only drug assessed in a randomized placebo-controlled setting for DT was sorafenib, the results of which were published in 2018 [ 72 With Springworks’ efforts to secure adequate financing and collaboration with DTRF to ensure patient recruitment, the DeFi trial commenced recruitment in 2019 and was completed in 15 months [ 6 Ovarian toxicity was identified in 27 of 36 (75%) of the females of reproductive potential (FORP). The unique adverse event of ovarian toxicity was defined as amenorrhea, premature menopause, menopause, and ovarian failure in the DeFi study. As per preclinical data, nirogacestat produces ovarian dysfunction possibly due to the disruption of ovarian follicular cycling which is also mediated by Notch signaling. The development of normal ovarian follicles requires various components of the Notch pathway which is evident by their expression in the pre-antral follicles [ 73 74 75 76 PROs formed the secondary endpoints, measured using Brief Pain Inventory-Short Form (BPI-SF) average worst pain intensity score, GOunder/Desmoid Tumor Research Foundation DEsmoid Symptom Scale (GODDESS) Desmoid Tumor Symptom Scale (DTSS) and Impact Scale (DTIS) physical functioning domain score, European Organization for Research and Treatment of Cancer Quality of Life Questionnaire (EORTC QLQ)-C30 global health status – quality of life score, EORTC QLQ-C30 physical functioning score, and EORTC QLQ-C30 role functioning score. The GODDESS tool has been developed prospectively as a novel regulatory and clinical trial endpoint, also complementing the existing tools [ 77 78 3.2. Key considerations on the use of nirogacestat in DT There was a difference noted in the response rates obtained with nirogacestat in the clinical trials conducted in DT across the years. The number of patients with DT in the phase I study was too small to make a concrete conclusion on the efficacy of the drug. In the phase II study, the ORR of 29% could be reflective of the refractoriness of disease because the included patients had received a median of 4 (1–9) lines of prior therapy, including cytotoxic therapy in 71%. In contrast, the DeFi trial included 26% treatment-naïve patients in the nirogacestat arm, with a median number of 2 lines of therapy in this cohort. No direct comparisons are available between sorafenib and nirogacestat; only the latter is FDA approved. Sorafenib differs from nirogacestat due to its multikinase inhibition at the Ras/Raf/MEK/ERK signaling as well as the pro-angiogenic VEGF, PDGFR-beta, and c-KIT pathways [ 79 72 Data on the pharmaco-economic aspect of use of nirogacestat in DT remains lacking, and further studies are needed to determine the cost-effectiveness of the drug in this rare condition. It would be helpful to generate cost-effectiveness data on nirogacestat among different populations and healthcare settings to understand the hurdles in global access and affordability. Reimbursement options are available from insurance facilities in the Unites States. Nirogacestat has been approved in the United States and the European Union and has not yet obtained approval in India. Hence, there is a challenge in its accessibility in other countries. In these settings, clinicians may choose the treatment agents based on the local drug availability, affordability, and side effect profile in consideration. In India, sorafenib and imatinib are more in use for the treatment of DT, while the use of tamoxifen, non-steroidal anti-inflammatory agents, methotrexate, and vinblastine has reduced in recent years [ 80 4. Regulatory affairs Based on the outcomes of the phase I and II studies, the FDA had granted nirogacestat the Orphan Drug Designation and Fast Track Designation for the treatment of adult patients with progressive, unresectable, recurrent, or refractory DT in 2018 [ 81 82 83 5. Conclusions The trajectory of development of nirogacestat demonstrates how a drug proceeded from evaluation for other diseases to various phases of progress in a rare disorder following early-phase unexpected results. The understanding of the pathophysiology vis-a-vis the functioning of the GS enzyme complex in DT enabled researchers to recognize this possibility. Currently, other GS inhibitors are under investigation for use in DT. AL-102 is currently being evaluated in the phase 3 RINGSIDE (AL-DES-01) trial, while the result from Part A or the phase 2 stage demonstrated its safety, tolerability, and dosage. At 1.2 mg once-daily dosing, the best response was PR in 50%, disease control rate was 100% and a deeper, rapid, and maintained result compared to other dose regimens [ 84 85 Article highlights  Desmoid tumors are rare, locally aggressive, recurrent mesenchymal lesions causing chronic pain, decline in QoL, organ dysfunction, and disability in the young subset of population. Desmoid tumors are driven by the Notch/Wnt cross-talking signaling pathway; Notch is a substrate of the gamma secretase enzyme. Gamma secretase inhibitors were initially explored for treatment of Alzheimer’s disease because gamma secretase enzyme is involved in the amyloid precursor protein metabolism, but produced several off-target side effects. Nirogacestat is a gamma secretase enzyme inhibitor, whose activity in phase I 3 + 3 dose-finding trial was found to be high with an overall response rate of 71%. Conduct of a further phase II study faced difficulties in recruitment which were overcome with efforts from the patient advocacy group, Desmoid Tumor Research Foundation. The response rates with nirogacestat 150 milligram twice daily dosage was 29%, with an improvement in the symptom burden of the recruited patients. The pivotal phase III DeFi trial exhibited overall response rate of 41% and at 2 years the likelihood of being event-free was 76% versus 44% with nirogacestat and placebo respectively. Significant side effects included diarrhea, nausea, fatigue, hypophosphatemia, maculopapular rash, stomatitis, headache, cutaneous toxicity, and reversible ovarian dysfunction. The DeFi trial included assessment of patient-reported outcomes using a DT-specific GOunder/Desmoid Tumor Research Foundation DEsmoid Symptom Scale (GODDESS) Desmoid Tumor Symptom Scale (DTSS) and Impact Scale (DTIS). Based on the findings of the phase I and II trials nirogacestat received breakthrough FDA approval for treatment of progressive, unresectable, recurrent/refractory DT in 2019. Following the DeFi trial, nirogacestat received FDA approval for the treatment of progressive DT requiring systemic therapy. Authors contributions Ghazal Tansir contributed to the conception, execution, literature review, writing the manuscript Sameer Rastogi contributed to the conception, revision, critical review of the manuscript Mrinal Gounder contributed to the conception, execution, literature review, critical review, revision of manuscript All authors have agreed on the journal to which the article is being submitted. All authors have reviewed and agreed on all versions of the article before submission, during revision, the final version accepted for publication, and any significant changes introduced at the proofing stage. All authors agree to take responsibility and be accountable for the contents of the article and to share responsibility to resolve any questions raised about the accuracy or integrity of the published work. The authors have no relevant affiliations or financial involvement with any organization or entity with a financial interest in or financial conflict with the subject matter or materials discussed in the manuscript. This includes employment, consultancies, honoraria, stock ownership or options, expert testimony, grants or patents received or pending, or royalties. Disclosure statement The authors have no relevant affiliations or financial involvement with\nany organization or entity with a financial interest in or financial conflict with the subject matter\nor materials discussed in the manuscript. This includes employment, consultancies, honoraria,\nstock ownership or options, expert testimony, grants or patents received or pending, or royalties. Reviewer disclosures Peer reviewers on this manuscript have no relevant financial or other relationships to disclose. Correction Statement This article was originally published with errors, which have now been corrected in the online version. Please see Correction ( http://dx.doi.org/10.1080/14796694.2025.2560753 References  Papers of special note have been highlighted as either of interest (•) or of considerable interest (••) to readers. 1. Kasper B Ströbel P Hohenberger P. Desmoid tumors: clinical features and treatment options for advanced disease Oncologist 2011 16 5 682 693 10.1634/theoncologist.2010-0281 21478276 PMC3228186 2. Alman B Attia S Baumgarten C The management of desmoid tumours: a joint global consensus-based guideline approach for adult and paediatric patients Eur J Cancer 2020 Mar 127 96 107 10.1016/j.ejca.2019.11.013 32004793 3. Penel N Chibon F Salas S Adult desmoid tumors: biology, management and ongoing trials Curr Opin Oncol 2017 Jul 29 4 268 274 10.1097/CCO.0000000000000374 28489620 PMC5470853 4. Bektas M Bell T Khan S Desmoid tumors: a comprehensive review Adv Ther 2023 Sep 40 9 3697 3722 10.1007/s12325-023-02592-0 37436594 PMC10427533 5. Garg V Rastogi S Kalra K Health-related quality of life (HRQoL), anxiety, and depression in patients with desmoid type fibromatosis Support Care Cancer 2022 Dec 30 12 10089 10098 10.1007/s00520-022-07445-0 36350382  • A study published by our research team highlighting the disturbances in quality of life and impact of desmoid tumor on affected patients. 6. Gounder M Ratan R Alcindor T Nirogacestat, a γ-secretase inhibitor for desmoid tumors N Engl J Med 2023 Mar 8 388 10 898 912 10.1056/NEJMoa2210140 36884323 PMC11225596  • Phase III study that led to FDA approval of nirogacestat in desmoid tumors. 7. Barten DM Meredith JE Zaczek R Gamma-secretase inhibitors for Alzheimer’s disease Drugs R & D 2006 7 2 87 97 10.2165/00126839-200607020-00003 16542055 8. McCaw TR Inga E Chen H Gamma secretase inhibitors in cancer: a current perspective on clinical performance Oncologist 2021 Apr 26 4 e608 21 10.1002/onco.13627 33284507 PMC8018325  • A review describing the various studies and outcomes with gamma secretase inhibitors that were assessed for different malignancies and their current role. 9. Kopan R Ilagan MXG The canonical Notch signaling pathway: unfolding the activation mechanism Cell 2009 Apr 17 137 2 216 233 10.1016/j.cell.2009.03.045 19379690 PMC2827930 10. De Strooper B Saftig P Craessaerts K Deficiency of presenilin-1 inhibits the normal cleavage of amyloid precursor protein Nature 1998 Jan 22 391 6665 387 390 10.1038/34910 9450754 11. De Strooper B Annaert W Cupers P A presenilin-1-dependent γ-secretase-like protease mediates release of Notch intracellular domain Nature 1999 398 6727 518 522 10.1038/19083 10206645 12. Marambaud P A presenilin-1/gamma-secretase cleavage releases the E-cadherin intracellular domain and regulates disassembly of adherens junctions Embo J 2002 Apr 15 21 8 1948 1956 10.1093/emboj/21.8.1948 11953314 PMC125968 13. Ni CY Murphy MP Golde TE γ-secretase cleavage and nuclear localization of ErbB-4 receptor tyrosine kinase Science 2001 Dec 7 294 5549 2179 2181 10.1126/science.1065412 11679632 14. Lammich S Okochi M Takeda M Presenilin-dependent intramembrane proteolysis of CD44 leads to the liberation of its intracellular domain and the secretion of an Aβ-like peptide J Biol Chem 2002 Nov 22 277 47 44754 44759 10.1074/jbc.M206872200 12223485 15. Wang R Tang P Wang P Regulation of tyrosinase trafficking and processing by presenilins: partial loss of function by familial Alzheimer’s disease mutation Proc Natl Acad Sci USA 2006 Jan 10 103 2 353 358 10.1073/pnas.0509822102 16384915 PMC1326180 16. Strooper BD Iwatsubo T Wolfe MS Presenilins and -secretase: structure, function, and role in Alzheimer disease Cold Spring Harb Perspect Med 2012 Jan 1 2 1 a006304 10.1101/cshperspect.a006304 22315713 PMC3253024 17. Andersson ER Sandberg R Lendahl U Notch signaling: simplicity in design, versatility in function Development 2011 Sep 1 138 17 3593 3612 10.1242/dev.063610 21828089 18. Wong GT Manfra D Poulet FM Chronic treatment with the γ-secretase inhibitor LY-411,575 inhibits β-amyloid peptide production and alters lymphopoiesis and intestinal cell differentiation J Biol Chem 2004 Mar 26 279 13 12876 12882 10.1074/jbc.M311652200 14709552 19. Nowell C Radtke F Cutaneous Notch signaling in health and disease Cold Spring Harb Perspect Med 2013 Dec 3 12 a017772 10.1101/cshperspect.a017772 24296353 PMC3839599 20. Lodewijk GA Fernandes DP Vretzakis I Evolution of human brain size-associated NOTCH2NL genes proceeds toward reduced protein levels Mol Biol Evol 2020 Sep 1 37 9 2531 2548 10.1093/molbev/msaa104 32330268 PMC7475042 21. Nakayama K Nagase H Koh CS γ-secretase-regulated mechanisms similar to Notch signaling may play a role in signaling events, including APP signaling, which leads to Alzheimer’s disease Cell Mol Neurobiol 2011 Aug 31 6 887 900 10.1007/s10571-011-9688-z 21516353 PMC11498397 22. Siegel G Gerber H Koch P The Alzheimer’s disease γ-secretase generates higher 42: 40 ratios for β-amyloid than for p3 peptides Cell Rep 2017 Jun 6 19 10 1967 1976 10.1016/j.celrep.2017.05.034 28591569 23. May PC Yang Z Li WY O3–06–07 multi-compartmental pharmacodynamic assessment of the functional gamma-secretase inhibitor LY450139 in PDAPP transgenic mice and non-transgenic mice Neurobiol Aging 2004 Jul 1 25 S65 10.1016/S0197-4580(04)80220-3 24. Coric V van Dyck CH Salloway S Safety and tolerability of the γ-secretase inhibitor avagacestat in a phase 2 study of mild to moderate Alzheimer disease Arch Neurol 2012 Nov 69 11 1430 1440 10.1001/archneurol.2012.2194 22892585 25. Doody RS Raman R Farlow M A phase 3 trial of semagacestat for treatment of Alzheimer’s disease N Engl J Med 2013 Jul 25 369 4 341 350 10.1056/NEJMoa1210951 23883379 26. Gillman KW Starrett JE Parker MF Discovery and evaluation of BMS-708163, a potent, selective and orally bioavailable γ-secretase inhibitor ACS Med Chem Lett 2010 Jun 10 1 3 120 124 10.1021/ml1000239 24900185 PMC4007960 27. Nordvall G Lundkvist J Sandin J Gamma-secretase modulators: a promising route for the treatment of Alzheimer’s disease Front Mol Neurosci 2023 Oct 16 16 1279740 10.3389/fnmol.2023.1279740 37908487 PMC10613654 28. Chen X Jung JG Shajahan-Haq AN ChIP-BIT: bayesian inference of target genes using a novel joint probabilistic model of ChIP-seq profiles Nucleic Acids Res 2016 Apr 20 44 7 e65 10.1093/nar/gkv1491 26704972 PMC4838354 29. Cheng YL Choi Y Sobey CG Emerging roles of the γ-secretase-notch axis in inflammation Pharmacol Ther 2015 Mar 147 80 90 10.1016/j.pharmthera.2014.11.005 25448038 30. Collu GM Hidalgo-Sastre A Brennan K Wnt–Notch signalling crosstalk in development and disease Cell Mol Life Sci 2014 Sep 71 18 3553 3567 10.1007/s00018-014-1644-x 24942883 PMC11113451 31. Badenes M Trindade A Pissarra H Delta-like 4/Notch signaling promotes ApcMin/+ tumor initiation through angiogenic and non-angiogenic related mechanisms BMC Cancer 2017 Jan 13 17 1 50 10.1186/s12885-016-3036-0 28086833 PMC5237288 32. Gou C Han P Li J Knockdown of lncRNA BLACAT1 enhances radiosensitivity of head and neck squamous cell carcinoma cells by regulating PSEN1 Br J Radiol 2020 Apr 93 1108 20190154 10.1259/bjr.20190154 31944856 PMC7362927 33. Meng F Qian L Lv L miR-193a-3p regulation of chemoradiation resistance in oesophageal cancer cells via the PSEN1 gene Gene 2016 Apr 1 579 2 139 145 10.1016/j.gene.2015.12.060 26743123 34. Liu B Wang L Shen LL RNAi-mediated inhibition of presenilin 2 inhibits glioma cell growth and invasion and is involved in the regulation of Nrg1/ErbB signaling Neuro Oncol 2012 Aug 14 8 994 1006 10.1093/neuonc/nos138 22753229 PMC3408263 35. Lombardo Y Filipović A Molyneux G Nicastrin regulates breast cancer stem cell properties and tumor growth in vitro and in vivo Proc Natl Acad Sci USA 2012 Oct 9 109 41 16558 16563 10.1073/pnas.1206268109 23012411 PMC3478621 36. Wang X Wang X Xu Y Effect of nicastrin on hepatocellular carcinoma proliferation and apoptosis through PI3K/AKT signalling pathway modulation Cancer Cell Int 2020 20 1 91 10.1186/s12935-020-01172-4 32226312 PMC7092570 37. Curry CL Reed LL Golde TE Gamma secretase inhibitor blocks Notch activation and induces apoptosis in Kaposi’s sarcoma tumor cells Oncogene 2005 Sep 22 24 42 6333 6344 10.1038/sj.onc.1208783 15940249 38. Chen F Pisklakova A Li M Gamma-secretase inhibitor enhances the cytotoxic effect of bortezomib in multiple myeloma Cell Oncol 2011 Dec 34 6 545 551 10.1007/s13402-011-0060-6 PMC3417352 21965140 39. Monticone M Biollo E Fabiano A z-leucinyl-leucinyl-norleucinal induces apoptosis of human glioblastoma tumor–initiating cells by proteasome inhibition and mitotic arrest response Mol Cancer Res 2009 Nov 7 11 1822 1834 10.1158/1541-7786.MCR-09-0225 19861404 40. Chen X Gong L Ou R Sequential combination therapy of ovarian cancer with cisplatin and γ-secretase inhibitor MK-0752 Gynecol Oncol 2016 Mar 140 3 537 544 10.1016/j.ygyno.2015.12.011 26704638 41. Xie M He J He C γ secretase inhibitor BMS-708163 reverses resistance to EGFR inhibitor via the PI3K/Akt pathway in lung cancer J Cell Biochem 2015 Jun 116 6 1019 1027 10.1002/jcb.25056 25561332 42. Mizuma M Rasheed ZA Yabuuchi S The gamma secretase inhibitor MRK-003 attenuates pancreatic cancer growth in preclinical models Mol Cancer Ther 2012 11 9 1999 2009 10.1158/1535-7163.MCT-12-0017 22752426 PMC3438318 43. Krop I Demuth T Guthrie T Phase I pharmacologic and pharmacodynamic study of the gamma secretase (Notch) inhibitor MK-0752 in adult patients with advanced solid tumors J Clin Oncol 2012 Jul 1 30 19 2307 2313 10.1200/JCO.2011.39.1540 22547604 44. Tolcher AW Messersmith WA Mikulski SM Phase I study of RO4929097, a gamma secretase inhibitor of Notch signaling, in patients with refractory metastatic or locally advanced solid tumors J Clin Oncol 2012 Jul 1 30 19 2348 2353 10.1200/JCO.2011.36.8282 22529266 PMC5950496 45. Fouladi M Stewart CF Olson J Phase I trial of MK-0752 in children with refractory CNS malignancies: a Pediatric Brain Tumor Consortium study J Clin Oncol 2011 Sep 10 29 26 3529 3534 10.1200/JCO.2011.35.7806 21825264 PMC3179253 46. Means-Powell JA Mayer IA Ismail-Khan R A phase Ib dose escalation trial of RO4929097 (a γ-secretase inhibitor) in combination with exemestane in patients with ER + metastatic breast cancer (MBC) Clin Breast Cancer 2022 Feb 22 2 103 114 10.1016/j.clbc.2021.10.013 34903452 PMC8821119  •• Phase I dose-finding study which demonstrated for the first time the response rates produced with nirogacestat in desmoid tumors. 47. Wood KM Lanz TA Coffman KJ P2–375: efficacy of the novel γ-secretase inhibitor, PF-3084014, in reducing Aβ in brain, CSF, and plasma in Guinea pigs and Tg2576 mice Alzheimers & Dementia 2008 4 4S_Part_14 T482 3 10.1016/j.jalz.2008.05.1453 48. Available from: https://www.accessdata.fda.gov/drugsatfda_docs/label/2023/217677Orig1s000_Corrected_lbl.pdf 49. Messersmith WA Shapiro GI Cleary JM A phase I, dose-finding study in patients with advanced solid malignancies of the oral γ-secretase inhibitor PF-03084014 Clin Cancer Res 2015 Jan 1 21 1 60 67 10.1158/1078-0432.CCR-14-0607 25231399 50. Villalobos VM Hall F Jimeno A Long-term follow-up of desmoid fibromatosis treated with PF-03084014, an oral gamma secretase inhibitor Ann Surg Oncol 2018 Mar 25 3 768 775 10.1245/s10434-017-6082-1 28887726 51. Kasper B Gruenwald V Reichardt P Imatinib induces sustained progression arrest in RECIST progressive desmoid tumours: final results of a phase II study of the German interdisciplinary sarcoma group (GISG) Eur J Cancer 2017 May 76 60 67 10.1016/j.ejca.2017.02.001 28282612 52. Lazar AJF Tuvin D Hajibashi S Specific mutations in the beta-catenin gene (CTNNB1) correlate with local recurrence in sporadic desmoid tumors Am J Pathol 2008 Nov 173 5 1518 1527 10.2353/ajpath.2008.080475 18832571 PMC2570141 53. Latchford A Volikos E Johnson V APC mutations in FAP-associated desmoid tumours are non-random but not “just right Hum Mol Genet 2007 Jan 1 16 1 78 82 10.1093/hmg/ddl442 17135276 54. Hankey W Frankel WL Groden J Functions of the APC tumor suppressor protein dependent and independent of canonical WNT signaling: implications for therapeutic targeting Cancer Metastasis Rev 2018 Mar 37 1 159 172 10.1007/s10555-017-9725-6 29318445 PMC5803335 55. Skubitz KM Skubitz APN Gene expression in aggressive fibromatosis J Lab Clin Med 2004 Feb 143 2 89 98 10.1016/j.lab.2003.10.002 14966464 56. Timbergen MJM Smits R Grünhagen DJ Activated signaling pathways and targeted therapies in desmoid-type fibromatosis: a literature review Front Oncol 2019 9 397 10.3389/fonc.2019.00397 31165043 PMC6534064 57. Dumoulin B Susztak K Fibrosis uncovered: aDAMTS12 cuts to the core of extracellular matrix drama J Clin Investigation 2024 Sep 17 134 18 e183115 10.1172/JCI183115 PMC11405032 39286974 58. Singh K Oladipupo SS An overview of CCN4 (WISP1) role in human diseases J Transl Med 2024 Jun 27 22 1 601 10.1186/s12967-024-05364-8 38937782 PMC11212430 59. Yang Y Cao Y The impact of VEGF on cancer metastasis and systemic disease Semin Cancer Biol 2022 Nov 1 86 251 261 10.1016/j.semcancer.2022.03.011 35307547 60. Signoroni S Frattini M Negri T Cyclooxygenase-2 and platelet-derived growth factor receptors as potential targets in treating aggressive fibromatosis Clin Cancer Res 2007 Sep 1 13 17 5034 5040 10.1158/1078-0432.CCR-07-0336 17785554 61. Kohsaka S Hirata M Ikegami M Comprehensive molecular and clinicopathological profiling of desmoid tumours Eur J Cancer 2021 Mar 1 145 109 120 10.1016/j.ejca.2020.12.001 33444924 62. Wu C Nik-Amini S Nadesan P Aggressive fibromatosis (desmoid tumor) is derived from mesenchymal progenitor cells Cancer Res 2010 Sep 29 70 19 7690 7698 10.1158/0008-5472.CAN-10-1656 20841474 63. Wielenga VJM Smits R Korinek V Expression of CD44 in APC and TCF mutant mice implies regulation by the WNT pathway Am J Pathol 1999 Feb 154 2 515 523 10.1016/S0002-9440(10)65297-2 10027409 PMC1850011 64. Nagano O Saya H Mechanism and biological significance of CD44 cleavage Cancer Sci 2004 Dec 95 12 930 935 10.1111/j.1349-7006.2004.tb03179.x 15596040 PMC11159127 65. Ponta H Sherman L Herrlich PA Cd44: from adhesion molecules to signalling regulators Nat Rev Mol Cell Biol 2003 Jan 4 1 33 45 10.1038/nrm1004 12511867 66. Shang H Braggio D Lee YJ Targeting the Notch pathway: a potential therapeutic approach for desmoid tumors Cancer 2015 121 22 4088 4096 10.1002/cncr.29564 26349011 PMC4635059 67. Augustine EF Adams HR Mink JW Clinical trials in rare disease: challenges and opportunities J Child Neurol 2013 Sep 28 9 1142 1150 10.1177/0883073813495959 24014509 PMC3964003 68. Kummar S Bui N Messersmith WA Nirogacestat—the pathway to approval of the first treatment for desmoid tumors, a rare disease Ther Adv Rare Disease 2025 Apr 1 6 26330040251317546 10.1177/26330040251317546 39944188 PMC11815814 69. Kummar S O’Sullivan Coyne G Do KT Clinical activity of the γ-secretase inhibitor PF-03084014 in adults with desmoid tumors (aggressive fibromatosis) J Clin Oncol 2017 May 10 35 14 1561 1569 10.1200/JCO.2016.71.1994 28350521 PMC5455706  •• The important phase II study, conducted with the concerted efforts of Desmoid Tumor Research Foundation which met the primary endpoint and led to FDA breakthrough approval of nirogacestat in progressive, recurrent, refractory desmoid tumors. 70. Kasper B Ratan R Alcindor T 67MO long-term nirogacestat treatment in adult patients with desmoid tumors: updated efficacy and safety from the phase III DeFi trial ESMO Open 2025 Mar 1 cited 2025 May 9 10 104381 10.1016/j.esmoop.2025.104381 71. FirstWord cited 2025 May 9 https://firstwordpharma.com/story/4448662 72. Gounder MM Mahoney MR Tine BAV Sorafenib for advanced and refractory desmoid tumors N Engl J Med 2018 Dec 20 379 25 2417 2428 10.1056/NEJMoa1805052 30575484 PMC6447029  • First Phase III study on sorafenib in desmoid tumors which led to global off-label use in desmoid tumors. 73. Vanorny DA Mayo KE The role of Notch signaling in the mammalian ovary Reproduction 2017 Jun 153 6 R187 204 10.1530/REP-16-0689 28283672 PMC5512555 74. Jankowska K Premature ovarian failure Prz Menopauzalny 2017 Jun 16 2 51 56 10.5114/pm.2017.68592 28721130 PMC5509972 75. Loggers ET Chugh R Federman N Onset and resolution of ovarian toxicity with nirogacestat treatment in females with desmoid tumors: updated safety analyses from the DeFi phase 3 study Cancer 2024 Aug 15 130 16 2812 2821 10.1002/cncr.35324 38703010 76. Gudsoorkar P Wanchoo R Jhaveri KD Nirogacestat and hypophosphatemia Kidney Int Rep 2023 Apr 29 8 7 1478 10.1016/j.ekir.2023.04.023 37441471 PMC10334393 77. Gounder MM Atkinson TM Bell T Gounder/Desmoid tumor Research Foundation DEsmoid Symptom/impact Scale (Goddess©): psychometric properties and clinically meaningful thresholds as assessed in the phase 3 DeFi randomized controlled clinical trial Qual Life Res 2023 Oct 32 10 2861 2873 10.1007/s11136-023-03445-7 37347393 PMC10474203  •• Phase III DeFi study on nirogacestat in desmoid tumor which exhibited improved response rates and quality of life in patients with desmoid tumors. 78. Van Der Graaf WTA Gounder MM Ratan R Impact of nirogacestat on pain, a key symptom in patients with desmoid tumors (DT): results from the phase 3 DeFi study JCO 2023 Jun 41 16_suppl 11564 11564 10.1200/JCO.2023.41.16_suppl.11564 79. Wilhelm SM Carter C Tang L Bay 43–9006 exhibits broad spectrum oral antitumor activity and targets the RAF/MEK/ERK pathway and receptor tyrosine kinases involved in tumor progression and angiogenesis Cancer Res 2004 Oct 1 64 19 7099 7109 10.1158/0008-5472.CAN-04-1443 15466206 80. Tansir G Sharma A Biswas B A real-world study on the clinicopathological profile, treatment outcomes and health-related quality of life, anxiety and depression among patients with desmoid tumor at two tertiary care centers in India Front Oncol 2024 Oct 21 cited 2024 Dec 10 14 https://www.frontiersin.org/journals/oncology/articles/10.3389/fonc.2024.1382856/full 10.3389/fonc.2024.1382856 PMC11532177 39497712 81. SpringWorks Therapeutics SpringWorks Therapeutics receives FDA fast track designation for nirogacestat for the treatment of adult patients with desmoid tumors https://ir.springworkstx.com/news-releases/news-release-details/springworks-therapeutics-receives-fda-fast-track-designation 82. SpringWorks Therapeutics SpringWorks Therapeutics receives breakthrough therapy designation for nirogacestat for the treatment of adult patients with progressive, unresectable, recurrent or refractory desmoid tumors https://ir.springworkstx.com/news-releases/news-release-details/springworks-therapeutics-receives-breakthrough-therapy 83. Research C for DE and. FDA approves nirogacestat for desmoid tumors 2023 Nov 28 cited 2025 Jul 20 https://www.fda.gov/drugs/resources-information-approved-drugs/fda-approves-nirogacestat-desmoid-tumors 84. Gounder MM Jones RL Chugh R Ringside phase 2/3 trial of AL102 for treatment of desmoid tumors (DT): phase 2 results JCO 2023 Jun 41 16_suppl 11515 11515 10.1200/JCO.2023.41.16_suppl.11515 85. Hultcrantz M Hassoun H Tan CR Belantamab mafodotin, nirogacestat and pomalidomide for patients with relapsed/refractory multiple myeloma Blood 2024 Nov 5 144 Supplement 1 7077 10.1182/blood-2024-211857 ",
  "metadata": {
    "Title of this paper": "Belantamab mafodotin, nirogacestat and pomalidomide for patients with relapsed/refractory multiple myeloma",
    "Journal it was published in:": "Future Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490388/"
  }
}