{
  "title": "Paper_743",
  "abstract": "pmc Front Endocrinol (Lausanne) Front Endocrinol (Lausanne) 1753 frontendo Front. Endocrinol. Frontiers in Endocrinology 1664-2392 Frontiers Media SA PMC12479318 PMC12479318.1 12479318 12479318 41036138 10.3389/fendo.2025.1650782 1 Endocrinology Original Research Association of MIF ARAP1 Zhang Yuxuan  1  2  † Wu Yanying  1  2  † Zeng Qiaoli  1  2  3 Gyan Watson Ray  1  2  3 Huang Sining  1  2 Dai Xiner  1  2 Liu Jia  1  2 Liu Xin  1  2 Wei Yue  4  * Guo Runmin  1  2  3  *  1 Department of Internal Medicine, Shunde Women and Children’s Hospital (Maternity and Child Healthcare Hospital of Shunde Foshan), Guangdong Medical University Foshan, Guangdong China  2 Maternal and Child Research Institute, Shunde Women and Children’s Hospital (Maternity and Child Healthcare Hospital of Shunde Foshan), Guangdong Medical University Foshan, Guangdong China  3 Key Laboratory of Research in Maternal and Child Medicine and Birth Defects, Guangdong Medical University Foshan, Guangdong China  4 Department of Ultrasound, Shunde Women and Children’s Hospital, Maternity and Child Healthcare Hospital of Shunde Foshan, Guangdong Medical University Foshan, Guangdong China Edited by: Nirali Rathwa Reviewed by: Jayvadan Jayantilal Vaishnav, Parul University, India  Parth Pandya *Correspondence: Runmin Guo, runmin.guo@gdmu.edu.cn weiyue138@163.com †These authors have contributed equally to this work and share first authorship 16 9 2025 2025 16 480647 1650782 20 6 2025 27 8 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Zhang, Wu, Zeng, Gyan, Huang, Dai, Liu, Liu, Wei and Guo. 2025 Zhang, Wu, Zeng, Gyan, Huang, Dai, Liu, Liu, Wei and Guo https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Macrophage migration inhibitory factor ( MIF β ARAP1 ARAP1 MIF Methods A case-control study involving 500 GDM patients and 502 healthy controls was conducted. DNA was extracted, and rs1007888 and rs1552224 were systematically genotyped using the SNPscan™ genotyping kit. Statistical methods assessed genotype and allele differences linked to GDM risk, followed by a meta-analysis to evaluate the impact of regional factors on GDM. Results Analyses of ( MIF ARAP1 p p p p p ARAP1 Conclusion The meta-analysis results demonstrate that there is an enhanced likelihood of GDM associated with the MIF ARAP1 macrophage migration inhibitory factor (MIF) Ankyrin Repeat and PH Domain1 ( ARAP1 Rs1007888 rs1552224 gestational diabetes mellitus National Natural Science Foundation of China 10.13039/501100001809 The author(s) declare financial support was received for the research and/or publication of this article. Supported by the National Natural Science Foundation of China (81873649); Doctoral scientific research Initiate funding project of Shunde Women and Children s Hospital of Guangdong Medical University (Maternity and Child Healthcare Hospital of Shunde Foshan) (2020BSQD007); Self-financing science and technology project of Foshan (2320001006049). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Diabetes: Molecular Mechanisms 1 Introduction Gestational diabetes mellitus (GDM) is a pregnancy-specific disorder of glucose metabolism, distinct from pre-existing diabetes, and is increasingly prevalent in China. It poses significant risks to maternal health, including preeclampsia, higher rates of cesarean delivery, and a markedly increased likelihood of developing type 2 diabetes mellitus (T2DM) later in life. Offspring of affected mothers are also at risk of adverse outcomes such as macrosomia, neonatal hypoglycemia, and long-term metabolic complications ( 1 3 4 Although the pathophysiology of GDM is not fully understood, it shares essential features with T2DM, including insulin resistance, impaired glucose tolerance, and β-cell dysfunction ( 2 3 MIF ARAP1 MIF 5 6 ARAP1 7  MIF 8 9 MIF 9 MIF 10 8 Meanwhile, genome-wide association studies (GWAS) consistently implicate ARAP1 11 12 11 13 Despite these insights, data on the association between MIF ARAP1 Therefore, in this study, we examined the associations of MIF ARAP1 2 Materials and methods 2.1 Study participants A total of 1002 participants were recruited for the study, including 500 patients with gestational diabetes mellitus (GDM) and 502 pregnant women without GDM who served as controls. This study protocol was approved by the Ethics Committee of Shunde Women’s and Children’s Hospital Affiliated to Guangdong Medical University (approval ID: 2020072). The inclusion criteria were as follows: participants must provide voluntarily signed informed consent; be of Han ethnicity; be at least 18 years old; have undergone a 75g oral glucose tolerance test (OGTT) between 24 and 28 weeks of gestation and be diagnosed with gestational diabetes mellitus (GDM) or have standard glucose tolerance according to the criteria of the International Association of Diabetes and Pregnancy Study Groups (IADPSG). In the present study, the International Association of Diabetes and Pregnancy Investigation Groups (IADPSG) diagnostic guidelines were employed. If one or more points satisfy the following criteria, GDM was diagnosed: fasting blood glucose (FBG) ≥ 5.1 mmol/L, 1-hour postprandial glucose (PG) ≥ 10.0 mmol/L, or 2-hour PG ≥ 8.5 mmol/L. Expectant mothers falling below these specified limits were classified as healthy control subjects. The exclusion criteria included: presence of pregnancy-related diseases or use of drugs affecting glucose metabolism; history of severe cardiovascular and cerebrovascular diseases, hepatic or renal insufficiency, tumors, or pathogenic infections; and engagement in smoking, alcoholism, drug abuse, or presence of intellectual disability or mental disorders. This study was conducted following the principles outlined in the Declaration of Helsinki. 2.2 Data collection During the 24–28 gestational weeks, comprehensive data were collected, including parity (primigravida or multigravida), pre-pregnancy weight, ethnicity, age, height, blood pressure, and blood glucose levels. The collected data were subsequently employed to compute the pregestational body mass index (pre-BMI, kg/m²), which was defined as the pregestational weight (in kilograms) divided by the square of height (in meters). To determine the obesity status in line with Chinese standards, the following classification criteria were utilized: underweight (< 18.5 kg/m²), normal weight (18.5–24.9 kg/m²), overweight (25–29.9 kg/m²), and obese (≥ 29 kg/m²). This method of classification was adopted based on the research carried out by ( 14 2.3 SNP genotyping and quality control Based on findings from genome-wide association studies (GWAS) of type 2 diabetes mellitus (T2DM) in Asian populations, we selected two candidate SNPs, MIF ARAP1 8 15 16 For each participant, 2 mL of peripheral blood was collected into EDTA tubes and stored at −80 °C until analysis. Genomic DNA was extracted using the QIAamp DNA Blood Kit (Qiagen, Germany) according to the manufacturer’s protocol. SNP genotyping was performed using the SNPscan™ method (Genesky Biotechnologies, Shanghai, China), a high-throughput and highly accurate technique based on dual ligation probe hybridization and multiplex fluorescent PCR. The procedure involves probe ligation to discriminate wild-type and variant alleles, multiplex PCR amplification with fluorescently labeled primers, and capillary electrophoresis to separate amplified fragments. Genotypes were assigned based on fragment length and fluorescent signal intensity. To ensure accuracy, rigorous quality control measures were implemented by Genesky Biotechnologies ( 12 17 2.4 Statistical analyses The analytical evaluations were performed via SPSS 20.0 (SPSS Inc., Chicago, IL, USA), with a bilateral p 2 2 2 2.5 Meta-analysis A thorough literature review and meta-analysis were conducted utilizing the Google Scholar, PubMed, and CNKI databases to assess the association between the MIF ARAP1  Supplementary Table 7 MIF  Supplementary Table 7 The search strategy employed combinations of the terms rs1007888, rs1552224, type 2 diabetes mellitus (T2DM), and gestational diabetes mellitus (GDM). Eligible studies were those that focused on case-control or cohort analyses exploring the association between the rs1007888 and rs1552224 polymorphisms and T2DM or GDM, provided they contained sufficient original data. Studies that did not meet the established diagnostic criteria or deviated from the Hardy-Weinberg equilibrium were excluded from the analysis. Data extraction was carried out independently by two authors, with any discrepancies resolved through consultation with a third party. The kappa coefficient was calculated to evaluate inter-researcher agreement, ensuring the objectivity and accuracy of the study selection process. Meta-analyses were performed across six genetic models, employing fixed-effects or random-effects models depending on the level of heterogeneity observed. Publication bias was assessed using Egger’s and Begg’s tests. All analyses were conducted using STATA version 16.0. This study adheres to the PRISMA guidelines and the Cochrane Handbook. The protocol has been registered with PROSPERO, an internationally recognized platform for the registration of systematic reviews and meta-analyses, under the registration number CRD420251122128. 3 Results 3.1 Overview of the clinical characteristics of the subjects The study’s foundational analysis of 500 GDM patients and 502 non-diabetic controls (  Table 1 p p p Table 1 Fundamental and categorized traits of the study subjects. Variables Cases (%) (N=500) Controls (%) (N=502) t/x 2  P Age, year (mean ± SD) 31 ± 4 29 ± 4 -8.56 <0.001 pre-BMI, kg/m2 21.51 ± 3.10 20.53 ± 2.58 -5.42 <0.001 SBP, mmHg 117 ± 11 114 ± 10 -3.53 <0.001 DBP, mmHg 70 ± 8 68 ± 7.3 -3.23 0.001 FPG, mmol/L 4.82 ± 0.64 4.50 ± 0.31 -9.75 <0.001 1h-PG, mmol/L 10.17 ± 1.60 7.66 ± 1.27 -26.22 <0.001 2h-PG, mmol/L 8.91 ± 1.60 6.69 ± 0.99 -25.85 <0.001 Parity (n) 8.88 0.003 Primipara 210 (42) 258(51.4) Multipara 290(58) 244(48.6) Age, year 49.2 <0.001 < 30 26.60 ± 2.06 25.82 ± 2.70 ≥ 30 33.75 ± 2.84 33.01 ± 2.42 pre-BMI, kg/m2 27.8 <0.001 < 18.5 17.53 ± 0.86 17.65 ± 1.47 18.5 ≤ BMI < 24 20.96 ± 1.49 20.67 ± 1.43 ≥ 24 26.14 ± 2.82 25.82 ± 3.24 SBP, systolic blood pressure; DBP, diastolic blood pressure; pre-BMI, pre-gestational body mass index; FPG, fasting plasma glucose; 1h-PG, 1-hour postprandial glucose; 2h-PG, 2-hour postprandial glucose. 3.2 The relationship between genetic polymorphisms and GDM risk 3.2.1 Overall analysis results The control group’s genetic data provides crucial insights into the Hardy-Weinberg Equilibrium (HWE) of two specific SNPs, rs1007888 and rs1552224. These SNPs are located at chromosomal positions 11:72722053 and 22:23898914, respectively. For rs1007888, the major and minor alleles are C and A, with a Minor Allele Frequency (MAF) of 0.486. For rs1552224, the major and minor alleles are T and C, and its MAF is 0.079 (  Table 2 p Table 2 Information on SNPs and Hardy-Weinberg equilibrium (HWE) test among the controls. SNP Min/Maj Chr. position MAF HWE ( P rs1552224 C/A chr11:72722053 0.079 0.86 rs1007888 T/C chr22:23898914 0.486 0.997 SNP, single nucleotide polymorphisms; Min, minor allele; Maj, major allele; HWE, Hardy–Weinberg equilibrium; MAF, frequency of minor allele. 3.3 Association between SNPs and the risk of GDM in all of the subjects In our study, even after accounting for potential confounding factors such as pre-BMI, systolic and diastolic blood pressure, maternal age, and parity, a robust association between the rs1552224 genetic variant and a reduced risk of GDM remained evident. Specifically, analysis within the dominant model (AA genotype compared to AC + CC genotypes) yielded an odds ratio of 0.641 (95% CI: 0.429-0.959; p p  Table 3  Table 3 Table 3 The correlations between SNPs and the risk of GDM in all of the subjects. Model Cases (%) (n=500) Controls (%) (n=502) Crude OR (95% CI) Crude P Adjusted OR (95% CI) Adjusted P rs1552224 Codominant model AA 450(90.0) 427(85.1) 1(ref) 1(ref) AC 50(10.0) 71(14.1) 0.668(0.455-0.982) 0.04 0.680(0.453-1.020) 0.062 CC 0(0.0) 4(0.80) Aelle model A 950(95.0) 925(92.1) 1(ref) 1(ref) C 50(5.0) 79(7.9) 0.616(0.428-0.888) 0.009 0.624(0.425-0.916) 0.016 Dominant Model AA 450(90.0) 427(85.1) 1(ref) 1(ref) AC+CC 50(10.0) 75(14.9) 0.633(0.432-0.926) 0.019 0.641(0.429-0.959) 0.03 Recessive Model AC+AA 500(100.0) 498(99.2) 1(ref) 1(ref) CC 0(0.0) 4(0.80) NA NA NA NA Overdominant model AA+CC 450(90.0) 431(85.9) 1(ref) 1(ref) AC 50(10.0) 71(14.1) 0.674(0.459-0.991) 0.045 0.686(0.457-1.029) 0.069 rs1007888 Codominant model CC 152(30.4) 133(26.5) 1(ref) 1(ref) CT 230(46.0) 250(49.8) 0.805(0.600-1.080) 0.148 0.783(0.573-1.071) 0.126 TT 118(23.6) 119(23.7) 0.868(0.615-1.225) 0.42 0.867(0.603-1.249) 0.444 Aelle model C 534(53.4) 516(51.4) 1(ref) 1(ref) T 466(46.6) 488(48.6) 0.923(0.774-1.100) 0.369 0.931(0.774-1.121) 0.452 Dominant Model CC 152(30.4) 133(26.5) 1(ref) 1(ref) CT+TT 348(69.6) 369(73.5) 0.825(0.627-1.086) 0.171 0.813(0.607-1.087) 0.162 Recessive Model CT+CC 382(76.4) 383(76.3) 1(ref) 1(ref) TT 118(23.6) 119(23.7) 0.994(0.743-1.331) 0.969 1.037(0.763-1.410) 0.816 Overdominant model CC+TT 270(54.0) 252(50.2) 1(ref) 1(ref) CT 230(46.0) 250(49.8) 0.859(0.670-1.100) 0.229 0.822(0.632-1.069) 0.144 By adjusting for pre-pregnancy body mass index, Systolic blood pressure, Diastolic blood pressure, age, and parity, logistic regression yielded the adjusted p 3.4 Stratified analysis of the differences between SNPs in the ARAP1 MIF Our stratified analysis across six genetic models, meticulously accounting for age and pre-BMI, revealed a compelling association between specific SNPs and GDM risk in subjects under 30 years of age. Notably, the ARAP1 p p  Table 4 ARAP1 Table 4 The connections between SNPs in the ARAP1 MIF Model Cases (%) (n=192) Controls (%) (n=304) Crude OR (95% CI) Crude P Adjusted OR (95% CI) Adjusted P rs1552224 Codominant model AA 173(90.1) 254(83.6) 1(ref) 1(ref) AC 19(9.9) 46(15.1) 0.606(0.344-1.071) 0.085 0.585(0.324-1.053) 0.074 CC 0() 4(1.3) () () Aelle model A 365(95.1) 554(91.1) 1(ref) 1(ref) C 19(4.9) 54(8.9) 0.534(0.311-0.916) 0.023 0.490(0.281-0.857) 0.012 Dominant Model AA 173(90.1) 254(83.6) 1(ref) 1(ref) AC+CC 19(9.9) 50(16.4) 0.558(0.318-0.979) 0.042 0.523(0.292-0.938) 0.03 Recessive Model AC+AA 192(100.0) 300(98.7) 1(ref) 1(ref) CC 0(0.0) 4(1.3) NA NA NA NA Overdominant model AA+CC 173(90.1) 258(84.9) 1(ref) 1(ref) AC 19(9.9) 46(15.1) 0.616(0.349-1.087) 0.095 0.599(0.333-1.077) 0.087 rs1007888 Codominant model CC 63(32.8) 85(28.0) 1(ref) 1(ref) CT 82(42.7) 149(49.0) 0.743(0.486-1.133) 0.168 0.740(0.475-1.152) 0.182 TT 47(24.5) 70(23.0) 0.906(0.553-1.483) 0.694 0.971(0.578-1.630) 0.911 Aelle model C 208(54.2) 319(52.5) 1(ref) 1(ref) T 176(45.8) 289(47.5) 0.934(0.723-1.207) 0.601 0.968(0.742-1.264) 0.812 Dominant Model CC 63(32.8) 85(28.0) 1(ref) 1(ref) CT+TT 129(67.2) 219(72.0) 0.795(0.537-1.176) 0.25 0.818(0.544-1.229) 0.333 Recessive Model CT+CC 145(75.5) 234(77.0) 1(ref) 1(ref) TT 47(24.5) 70(23.0) 1.084(0.709-1.655) 0.711 1.159(0.745-1.803) 0.514 Overdominant model CC+TT 110(57.3) 155(51.0) 1(ref) 1(ref) CT 82(42.7) 149(49.0) 0.775(0.539-1.116) 0.171 0.756(0.517-1.105) 0.149 By adjusting for pre-pregnancy body mass index, Systolic blood pressure, Diastolic blood pressure, age, and parity, logistic regression yielded the adjusted p 3.5 The association between SNPs and GDM risk in individuals with a pre-BMI of 24 or above In our investigation, we observed a compelling association between the ARAP1 2 ARAP1 p  Table 5 ARAP1 ARAP1 Table 5 The correlations between SNPs and GDM risk in individuals with a pre-BMI of 24 or above. Model Cases (%) (n=192) Controls (%) (n=304) Crude OR (95% CI) Crude P Adjusted OR (95% CI) Adjusted P rs1552224 Codominant model AA 89(91.8) 31(73.8) 1(ref) 1(ref) AC 8(8.2) 10(23.8) 0.279(0.101-0.769) 0.014 0.399(0.124-1.291) 0.125 CC 0(0.0) 1(2.4) NA NA NA NA Aelle model A 186(95.9) 72(85.7) 1(ref) 1(ref) C 8(4.1) 12(14.3) 0.258(0.101-0.657) 0.005 0.345(0.124-0.960) 0.042 Dominant Model AA 89(91.8) 31(73.8) 1(ref) 1(ref) AC+CC 8(8.2) 11(26.2) 0.253(0.093-0.687) 0.007 0.337(0.108-1.048) 0.06 Recessive Model AC+AA 97(100.0) 41(97.6) 1(ref) 1(ref) CC 0(0.0) 1(2.4) () () Overdominant model AA+CC 89(91.8) 32(76.2) 1(ref) 1(ref) AC 8(8.2) 10(23.8) 0.288(0.104-0.793) 0.016 0.407(0.126-1.310) 0.132 rs1007888 Codominant model CC 29(29.9) 11(26.2) 1(ref) 1(ref) CT 51(52.6) 23(54.8) 0.841(0.359-1.970) 0.69 0.841(0.336-2.104) 0.712 TT 17(17.5) 8(19.0) 0.806(0.271-2.397) 0.698 1.369(0.363-5.160) 0.643 Aelle model C 109(56.2) 45(53.6) 1(ref) 1(ref) T 85(43.8) 39(46.4) 0.900(0.538-1.505) 0.687 0.978(0.561-1.705) 0.938 Dominant Model CC 29(29.9) 11(26.2) 1(ref) 1(ref) CT+TT 68(86.1) 31(73.8) 0.832(0.369-1.877) 0.658 0.864(0.355-2.107) 0.749 Recessive Model CT+CC 80(82.5) 34(81.0) 1(ref) 1(ref) TT 17(17.5) 8(19.0) 0.903(0.356-2.292) 0.83 1.133(0.394-3.258) 0.816 Overdominant model CC+TT 46(47.4) 19(45.2) 1(ref) 1(ref) CT 51(52.6) 23(54.8) 0.916(0.443-1.894) 0.813 0.831(0.377-1.830) 0.646 By adjusting for pre-pregnancy body mass index, Systolic blood pressure, Diastolic blood pressure, age, and parity, logistic regression yielded the adjusted p Furthermore, our analysis did not reveal any significant associations between the genetic factors investigated and GDM across the other subcategories (  Supplementary Tables 1  3 p  Supplementary Tables 4  6 3.6 Meta-analysis results Our meta-analysis findings reveal a significant association between the rs1007888 polymorphism and an elevated risk of GDM across multiple genetic models, including the codominant heterozygote, codominant homozygote, allelic, dominant, and over-dominant models (  Figure 1 p  Figure 2 Figure 1 A meta-analytic method employing a fixed effects strategy to explore the link between MIF (A) (B) (C) (D) (E) (F) Six forest plots labeled A to F show meta-analysis results with study ID, odds ratios (OR) with 95% confidence intervals (CI), and study weights. Each plot is divided into two subgroups: Chinese and Iranian studies. Summary statistics and heterogeneity measures (I-squared) are indicated for each subgroup and overall. Plots illustrate variations in OR estimates across studies, with horizontal lines representing CIs and diamonds showing pooled estimates. The dashed lines mark the null effect at an OR of one. Differences in plots reflect subclass variations and statistical significance. Figure 2 A meta-analytic method employing a fixed effects strategy to explore the link between ARAP1 (A) (B) (C) (D) (E) (F) Forest plot displays six panels labeled A to F, illustrating odds ratios (OR) with confidence intervals for studies on T2DM and GDM. Individual study results and overall combined results are shown with diamonds, lines, and weights represented as percentages. Subtotals and I-squared statistics with p-values indicate heterogeneity. Each panel presents slightly different data sets and statistical results, contributing to a comprehensive analysis across studies. Regarding potential publication bias, Begg’s test indicated no substantial bias across the genetic frameworks (all p  Supplementary Figures 1  2 4 Discussion Baseline characteristics from our cohort showed that women who developed gestational diabetes mellitus (GDM) had significantly higher systolic and diastolic blood pressure, fasting plasma glucose, 1-hour and 2-hour postprandial glucose levels, pre-pregnancy BMI, and mean age compared with controls (all p < 0.05, several p < 0.001). These observations are consistent with previous reports and point to several mechanistic underpinnings ( 18 19 Although none of the GDM participants met the diagnostic threshold for hypertension, their higher blood pressure values suggest early manifestations of insulin resistance–related endothelial dysfunction and subclinical inflammation ( 20 4 21 The most pronounced group differences were seen in postprandial glucose excursions particularly at 1 and 2 hours supporting the concept that postprandial hyperglycaemia represents the core metabolic abnormality of GDM ( 4 Pre-pregnancy BMI emerged as another critical determinant. Even within the “normal” range (18.5–24 kg/m²), women who later developed GDM had higher pre-BMI values, suggesting that mild elevations in adiposity may confer risk. Adipokines such as leptin and TNF-α, secreted from adipose tissue, may further aggravate insulin resistance and impair β-cell function ( 22 23 Maternal age was also independently associated with GDM: the mean age of affected women was 31 years compared with 29 years in controls (p < 0.001), and stratified analysis showed that those aged ≥30 years had more pronounced metabolic impairments. This is consistent with evidence that both insulin sensitivity and β-cell function decline progressively with advancing age ( 4 24 Collectively, these findings underscore that even modest elevations in blood pressure, adiposity, and maternal age contribute to GDM risk. They highlight the need for pre-pregnancy counselling and weight optimisation in women of reproductive age as a preventive strategy to reduce the burden of GDM and its complications. The human macrophage migration inhibitory factor ( MIF 25 MIF 26 MIF 15 Beyond its role in immunity, MIF 8 MIF 27 28 MIF 8 MIF 8 These mechanisms align with the lipid overload hypothesis, which posits that ectopic lipid deposition in insulin-sensitive tissues such as skeletal muscle, pancreas, and liver underpins insulin resistance ( 29 31 MIF MIF 32 MIF 33 Despite previous findings linking MIF MIF 6 32 33 MIF 34  ARAP1 6 ARAP1 Research indicates that ARAP1 35 ARAP1 STARD10 36 The genetic variant STARD10 ARAP1 STARD10 ARAP1 ARAP1 ARAP1 37 Conversely, research by Carrat et al ( 36 STARD10 ARAP1 STARD10 2+ 34 The protective influence of the C allele at rs1552224 warrants particular attention. ARAP1 38 ARAP1 39 40 ARAP1 41 In the context of the allelic model for the ARAP1 ARAP1 37 42 Furthermore, our results corroborate previous functional studies that demonstrate that ARAP1 31 ARAP1  Table 1 The observation that the rs1552224 C allele exhibits a protective association in individuals with elevated pre-BMI is a compelling finding. Given that obesity is a well-established driver of insulin resistance and a significant risk factor for GDM ( 43 38 The SNP rs1552224 has the potential to enhance the prediction of GDM risk in women with high BMI and nulliparous status. However, its modest effect size, with an odds ratio of approximately 0.6, limits its utility as a standalone predictive marker. We hypothesize that this allele could modulate ARAP1 44 A comparison of findings in  Table 3  Table 5 This meta-analysis provides a comprehensive assessment of the association between the rs1007888 variant and gestational diabetes mellitus (GDM), synthesising evidence from three independent studies ( 5 45 In particular,  Figure 1 The consistency of associations across both Chinese cohorts ( 5 45 6 26 41 Our study has several significant limitations that should be acknowledged. First, the relatively small number of studies included in the meta-analysis restricts the strength of the conclusions. This underscores the need for larger, multi-ethnic investigations to validate our findings and to explore potential gene-environment interactions. Functional studies will also be essential to elucidate the biological mechanisms by which these variants may contribute to GDM risk. Ultimately, identifying reliable genetic markers could inform personalized risk stratification, early screening, and targeted prevention strategies for GDM. Discrepancies were observed between the results of our case–control analysis, the meta-analysis, and previous literature. We propose that a limited sample size represents a key contributor to these inconsistencies. Power calculations using G*Power software indicated that approximately 19,788 participants would be required to assess the association with rs1007888 adequately, and 2,273 participants for rs1552224, under the following parameters: test family = Exact; statistical test = Proportions: Inequality, two independent groups (Fisher’s exact test); test direction = two-tailed; power = 0.8; significance level α = 0.05. The challenges of sample size requirements differ between variants. For rs1552224, the low minor allele frequency (0.079) limits statistical power, necessitating large cohorts to detect associations. For rs1007888, although the reference allele is more common (p2 = 0.486), the effect size is minimal (OR = 0.923), which again demands a substantial cohort to achieve reliable power. This highlights a broader difficulty in genetic association studies of weak-effect variants, where enormous sample sizes are often required to detect modest associations. In addition to sample size, the absence of comprehensive adjustment for potential confounders may have contributed to the discrepancies observed. Significant clinical and biochemical variables such as lipid profiles, fasting glucose, HOMA indices, C-peptide concentrations, and comorbidities were not systematically included. Moreover, the lack of multicenter data collection limits generalizability, as regional differences within China may influence allele frequencies and disease risk. Addressing these issues in future studies through larger sample sizes, standardized adjustment factors, and multicenter recruitment will be crucial to resolving these inconsistencies and advancing understanding of the genetic basis of GDM. 5 Conclusions This study investigated the relationship between the MIF ARAP1 MIF ARAP1 MIF ARAP1 Data availability statement The datasets presented in this study can be found in online repositories. The names of the repository/repositories and accession number(s) can be found in the article/  Supplementary Material. Ethics statement The studies involving humans were approved by Guangdong Medical University’s Shunde Women and Children’s Hospital (Maternity and Child Healthcare Hospital of Shunde Foshan) gave its approval for the human subjects’ study. The studies were carried out in compliance with institutional norms and local laws. To take part in this study, the subjects gave their written informed consent. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Written informed consent was obtained from the individual(s) for the publication of any potentially identifiable images or data included in this article. Author contributions YZ: Formal analysis, Data curation, Methodology, Writing – original draft. YYW: Writing – original draft, Conceptualization. QZ: Conceptualization, Software, Writing – original draft, Methodology. WG: Writing – review & editing, Investigation. SH: Investigation, Software, Writing – review & editing. XD: Writing – review & editing, Data curation, Formal analysis. JL: Methodology, Investigation, Writing – review & editing. XL: Investigation, Writing – review & editing. YW: Supervision, Validation, Writing – review & editing, Visualization. RG: Supervision, Funding acquisition, Writing – review & editing, Resources. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fendo.2025.1650782/full#supplementary-material References 1 McIntyre HD Catalano P Zhang C Desoye G Mathiesen ER Damm P Gestational diabetes mellitus Nat Rev Dis Primers 2019 5 1–19 10.1038/s41572-019-0098-8 31296866 2 Yan J Su R Ao D Wang Y Wang H Yang H Genetic variants and clinical relevance associated with gestational diabetes mellitus in Chinese women: a case-control study J Maternal-Fetal Neonatal Med 2018 31 2115–21 10.1080/14767058.2017.1336225 28554271 3 Sweeting A Wong J Murphy HR Ross GP A clinical update on gestational diabetes mellitus Endocr Rev 2022 43 763–93 10.1210/endrev/bnac003 35041752 PMC9512153 4 Gyan WR Zhang H Shao T Yang T Wei Y Li M Association of CDKAL1 gene polymorphisms variations with gestational diabetes mellitus risk in women: A case-control study and meta-analysis BMC Endocr Disord 2025 25 1–12 10.1186/s12902-025-01874-8 40340704 PMC12060556 5 Zhan Y Wang Y Li C Liu S Gao Q Association between single nucleotide polymorphism of macrophage migration inhibitory factor-rs1007888 and the pathogenesis of gestational diabetes mellitus Chin J Obstet Gynecol 2013 48 5 10.3760/cam.j.issn.0529-567x.2013.05.002 24016472 6 Aslani S Hossein-Nezhad A Maghbooli Z Mirzaei K Karimi F Genetic variation in macrophage migration inhibitory factor associated with gestational diabetes mellitus and metabolic syndrome Hormone Metab Res 2011 43 557–61 10.1055/s-0031-1275706 21512965 7 Rutter GA Cellular and animal models of type 2 diabetes GWAS gene polymorphisms: What can we learn Drug Discov Today Dis Models 2013 10 e59–64 10.1016/j.ddmod.2013.02.002 8 Jing L Yun P Fu-Kai B Ai-Hua L Correlation between gene polymorphism of macrophage migration inhibitory factor and disease susceptibility: Recognition, target and significance Chin J Tissue Eng Res 2018 22 4574–9 10.3969/j.issn.2095-4344.0299 9 Zheng L Li C Qi W Qiao B Zhao H Zhou Y Expression of macrophage migration inhibitory factor gene in placenta tissue and its correlation with gestational diabetes mellitus Natl Med J China 2017 97 43 10.3760/cma.j.issn.0376-2491.2017.43.006 29179278 10 Nielsen T Sparsø T Grarup N Jørgensen T Pisinger C Witte DR Type 2 diabetes risk allele near CENTD2 is associated with decreased glucose-stimulated insulin release Diabetologia 2011 54 1052–6 10.1007/s00125-011-2054-3 21267535 11 Voight BF Scott LJ Steinthorsdottir V Morris AP Dina C Welch RP Twelve type 2 diabetes susceptibility loci identified through large-scale association analysis Nat Genet 2010 42 579–89 10.1038/ng.609 20581827 PMC3080658 12 Gao L Xiong YJ Liang YX Huang PF Liu S Xiao Y The effects of IL-27 and IL-35 gene variation and expression levels on the susceptibility and clinical manifestations of pulmonary tuberculosis Front Immunol 2024 15 1267624 10.3389/fimmu.2024.1267624 38690286 PMC11058845 13 Arora GP Almgren P Brøns C Thaman RG Vaag AA Groop L Association between genetic risk variants and glucose intolerance during pregnancy in north Indian women BMC Med Genomics 2018 11 1–10 10.1186/s12920-018-0380-8 30089489 PMC6083526 14 Li C Zhou P Cai Y Peng B Liu Y Yang T Associations between gestational diabetes mellitus and the neurodevelopment of offspring from 1 month to 72 months: Study protocol for a cohort study BMJ Open 2020 10 1–6 10.1136/bmjopen-2020-040305 33234643 PMC7689080 15 Jovanović Krivokuća M Vilotić A Stefanoska I Bojić-Trbojević Ž Vićovac L Macrophage migration inhibitory factor in human early pregnancy events and association with placental pathologies Placenta 2021 116 51–7 10.1016/j.placenta.2021.02.007 33612316 16 Yoo SA Leng L Kim BJ Du X Tilstam PV Kim KH MIF allele-dependent regulation of the MIF coreceptor CD44 and role in rheumatoid arthritis Proc Natl Acad Sci U.S.A 2016 113 E7917–26 10.1073/pnas.1612717113 27872288 PMC5150393 17 Cai XQ Huang Q Zhang TP The methylation in B7-H4 and BTLA genes are associated with the risk of pulmonary tuberculosis Immunotargets Ther 2023 12 149–63 10.2147/ITT.S434403 38033484 PMC10683667 18 Dorans KS Bazzano LA Li X Bundy JD Tian L He J Lifestyle behaviors and cardiovascular risk profiles among parous women by gestational diabetes status, 2007–2018 Nutrition Metab Cardiovasc Dis 2022 32 1121–30 10.1016/j.numecd.2022.01.012 35210134 PMC9018547 19 Santanapipatkul P Luewan S Sittiwangkul R Krongphaiklang N Jatavan P Tongsong T Comparison of fetal and neonatal cardiac morphology between the infants of mothers with well-controlled gestational diabetes mellitus and normal controls Diabetes Vasc Dis Res 2023 20 1–6 10.1177/14791641231190531 37463129 PMC10357059 20 Luk C Haywood NJ Bridge KI Kearney MT Paracrine role of the endothelium in metabolic homeostasis in health and nutrient excess Front Cardiovasc Med 2022 9 882923 10.3389/fcvm.2022.882923 35557517 PMC9086712 21 Zeng Q Tan B Han F Huang X Huang J Wei Y Association of solute carrier family 30 A8 zinc transporter gene variations with gestational diabetes mellitus risk in a Chinese population Front Endocrinol (Lausanne) 2023 14 1159714 10.3389/fendo.2023.1159714 37324267 PMC10266221 22 Moghbeli M Khedmatgozar H Yadegari M Avan A Ferns GA Ghayour Mobarhan M Cytokines and the immune response in obesity-related disorders Advances in clinical chemistry Amsterdam, the Netherlands Academic Press Inc 2021 135–68 10.1016/bs.acc.2020.06.004 33706888 23 Al-Mansoori L Al-Jaber H Prince MS Elrayess MA Role of inflammatory cytokines, growth factors and adipokines in adipogenesis and insulin resistance Inflammation 2022 45 31 44 10.1007/s10753-021-01559-z 34536157 PMC8449520 24 Zeng Q Zou D Gu S Han F Cao S Wei Y Different associations between CDKAL1 variants and type 2 diabetes mellitus susceptibility: A meta-analysis Front Genet 2022 12 783078 10.3389/fgene.2021.783078 35069684 PMC8766415 25 Sun C Xu J Zhang B Huang H Chen L Yan H Whole-genome sequencing suggests a role of MIF in the pathophysiology of TEMPI syndrome Blood Adv 2021 5 2563–8 10.1182/bloodadvances.2020003783 34129019 PMC8270661 26 Sumaiya K Langford D Natarajaseenivasan K Shanmughapriya S Macrophage migration inhibitory factor (MIF): A multifaceted cytokine regulated by genetic and physiological strategies Pharmacol Ther 2022 233 1–20 10.1016/j.pharmthera.2021.108024 34673115 27 Miller EJ Li J Leng L McDonald C Atsumi T Bucala R Macrophage migration inhibitory factor stimulates AMP-activated protein kinase in the ischaemic heart Nature 2008 451 578–82 10.1038/nature06504 18235500 28 Atsumi T Cho Y-R Leng L Mcdonald C Yu T Danton C The proinflammatory cytokine macrophage migration inhibitory factor regulates glucose metabolism during systemic inflammation 1 J Immunol 2007 179 5399–406 10.4049/jimmunol.179.8.5399 17911626 29 Elbein SC Gamazon ER Das SK Rasouli N Kern PA Cox NJ Genetic risk factors for type 2 diabetes: A trans-regulatory genetic architecture Am J Hum Genet 2012 91 466–77 10.1016/j.ajhg.2012.08.002 22958899 PMC3512001 30 Toso C Emamaullee JA Merani S Shapiro AMJ The role of macrophage migration inhibitory factor on glucose metabolism and diabetes Diabetologia 2008 51 1937–46 10.1007/s00125-008-1063-3 18612626 31 Tsatsoulis A Mantzaris MD Bellou S Andrikoula M Insulin resistance: An adaptive mechanism becomes maladaptive in the current environment - An evolutionary perspective Metabolism 2013 62 622–33 10.1016/j.metabol.2012.11.004 23260798 32 Herder C Klopp N Baumert J Müller M Khuseyinova N Meisinger C Effect of macrophage migration inhibitory factor (MIF) gene variants and MIF serum concentrations on the risk of type 2 diabetes: Results from the MONICA/KORA Augsburg Case-Cohort Study, 1984-2002 Diabetologia 2008 51 276–84 10.1007/s00125-007-0800-3 17712545 33 Stošić-Grujičić S Saksida T Miljković Đ Stojanović I MIF and insulin: Lifetime companions from common genesis to common pathogenesis Cytokine 2020 125 1–10 10.1016/j.cyto.2019.154792 31400637 34 Li Y Shen K Li C Yang Y Yang M Tao W Identifying the association between single nucleotide polymorphisms in kcnq1, arap1, and kcnj11 and type 2 diabetes mellitus in a chinese population Int J Med Sci 2020 17 2379–86 10.7150/ijms.48072 32922204 PMC7484634 35 Wang L Wu J Sramek M Obayomi SMB Gao P Li Y Heterogeneous enhancer states orchestrate β cell responses to metabolic stress Nat Commun 2024 15 1–19 10.1038/s41467-024-53717-0 39472434 PMC11522703 36 Carrat GR Hu M Nguyen-Tu MS Chabosseau P Gaulton KJ van de Bunt M Decreased STARD10 expression is associated with defective insulin secretion in humans and mice Am J Hum Genet 2017 100 238–56 10.1016/j.ajhg.2017.01.011 28132686 PMC5294761 37 Li L Xu L Wen S Yang Y Li X Fan Q The effect of lncRNA-ARAP1-AS2/ARAP1 on high glucose-induced cytoskeleton rearrangement and epithelial–mesenchymal transition in human renal tubular epithelial cells J Cell Physiol 2020 235 5787–95 10.1002/jcp.29512 31975379 38 Zhang Z Xie W Gong B Liang X Yu H Yu Y ARAP1 negatively regulates stress fibers formation and metastasis in lung adenocarcinoma via controlling Rho signaling Discover Oncol 2023 14 1–14 10.1007/s12672-023-00832-x 38008882 PMC10678915 39 Neale BM It’s ARAP” for type II diabetes Sci Transl Med 2014 6 221ec22 221ec22 10.1126/scitranslmed.3008474 40 Horigan G McGuigan K Quinn L Coates V Poster: Does gender make a difference to self-management of diabetes in adults ≤ 55 years? A pilot study Diabetic Med 2015 32 S1 140–1 10.1111/dme.12668_1 41 Dalfrà MG Burlina S Del Vescovo GG Lapolla A Genetics and epigenetics: new insight on gestational diabetes mellitus Front Endocrinol (Lausanne) 2020 11 602477 10.3389/fendo.2020.602477 33335512 PMC7736606 42 Gong Y Zack TI Morris LGT Lin K Hukkelhoven E Raheja R Pan-cancer genetic analysis identifies PARK2 as a master regulator of G1/S cyclins Nat Genet 2014 46 588–94 10.1038/ng.2981 24793136 PMC4251771 43 Gao C Sun X Lu L Liu F Yuan J Prevalence of gestational diabetes mellitus in mainland China: A systematic review and meta-analysis J Diabetes Investig 2019 10 154–62 10.1111/jdi.12854 29683557 PMC6319492 44 Schnurr TM Jakupović H Carrasquilla GD Ängquist L Grarup N Sørensen TIA Obesity, unfavourable lifestyle and genetic risk of type 2 diabetes: a case-cohort study Diabetologia 2020 63 1324–32 10.1007/s00125-020-05140-5 32291466 45 Zhan Y Li C Chen J Yu S Gao Q Wang YP Association between macrophage migration inhibitory factor rs1007888 and GDM Genet Mol Res 2015 14 797 804 10.4238/2015 25730019 ",
  "metadata": {
    "Title of this paper": "Association between macrophage migration inhibitory factor rs1007888 and GDM",
    "Journal it was published in:": "Frontiers in Endocrinology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479318/"
  }
}