{
  "title": "Paper_119",
  "abstract": "pmc Virchows Arch Virchows Arch 365 springeropen Virchows Archiv 0945-6317 1432-2307 pmc-is-collection-domain yes pmc-collection-title Springer PMC12488767 PMC12488767.1 12488767 12488767 40835751 10.1007/s00428-025-04222-2 4222 1 Review Claudin-18.2 immunohistochemical evaluation in pancreatic cancer specimens: review and recommendations for routine testing and scoring http://orcid.org/0000-0003-4901-4908 Luchini Claudio claudio.luchini@univr.it 1 2 Matkowskyj Kristina A. 3 Kuwata Takeshi 4 Longacre Teri A. 5 Schirmacher Peter 6 7 Takamatsu Manabu 8 9 Rüschoff Josef 10 Fassan Matteo matteo.fassan@unipd.it 11 12 1 https://ror.org/039bp8j42 grid.5611.3 0000 0004 1763 1124 Department of Diagnostics and Public Health, Section of Pathology, University of Verona, 2 https://ror.org/039bp8j42 grid.5611.3 0000 0004 1763 1124 ARC-Net Research Center, University of Verona, 3 https://ror.org/02qp3tb03 grid.66875.3a 0000 0004 0459 167X Department of Laboratory Medicine and Pathology, Mayo Clinic, 4 https://ror.org/03rm3gk43 grid.497282.2 Department of Genetic Medicine and Services, National Cancer Center Hospital East, 5 https://ror.org/00f54p054 grid.168010.e 0000 0004 1936 8956 Department of Pathology, Stanford University, 6 https://ror.org/013czdx64 grid.5253.1 0000 0001 0328 4908 Institute of Pathology, University Hospital Heidelberg, 7 8 https://ror.org/00bv64a69 grid.410807.a 0000 0001 0037 4131 Department of Pathology, Cancer Institute Hospital, Japanese Foundation for Cancer Research, 9 https://ror.org/00bv64a69 grid.410807.a 0000 0001 0037 4131 Division of Pathology, Cancer Institute, Japanese Foundation for Cancer Research, 10 grid.519122.c Discovery Life Sciences Biomarker Services, 11 https://ror.org/00240q980 grid.5608.b 0000 0004 1757 3470 Department of Medicine (DIMED), Surgical Pathology Unit, University of Padua, 12 https://ror.org/01xcjmy57 grid.419546.b 0000 0004 1808 1697 Veneto Institute of Oncology, IOV-IRCCS, 21 8 2025 2025 487 3 498144 487 499 27 6 2025 31 7 2025 7 8 2025 21 08 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ The evaluation of claudin-18 (CLDN18) by immunohistochemistry (IHC) has already entered routine diagnostic activity as a predictive biomarker for patients with gastric and gastroesophageal junction adenocarcinomas. Of note, the CLDN18 Keywords Pancreatic cancer PDAC Immunohistochemistry, Predictive biomarkers CLDN18.2 Università degli Studi di Verona Open access funding provided by Università degli Studi di Verona within the CRUI-CARE Agreement. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer-Verlag GmbH Germany, part of Springer Nature 2025 Introduction The portfolio of molecular biomarkers that can be used in clinical practice for targeted therapies for pancreatic cancer is still quite limited. To date, in addition to BRCA1 2 KRAS 1 5 6 8 KRAS 9 11 In this challenging oncologic scenario, claudin-18.2 (CLDN18.2) is a biomarker gaining growing attention and interest due to its frequent expression on tumor cells in a variable proportion of gastric and pancreatic cancers, among others [ 12 16 17 9 10 18 21 22 22 To assess patients’ eligibility to the targeted treatment, an immunohistochemical assay for evaluating the expression of CLDN18 in cancer cells has been developed as a companion diagnostic with a monoclonal antibody (43-14A clone, Roche, Ventana) [ 23 24 25 26 23 To address this issue, an international panel of pathologists (C.L., T.K., T.A.L., K.A.M., P.S., M.T., J.R., M.F.) with expertise in pancreatic pathology and/or in CLDN18.2 testing/reporting met virtually in 3 half-day sessions between September and December 2024 to discuss the requirements for adequate CLDN18 immunohistochemical interpretation and reporting in pancreatic cancer. A series of virtual digitalized slides obtained from 60 different cases of pancreatic cancer, including surgical resection specimens, biopsies, and cytology, were first reviewed by all pathologists independently. Then, all cases were reviewed during a joint discussion, which was instrumental not only to reach a consensus score but also to identify the most significant issues and pitfalls in this complex scenario (see the content for gastric cancer at www.CLDN182.com Both CLDN18 staining (43-14A clone; Roche Ventana) and the matched hematoxylin and eosin-stained digitalized slides were available for review. The results generated from these sessions are summarized in this manuscript and are proposed as consensus recommendations for evaluating and scoring CLDN18 immunohistochemical staining in pancreatic cancer specimens and we describe our experience and our recommendations below. State-of-the-art review of claudin-18.2 with a focus on pancreatic cancer What is CLDN18.2? The CLDN18 27 28 29 28 29 27 30 31 CLDN18 31 32 Is CLDN18.2 a novel therapeutic target? The first study on CLDN18.2 with translational implications was provided in 2008 by a research investigation, where CLDN18.2 was indicated as a potential pan-cancer target suitable for therapeutic antibodies [ 31 27 32 Along this line, zolbetuximab (VYLOY; Astellas Pharma, initially named claudiximab or IMAB362) is a chimeric immunoglobulin G1 monoclonal antibody with high specificity and affinity to CLDN18.2. Zolbetuximab can mediate the cell death of CLDN18.2-positive cancer cells by causing antibody-dependent cellular cytotoxicity and complement-dependent cytotoxicity [ 23 33 33 18 20 Notably, the landscape of treatment opportunities for patients with CLDN18.2-positive tumors is evolving quickly, both with the introduction of novel therapeutic regimens, including synergistic approaches of zolbetuximab with immunotherapy [ 34 35 36 What about CLDN18.2 expression in pancreatic cancer? Recent evidence pointed out that CLDN18.2 is also expressed by pancreatic cancer tissue with a variable prevalence. A recent study based on a cohort of 130 surgically resected patients with pancreatic ductal adenocarcinoma (PDAC) showed a prevalence of 31.5% CLDN18-positive tumors and the association of positive cases with well-differentiated histology [ 37 25 26 37 18 20 38 39 While examining the expression of CLDN18 in the pancreas, it is of interest to report the results of its evaluation in PDAC precursor lesions, including pancreatic intraepithelial neoplasia (PanINs), intraductal papillary mucinous neoplasms (IPMNs), and mucinous cystic neoplasms (MCNs). Of note, the vast majority of such lesions, i.e., > 90% of PanINs and IPMNs and 80% of MCN, showed CLDN18 positivity [ 40 41 43 39 A novel finding of targeting CLDN18.2 in PDAC comes as its potential role in the tumor microenvironment. In the setting of PDAC, CLDN18.2 seems to play a role in orchestrating T cell infiltration and shaping the tumor immune contexture, opening new horizons for synergistic approaches of CLDN18.2 targeting with immunotherapy in this tumor type [ 44 With all these interesting observations, the possibility of adopting zolbetuximab in clinical practice for CLDN18.2 expressing PDAC is being explored in clinical trials. Along this line, the effectiveness of zolbetuximab in conjunction with chemotherapy with nab-paclitaxel and gemcitabine is currently being investigated in patients with metastatic PDAC in a phase 2 randomized clinical trial using the same CLDN18.2 scoring criteria for gastric cancer ( NCT03816163 https://clinicaltrials.gov/study/NCT03816163 How is CLDN18.2 currently tested in pathology? To approach the evaluation of the expression of CLDN18.2 in PDAC, it is critical to translate the lessons learned from its evaluation in gastric cancer. As an already well-established biomarker, CLDN18 expression is currently evaluated on neoplastic cells by immunohistochemistry. To date, different immunohistochemical assays are commercially available [ 23 45 The first anti-CLDN18.2 antibody was a polyclonal antibody developed by Zymed and used for investigating CLDN18.2 expression in a recent clinical trial on gastroesophageal cancer [ 46 47 23 25 26 31 EPR19202 48 Given that the same claudin isoform, CLDN18.2, is expressed in both gastric and pancreatic tissues, the lessons learned from using IHC in gastric tumors could also be applicable to pancreatic tumors with a reliable biological basis. This approach can be supported only after considering the necessary distinctions based on the intrinsic properties of the different tissues, i.e., gastric and pancreatic epithelia. As was stated for gastric tumors, in PDAC, a cancer cell should also be considered claudin-positive when there is crisp membranous staining that is complete, basolateral, or lateral [ 23 31 32 23 49 1 Fig. 1 Representative figure of the different patterns of expression of Claudin 18 in pancreatic cancer. A B C D Of note, another methodology for CLDN18 scoring, the H-score, has been proposed for gastric tumors and adopted in a few studies on PDAC [ 50 49 Currently, the most accredited modality for identifying CLDN18 positive vs. negative cases in gastric cancer is based on calculating the percentage of 2 +/3 + positive tumor cells, considering positive those cases with ≥ 75% of 2 +/3 + cells [ 23 18 20 How to approach CLDN18 immunohistochemical evaluation in pancreatic cancer The first approach with pancreatic-specific considerations The initial approach to evaluate CLDN18 in pancreatic samples should start with a low magnification review (range: 2 × to 5 × objective) to obtain a general impression of the staining distribution and its heterogeneity. After this step, pathologists should focus on identifying infiltrating tumor cells and the potential presence of an internal positive control. Unlike gastric tissue, there is no normal epithelium in pancreatic samples showing immunoreactivity for CLDN18, including both ductal and acinar cells. However, some specific histopathological aspects can be used as an internal positive control in most pancreatic resection specimens. The most common one is PanINs (low and high grade). CLDN18 usually shows a 3 + immunoreactivity in these structures, most likely due to the gastric differentiation of these lesions (Fig. 2 39 51 52 53 2 40 3 Fig. 2 Claudin 18 positivity in pancreatic cancer precursor lesions. A B C A B C D E Fig. 3 Internal positive and negative control for Claudin 18 in pancreatic specimens. A B C D E F G Sample selection, management, and immunohistochemical staining The pattern of CLDN18 expression may be heterogeneous, as has been observed in a proportion of gastric tumors. For immunohistochemical analysis in surgically resected pancreatic specimens, the tissue section area representing the entire morphological spectrum of a given PDAC should be selected for CLDN18 testing. It is well-established that PDAC can be histologically very heterogeneous with up to 10 different morphological subtypes, patterns, and clones in a single tumor [ 54 56 As in keeping with other biomarkers, IHC for CLDN18 in clinical practice should follow well-established and standardized procedures for routinely processed, formalin-fixed, paraffin-embedded tissues, according to the guidelines of the College of American Pathologists Preanalytics for Precision Medicine Project Team [ 57 23 An insight on positive and negative controls In routine evaluation of immunohistochemical analysis, positive and negative controls play a crucial role as fundamental support of the reliability of the results. As already indicated, internal positive controls in pancreatic specimens can be represented by PanINs and by other less common entities, including macroscopic precursor lesions (e.g., IPMNs, MCNs) and normal structures such as Brunner’s glands (focally positive) (Figs. 2 3 3 Based on these considerations, pathologists should select for CLDN18 testing not only PDAC, but at least one negative and one positive control. This task may be challenging or even impossible in the case of CLDN18 testing in non-surgical specimens, where PanINs and other positive controls can be lacking. To overcome this issue, non-neoplastic gastric tissue from a test sample can serve as positive run control; it can be put on the same slide for IHC (on-slide control). Can the sample type impact CLDN18 testing results? And what about cytology? For all immunohistochemical testing, surgically resected specimens represent the gold standard in terms of material for analysis. They offer different advantages: (i) internal positive and negative controls are easier to identify and select; (ii) the evaluation of large tumor areas overcomes issues related to intratumor heterogeneity, both at morphological and CLND18 expression levels; (iii) hypo/hyper-fixation artifacts can be recognized almost immediately (e.g., shrinkage artifacts and gradient staining); (iv) unreliable reaction (failure in internal positive and negative control) or incorrect patterns (e.g., cytoplasmic immunoreactivity), and another tissue block for repeating the analysis is usually available. Notably, it should be highlighted that most patients with PDAC have locally advanced or metastatic disease at the time of diagnosis, and thus are often not amenable to surgical approaches [ 58 59 60 62 60 62 63 4 4 SMAD4 64 65 SMAD4 62 64 65 62 SMAD4 Fig. 4 A B C A B D E F D E F Given the high rate of metastases, which are present in the majority of patients affected by PDAC already at the time of the diagnosis, pathologists may be called for evaluating CLDN18 expression also on biopsies from metastatic sites. It should be acknowledged that there are few data in the literature regarding the expression of CLDN18 in PDAC metastases as well as on the fidelity of its expression between matched primary tumors and metastases. However, it seems that the positivity rate of CLDN18 expression in metastases is similar to that of pancreatic primaries, and that CLDN18 expression is similar in primary tumors and matched metastases [ 66 Another consideration regards the adequacy of material, given the potential heterogeneity of CLDN18 expression. A recent study highlighted different rates of CLDN18 positivity in FNBs vs. surgical specimens [ 58 Overall, it should be also acknowledged that, regardless of the sample type, a detailed report on claudin-18.2 expression can be time consuming and difficult to integrate into normal daily workflow. This is even more evident when considering the potential pitfalls that can be encountered in clinical practice (see below). Nowadays, additional biomarker testing and assessment should be discussed in a multidisciplinary setting, with shared responsibilities on the indications and importance of that specific analysis in that particular patient. A focus on potential pitfalls in CLDN18.2 assessment Cytoplasmic or nuclear staining As already stated for gastric cancer [ 23 23 Precursor lesions As already stated, precursor lesions represent the major cause of potential errors and above all, false-positive, in the evaluation of CLDN18 expression in pancreatic specimens. On the one hand, the presence of PanINs, IPMNs, and MCNs can be of relevant help in evaluating the reliability of immunohistochemistry, serving as internal positive controls. On the other hand, they can generate staining patterns of challenging interpretation; their positivity should be excluded from CLDN18 scoring. Aberrant positivity Cases showing aberrant weak cytoplasmic immunoreactivity in inflammatory cells (e.g., macrophages) or other non-neoplastic elements have been rarely observed and should not be scored. Typically, such cases showed apparent preanalytical associated issues. Other patterns of aberrant positivity can be rarely seen in IPMN-associated pools of mucin or within necrotic intraglandular debris. All aberrant immunoreactions should be excluded from CLDN18 scoring. Preanalytical artifacts IHC typically suffers from errors derived from the preanalytical phase. In evaluating pancreatic specimens subjected to electrocautery (especially the retroperitoneal margin), they can appear histologically torn and coagulated. Maintenance of antigenicity may be affected in such samples, and all PDAC regions showing thermal artifacts should be excluded from CLDN18 scoring. Under-fixation may also damage antigen preservation and cause false-negative staining along with edge effect and nonspecific cytoplasmic staining, similar to what has been observed for gastric samples [ 23 Ideal CLDN18.2 pathology report Standardizing pathology reports, including those reporting biomarkers and their interpretation, is crucial for addressing the best therapeutic strategies in precision oncology. All findings derived from the workflow in the pathology laboratory should be presented with a clear and concise modality to rapidly transmit all the information to the oncologists (with common sense). Along this line, the ideal CLDN18 expression report should follow a precise algorithm (Fig. 5 Type of specimen used for analysis (surgical resection specimen/FNB/FNAC/other) Site of sampling (it is important to guide the correct interpretation of the eventual presence of positive but not clinically relevant tissue, such as PanINs, macroscopic precursor lesions, and also normal gastric epithelium derived from EUS-guided FNB/FNAC) Sample adequacy, and if inadequate, the causes of inadequacy should be explicitly stated (e.g., lack of tumor cells, electrocautery/fixation artifacts) Antibody clone and immunohistochemical stainer used for the testing Companion diagnostic or in-house-developed test Test results as the percentage of membranous 1 +, 2 +, and 3 + positive cells, assessed separately Additional analytical and clinical interpretative comments (e.g., qualification of the laboratory and bibliographical references), if needed. Fig. 5 Diagnostic algorithm with a stepwise approach for the assessment of Claudin 18 in pancreatic specimens. Abbreviations in the figure: os ctrls, on-slide controls; PanIN, pancreatic intraepithelial neoplasia; IPMN, intraductal papillary mucinous neoplasms; MCN, mucinous cystic neoplasms; HG, high grade of dysplasia; Bx, biopsies; CTA, clinical trial application; FNA, fine needle aspirates; H&E, hemtoxylin and eosin; IHC, immunohistochemistry; LDT, lab developed test; NRC, negative reagent control; Obj, microscope objective; Rx, resection. 1 2 3 4 5 Conclusions CLDN18 expression tested by IHC has already entered daily clinical practice for selecting patients with locally advanced and metastatic gastric and gastroesophageal junction adenocarcinomas for anti-CLDN18.2-targeted therapy [ 22 67 Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contribution All authors: study conception, design, discussion, and writing; all authors: final editing and approval of the present version. Funding Open access funding provided by Università degli Studi di Verona within the CRUI-CARE Agreement. This paper did not receive any funding. Data Availability All data/information are available upon request to the corresponding author. Declarations Ethics statement and patient consent Not applicable (review paper). Conflicts of interest C.L. reports honoraria from Astellas (consulting, steering committee for CLDN18.2), Bayer, MSD, and Medica s.r.l. (consulting and speaker bureau). K.A.M. is advisory boards and consultant for Amgen, Astellas (also steering committee for CLDN18.2), Daiichi Sankyo, Inc., Elephas, and Merck. T.K. reports honoraria for consulting from Agilent, Amgen, Astellas (also steering committee for CLDN18.2), Bristle Myers Squibb, Myriad, Daiichi Sankyo, MSD, Guardant, GxD, and Roche Diagnostics; advisory role from Astellas, Daiichi Sankyo, and MSD. T.A.L. reports honoraria from Astellas (steering committee for CLDN18.2); P.S. reports honoraria (for advisory boards and presentations) from BMS, AstraZeneca, Falk, Eisai, Leica, Incyte, Roche, Astellas (including steering committee for CLDN18.2), and Novartis and research contracts from Incyte, Falk, Novartis, Leica, BMS, AstraZeneca, Chugai, and Illumina; M.T. reports honoraria from Daiichi Sankyo; advisory role from Astellas (also steering committee for CLDN18.2). J.R. is cofounder of Targos Molecular Pathology GmbH, now part of Discovery Life Sciences, to which speaker honoraria and personal funds for an advisor role from Astellas (also steering committee for CLDN18.2), AstraZeneca, Bristol Myers Squibb, Daiichi Sankyo Inc, GSK plc, Merck Sharp & Dohme, Merck KGaA, and QuIP (Qualitätssicherungs-Initiative Pathologie) are reimbursed. M.F. reports research funding (to their institution) from Roche, Thermofisher, and Diaceutics; personal honoraria as an invited speaker from Roche, Astellas, AstraZeneca, Lilly, Incyte, Bristol-Myers Squibb, Sanofi, Agilent, Merck Serono, Pierre Fabre, GSK, Novartis, and Amgen; and participation in advisory boards for Amgen, Astellas (also steering committee for CLDN18.2), Roche, Pfizer, Merck Serono, GSK, Novartis, and Janssen. References 1. Golan T Hammel P Reni M Maintenance olaparib for germline BRCA-mutated metastatic pancreatic cancer N Engl J Med 2019 381 4 317 327 10.1056/NEJMoa1903387 31157963 PMC6810605 Golan T, Hammel P, Reni M et al (2019) Maintenance olaparib for germline BRCA-mutated metastatic pancreatic cancer. N Engl J Med 381(4):317–327 31157963 10.1056/NEJMoa1903387 PMC6810605 2. Buckley CW O’Reilly EM Next-generation therapies for pancreatic cancer Expert Rev Gastroenterol Hepatol 2024 18 1–3 55 72 10.1080/17474124.2024.2322648 38415709 PMC10960610 Buckley CW, O’Reilly EM (2024) Next-generation therapies for pancreatic cancer. Expert Rev Gastroenterol Hepatol 18(1–3):55–72. 10.1080/17474124.2024.2322648 38415709 10.1080/17474124.2024.2322648 PMC10960610 3. Keane F O’Connor CA Park W Seufferlein T O’Reilly EM Pancreatic cancer: BRCA targeted therapy and beyond Cancers (Basel) 2023 15 11 2955 10.3390/cancers15112955 37296917 PMC10251879 Keane F, O’Connor CA, Park W, Seufferlein T, O’Reilly EM (2023) Pancreatic cancer: BRCA targeted therapy and beyond. Cancers (Basel) 15(11):2955 37296917 10.3390/cancers15112955 PMC10251879 4. Luchini C Paolino G Mattiolo P KRAS J Exp Clin Cancer Res 2020 39 1 227 10.1186/s13046-020-01732-6 33115526 PMC7594413 Luchini C, Paolino G, Mattiolo P et al (2020) KRAS 33115526 10.1186/s13046-020-01732-6 PMC7594413 5. Philip PA Azar I Xiu J Molecular characterization of KRAS wild-type tumors in patients with pancreatic adenocarcinoma Clin Cancer Res 2022 28 12 2704 2714 10.1158/1078-0432.CCR-21-3581 35302596 PMC9541577 Philip PA, Azar I, Xiu J et al (2022) Molecular characterization of KRAS wild-type tumors in patients with pancreatic adenocarcinoma. Clin Cancer Res 28(12):2704–2714. 10.1158/1078-0432.CCR-21-3581 35302596 10.1158/1078-0432.CCR-21-3581 PMC9541577 6. Luchini C Brosens LAA Wood LD Comprehensive characterisation of pancreatic ductal adenocarcinoma with microsatellite instability: histology, molecular pathology and clinical implications Gut 2021 70 1 148 156 10.1136/gutjnl-2020-320726 32350089 PMC7211065 Luchini C, Brosens LAA, Wood LD et al (2021) Comprehensive characterisation of pancreatic ductal adenocarcinoma with microsatellite instability: histology, molecular pathology and clinical implications. Gut 70(1):148–156. 10.1136/gutjnl-2020-320726 32350089 10.1136/gutjnl-2020-320726 PMC7211065 7. Grant RC Denroche R Jang GH Clinical and genomic characterisation of mismatch repair deficient pancreatic adenocarcinoma Gut 2021 70 10 1894 1903 10.1136/gutjnl-2020-320730 32933947 Grant RC, Denroche R, Jang GH et al (2021) Clinical and genomic characterisation of mismatch repair deficient pancreatic adenocarcinoma. Gut 70(10):1894–1903. 10.1136/gutjnl-2020-320730 32933947 10.1136/gutjnl-2020-320730 8. Gkountakos A Singhi AD Westphalen CB Fusion genes in pancreatic tumors Trends Cancer 2024 10 5 430 443 10.1016/j.trecan.2024.01.009 38378317 Gkountakos A, Singhi AD, Westphalen CB et al (2024) Fusion genes in pancreatic tumors. Trends Cancer 10(5):430–443. 10.1016/j.trecan.2024.01.009 38378317 10.1016/j.trecan.2024.01.009 9. Linehan A O’Reilly M McDermott R O’Kane GM Targeting KRAS Front Med 2024 11 1369136 10.3389/fmed.2024.1369136 PMC10991798 38576709 Linehan A, O’Reilly M, McDermott R, O’Kane GM (2024) Targeting KRAS 10.3389/fmed.2024.1369136 PMC10991798 38576709 10. Wang Y Bui TA Yang X Hutvagner G Deng W Advancements in gene therapies targeting mutant KRAS in cancers Cancer Metastasis Rev 2025 44 1 24 10.1007/s10555-025-10243-9 39820726 PMC11748474 Wang Y, Bui TA, Yang X, Hutvagner G, Deng W (2025) Advancements in gene therapies targeting mutant KRAS in cancers. Cancer Metastasis Rev 44(1):24. 10.1007/s10555-025-10243-9 39820726 10.1007/s10555-025-10243-9 PMC11748474 11. Ciulla C Luchini C Genomic determinants of biological aggressiveness and poor prognosis of pancreatic cancers: KRAS Expert Rev Mol Diagn 2024 24 5 355 362 10.1080/14737159.2024.2348676 38708441 Ciulla C, Luchini C (2024) Genomic determinants of biological aggressiveness and poor prognosis of pancreatic cancers: KRAS 38708441 10.1080/14737159.2024.2348676 12. Coati I Lotz G Fanelli GN Claudin-18 expression in oesophagogastric adenocarcinomas: a tissue microarray study of 523 molecularly profiled cases Br J Cancer 2019 121 3 257 263 10.1038/s41416-019-0508-4 31235864 PMC6738069 Coati I, Lotz G, Fanelli GN et al (2019) Claudin-18 expression in oesophagogastric adenocarcinomas: a tissue microarray study of 523 molecularly profiled cases. Br J Cancer 121(3):257–263. 10.1038/s41416-019-0508-4 31235864 10.1038/s41416-019-0508-4 PMC6738069 13. Angerilli V Ghelardi F Nappo F Claudin-18.2 testing and its impact in the therapeutic management of patients with gastric and gastroesophageal adenocarcinomas: a literature review with expert opinion Pathol Res Pract 2024 254 155145 10.1016/j.prp.2024.155145 38277741 Angerilli V, Ghelardi F, Nappo F et al (2024) Claudin-18.2 testing and its impact in the therapeutic management of patients with gastric and gastroesophageal adenocarcinomas: a literature review with expert opinion. Pathol Res Pract 254:155145. 10.1016/j.prp.2024.155145 38277741 10.1016/j.prp.2024.155145 14. Tojjari A, Idrissi YA, Saeed A (2024) Emerging targets in gastric and pancreatic cancer: focus on claudin 18.2. Cancer Lett 611:217362.10.1016/j.canlet.2024.217362 10.1016/j.canlet.2024.217362 39637967 15. Du F Xie Y Wu S Ji M Dong B Zhu C Expression and targeted application of claudins family in hepatobiliary and pancreatic diseases J Hepatocell Carcinoma 2024 25 11 1801 1821 10.2147/JHC.S483861 PMC11439345 39345937 Du F, Xie Y, Wu S, Ji M, Dong B, Zhu C (2024) Expression and targeted application of claudins family in hepatobiliary and pancreatic diseases. J Hepatocell Carcinoma 25(11):1801–1821. 10.2147/JHC.S483861 10.2147/JHC.S483861 PMC11439345 39345937 16. Chung V Mizrahi JD Pant S Novel therapies for pancreatic cancer JCO Oncol Pract 2024 26 OP2400279 10.1200/OP.24.00279 39591547 Chung V, Mizrahi JD, Pant S (2024) Novel therapies for pancreatic cancer. JCO Oncol Pract 26:OP2400279 10.1200/OP.24.00279 39591547 17. Li WT Jeng YM Yang CY Claudin-18 as a marker for identifying the stomach and pancreatobiliary tract as the primary sites of metastatic adenocarcinoma Am J Surg Pathol 2020 44 12 1643 1648 10.1097/PAS.0000000000001583 32925194 Li WT, Jeng YM, Yang CY (2020) Claudin-18 as a marker for identifying the stomach and pancreatobiliary tract as the primary sites of metastatic adenocarcinoma. Am J Surg Pathol 44(12):1643–1648 32925194 10.1097/PAS.0000000000001583 18. Shitara K Lordick F Bang YJ Zolbetuximab plus mFOLFOX6 in patients with CLDN18.2-positive, HER2-negative, untreated, locally advanced unresectable or metastatic gastric or gastro-oesophageal junction adenocarcinoma (SPOTLIGHT): a multicentre, randomised, double-blind, phase 3 trial Lancet. 2023 401 10389 1655 1668 10.1016/S0140-6736(23)00620-7 37068504 Shitara K, Lordick F, Bang YJ et al (2023) Zolbetuximab plus mFOLFOX6 in patients with CLDN18.2-positive, HER2-negative, untreated, locally advanced unresectable or metastatic gastric or gastro-oesophageal junction adenocarcinoma (SPOTLIGHT): a multicentre, randomised, double-blind, phase 3 trial. Lancet. 401(10389):1655–1668 37068504 10.1016/S0140-6736(23)00620-7 19. Nakamura Y Kawazoe A Lordick F Janjigian YY Shitara K Biomarker-targeted therapies for advanced-stage gastric and gastro-oesophageal junction cancers: an emerging paradigm Nat Rev Clin Oncol 2021 18 8 473 487 10.1038/s41571-021-00492-2 33790428 Nakamura Y, Kawazoe A, Lordick F, Janjigian YY, Shitara K (2021) Biomarker-targeted therapies for advanced-stage gastric and gastro-oesophageal junction cancers: an emerging paradigm. Nat Rev Clin Oncol 18(8):473–487. 10.1038/s41571-021-00492-2 33790428 10.1038/s41571-021-00492-2 20. Shah MA Shitara K Ajani JA Zolbetuximab plus CAPOX in CLDN18.2-positive gastric or gastroesophageal junction adenocarcinoma: the randomized, phase 3 GLOW trial Nat Med 2023 29 8 2133 2141 10.1038/s41591-023-02465-7 37524953 PMC10427418 Shah MA, Shitara K, Ajani JA et al (2023) Zolbetuximab plus CAPOX in CLDN18.2-positive gastric or gastroesophageal junction adenocarcinoma: the randomized, phase 3 GLOW trial. Nat Med 29(8):2133–2141 37524953 10.1038/s41591-023-02465-7 PMC10427418 21. Klempner SJ Lee KW Shitara K ILUSTRO: phase II multicohort trial of zolbetuximab in patients with advanced or metastatic claudin 18.2-positive gastric or gastroesophageal junction adenocarcinoma Clin Cancer Res 2023 29 19 3882 3891 10.1158/1078-0432.CCR-23-0204 37490286 PMC10543966 Klempner SJ, Lee KW, Shitara K et al (2023) ILUSTRO: phase II multicohort trial of zolbetuximab in patients with advanced or metastatic claudin 18.2-positive gastric or gastroesophageal junction adenocarcinoma. Clin Cancer Res 29(19):3882–3891 37490286 10.1158/1078-0432.CCR-23-0204 PMC10543966 22. Keam SJ Zolbetuximab: first approval Drugs 2024 84 8 977 983 10.1007/s40265-024-02056-x 38967717 Keam SJ (2024) Zolbetuximab: first approval. Drugs 84(8):977–983. 10.1007/s40265-024-02056-x 38967717 10.1007/s40265-024-02056-x 23. Fassan M Kuwata T Matkowskyj KA Röcken C Rüschoff J Claudin-18.2 immunohistochemical evaluation in gastric and gastroesophageal junction adenocarcinomas to direct targeted therapy: a practical approach Mod Pathol 2024 37 11 100589 10.1016/j.modpat.2024.100589 39098518 Fassan M, Kuwata T, Matkowskyj KA, Röcken C, Rüschoff J (2024) Claudin-18.2 immunohistochemical evaluation in gastric and gastroesophageal junction adenocarcinomas to direct targeted therapy: a practical approach. Mod Pathol 37(11):100589 39098518 10.1016/j.modpat.2024.100589 24. Lop Gros J Santiago Díaz P Larrubia Loring M Patriarca ME Lloveras B Iglesias M Claudin 18.2 immunohistochemistry expression in gastric cancer: a systematic review Appl Immunohistochem Mol Morphol 2025 33 2 61 69 10.1097/PAI.0000000000001248 39894972 Lop Gros J, Santiago Díaz P, Larrubia Loring M, Patriarca ME, Lloveras B, Iglesias M (2025) Claudin 18.2 immunohistochemistry expression in gastric cancer: a systematic review. Appl Immunohistochem Mol Morphol 33(2):61–69. 10.1097/PAI.0000000000001248 39894972 10.1097/PAI.0000000000001248 25. Tao D Guan B Li H Zhou C Expression patterns of claudins in cancer Heliyon 2023 9 11 e21338 10.1016/j.heliyon.2023.e21338 37954388 PMC10637965 Tao D, Guan B, Li H, Zhou C (2023) Expression patterns of claudins in cancer. Heliyon 9(11):e21338 37954388 10.1016/j.heliyon.2023.e21338 PMC10637965 26. Saito T Matsuda T Moran D Claudin 18 isoform expression in gastric adenocarcinoma and pancreatic adenocarcinoma Ann Oncol 2021 32 Suppl 3 S318 Saito T, Matsuda T, Moran D (2021) Claudin 18 isoform expression in gastric adenocarcinoma and pancreatic adenocarcinoma. Ann Oncol 32(Suppl 3):S318 27. Türeci O Koslowski M Helftenbein G Castle J Rohde C Dhaene K Seitz G Sahin U Claudin-18 gene structure, regulation, and expression is evolutionary conserved in mammals Gene 2011 481 2 83 92 10.1016/j.gene.2011.04.007 21571049 Türeci O, Koslowski M, Helftenbein G, Castle J, Rohde C, Dhaene K, Seitz G, Sahin U (2011) Claudin-18 gene structure, regulation, and expression is evolutionary conserved in mammals. Gene 481(2):83–92 21571049 10.1016/j.gene.2011.04.007 28. Furuse M Fujita K Hiiragi T Claudin-1 and -2: novel integral membrane proteins localizing at tight junctions with no sequence similarity to occludin J Cell Biol 1998 141 7 1539 1550 10.1083/jcb.141.7.1539 9647647 PMC2132999 Furuse M, Fujita K, Hiiragi T et al (1998) Claudin-1 and -2: novel integral membrane proteins localizing at tight junctions with no sequence similarity to occludin. J Cell Biol 141(7):1539–1550 9647647 10.1083/jcb.141.7.1539 PMC2132999 29. Elkouby-Naor L Ben-Yosef T Functions of claudin tight junction proteins and their complex interactions in various physiological systems Int Rev Cell Mol Biol 2010 279 1 32 10.1016/S1937-6448(10)79001-8 20797675 Elkouby-Naor L, Ben-Yosef T (2010) Functions of claudin tight junction proteins and their complex interactions in various physiological systems. Int Rev Cell Mol Biol 279:1–32 20797675 10.1016/S1937-6448(10)79001-8 30. Schlingmann B Molina SA Koval M Claudins: gatekeepers of lung epithelial function Semin Cell Dev Biol 2015 42 47 57 10.1016/j.semcdb.2015.04.009 25951797 PMC4562902 Schlingmann B, Molina SA, Koval M (2015) Claudins: gatekeepers of lung epithelial function. Semin Cell Dev Biol 42:47–57 25951797 10.1016/j.semcdb.2015.04.009 PMC4562902 31. Sahin U Koslowski M Dhaene K Usener D Brandenburg G Seitz G Huber C Türeci O Claudin-18 splice variant 2 is a pan-cancer target suitable for therapeutic antibody development Clin Cancer Res 2008 14 23 7624 7634 10.1158/1078-0432.CCR-08-1547 19047087 Sahin U, Koslowski M, Dhaene K, Usener D, Brandenburg G, Seitz G, Huber C, Türeci O (2008) Claudin-18 splice variant 2 is a pan-cancer target suitable for therapeutic antibody development. Clin Cancer Res 14(23):7624–7634 19047087 10.1158/1078-0432.CCR-08-1547 32. Cao W Xing H Li Y Tian W Song Y Jiang Z Yu J Claudin18.2 is a novel molecular biomarker for tumor-targeted immunotherapy Biomark Res 2022 10 1 38 10.1186/s40364-022-00385-1 35642043 PMC9153115 Cao W, Xing H, Li Y, Tian W, Song Y, Jiang Z, Yu J (2022) Claudin18.2 is a novel molecular biomarker for tumor-targeted immunotherapy. Biomark Res 10(1):38 35642043 10.1186/s40364-022-00385-1 PMC9153115 33. Sahin U Schuler M Richly H A phase I dose-escalation study of IMAB362 (zolbetuximab) in patients with advanced gastric and gastro-oesophageal junction cancer Eur J Cancer 2018 100 17 26 10.1016/j.ejca.2018.05.007 29936063 Sahin U, Schuler M, Richly H et al (2018) A phase I dose-escalation study of IMAB362 (zolbetuximab) in patients with advanced gastric and gastro-oesophageal junction cancer. Eur J Cancer 100:17–26 29936063 10.1016/j.ejca.2018.05.007 34. van Laarhoven HWM Derks S Claudin-18.2 targeting by zolbetuximab: results of SPOTLIGHT in perspective Lancet 2023 401 10389 1630 1631 10.1016/S0140-6736(23)00732-8 37068506 van Laarhoven HWM, Derks S (2023) Claudin-18.2 targeting by zolbetuximab: results of SPOTLIGHT in perspective. Lancet 401(10389):1630–1631 37068506 10.1016/S0140-6736(23)00732-8 35. Qi C Gong J Li J Claudin18.2-specific CAR T cells in gastrointestinal cancers: phase 1 trial interim results Nat Med 2022 28 6 1189 1198 10.1038/s41591-022-01800-8 35534566 PMC9205778 Qi C, Gong J, Li J et al (2022) Claudin18.2-specific CAR T cells in gastrointestinal cancers: phase 1 trial interim results. Nat Med 28(6):1189–1198 35534566 10.1038/s41591-022-01800-8 PMC9205778 36. Zhou KI Strickler JH Chen H Targeting claudin-18.2 for cancer therapy: updates from 2024 ASCO annual meeting J Hematol Oncol 2024 26 1 17 73 10.1186/s13045-024-01595-w PMC11346204 39183320 Zhou KI, Strickler JH, Chen H (2024) Targeting claudin-18.2 for cancer therapy: updates from 2024 ASCO annual meeting. J Hematol Oncol 26(1):17–73 10.1186/s13045-024-01595-w PMC11346204 39183320 37. Park S Shin K Kim IH Clinicopathological features and prognosis of resected pancreatic ductal adenocarcinoma patients with claudin-18 overexpression J Clin Med 2023 12 16 5394 10.3390/jcm12165394 37629433 PMC10455540 Park S, Shin K, Kim IH et al (2023) Clinicopathological features and prognosis of resected pancreatic ductal adenocarcinoma patients with claudin-18 overexpression. J Clin Med 12(16):5394 37629433 10.3390/jcm12165394 PMC10455540 38. Lyu SI Fretter C Simon AG Extent and clinical significance of the therapy-relevant tight junction protein claudin 18.2 in pancreatic ductal adenocarcinoma - real-world evidence Transl Oncol 2024 47 102044 10.1016/j.tranon.2024.102044 38917592 PMC11255103 Lyu SI, Fretter C, Simon AG et al (2024) Extent and clinical significance of the therapy-relevant tight junction protein claudin 18.2 in pancreatic ductal adenocarcinoma - real-world evidence. Transl Oncol 47:102044 38917592 10.1016/j.tranon.2024.102044 PMC11255103 39. Kayikcioglu E Yüceer RO The role of claudin 18.2 and HER-2 in pancreatic cancer outcomes Medicine (Baltimore) 2023 102 6 e32882 10.1097/MD.0000000000032882 36820561 PMC9907975 Kayikcioglu E, Yüceer RO (2023) The role of claudin 18.2 and HER-2 in pancreatic cancer outcomes. Medicine (Baltimore) 102(6):e32882 36820561 10.1097/MD.0000000000032882 PMC9907975 40. Tanaka M Shibahara J Fukushima N Claudin-18 is an early-stage marker of pancreatic carcinogenesis J Histochem Cytochem 2011 59 10 942 952 10.1369/0022155411420569 21832145 PMC3201126 Tanaka M, Shibahara J, Fukushima N et al (2011) Claudin-18 is an early-stage marker of pancreatic carcinogenesis. J Histochem Cytochem 59(10):942–952 21832145 10.1369/0022155411420569 PMC3201126 41. Riva G Pea A Pilati C Histo-molecular oncogenesis of pancreatic cancer: from precancerous lesions to invasive ductal adenocarcinoma World J Gastrointest Oncol 2018 10 10 317 327 10.4251/wjgo.v10.i10.317 30364837 PMC6198304 Riva G, Pea A, Pilati C et al (2018) Histo-molecular oncogenesis of pancreatic cancer: from precancerous lesions to invasive ductal adenocarcinoma. World J Gastrointest Oncol 10(10):317–327 30364837 10.4251/wjgo.v10.i10.317 PMC6198304 42. Wood LD Adsay NV Basturk O Systematic review of challenging issues in pathology of intraductal papillary mucinous neoplasms Pancreatology 2023 23 7 878 891 10.1016/j.pan.2023.08.002 37604731 Wood LD, Adsay NV, Basturk O et al (2023) Systematic review of challenging issues in pathology of intraductal papillary mucinous neoplasms. Pancreatology 23(7):878–891 37604731 10.1016/j.pan.2023.08.002 43. Basturk O Hong SM Wood LD A revised classification system and recommendations from the Baltimore Consensus Meeting for neoplastic precursor lesions in the pancreas Am J Surg Pathol 2015 39 12 1730 1741 10.1097/PAS.0000000000000533 26559377 PMC4646710 Basturk O, Hong SM, Wood LD et al (2015) A revised classification system and recommendations from the Baltimore Consensus Meeting for neoplastic precursor lesions in the pancreas. Am J Surg Pathol 39(12):1730–1741 26559377 10.1097/PAS.0000000000000533 PMC4646710 44. De Sanctis F Dusi S Caligola S Expression of the membrane tetraspanin claudin 18 on cancer cells promotes T lymphocyte infiltration and antitumor immunity in pancreatic cancer Immunity 2024 57 6 1378 1393.e14 10.1016/j.immuni.2024.04.021 38749447 De Sanctis F, Dusi S, Caligola S et al (2024) Expression of the membrane tetraspanin claudin 18 on cancer cells promotes T lymphocyte infiltration and antitumor immunity in pancreatic cancer. Immunity 57(6):1378-1393.e14 38749447 10.1016/j.immuni.2024.04.021 45. Jasani B Taniere P Schildhaus HU Global ring study to investigate the comparability of total assay performance of commercial claudin 18 antibodies for evaluation in gastric cancer Lab Invest 2024 104 1 100284 10.1016/j.labinv.2023.100284 37949357 Jasani B, Taniere P, Schildhaus HU et al (2024) Global ring study to investigate the comparability of total assay performance of commercial claudin 18 antibodies for evaluation in gastric cancer. Lab Invest 104(1):100284 37949357 10.1016/j.labinv.2023.100284 46. Türeci O Sahin U Schulze-Bergkamen H A multicentre, phase IIa study of zolbetuximab as a single agent in patients with recurrent or refractory advanced adenocarcinoma of the stomach or lower oesophagus: the MONO study Ann Oncol 2019 30 9 1487 1495 10.1093/annonc/mdz199 31240302 PMC6771222 Türeci O, Sahin U, Schulze-Bergkamen H et al (2019) A multicentre, phase IIa study of zolbetuximab as a single agent in patients with recurrent or refractory advanced adenocarcinoma of the stomach or lower oesophagus: the MONO study. Ann Oncol 30(9):1487–1495 31240302 10.1093/annonc/mdz199 PMC6771222 47. Sahin U Türeci Ö Manikhas G FAST: a randomised phase II study of zolbetuximab (IMAB362) plus EOX versus EOX alone for first-line treatment of advanced CLDN18.2-positive gastric and gastro-oesophageal adenocarcinoma Ann Oncol 2021 32 5 609 619 10.1016/j.annonc.2021.02.005 33610734 Sahin U, Türeci Ö, Manikhas G et al (2021) FAST: a randomised phase II study of zolbetuximab (IMAB362) plus EOX versus EOX alone for first-line treatment of advanced CLDN18.2-positive gastric and gastro-oesophageal adenocarcinoma. Ann Oncol 32(5):609–619 33610734 10.1016/j.annonc.2021.02.005 48. Arnold A Daum S von Winterfeld M Prognostic impact of claudin 18.2 in gastric and esophageal adenocarcinomas Clin Transl Oncol 2020 22 12 2357 2363 10.1007/s12094-020-02380-0 32488802 PMC7577914 Arnold A, Daum S, von Winterfeld M et al (2020) Prognostic impact of claudin 18.2 in gastric and esophageal adenocarcinomas. Clin Transl Oncol 22(12):2357–2363 32488802 10.1007/s12094-020-02380-0 PMC7577914 49. Scheel AH Penault-Llorca F Hanna W Physical basis of the ‘magnification rule’ for standardized Immunohistochemical scoring of HER2 in breast and gastric cancer Diagn Pathol 2018 13 1 19 10.1186/s13000-018-0696-x 29530054 PMC5848460 Scheel AH, Penault-Llorca F, Hanna W et al (2018) Physical basis of the ‘magnification rule’ for standardized Immunohistochemical scoring of HER2 in breast and gastric cancer. Diagn Pathol 13(1):19 29530054 10.1186/s13000-018-0696-x PMC5848460 50. Wang X Zhang CS Dong XY Claudin 18.2 is a potential therapeutic target for zolbetuximab in pancreatic ductal adenocarcinoma World J Gastrointest Oncol 2022 14 1252 1264 10.4251/wjgo.v14.i7.1252 36051096 PMC9305579 Wang X, Zhang CS, Dong XY et al (2022) Claudin 18.2 is a potential therapeutic target for zolbetuximab in pancreatic ductal adenocarcinoma. World J Gastrointest Oncol 14:1252–1264 36051096 10.4251/wjgo.v14.i7.1252 PMC9305579 51. Liffers ST Godfrey L Frohn L Molecular heterogeneity and commonalities in pancreatic cancer precursors with gastric and intestinal phenotype Gut 2023 72 3 522 534 10.1136/gutjnl-2021-326550 35944927 PMC9933174 Liffers ST, Godfrey L, Frohn L et al (2023) Molecular heterogeneity and commonalities in pancreatic cancer precursors with gastric and intestinal phenotype. Gut 72(3):522–534 35944927 10.1136/gutjnl-2021-326550 PMC9933174 52. Yonezawa S Higashi M Yamada N Goto M Precursor lesions of pancreatic cancer Gut Liver 2008 2 3 137 154 10.5009/gnl.2008.2.3.137 20485640 PMC2871636 Yonezawa S, Higashi M, Yamada N, Goto M (2008) Precursor lesions of pancreatic cancer. Gut Liver 2(3):137–154 20485640 10.5009/gnl.2008.2.3.137 PMC2871636 53. Braxton AM Kiemen AL Grahn MP 3D genomic mapping reveals multifocality of human pancreatic precancers Nature 2024 629 8012 679 687 10.1038/s41586-024-07359-3 38693266 Braxton AM, Kiemen AL, Grahn MP et al (2024) 3D genomic mapping reveals multifocality of human pancreatic precancers. Nature 629(8012):679–687 38693266 10.1038/s41586-024-07359-3 54. Schlitter AM Segler A Steiger K Molecular, morphological and survival analysis of 177 resected pancreatic ductal adenocarcinomas (PDACs): identification of prognostic subtypes Sci Rep 2017 7 41064 10.1038/srep41064 28145465 PMC5286512 Schlitter AM, Segler A, Steiger K et al (2017) Molecular, morphological and survival analysis of 177 resected pancreatic ductal adenocarcinomas (PDACs): identification of prognostic subtypes. Sci Rep 7:41064. 10.1038/srep41064 28145465 10.1038/srep41064 PMC5286512 55. Kalimuthu SN Wilson GW Grant RC Morphological classification of pancreatic ductal adenocarcinoma that predicts molecular subtypes and correlates with clinical outcome Gut 2020 69 2 317 328 10.1136/gutjnl-2019-318217 31201285 Kalimuthu SN, Wilson GW, Grant RC et al (2020) Morphological classification of pancreatic ductal adenocarcinoma that predicts molecular subtypes and correlates with clinical outcome. Gut 69(2):317–328 31201285 10.1136/gutjnl-2019-318217 56. Lionetto G, Mattiolo P, Ciulla C et al (2024) Morphologic characterization of pancreatic ductal adenocarcinoma following post-neoadjuvant pancreatectomy and clinical value of intratumor heterogeneity. Ann Surg. 10.1097/SLA.0000000000006565 10.1097/SLA.0000000000006565 39403801 57. Compton CC Robb JA Anderson MW Preanalytics and precision pathology: pathology practices to ensure molecular integrity of cancer patient biospecimens for precision medicine Arch Pathol Lab Med 2019 143 1346e1363 10.5858/arpa.2019-0009-SA 31329478 Compton CC, Robb JA, Anderson MW et al (2019) Preanalytics and precision pathology: pathology practices to ensure molecular integrity of cancer patient biospecimens for precision medicine. Arch Pathol Lab Med 143:1346e1363 31329478 10.5858/arpa.2019-0009-SA 58. Mizrahi JD Surana R Valle JW Shroff RT Pancreatic cancer Lancet 2020 395 10242 2008 2020 10.1016/S0140-6736(20)30974-0 32593337 Mizrahi JD, Surana R, Valle JW, Shroff RT (2020) Pancreatic cancer. Lancet 395(10242):2008–2020 32593337 10.1016/S0140-6736(20)30974-0 59. Park W Chawla A O’Reilly EM Pancreatic cancer: a review JAMA 2021 326 9 851 862 10.1001/jama.2021.13027 34547082 PMC9363152 Park W, Chawla A, O’Reilly EM (2021) Pancreatic cancer: a review. JAMA 326(9):851–862 34547082 10.1001/jama.2021.13027 PMC9363152 60. Hanks M Ryder S Zaitoun A The role of cytology in the investigation and management of pancreatobiliary lesions with a transition towards a standardised reporting system: an institutional perspective Cytopathology 2022 33 3 293 300 10.1111/cyt.13115 35231151 Hanks M, Ryder S, Zaitoun A (2022) The role of cytology in the investigation and management of pancreatobiliary lesions with a transition towards a standardised reporting system: an institutional perspective. Cytopathology 33(3):293–300 35231151 10.1111/cyt.13115 61. Thompson ED Zhang ML VandenBussche CJ The diagnostic challenge of evaluating small biopsies from the pancreatobiliary system Surg Pathol Clin 2022 15 3 435 453 10.1016/j.path.2022.05.001 36049827 Thompson ED, Zhang ML, VandenBussche CJ (2022) The diagnostic challenge of evaluating small biopsies from the pancreatobiliary system. Surg Pathol Clin 15(3):435–453 36049827 10.1016/j.path.2022.05.001 62. Luchini C Diagnostic pearls and pitfalls in the evaluation of biopsies of the pancreas Arch Pathol Lab Med 2025 149 3 e54 e62 10.5858/arpa.2023-0426-RA 38387616 Luchini C (2025) Diagnostic pearls and pitfalls in the evaluation of biopsies of the pancreas. Arch Pathol Lab Med 149(3):e54–e62 38387616 10.5858/arpa.2023-0426-RA 63. Valentini AM, Arborea G, Grassi I et al (2025) Claudin 18.2: an attractive marker in pancreatic ductal adenocarcinoma. Oncol Lett 29(3):140 10.3892/ol.2025.14886 PMC11755226 39850722 64. Rozenblum E Schutte M Goggins M Tumor-suppressive pathways in pancreatic carcinoma Cancer Res 1997 57 9 1731 1734 9135016 Rozenblum E, Schutte M, Goggins M et al (1997) Tumor-suppressive pathways in pancreatic carcinoma. Cancer Res 57(9):1731–1734 9135016 65. Wilentz RE Su GH Dai JL Immunohistochemical labeling for dpc4 mirrors genetic status in pancreatic adenocarcinomas : a new marker of DPC4 inactivation Am J Pathol 2000 156 1 37 43 10.1016/S0002-9440(10)64703-7 10623651 PMC1868651 Wilentz RE, Su GH, Dai JL et al (2000) Immunohistochemical labeling for dpc4 mirrors genetic status in pancreatic adenocarcinomas : a new marker of DPC4 inactivation. Am J Pathol 156(1):37–43 10623651 10.1016/S0002-9440(10)64703-7 PMC1868651 66. Wöll S Schlitter AM Dhaene K Roller M Esposito I Sahin U Türeci Ö Claudin 18.2 is a target for IMAB362 antibody in pancreatic neoplasms Int J Cancer 2014 134 3 731 739 10.1002/ijc.28400 23900716 Wöll S, Schlitter AM, Dhaene K, Roller M, Esposito I, Sahin U, Türeci Ö (2014) Claudin 18.2 is a target for IMAB362 antibody in pancreatic neoplasms. Int J Cancer 134(3 23900716 10.1002/ijc.28400 67. Matias-Guiu X, Raspollini MR, Kulka J, Ryska A, Al Dieri R, Schirmacher P (2025) European Society of Pathology (ESP). The role of the pathologist in the design and conducting of biomarker-driven clinical trials in cancer: position paper of the European Society of Pathology. Virchows Arch 486(2):207-214. 10.1007/s00428-024-04005-1 10.1007/s00428-024-04005-1 PMC11876233 39690330 ",
  "metadata": {
    "Title of this paper": "Claudin 18.2 is a target for IMAB362 antibody in pancreatic neoplasms",
    "Journal it was published in:": "Virchows Archiv",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488767/"
  }
}