{
  "title": "Paper_338",
  "abstract": "pmc JCO Clin Cancer Inform JCO Clin Cancer Inform 2035 lwwopen CCI JCO Clinical Cancer Informatics 2473-4276 pmc-is-collection-domain yes pmc-collection-title Lippincott Open Access PMC12487657 PMC12487657.1 12487657 12487657 41004706 10.1200/CCI-25-00093 CCI-25-00093 1 ORIGINAL REPORTS Artificial Intelligence Artificial Intelligence–Based Model Exploiting Hematoxylin and Eosin Images to Predict Rare Gene Mutations in Patients With Lung Adenocarcinoma Yu Peiling MD  1 https://orcid.org/0000-0002-8081-1289 Chen Weixing PhD  2 Liu Nan MD  3 Yu Yang MD  1  4 Guo Hongyu MD  1 Yuan Yinan MD  1 Guo Weilin MD  1 https://orcid.org/0009-0003-4257-7043 Alatan Yini MD  1 Zhao Jinming MD  1 Su Hongbo MD  1 Nie Siru MD  1 Cui Xiaoyu PhD  2 https://orcid.org/0000-0001-7869-8099 Miao Yuan MD  3 1 China 2 China 3 China 4 China Yuan Miao, MD; e-mail: cmumiaoyuan@163.com 2025 26 9 2025 9 498100 e2500093 1 4 2025 28 5 2025 13 8 2025 26 09 2025 02 10 2025 03 10 2025 © 2025 by American Society of Clinical Oncology 2025 American Society of Clinical Oncology https://creativecommons.org/licenses/by-nc-nd/4.0/ Creative Commons Attribution Non-Commercial No Derivatives 4.0 License: https://creativecommons.org/licenses/by-nc-nd/4.0/ PURPOSE Accurately identifying gene mutations in lung cancer is crucial for treatment, while molecular diagnostic methods are time-consuming and complex. This study aims to develop an advanced deep learning model to address this issue. METHODS In this study, the ResNeXt101 model framework was established to predict the gene mutation status in lung adenocarcinoma. The model was trained and validated using data from two cohorts: cohort 1, comprising 144 patients from the First Affiliated Hospital of China Medical University, and cohort 2, which includes 69 patients from the The Cancer Genome Atlas-Lung Adenocarcinoma public database. The model was trained and validated on the two data sets, respectively, and they served as external test sets for each other to further verify the performance of the model. Additionally, we tested the trained model on a metastatic cancer data set, which included metastases to organs outside the lungs. The performance of the model was evaluated using the AUC, accuracy, precision, recall, and F1 score. RESULTS In cohort 1, the model achieved an AUC ranging from 0.93 to 1. In the external test on cohort 2, it performed well in predicting five of the six genes (AUC = 0.85-1). When tested on the metastatic cancer data set, it successfully predicted mutations of three of the six genes (AUC = 0.72-0.80). CONCLUSION The artificial intelligence model developed in this study has a high accuracy in predicting gene mutations in lung adenocarcinoma, which is conducive to improving the management of patients with lung adenocarcinoma and promoting precision medicine. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes OPEN-ACCESS TRUE INTRODUCTION Lung cancer is the most prevalent cancer globally and remains the leading cause of cancer-related mortality, with a dismal 5-year survival rate of only 15%. This disease is characterized by significant heterogeneity and is broadly classified into two major types based on tumor histology: small cell lung cancer, which accounts for approximately 15% of cases, and non–small cell lung cancer (NSCLC). 1 2 CONTEXT   Key Objective To develop a deep learning model using hematoxylin and eosin (H&E)–stained slides to predict six rare gene mutations in patients with lung adenocarcinoma.  Knowledge Generated The ResNeXt101-based model achieved high accuracy (AUC = 0.93-1 in cohort 1) and could predict mutations in metastatic cancer, outperforming previous models.  Relevance ( P.-M. Putora The presented Artificial Intelligence-based model can predict mutations of treatment-relevant genes in lung adenocarcinoma using H&E-stained slides. Such an approach may be the basis to reduce costs and improve workflows.* *Relevance section written by JCO Clinical Cancer Informatics Treatment options for LUAD include surgery, radiotherapy, chemotherapy, targeted therapy, immunotherapy, or a combination of these approaches. 3 EGFR ALK RET ROS1 4 6 EGFR ALK HER2 c-MET ROS1 KRAS RET 7 9 Hematoxylin and eosin (H&E)–stained histology sections reflect rich tumor morphology. Specific driver mutations may endow characteristic histopathologic features (eg, nuclear pleomorphism, growth patterns), which may be undetectable by human eyes. Deep convolutional networks trained on H&E images can learn complex genotype–phenotype associations to predict molecular alterations from routine pathology slides. Artificial intelligence (AI) can extract microscopic features from these images to predict gene mutations. 10 11 14 15 16 17 18 ALK 19 20 METHODS Data Preprocessing In this study, eligible lung adenocarcinoma patient slides from the First Affiliated Hospital of China Medical University and TCGA database were collected to build a database. This study was conducted in accordance with the Declaration of Helsinki and received ethical approval from the Ethics Committee of the First Hospital of China Medical University (Approval No. AF-SOP-07-1.2-01; institutional review board No. [2024]-1077). Regions of interest (ROIs) for invasive carcinoma were annotated, excluding necrotic areas, benign stroma, and epithelium. ASAP software marked tumor boundaries, and annotations were exported as XML with X and Y coordinates. These were used to extract ROIs from slide images, ensuring training and testing on annotated tumor regions only. Slides from both cohort 1 and cohort 2 were stratified by mutation type and then randomly split at the patient level. Specifically, for cohort 1 (n = 144 patients), 70% of patients were allocated to the training set, 10% to the validation set, and 20% to the internal test set; the cohort 2 test set was reserved as an external test set for cohort 1. Conversely, for cohort 2 (n = 69 patients), patients were similarly divided into 70% training, 10% validation, and 20% internal test sets, whereas the cohort 1 test set served as its external test set. At 400× magnification, the slide images were divided into nonoverlapping tiles of 224 × 224 pixels. Regions containing excessive background, no tissue, or nontumor areas were excluded. Data augmentation was applied to the training tiles by rotating them at 90°, 180°, and 270°, as well as flipping them horizontally and vertically. Additionally, normalization was performed using the image mean and standard deviation, following the same settings as ImageNet. ResNeXt101 Model Framework Our framework is designed to predict the mutation status of six genes ( ALK HER2 KRAS RET MET ROS1 The model training was conducted using two strategies: transfer learning and full training. For transfer learning, the model parameters were initialized with the optimal values from the ImageNet Competition. Full-parameter fine-tuning was performed by adjusting the parameters of the last network layer using backpropagation on the training samples. To evaluate the impact of ROIs on training, we implemented three distinct training schemes to predict gene mutation status: a. Unannotated Binary Classifier: Tiles were assigned labels based on the overall WSI label (positive or negative) without considering ROIs during training. b. Annotated Binary Classifier: Only tiles within the ROIs were used for training. External regions, such as stromal cells, necrotic areas, or mixed regions of tumor and normal cells, were excluded from the training process. WSI labels were applied solely to the tiles within the ROIs. c. Annotated Three-Branch Classifier: Both ROI and non-ROI regions were used to train a multibranch classifier. Tiles within the ROIs were labeled as positive or negative based on the WSI label, whereas tiles outside the ROIs were labeled as “others,” independent of the WSI label. A similar strategy was adopted to train a binary classifier for mutation prediction. The model used cross-entropy as the loss function, and mutation probabilities were calculated for each tile. The training was conducted using stochastic gradient descent optimization with a learning rate of 0.0001 and a weight decay of 0.05. Additionally, the dropout probability for the linear layer was set to 0.5. The training process for each model required approximately 1.2 hours using an NVIDIA RTX A5000 graphics processing unit. Visual Interpretation of the Diagnosis To assess the morphological patterns used by the annotated model, we used the Class Activation Mapping (CAM) technique. Areas of the image that the model focused on are visualized in red, indicating high attention, whereas regions of lesser importance are displayed in blue. This approach provides a visual representation of the model's decision-making process, offering insights into the features influencing its predictions. Statistical Methods To comprehensively evaluate the model's accuracy in predicting LUAD pathology, particularly its ability to predict gene mutation status, we employed the receiver operating characteristic (ROC) curve as a primary evaluation tool. Several key metrics were calculated, including the AUC, accuracy, precision, recall, and F1 score. RESULTS Data Preprocessing and Cohort Partitioning To predict rare gene mutations in the H&E WSIs of LUAD, we compiled a data set consisting of 213 H&E slides from patients with LUAD from patients with LUAD with known mutation statuses for ALK HER2 KRAS RET MET ROS1 Cohort 1 consisted of 144 patients selected from a total of 4,064 individuals who underwent gene testing between August 2018 and August 2022 at the First Affiliated Hospital of China Medical University. The patients' age ranged from 23 to 81 years, with a median age of 60 years. The male-to-female ratio was 59:85, and 25 patients had a history of smoking. There were 70 surgical specimens and 74 biopsy specimens. The specific specimen distribution is shown in Appendix Table A 1 Cohort 2 was derived from The Cancer Genome Atlas-Lung Adenocarcinoma database. After a pathologist review, 69 patients were selected for inclusion in this cohort. The patients' age ranged from 41 to 85 years, with a median age of 65 years. The male-to-female ratio was 34:35, and 50 patients were smokers. All specimens are surgical specimens. The gene distribution in each cohort is summarized as follows (Fig 1 FIG 1. Data distribution: (A) Proportion of cases in each gene mutation group in cohort 1; (B) proportion of cases in each gene mutation group in cohort 2; (C) size distribution of the image widths (black) and heights (gray); (D) distribution of the number of tiles per slide. Cohort 1, 39 cases of ALK HER2 KRAS RET MET ROS1 Cohort 2, 13 cases of ALK HER2 KRAS RET MET ROS1 Experienced pathologists annotated, segmented, and denoised the tumor regions in the H&E-stained slides. The annotated tumor regions were then cropped into 224 × 224-pixel image tiles, which were randomly divided into training, validation, and test sets (Table 1 TABLE 1. Patch Distribution in the Model Dataset and Cohort ALK HER2 RET MET ROS1 KRAS (–) Cohort 1 Training set, No. 238,571 148,980 228,877 214,237 166,802 69,600 124,299 Validation set, No. 40,750 26,715 10,332 56,886 97,089 26,494 33,463 Testing set, No. 133,991 95,278 93,224 143,457 128,698 70,590 21,953 Cohort 2 Training set, No. 204,810 31,403 161,088 153,307 256,629 80,851 102,396 Validation set, No. 11,481 50,569 7,372 32,237 124,109 3,167 967 Testing set, No. 29,051 477 32,586 56,858 47,816 63,507 40,598 To assess model generalizability to metastatic disease, we assembled an independent metastatic test set comprising 26 WSIs from 26 patients. Slides were drawn from metastatic lung adenocarcinoma sites and stratified by driver mutation. At the slide level, the cohort includes ALK HER2 KRAS RET MET ROS1 ALK HER2 KRAS RET MET ROS1 Model Architecture and Training Performance The goal of this study was to develop a deep learning model that uses H&E-stained slides as the sole input to predict rare gene mutations in NSCLC. We trained the model using 144 WSIs from our institution and 69 WSIs from the TCGA database to train the model. Because the size of a WSI is too large (Fig 1 1 Using the calculation strategy depicted in Figure 2 ALK HER2 KRAS RET MET ROS1 3 3 FIG 2. Calculation strategy: First, the patient's WSI was cut into tile-like patches, and patches with <50% of the tissue volume were removed in the preprocessing stage. Then, the cases were divided into a 70% training set, 10% validation set, and 20% test set. Finally, the output of the model is wild type or mutant. To verify the generalization of the model, we test the two queues as external test sets for each other. WSI, whole-slide image. FIG 3. Model performance: (A) The ROC curve of each gene mutation predicted by the internal test of the cohort 1 training model; (B) the ROC curve of each gene mutation predicted by the internal test of the cohort 2 training model; (C) the ROC curve in cohort 3(when the model was trained with cohort 1 and tested with cohort 2); (D)the ROC curve in cohort 4 (cohort 2 training model cohort 1 makes an external test set). ROC, receiver operating characteristic. To further assess the generalization ability of our model, we used the two cohorts as independent external test sets for one another. When the model was trained with cohort 1 and tested with cohort 2, it constituted cohort 3. When trained with cohort 2 and tested with cohort 1, it formed cohort 4. Before testing, we observed noticeable differences in the color characteristics of the pathologic images between the two cohorts, particularly among the negative cases. To address this, we preprocessed the color characteristics of the test set images (a comparison of the images before and after processing is shown in Appendix Fig A 1 When the model trained in cohort 1 was tested in cohort 2, the model exhibited strong predictive capability for five of the six genes (AUC = 0.85-1; Fig 3 HER2 HER2 However, when the model trained in cohort 2 was tested in cohort 1, its performance was poorer, with AUC values ranging from 0.26 to 0.82 (Fig 3 Interpretability of the Model To enhance the understanding of the model's predictions and build trust, we used CAM to conduct a visual analysis of the image tiles that were correctly classified with high confidence. As shown in Figure 4 ALK ALK 21 HER2 22 KRAS MAPK/ERK PI3K/AKT 23 MET 23 RET ROS1 ROS1 24 FIG 4. Visualization of gene mutation prediction results. Grad-CAM is used to display the activation of the last convolution layer of the block-level prediction model. It shows the activation of the last convolutional layer using Grad-CAM for gene mutation prediction evaluation. CAM, Class Activation Mapping. Prediction of Gene Mutation Status in Metastatic Cancer Lung cancer is often diagnosed at the metastatic stage, and molecular testing of metastatic cancer is crucial but challenging because of limited tissue samples. 25 HER2 KRAS RET 2 TABLE 2. Test Results in Metastatic Cancer Gene ACC SPE PRE Recall F1 Score AUC  ALK 37.74 61.11 47.81 46.76 36.29 47.35  HER2 40.71 94.03 60.33 56.35 39.48 78.14  KRAS 59.51 91.43 66.94 60.78 56.03 80.25  RET 57.14 93.73 67.99 61.18 54.29 71.90  MET 32.78 54.90 29.14 33.19 29.65 15.62  ROS-1 56.48 24.70 46.34 43.41 42.70 49.62 Abbreviations: ACC, accuracy; PRE, precision; SPE, specificity. DISCUSSION Targeted therapy is a promising treatment approach for lung cancer. Techniques such as immunohistochemistry, fluorescence in situ hybridization, and NGS are used to identify gene mutations. Although these detection methods have their respective advantages, they have limitations in clinical practice, such as high cost and time-consuming nature, which restrict the application of targeted therapy. 26 27 Our model is capable of evaluating the status of key biomarkers through WSIs, significantly shortening the time interval from diagnosis to the initiation of targeted therapy. It can assist pathologists by highlighting samples that may harbor potential mutations, allowing for prioritized examination. Once routine molecular testing is completed, samples with discrepancies between the results of the routine test and the AI model can undergo additional confirmation tests before final reporting to the patient. Thus, AI not only enhances the accuracy of biomarker detection but also aids in adjusting the priority of patient testing, ultimately improving the efficiency and precision of clinical decision making. In addition, our model can also be applied in clinical trials to screen patients with rare molecular subtypes. This provides a more precise group of patients for targeted drug development, accelerating the research and development process of new targeted drugs. We also applied the model to pathologic images of metastatic cancer, which had not been included in the training process, an approach not explored in previous studies. Among the six rare mutant genes tested, HER2 KRAS RET We chose ResNeXt101 for gene mutation prediction because of its efficient grouped convolutions, which improve feature extraction and reduce computational complexity. Alternative models like EfficientNet and Vision Transformers were considered but rejected due to higher computational costs or limited validation in pathology-based mutation prediction. Future work may compare architectures to validate the optimal approach. In conclusion, the LUAD pathologic image recognition model we developed, on the basis of ResNeXt101 architecture, demonstrated good accuracy and feasibility in predicting ALK HER2 KRAS RET MET ROS1 This study has limitations. The small sample size and rare mutation subset may cause class imbalance. Despite using data augmentation and weighted loss functions, larger multi-institutional data sets are needed to enhance generalizability. The black-box characteristic of deep learning limits interpretability because the model's prediction basis remains unclear, risking trust issues. There is no formal comparison of CAM confidence scores between primary and metastatic samples; future work will expand samples, standardize scoring, and test activation differences. Prospective clinical trials are essential to validate the model's real-world applicability, and clinical implementation still has a long way to go. SUPPORT Supported by the Central-Guided Funding Project for Local Science and Technology Development in Liaoning Province (No. 2024JH6/100800022 to Y.M.). * P.Y., W.C., N.L. and Y.Y. contributed equally to this work as co-first authors. Y.M., X.C. and S.N. contributed equally to this work as co-senior authors. DATA SHARING STATEMENT To ensure patient confidentiality and compliance with ethical guidelines, all pathological image data were anonymized before analysis, with patient identifiers removed and encrypted where applicable. Additionally, data access is restricted to authorized researchers, and sharing is subject to the institutional review board (IRB) approval. Although public data release is not feasible due to privacy constraints, de-identified metadata, and model training scripts will be made available upon request to promote research transparency and reproducibility. Additionally, the model code, including data preprocessing scripts and hyperparameter configurations, will be made available in a public repository upon acceptance of this manuscript. This transparency aims to facilitate independent validation and adaptation of our approach for related research applications. AUTHOR CONTRIBUTIONS Conception and design: Financial support: Administrative support: Provision of study materials or patients: Collection and assembly of data: Data analysis and interpretation: Manuscript writing: Final approval of manuscript: Accountable for all aspects of the work: AUTHORS' DISCLOSURES OF POTENTIAL CONFLICTS OF INTEREST The following represents disclosure information provided by authors of this manuscript. All relationships are considered compensated unless otherwise noted. Relationships are self-held unless noted. I = Immediate Family Member, Inst = My Institution. Relationships may not relate to the subject matter of this manuscript. For more information about ASCO's conflict of interest policy, please refer to www.asco.org/rwc ascopubs.org/cci/author-center Open Payments is a public database containing information reported by companies about payments made to US-licensed physicians ( Open Payments No potential conflicts of interest were reported. APPENDIX TABLE A1. The Specimen Types of Each Gene Mutation in Cohort 1 Specimen Type ALK HER2 RET MET ROS1 KRAS No-Mutation SS 12 15 11 15 9 4 4 BS 27 5 8 5 11 1 17 Abbreviations: BS, biopsy specimens; SS, surgical specimens. FIG A1. Color preprocessing of H&E-dyed images. (A) The original image; (B) The processed image. H&E, hematoxylin and eosin. REFERENCES 1. Chen Z Fillmore CM Hammerman PS et al Non-small-cell lung cancers: A heterogeneous set of diseases Nat Rev Cancer 14 535 546 2014 25056707 10.1038/nrc3775 PMC5712844 2. Davidson MR Gazdar AF Clarke BE The pivotal role of pathology in the management of lung cancer J Thorac Dis 5 S463 S478 2013 suppl 5 24163740 10.3978/j.issn.2072-1439.2013.08.43 PMC3804871 3. Herbst RS Morgensztern D Boshoff C The biology and management of non-small cell lung cancer Nature 553 446 454 2018 29364287 10.1038/nature25183 4. Kwak EL Bang Y-J Camidge DR et al Anaplastic lymphoma kinase inhibition in non-small-cell lung cancer N Engl J Med 363 1693 1703 2010 20979469 10.1056/NEJMoa1006448 PMC3014291 5. Bergethon K Shaw AT Ou S-HI et al ROS1 rearrangements define a unique molecular class of lung cancers J Clin Oncol 30 863 870 2012 22215748 10.1200/JCO.2011.35.6345 PMC3295572 6. Drilon A Wang L Hasanovic A et al Response to cabozantinib in patients with RET fusion-positive lung adenocarcinomas Cancer Discov 3 630 635 2013 23533264 10.1158/2159-8290.CD-13-0035 PMC4160032 7. Ettinger DS Wood DE Aisner DL et al Non-small cell lung cancer, version 3.2022, NCCN clinical practice guidelines in oncology J Natl Compr Canc Netw 20 497 530 2022 35545176 10.6004/jnccn.2022.0025 8. Luo W Wang Z Zhang T et al Immunotherapy in non-small cell lung cancer: Rationale, recent advances and future perspectives Precis Clin Med 4 258 270 2021 35692863 10.1093/pcmedi/pbab027 PMC8982543 9. Lindeman NI Cagle PT Aisner DL et al Updated molecular testing guideline for the selection of lung cancer patients for treatment with targeted tyrosine kinase inhibitors: Guideline from the College of American Pathologists, the International Association for the Study of Lung Cancer, and the Association for Molecular Pathology J Thorac Oncol 13 323 358 2018 29396253 10.1016/j.jtho.2017.12.001 10. Luo X Zang X Yang L et al Comprehensive computational pathological image analysis predicts lung cancer prognosis J Thorac Oncol 12 501 509 2017 27826035 10.1016/j.jtho.2016.10.017 PMC5462113 11. Bychkov D Linder N Turkki R et al Deep learning based tissue analysis predicts outcome in colorectal cancer Sci Rep 8 3395 2018 29467373 10.1038/s41598-018-21758-3 PMC5821847 12. Araújo T Aresta G Castro E et al Classification of breast cancer histology images using convolutional neural networks PLoS One 12 e0177544 2017 28570557 10.1371/journal.pone.0177544 PMC5453426 13. Khameneh FD Razavi S Kamasak M Automated segmentation of cell membranes to evaluate HER2 status in whole slide images using a modified deep learning network Comput Biol Med 110 164 174 2019 31163391 10.1016/j.compbiomed.2019.05.020 14. Couture HD Williams LA Geradts J et al Image analysis with deep learning to predict breast cancer grade, ER status, histologic subtype, and intrinsic subtype NPJ Breast Cancer 4 30 2018 30182055 10.1038/s41523-018-0079-1 PMC6120869 15. Du H Wang X Wang K et al Identifying invasiveness to aid lung adenocarcinoma diagnosis using deep learning and pathomics Sci Rep 15 4913 2025 39929860 10.1038/s41598-025-87094-5 PMC11810995 16. Pan X AbdulJabbar K Coelho-Lima J et al The artificial intelligence-based model ANORAK improves histopathological grading of lung adenocarcinoma Nat Cancer 5 347 363 2024 38200244 10.1038/s43018-023-00694-w PMC10899116 17. Coudray N Ocampo PS Sakellaropoulos T et al Classification and mutation prediction from non-small cell lung cancer histopathology images using deep learning Nat Med 24 1559 1567 2018 30224757 10.1038/s41591-018-0177-5 PMC9847512 18. Terada Y Takahashi T Hayakawa T et al Artificial intelligence-powered prediction of ALK gene rearrangement in patients with non-small-cell lung cancer JCO Clin Cancer Inform 10.1200/CCI.22.00070 10.1200/CCI.22.00070 36162012 19. Niehues JM Quirke P West NP et al Generalizable biomarker prediction from cancer pathology slides with self-supervised deep learning: A retrospective multi-centric study Cell Rep Med 4 100980 2023 36958327 10.1016/j.xcrm.2023.100980 PMC10140458 20. Wu S Yue M Zhang J et al The role of artificial intelligence in accurate interpretation of HER2 immunohistochemical scores 0 and 1+ in breast cancer Mod Pathol 36 100054 2023 36788100 10.1016/j.modpat.2022.100054 21. Yoshida A Tsuta K Nakamura H et al Comprehensive histologic analysis of ALK-rearranged lung carcinomas Am J Surg Pathol 35 1226 1234 2011 21753699 10.1097/PAS.0b013e3182233e06 22. Lee Y Lee B Choi Y-L et al Clinicopathologic and molecular characteristics of HER2 (ERBB2)-altered non-small cell lung cancer: Implications for precision medicine Mod Pathol 37 100490 2024 38588887 10.1016/j.modpat.2024.100490 23. Yatabe Y Molecular pathology of non-small cell carcinoma Histopathology 84 50 66 2024 37936491 10.1111/his.15080 24. Pan Y Zhang Y Li Y et al ALK, ROS1 and RET fusions in 1139 lung adenocarcinomas: A comprehensive study of common and fusion pattern-specific clinicopathologic, histologic and cytologic features Lung Cancer 84 121 126 2014 24629636 10.1016/j.lungcan.2014.02.007 25. Forest F Stachowicz M-L Casteillo F et al EGFR, KRAS, BRAF and HER2 testing in metastatic lung adenocarcinoma: Value of testing on samples with poor specimen adequacy and analysis of discrepancies Exp Mol Pathol 103 306 310 2017 29175303 10.1016/j.yexmp.2017.11.013 26. Ahn M-J Molecular testing in lung cancer: Still big gap in implementation for real-world use J Thorac Oncol 15 1399 1400 2020 32854912 10.1016/j.jtho.2020.06.006 27. Smeltzer MP Wynes MW Lantuejoul S et al The International Association for the Study of Lung Cancer global survey on molecular testing in lung cancer J Thorac Oncol 15 1434 1448 2020 32445813 10.1016/j.jtho.2020.05.002 ",
  "metadata": {
    "Title of this paper": "The International Association for the Study of Lung Cancer global survey on molecular testing in lung cancer",
    "Journal it was published in:": "JCO Clinical Cancer Informatics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487657/"
  }
}