{
  "title": "Paper_511",
  "abstract": "pmc Cell Tissue Res Cell Tissue Res 365 springeropen Cell and Tissue Research 0302-766X 1432-0878 pmc-is-collection-domain yes pmc-collection-title Springer PMC12484096 PMC12484096.1 12484096 12484096 40888895 10.1007/s00441-025-04003-y 4003 1 Research Differential expression of villin and advillin by neuroendocrine and tuft cells in the murine lower airways Mahmoud Wafaa 1 2 Perniss Alexander Aperniss@bwh.harvard.edu 1 3 Poharkar Krupali 1 Keshavarz Maryam 1 4 Gärtner Ulrich 5 Oberwinkler Johannes 6 Schütz Burkhard 7 Worzfeld Thomas 8 Offermanns Stefan 9 Kummer Wolfgang 1 1 https://ror.org/04ckbty56 grid.511808.5 Institute for Anatomy and Cell Biology, German Center for Lung Research, Excellence Cluster Cardio-Pulmonary Institute (CPI), Justus Liebig University Giessen, 2 https://ror.org/03y8mtb59 grid.37553.37 0000 0001 0097 5797 Department of Anatomy, Faculty of Medicine, Jordan University of Science and Technology, 3 https://ror.org/03vek6s52 grid.38142.3c 000000041936754X Division of Allergy and Clinical Immunology, Jeff and Penny Vinik Center for Allergic Disease Research, Brigham & Women’s Hospital and Department of Medicine, Harvard Medical School, 4 https://ror.org/03p14d497 grid.7307.3 0000 0001 2108 9006 Anatomy and Cell Biology, Institute of Theoretical Medicine, Faculty of Medicine, University of Augsburg, 5 https://ror.org/033eqas34 grid.8664.c 0000 0001 2165 8627 Institute for Anatomy and Cell Biology, Justus Liebig University Giessen, 6 https://ror.org/01rdrb571 grid.10253.35 0000 0004 1936 9756 Institut Für Physiologie Und Pathophysiologie, Philipps-Universität Marburg, 7 https://ror.org/03dftj863 Institute of Anatomy and Cell Biology, Philipps-University, 8 https://ror.org/01rdrb571 grid.10253.35 0000 0004 1936 9756 Institute of Pharmacology, Philipps-University Marburg, 9 https://ror.org/0165r2y73 grid.418032.c 0000 0004 0491 220X Max-Planck-Institute for Heart and Lung Research, Excellence Cluster Cardio-Pulmonary Institute (CPI), 1 9 2025 2025 402 1 498041 1 20 16 5 2025 11 8 2025 01 09 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Previous studies identified a rare cell type in the mouse tracheal epithelium with immunoreactivity to the microvillus protein villin ( Vil1 Pou2f3 −/− Vil1 Vil1 Vil1 Avil Avil Graphical Abstract In mice, neuroendocrine cells express villin and persist in Pou2f3-deficient mice. Tuft cells, on the other hand, express advillin and are absent in Pou2f3-deficient mice.  Supplementary Information The online version contains supplementary material available at 10.1007/s00441-025-04003-y. Keywords Tuft cells Brush cells Neuroendocrine cells Villin Advillin https://doi.org/10.13039/501100001659 Deutsche Forschungsgemeinschaft SCHU1259/10 DFG SFB-TR84, project A6 https://doi.org/10.13039/501100021703 Cardio-Pulmonary Institute EXC 147 https://doi.org/10.13039/501100010564 Deutsches Zentrum für Lungenforschung DZL ALI-1.1 Justus-Liebig-Universität Gießen (3114) Open Access funding enabled and organized by Projekt DEAL. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer-Verlag GmbH Germany, part of Springer Nature 2025 Introduction The lining epithelium of the conducting airways is built up by basal, secretory, and ciliated cells as major cell types, and a variety of rare cells, each making up only around 1% of all epithelial cells. The first of them to be discovered were neuroendocrine cells (NEC) and tuft cells (TC; also termed brush or solitary cholinergic chemosensory cells), both originally defined by morphological and histochemical features. Despite being rare, these cells can play major roles in airway physiology and disease (Kotas et al., 2023 2024 2022 2011 2014 2024 2010 2020 2023 2020 2018 2011 2011 2022 2022 NEC occur either solitary or clustered as neuroepithelial bodies (NEB) primarily at branching points of intrapulmonary airways. They are characterized by accumulations of secretory granules (dense core vesicles = DCV) with biogenic amines and peptides in their basal cytoplasm (Bensch et al. 1965 1949 1972 1983 Calca 1991 TC are characterized by a brush or tuft of stiff microvilli at their apical surface, and antibodies against the microvillar actin-binding protein villin (gene name: Vil1 1996 1956 Svil Avil 2008 2008 2020 2020 2007 2011 2020 2011 2020 2017 A third rare cell type, the ionocyte, has just recently been identified by single-cell RNA sequencing (scRNA-seq) analyses (Montoro et al. 2018 2018 2023 In addition to these established cell populations, findings obtained when studying TC utilizing villin-antibodies as a marker pointed toward the existence of a fourth, yet ill-characterized rare cell type in the mouse trachea. It was noted early that not all villin-immunoreactive solitary cells of the tracheal epithelium express ChAT (Krasteva et al. 2011 Pou2f3 Trpm5 2020 2017 Materials and methods Animals Mice were housed under specified pathogen-free (SPF) conditions (10 h dark, 14 h light) with free access to food and water. This study was carried out in accordance with the recommendations of the European Communities Council Directive of 24th November 1986 (86/609/EEC). The protocol was approved by the local authorities. Mice at least 12 weeks of age and from both genders were used. Mice were killed by inhalation of an overdose of 5% isoflurane (Abbott, Wiesbaden, Germany) and exsanguination through abdominal blood vessels. The following mouse strains were used (for further details see Supplementary Tab. 1 n Chat- n tm1Abek Pou2f3 −/− n 2011 the Vil1-Cre + /mTmG + ROSA mT/mG 2007 Vil1 Vil1-Cre Vil1-cre 2002 Vil1-cre ROSA mT/mG Vil1-Cre + /mTmG + n Vil1-Cre − /mTmG + n Vil1-Cre − /mTmG − n Vil1-Cre + /mTmG − n Avil1-Cre + /mTmG + Avil-Cre Avil ROSA mT/mG Vil1-Cre + /mTmG + 2011 Avil-Cre ROSA mT/mG n 2020 3R statement In this study, more than 150 tissue specimens were collected, investigated, and analyzed. In order to adhere to the 3R principle (reduction, replacement, and refinement) in animal experiments principle (Russell 1995 Tissue preparation Tracheas were dissected for cryosections, paraffin sections, RT-PCR (reverse transcription polymerase chain reaction), transmission, or scanning electron microscopy. For RT-PCR of the tracheal epithelium and scanning electron microscopy, the trachea was removed and opened by cutting the trachealis muscle longitudinally to expose the lining epithelium. The trachea was then pinned on a piece of wax to align the epithelial layer approximately in the same plane. The trachea, lung, small intestine, and colon processed for cryosectioning were dissected either freshly or after transcardiac perfusion with Zamboni solution following an initial perfusion with a rinsing solution containing heparin (2 ml/l; 10,000 U; Ratiopharm, Ulm, Germany) and procaine hydrochloride (5 g/l; Merck), pH 7.4. Subsequently, all tissues were immersed in Zamboni’s fixative overnight at 4 °C, followed by washing steps in 0.1 M phosphate buffer (5 × 60 min) and overnight incubation for cryoprotection in 18% sucrose (Merck) in 0.1 M phosphate buffer at 4 °C. For cryopreservation, specimens were embedded in OCT cryostat sectioning medium (Sakura Finetek, Staufen, Germany), frozen in 2-methylbutane (Carl Roth) chilled by liquid nitrogen, and stored at − 20 °C until further processing. For paraffin embedding, samples were dehydrated and embedded in paraffin (Sakura Finetek). Whole tracheas and lungs processed for RT-PCR were dissected freshly and followed the protocol as described later. Indirect immunohistochemistry of cryosections and paraffin sections For cryosections, 10 µm thick sections were cut using a microtome (CM-1900 cryostat; Leica) and air dried for 1 h. For paraffin sections, paraffin blocks were cut with a microtome (Microm HM 325, Thermo Scientific, Schwerte, Germany), and 7 µm thick sections were mounted on silanized microscope glass slides. Cryo and paraffin sections were incubated for 1 h with blocking solution containing 10% normal horse serum, 0.5% Tween 20 (Sigma-Aldrich), and 0.1% bovine serum albumin in PBS (phosphate buffered saline). All antibodies were diluted in PBS + S (0.005 M phosphate buffer, with 0.15 M NaCl, pH 7.4). The primary antibodies (Supplementary Tab. 2 3 Antigen retrieval by microwave treatment for 10 min in citrate buffer (pH 6.0) was applied only before using the antibody against rabbit villin (Invitrogen, Carlsbad, California, USA, MA5-16,408). Samples were evaluated by epifluorescence (Axioplan 2, Zeiss, Oberkochen, Germany) or by confocal laser scanning microscopes (LSM 710, Zeiss; LSM 980-Airyscan 2; Zeiss) equipped with the appropriate filter sets and lasers, respectively. RT-PCR Samples from whole trachea ( n n n For cDNA synthesis (Eppendorf Master Cycler Personal 5332, Hamburg, Germany), 8 µl RNA was incubated with 1 µl 10 × DNase reaction buffer and 1 µl DNase (1 U/µl; Invitrogen) for 15 min at 25 °C to degrade contaminating DNA. To each sample, 1 µl of EDTA (ethylenediaminetetraacetic acid, 25 mM) was added. After 10 min incubation at 65 °C, samples were rapidly cooled for 2 min, and 9 µl reaction mixture of (1 µl oligo-dT (50 µM), 1 µl dNTPs (10 mM), 1 µl Superscript RNase (200 U/µl), 4 µl 5 × first-strand buffer, 2 µl dithiothreitol (0.1 M)) was added to each sample. All reagents were from Invitrogen, except dNTPs which were from Qiagen. cDNAs were stored until further use at − 20 °C. PCR was performed with cDNA samples using primers (specified below) for Villin 1 Calca β-actin 2 2 β-actin β-actin Vil1 Calca In silico analysis of published mRNA sequencing data Previously published (Plasschaert et al. 2018 GSE102580 2019 2015 Electron microscopy For transmission electron microscopy, tracheas were fixed for at least 24 h in 2% paraformaldehyde and 1.5% glutaraldehyde (Merck) in 0.1 M phosphate buffer (pH 7.4). After fixation, specimens were washed in HEPES (4-(2-hydroxyethyl)−1-piperazineethanesulfonic acid) buffer 0.15 M, pH 7.4, osmicated for 2 h in aqueous 1% osmium tetroxide (Sigma-Aldrich), washed in distilled water, contrasted in 1% uranyl acetate (Merck) overnight, washed in distilled water, and dehydrated in an ascending series of ethanol. Samples were then transferred into propylene oxide (Merck) and processed through mixtures of epon (Agar Scientific, Essex, UK) and propylene oxide (100% ethanol + propylene oxide 1:1, 15 min; pure propylene oxide 2 × 5 min; propylene oxide + epon 1:1, 60 min) before being infiltrated with epon overnight at room temperature. Specimens were then embedded in epon at 60 °C overnight, and ultrathin Sects. (80 nm) were cut using an ultramicrotome (Reichert Ultracut E, Leica). Ultrathin sections were analyzed using a transmission electron microscope (EM 902 N, Zeiss, Oberkochen, Germany) equipped with a slow scan 2 K CCD camera (TRS, Tröndle, Moorenweis, Germany). For analysis of microvilli length, width, and distance, images were captured with 12,000 magnification. For measurement of mitochondrial dimensions, images were captured with 20,000 magnification. Using ImageJ software, the two central perpendicular axes of mitochondria were measured. For measurements of apical cell width, images were captured with 7000 magnification. The evaluated ciliated and secretory cells were chosen randomly, but all showed their nucleus and contacted the basement membrane. Measurements were done using Fiji ImageJ software. For scanning electron microscopy, tracheas from C57BL/6Rj mice ( n 2 Statistical analysis Data sets with a large sample size (> 30 values) were tested for normality of distribution using the Kolmogorov–Smirnov and Shapiro–Wilk tests, and all were found not to be normally distributed. Accordingly, data are presented as individual data points with median ± interquartile range. Also, only non-parametric tests (Mann–Whitney U-test or Kruskal–Wallis test followed by Dunn’s multiple comparisons test) were used. Differences were considered statistically significant when p Results NEC are the only microvillous epithelial cell type in the trachea of Pou2f3 −/− To investigate the ultrastructure of the poorly defined villin-immunoreactive cell in the trachea, rare microvillous epithelial cell types in wild-type C57BL/6Rj mice ( n Pou2f3 −/− n Pou2f3 −/− Pou2f3 ± 2017 Pou2f3 −/− + 1 1 Pou2f3 −/− 1 Fig. 1 Cell types of the tracheal epithelium of wild-type C57BL/6Rj and Pou2f3 −/− a b c Pou2f3 −/− Microvilli of NEC are structurally distinct from TC microvilli In transmission electron microscopy, NEC and TC appeared different. The most distinctive feature of the NEC was the presence of numerous DCV with an average size of 110 nm in diameter, which were concentrated in the basal region (Fig. 1 1 Pou2f3 −/− n Pou2f3 −/− n 1 n 1 The apical cell width of both NEC and TC was small, being not significantly different from each other and reaching only about 20% of that of ciliated and secretory cells (Fig. 2 4 2 4 2 4 1 1 Fig. 2 Ultrastructural dimensions of tracheal epithelial cell types determined by TEM. a b c d e Pou2f3 −/ mice a e a d a e In scanning electron microscopy, ciliated cells were identified by their large luminal surface with cilia and long microvilli. Secretory cells were identified by their large surface with scattered short microvilli; sometimes, their apical surface showed a dome-like appearance (Fig. 3 3 3 5 Fig. 3 Identification of TC and NEC in a C57BL/6Rj mouse by SEM. a b c d c d c d U Villin-immunoreactive cells are positive for NEC-specific markers Based on the electron microscopic observation that all rare microvillous cells in tracheas of Pou2f3 −/− Pou2f3 −/− 4 2 3 3 Fig. 4 Villin- and PGP9.5-immunoreactivity in tracheal epithelium. a c a b c d e d n + + − + + − e f Pou2f3 −/− z In the trachea, rare, flask-shaped epithelial cells exhibited villin-immunoreactivity in their apical region (Fig. 4 2 + + + + − + + − − + + − 4 2 + 4 + + 4 We previously identified a high homeostatic expression level of CXCL13 (C-X-C motif chemokine ligand 13) in a subpopulation of tracheal NEC (Mahmoud et al. 2022 n + − − + 5 Fig. 5 Villin- and CXCL13-immunoreactivity in the tracheal epithelium. a z b + + − + + − n Immunolabeling of tracheal sections with antibodies against the TC marker GNAT3 and villin revealed that TC were only rarely villin + + 6 Fig. 6 Villin- and GNAT3-immunoreactivity in the tracheal epithelium. a c a b c d + + − + + − n A subpopulation of NEC expresses Vil1-Cre activity To further validate the expression of villin in a subpopulation of NEC, mice expressing Cre-recombinase driven by the villin promoter ( Vil1-Cre + loxP mT/mG Vil1-Cre + /mTmG + Vil1 The small intestine served as a positive control. Native eGFP fluorescence was detected in the whole intestinal epithelium in Vil1-Cre + /mTmG + 5 + 5 5 Vil1-Cre + /mTmG + 5 Vil1-Cre − /mTmG + 5 Vil1-Cre − /mTmG − Vil1-Cre + /mTmG − 5 In tracheal cryosections from Vil1-Cre + /mTmG + 7 + 7 7 Vil1 7 Vil1-Cre 7 Fig. 7 A subpopulation of NEC possesses Vil1-Cre a d f Vil1-Cre + /mTmG + a b c b c d e + + + − − + n f In lung cryosections from Vil1-Cre + /mTmG + 8 + 8 Vil1-Cre + /mTmG + 8 8 Vil1 + + 8 Fig. 8 A subpopulation of pulmonary solitary NEC and NEB cells possess Vil1-Cre a e Vil1-Cre + /mTmG + a b d b c d e f + + − + n n Tracheal NEC express Vil1-mRNA Whole tracheas ( n n n villin (Vil1) Calca 9 GSE102580 2018 + 9 Vil1 Vil1- 9 + − 9 Fig. 9 Vil1-mRNA is predominantly expressed by neuroendocrine cells in the tracheal epithelium. a b Actb il-1 Calca c f GSE102580 2018 c d il-1 e Vil-1 f The majority of TC is advillin-immunoreactive Tracheal cryosections from Chat n Chat + 10 Fig. 10 Advillin is expressed by tuft cells. a Chat b + + − + + − c + + d + + − + + − e + + f − + + − g h 9 g Avil- h Avil The Avil promoter is active in TC Tracheal paraffin sections from Av il-Cre + /mTmG + + Avil-Cre + 10 2018 Avil-Cre 10 In silico analysis reveals Avil expression in tracheal TC In silico analysis of the data set GSE102580 Avil vi1- 10 Discussion Previous studies revealed the existence of a rare villin-positive cell in the mouse trachea that shared neither molecular markers nor developmental dependence on the transcription factor Pou2f3 with tuft cells, for which villin has commonly been considered a structural marker protein. The present study identifies this cell as a NEC rather than representing a novel entity beyond the known rare epithelial cell types, i.e., tuft cells, ionocytes, and NEC. Notably, villin is not ubiquitously expressed by airway NEC, ranging from occurrence in about two thirds of tracheal NEC to only a few in the lung when judged by protein detectability with antibodies. This heterogeneity indicates the existence of distinct subpopulations, which is in line with recent transcriptional and functional studies (Mahmoud et al. 2022 2024 2024 2022 2024 1999 1999 2008 On the other hand, distinct features of pulmonary NEC, organized in NEB, are the synthesis of serotonin, the expression of osteopontin and cocaine- and amphetamine-regulated transcript, and mechanosensitivity, conveyed by the mechanosensory ion channel PIEZO2 (Piezo-type mechanosensitive ion channel component 2) (Schappe et al. 2024 2024 2024 1979 1974 1981 Vil 1994 In our study, solitary bronchopulmonary NEC shared with clustered NEC (NEBs) the features of only exceptional villin-immunoreactivity and a higher degree of history in Vil 2024 2024 While villin antibodies have been used historically to label TC (Hofer and Drenckhahn 1992 1996 2011 2015 2017 2008 2020 2020 Avil-Cre Avil cre :ChAT fl/fl 2022 2023 2020 , 1998 In summary, this study uncovers villin-expressing cells in the lower airways as a cell population hidden among NEC. Advillin, not villin, is a marker for airway TC. This shall be considered in interpreting findings based on the use of villin as a marker when investigating TC. Supplementary Information Below is the link to the electronic supplementary material. Supplementary Material 1 (PDF 989 KB) Abbreviations Avil Gene name of advillin BC Basal cell Calca Calcitonin-related polypeptide alpha CGRP Calcitonin gene-related peptide CFTR Cystic fibrosis transmembrane conductance regulator ChAT Choline acetyltransferase CXCL13 C-X-C motif chemokine ligand 13 DAPI 4′,6-Diamidino-2-phenylindole DCV Dense core vesicles eGFP Enhanced green fluorescent protein EDTA Ethylenediaminetetraacetic acid GFP Green fluorescent protein GNAT3 G protein subunit alpha transducin 3 HEPES 4-(2-Hydroxyethyl)-1-piperazineethanesulfonic acid Krt Keratin mTmG Membrane-targeted tandem Tomato/membrane-targeted green fluorescent protein NEB Neuroepithelial bodies NEC Neuroendocrine cell PCA Principle component analysis PGP Protein gene product Piezo2 Piezo-type mechanosensitive ion channel component 2 Pou2f3 POU class 2 homeobox 3 PBS Phosphate-buffered saline RT-PCR Reverse transcription polymerase chain reaction RLT RNA lysis buffer SEM Scanning electron microscope scRNA-seq Single-cell RNA sequencing Svil Supervillin SPF Specified pathogen free TC Tuft cells TEM Transmission electron microscope tdTomato Tandem-dimer tomato TRPM5 Transient receptor potential cation channel subfamily M member 5 UCHL1 Ubiquitin carboxy-terminal hydrolase L UMAP Uniform manifold approximation and projection Vil1 Gene villin 1 Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Wafaa Mahmoud and Alexander Perniss contributed equally to this work. Acknowledgements The expert technical assistance of Anika Seipp, Tamara Papadakis, Silke Wiegand, Martin Bodenbenner-Türich, Marion Zibuschka, and Petra Mermer is gratefully acknowledged. We thank Sarah Tonack (MPI Bad Nauheim) for assistance regarding sample preparation of Vil1-Cre+/mTmG+mice. Author contribution WM and AP contributed equally to this work, WK, WM, AP and SO conceived the study. WM, AP and BS performed experiments, analyzed and visualized the data. WM performed scanning and transmission electron microscopy. KP and AP analyzed scRNA seq data. MK helped with experiments. JO and TW provided critical mouse strains. UG helped with electron microscopy and provided infrastructure. SO and WK acquired funding. WK, WM and AP drafted the manuscript. Funding Open Access funding enabled and organized by Projekt DEAL. This work was supported by the German Research Foundation (DFG SFB-TR84, project A6 to WK and SCHU1259/10 to BS), the German Center for Lung Research (DZL ALI-1.1 to WK), and the Excellence Cluster Cardio-Pulmonary Institute (CPI, EXC 147 to WK and SO). Data availability No datasets were generated or analysed during the current study. Declarations Ethical approval Not applicable. Competing interests The authors declare no competing interests. References Bensch KG Gordon GB Miller LR Studies on the bronchial counterpart of the Kultschitzky (argentaffin) cell and innervation of bronchial glands J Ultrastruct Res 1965 12 668 686 10.1016/S0022-5320(65)80055-7 5831056 Bensch KG, Gordon GB, Miller LR (1965) Studies on the bronchial counterpart of the Kultschitzky (argentaffin) cell and innervation of bronchial glands. J Ultrastruct Res 12:668–686 5831056 10.1016/s0022-5320(65)80055-7 Bezencon C Furholz A Raymond F Mansourian R Metairon S Le Coutre J Damak S Murine intestinal cells expressing Trpm5 are mostly brush cells and express markers of neuronal and inflammatory cells J Comp Neurol 2008 509 514 525 10.1002/cne.21768 18537122 Bezencon C, Furholz A, Raymond F, Mansourian R, Metairon S, Le Coutre J, Damak S (2008) Murine intestinal cells expressing Trpm5 are mostly brush cells and express markers of neuronal and inflammatory cells. J Comp Neurol 509:514–525 18537122 10.1002/cne.21768 Esmaeilniakooshkghazi A George SP Biswas R Khurana S Mouse intestinal tuft cells express advillin but not villin Sci Rep 2020 10 8877 10.1038/s41598-020-65469-0 32483224 PMC7264147 Esmaeilniakooshkghazi A, George SP, Biswas R, Khurana S (2020) Mouse intestinal tuft cells express advillin but not villin. Sci Rep 10:8877 32483224 10.1038/s41598-020-65469-0 PMC7264147 Frohlich F The light cell of the bronchial mucosa and its relationship to the problem of chemoreceptors Frankf Z Pathol 1949 60 517 559 18151654 Frohlich F (1949) The light cell of the bronchial mucosa and its relationship to the problem of chemoreceptors. Frankf Z Pathol 60:517–559 18151654 Haller CJ A scanning and transmission electron microscopic study of the development of the surface structure of neuroepithelial bodies in the mouse lung Micron 1994 25 527 538 10.1016/0968-4328(94)90015-9 7881894 Haller CJ (1994) A scanning and transmission electron microscopic study of the development of the surface structure of neuroepithelial bodies in the mouse lung. Micron 25:527–538 7881894 10.1016/0968-4328(94)90015-9 Hofer D Drenckhahn D Identification of brush cells in the alimentary and respiratory system by antibodies to villin and fimbrin Histochemistry 1992 98 237 242 10.1007/BF00271037 1459863 Hofer D, Drenckhahn D (1992) Identification of brush cells in the alimentary and respiratory system by antibodies to villin and fimbrin. Histochemistry 98:237–242 1459863 10.1007/BF00271037 Hofer D Drenckhahn D Cytoskeletal markers allowing discrimination between brush cells and other epithelial cells of the gut including enteroendocrine cells Histochem Cell Biol 1996 105 405 412 10.1007/BF01463662 8781995 Hofer D, Drenckhahn D (1996) Cytoskeletal markers allowing discrimination between brush cells and other epithelial cells of the gut including enteroendocrine cells. Histochem Cell Biol 105:405–412 8781995 10.1007/BF01463662 Hofer D Drenckhahn D Localisation of actin, villin, fimbrin, ezrin and ankyrin in rat taste receptor cells Histochem Cell Biol 1999 112 79 86 10.1007/s004180050394 10461815 Hofer D, Drenckhahn D (1999) Localisation of actin, villin, fimbrin, ezrin and ankyrin in rat taste receptor cells. Histochem Cell Biol 112:79–86 10461815 10.1007/s004180050394 Hollenhorst MI Jurastow I Nandigama R Appenzeller S Li L Vogel J Wiederhold S Althaus M Empting M Altmuller J Hirsch AKH Flockerzi V Canning BJ Saliba AE Krasteva-Christ G Tracheal brush cells release acetylcholine in response to bitter tastants for paracrine and autocrine signaling FASEB J 2020 34 316 332 10.1096/fj.201901314RR 31914675 Hollenhorst MI, Jurastow I, Nandigama R, Appenzeller S, Li L, Vogel J, Wiederhold S, Althaus M, Empting M, Altmuller J, Hirsch AKH, Flockerzi V, Canning BJ, Saliba AE, Krasteva-Christ G (2020) Tracheal brush cells release acetylcholine in response to bitter tastants for paracrine and autocrine signaling. FASEB J 34:316–332 31914675 10.1096/fj.201901314RR Hollenhorst MI Nandigama R Evers SB Gamayun I Abdel Wadood N Salah A Pieper M Wyatt A Stukalov A Gebhardt A Nadolni W Burow W Herr C Beisswenger C Kusumakshi S Ectors F Kichko TI Hubner L Reeh P Munder A Wienhold SM Witzenrath M Bals R Flockerzi V Gudermann T Bischoff M Lipp P Zierler S Chubanov V Pichlmair A Konig P Boehm U Krasteva-Christ G Bitter taste signaling in tracheal epithelial brush cells elicits innate immune responses to bacterial infection J Clin Invest 2022 10.1172/JCI150951 35503420 PMC9246383 Hollenhorst MI, Nandigama R, Evers SB, Gamayun I, Abdel Wadood N, Salah A, Pieper M, Wyatt A, Stukalov A, Gebhardt A, Nadolni W, Burow W, Herr C, Beisswenger C, Kusumakshi S, Ectors F, Kichko TI, Hubner L, Reeh P, Munder A, Wienhold SM, Witzenrath M, Bals R, Flockerzi V, Gudermann T, Bischoff M, Lipp P, Zierler S, Chubanov V, Pichlmair A, Konig P, Boehm U, Krasteva-Christ G (2022) Bitter taste signaling in tracheal epithelial brush cells elicits innate immune responses to bacterial infection. J Clin Invest. 10.1172/JCI150951 35503420 10.1172/JCI150951 PMC9246383 Huang YH Klingbeil O He XY Wu XS Arun G Lu B Somerville TDD Milazzo JP Wilkinson JE Demerdash OE Spector DL Egeblad M Shi J Vakoc CR POU2F3 is a master regulator of a tuft cell-like variant of small cell lung cancer Genes Dev 2018 32 915 928 10.1101/gad.314815.118 29945888 PMC6075037 Huang YH, Klingbeil O, He XY, Wu XS, Arun G, Lu B, Somerville TDD, Milazzo JP, Wilkinson JE, Demerdash OE, Spector DL, Egeblad M, Shi J, Vakoc CR (2018) POU2F3 is a master regulator of a tuft cell-like variant of small cell lung cancer. Genes Dev 32:915–928 29945888 10.1101/gad.314815.118 PMC6075037 Hung KS Chapman AL Mestemacher MA Scanning electron microscopy of bronchiolar neuroepithelial bodies in neonatal mouse lungs Anat Rec 1979 193 913 926 10.1002/ar.1091930412 426314 Hung KS, Chapman AL, Mestemacher MA (1979) Scanning electron microscopy of bronchiolar neuroepithelial bodies in neonatal mouse lungs. Anat Rec 193:913–926 426314 10.1002/ar.1091930412 Hung KS Loosli CG Bronchiolar neuro-epithelial bodies in the neonatal mouse lungs Am J Anat 1974 140 191 199 10.1002/aja.1001400206 4826244 Hung KS, Loosli CG (1974) Bronchiolar neuro-epithelial bodies in the neonatal mouse lungs. Am J Anat 140:191–199 4826244 10.1002/aja.1001400206 Kaske S Krasteva G Konig P Kummer W Hofmann T Gudermann T Chubanov V TRPM5, a taste-signaling transient receptor potential ion-channel, is a ubiquitous signaling component in chemosensory cells BMC Neurosci 2007 8 49 10.1186/1471-2202-8-49 17610722 PMC1931605 Kaske S, Krasteva G, Konig P, Kummer W, Hofmann T, Gudermann T, Chubanov V (2007) TRPM5, a taste-signaling transient receptor potential ion-channel, is a ubiquitous signaling component in chemosensory cells. BMC Neurosci 8:49 17610722 10.1186/1471-2202-8-49 PMC1931605 Keshavarz M Faraj Tabrizi S Ruppert AL Pfeil U Schreiber Y Klein J Brandenburger I Lochnit G Bhushan S Perniss A Deckmann K Hartmann P Meiners M Mermer P Rafiq A Winterberg S Papadakis T Thomas D Angioni C Oberwinkler J Chubanov V Gudermann T Gartner U Offermanns S Schutz B Kummer W Cysteinyl leukotrienes and acetylcholine are biliary tuft cell cotransmitters Sci Immunol 2022 7 eabf6734 10.1126/sciimmunol.abf6734 35245090 Keshavarz M, Faraj Tabrizi S, Ruppert AL, Pfeil U, Schreiber Y, Klein J, Brandenburger I, Lochnit G, Bhushan S, Perniss A, Deckmann K, Hartmann P, Meiners M, Mermer P, Rafiq A, Winterberg S, Papadakis T, Thomas D, Angioni C, Oberwinkler J, Chubanov V, Gudermann T, Gartner U, Offermanns S, Schutz B, Kummer W (2022) Cysteinyl leukotrienes and acetylcholine are biliary tuft cell cotransmitters. Sci Immunol 7:eabf6734 35245090 10.1126/sciimmunol.abf6734 Kotas ME O'Leary CE Locksley RM TUFT cells: context- and tissue-specific programming for a conserved cell lineage Annu Rev Pathol 2023 18 311 335 10.1146/annurev-pathol-042320-112212 36351364 PMC10443898 Kotas ME, O’Leary CE, Locksley RM (2023) TUFT cells: context- and tissue-specific programming for a conserved cell lineage. Annu Rev Pathol 18:311–335 36351364 10.1146/annurev-pathol-042320-112212 PMC10443898 Krasteva G Canning BJ Hartmann P Veres TZ Papadakis T Muhlfeld C Schliecker K Tallini YN Braun A Hackstein H Baal N Weihe E Schutz B Kotlikoff M Ibanez-Tallon I Kummer W Cholinergic chemosensory cells in the trachea regulate breathing Proc Natl Acad Sci U S A 2011 108 9478 9483 10.1073/pnas.1019418108 21606356 PMC3111311 Krasteva G, Canning BJ, Hartmann P, Veres TZ, Papadakis T, Muhlfeld C, Schliecker K, Tallini YN, Braun A, Hackstein H, Baal N, Weihe E, Schutz B, Kotlikoff M, Ibanez-Tallon I, Kummer W (2011) Cholinergic chemosensory cells in the trachea regulate breathing. Proc Natl Acad Sci U S A 108:9478–9483 21606356 10.1073/pnas.1019418108 PMC3111311 Krasteva-Christ G Soultanova A Schutz B Papadakis T Weiss C Deckmann K Chubanov V Gudermann T Voigt A Meyerhof W Boehm U Weihe E Kummer W Identification of cholinergic chemosensory cells in mouse tracheal and laryngeal glandular ducts Int Immunopharmacol 2015 29 158 165 10.1016/j.intimp.2015.05.028 26033492 Krasteva-Christ G, Soultanova A, Schutz B, Papadakis T, Weiss C, Deckmann K, Chubanov V, Gudermann T, Voigt A, Meyerhof W, Boehm U, Weihe E, Kummer W (2015) Identification of cholinergic chemosensory cells in mouse tracheal and laryngeal glandular ducts. Int Immunopharmacol 29:158–165 26033492 10.1016/j.intimp.2015.05.028 Kummer W Lips KS Pfeil U The epithelial cholinergic system of the airways Histochem Cell Biol 2008 130 219 234 10.1007/s00418-008-0455-2 18566825 PMC2491704 Kummer W, Lips KS, Pfeil U (2008) The epithelial cholinergic system of the airways. Histochem Cell Biol 130:219–234 18566825 10.1007/s00418-008-0455-2 PMC2491704 Lauweryns JM Cokelaere M Theunynck P Neuro-epithelial bodies in the respiratory mucosa of various mammals. A light optical, histochemical and ultrastructural investigation Z Zellforsch Mikrosk Anat 1972 135 569 592 10.1007/BF00583438 4346123 Lauweryns JM, Cokelaere M, Theunynck P (1972) Neuro-epithelial bodies in the respiratory mucosa of various mammals. A light optical, histochemical and ultrastructural investigation. Z Zellforsch Mikrosk Anat 135:569–592 4346123 10.1007/BF00583438 Luts A Uddman R Absood A Hakanson R Sundler F Chemical coding of endocrine cells of the airways: presence of helodermin-like peptides Cell Tissue Res 1991 265 425 433 10.1007/BF00340865 1838496 Luts A, Uddman R, Absood A, Hakanson R, Sundler F (1991) Chemical coding of endocrine cells of the airways: presence of helodermin-like peptides. Cell Tissue Res 265:425–433 1838496 10.1007/BF00340865 Madison BB Dunbar L Qiao XT Braunstein K Braunstein E Gumucio DL Cis elements of the villin gene control expression in restricted domains of the vertical (crypt) and horizontal (duodenum, cecum) axes of the intestine J Biol Chem 2002 277 33275 33283 10.1074/jbc.M204935200 12065599 Madison BB, Dunbar L, Qiao XT, Braunstein K, Braunstein E, Gumucio DL (2002) Cis elements of the villin gene control expression in restricted domains of the vertical (crypt) and horizontal (duodenum, cecum) axes of the intestine. J Biol Chem 277:33275–33283 12065599 10.1074/jbc.M204935200 Mahmoud W Perniss A Poharkar K Soultanova A Pfeil U Hoek A Bhushan S Hain T Gartner U Kummer W CXCL13 is expressed in a subpopulation of neuroendocrine cells in the murine trachea and lung Cell Tissue Res 2022 390 35 49 10.1007/s00441-021-03552-2 34762185 PMC9525416 Mahmoud W, Perniss A, Poharkar K, Soultanova A, Pfeil U, Hoek A, Bhushan S, Hain T, Gartner U, Kummer W (2022) CXCL13 is expressed in a subpopulation of neuroendocrine cells in the murine trachea and lung. Cell Tissue Res 390:35–49 34762185 10.1007/s00441-021-03552-2 PMC9525416 Marks PW Arai M Bandura JL Kwiatkowski DJ Advillin (p92): a new member of the gelsolin/villin family of actin regulatory proteins J Cell Sci 1998 111 Pt 15 2129 2136 10.1242/jcs.111.15.2129 9664034 Marks PW, Arai M, Bandura JL, Kwiatkowski DJ (1998) Advillin (p92): a new member of the gelsolin/villin family of actin regulatory proteins. J Cell Sci 111(Pt 15):2129–2136 9664034 10.1242/jcs.111.15.2129 Matsumoto I Ohmoto M Narukawa M Yoshihara Y Abe K Skn-1a (Pou2f3) specifies taste receptor cell lineage Nat Neurosci 2011 14 685 687 10.1038/nn.2820 21572433 PMC3390744 Matsumoto I, Ohmoto M, Narukawa M, Yoshihara Y, Abe K (2011) Skn-1a (Pou2f3) specifies taste receptor cell lineage. Nat Neurosci 14:685–687 21572433 10.1038/nn.2820 PMC3390744 Montoro DT Haber AL Biton M Vinarsky V Lin B Birket SE Yuan F Chen S Leung HM Villoria J Rogel N Burgin G Tsankov AM Waghray A Slyper M Waldman J Nguyen L Dionne D Rozenblatt-Rosen O Tata PR Mou H Shivaraju M Bihler H Mense M Tearney GJ Rowe SM Engelhardt JF Regev A Rajagopal J A revised airway epithelial hierarchy includes CFTR-expressing ionocytes Nature 2018 560 319 324 10.1038/s41586-018-0393-7 30069044 PMC6295155 Montoro DT, Haber AL, Biton M, Vinarsky V, Lin B, Birket SE, Yuan F, Chen S, Leung HM, Villoria J, Rogel N, Burgin G, Tsankov AM, Waghray A, Slyper M, Waldman J, Nguyen L, Dionne D, Rozenblatt-Rosen O, Tata PR, Mou H, Shivaraju M, Bihler H, Mense M, Tearney GJ, Rowe SM, Engelhardt JF, Regev A, Rajagopal J (2018) A revised airway epithelial hierarchy includes CFTR-expressing ionocytes. Nature 560:319–324 30069044 10.1038/s41586-018-0393-7 PMC6295155 Muzumdar MD Tasic B Miyamichi K Li L Luo L A global double-fluorescent Cre reporter mouse Genesis 2007 45 9 593 605 10.1002/dvg.20335 17868096 Muzumdar MD, Tasic B, Miyamichi K, Li L, Luo L (2007) A global double-fluorescent Cre reporter mouse. Genesis 45(9):593–605 17868096 10.1002/dvg.20335 Park KS Liang MC Raiser DM Zamponi R Roach RR Curtis SJ Walton Z Schaffer BE Roake CM Zmoos AF Kriegel C Wong KK Sage J Kim CF Characterization of the cell of origin for small cell lung cancer Cell Cycle 2011 10 2806 2815 10.4161/cc.10.16.17012 21822053 PMC3219544 Park KS, Liang MC, Raiser DM, Zamponi R, Roach RR, Curtis SJ, Walton Z, Schaffer BE, Roake CM, Zmoos AF, Kriegel C, Wong KK, Sage J, Kim CF (2011) Characterization of the cell of origin for small cell lung cancer. Cell Cycle 10:2806–2815 21822053 10.4161/cc.10.16.17012 PMC3219544 Perniss A Boonen B Tonack S Thiel M Poharkar K Alnouri MW Keshavarz M Papadakis T Wiegand S Pfeil U Richter K Althaus M Oberwinkler J Schutz B Boehm U Offermanns S Leinders-Zufall T Zufall F Kummer W A succinate/SUCNR1-brush cell defense program in the tracheal epithelium Sci Adv 2023 9 eadg8842 10.1126/sciadv.adg8842 37531421 PMC10396310 Perniss A, Boonen B, Tonack S, Thiel M, Poharkar K, Alnouri MW, Keshavarz M, Papadakis T, Wiegand S, Pfeil U, Richter K, Althaus M, Oberwinkler J, Schutz B, Boehm U, Offermanns S, Leinders-Zufall T, Zufall F, Kummer W (2023) A succinate/SUCNR1-brush cell defense program in the tracheal epithelium. Sci Adv 9:eadg8842 37531421 10.1126/sciadv.adg8842 PMC10396310 Perniss A Liu S Boonen B Keshavarz M Ruppert AL Timm T Pfeil U Soultanova A Kusumakshi S Delventhal L Aydin O Pyrski M Deckmann K Hain T Schmidt N Ewers C Gunther A Lochnit G Chubanov V Gudermann T Oberwinkler J Klein J Mikoshiba K Leinders-Zufall T Offermanns S Schutz B Boehm U Zufall F Bufe B Kummer W Chemosensory cell-derived acetylcholine drives tracheal mucociliary clearance in response to virulence-associated formyl peptides Immunity 2020 52 683–699 e611 10.1016/j.immuni.2020.03.005 32294408 Perniss A, Liu S, Boonen B, Keshavarz M, Ruppert AL, Timm T, Pfeil U, Soultanova A, Kusumakshi S, Delventhal L, Aydin O, Pyrski M, Deckmann K, Hain T, Schmidt N, Ewers C, Gunther A, Lochnit G, Chubanov V, Gudermann T, Oberwinkler J, Klein J, Mikoshiba K, Leinders-Zufall T, Offermanns S, Schutz B, Boehm U, Zufall F, Bufe B, Kummer W (2020) Chemosensory cell-derived acetylcholine drives tracheal mucociliary clearance in response to virulence-associated formyl peptides. Immunity 52(683–699):e611 10.1016/j.immuni.2020.03.005 32294408 Plasschaert LW Zilionis R Choo-Wing R Savova V Knehr J Roma G Klein AM Jaffe AB A single-cell atlas of the airway epithelium reveals the CFTR-rich pulmonary ionocyte Nature 2018 560 377 381 10.1038/s41586-018-0394-6 30069046 PMC6108322 Plasschaert LW, Zilionis R, Choo-Wing R, Savova V, Knehr J, Roma G, Klein AM, Jaffe AB (2018) A single-cell atlas of the airway epithelium reveals the CFTR-rich pulmonary ionocyte. Nature 560:377–381 30069046 10.1038/s41586-018-0394-6 PMC6108322 Rhodin J Dalhamn T Electron microscopy of the tracheal ciliated mucosa in rat Z Zellforsch Mikrosk Anat 1956 44 345 412 10.1007/BF00345847 13353477 Rhodin J, Dalhamn T (1956) Electron microscopy of the tracheal ciliated mucosa in rat. Z Zellforsch Mikrosk Anat 44:345–412 13353477 10.1007/BF00345847 Ruppert AL Keshavarz M Winterberg S Oberwinkler J Kummer W Schutz B Advillin is a tuft cell marker in the mouse alimentary tract J Mol Histol 2020 51 421 435 10.1007/s10735-020-09893-6 32617896 PMC7368872 Ruppert AL, Keshavarz M, Winterberg S, Oberwinkler J, Kummer W, Schutz B (2020) Advillin is a tuft cell marker in the mouse alimentary tract. J Mol Histol 51:421–435 32617896 10.1007/s10735-020-09893-6 PMC7368872 Russell WM The development of the three Rs concept Altern Lab Anim 1995 23 298 304 10.1177/026119299502300306 11656565 Russell WM (1995) The development of the three Rs concept. Altern Lab Anim 23:298–304 11656565 Satija R Farrell JA Gennert D Schier AF Regev A Spatial reconstruction of single-cell gene expression data Nat Biotechnol 2015 33 495 502 10.1038/nbt.3192 25867923 PMC4430369 Satija R, Farrell JA, Gennert D, Schier AF, Regev A (2015) Spatial reconstruction of single-cell gene expression data. Nat Biotechnol 33:495–502 25867923 10.1038/nbt.3192 PMC4430369 Saunders CJ Christensen M Finger TE Tizzano M Cholinergic neurotransmission links solitary chemosensory cells to nasal inflammation Proc Natl Acad Sci U S A 2014 111 6075 6080 10.1073/pnas.1402251111 24711432 PMC4000837 Saunders CJ, Christensen M, Finger TE, Tizzano M (2014) Cholinergic neurotransmission links solitary chemosensory cells to nasal inflammation. Proc Natl Acad Sci U S A 111:6075–6080 24711432 10.1073/pnas.1402251111 PMC4000837 Schappe MS Brinn PA Joshi NR Greenberg RS Min S Alabi AA Zhang C Liberles SD A vagal reflex evoked by airway closure Nature 2024 627 830 838 10.1038/s41586-024-07144-2 38448588 PMC10972749 Schappe MS, Brinn PA, Joshi NR, Greenberg RS, Min S, Alabi AA, Zhang C, Liberles SD (2024) A vagal reflex evoked by airway closure. Nature 627:830–838 38448588 10.1038/s41586-024-07144-2 PMC10972749 Seeholzer LF Julius D Neuroendocrine cells initiate protective upper airway reflexes Science 2024 384 295 301 10.1126/science.adh5483 38669574 PMC11407116 Seeholzer LF, Julius D (2024) Neuroendocrine cells initiate protective upper airway reflexes. Science 384:295–301 38669574 10.1126/science.adh5483 PMC11407116 Sutherland KD Proost N Brouns I Adriaensen D Song JY Berns A Cell of origin of small cell lung cancer: inactivation of Trp53 and Rb1 in distinct cell types of adult mouse lung Cancer Cell 2011 19 754 764 10.1016/j.ccr.2011.04.019 21665149 Sutherland KD, Proost N, Brouns I, Adriaensen D, Song JY, Berns A (2011) Cell of origin of small cell lung cancer: inactivation of Trp53 and Rb1 in distinct cell types of adult mouse lung. Cancer Cell 19:754–764 21665149 10.1016/j.ccr.2011.04.019 Tizzano M Gulbransen BD Vandenbeuch A Clapp TR Herman JP Sibhatu HM Churchill ME Silver WL Kinnamon SC Finger TE Nasal chemosensory cells use bitter taste signaling to detect irritants and bacterial signals Proc Natl Acad Sci U S A 2010 107 3210 3215 10.1073/pnas.0911934107 20133764 PMC2840287 Tizzano M, Gulbransen BD, Vandenbeuch A, Clapp TR, Herman JP, Sibhatu HM, Churchill ME, Silver WL, Kinnamon SC, Finger TE (2010) Nasal chemosensory cells use bitter taste signaling to detect irritants and bacterial signals. Proc Natl Acad Sci U S A 107:3210–3215 20133764 10.1073/pnas.0911934107 PMC2840287 Tsutsumi Y Osamura RY Watanabe K Yanaihara N Simultaneous immunohistochemical localization of gastrin releasing peptide (GRP) and calcitonin (CT) in human bronchial endocrine-type cells Virchows Arch A Pathol Anat Histopathol 1983 400 163 171 10.1007/BF00585498 6412431 Tsutsumi Y, Osamura RY, Watanabe K, Yanaihara N (1983) Simultaneous immunohistochemical localization of gastrin releasing peptide (GRP) and calcitonin (CT) in human bronchial endocrine-type cells. Virchows Arch A Pathol Anat Histopathol 400:163–171 6412431 10.1007/BF00585498 Wasano K Yamamoto T A scanning and transmission electron-microscopic study on neuro-epithelial bodies in the neonatal mouse lung Cell Tissue Res 1981 216 481 490 10.1007/BF00238645 6113053 Wasano K, Yamamoto T (1981) A scanning and transmission electron-microscopic study on neuro-epithelial bodies in the neonatal mouse lung. Cell Tissue Res 216:481–490 6113053 10.1007/BF00238645 Wolock SL Lopez R Klein AM Scrublet: computational identification of cell doublets in single-cell transcriptomic data Cell Syst 2019 8 281–291 e289 10.1016/j.cels.2018.11.005 PMC6625319 30954476 Wolock SL, Lopez R, Klein AM (2019) Scrublet: computational identification of cell doublets in single-cell transcriptomic data. Cell Syst 8(281–291):e289 10.1016/j.cels.2018.11.005 PMC6625319 30954476 Wu XS He XY Ipsaro JJ Huang YH Preall JB Ng D Shue YT Sage J Egeblad M Joshua-Tor L Vakoc CR OCA-T1 and OCA-T2 are coactivators of POU2F3 in the tuft cell lineage Nature 2022 607 169 175 10.1038/s41586-022-04842-7 35576971 PMC9419707 Wu XS, He XY, Ipsaro JJ, Huang YH, Preall JB, Ng D, Shue YT, Sage J, Egeblad M, Joshua-Tor L, Vakoc CR (2022) OCA-T1 and OCA-T2 are coactivators of POU2F3 in the tuft cell lineage. Nature 607:169–175 35576971 10.1038/s41586-022-04842-7 PMC9419707 Yamada Y Belharazem-Vitacolonnna D Bohnenberger H Weiss C Matsui N Kriegsmann M Kriegsmann K Sinn P Simon-Keller K Hamilton G Graeter T Preissler G Ott G Scholch S Nakajima N Yoshizawa A Haga H Date H Thomas RK Petrini I Giaccone G Strobel P Marx A Pulmonary cancers across different histotypes share hybrid tuft cell/ionocyte-like molecular features and potentially druggable vulnerabilities Cell Death Dis 2022 13 979 10.1038/s41419-022-05428-x 36402755 PMC9675833 Yamada Y, Belharazem-Vitacolonnna D, Bohnenberger H, Weiss C, Matsui N, Kriegsmann M, Kriegsmann K, Sinn P, Simon-Keller K, Hamilton G, Graeter T, Preissler G, Ott G, Scholch S, Nakajima N, Yoshizawa A, Haga H, Date H, Thomas RK, Petrini I, Giaccone G, Strobel P, Marx A (2022) Pulmonary cancers across different histotypes share hybrid tuft cell/ionocyte-like molecular features and potentially druggable vulnerabilities. Cell Death Dis 13:979 36402755 10.1038/s41419-022-05428-x PMC9675833 Yamashita J Ohmoto M Yamaguchi T Matsumoto I Hirota J Skn-1a/Pou2f3 functions as a master regulator to generate Trpm5-expressing chemosensory cells in mice PLoS One 2017 12 e0189340 10.1371/journal.pone.0189340 29216297 PMC5720759 Yamashita J, Ohmoto M, Yamaguchi T, Matsumoto I, Hirota J (2017) Skn-1a/Pou2f3 functions as a master regulator to generate Trpm5-expressing chemosensory cells in mice. PLoS One 12:e0189340 29216297 10.1371/journal.pone.0189340 PMC5720759 Yuan F Gasser GN Lemire E Montoro DT Jagadeesh K Zhang Y Duan Y Ievlev V Wells KL Rotti PG Shahin W Winter M Rosen BH Evans I Cai Q Yu M Walsh SA Acevedo MR Pandya DN Akurathi V Dick DW Wadas TJ Joo NS Wine JJ Birket S Fernandez CM Leung HM Tearney GJ Verkman AS Haggie PM Scott K Bartels D Meyerholz DK Rowe SM Liu X Yan Z Haber AL Sun X Engelhardt JF Transgenic ferret models define pulmonary ionocyte diversity and function Nature 2023 621 857 867 10.1038/s41586-023-06549-9 37730992 PMC10533402 Yuan F, Gasser GN, Lemire E, Montoro DT, Jagadeesh K, Zhang Y, Duan Y, Ievlev V, Wells KL, Rotti PG, Shahin W, Winter M, Rosen BH, Evans I, Cai Q, Yu M, Walsh SA, Acevedo MR, Pandya DN, Akurathi V, Dick DW, Wadas TJ, Joo NS, Wine JJ, Birket S, Fernandez CM, Leung HM, Tearney GJ, Verkman AS, Haggie PM, Scott K, Bartels D, Meyerholz DK, Rowe SM, Liu X, Yan Z, Haber AL, Sun X, Engelhardt JF (2023) Transgenic ferret models define pulmonary ionocyte diversity and function. Nature 621:857–867 37730992 10.1038/s41586-023-06549-9 PMC10533402 Zhu Z Sun X Sentinels of the airways Science 2024 384 6693 269 270 10.1126/science.ado9995 38669581 Zhu Z, Sun X (2024) Sentinels of the airways. Science 384(6693):269–270 38669581 10.1126/science.ado9995 Zurborg S Piszczek A Martinez C Hublitz P Al Banchaabouchi M Moreira P Perlas E Heppenstall PA Generation and characterization of an Advillin-Cre driver mouse line Mol Pain 2011 7 66 10.1186/1744-8069-7-66 21906401 PMC3185264 Zurborg S, Piszczek A, Martinez C, Hublitz P, Al Banchaabouchi M, Moreira P, Perlas E, Heppenstall PA (2011) Generation and characterization of an Advillin-Cre driver mouse line. Mol Pain 7:66 21906401 10.1186/1744-8069-7-66 PMC3185264 ",
  "metadata": {
    "Title of this paper": "Generation and characterization of an Advillin-Cre driver mouse line",
    "Journal it was published in:": "Cell and Tissue Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484096/"
  }
}