{
  "title": "Paper_579",
  "abstract": "pmc BMC Cancer BMC Cancer 16 bmccanc BMC Cancer 1471-2407 BMC PMC12482807 PMC12482807.1 12482807 12482807 41029252 10.1186/s12885-025-14873-8 14873 1 Research Torso FDG-PET parameters as prognostic biomarkers for advanced non-small cell lung cancer patients undergoing first-line immunotherapy and chemotherapy Obata Takafumi 1 Norikane Takashi 1 Manabe Yuri 1 Murao Mitsumasa 1 Morita Riku 1 Mitamura Katsuya 1 Murota Makiko 1 Yamamoto Yuka yamamoto.yuka@kagawa-u.ac.jp 1 Omori Keigo 2 Kanaji Nobuhiro 3 Nishiyama Yoshihiro 1 1 https://ror.org/04j7mzp05 grid.258331.e 0000 0000 8662 309X Department of Radiology, Faculty of Medicine, Kagawa University, 2 https://ror.org/033sspj46 grid.471800.a Department of Medical Technology, Division of Clinical Radiology, Kagawa University Hospital, 3 https://ror.org/04j7mzp05 grid.258331.e 0000 0000 8662 309X Department of Internal Medicine, Division of Hematology, Rheumatology and Respiratory Medicine, Faculty of Medicine, Kagawa University, 30 9 2025 2025 25 478185 1454 22 5 2025 18 8 2025 30 09 2025 01 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background The objective of this study was to investigate the prognostic significance of parameters derived from ¹⁸F-fluorodeoxyglucose (FDG) positron emission tomography (PET) imaging in patients with advanced non-small cell lung cancer (NSCLC) receiving first-line treatment with immune checkpoint inhibitors (ICIs) and platinum-based chemotherapy, focusing on both primary tumors and metastatic sites located in the torso. Methods This retrospective study analyzed 70 patients diagnosed with stage III or IV NSCLC who underwent FDG PET/computed tomography (CT) prior to initiating first-line treatment with ICI–based combination therapy. Key metabolic metrics—including maximum standardized uptake value (SUVmax), metabolic tumor volume (MTV), and total lesion glycolysis (TLG)—were quantified across all detectable lesions within the torso. Associations between these PET-derived parameters and clinical outcomes, including progression-free survival (PFS) and overall survival (OS), were examined using Kaplan–Meier survival estimates and Cox proportional hazards regression. Results MTV-torso and TLG-torso were significantly higher in patients with poor Eastern Cooperative Oncology Group performance status (PS ≥ 2). In univariate analyses, PS, MTV-torso, and TLG-torso were significantly associated with both PFS and OS. In multivariate analyses, PS and MTV-torso remained independent predictors of both outcomes. Patients with lower MTV-torso (< 225.81) had significantly higher mean PFS (582.3 vs. 154.5 days, P P Conclusions Among the FDG PET-based volumetric indices, MTV-torso emerged as an independent predictor of both PFS and OS in patients with advanced NSCLC undergoing first-line treatment with ICI and platinum-based chemotherapy. These findings support the use of torso-based metabolic tumor burden assessment as a valuable tool for prognostic stratification in this patient population. Keywords 18 PET Immune checkpoint inhibitor Non-small cell lung cancer pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Non-small cell lung cancer (NSCLC) continues to be a major contributor to cancer-related deaths globally. Although systemic treatments such as chemotherapy and targeted therapies have advanced considerably, the outlook for individuals with advanced-stage NSCLC remains unfavorable. The introduction of immune checkpoint inhibitors (ICIs), targeting programmed cell death protein 1 (PD-1) or its ligand programmed death-ligand 1 (PD-L1), has notably changed the therapeutic landscape of NSCLC, especially when used in combination with platinum-based chemotherapy as an initial treatment [ 1 3 1 2 Positron emission tomography (PET) using ¹⁸F-fluorodeoxyglucose (FDG) has emerged as a valuable imaging modality for prognostic assessment, offering metabolic biomarkers that reflect both tumor burden and biological aggressiveness [ 4 5 8 9 10 Methods Aim, design, and setting This study investigated whether FDG PET-derived metrics hold prognostic value in individuals with advanced NSCLC receiving initial treatment with ICIs combined with platinum-based chemotherapy. Unlike previous studies that primarily focused on primary tumors, we conducted a volumetric analysis of both the primary lesion and metastatic sites in the torso. By examining the correlation between torso-based PET parameters and survival outcomes, including PFS and OS, we attempted to determine whether these imaging biomarkers could reliably predict prognosis in this patient population. We conducted a retrospective review of medical records from consecutive patients with histologically confirmed stage III or IV NSCLC who underwent FDG PET/computed tomography (CT) before initiating first-line therapy with ICIs combined with platinum-based chemotherapy between November 2018 and July 2024. Disease staging was performed in accordance with the 8th edition of the TNM classification [ 11 FDG PET/CT imaging and analysis The imaging protocol was based largely on a previously reported methodology [ 12 Patients fasted for a minimum of 5 h prior to intravenous FDG administration (5.5 MBq/kg), ensuring normoglycemia before injection. After a 90-minute uptake period, emission scans were obtained from the mid-skull to the upper thigh, with an acquisition time of 2 min per bed position. To support attenuation correction and image fusion, low-dose, non-contrast CT scans covering the same anatomical range were performed. PET images were reconstructed using an ordered subset expectation maximization algorithm—two iterations and 21 subsets for the Biograph mCT 64-4R, and three iterations with five subsets for the Biograph Vision 600—incorporating both point-spread function and time-of-flight corrections. A Gaussian post-reconstruction filter was applied exclusively for images acquired with the Biograph mCT 64-4R. The torso was defined as the anatomical region extending from the mid-skull to the upper thigh, corresponding to the PET/CT acquisition range. Lesions outside the scanned field, such as brain and distal extremity metastases, were not included due to imaging limitations. The MTV and TLG values were calculated using the Metavol software, which utilizes liver uptake as a reference [ 13 14 Measurements of SUVmax, MTV, and TLG were performed on all detected lesions. SUV was calculated using the formula: SUV = c dc d i w c dc d i w Statistical analysis Data are expressed as mean ± SD. The Mann–Whitney U test was applied to examine the relationships between PET-derived parameters and clinical characteristics. Continuous variables were converted into binary categories using optimal cutoff points identified by receiver operating characteristic curve analysis. PFS was defined as the interval from treatment initiation to either disease progression or death from any cause, while OS was measured from the time of diagnosis to death from any cause. Survival analyses were conducted using the Kaplan–Meier method, and differences between groups were evaluated with the log-rank test. Variables found to be significant in univariate analyses were subsequently included in multivariate Cox proportional hazards regression models to identify independent prognostic factors for PFS and OS. Hazard ratio and 95% confidence interval (CI) were calculated for each variable. A two-sided P Results A total of 70 patients who met the eligibility criteria described in the Methods section were included in the final analysis. This retrospective study comprised 57 males and 13 females, with a median age of 70 years (range: 41–83 years). Among them, 4 patients were diagnosed with stage III NSCLC—comprising 1 case of adenocarcinoma and 3 of squamous cell carcinoma—while the remaining 66 patients had stage IV disease, which included 38 adenocarcinomas, 17 squamous cell carcinomas, and 11 cases categorized as not otherwise specified. At baseline, 21 patients (30.0%) had brain metastases confirmed using magnetic resonance imaging or contrast-enhanced CT. No new cases of brain metastases were observed during follow-up. Given the limited sensitivity of FDG PET/CT for detecting brain lesions, these were excluded from the PET-based volumetric analysis. All patients received at least one course of first-line treatment, specifically anti-PD-1 therapy with either pemetrexed-carboplatin ( n n n n n n n Table 1 Table 1 Comparison of clinical variables and PET parameters of torso lesions SUVmax-torso P MTV-torso P TLG-torso P Age (years) < 70 (n=35) 19.9±8.1 0.333 514.3±703.2 0.122 2619.5±3137.0 0.144 ≥ 70 (n=35) 18.7±9.7 285.3±409.7 1518.5±1996.1 Sex Male (n=57) 19.7±9.3 0.592 430.9±632.4 0.934 2225.5±2894.3 0.862 Female (n=13) 17.4±6.6 263.6±249.3 1382.7±1104.5 Histological type Ad or NOS (n=50) 17.8±9.2 0.006 404.8±642.2 0.298 1984.0±2832.9 0.059 Sq (n=20) 23.0±7.0 387.2±411.8 2281.6±2256.7 TNM stage III (n=4) 25.4±3.0 0.065 215.4±82.5 0.855 1390.4±331.6 0.47 IV (n=66) 18.9±9.0 411.0±598.4 2110.2±2742.8 Smoking history Positive (n=62) 19.6±9.1 0.567 419.3±610.3 0.726 2164.9±2799.0 0.671 Negative (n=8) 16.9±7.2 249.0±270.5 1326.0±1093.1 Eastern Cooperative Oncology Group Performance status 0 or 1 (n=52) 19.1±8.7 0.936 229.4±300.7 <0.001 1344.6±1802.2 <0.001 2 to 3 (n=18) 19.8±9.8 892.0±873.0 4161.9±3593.1 PD-L1 tumor proportion score <50 (n=43) 18.7±9.1 0.111 399.7±664.0 0.298 2029.2±2826.5 0.438 ≥50 (n=22) 21.3±7.7 442.2±467.1 2314.9±2609.8 SUVmax MTV TLG Ad NOS The median follow-up duration from the date of initial diagnosis was 368 days (range: 22–2,178 days). During follow-up, 53 patients (75.7%) experienced disease progression. The median PFS was 162 days, and the median OS was 527 days. Associations between clinical and PET parameters and PFS The area under the curve (AUC) and corresponding cutoff values for SUVmax-torso, MTV-torso, and TLG-torso in predicting PFS were 0.57 (cutoff: 17.22), 0.71 (cutoff: 225.81), and 0.70 (cutoff: 1286.80), respectively. Table 2 P P 1 Table 2 Univariate and multivariate analyses for progression-free survival Univariate analysis Multivariate analysis Variables Hazard ratio (95% CI) P Hazard ratio (95% CI) P Age (years) < 70 0.908 (0.530–1.558) 0.727 ≥ 70 Sex Male 0.84 (0.393–1.793) 0.651 Female Histological type Ad or NOS 1.221 (0.669–2.231) 0.516 Sq TNM stage III 2.989 (0.410–21.765) 0.28 IV Smoking history Positive 0.805 (0.319–2.032) 0.646 Negative Eastern Cooperative Oncology Group Performance status 0 or 1 2.993 (1.628–5.501) <0.001 2.045 (1.029–4.064) 0.041 2 to 3 PD-L1 tumor proportion score <50 0.696 (0.376–1.290) 0.25 ≥50 SUVmax-torso ≤17.22 1.615 (0.924–2.823) 0.092 >17.22 MTV-torso 2.684 (1.522–4.732) <0.001 2.048 (1.078–3.892) 0.029 ≤ 225.81 >225.81 TLG-torso 2.346 (1.342–4.102) 0.003 1.745 (0.923–3.296) 0.086 ≤1286.80 >1286.80 CI ad sq NOS SUVmax MTV TLG Fig. 1 Examples of FDG-PET tumor segmentations for MTV measurement. Tumor regions exceeding the threshold are depicted in pink in the maximum intensity projection image. ( a b Kaplan–Meier analysis further demonstrated significant differences in PFS based on MTV-torso ( P P P 2 Fig. 2 Kaplan–Meier analysis of PFS. Kaplan–Meier curves according to ( a b c P P P Associations between clinical and PET parameters and OS For OS, the AUC and cutoff values for SUVmax-torso, MTV-torso, and TLG-torso were 0.51 (cutoff: 17.22), 0.67 (cutoff: 295.40), and 0.65 (cutoff: 1286.80), respectively. Table 3 P P Table 3 Univariate and multivariate analyses for overall survival Univariate analysis Multivariate analysis Variables Hazard ratio (95% CI) P Hazard ratio (95% CI) P Age (years) < 70 0.731 (0.394–1.356) 0.32 ≥ 70 Sex Male 1.238 (0.544–2.820) 0.611 Female Histological type Ad or NOS 1.883 (0.993–3.568) 0.052 Sq TNM stage III 2.821 (0.381–20.879) 0.31 IV Smoking history Positive 1.5 (0.581–3.874) 0.403 Negative Eastern Cooperative Oncology Group Performance status 0 or 1 6.495 (3.120–13.522) <0.001 4.706 (2.096–10.563) <0.001 2 to 3 PD-L1 tumor proportion score <50 0.814 (0.410–1.615) 0.555 ≥50 SUVmax-torso ≤17.22 1.545 (0.825–2.895) 0.175 >17.22 MTV-torso 3.932 (2.022–7.645) <0.001 2.339 (1.075–5.088) 0.032 ≤ 295.40 >295.40 TLG-torso 3.124 (1.640–5.949) <0.001 1.947 (0.940–4.034) 0.073 ≤1286.80 >1286.80 CI Ad Sq NOS SUVmax MTV TLG Kaplan–Meier survival curves revealed significant OS differences between patients grouped by MTV-torso ( P P P 3 Fig. 3 Kaplan–Meier analysis of OS. Kaplan–Meier curves according to ( a b c P P Discussion This study highlighted the prognostic utility of volumetric FDG PET metrics—especially MTV-torso and TLG-torso—for predicting both PFS and OS in patients with advanced NSCLC receiving first-line treatment with ICIs and platinum-based chemotherapy. Our findings support the growing evidence that PET-derived metrics reflecting total tumor burden are superior to SUVmax alone in predicting patient outcomes. Previous research has primarily emphasized the prognostic value of SUVmax in the primary tumor of patients with NSCLC. For example, a systematic review and meta-analysis confirmed the findings of a previous review, indicating that the SUVmax in the primary tumor is a potentially important factor for predicting outcomes in NSCLC [ 15 6 More recently, attention has shifted toward whole-body assessments rather than focusing solely on primary lesions. Liao et al. investigated patients with NSCLC who did not undergo surgical intervention and reported that whole-body MTV and TLG were more effective prognostic indicators than SUVmax [ 10 9 Despite these emerging insights, the predictive value of whole-body MTV and TLG remains debatable. In this study, we investigated FDG PET-derived metabolic indicators in a unique cohort of patients with advanced NSCLC who received initial treatment with a combination of ICIs and platinum-based chemotherapy. To the best of our knowledge, this is the first report to specifically assess the prognostic impact of torso-based MTV and TLG measurements in this particular therapeutic setting. Our analysis revealed that both MTV-torso and TLG-torso were associated with PFS and OS, outperforming SUVmax as prognostic markers. To contextualize the observed survival outcomes, we compared our findings with those reported in the KEYNOTE‑407 trial, which evaluated the efficacy of pembrolizumab plus chemotherapy in patients with advanced squamous NSCLC [ 16 However, several challenges remain in standardizing MTV and TLG measurements across institutions. Variability in PET acquisition protocols, image reconstruction algorithms, and lesion segmentation techniques can lead to inconsistent results, limiting their broad clinical applicability. Therefore, international efforts toward methodological harmonization are needed to establish PET-derived volumetric parameters as robust, reproducible biomarkers. Future studies should investigate the interactions between volumetric parameters and known molecular or immunological biomarkers, such as PD-L1 expression and oncogenic driver mutations, to better clarify their combined prognostic and predictive value. This study has some limitations. Primarily, its retrospective design and the modest number of patients from a single center may restrict the broader applicability of the results. Second, the follow-up period, although sufficient for an initial survival analysis, may not fully capture long-term outcomes. Third, as FDG PET has limited sensitivity for detecting brain metastases due to high physiological glucose uptake in normal brain tissue, the brain was excluded from volumetric measurements in this study. Fourth, although we manually excluded physiological FDG uptake, this step introduces a degree of subjectivity. Finally, while volumetric PET parameters such as MTV and TLG have demonstrated prognostic significance, their underlying biological rationale remains speculative. The lack of detailed mechanistic understanding limits broader acceptance of these biomarkers and highlights the need for further translational research to elucidate their immunological and pathological underpinnings. Notwithstanding these limitations, our results indicate that whole-body volumetric PET metrics, particularly MTV-torso, can serve as valuable prognostic tools for patients with advanced NSCLC undergoing ICI-based combination therapy. Future studies with larger cohorts, standardized methodologies, and stratification by treatment modality and disease stage will be crucial to better understand the prognostic potential of whole-body PET-derived parameters for advanced NSCLC. Conclusions Volumetric FDG PET parameters, particularly MTV-torso, were found to be independent prognostic indicators of both PFS and OS in patients with advanced NSCLC treated with first-line ICIs combined with platinum-based chemotherapy. These findings suggest that torso-based metabolic tumor burden assessment may serve as an effective method for prognostic stratification in this patient population. Abbreviations 18 fluorodeoxyglucose PET Positron emission tomography NSCLC Non-small cell lung cancer ICIs Immune checkpoint inhibitors CT Computed tomography SUVmax Maximum standardized uptake value MTV Metabolic tumor volume TLG Total lesion glycolysis PFS Progression-free survival OS Overall survival PS Performance status PD-1 Programmed cell death-1 PD-L1 Programmed death-ligand 1 CTLA-4 Cytotoxic T-lymphocyte-associated protein 4 SD Standard deviation CI Confidence interval AUC Area under the curve Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Authors’ contributions The study was designed by TO and YY. Material preparation, data collection, and analysis were performed by TO, TN, YM, MM, RM, KM, MM, YY, KO, and NK. The first draft of the manuscript was prepared by TO and reviewed by YY, NK, and YN. All authors read and approved the final manuscript. Funding Not applicable. Data availability The datasets used and/or analyzed during the current study are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate The study was approved by the institutional ethical review board of the Faculty of Medicine, Kagawa University (2024 − 139) and performed in accordance with the principles of the Declaration of Helsinki and national regulations. The need for informed consent was waived due to the retrospective nature of this study. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Reck M Rodríguez-Abreu D Robinson AG Hui R Csőszi T Fülöp A Pembrolizumab versus chemotherapy for PD-L1-positive non-small-cell lung cancer N Engl J Med 2016 375 1823 33 10.1056/NEJMoa1606774 27718847 Reck M, Rodríguez-Abreu D, Robinson AG, Hui R, Csőszi T, Fülöp A, et al. Pembrolizumab versus chemotherapy for PD-L1-positive non-small-cell lung cancer. N Engl J Med. 2016;375:1823–33. 27718847 10.1056/NEJMoa1606774 2. Gandhi L Rodríguez-Abreu D Gadgeel S Esteban E Felip E De Angelis F Pembrolizumab plus chemotherapy in metastatic non-small-cell lung cancer N Engl J Med 2018 378 2078 92 10.1056/NEJMoa1801005 29658856 Gandhi L, Rodríguez-Abreu D, Gadgeel S, Esteban E, Felip E, De Angelis F, et al. Pembrolizumab plus chemotherapy in metastatic non-small-cell lung cancer. N Engl J Med. 2018;378:2078–92. 29658856 10.1056/NEJMoa1801005 3. Mok TSK Wu YL Kudaba I Kowalski DM Cho BC Turna HZ Pembrolizumab versus chemotherapy for previously untreated, PD-L1-expressing, locally advanced or metastatic non-small-cell lung cancer (KEYNOTE-042): A randomised, open-label, controlled, phase 3 trial Lancet 2019 393 1819 30 10.1016/S0140-6736(18)32409-7 30955977 Mok TSK, Wu YL, Kudaba I, Kowalski DM, Cho BC, Turna HZ, et al. Pembrolizumab versus chemotherapy for previously untreated, PD-L1-expressing, locally advanced or metastatic non-small-cell lung cancer (KEYNOTE-042): A randomised, open-label, controlled, phase 3 trial. Lancet. 2019;393:1819–30. 30955977 10.1016/S0140-6736(18)32409-7 4. Sauter AW Schwenzer N Divine MR Pichler BJ Pfannenberg C Image-derived biomarkers and multimodal imaging strategies for lung cancer management Eur J Nucl Med Mol Imaging 2015 42 634 43 10.1007/s00259-014-2974-5 25573632 Sauter AW, Schwenzer N, Divine MR, Pichler BJ, Pfannenberg C. Image-derived biomarkers and multimodal imaging strategies for lung cancer management. Eur J Nucl Med Mol Imaging. 2015;42:634–43. 25573632 10.1007/s00259-014-2974-5 5. Winther-Larsen A Fledelius J Sorensen BS Meldgaard P Metabolic tumor burden as marker of outcome in advanced EGFR wild-type NSCLC patients treated with erlotinib Lung Cancer 2016 94 81 7 10.1016/j.lungcan.2016.01.024 26973211 Winther-Larsen A, Fledelius J, Sorensen BS, Meldgaard P. Metabolic tumor burden as marker of outcome in advanced EGFR wild-type NSCLC patients treated with erlotinib. Lung Cancer. 2016;94:81–7. 26973211 10.1016/j.lungcan.2016.01.024 6. Im HJ Pak K Cheon GJ Kang KW Kim SJ Kim IJ Prognostic value of volumetric parameters of (18)F-FDG PET in non-small-cell lung cancer: a meta-analysis Eur J Nucl Med Mol Imaging 2015 42 2 241 51 10.1007/s00259-014-2903-7 25193652 Im HJ, Pak K, Cheon GJ, Kang KW, Kim SJ, Kim IJ, et al. Prognostic value of volumetric parameters of (18)F-FDG PET in non-small-cell lung cancer: a meta-analysis. Eur J Nucl Med Mol Imaging. 2015;42(2):241–51. 25193652 10.1007/s00259-014-2903-7 7. Wen W Piao Y Xu D Li X Prognostic value of MTV and TLG of 18 Contrast Media Mol Imaging 2021 2021 2021:7528971 10.1155/2021/7528971 34887713 PMC8629622 Wen W, Piao Y, Xu D, Li X. Prognostic value of MTV and TLG of 18 34887713 10.1155/2021/7528971 PMC8629622 8. Ling T Zhang L Peng R Yue C Huang L Prognostic value of 18 Front Immunol 2022 13 1014063 10.3389/fimmu.2022.1014063 36466905 PMC9713836 Ling T, Zhang L, Peng R, Yue C, Huang L. Prognostic value of 18 36466905 10.3389/fimmu.2022.1014063 PMC9713836 9. Yoo SW Kim J Chong A Kwon SY Min JJ Song HC Metabolic tumor volume measured by F-18 FDG PET/CT can further stratify the prognosis of patients with stage IV non-small cell lung cancer Nucl Med Mol Imaging 2012 46 286 93 10.1007/s13139-012-0165-5 24900076 PMC4043070 Yoo SW, Kim J, Chong A, Kwon SY, Min JJ, Song HC, et al. Metabolic tumor volume measured by F-18 FDG PET/CT can further stratify the prognosis of patients with stage IV non-small cell lung cancer. Nucl Med Mol Imaging. 2012;46:286–93. 24900076 10.1007/s13139-012-0165-5 PMC4043070 10. Liao S Penney BC Wroblewski K Zhang H Simon CA Kampalath R Prognostic value of metabolic tumor burden on 18 Eur J Nucl Med Mol Imaging 2012 39 27 38 10.1007/s00259-011-1934-6 21946983 Liao S, Penney BC, Wroblewski K, Zhang H, Simon CA, Kampalath R, et al. Prognostic value of metabolic tumor burden on 18 21946983 10.1007/s00259-011-1934-6 11. Goldstraw P Chansky K Crowley J Rami-Porta R Asamura H Eberhardt WE The IASLC lung cancer staging project: proposals for revision of the TNM stage groupings in the forthcoming (Eighth) edition of the TNM classification for lung cancer J Thorac Oncol 2016 11 39 51 10.1016/j.jtho.2015.09.009 26762738 Goldstraw P, Chansky K, Crowley J, Rami-Porta R, Asamura H, Eberhardt WE, et al. The IASLC lung cancer staging project: proposals for revision of the TNM stage groupings in the forthcoming (Eighth) edition of the TNM classification for lung cancer. J Thorac Oncol. 2016;11:39–51. 26762738 10.1016/j.jtho.2015.09.009 12. Ishimura M Norikane T Mitamura K Yamamoto Y Manabe Y Murao M FDG PET texture indices as imaging biomarkers for epidermal growth factor receptor mutation status in lung adenocarcinoma Sci Rep 2023 13 6742 10.1038/s41598-023-34061-7 37185611 PMC10130153 Ishimura M, Norikane T, Mitamura K, Yamamoto Y, Manabe Y, Murao M, et al. FDG PET texture indices as imaging biomarkers for epidermal growth factor receptor mutation status in lung adenocarcinoma. Sci Rep. 2023;13: 6742. 37185611 10.1038/s41598-023-34061-7 PMC10130153 13. Hirata K Kobayashi K Wong KP Manabe O Surmak A Tamaki N A semi-automated technique determining the liver standardized uptake value reference for tumor delineation in FDG PET-CT PLoS One 2014 9 e105682 10.1371/journal.pone.0105682 25162396 PMC4146536 Hirata K, Kobayashi K, Wong KP, Manabe O, Surmak A, Tamaki N, et al. A semi-automated technique determining the liver standardized uptake value reference for tumor delineation in FDG PET-CT. PLoS One. 2014;9: e105682. 25162396 10.1371/journal.pone.0105682 PMC4146536 14. Im H-J Bradshaw T Solaiyappan M Cho SY Current methods to define metabolic tumor volume in positron emission tomography: which one is better? Nucl Med Mol Imaging 2018 52 5 15 10.1007/s13139-017-0493-6 29391907 PMC5777960 Im H-J, Bradshaw T, Solaiyappan M, Cho SY. Current methods to define metabolic tumor volume in positron emission tomography: which one is better? Nucl Med Mol Imaging. 2018;52:5–15. 29391907 10.1007/s13139-017-0493-6 PMC5777960 15. Paesmans M Berghmans T Dusart M Garcia C Hossein-Foucher C Lafitte JJ Primary tumor standardized uptake value measured on fluorodeoxyglucose positron emission tomography is of prognostic value for survival in non-small cell lung cancer: update of a systematic review and meta-analysis by the European lung cancer working party for the international association for the study of lung cancer staging project J Thorac Oncol 2010 5 612 9 10.1097/JTO.0b013e3181d0a4f5 20234323 Paesmans M, Berghmans T, Dusart M, Garcia C, Hossein-Foucher C, Lafitte JJ, et al. Primary tumor standardized uptake value measured on fluorodeoxyglucose positron emission tomography is of prognostic value for survival in non-small cell lung cancer: update of a systematic review and meta-analysis by the European lung cancer working party for the international association for the study of lung cancer staging project. J Thorac Oncol. 2010;5:612–9. 20234323 10.1097/JTO.0b013e3181d0a4f5 16. Paz-Ares L Luft A Vicente D Tafreshi A Gümüş M Mazières J Pembrolizumab plus chemotherapy for squamous Non-Small-Cell lung cancer N Engl J Med 2018 379 2040 51 10.1056/NEJMoa1810865 30280635 Paz-Ares L, Luft A, Vicente D, Tafreshi A, Gümüş M, Mazières J, et al. Pembrolizumab plus chemotherapy for squamous Non-Small-Cell lung cancer. N Engl J Med. 2018;379:2040–51. 30280635 10.1056/NEJMoa1810865 ",
  "metadata": {
    "Title of this paper": "Pembrolizumab plus chemotherapy for squamous Non-Small-Cell lung cancer",
    "Journal it was published in:": "BMC Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482807/"
  }
}