{
  "title": "Paper_882",
  "abstract": "pmc CNS Oncol CNS Oncol 3040 cnsoncol CNS Oncology 2045-0907 2045-0915 Taylor & Francis PMC12477879 PMC12477879.1 12477879 12477879 41002100 10.1080/20450907.2025.2563981 2563981 1 Version of Record Case Report Case Report Multiple brain lesions in a patient with relapsed hairy cell leukemia: a case report and review of the literature K. le Dû et al. Atypical Cerebral Lesions in Hairy Cell Leukemia https://orcid.org/0000-0003-4371-2668 Le Dû Katell  a https://orcid.org/0009-0007-6186-4389 Delaunay Jacques  a https://orcid.org/0009-0006-3351-4309 Voldoire Maud  a https://orcid.org/0009-0003-4666-2026 Cuvier Thomas  b https://orcid.org/0009-0004-3003-3038 Renard Pierre-Yves  c https://orcid.org/0009-0009-1190-202X Quilichini Benoît  d https://orcid.org/0009-0009-6901-4869 Wafflart Eric  e https://orcid.org/0000-0003-2735-9534 Dubreuil Julien  f https://orcid.org/0009-0003-4255-4116 Sadot-Lebouvier Sophie  a a Department of Hematology, Hôpital Privé Le Confluent Nantes France b Department of Onco-hematology, Hôpital Privé Le Confluent Nantes France c Department of Pharmacy, Hôpital Privé Le Confluent Nantes France d Department of Molecular Biology, Eurofins Biomnis Lyon France e Department of Radiology, Hôpital Privé Le Confluent Nantes France f Department of Nuclear Medicine, Hôpital Privé Le Confluent Nantes France CONTACT katell.ledu@gmail.com Department of Hematology, Hôpital Privé Le Confluent Nantes France 26 9 2025 2025 14 1 497281 2563981 26 09 2025 30 09 2025 30 09 2025 17 3 2025 17 9 2025 KnowledgeWorks Global Ltd. 26 9 2025 published online in a building issue 26 9 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group 2025 The Author(s) https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial License ( http://creativecommons.org/licenses/by-nc/4.0/ Abstract Cerebral lesions are rare in hairy cell leukemia (HCL), and its incidence remains to be determined. Identifying the cause can be challenging. In this report, we present a case of brain lesions occurring several years after diagnosis. A 76-year-old male patient presented to the Emergency Department with confusion. He had been diagnosed with HCL in 1999 and had received five lines of treatment. Cerebral imaging revealed multiple nodular lesions, with edema and a hemorrhagic appearance. Cerebrospinal fluid tests were negative. The tumor origin was retained due to concomitant relapse (blood, lymph nodes). Despite the partial efficacy of rituximab-cladribine treatment, the patient died of Candida PLAIN LANGUAGE SUMMARY Hairy cell leukemia (HCL) is a rare form of blood cancer. It manifests itself as fatigue, infections, and abdominal pain. Brain problems are rare in this disease. Here, we present the unusual case of a patient who had been suffering from this disease for several years and who developed brain lesions. As the brain is a difficult organ to access, treatment focused on the most common causes, such as infections and his disease. There are no guidelines on the management of these difficult cases. ARTICLE HIGHLIGHTS  Cerebral lesions are rare in HCL (Hairy Cell Leukemia) evolution. Comprehensive imaging and laboratory tests (cytological analysis and flow cytometry of cerebrospinal fluid) should be performed, if possible. Testing for circulating tumor DNA in cerebrospinal fluid may help in diagnosis. The risk of bleeding associated with thrombocytopenia and the use of BTK (Bruton Tyrosine Kinase) inhibitors must be taken into consideration. The role of BRAF inhibitors in this indication remains to be determined. Keywords Brain imaging case report hairy cell leukemia nodular hemorrhagic lesions BRAF inhibitors BTK (Bruton Tyrosine Kinase) inhibitors circulating tumor DNA pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Hairy cell leukemia (HCL) is a rare malignant B lymphoid hemopathy with an annual incidence rate of 0.3 per 100,000 people for men and 0.1 per 100,000 for women, and median ages of onset of 63 and 59 years, respectively [ 1 2–4 A combination of cladribine and rituximab is the most effective first-line treatment, with very high complete response (100%) and overall survival (96.8%) rates, while pentostatin and interferon are often reserved for the most fragile patients [ 5 6 7 8 9 10 10–24 2. Case report 2.1. Presentation A 76-year-old patient presented to the Emergency Department (ED) on 12 October 2024, with ideomotor slowing. His clinical examination was normal apart from obnubilation. A cerebral computed tomography (CT) scan revealed multiple spontaneously hyperdense supratentorial and subtentorial subcortical lesions, with patches of perilesional edema ( Figure 1 Figure 2a,b Figure 1. Encephalic angioscan (axial section) showing multiple spontaneously hyperdense subcortical lesions above and below the cortex in a patient with hairy cell leukemia. Figure 2. Magnetic resonance imaging (axial section) of the brain of a patient with hairy cell leukemia. (a) T1+ gadolinium sequence; (b) T2 SWI sequence. The images show multiple supra- and infratentorial cortical and subcortical lesions. Spontaneous T1 hypersignals (a) appear to correspond to hemorrhagic lesions on T2 SWI (b), with perilesional edema in the largest lesions. Concerning his leukemia, the diagnosis was made in 1999 based on the presence of splenomegaly and circulating leukemia cells. He had received five lines of treatment prior to this hospitalization: pentostatin (discontinued after one cycle due to general intolerance) and splenectomy in 1999, cladribine for his first relapse in 2020, rituximab-vemurafenib in 2023, rituximab monotherapy in July 2024, and acalabrutinib since 1 October 2024. Hemopathy had been considered refractory since February 2024. Concerning molecular data, an isolated mutation of the BRAF gene (V600E) was discovered in peripheral blood in March 2023 using next-generation sequencing (NGS) technology on 29 genes. The variant allele frequency of BRAF was 82.1%, and the white blood cell count (WBC) was 104,000/mm³ with 86% HCL cells on the day of this examination. Another assessment of the mutational status by NGS was performed on blood in February 2024, five months before treatment with rituximab monotherapy, and found the BRAF mutation with an allele frequency of 7.4% and the appearance of an ARID1A mutation (allele frequency of 6.1%). This assessment was performed during an evaluation of relapse occurring eight months after treatment with rituximab-vemurafenib (5,476 lymphocytes/mm 3 3 When the patient presented to the Emergency Department (ED) in October 2024, blood tests revealed a total WBC count of 144,340/mm 3 3 3 Toxoplasma gondii Cryptococcus neoformans 18 Figure 3a,b Enterococcus faecalis Figure 3. (a) Fluorodeoxyglucose F18-positron emission tomography three-dimensional computed tomography maximum intensity projection image. (b) Axial fusion positron emission tomography/TDM showing hypermetabolism of the retroperitoneal lymph nodes. 2.2. Treatment and outcomes Corticosteroids and ceftriaxone were administered in the ED on the first day, then for nine days while infectious and brain explorations were performed, with no effect on symptoms. The diagnosis of atypical HCL localization was suggested after a multidisciplinary consultation meeting. The patient was then treated with rituximab (day 1, day 8) and 5 days of cladribine (0.14 mg/kg/day). Three days after the second dose of rituximab, the WBC count was 580/mm 3 3 3 3 Figures 4 5 Candida albicans E Table 1 3 Figure 4 Figure 4. WBC count evolution. Figure 5. Brain computed tomography scan (axial section) showing a partial regression of lesions. Table 1. Treatment and imaging schedule.  D1 D2 D3 D4 D5 D6 D7 D8 D9 D10 D11 D12 D13 D14 D15 D16 D17 D18 D19 D20 D21 D22 D23 D24 D25 D26 D27 D28 D29 D30 D31 D32 CEFTRIAXONE X X X X X X X X X X X                      CEFEPIME                    X X X X X         AMlKACIN                    X X   X         LINEZOLID                     X X X X X X X X X X X  MEROPENEM                        X X X X X X X X  CASPOFUNGIN                         X X X X X X X  ROXITHROMY  X X X X X X X X X X X X X X X X X X X X X X X X X X      VALACICLOVI R (Ig/day, oral, prophylaxis)                    X X X X X X X X      ATOVAQUONE                   X X X X X X X X X      METHYPREDNI SOLONE X X X  X X X X X X X X X X X                  METHYLPRED NISOLONE (40                X X X               RITUXIMAB 2          X       X                CLADRIBINE          X X X X X                   Brain CT scan X                                Body scan                    X             Brain MRI    X                             3. Literature review We performed searches of PubMed, CrossRef and Google Scholar for the terms “cerebral localization,” “brain localization,” “meningeal infiltration,” and “leukemic meningitis,” between 1960 and 2025. The case reports and case series returned are summarized in Table 2 11–24 20 3 3 16–19 21–24 Table 2. Literature review of cases of hairy cell leukemia with cerebral and/or meningeal involvement. Study (year) Age Sex Delay in the onset of brain lesions Previous treatment Other disease sites Type of brain lesions Diagnostic sampling Specific treatment Response and survival Ref. Plenderleith et al. (1966) 59 Male 13 years Splenic irradiation, corticosteroids Blood CNS infiltration Cerebrospinal fluid (no flow cytometry) Cobalt whole brain radiation PR and undetermined death [ 11 Plenderleith et al. (1966) 78 Male 0 0 Blood, bone marrow, spleen CNS infiltration Cerebrospinal fluid (no flow cytometry) 0 Unknown, death (pneumonia) [ 11 Wolfe et al. (1984) 62 Male 0 0 Blood, spleen CNS infiltration Cerebrospinal fluid (TRAP+ staining) Splenectomy + IT methotrexate  + dexamethasone  + whole brain irradiation (3000 rad) PR, alive at 26 months [ 12 24 Knecht et al. (1985) 53 Male Unknown Splenectomy Blood CNS infiltration Cerebrospinal fluid (TRAP+ staining) IT methotrexate  + alpha interferon PR [ 13 24 Le Bezu et al. (1986) 35 Male 0 0 Blood CNS infiltration Not specified None Unknown, death [ 14 24 Navarrete et al. (1987) 66 Male 0 0 Unknown CNS infiltration Cerebrospinal fluid (no flow cytometry) Unknown Unknown [ 15 Chandana et al. (2013) 51 Male 0 0 Blood, bone marrow, skin, liver, and spleen Numerous high-attenuation areas with surrounding vasogenic edema in the right frontal, left temporoparietal, and bilateral posterior parietal areas Brain biopsy IV methotrexate  + corticosteroids  + cladribine Unknown, death (GI bleeding) [ 16 24 McDowell et al. (2016) 59 Male 0 0 Blood, bone marrow, lymph nodes, spleen CNS infiltration and multiple enhancing supra and infratentorial leptomeningeal foci with slightly nodular appearances Cerebrospinal fluid (CD19 + staining) IV cytarabine, rituximab and IT methotrexate; then IT methotrexate and rituximab; then vemurafenib (twice) CR, at 3 months [ 17 Perry et al. (2017) 42 Male 0 0 Lymph nodes, spleen, liver, and blood Multiple small acute hemorrhages at the gray-white junction in the supratentorial and infratentorial brain Brain biopsy (cerebrospinal fluid negative on cytology and flow cytometry) Cladribine + rituximab CR, alive at 9 months [ 18 Chai et al. (2017) 68 Male 0 0 Bone, bone marrow, pleura Soft tissue mass in the skull base (occipital bone and posterior fossa) Brain biopsy (cerebrospinal fluid negative on cytology and flow cytometry) Cladribine, then rituximab CR, alive at 12 months [ 19 Angelova et al. (2018) 69 Male 15 months (HCL variant) Cladribine Blood, spleen Multiple bilateral brain lesions Brain biopsy Rituximab, then fludarabine and cytarabine CR, alive at 37 months [ 20 Moustafa et al. (2019) 59 Male 0 0 Unknown Leptomeningeal and occipital enhancement Not specified IT methotrexate  + vemurafenib CR [ 21 Moustafa et al. (2019) 43 Female 0 0 Unknown Acute hemorrhages at the gray, white junction in the supra and infratentorial Not specified Cladribine + rituximab CR [ 21 Moustafa et al. (2019) 51 Male 0 0 Unknown High-attenuation areas with surrounding vasogenic edema in the right frontal, left temporoparietal, and bilateral posterior parietal areas Not specified Cladribine + IT methotrexate Unknown, death (sepsis) [ 21 Johnson et al. (2022) 80 Male 9 years Three lines: cladribine, pentostatin and rituximab, cladribine and rituximab Lymph nodes, blood, spleen Diffuse, non-enhancing masses in the supratentorial and infratentorial regions of the brain. none Hydroxyurea  + leukapheresis, ibrutinib, vemurafenib CR, alive at 6 months [ 22 Ito et al. (2024) 80 Female 6 years Five lines (fludarabine, x 2 cladribine, rituximab, cladribine) Unknown Abnormal enhancement in the cerebrum and CNS infiltration Brain biopsy Unknown Unknown [ 23 Claves et al. (2024) 33 Male 0 0 Blood, bone marrow, lymph nodes, spleen Meningeal and parieto-occipital lesions Brain biopsy (cerebrospinal fluid negative on cytology and flow cytometry) Cladribine + rituximab CR, alive at 3 months [ 24 CNS: Cerebral Nervous System, CR: Complete Response, GI: Gastro Intestinal, IT: IntraThecal, IV: IntraVenously, HCL: Hairy Cell Leukemia, PR: Partial Response, TRAP: Tartrate-Resistant Acid Phosphatase. 4. Discussion Central nervous system (CNS) localization is rare in HCL and diagnosis can be difficult to confirm. It is often limited to case reports and may involve the meninges and/or the brain [ 10–24 10 Streptococcus pneumoniae Cryptococcus neoformans 25 26 27 28 27 27–29 8 9 30 31 32 27 32 5. Conclusion CNS localizations are rare in HCL, and the main difficulty remains confirming the tumor origin. Investigations should be exhaustive if possible, using imaging data and cerebrospinal fluid analysis with cytometry. In the most difficult cases, searching for circulating tumor DNA and mutations by NGS sequencing in the cerebrospinal fluid may facilitate diagnosis, but these techniques are not routinely proposed. The hemorrhagic presentation of brain lesions may be promoted by thrombocytopenia and the use of BTK inhibitors, suggesting that brain imaging should be performed routinely before initiating this type of treatment. There are no recommendations for therapeutic management in these cerebral presentations; conventional treatments appear to be effective, but the prognosis remains poor. Acknowledgements The authors would like to thank the patient’s family and Enago ( www.enago.com Informed consent All the data were de-identified, and the patient’s family has given their written consent for publication. Author’s contributions Katell Le Dû has written the article. Eric Wafflart and Julien Dubreuil have made a significant contribution to the work reported in the acquisition, analysis and interpretation of data. Thomas Cuvier, Jacques Delaunay, Julien Dubreuil, Pierre-Yves Renard, Sophie Sadot-Lebouvier, Maud Voldoire, and Eric Wafflart have revised and critically reviewed the article. All authors have agreed on the journal to which the article will be submitted. They have reviewed and approved all versions of the article prior to submission, during revision, the final version accepted for publication, and any significant changes introduced at the proofing stage. They agree to take responsibility and be accountable for the contents of the article and to share responsibility to resolve any questions raised about the accuracy or integrity of the published work. Disclosure statement The authors have no relevant affiliations or financial involvement with any organization or entity with a financial interest in or financial conflict with the subject matter or materials discussed in the manuscript. This includes employment, consultancies, honoraria, stock ownership or options, expert testimony, grants or patents received or pending, or royalties. Data availability statement Data available on request from the authors. References Papers of special note have been highlighted as either of interest (*) or of considerable interest (**) to readers. 1 Wiber M Maitre E Poncet JM et al. A population-based study of hairy cell leukemia over a period of 20 years Cancer Treat Res Commun 2020 25 1000236 10.1016/j.ctarc.2020.100236 33227559 2 Matutes E Morilla R Owusu-Ankomah K et al. The immunophenotype of hairy cells leukemia (HCL). Proposal for a scoring system to distinguish HCL from B-cell disorders with hairy or villous lymphocytes Leuk Lymphoma 1999 14 57 61 7820054 3 WHO Classification of Tumours Editorial Board Hairy cell leukemia Lim MS Molina TJ Montes-Moreno S Siebert R Stamatopoulos KE Tiacci E Haematolymphoid Tumours. WHO Classification of Tumours 11 5th ed Lyon International Agency for Research on Cancer 2024 380 384 4 Tiacci E Trifonov V Schiavoni G et al. BRAF mutations in hairy-cell leukemia N Engl J Med 2011 364 24 2305 2315 10.1056/NEJMoa1014209 21663470 PMC3689585 5 Chihara D Arons E Stetler-Stevenson M et al. Randomized phase II study of first-line cladribine with concurrent or delayed rituximab in patients with hairy cell leukemia J Clin Oncol 2020 38 14 1527 1538 10.1200/JCO.19.02250 32109194 PMC7213585 6 ** Else M Dearden CE Matutes E et al. Rituximab with pentostatin or cladribine: an effective combination treatment for hairy cell leuke mia after disease recurrence Leuk Lymphoma 2011 52 sup2 75 78 10.3109/10428194.2011.568650 21504288 7 ** Tiacci E Park JH De Carolis L et al. Targeting mutant BRAF in relapsed or refractory hairy-cell leukemia N Engl J Med 2015 373 18 1733 1747 10.1056/NEJMoa1506583 26352686 PMC4811324 8 ** Troussard X Maître E Paillassa J. Hairy cell leukemia 2024: Update on diagnosis, risk-stratification, and treatment. Annual updates in hematological malignancies Am J Hematol 2024 99 4 679 696 10.1002/ajh.27240 38440808 9 ** Falini B Tiacci E. Hairy-cell leukemia N Engl J Med 2024 391 14 1328 1341 10.1056/NEJMra2406376 39383460 10 Robak T Braun M Janus A et al. Rare clinical symptoms in hairy cell leukemia Cancers 2024 16 17 3054 10.3390/cancers16173054 39272912 PMC11394659 11 Plenderleith IH. Hairy cell leukemia Can Med Assoc J 1970 102 10 1056 1060 4939244 PMC1930244 12 Wolfe DW Scopelliti JA Boselli BD. Leukemic meningitis in a patient with hairy cell leukemia. A case report Cancer 1984 54 6 1085 1087 10.1002/1097-0142(19840915)54:6&#x0003c;1085::AID-CNCR2820540626&#x0003e;3.0.CO;2-S 6547873 13 Knecht H Budmiger H Groscurth P et al. Central nervous system involvement in hairy cell leukemia Klin Wochenschr 1985 63 9 423 427 10.1007/BF01733668 3999626 14 Le Bezu M Pinaudeau Y Poirier J et al. Involvement of the nervous system in hairy cell leukemia Arch Neurol 1985 42 9 839 839 10.1001/archneur.1985.04060080017005 4026623 15 Navarrete D Bodega E. Leukemic meningitis in a patient with hairy cell leukemia. A case report Nouv Rev Hematol 1987 29 247 249 3697064 16 Chandana SR Kotecha R Al-Janadi A et al. Rare case of hairy cell leukemia with brain parenchymal involvement: a diagnostic dilemma J Clin Oncol 2013 31 11 e186–188 e188 10.1200/JCO.2012.44.8787 23439755 17 McDowell M Zhu X Agarwal N et al. Response of relapsed central nervous system hairy cell leukemia to vemurafenib Leuk Lymphoma 2016 57 12 2952 2954 10.1080/10428194.2016.1177773 27116997 18 Perry AM Matsuda K Wadhwa V et al. Multifocal brain involvement in a patient with hairy cell leukemia successfully treated with rituximab and cladribine Blood Adv 2017 1 14 899 902 10.1182/bloodadvances.2017004697 29296733 PMC5737593 19 Chai KL Morris T Bazargan A. A case report of hairy cell leukemia: an unusual presentation Ann Clin Case Rep 2017 2 1412 20 Angelova EA Medeiros LJ Wang W et al. Clinicopathologic and molecular features in hairy cell leukemia-variant: single institutional experience Mod Pathol 2018 31 11 1717 1732 10.1038/s41379-018-0093-8 29955146 21 Moustafa A Shwaylia HM Aldapt M et al. Outcome of atypical presentations of hairy cell leukemia Blood (ASH Annual Meeting Abstracts 2019 134 5217 22 Johnson AE Raju AR Jacob A et al. Case report: a case of classic hairy cell leukemia with CNS involvement treated with vemurafenib Front Oncol 2022 12 1100577 10.3389/fonc.2022.1100577 36713531 PMC9877286 23 Ito K Harada K Uchino Y et al. A rare clinical case of secondary central nervous system involvement without transformation in hairy cell leukemia: a case report and literature review Acta Haematol 2024 147 4 482 488 10.1159/000535066 37952510 24 Claves D Carras S Burroni B et al. Atypical meningeal localization of classical hairy cell leukemia with an impressive response to rituximab and cladribine association. A case report and literature review EJHaem 2024 5 1 242 246 10.1002/jha2.841 38406549 PMC10887254 25 Kapoor N Zhao Q Stiff A et al. Incidence, description, and timing of serious and opportunistic infections in patients with hairy cell leukemia EJHael 2024 5 5 1005 1009 10.1002/jha2.982 PMC11474417 39415904 26 Mutter JA Alig SK Esfahani MS et al. Circulating tumor DNA profiling for detection, risk stratification, and classification or brain lymphomas J Clin Oncol 2023 41 9 1684 1694 10.1200/JCO.22.00826 36542815 PMC10419411 27 Hoang-Xuan K Deckert M Ferreri AJM et al. European Association of Neuro-Oncology (EANO) guidelines for treatment of primary central nervous system lymphoma (PCNSL) Neuro Oncol 2023 25 1 37 53 10.1093/neuonc/noac196 35953526 PMC9825335 28 Rubenstein JL. Primary CNS lymphoma: progress with dose-intensive consolidation J Clin Oncol 2022 40 32 3681 3687 10.1200/JCO.22.01337 36179277 PMC9649280 29 Rubenstein JL Combs D Rosenberg J et al. Rituximab therapy for CNS lymphomas: targeting the leptomeningeal compartment Blood 2003 101 2 466 468 10.1182/blood-2002-06-1636 12393404 30 Mendez-Hernandez A Moturi K Hanson V et al. Hairy cell leukemia: where are we in 2023? Curr Oncol Rep 2023 25 8 833 840 10.1007/s11912-023-01419-z 37097545 PMC10126561 31 Vereertbrugghen A Colado A Gargiulo E et al. In vitro sensitivity to venetoclax and microenvironment protection in hairy cell leukemia Front Oncol 2021 11 598319 10.3389/fonc.2021.598319 34381700 PMC8350736 32 Paillassa J Safa F Troussard X. Updates in hairy celle leukemia (HCL) and variant-type HCL (HCL-V): rationale for targeted treatments with a focus on ibrutinib Ther Adv Hematol 2022 13 13 20406207221090886 35450208 10.1177/20406207221090886 PMC9016521 ",
  "metadata": {
    "Title of this paper": "Updates in hairy celle leukemia (HCL) and variant-type HCL (HCL-V): rationale for targeted treatments with a focus on ibrutinib",
    "Journal it was published in:": "CNS Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477879/"
  }
}