{
  "title": "Paper_152",
  "abstract": "Blood Blood 446 blood Blood 0006-4971 1528-0020 The American Society of Hematology PMC11830970 PMC11830970.1 11830970 11830970 38985835 10.1182/blood.2024023887 S0006-4971(24)01876-7 1 Thrombosis and Hemostasis RBCs regulate platelet function and hemostasis under shear conditions through biophysical and biochemical means ∗ Jiang Debbie dcjiang@mgh.harvard.edu 1 2 3 ∗∗ Houck Katie L. 4 Murdiyarso Lydia 4 Higgins Harrison 4 Rhoads Nicole 4 Romero Sophia K. 4 Kozar Rosemary 5 Nascimbene Angelo 6 Gernsheimer Terry B. 1 2 Sanchez Zyrina Alura C. 7 Ramasubramanian Anand K. 7 Adili Reheman 4 Dong Jing-fei jfdong@bloodworksnw.org 1 4 ∗ 1 2 3 4 5 6 7 ∗ jfdong@bloodworksnw.org ∗∗ dcjiang@mgh.harvard.edu 03 10 2024 14 7 2024 144 14 472759 1521 1531 16 1 2024 3 7 2024 03 10 2025 03 10 2025 18 02 2025 03 10 2025 © 2024 American Society of Hematology. Published by Elsevier Inc. All rights are reserved, including those for text and data mining, AI training, and similar technologies. 2024 American Society of Hematology Key Points • RBCs promote fibrin formation and hemostasis in mice in the condition of severe pancytopenia. • Altering RBC membrane deformability interferes with the ability of RBCs to support platelet aggregation in vitro. Visual Abstract Abstract Red blood cells (RBCs) have been hypothesized to support hemostasis by facilitating platelet margination and releasing platelet-activating factors such as adenosine 5′-diphosphate (ADP). Significant knowledge gaps remain regarding how RBCs influence platelet function, especially in (patho)physiologically relevant hemodynamic conditions. Here, we present results showing how RBCs affect platelet function and hemostasis in conditions of anemia, thrombocytopenia, and pancytopenia and how the biochemical and biophysical properties of RBCs regulate platelet function at the blood and vessel wall interface and in the fluid phase under flow conditions. We found that RBCs promoted platelet deposition to collagen under flow conditions in moderate (50 × 10 3 3 Red blood cells (RBCs) do more than carry hemoglobin and provide oxygen to tissues; abnormal RBCs are known to be prothrombogenic. Using murine and in vitro microfluidic models to control RBC and platelet counts, Jiang et al demonstrate a hemostatic effect of RBCs via platelet activation in settings of moderate thrombocytopenia and a platelet-independent effect via fibrin formation in severe pancytopenia. Furthermore, in high shear conditions, RBCs released adenosine 5’-diphosphate, contributing to the platelet activation and thrombosis seen in those with left ventricular assist devices. Collectively, these data stimulate further research into how RBCs support hemostasis in high-risk clinical circumstances. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "RBCs regulate platelet function and hemostasis under shear conditions through biophysical and biochemical means",
    "Journal it was published in:": "Blood",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11830970/"
  }
}