{
  "title": "Paper_695",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12480345 PMC12480345.1 12480345 12480345 41021145 10.1007/s12672-025-03205-8 3205 1 Review The multifaceted role of RNF213 in oncogenesis: current insights and future research directions Kuang Guicheng Ji Hang Yang Hailan Liu Haitao Sun Haogeng s666888sci@163.comand Liu Yi lneurology123@163.com https://ror.org/011ashp19 grid.13291.38 0000 0001 0807 1581 Department of Neurosurgery, West China Hospital, Sichuan University, 29 9 2025 12 2025 16 478248 1745 25 1 2025 11 7 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Moyamoya disease (MMD)-associated gene RNF213 has emerged as a critical player in the pathogenesis of a spectrum of cancers beyond its established role in MMD. This review synthesizes current understanding of RNF213’s structural characteristics, its fundamental functions, and its intricate associations with various malignancies. Mutations in RNF213 are strongly correlated with MMD risk, particularly in East Asian populations, and are linked to disease severity and age of onset. The gene’s role extends to the tumor microenvironment, where it influences cancer cell proliferation, migration, invasion, and immune evasion, as evidenced in gliomas, lung cancers, and breast cancers. Our analysis highlights the gene’s potential mechanisms in cancer development, including effects on mitotic abnormalities leading to genomic instability, modulation of cellular immunity, and metabolic reprogramming in tumor cells. We delve into the gene’s implication in immune responses and its potential as a biomarker and therapeutic target in oncology. Collectively, the evidence supports the notion of RNF213 as a tumor suppressor gene, whose mutations are associated with poor prognosis. The exploration of its role in cancer holds promise for advancing diagnostic and therapeutic strategies. Future research is warranted to elucidate the underlying mechanisms and to harness the full potential of RNF213 in cancer treatment. Keywords RNF213 Cancer Biomarker Immune modulation Tumor metabolism pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction RNF213 (Ring Finger Protein 213), also known as mysterin, is a large 591 kDa cytosolic E3 ubiquitin ligase encoded by the RNF213 gene on chromosome 17q25.3 [ 1 2 3 5 RNF213 was initially discovered in Moyamoya disease (MMD), a rare cerebrovascular disease characterized by progressive stenosis of the internal carotid arteries and the formation of abnormal collateral vessels, creating a “smoky” appearance s [ 6 8 9 NM_020914.4 10 11 12 14 11 15 16 Emerging evidence suggests that RNF213 plays a multifaceted role in oncogenesis across various types of cancer. Preclinical studies have shown RNF213 suppresses proliferative signaling and angiogenesis [ 17 18 3 19 20 21 22 23 This review aims to synthesize the current understanding of RNF213’s role in oncogenesis, exploring its molecular mechanisms, mutational landscape, and implications for cancer diagnosis and treatment. By integrating insights from preclinical and clinical studies, we seek to provide a comprehensive overview of RNF213’s contributions to cancer biology and identify future research directions to further elucidate its functions and therapeutic potential. The structure and basic functions of RNF213 Research conducted on Southeast Asian populations has identified a single nucleotide polymorphism (SNP) closely associated with the pathogenesis of Moyamoya disease (MMD). This SNP is located on the long arm of human chromosome 17, and the study ultimately identified and named the MMD susceptibility gene as RNF213 on 17q25.3 [ 9 11 24 25 26 The primary structure of the mysterin protein, based on its main human isoform, encompasses a variety of enzymatic and non-enzymatic structures. These include two types of enzymatic activities: ATP hydrolysis which is associated with presumed physical movement, and ubiquitin ligase activity (Fig. 1 27 28 26 29 Fig. 1 In brief, the RNF213 protein is structured with two active ubiquitin ligase domains, the RING finger and the RZ finger, and a torus-shaped dynamin core composed of six AAA+ modules. These integral components are linked by an Arm segment. The protein's fundamental functions are associated with angiogenesis, immune response, and lipid metabolism However, the current understanding of the mysterin protein’s structure remains limited. On the one hand, the potential physical movement patterns generated by the mysterin protein’s core remain elusive. Existing studies have not identified any physical or spatial connections between the mysterin protein and microtubules or other cellular structures, which suggests that mysterin is not a motor protein akin to dynein. On the other hand, the process of ubiquitination is also poorly understood; it is generally not feasible to predict which substrates a ubiquitin ligase will interact with based on its primary or tertiary structure alone. Nonetheless, research on the function of RNF213 has been accelerating in recent years. Studies have revealed that RNF213 plays a pivotal role in the immune response to infections. For instance, research conducted in 2021 identified RNF213 as essential for defending against invasion of host cells by Salmonella enterica serovar Typhimurium (Salmonella Typhi). Mysterin, the protein encoded by RNF213, encapsulates the invading bacteria within the host cell cytoplasm and directly ubiquitinates the endotoxin in their outer membrane via its RZ finger [ 30 31 32 5 33 34 The role of RNF213 in infection and immunity may extend beyond the aforementioned mechanisms and potentially involve lipid droplets. Most cells in the body contain lipid droplets [ 35 36 5 37 38 39 41 42 43 44 5 In recent years, RNF213 has also been found to be associated with lipid metabolism and implicated in the toxicity of saturated fatty acids [ 45 47 48 The relationship between RNF213 and tumor The relationship between RNF213 and cancer has garnered significant attention in recent years (Fig. 2 49 50 51 52 Fig. 2 Mutations in the RNF213 gene, located on chromosome 17, are associated with a variety of tumors, including but not limited to central nervous system tumors, lung cancer and breast cancer. Further investigation is required to elucidate the role played by RNF213 in oncogenesis The relationship between RNF213 and neurological tumors Glioma represents a common form of primary malignant brain tumor within the central nervous system (CNS) [ 53 54 55 21 Medulloblastoma, originating in the cerebellum, is one of the most malignant gliomas within the cranial cavity, predominantly affecting children [ 56 57 20 58 In the case of glioblastoma, research has confirmed that RNF213 is a tumor suppressor gene. Similar to medulloblastoma, reduced expression of RNF213 is also detected in glioblastoma tissues, and patients with lower RNF213 expression have shorter survival times [ 59 59 60 59 61 62 63 64 65 66 The relationship between RNF213 and lung cancer Lung cancer has the highest incidence and mortality rates of all cancers worldwide [ 67 68 69 22 69 Subsequent research has confirmed that while RNF213 does not affect the proliferation of lung cancer cells, it is associated with epithelial-mesenchymal transition (EMT) in lung cancer cells and plays a significant role in the the migration and invasion of tumor cells, as well as in anti-tumor immunity [ 22 22 70 Clinical data have also revealed a positive correlation between the expression of RNF213 and the overall survival of patients, significantly reduced survival times are observed in patients with low expression of RNF213, while higher expression indicates improved clinical outcomes [ 22 Relationship between RNF213 and breast cancer Breast cancer is the leading cause of cancer-related deaths among women globally, with its incidence on the rise [ 71 72 The tumor microenvironment of solid tumors such as breast cancer is characterized by hypoxia, primarily due to the rapid growth of tumor cells outpacing the development of capillaries within the tumor, leading to oxygen deprivation in the tumor tissue [ 73 74 75 77 78 79 80 19 66 81 19 19 In addition, research has discovered that PTP1B regulates the tyrosine phosphorylation of RNF213 [ 19 Beyond the aforementioned cancers, mutations in RNF213 have been detected in a variety of tumors, including hereditary diffuse gastric cancer [ 82 83 84 85 86 87 88 89 90 91 92 Possible mechanisms of RNF213 in tumors The role of RNF213 in tumor cell proliferation Genomic instability is a pivotal molecular characteristic of malignant tumors [ 93 94 95 96 97 The RNF213 R4810K variant suppresses the expression of genes such as Securin, SKA3, and SGO1 [ 98 99 100 101 101 In summary, mutations in the RNF213 gene can induce mitotic abnormalities and increase the risk of genomic instability. Further investigation is required to determine whether this pathway can explain the role of RNF213 in tumors.In addition to genomic instability, aberrant epigenetic modifications can also significantly alter the levels of functional proteins and affect genomic integrity [ 102 Role of RNF213 in tumor metabolism and microenvironment Tumor metabolism The development and progression of tumors are closely linked to the metabolism of tumor cells [ 103 104 105 106 The RNF213 gene is intricately associated with a variety of metabolic pathways [ 26 107 108 109 19 110 111 A growing body of preclinical research indicates that targeting cancer cell metabolism can achieve immunostimulatory effects, and various forms of immunotherapy, particularly immune checkpoint inhibitors, can maximize these immunostimulatory effects [ 112 Tumor microenvironment The tumor microenvironment (TME) is a complex ecosystem that includes tumor cells, immune cells, stromal cells, and extracellular matrix components [ 113 114 115 116 117 RNF213 has been shown to affect how tumor cells adapt to the hypoxic conditions of the TME. Hypoxia is a hallmark of solid tumors and drives angiogenesis, metastasis, and resistance to therapy [ 118 3 Recent studies have further elucidated RNF213’s role in the TME. For instance, in HER2 + breast cancer, RNF213 is regulated by PTP1B and affects the activity of α-KG-dependent dioxygenases, thereby influencing the hypoxic response and tumor survival [ 119 120 Moreover, the metabolic alterations mediated by RNF213 can have implications for immune suppression. For example, the resistance to amino acid deprivation conferred by RNF213 may help tumor cells evade immune surveillance, as nutrient competition is a mechanism by which immune cells control tumor growth [ 110 Therefore, understanding RNF213’s functions in both tumor metabolism and the TME is crucial for developing novel strategies to combat cancer. The role of RNF213 in cellular immunity The high expression levels of the RNF213 gene in immune tissues [ 24 121 122 120 103 Summary and outlook RNF213 exhibits diverse roles in tumorigenesis, predominantly acting as a tumor suppressor across multiple cancer types. Growing evidence indicates that mutations or dysregulated expression of RNF213 are strongly associated with adverse cancer prognoses. For instance, in intrahepatic cholangiocarcinoma (ICC) [ 92 59 69 3 19 123 Future research on RNF213 should prioritize a comprehensive investigation of its molecular mechanisms. Although its roles in angiogenesis and the hypoxia response have been partially elucidated, the specific signaling pathways modulated by RNF213 across diverse cancer types warrant further exploration. Additionally, evaluating RNF213’s potential as a therapeutic target is critical. This includes developing inhibitors or modulators of RNF213 activity and validating their efficacy in relevant preclinical cancer models. Furthermore, detecting RNF213 mutations in ctDNA offers promise as a non-invasive biomarker, particularly for the early diagnosis of lung cancer. Extending this approach to other cancer types could enhance early detection rates. Regarding clinical significance, RNF213 mutations in intrahepatic cholangiocarcinoma (ICC) are associated with enhanced local invasion, correlating with an unfavorable prognosis. In glioblastoma, loss of RNF213 function is linked to more aggressive disease phenotypes. Furthermore, the detection of RNF213 mutations in circulating tumor DNA (ctDNA) from lung cancer patients underscores its potential as a non-invasive biomarker for early diagnosis. Investigating whether RNF213 status can predict responses to targeted therapies, such as those aimed at angiogenesis or hypoxia-related pathways, could inform personalized treatment strategies. Despite recent advances, significant gaps remain in RNF213 research. While its roles in intrahepatic cholangiocarcinoma (ICC), glioblastoma, and lung cancer have been partially elucidated, its functions in other cancer types remain poorly understood and require further investigation. The functional consequences of specific RNF213 mutations, particularly their effects on ubiquitin ligase activity, protein interactions, and cancer progression, necessitate detailed exploration. Furthermore, although preliminary studies suggest RNF213’s potential as a prognostic and diagnostic biomarker, its clinical utility must be substantiated through large-scale, well-designed clinical trials. In conclusion, RNF213 represents a critical focus in oncology research. Comprehensive investigation of its functions and molecular mechanisms will deepen our understanding of cancer biology and facilitate the development of novel diagnostic and therapeutic strategies for effective cancer management. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements we would like to express our gratitude to Professor Mamun Ahmed for his guidance and suggestions on language and grammar during the revision of the paper. Synopsis It highlights how RNF213 influences tumor development through mechanisms involving genomic instability, immune modulation, and metabolic reprogramming, positioning it as a potential biomarker and therapeutic target in oncology. Future research is needed to fully elucidate its mechanisms and clinical applications in cancer treatment. Author contributions Guicheng Kuang and Hang Ji researched literature and conceived the study. Hailan Yang’an De Haitaoliu made a drawing. Guicheng Kuang wrotes the first draft of the manuscript. The paper was revised and reviewed by Haogeng Sun and Yi Liu. All authors reviewed and edited the manuscript and approved the final version of the manuscript. Funding This study was supported by 1·3·5 project for disciplines of excellence-Clinical Research Fund, West China Hospital, Sichuan University (2018HXFH007), the National Natural Science Foundation of China (No.82301480), Sichuan Provincial Science and Technology Department (2022YFS0320, 2022YFS0013, 24NSFSC6825). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate None. Patient consent for publication None. Competing interests The authors declare no competing interests. References 1. Sun LR Vossough A Kossorotoff M Bang OY Smith E Phi JH Moyamoya across the lifespan: current neurologic care and future directions Neurology 2025 104 7 e213484 10.1212/WNL.0000000000213484 40036714 Sun LR, Vossough A, Kossorotoff M, Bang OY, Smith E, Phi JH, et al. Moyamoya across the lifespan: current neurologic care and future directions. Neurology. 2025;104(7):e213484. 40036714 10.1212/WNL.0000000000213484 2. Bhardwaj A, Banh RS, Zhang W, Sidhu SS, Neel BG. MMD-associated RNF213 SNPs encode dominant-negative alleles that globally impair ubiquitylation. Life Sci Alliance. 2022;5(5). 10.26508/lsa.202000807 PMC8831215 35135845 3. Bhardwaj A Panepinto MC Ueberheide B Neel BG A mechanism for hypoxia-induced inflammatory cell death in cancer Nature 2025 637 8045 470 7 10.1038/s41586-024-08136-y 39506105 Bhardwaj A, Panepinto MC, Ueberheide B, Neel BG. A mechanism for hypoxia-induced inflammatory cell death in cancer. Nature. 2025;637(8045):470–7. 39506105 10.1038/s41586-024-08136-y 4. Zhou X Zhang H Wang Y Wang D Lin Z Zhang Y Shigella effector IpaH1.4 subverts host E3 ligase RNF213 to evade antibacterial immunity Nat Commun 2025 16 1 3099 10.1038/s41467-025-58432-y 40164614 PMC11958729 Zhou X, Zhang H, Wang Y, Wang D, Lin Z, Zhang Y, et al. Shigella effector IpaH1.4 subverts host E3 ligase RNF213 to evade antibacterial immunity. Nat Commun. 2025;16(1):3099. 40164614 10.1038/s41467-025-58432-y PMC11958729 5. Thery F Martina L Asselman C Zhang Y Vessely M Repo H Ring finger protein 213 assembles into a sensor for isgylated proteins with antimicrobial activity Nat Commun 2021 12 1 5772 10.1038/s41467-021-26061-w 34599178 PMC8486878 Thery F, Martina L, Asselman C, Zhang Y, Vessely M, Repo H, et al. Ring finger protein 213 assembles into a sensor for isgylated proteins with antimicrobial activity. Nat Commun. 2021;12(1):5772. 34599178 10.1038/s41467-021-26061-w PMC8486878 6. Kim WH Kim SD Nam MH Jung JM Jin SW Ha SK Posterior circulation involvement and collateral flow pattern in Moyamoya disease with the RNF213 polymorphism Child’s Nerv System: ChNS: Official J Int Soc Pediatr Neurosurg 2019 35 2 309 14 10.1007/s00381-018-3985-5 30283986 Kim WH, Kim SD, Nam MH, Jung JM, Jin SW, Ha SK, et al. Posterior circulation involvement and collateral flow pattern in Moyamoya disease with the RNF213 polymorphism. Child’s Nerv System: ChNS: Official J Int Soc Pediatr Neurosurg. 2019;35(2):309–14. 10.1007/s00381-018-3985-5 30283986 7. Suh L Puri AS Singh J Kuhn AL I saw the ‘puff of smoke’ sign before it vanished into thin air Clin Imaging 2024 111 110190 10.1016/j.clinimag.2024.110190 38759602 Suh L, Puri AS, Singh J, Kuhn AL. I saw the ‘puff of smoke’ sign before it vanished into thin air. Clin Imaging. 2024;111:110190. 38759602 10.1016/j.clinimag.2024.110190 8. Miyawaki S Imai H Shimizu M Yagi S Ono H Nakatomi H Genetic analysis of RNF213 c.14576G > A variant in nonatherosclerotic Quasi-Moyamoya disease J Stroke Cerebrovasc Diseases: Official J Natl Stroke Association 2015 24 5 1075 9 10.1016/j.jstrokecerebrovasdis.2015.01.005 25817623 Miyawaki S, Imai H, Shimizu M, Yagi S, Ono H, Nakatomi H, et al. Genetic analysis of RNF213 c.14576G > A variant in nonatherosclerotic Quasi-Moyamoya disease. J Stroke Cerebrovasc Diseases: Official J Natl Stroke Association. 2015;24(5):1075–9. 10.1016/j.jstrokecerebrovasdis.2015.01.005 25817623 9. Mineharu Y Liu W Inoue K Matsuura N Inoue S Takenaka K Autosomal dominant Moyamoya disease maps to chromosome 17q25.3 Neurology 2008 70 24 Pt 2 2357 63 10.1212/01.wnl.0000291012.49986.f9 18463369 Mineharu Y, Liu W, Inoue K, Matsuura N, Inoue S, Takenaka K, et al. Autosomal dominant Moyamoya disease maps to chromosome 17q25.3. Neurology. 2008;70(24 Pt 2):2357–63. 18463369 10.1212/01.wnl.0000291012.49986.f9 10. Mertens R Graupera M Gerhardt H Bersano A Tournier-Lasserve E Mensah MA The genetic basis of Moyamoya disease Translational Stroke Res 2022 13 1 25 45 10.1007/s12975-021-00940-2 PMC8766392 34529262 Mertens R, Graupera M, Gerhardt H, Bersano A, Tournier-Lasserve E, Mensah MA, et al. The genetic basis of Moyamoya disease. Translational Stroke Res. 2022;13(1):25–45. 10.1007/s12975-021-00940-2 PMC8766392 34529262 11. Liu W Morito D Takashima S Mineharu Y Kobayashi H Hitomi T Identification of RNF213 as a susceptibility gene for Moyamoya disease and its possible role in vascular development PLoS ONE 2011 6 7 e22542 10.1371/journal.pone.0022542 21799892 PMC3140517 Liu W, Morito D, Takashima S, Mineharu Y, Kobayashi H, Hitomi T, et al. Identification of RNF213 as a susceptibility gene for Moyamoya disease and its possible role in vascular development. PLoS ONE. 2011;6(7):e22542. 21799892 10.1371/journal.pone.0022542 PMC3140517 12. Karczewski KJ Francioli LC Tiao G Cummings BB Alföldi J Wang Q The mutational constraint spectrum quantified from variation in 141,456 humans Nature 2020 581 7809 434 43 10.1038/s41586-020-2308-7 32461654 PMC7334197 Karczewski KJ, Francioli LC, Tiao G, Cummings BB, Alföldi J, Wang Q, et al. The mutational constraint spectrum quantified from variation in 141,456 humans. Nature. 2020;581(7809):434–43. 32461654 10.1038/s41586-020-2308-7 PMC7334197 13. Tadaka S Katsuoka F Ueki M Kojima K Makino S Saito S 3.5KJPNv2: an allele frequency panel of 3552 Japanese individuals including the X chromosome Hum Genome Variation 2019 6 28 10.1038/s41439-019-0059-5 PMC6581902 31240104 Tadaka S, Katsuoka F, Ueki M, Kojima K, Makino S, Saito S, et al. 3.5KJPNv2: an allele frequency panel of 3552 Japanese individuals including the X chromosome. Hum Genome Variation. 2019;6:28. 10.1038/s41439-019-0059-5 PMC6581902 31240104 14. Gao Y Zhang C Yuan L Ling Y Wang X Liu C PGG.Han: the Han Chinese genome database and analysis platform Nucleic Acids Res 2020 48 D1 D971 6 10.1093/nar/gkz829 31584086 PMC6943055 Gao Y, Zhang C, Yuan L, Ling Y, Wang X, Liu C, et al. PGG.Han: the Han Chinese genome database and analysis platform. Nucleic Acids Res. 2020;48(D1):D971–6. 31584086 10.1093/nar/gkz829 PMC6943055 15. Cecchi AC Guo D Ren Z Flynn K Santos-Cortez RL Leal SM RNF213 rare variants in an ethnically diverse population with Moyamoya disease Stroke 2014 45 11 3200 7 10.1161/STROKEAHA.114.006244 25278557 PMC4420622 Cecchi AC, Guo D, Ren Z, Flynn K, Santos-Cortez RL, Leal SM, et al. RNF213 rare variants in an ethnically diverse population with Moyamoya disease. Stroke. 2014;45(11):3200–7. 25278557 10.1161/STROKEAHA.114.006244 PMC4420622 16. Miyatake S Miyake N Touho H Nishimura-Tadaki A Kondo Y Okada I Homozygous c.14576G > A variant of RNF213 predicts early-onset and severe form of Moyamoya disease Neurology 2012 78 11 803 10 10.1212/WNL.0b013e318249f71f 22377813 Miyatake S, Miyake N, Touho H, Nishimura-Tadaki A, Kondo Y, Okada I, et al. Homozygous c.14576G > A variant of RNF213 predicts early-onset and severe form of Moyamoya disease. Neurology. 2012;78(11):803–10. 22377813 10.1212/WNL.0b013e318249f71f 17. Roy V, Brodeur A, Touzel Deschênes L, Dupré N, Gros-Louis F. RNF213 Loss-of-Function promotes angiogenesis of cerebral microvascular endothelial cells in a cellular state dependent manner. Cells. 2022;12(1). 10.3390/cells12010078 PMC9818782 36611871 18. Zhang L Rashad S Zhou Y Niizuma K Tominaga T RNF213 loss of function reshapes vascular transcriptome and spliceosome leading to disrupted angiogenesis and aggravated vascular inflammatory responses J Cereb Blood Flow Metabolism: Official J Int Soc Cereb Blood Flow Metabolism 2022 42 11 2107 22 10.1177/0271678X221110679 PMC9580177 35754359 Zhang L, Rashad S, Zhou Y, Niizuma K, Tominaga T. RNF213 loss of function reshapes vascular transcriptome and spliceosome leading to disrupted angiogenesis and aggravated vascular inflammatory responses. J Cereb Blood Flow Metabolism: Official J Int Soc Cereb Blood Flow Metabolism. 2022;42(11):2107–22. 10.1177/0271678X221110679 PMC9580177 35754359 19. Banh RS Iorio C Marcotte R Xu Y Cojocari D Rahman AA PTP1B controls non-mitochondrial oxygen consumption by regulating RNF213 to promote tumour survival during hypoxia Nat Cell Biol 2016 18 7 803 13 10.1038/ncb3376 27323329 PMC4936519 Banh RS, Iorio C, Marcotte R, Xu Y, Cojocari D, Rahman AA, et al. PTP1B controls non-mitochondrial oxygen consumption by regulating RNF213 to promote tumour survival during hypoxia. Nat Cell Biol. 2016;18(7):803–13. 27323329 10.1038/ncb3376 PMC4936519 20. Mineharu Y Oichi Y Kamata T Matsui Y Morimoto T Tanji M MBRS-22. SIGNIFICANCE OF RNF213 IN TUMORGENICITY OF MEDULLOBLASTOMA Neurooncology 2020 22 Supplement3 iii402 iii Mineharu Y, Oichi Y, Kamata T, Matsui Y, Morimoto T, Tanji M, et al. MBRS-22. SIGNIFICANCE OF RNF213 IN TUMORGENICITY OF MEDULLOBLASTOMA. Neurooncology. 2020;22(Supplement3):iii402–iii. 21. Bao ZS Chen HM Yang MY Zhang CB Yu K Ye WL RNA-seq of 272 gliomas revealed a novel, recurrent PTPRZ1-MET fusion transcript in secondary glioblastomas Genome Res 2014 24 11 1765 73 10.1101/gr.165126.113 25135958 PMC4216918 Bao ZS, Chen HM, Yang MY, Zhang CB, Yu K, Ye WL, et al. RNA-seq of 272 gliomas revealed a novel, recurrent PTPRZ1-MET fusion transcript in secondary glioblastomas. Genome Res. 2014;24(11):1765–73. 25135958 10.1101/gr.165126.113 PMC4216918 22. Liu X Zeng H Li Z Wei C Zhang Z Liu X RNF213 inhibits migration in lung adenocarcinoma cell. Cellular and molecular biology France) 2023 69 14 286 92 10.14715/cmb/2023.69.14.47 38279417 Liu X, Zeng H, Li Z, Wei C, Zhang Z, Liu X, et al. RNF213 inhibits migration in lung adenocarcinoma cell. Cellular and molecular biology. France). 2023;69(14):286–92. (Noisy-le-Grand. 10.14715/cmb/2023.69.14.47 38279417 23. Wu Y, Yuan Y, Xu H, Zhang W, Ning A, Li S et al. Crosstalk among alternative polyadenylation, genetic variants and ubiquitin modification contribute to lung adenocarcinoma risk. Int J Mol Sci. 2024;25(15). 10.3390/ijms25158084 PMC11311407 39125654 24. Kamada F Aoki Y Narisawa A Abe Y Komatsuzaki S Kikuchi A A genome-wide association study identifies RNF213 as the first Moyamoya disease gene J Hum Genet 2011 56 1 34 40 10.1038/jhg.2010.132 21048783 Kamada F, Aoki Y, Narisawa A, Abe Y, Komatsuzaki S, Kikuchi A, et al. A genome-wide association study identifies RNF213 as the first Moyamoya disease gene. J Hum Genet. 2011;56(1):34–40. 21048783 10.1038/jhg.2010.132 25. Morito D Nishikawa K Hoseki J Kitamura A Kotani Y Kiso K Moyamoya disease-associated protein mysterin/RNF213 is a novel AAA + ATPase, which dynamically changes its oligomeric state Sci Rep 2014 4 4442 10.1038/srep04442 24658080 PMC3963067 Morito D, Nishikawa K, Hoseki J, Kitamura A, Kotani Y, Kiso K, et al. Moyamoya disease-associated protein mysterin/RNF213 is a novel AAA + ATPase, which dynamically changes its oligomeric state. Sci Rep. 2014;4:4442. 24658080 10.1038/srep04442 PMC3963067 26. Ahel J, Lehner A, Vogel A, Schleiffer A, Meinhart A, Haselbach D et al. Moyamoya disease factor RNF213 is a giant E3 ligase with a dynein-like core and a distinct ubiquitin-transfer mechanism. Elife. 2020;9. 10.7554/eLife.56185 PMC7311170 32573437 27. Takeda M Tezuka T Kim M Choi J Oichi Y Kobayashi H Moyamoya disease patient mutations in the RING domain of RNF213 reduce its ubiquitin ligase activity and enhance NFκB activation and apoptosis in an AAA + domain-dependent manner Biochem Biophys Res Commun 2020 525 3 668 74 10.1016/j.bbrc.2020.02.024 32139119 Takeda M, Tezuka T, Kim M, Choi J, Oichi Y, Kobayashi H, et al. Moyamoya disease patient mutations in the RING domain of RNF213 reduce its ubiquitin ligase activity and enhance NFκB activation and apoptosis in an AAA + domain-dependent manner. Biochem Biophys Res Commun. 2020;525(3):668–74. 32139119 10.1016/j.bbrc.2020.02.024 28. Ogura T Wilkinson AJ AAA + superfamily atpases: common structure–diverse function Genes Cells: Devoted Mol Cell Mech 2001 6 7 575 97 10.1046/j.1365-2443.2001.00447.x 11473577 Ogura T, Wilkinson AJ. AAA + superfamily atpases: common structure–diverse function. Genes Cells: Devoted Mol Cell Mech. 2001;6(7):575–97. 10.1046/j.1365-2443.2001.00447.x 11473577 29. Habu T Harada KH UBC13 is an RNF213-associated E2 ubiquitin-conjugating enzyme, and lysine 63-linked ubiquitination by the RNF213-UBC13 axis is responsible for angiogenic activity FASEB bioAdvances 2021 3 4 243 58 10.1096/fba.2019-00092 33842849 PMC8019261 Habu T, Harada KH. UBC13 is an RNF213-associated E2 ubiquitin-conjugating enzyme, and lysine 63-linked ubiquitination by the RNF213-UBC13 axis is responsible for angiogenic activity. FASEB bioAdvances. 2021;3(4):243–58. 33842849 10.1096/fba.2019-00092 PMC8019261 30. Otten EG Werner E Crespillo-Casado A Boyle KB Dharamdasani V Pathe C Ubiquitylation of lipopolysaccharide by RNF213 during bacterial infection Nature 2021 594 7861 111 6 10.1038/s41586-021-03566-4 34012115 PMC7610904 Otten EG, Werner E, Crespillo-Casado A, Boyle KB, Dharamdasani V, Pathe C, et al. Ubiquitylation of lipopolysaccharide by RNF213 during bacterial infection. Nature. 2021;594(7861):111–6. 34012115 10.1038/s41586-021-03566-4 PMC7610904 31. Shibutani ST Saitoh T Nowag H Münz C Yoshimori T Autophagy and autophagy-related proteins in the immune system Nat Immunol 2015 16 10 1014 24 10.1038/ni.3273 26382870 Shibutani ST, Saitoh T, Nowag H, Münz C, Yoshimori T. Autophagy and autophagy-related proteins in the immune system. Nat Immunol. 2015;16(10):1014–24. 26382870 10.1038/ni.3273 32. Iwai K LUBAC-mediated linear ubiquitination: a crucial regulator of immune signaling Proc Japan Acad Ser B Phys Biol Sci 2021 97 3 120 33 10.2183/pjab.97.007 PMC8019854 33692228 Iwai K. LUBAC-mediated linear ubiquitination: a crucial regulator of immune signaling. Proc Japan Acad Ser B Phys Biol Sci. 2021;97(3):120–33. 10.2183/pjab.97.007 PMC8019854 33692228 33. Tian H Yu K He L Xu H Han C Zhang X RNF213 modulates γ-herpesvirus infection and reactivation via targeting the viral replication and transcription activator Proc Natl Acad Sci USA 2023 120 12 e2218825120 10.1073/pnas.2218825120 36917666 PMC10041092 Tian H, Yu K, He L, Xu H, Han C, Zhang X, et al. RNF213 modulates γ-herpesvirus infection and reactivation via targeting the viral replication and transcription activator. Proc Natl Acad Sci USA. 2023;120(12):e2218825120. 36917666 10.1073/pnas.2218825120 PMC10041092 34. Houzelstein D Simon-Chazottes D Batista L Tokuda S Langa Vives F Flamand M The ring finger protein 213 gene (Rnf213) contributes to rift Valley fever resistance in mice Mammalian Genome: Official J Int Mammalian Genome Soc 2021 32 1 30 7 10.1007/s00335-020-09856-y 33420513 Houzelstein D, Simon-Chazottes D, Batista L, Tokuda S, Langa Vives F, Flamand M, et al. The ring finger protein 213 gene (Rnf213) contributes to rift Valley fever resistance in mice. Mammalian Genome: Official J Int Mammalian Genome Soc. 2021;32(1):30–7. 10.1007/s00335-020-09856-y 33420513 35. Olzmann JA Carvalho P Dynamics and functions of lipid droplets Nat Rev Mol Cell Biol 2019 20 3 137 55 10.1038/s41580-018-0085-z 30523332 PMC6746329 Olzmann JA, Carvalho P. Dynamics and functions of lipid droplets. Nat Rev Mol Cell Biol. 2019;20(3):137–55. 30523332 10.1038/s41580-018-0085-z PMC6746329 36. Bosch M Sánchez-Álvarez M Fajardo A Kapetanovic R Steiner B Dutra F Mammalian lipid droplets are innate immune hubs integrating cell metabolism and host defense 2020 New York, NY Science 6514 10.1126/science.aay8085 33060333 Bosch M, Sánchez-Álvarez M, Fajardo A, Kapetanovic R, Steiner B, Dutra F, et al. Mammalian lipid droplets are innate immune hubs integrating cell metabolism and host defense. Volume 370. New York, NY: Science; 2020. p. 6514. 10.1126/science.aay8085 33060333 37. Zhang Y Thery F Wu NC Luhmann EK Dussurget O Foecke M The in vivo isgylome links ISG15 to metabolic pathways and autophagy upon Listeria monocytogenes infection Nat Commun 2019 10 1 5383 10.1038/s41467-019-13393-x 31772204 PMC6879477 Zhang Y, Thery F, Wu NC, Luhmann EK, Dussurget O, Foecke M, et al. The in vivo isgylome links ISG15 to metabolic pathways and autophagy upon Listeria monocytogenes infection. Nat Commun. 2019;10(1):5383. 31772204 10.1038/s41467-019-13393-x PMC6879477 38. Thery F Eggermont D Impens F Proteomics mapping of the isgylation landscape in innate immunity Front Immunol 2021 12 720765 10.3389/fimmu.2021.720765 34447387 PMC8383068 Thery F, Eggermont D, Impens F. Proteomics mapping of the isgylation landscape in innate immunity. Front Immunol. 2021;12:720765. 34447387 10.3389/fimmu.2021.720765 PMC8383068 39. Zhao C Beaudenon SL Kelley ML Waddell MB Yuan W Schulman BA The UbcH8 ubiquitin E2 enzyme is also the E2 enzyme for ISG15, an IFN-alpha/beta-induced ubiquitin-like protein Proc Natl Acad Sci USA 2004 101 20 7578 82 10.1073/pnas.0402528101 15131269 PMC419648 Zhao C, Beaudenon SL, Kelley ML, Waddell MB, Yuan W, Schulman BA, et al. The UbcH8 ubiquitin E2 enzyme is also the E2 enzyme for ISG15, an IFN-alpha/beta-induced ubiquitin-like protein. Proc Natl Acad Sci USA. 2004;101(20):7578–82. 15131269 10.1073/pnas.0402528101 PMC419648 40. Dastur A Beaudenon S Kelley M Krug RM Huibregtse JM Herc5, an interferon-induced HECT E3 enzyme, is required for conjugation of ISG15 in human cells J Biol Chem 2006 281 7 4334 8 10.1074/jbc.M512830200 16407192 Dastur A, Beaudenon S, Kelley M, Krug RM, Huibregtse JM. Herc5, an interferon-induced HECT E3 enzyme, is required for conjugation of ISG15 in human cells. J Biol Chem. 2006;281(7):4334–8. 16407192 10.1074/jbc.M512830200 41. Okumura F Zou W Zhang DE ISG15 modification of the eIF4E cognate 4EHP enhances cap structure-binding activity of 4EHP Genes Dev 2007 21 3 255 60 10.1101/gad.1521607 17289916 PMC1785121 Okumura F, Zou W, Zhang DE. ISG15 modification of the eIF4E cognate 4EHP enhances cap structure-binding activity of 4EHP. Genes Dev. 2007;21(3):255–60. 17289916 10.1101/gad.1521607 PMC1785121 42. Malakhova O Malakhov M Hetherington C Zhang DE Lipopolysaccharide activates the expression of ISG15-specific protease UBP43 via interferon regulatory factor 3 J Biol Chem 2002 277 17 14703 11 10.1074/jbc.M111527200 11854279 Malakhova O, Malakhov M, Hetherington C, Zhang DE. Lipopolysaccharide activates the expression of ISG15-specific protease UBP43 via interferon regulatory factor 3. J Biol Chem. 2002;277(17):14703–11. 11854279 10.1074/jbc.M111527200 43. Radoshevich L, Impens F, Ribet D, Quereda JJ, Nam Tham T, Nahori MA et al. ISG15 counteracts Listeria monocytogenes infection. Elife. 2015;4. 10.7554/eLife.06848 PMC4530601 26259872 44. Yeh YH Yang YC Hsieh MY Yeh YC Li TK A negative feedback of the HIF-1α pathway via interferon-stimulated gene 15 and isgylation Clin cancer Research: Official J Am Association Cancer Res 2013 19 21 5927 39 10.1158/1078-0432.CCR-13-0018 24056783 Yeh YH, Yang YC, Hsieh MY, Yeh YC, Li TK. A negative feedback of the HIF-1α pathway via interferon-stimulated gene 15 and isgylation. Clin cancer Research: Official J Am Association Cancer Res. 2013;19(21):5927–39. 10.1158/1078-0432.CCR-13-0018 24056783 45. Piccolis M Bond LM Kampmann M Pulimeno P Chitraju C Jayson CBK Probing the global cellular responses to lipotoxicity caused by saturated fatty acids Mol Cell 2019 74 1 32 e448 10.1016/j.molcel.2019.01.036 30846318 PMC7696670 Piccolis M, Bond LM, Kampmann M, Pulimeno P, Chitraju C, Jayson CBK, et al. Probing the global cellular responses to lipotoxicity caused by saturated fatty acids. Mol Cell. 2019;74(1):32–e448. 30846318 10.1016/j.molcel.2019.01.036 PMC7696670 46. Pollaci G, Gorla G, Potenza A, Carrozzini T, Canavero I, Bersano A et al. Novel multifaceted roles for RNF213 protein. Int J Mol Sci. 2022;23(9). 10.3390/ijms23094492 PMC9099590 35562882 47. Paumen MB Ishida Y Muramatsu M Yamamoto M Honjo T Inhibition of carnitine palmitoyltransferase I augments sphingolipid synthesis and palmitate-induced apoptosis J Biol Chem 1997 272 6 3324 9 10.1074/jbc.272.6.3324 9013572 Paumen MB, Ishida Y, Muramatsu M, Yamamoto M, Honjo T. Inhibition of carnitine palmitoyltransferase I augments sphingolipid synthesis and palmitate-induced apoptosis. J Biol Chem. 1997;272(6):3324–9. 9013572 10.1074/jbc.272.6.3324 48. Mineharu Y Miyamoto S RNF213 and GUCY1A3 in Moyamoya disease: key regulators of metabolism, inflammation, and vascular stability Front Neurol 2021 12 687088 10.3389/fneur.2021.687088 34381413 PMC8350054 Mineharu Y, Miyamoto S. RNF213 and GUCY1A3 in Moyamoya disease: key regulators of metabolism, inflammation, and vascular stability. Front Neurol. 2021;12:687088. 34381413 10.3389/fneur.2021.687088 PMC8350054 49. Mn W Jw LJ Ks H J R At T Use of SNP chips to detect rare pathogenic variants: retrospective, population based diagnostic evaluation BMJ (Clinical Res ed) 2021 372 n214 10.1136/bmj.n214 PMC7879796 33589468 Mn W, Jw LJ, Ks H, J R, At T. Use of SNP chips to detect rare pathogenic variants: retrospective, population based diagnostic evaluation. BMJ (Clinical Res ed). 2021;372:n214. 10.1136/bmj.n214 PMC7879796 33589468 50. Frietze LR Pan T Internal mRNA 2’-O-methyl mapping by nanopore sequencing and consequence on mRNA stability and role in cancer Mol Cell 2024 84 12 2215 7 10.1016/j.molcel.2024.05.020 38906112 Frietze LR, Pan T. Internal mRNA 2’-O-methyl mapping by nanopore sequencing and consequence on mRNA stability and role in cancer. Mol Cell. 2024;84(12):2215–7. 38906112 10.1016/j.molcel.2024.05.020 51. Ramarao-Milne P Kondrashova O Patch AM Nones K Koufariotis LT Newell F Comparison of actionable events detected in cancer genomes by whole-genome sequencing, in Silico whole-exome and mutation panels ESMO Open 2022 7 4 100540 10.1016/j.esmoop.2022.100540 35849877 PMC9463385 Ramarao-Milne P, Kondrashova O, Patch AM, Nones K, Koufariotis LT, Newell F, et al. Comparison of actionable events detected in cancer genomes by whole-genome sequencing, in Silico whole-exome and mutation panels. ESMO Open. 2022;7(4):100540. 35849877 10.1016/j.esmoop.2022.100540 PMC9463385 52. Masoodi T Siraj AK Siraj S Azam S Qadri Z Albalawy WN Whole-Exome sequencing of matched primary and metastatic papillary thyroid Cancer Thyroid: Official J Am Thyroid Association 2020 30 1 42 56 10.1089/thy.2019.0052 PMC6983753 31668133 Masoodi T, Siraj AK, Siraj S, Azam S, Qadri Z, Albalawy WN, et al. Whole-Exome sequencing of matched primary and metastatic papillary thyroid Cancer. Thyroid: Official J Am Thyroid Association. 2020;30(1):42–56. 10.1089/thy.2019.0052 PMC6983753 31668133 53. Barranco C Antisense oligonucleotide slows glioma growth Nat Rev Drug Discovery 2023 22 6 445 10.1038/d41573-023-00077-x 37165091 Barranco C. Antisense oligonucleotide slows glioma growth. Nat Rev Drug Discovery. 2023;22(6):445. 37165091 10.1038/d41573-023-00077-x 54. Ostrom QT Gittleman H Farah P Ondracek A Chen Y Wolinsky Y CBTRUS statistical report: primary brain and central nervous system tumors diagnosed in the united States in 2006–2010 Neurooncology 2013 15 Suppl 2 ii1 56 10.1093/neuonc/not151 PMC3798196 24137015 Ostrom QT, Gittleman H, Farah P, Ondracek A, Chen Y, Wolinsky Y, et al. CBTRUS statistical report: primary brain and central nervous system tumors diagnosed in the united States in 2006–2010. Neurooncology. 2013;15(Suppl 2):ii1–56. 10.1093/neuonc/not151 PMC3798196 24137015 55. Crunkhorn S Targeting drug-resistant glioblastoma Nat Rev Drug Discovery 2022 21 10 711 10.1038/d41573-022-00146-7 36045286 Crunkhorn S. Targeting drug-resistant glioblastoma. Nat Rev Drug Discovery. 2022;21(10):711. 36045286 10.1038/d41573-022-00146-7 56. Seoane J Escudero L Cerebrospinal fluid liquid biopsies for Medulloblastoma Nat Reviews Clin Oncol 2022 19 2 73 4 10.1038/s41571-021-00590-1 34912051 Seoane J, Escudero L. Cerebrospinal fluid liquid biopsies for Medulloblastoma. Nat Reviews Clin Oncol. 2022;19(2):73–4. 10.1038/s41571-021-00590-1 34912051 57. Klawinski DM Cottrell CE Schieffer KM Indyk JA Gandhi K Mardis ER Fatal brainstem injury following proton radiation in a patient with Medulloblastoma and a germline variant in RNF213 Pediatr Blood Cancer 2024 71 1 e30739 10.1002/pbc.30739 37877896 Klawinski DM, Cottrell CE, Schieffer KM, Indyk JA, Gandhi K, Mardis ER, et al. Fatal brainstem injury following proton radiation in a patient with Medulloblastoma and a germline variant in RNF213. Pediatr Blood Cancer. 2024;71(1):e30739. 37877896 10.1002/pbc.30739 58. Qin X Chen B Comprehensive analysis and validation reveal potential MYCN regulatory biomarkers associated with neuroblastoma prognosis J Biomol Struct Dyn 2023 41 18 8902 17 10.1080/07391102.2022.2138977 36300516 Qin X, Chen B. Comprehensive analysis and validation reveal potential MYCN regulatory biomarkers associated with neuroblastoma prognosis. J Biomol Struct Dyn. 2023;41(18):8902–17. 36300516 10.1080/07391102.2022.2138977 59. Wang X Ye M Wu M Fang H Xiao B Xie L RNF213 suppresses carcinogenesis in glioblastoma by affecting MAPK/JNK signaling pathway Clin Translational Oncology: Official Publication Federation Span Oncol Soc Natl Cancer Inst Mexico 2020 22 9 1506 16 10.1007/s12094-020-02286-x 31953610 Wang X, Ye M, Wu M, Fang H, Xiao B, Xie L, et al. RNF213 suppresses carcinogenesis in glioblastoma by affecting MAPK/JNK signaling pathway. Clin Translational Oncology: Official Publication Federation Span Oncol Soc Natl Cancer Inst Mexico. 2020;22(9):1506–16. 10.1007/s12094-020-02286-x 31953610 60. Chang LC Vural S Sonkin D Detection of homozygous deletions in tumor-suppressor genes ranging from dozen to hundreds nucleotides in cancer models Hum Mutat 2017 38 11 1449 53 10.1002/humu.23308 28762582 Chang LC, Vural S, Sonkin D. Detection of homozygous deletions in tumor-suppressor genes ranging from dozen to hundreds nucleotides in cancer models. Hum Mutat. 2017;38(11):1449–53. 28762582 10.1002/humu.23308 61. Zhou N Wei Z Qi Z Chen L Abscisic Acid-Induced autophagy selectively via MAPK/JNK signalling pathway in glioblastoma Cell Mol Neurobiol 2021 41 4 813 26 10.1007/s10571-020-00888-1 32577848 PMC7997842 Zhou N, Wei Z, Qi Z, Chen L. Abscisic Acid-Induced autophagy selectively via MAPK/JNK signalling pathway in glioblastoma. Cell Mol Neurobiol. 2021;41(4):813–26. 32577848 10.1007/s10571-020-00888-1 PMC7997842 62. Cui ZW Xie ZX Wang BF Zhong ZH Chen XY Sun YH Carvacrol protects neuroblastoma SH-SY5Y cells against Fe(2+)-induced apoptosis by suppressing activation of MAPK/JNK-NF-κB signaling pathway Acta Pharmacol Sin 2015 36 12 1426 36 10.1038/aps.2015.90 26592517 PMC4816236 Cui ZW, Xie ZX, Wang BF, Zhong ZH, Chen XY, Sun YH, et al. Carvacrol protects neuroblastoma SH-SY5Y cells against Fe(2+)-induced apoptosis by suppressing activation of MAPK/JNK-NF-κB signaling pathway. Acta Pharmacol Sin. 2015;36(12):1426–36. 26592517 10.1038/aps.2015.90 PMC4816236 63. Yang P Kang W Pan Y Zhao X Duan L Overexpression of HOXC6 promotes cell proliferation and migration via MAPK signaling and predicts a poor prognosis in glioblastoma Cancer Manage Res 2019 11 8167 79 10.2147/CMAR.S209904 PMC6731974 31564976 Yang P, Kang W, Pan Y, Zhao X, Duan L. Overexpression of HOXC6 promotes cell proliferation and migration via MAPK signaling and predicts a poor prognosis in glioblastoma. Cancer Manage Res. 2019;11:8167–79. 10.2147/CMAR.S209904 PMC6731974 31564976 64. Munoz L Yeung YT Grewal T Oncogenic Ras modulates p38 MAPK-mediated inflammatory cytokine production in glioblastoma cells Cancer Biol Ther 2016 17 4 355 63 10.1080/15384047.2016.1139249 26794430 PMC4910925 Munoz L, Yeung YT, Grewal T. Oncogenic Ras modulates p38 MAPK-mediated inflammatory cytokine production in glioblastoma cells. Cancer Biol Ther. 2016;17(4):355–63. 26794430 10.1080/15384047.2016.1139249 PMC4910925 65. Mantovani A Allavena P Sica A Balkwill F Cancer-related inflammation Nature 2008 454 7203 436 44 10.1038/nature07205 18650914 Mantovani A, Allavena P, Sica A, Balkwill F. Cancer-related inflammation. Nature. 2008;454(7203):436–44. 18650914 10.1038/nature07205 66. Sarkar P Thirumurugan K New insights into TNFα/PTP1B and PPARγ pathway through RNF213- a link between inflammation, obesity, insulin resistance, and Moyamoya disease Gene 2021 771 145340 10.1016/j.gene.2020.145340 33333224 Sarkar P, Thirumurugan K. New insights into TNFα/PTP1B and PPARγ pathway through RNF213- a link between inflammation, obesity, insulin resistance, and Moyamoya disease. Gene. 2021;771:145340. 33333224 10.1016/j.gene.2020.145340 67. Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries Cancer J Clin 2024 74 3 229 63 10.3322/caac.21834 38572751 Bray F, Laversanne M, Sung H, Ferlay J, Siegel RL, Soerjomataram I, et al. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. Cancer J Clin. 2024;74(3):229–63. 10.3322/caac.21834 38572751 68. Wolf AMD Oeffinger KC Shih TY Walter LC Church TR Fontham ETH Screening for lung cancer: 2023 guideline update from the American Cancer society Cancer J Clin 2024 74 1 50 81 10.3322/caac.21811 37909877 Wolf AMD, Oeffinger KC, Shih TY, Walter LC, Church TR, Fontham ETH, et al. Screening for lung cancer: 2023 guideline update from the American Cancer society. Cancer J Clin. 2024;74(1):50–81. 10.3322/caac.21811 37909877 69. Jiang N Zhou J Zhang W Li P Liu Y Shi H RNF213 gene mutation in Circulating tumor DNA detected by targeted next-generation sequencing in the assisted discrimination of early-stage lung cancer from pulmonary nodules Thorac cancer 2021 12 2 181 93 10.1111/1759-7714.13741 33200540 PMC7812078 Jiang N, Zhou J, Zhang W, Li P, Liu Y, Shi H, et al. RNF213 gene mutation in Circulating tumor DNA detected by targeted next-generation sequencing in the assisted discrimination of early-stage lung cancer from pulmonary nodules. Thorac cancer. 2021;12(2):181–93. 33200540 10.1111/1759-7714.13741 PMC7812078 70. Wu Y, Yuan Y, Xu H, Zhang W, Ning A, Li S et al. Crosstalk among alternative polyadenylation, genetic variants and ubiquitin modification contribute to lung adenocarcinoma risk. 2024;25(15):8084. 10.3390/ijms25158084 PMC11311407 39125654 71. Siegel RL Miller KD Jemal A Cancer statistics, 2020 Cancer J Clin 2020 70 1 7 30 10.3322/caac.21590 31912902 Siegel RL, Miller KD, Jemal A. Cancer statistics, 2020. Cancer J Clin. 2020;70(1):7–30. 10.3322/caac.21590 31912902 72. Zekri A-RN Mansour O Loutfy SA Hafez MM Gomaa M Bahnassy A Abstract 4243: genetic variants frequently detected in Egyptian breast cancer tumors: comprehensive cancer panel by ion torrent DNA sequencing technology Cancer Res 2019 79 13Supplement 4243 10.1158/1538-7445.AM2019-4243 Zekri A-RN, Mansour O, Loutfy SA, Hafez MM, Gomaa M, Bahnassy A, et al. Abstract 4243: genetic variants frequently detected in Egyptian breast cancer tumors: comprehensive cancer panel by ion torrent DNA sequencing technology. Cancer Res. 2019;79(13Supplement):4243. 73. Gao T Li JZ Lu Y Zhang CY Li Q Mao J The mechanism between epithelial mesenchymal transition in breast cancer and hypoxia microenvironment Biomed pharmacotherapy = Biomedecine Pharmacotherapie 2016 80 393 405 10.1016/j.biopha.2016.02.044 27133080 Gao T, Li JZ, Lu Y, Zhang CY, Li Q, Mao J, et al. The mechanism between epithelial mesenchymal transition in breast cancer and hypoxia microenvironment. Biomed pharmacotherapy = Biomedecine Pharmacotherapie. 2016;80:393–405. 10.1016/j.biopha.2016.02.044 27133080 74. Bertout JA Patel SA Simon MC The impact of O2 availability on human cancer Nat Rev Cancer 2008 8 12 967 75 10.1038/nrc2540 18987634 PMC3140692 Bertout JA, Patel SA, Simon MC. The impact of O2 availability on human cancer. Nat Rev Cancer. 2008;8(12):967–75. 18987634 10.1038/nrc2540 PMC3140692 75. Laplante M Sabatini DM mTOR signaling in growth control and disease Cell 2012 149 2 274 93 10.1016/j.cell.2012.03.017 22500797 PMC3331679 Laplante M, Sabatini DM. mTOR signaling in growth control and disease. Cell. 2012;149(2):274–93. 22500797 10.1016/j.cell.2012.03.017 PMC3331679 76. Garcia Garcia CJ Huang Y Fuentes NR Turner MC Monberg ME Lin D Stromal HIF2 regulates immune suppression in the pancreatic Cancer microenvironment Gastroenterology 2022 162 7 2018 31 10.1053/j.gastro.2022.02.024 35216965 PMC9278556 Garcia Garcia CJ, Huang Y, Fuentes NR, Turner MC, Monberg ME, Lin D, et al. Stromal HIF2 regulates immune suppression in the pancreatic Cancer microenvironment. Gastroenterology. 2022;162(7):2018–31. 35216965 10.1053/j.gastro.2022.02.024 PMC9278556 77. Zhao Q Zheng K Ma C Li J Zhuo L Huang W PTPS facilitates compartmentalized LTBP1 S-Nitrosylation and promotes tumor growth under hypoxia Mol Cell 2020 77 1 95 e1075 10.1016/j.molcel.2019.09.018 31628042 Zhao Q, Zheng K, Ma C, Li J, Zhuo L, Huang W, et al. PTPS facilitates compartmentalized LTBP1 S-Nitrosylation and promotes tumor growth under hypoxia. Mol Cell. 2020;77(1):95–e1075. 31628042 10.1016/j.molcel.2019.09.018 78. Minassian LM Cotechini T Huitema E Graham CH Hypoxia-Induced resistance to chemotherapy in Cancer Adv Exp Med Biol 2019 1136 123 39 10.1007/978-3-030-12734-3_9 31201721 Minassian LM, Cotechini T, Huitema E, Graham CH. Hypoxia-Induced resistance to chemotherapy in Cancer. Adv Exp Med Biol. 2019;1136:123–39. 31201721 10.1007/978-3-030-12734-3_9 79. Godet I Mamo M Thurnheer A Rosen DM Gilkes DM Post-Hypoxic cells promote metastatic recurrence after chemotherapy treatment in TNBC Cancers 2021 13 21 10.3390/cancers13215509 PMC8583122 34771673 Godet I, Mamo M, Thurnheer A, Rosen DM, Gilkes DM. Post-Hypoxic cells promote metastatic recurrence after chemotherapy treatment in TNBC. Cancers. 2021;13:21. 10.3390/cancers13215509 PMC8583122 34771673 80. Khator R, Biharee A, Bhatia N, Kulkarni S, Singh Y, Karthikeyan C, et al. Medicinal aspects of PTP 1B inhibitors as anti-Breast Cancer agents: an overview. Curr Med Chem; 2023. 10.2174/0929867331666230914103645 37711015 81. Kuiper C Vissers MC Ascorbate as a co-factor for fe- and 2-oxoglutarate dependent dioxygenases: physiological activity in tumor growth and progression Front Oncol 2014 4 359 10.3389/fonc.2014.00359 25540771 PMC4261134 Kuiper C, Vissers MC. Ascorbate as a co-factor for fe- and 2-oxoglutarate dependent dioxygenases: physiological activity in tumor growth and progression. Front Oncol. 2014;4:359. 25540771 10.3389/fonc.2014.00359 PMC4261134 82. Liu ZX Zhang XL Zhao Q Chen Y Sheng H He CY Whole-Exome sequencing among Chinese patients with hereditary diffuse gastric Cancer JAMA Netw Open 2022 5 12 e2245836 10.1001/jamanetworkopen.2022.45836 36484990 PMC9856492 Liu ZX, Zhang XL, Zhao Q, Chen Y, Sheng H, He CY, et al. Whole-Exome sequencing among Chinese patients with hereditary diffuse gastric Cancer. JAMA Netw Open. 2022;5(12):e2245836. 36484990 10.1001/jamanetworkopen.2022.45836 PMC9856492 83. Vlenterie M Hillebrandt-Roeffen MH Flucke UE Groenen PJ Tops BB Kamping EJ Next generation sequencing in synovial sarcoma reveals novel gene mutations Oncotarget 2015 6 33 34680 90 10.18632/oncotarget.5786 26415226 PMC4741482 Vlenterie M, Hillebrandt-Roeffen MH, Flucke UE, Groenen PJ, Tops BB, Kamping EJ, et al. Next generation sequencing in synovial sarcoma reveals novel gene mutations. Oncotarget. 2015;6(33):34680–90. 26415226 10.18632/oncotarget.5786 PMC4741482 84. Kishida Y Oishi T Sugino T Shiomi A Urakami K Kusuhara M Associations between loss of ARID1A expression and clinicopathologic and genetic variables in T1 early colorectal Cancer Am J Clin Pathol 2019 152 4 463 70 10.1093/ajcp/aqz062 31263894 Kishida Y, Oishi T, Sugino T, Shiomi A, Urakami K, Kusuhara M, et al. Associations between loss of ARID1A expression and clinicopathologic and genetic variables in T1 early colorectal Cancer. Am J Clin Pathol. 2019;152(4):463–70. 31263894 10.1093/ajcp/aqz062 85. Rawal RM Joshi MN Bhargava P Shaikh I Pandit AS Patel RP Tobacco habituated and non-habituated subjects exhibit different mutational spectrums in head and neck squamous cell carcinoma 3 Biotech 2015 5 5 685 96 10.1007/s13205-014-0267-0 28324520 PMC4569615 Rawal RM, Joshi MN, Bhargava P, Shaikh I, Pandit AS, Patel RP, et al. Tobacco habituated and non-habituated subjects exhibit different mutational spectrums in head and neck squamous cell carcinoma. 3 Biotech. 2015;5(5):685–96. 28324520 10.1007/s13205-014-0267-0 PMC4569615 86. Er TK Su YF Wu CC Chen CC Wang J Hsieh TH Targeted next-generation sequencing for molecular diagnosis of endometriosis-associated ovarian cancer J Mol Med 2016 94 7 835 47 10.1007/s00109-016-1395-2 26920370 Er TK, Su YF, Wu CC, Chen CC, Wang J, Hsieh TH, et al. Targeted next-generation sequencing for molecular diagnosis of endometriosis-associated ovarian cancer. J Mol Med. 2016;94(7):835–47. 26920370 10.1007/s00109-016-1395-2 87. Kowalik A Wincewicz A Zięba S Baran W Kopczyński J Koda M Analysis of mutations of PARP1, RNF213, PAX8, KMT2C, MTRR in malignant mesothelioma of testicular tunica vaginalis testis Pol J Pathology: Official J Pol Soc Pathologists 2020 71 1 69 74 10.5114/pjp.2020.95418 32429658 Kowalik A, Wincewicz A, Zięba S, Baran W, Kopczyński J, Koda M, et al. Analysis of mutations of PARP1, RNF213, PAX8, KMT2C, MTRR in malignant mesothelioma of testicular tunica vaginalis testis. Pol J Pathology: Official J Pol Soc Pathologists. 2020;71(1):69–74. 10.5114/pjp.2020.95418 32429658 88. Li X Xu W Kang W Wong SH Wang M Zhou Y Genomic analysis of liver cancer unveils novel driver genes and distinct prognostic features Theranostics 2018 8 6 1740 51 10.7150/thno.22010 29556353 PMC5858179 Li X, Xu W, Kang W, Wong SH, Wang M, Zhou Y, et al. Genomic analysis of liver cancer unveils novel driver genes and distinct prognostic features. Theranostics. 2018;8(6):1740–51. 29556353 10.7150/thno.22010 PMC5858179 89. van der Krogt JA Bempt MV Ferreiro JF Mentens N Jacobs K Pluys U Anaplastic lymphoma kinase-positive anaplastic large cell lymphoma with the variant RNF213-, ATIC- and TPM3-ALK fusions is characterized by copy number gain of the rearranged ALK gene Haematologica 2017 102 9 1605 16 10.3324/haematol.2016.146571 28659337 PMC5685221 van der Krogt JA, Bempt MV, Ferreiro JF, Mentens N, Jacobs K, Pluys U, et al. Anaplastic lymphoma kinase-positive anaplastic large cell lymphoma with the variant RNF213-, ATIC- and TPM3-ALK fusions is characterized by copy number gain of the rearranged ALK gene. Haematologica. 2017;102(9):1605–16. 28659337 10.3324/haematol.2016.146571 PMC5685221 90. Kowalik A Wincewicz A Ossoliński K Zięba S Kopczyński J Ossoliński T Review on significance of GDNF, PTCH1 and RNF213 in chromophobe renal cell carcinoma illustrated by the case of 71-years-old man Pol J Pathology: Official J Pol Soc Pathologists 2020 71 3 195 9 10.5114/pjp.2020.99785 33112109 Kowalik A, Wincewicz A, Ossoliński K, Zięba S, Kopczyński J, Ossoliński T, et al. Review on significance of GDNF, PTCH1 and RNF213 in chromophobe renal cell carcinoma illustrated by the case of 71-years-old man. Pol J Pathology: Official J Pol Soc Pathologists. 2020;71(3):195–9. 10.5114/pjp.2020.99785 33112109 91. Vettore AL Ramnarayanan K Poore G Lim K Ong CK Huang KK Mutational landscapes of tongue carcinoma reveal recurrent mutations in genes of therapeutic and prognostic relevance Genome Med 2015 7 1 98 10.1186/s13073-015-0219-2 26395002 PMC4580363 Vettore AL, Ramnarayanan K, Poore G, Lim K, Ong CK, Huang KK, et al. Mutational landscapes of tongue carcinoma reveal recurrent mutations in genes of therapeutic and prognostic relevance. Genome Med. 2015;7(1):98. 26395002 10.1186/s13073-015-0219-2 PMC4580363 92. Chiablaem K Jinawath A Nuanpirom J Arora JK Nasaree S Thanomchard T Identification of RNF213 as a potential suppressor of local invasion in intrahepatic cholangiocarcinoma. Laboratory investigation J Tech Methods Pathol 2024 104 7 102074 10.1016/j.labinv.2024.102074 38723854 Chiablaem K, Jinawath A, Nuanpirom J, Arora JK, Nasaree S, Thanomchard T, et al. Identification of RNF213 as a potential suppressor of local invasion in intrahepatic cholangiocarcinoma. Laboratory investigation. J Tech Methods Pathol. 2024;104(7):102074. 10.1016/j.labinv.2024.102074 38723854 93. Seton-Rogers S Genomic instability: the Sting of metastasis Nat Rev Cancer 2018 18 3 137 10.1038/nrc.2018.16 29467525 Seton-Rogers S. Genomic instability: the Sting of metastasis. Nat Rev Cancer. 2018;18(3):137. 29467525 10.1038/nrc.2018.16 94. Hanahan D Weinberg RA Hallmarks of cancer: the next generation Cell 2011 144 5 646 74 10.1016/j.cell.2011.02.013 21376230 Hanahan D, Weinberg RA. Hallmarks of cancer: the next generation. Cell. 2011;144(5):646–74. 21376230 10.1016/j.cell.2011.02.013 95. Lu R Dou X Gao X Zhang J Ni J Guo L A functional polymorphism of lymphotoxin-alpha (LTA) gene rs909253 is associated with gastric cancer risk in an Asian population Cancer Epidemiol 2012 36 6 e380 6 10.1016/j.canep.2012.05.014 22748850 Lu R, Dou X, Gao X, Zhang J, Ni J, Guo L. A functional polymorphism of lymphotoxin-alpha (LTA) gene rs909253 is associated with gastric cancer risk in an Asian population. Cancer Epidemiol. 2012;36(6):e380–6. 22748850 10.1016/j.canep.2012.05.014 96. Cuceu C, Colicchio B, Jeandidier E, Junker S, Plassa F, Shim G et al. Independent mechanisms lead to genomic instability in hodgkin lymphoma: microsatellite or chromosomal instability (†). Cancers. 2018;10(7). 10.3390/cancers10070233 PMC6071189 30011886 97. Yi Q, Chen Q, Liang C, Yan H, Zhang Z, Xiang X et al. HP1 links centromeric heterochromatin to centromere cohesion in mammals. EMBO Rep. 2018;19(4). 10.15252/embr.201745484 PMC5891435 29491004 98. Hitomi T Habu T Kobayashi H Okuda H Harada KH Osafune K Downregulation of securin by the variant RNF213 R4810K (rs112735431, G > A) reduces angiogenic activity of induced pluripotent stem cell-derived vascular endothelial cells from Moyamoya patients Biochem Biophys Res Commun 2013 438 1 13 9 10.1016/j.bbrc.2013.07.004 23850618 Hitomi T, Habu T, Kobayashi H, Okuda H, Harada KH, Osafune K, et al. Downregulation of securin by the variant RNF213 R4810K (rs112735431, G > A) reduces angiogenic activity of induced pluripotent stem cell-derived vascular endothelial cells from Moyamoya patients. Biochem Biophys Res Commun. 2013;438(1):13–9. 23850618 10.1016/j.bbrc.2013.07.004 99. Daum JR Wren JD Daniel JJ Sivakumar S McAvoy JN Potapova TA Ska3 is required for spindle checkpoint Silencing and the maintenance of chromosome cohesion in mitosis Curr Biology: CB 2009 19 17 1467 72 10.1016/j.cub.2009.07.017 19646878 PMC2783354 Daum JR, Wren JD, Daniel JJ, Sivakumar S, McAvoy JN, Potapova TA, et al. Ska3 is required for spindle checkpoint Silencing and the maintenance of chromosome cohesion in mitosis. Curr Biology: CB. 2009;19(17):1467–72. 19646878 10.1016/j.cub.2009.07.017 PMC2783354 100. Holt LJ Krutchinsky AN Morgan DO Positive feedback sharpens the anaphase switch Nature 2008 454 7202 353 7 10.1038/nature07050 18552837 PMC2636747 Holt LJ, Krutchinsky AN, Morgan DO. Positive feedback sharpens the anaphase switch. Nature. 2008;454(7202):353–7. 18552837 10.1038/nature07050 PMC2636747 101. Hitomi T Habu T Kobayashi H Okuda H Harada KH Osafune K The Moyamoya disease susceptibility variant RNF213 R4810K (rs112735431) induces genomic instability by mitotic abnormality Biochem Biophys Res Commun 2013 439 4 419 26 10.1016/j.bbrc.2013.08.067 23994138 Hitomi T, Habu T, Kobayashi H, Okuda H, Harada KH, Osafune K, et al. The Moyamoya disease susceptibility variant RNF213 R4810K (rs112735431) induces genomic instability by mitotic abnormality. Biochem Biophys Res Commun. 2013;439(4):419–26. 23994138 10.1016/j.bbrc.2013.08.067 102. Kashyap MP Sinha R Mukhtar MS Athar M Epigenetic regulation in the pathogenesis of non-melanoma skin cancer Sem Cancer Biol 2022 83 36 56 10.1016/j.semcancer.2020.11.009 33242578 Kashyap MP, Sinha R, Mukhtar MS, Athar M. Epigenetic regulation in the pathogenesis of non-melanoma skin cancer. Sem Cancer Biol. 2022;83:36–56. 10.1016/j.semcancer.2020.11.009 33242578 103. Fujimura M Fujimura T Kakizaki A Sato-Maeda M Niizuma K Tomata Y Increased serum production of soluble CD163 and CXCL5 in patients with Moyamoya disease: involvement of intrinsic immune reaction in its pathogenesis Brain Res 2018 1679 39 44 10.1016/j.brainres.2017.11.013 29174692 Fujimura M, Fujimura T, Kakizaki A, Sato-Maeda M, Niizuma K, Tomata Y, et al. Increased serum production of soluble CD163 and CXCL5 in patients with Moyamoya disease: involvement of intrinsic immune reaction in its pathogenesis. Brain Res. 2018;1679:39–44. 29174692 10.1016/j.brainres.2017.11.013 104. Schmidt DR Patel R Kirsch DG Lewis CA Vander Heiden MG Locasale JW Metabolomics in cancer research and emerging applications in clinical oncology Cancer J Clin 2021 71 4 333 58 10.3322/caac.21670 PMC8298088 33982817 Schmidt DR, Patel R, Kirsch DG, Lewis CA, Vander Heiden MG, Locasale JW. Metabolomics in cancer research and emerging applications in clinical oncology. Cancer J Clin. 2021;71(4):333–58. 10.3322/caac.21670 PMC8298088 33982817 105. Finley LWS What is cancer metabolism? Cell 2023 186 8 1670 88 10.1016/j.cell.2023.01.038 36858045 PMC10106389 Finley LWS. What is cancer metabolism? Cell. 2023;186(8):1670–88. 36858045 10.1016/j.cell.2023.01.038 PMC10106389 106. Martínez-Reyes I Chandel NS Cancer metabolism: looking forward Nat Rev Cancer 2021 21 10 669 80 10.1038/s41568-021-00378-6 34272515 Martínez-Reyes I, Chandel NS. Cancer metabolism: looking forward. Nat Rev Cancer. 2021;21(10):669–80. 34272515 10.1038/s41568-021-00378-6 107. Ohkubo K Sakai Y Inoue H Akamine S Ishizaki Y Matsushita Y Moyamoya disease susceptibility gene RNF213 links inflammatory and angiogenic signals in endothelial cells Sci Rep 2015 5 13191 10.1038/srep13191 26278786 PMC4538604 Ohkubo K, Sakai Y, Inoue H, Akamine S, Ishizaki Y, Matsushita Y, et al. Moyamoya disease susceptibility gene RNF213 links inflammatory and angiogenic signals in endothelial cells. Sci Rep. 2015;5:13191. 26278786 10.1038/srep13191 PMC4538604 108. Choi JW Son SM Mook-Jung I Moon YJ Lee JY Wang KC Mitochondrial abnormalities related to the dysfunction of Circulating endothelial colony-forming cells in Moyamoya disease J Neurosurg 2018 129 5 1151 9 10.3171/2017.5.JNS17147 29219755 Choi JW, Son SM, Mook-Jung I, Moon YJ, Lee JY, Wang KC, et al. Mitochondrial abnormalities related to the dysfunction of Circulating endothelial colony-forming cells in Moyamoya disease. J Neurosurg. 2018;129(5):1151–9. 29219755 10.3171/2017.5.JNS17147 109. Sugihara M Morito D Ainuki S Hirano Y Ogino K Kitamura A The AAA + ATPase/ubiquitin ligase mysterin stabilizes cytoplasmic lipid droplets J Cell Biol 2019 218 3 949 60 10.1083/jcb.201712120 30705059 PMC6400562 Sugihara M, Morito D, Ainuki S, Hirano Y, Ogino K, Kitamura A, et al. The AAA + ATPase/ubiquitin ligase mysterin stabilizes cytoplasmic lipid droplets. J Cell Biol. 2019;218(3):949–60. 30705059 10.1083/jcb.201712120 PMC6400562 110. Shao J Shi T Yu H Ding Y Li L Wang X Cytosolic GDH1 degradation restricts protein synthesis to sustain tumor cell survival following amino acid deprivation EMBO J 2021 40 20 e107480 10.15252/embj.2020107480 34269483 PMC8521317 Shao J, Shi T, Yu H, Ding Y, Li L, Wang X, et al. Cytosolic GDH1 degradation restricts protein synthesis to sustain tumor cell survival following amino acid deprivation. EMBO J. 2021;40(20):e107480. 34269483 10.15252/embj.2020107480 PMC8521317 111. Güleç Taşkıran AE Karaoğlu DA Eylem CC Ermiş Ç Güderer İ Nemutlu E Glutamine withdrawal leads to the Preferential activation of lipid metabolism in metastatic colorectal cancer Translational Oncol 2024 48 102078 10.1016/j.tranon.2024.102078 PMC11362781 39111172 Güleç Taşkıran AE, Karaoğlu DA, Eylem CC, Ermiş Ç, Güderer İ, Nemutlu E, et al. Glutamine withdrawal leads to the Preferential activation of lipid metabolism in metastatic colorectal cancer. Translational Oncol. 2024;48:102078. 10.1016/j.tranon.2024.102078 PMC11362781 39111172 112. De Martino M, Rathmell JC, Galluzzi L, Vanpouille-Box C. Cancer cell metabolism and antitumour immunity. Nat Rev Immunol. 2024. 10.1038/s41577-024-01026-4 PMC11365797 38649722 113. Certo M Tsai CH Pucino V Ho PC Mauro C Lactate modulation of immune responses in inflammatory versus tumour microenvironments Nat Rev Immunol 2021 21 3 151 61 10.1038/s41577-020-0406-2 32839570 Certo M, Tsai CH, Pucino V, Ho PC, Mauro C. Lactate modulation of immune responses in inflammatory versus tumour microenvironments. Nat Rev Immunol. 2021;21(3):151–61. 32839570 10.1038/s41577-020-0406-2 114. Kroemer G McQuade JL Merad M André F Zitvogel L Bodywide ecological interventions on cancer Nat Med 2023 29 1 59 74 10.1038/s41591-022-02193-4 36658422 Kroemer G, McQuade JL, Merad M, André F, Zitvogel L. Bodywide ecological interventions on cancer. Nat Med. 2023;29(1):59–74. 36658422 10.1038/s41591-022-02193-4 115. Yang Z, Su W, Wei X, Pan Y, Xing M, Niu L et al. Hypoxia inducible factor-1α drives cancer resistance to Cuproptosis. Cancer Cell. 2025. 10.1016/j.ccell.2025.02.015 40054467 116. Dong Z Liu Y Wang C Hao Y Fan Q Yang Z Tumor microenvironment modulating CaCO(3) -Based colloidosomal microreactors can generally reinforce cancer immunotherapy. Advanced materials (Deerfield beach Fla) 2024 36 9 e2308254 10.1002/adma.202308254 37918820 Dong Z, Liu Y, Wang C, Hao Y, Fan Q, Yang Z, et al. Tumor microenvironment modulating CaCO(3) -Based colloidosomal microreactors can generally reinforce cancer immunotherapy. Advanced materials (Deerfield beach. Fla). 2024;36(9):e2308254. 10.1002/adma.202308254 37918820 117. Arner EN Rathmell JC Metabolic programming and immune suppression in the tumor microenvironment Cancer Cell 2023 41 3 421 33 10.1016/j.ccell.2023.01.009 36801000 PMC10023409 Arner EN, Rathmell JC. Metabolic programming and immune suppression in the tumor microenvironment. Cancer Cell. 2023;41(3):421–33. 36801000 10.1016/j.ccell.2023.01.009 PMC10023409 118. Luo YW Fang Y Zeng HX Ji YC Wu MZ Li H HIF1α counteracts TGFβ1-Driven TSP1 expression in endothelial cells to stimulate angiogenesis in the hypoxic tumor microenvironment Cancer Res 2025 85 1 69 83 10.1158/0008-5472.CAN-24-2324 39356626 Luo YW, Fang Y, Zeng HX, Ji YC, Wu MZ, Li H, et al. HIF1α counteracts TGFβ1-Driven TSP1 expression in endothelial cells to stimulate angiogenesis in the hypoxic tumor microenvironment. Cancer Res. 2025;85(1):69–83. 39356626 10.1158/0008-5472.CAN-24-2324 119. Neel BG Bhardwaj A Antonelli M Ueberheide B Abstract LB052: PTP1B inhibitors activate a novel hypoxia-induced inflammatory cell death pathway in breast cancer Cancer Res 2024 84 7Supplement LB052 LB 10.1158/1538-7445.AM2024-LB052 Neel BG, Bhardwaj A, Antonelli M, Ueberheide B. Abstract LB052: PTP1B inhibitors activate a novel hypoxia-induced inflammatory cell death pathway in breast cancer. Cancer Res. 2024;84(7Supplement):LB052–LB. 120. Yang X Zhu X Sheng J Fu Y Nie D You X RNF213 promotes Treg cell differentiation by facilitating K63-linked ubiquitination and nuclear translocation of FOXO1 Nat Commun 2024 15 1 5961 10.1038/s41467-024-50392-z 39013878 PMC11252262 Yang X, Zhu X, Sheng J, Fu Y, Nie D, You X, et al. RNF213 promotes Treg cell differentiation by facilitating K63-linked ubiquitination and nuclear translocation of FOXO1. Nat Commun. 2024;15(1):5961. 39013878 10.1038/s41467-024-50392-z PMC11252262 121. Kanoke A Fujimura M Niizuma K Fujimura T Kakizaki A Ito A Temporal profile of magnetic resonance angiography and decreased ratio of regulatory T cells after immunological adjuvant administration to mice lacking RNF213, a susceptibility gene for Moyamoya disease Brain Res 2016 1642 1 9 10.1016/j.brainres.2016.03.009 26972532 Kanoke A, Fujimura M, Niizuma K, Fujimura T, Kakizaki A, Ito A, et al. Temporal profile of magnetic resonance angiography and decreased ratio of regulatory T cells after immunological adjuvant administration to mice lacking RNF213, a susceptibility gene for Moyamoya disease. Brain Res. 2016;1642:1–9. 26972532 10.1016/j.brainres.2016.03.009 122. Tashiro R Niizuma K Kasamatsu J Okuyama Y Rashad S Kikuchi A Dysregulation of Rnf 213 gene contributes to T cell response via antigen uptake, processing, and presentation J Cell Physiol 2021 236 11 7554 64 10.1002/jcp.30396 33973242 Tashiro R, Niizuma K, Kasamatsu J, Okuyama Y, Rashad S, Kikuchi A, et al. Dysregulation of Rnf 213 gene contributes to T cell response via antigen uptake, processing, and presentation. J Cell Physiol. 2021;236(11):7554–64. 33973242 10.1002/jcp.30396 123. Banh RS Iorio C Marcotte R Xu Y Cojocari D Rahman AA Abstract LB-302: PTP1B regulates the Moyamoya disease-associated E3 ligase, RNF213 and cellular dioxygenase activity to allow breast tumor survival in hypoxia Cancer Res 2015 75 15Supplement LB 302 Banh RS, Iorio C, Marcotte R, Xu Y, Cojocari D, Rahman AA, et al. Abstract LB-302: PTP1B regulates the Moyamoya disease-associated E3 ligase, RNF213 and cellular dioxygenase activity to allow breast tumor survival in hypoxia. Cancer Res. 2015;75(15Supplement):LB–302. ",
  "metadata": {
    "Title of this paper": "Abstract LB-302: PTP1B regulates the Moyamoya disease-associated E3 ligase, RNF213 and cellular dioxygenase activity to allow breast tumor survival in hypoxia",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480345/"
  }
}