{
  "title": "Paper_750",
  "abstract": "Nan Fang Yi Ke Da Xue Xue Bao Nan Fang Yi Ke Da Xue Xue Bao 3701 jsouthmed nfykdxxb Journal of Southern Medical University 1673-4254 2663-0842 Editorial Department of Journal of Southern Medical University PMC12479263 PMC12479263.1 12479263 12479263 41022614 10.12122/j.issn.1673-4254.2025.09.24 1673-4254(2025)09-2046-09 1 Research Article 细胞外囊泡在神经系统疾病中的治疗潜力 Therapeutic potential of extracellular vesicles in neurological diseases 杜 庆锋 DU Qingfeng 1 2 杨 超 YANG Chao 3 夏 雪晴 XIA Xueqing 1 王 婷 WANG Ting 1 2  1 南方医科大学中医药学院 广东 广州 510515  1 School of Traditional Chinese Medicine, Southern Medical University Guangzhou 510515 China  2 南方医科大学中西医结合医院 广东 广州 510315  2 Department of General Practice, Southern Medical University Hospital of Integrated Traditional Chinese and Western Medicine, Southern Medical University Guangzhou 510315 China  3 中国人民解放军南部战区总医院 广东 广州 510010  3 General Hospital of Southern Theatre Command Guangzhou 510010 China 余 诗诗 王 婷 397174763@qq.com  杜庆锋 dqf1689@smu.edu.cn 20 9 2025 45 9 497824 2046 2054 02 1 2025 20 09 2025 01 10 2025 01 10 2025 2025 版权所有©《南方医科大学学报》编辑部2021 Copyright ©2021 Journal of Southern Medical University. All rights reserved. 细胞外囊泡（EVs）是由生物体主动释放到细胞外环境的纳米级脂质双层囊泡，富含特定的生物活性物质，如蛋白质、遗传物质和脂质等。由于这些囊泡参与细胞间相互作用，并且能透过血脑屏障，它们可能是治疗神经系统疾病的重要生物物质。在本文中，我们介绍了EVs生物起源及在神经系统疾病中治疗的潜力，并着重阐述了基于EVs在中药中治疗神经系统疾病的可能性，最后讨论了EVs治疗神经系统疾病研究领域的挑战和前景。 Extracellular vesicles (EVs), nanoscale lipid bilayer vesicles actively secreted by organisms into the extracellular environment, are rich in specific bioactive substances, such as proteins, genetic materials and lipids. These vesicles are involved in intercellular interactions and can pass through the blood-brain barrier, and may thus potentially serve as important biological substances for treatment of neurological diseases. In this review, we summarize the biological origin of EVs and their therapeutic potential in neurological diseases, expound the possibility of EV-based treatment of neurological diseases using traditional Chinese medicine, and discuss the challenges and prospects of researches of EVs for the treating neurological diseases. 细胞外囊泡 神经系统疾病 治疗 载药疗法 extracellular vesicles neurological disorders treatment medicated therapy 国家高水平中医药重点学科建设项目 ZYYZDXK-2023152 广东省医学科学技术研究基金项目 A2024076 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "细胞外囊泡在神经系统疾病中的治疗潜力",
    "Journal it was published in:": "Journal of Southern Medical University",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479263/"
  }
}