{
  "title": "Paper_1158",
  "abstract": "pmc Plants (Basel) Plants (Basel) 2909 plants plants Plants 2223-7747 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473280 PMC12473280.1 12473280 12473280 41011973 10.3390/plants14182821 plants-14-02821 1 Review Sustainable Production of Ginsenosides: Advances in Biosynthesis and Metabolic Engineering Xue Yang 1 † https://orcid.org/0009-0003-7234-5040 Zhang Ruixiang 1 † https://orcid.org/0000-0002-7860-5638 Li Tie 1 Deng Qindi 1 https://orcid.org/0009-0007-3007-0295 Luo Weidong 1 Chang Ruyue 1 https://orcid.org/0000-0002-0925-079X Zeng Dongchang 2 Tan Jiantao 3 Sun Tianhu 4 Liu Yao-Guang 1 Xiang Yang 5 * https://orcid.org/0000-0001-7622-6450 Zhu Qinlong 1 * https://orcid.org/0000-0002-9155-8960 Chai Nan 1 * Lidon Fernando Academic Editor 1 2 3 4 5 * xiangyangcell@126.com zhuql@scau.edu.cn chainan@scau.edu.cn † These authors contributed equally to the work. 09 9 2025 9 2025 14 18 497669 2821 24 7 2025 01 9 2025 06 9 2025 09 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Ginsenosides, the primary bioactive components of Panax ginseng ginseng Saccharomyces cerevisiae Escherichia coli ginsenoside biosynthesis synthetic biology sustainable production plant chassis ginsenosides natural products National Natural Science Foundation of China 32272120 Guangxi Science and Technology Major Project GKAA24206023 National Key Research and Development Program of China 2024YFF1000800 Scientific and Technological Key Program of Guizhou province Qiankehezhicheng [2022] Key 031 Guangdong Basic Research Center of Excellence for Precise Breeding of Future Crops Major Project FCBRCE-202502 FCBRCE-202504 This research was supported by grants from the National Natural Science Foundation of China (32272120), Guangxi Science and Technology Major Project (GKAA24206023), the National Key Research and Development Program of China (2024YFF1000800), the Scientific and Technological Key Program of Guizhou province (No. Qiankehezhicheng [2022] Key 031) and the Guangdong Basic Research Center of Excellence for Precise Breeding of Future Crops Major Project (FCBRCE-202502, FCBRCE-202504). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Asian ginseng Panax ginseng ginseng 1 Panax 1 2 ginseng ginseng Panax ginseng 3 4 5 1 1 1 2 3 4 6 6 1 7 8 Panax 9 10 11 Traditional ginseng ginseng 12 13 ginseng ginseng ginseng 11 14 Synthetic biology presents opportunities for sustainable ginsenoside production. Current research priorities include metabolic pathway engineering to increase target metabolite yields and synthetic biology-based production platforms. Advances in ginsenoside pathway elucidation, transcriptional network regulation, and microbial chassis development have established essential knowledge for biosynthesizing ginsenosides and their analogs by metabolic engineering, enabling yield optimization by artificial pathway control in heterologous hosts. This review comprehensively documents state-of-the-art technologies and innovative approaches in ginsenoside biosynthesis research. It examines recent progress in ginsenoside biosynthesis pathways, critical enzyme genes, transcriptional regulation, and microbial cell engineering approaches, while outlining future development trends for subsequent investigations in relevant fields. 2. The Biosynthetic Pathway of Ginseno Sides 2.1. Classification of Ginsenosides Ginsenosides are glycosidic natural compounds consisting of a triterpenoid saponin skeleton associated with one or more glycosyl groups. The triterpenoid saponin skeleton is composed of 30 carbon atoms. Based on differences in their aglycone skeleton and the position and number of glycosyl groups, ginsenosides are commonly classified into (1) dammarane-type tetracyclic triterpenoid saponins, including protopanaxadiol (PPD)-type (comprising prototypical members such as compound K [CK] and Rg1, where glycosylation occurs at β-hydroxyl [OH] groups of C3 and/or C20) and protopanaxatriol (PPT)-type (comprising prototypical members such as Rb1 and Rh1 [ 15 16 17 Figure 1 18 19 20 Panax 21 5 Panax quinquefolius 22 23 ginseng 24 25 26 27 28 2.2. Biosynthetic Pathway of Ginsenosides Recent advances in multi-omics research related to ginseng 29 Figure 1 Panax quinquefolium 22 23 2.2.1. Upstream Biosynthesis Pathway of Isoprenoid Precursors The process begins with Acetyl-CoA and concludes with the formation of the terpenoid biosynthesis precursors isopentenyl diphosphate (IPP) and isomer dimethylallyl diphosphate (DMAPP). The mevalonate (MVA) pathway commences with Acetyl-CoA, advancing through HMG-CoA synthesis, followed by reduction to mevalonic acid catalyzed by the rate-limiting enzyme HMG-CoA reductase (HMGR). In Saccharomyces cerevisiae HMGR 30 ginseng Ginseng PgHMGR1 PgHMGR2 31 Panax 32 33 34 2.2.2. Formation of the Triterpenoid Saponin Skeleton: Squalene and Its Cyclization Farnesyl diphosphate synthase (FPS) catalyzes the sequential condensation of IPP with DMAPP to form geranyl diphosphate (GPP, C 10 15 PgFPS 35 36 ginseng PgSQS PgSQS2 PgSQS3 37 38 39 ginseng PgSQE1 39 2,3-Oxidosqualene represents a critical metabolic branch point, cyclized by specific oxidosqualene cyclases (OSCs). The ginseng 40 Panax 41 42 2.2.3. Key Modifications Mediated by Cytochrome P450 (CYP450) Enzymes Plant CYP450 enzymes constitute a supergene family comprising multiple subfamily members. These heme-containing oxidases, encoded by CYP450 genes, contribute to diverse biological processes, including the post-modification steps of triterpenoid saponin secondary metabolism. In ginsenoside biosynthesis, CYP450 enzymes primarily facilitate complex modifications, such as hydroxylation, oxidation, and glycosylation of the carbon skeleton. These intricate CYP450-mediated modifications are primarily responsible for generating structural diversity among ginsenosides. Several key enzymes have been identified. The CYP716A47 gene encodes an enzyme that catalyzes the C12 hydroxylation of DD, converting it to PPD [ 43 44 45 46 47 2.2.4. Pivotal Role of UDP-Glycosyltransferases (UGTs) in Generating Structural Diversity UGTs catalyze the glycosyltransferases reaction, representing the final critical step in ginsenoside biosynthesis [ 48 49 50 51 52 53 The currently identified glycosyltransferases primarily act on the dammarane- and oleanane-type, mainly adding glucosyl moieties at the C3-OH, C6-OH, and C20-OH positions ( Figure 2 30 30 54 55 56 57 56 57 58 59 60 60 61 62 3. A Paradigm Shift for Sustainable Ginsenoside Production Traditionally, ginsenosides have been sourced from the cultivated Panax ginseng Figure 3 3.1. Innovations in Agricultural Technology The consumption of ginseng has a history of over 1000 years, yet its cultivation remains challenging. With the advancement of modern agriculture, ginseng cultivation techniques have undergone significant innovations ( Figure 3 63 3.2. Plant-Based Systems: Ginseng Cell, Tissue, and Hairy Root Cultures Ginseng 64 65 66 4 Cell and tissue culture methods have been extensively used to mitigate the vulnerability of field cultivation to environmental factors. Ginseng Figure 3 ginseng 67 −1 −1 68 −1 69 Adventitious root culture demonstrates high ginsenoside production capacity and maintains stability under physical and chemical conditions during large-scale cultivation, making it suitable for industrial-scale ginsenoside production [ 70 ginseng P. notoginseng notoginseng 67 71 72 Hairy roots are transgenic root systems generated by inducing ginseng Agrobacterium rhizogenes 73 Agrobacterium rolA rolB rolC rolD 74 Ginseng 75 76 Elicitors enable enhanced ginsenoside accumulation in plant cells. Methyl jasmonic acid (MeJA) represents the most effective elicitor [ 70 77 36 77 78 79 notoginseng −1 80 81 ginseng ginseng notoginseng −1 82 3.3. Microbial Synthesis of Ginsenosides Microbial cell factories present notable advantages, including rapid growth, established genetic tools, compatibility with scalable fermentation, and renewable feedstock utilization, making them optimal for producing plant secondary metabolites such as ginsenosides [ 48 Figure 3 Escherichia coli E. coli Bacillus subtilis B. subtilis Yarrowia lipolytica S. cerevisiae E. coli E. coli 83 B. subtilis B. subtilis 84 85 For microbial systems, the chassis cell determines the biosynthetic yield of ginsenosides and their derivatives. Using synthetic biology approaches, directed chassis engineering optimizes endogenous metabolic flux and energy utilization efficiency in these cells, thus enhancing target compound production. With advancements in synthetic biology applications for microorganisms, multiple ginsenosides have been successfully synthesized in microbial systems ( Table 1 3.4. Enzymatic Biocatalysis for Ginsenoside Production Enzymatic biotransformation uses purified or recombinant enzymes (ginsenosidases, specific UGTs, CYP450s) to catalyze defined reaction steps in vitro, converting abundant major ginsenosides into high-value rare ginsenosides. This methodology presents several advantages: rapid reaction cycles, reduced contamination risk, enhanced product purity, precise controllability, and specific substrate selectivity [ 11 Figure 3 Flavobacterium Burkholderia Microbacterium Agrobacterium Aspergillus Penicillium Emericella vermicola 97 The enzymatic hydrolysis of the PPT-type ginsenoside mixtures was performed using crude enzyme preparations from galactosidase ( Aspergillus Penicillium 98 Aspergillus Trichoderma viride Penicillium 99 Sulfolobus solfataricus E. coli ginseng 100 Pyrococcus furiosus E. coli ginseng −1 101 4. Ginsenoside Bioprospecting: Advances and Applications 4.1. Pharmacological Significance and Multifaceted Bioactivities Ginsenosides exhibit a broad spectrum of pharmacological activities, including anticancer, anti-inflammatory, antioxidant, anti-aging, anti-fatigue [ 102 103 104 105 106 107 Table 2 The biological activity of ginsenosides depends on their specific structures, which vary according to the type of aglycone (e.g., PPD, PPT, OA), the number of sugar groups, and the sites of glycosylation. The anticancer properties of ginsenosides, particularly those of rare ginsenosides such as Rg3, Rg5, and CK, are among the most extensively studied areas ( Table 2 4.2. Industrialization Prospects and Market Analysis Global demand for ginsenosides and ginseng 137 ginseng 48 ginseng Current ginsenoside production capacity remains insufficient to meet market demand, creating an unsustainable situation. Synthetic biology presents a viable alternative for sustainable and scalable production of ginsenosides and their derivatives. This approach shows considerable commercial potential in ginsenoside manufacturing. The global synthetic biology market is predicted to grow at a CAGR of 22.5%, potentially surpassing $20 billion by 2025. China, representing the world’s largest functional food market for ginsenosides, is accustomed to the steadily increasing demand for high-quality saponins. Market analysis indicates that rare ginsenosides (e.g., CK, Rg3, Rh2, etc., which enhanced bioavailability and potent pharmacological effects, and are common targets for biotechnological production), characterized by superior bioavailability and enhanced bioactivity compared with prototype ginsenosides, have achieved significant developmental progress in pharmaceuticals, nutraceuticals, and cosmetics, suggesting expanding commercialization opportunities. While synthetic biology production of ginsenosides may offer lower costs than plant extraction, with yeast-based production costs of $0.5–25/mg compared with $25–57/mg for plant-derived equivalents, fermentation expenses including raw materials, energy, and downstream processing must remain competitive [ 48 86 94 138 5. Challenges and Prospects As the primary bioactive components in ginseng 5.1. Current Technical Challenges 5.1.1. Insufficient Research on Enzyme Activity and Structural Optimization While the complete metabolic pathways for ginsenoside biosynthesis have been elucidated, critical natural enzymes in these pathways rarely undergo structural optimization, resulting in low catalytic efficiency. This limitation is particularly evident for ginseng-specific enzymes, where the expression of plant-derived CYP450 enzymes in microbial systems remains a significant bottleneck. These enzymes typically exhibit low activity in heterologous hosts due to factors including inherently low catalytic efficiency, poor solubility, misfolding tendencies, requirements for specific membrane environments, and dependency on specialized electron transport systems. Also, as enzymes catalyzing the terminal glycosylation step in ginsenoside biosynthesis, UGTs are pivotal for generating structural diversity among ginsenosides. Enhanced screening and catalytic efficiency improvements of UGTs would significantly facilitate the biosynthesis of multiple ginsenoside variants. 5.1.2. Pathway Balancing and Metabolic Burden The biosynthesis of ginsenosides involves an extended metabolic pathway, initiating from central carbon metabolism (e.g., acetyl-CoA) and proceeding through either the MVA pathway or the MEP pathway to produce IPP and DMAPP. These intermediates are subsequently converted into the triterpene backbone (2,3-oxidosqualene), which then undergoes extensive modification by a series of cytochrome P450 oxidases (CYPs) and UDP-glycosyltransferases (UGTs). In most organisms, the pathway from acetyl-CoA to 2,3-oxidosqualene is inherently present. However, strongly diverting metabolic flux toward saponin biosynthesis competes intensely with host growth, potentially leading to reduced ginsenoside production. Intermediates in this pathway serve as common precursors for a variety of essential metabolites; their substantial depletion may result in defective cellular membranes, growth arrest, or even cell death. Moreover, precise coordination of multiple enzymatic steps, such as those catalyzed by cytochrome P450 enzymes and glycosyltransferases, which is critical for maintaining structural integrity and normal cellular function in the host. Introducing lengthy heterologous pathways consumes substantial cellular resources, including ATP, NAD(P)H, and precursor metabolites—imposing a metabolic burden that can compromise cell growth and decrease the yield of the target product. 5.1.3. Scaling-Up Challenges The scale-up of microbial synthesis of ginsenosides faces multiple challenges, including: heterogeneous distribution of dissolved oxygen, pH, and substrates in large-scale bioreactors, leading to cellular metabolic stress and fluctuating production yields; fluid shear stress generated by high-speed agitation and aeration, which can damage the fragile cell membranes of engineered microbial strains; the lack of real-time sensors for monitoring specific ginsenoside concentrations, resulting in delayed control feedback; foaming exacerbated by the surfactant properties of saponins, increasing the risk of microbial contamination; and the challenges associated with downstream separation and purification processes for the final product. 5.2. Engineered Biosynthesis of Ginsenosides: A Sustainable Platform Synthetic biology platforms offer alternative pathways for ginsenoside production distinct from conventional agriculture, presenting advantages in environmental footprint, resource efficiency, and production capacity. This establishes the foundation for a more sustainable ginseng industry. Besides variable yields and a substantial environmental footprint, traditional field cultivation of ginseng 139 The advancement of synthetic biology has revolutionized ginsenoside biosynthesis. The construction of engineered cell factories for heterologous ginsenoside production presents an effective strategy to enhance yields. Compared with traditional production methods, this approach offers notable advantages: reduced production cycles, utilization of cost-effective substrates, scalable and controllable fermentation processes, minimal spatial requirements, and consistent product quality independent of weather and environmental conditions. To enhance biosynthetic efficiency, several research priorities warrant investigation. First, thorough exploration and optimization of key genes and proteins within ginsenoside biosynthesis pathways are essential. This will establish fundamental genetic components for heterologous pathway assembly and enable efficient synthetic systems. Second, conducting protein engineering studies on enzymes is crucial. By directed evolution and rational design combined with high-throughput screening, catalytic efficiency and activity of essential biosynthetic enzymes can be improved, thereby increasing ginsenoside titers in chassis cells. Finally, developing and constructing chassis cells with enhanced traits will provide a solid foundation for establishing high-yield artificial biosynthesis platforms. 5.3. Integration of New Technologies with Plant-Based Chassis for Ginsenoside Biosynthesis Plant-based chassis systems offer significant advantages for synthesizing plant secondary metabolites [ 140 141 Figure 3 142 143 144 Microalgal cultivation enables high-density and rapid growth, along with amenable genetic traits. As predominantly photoautotrophic organisms, microalgae offer the potential for sustainable production, making them excellent hosts for synthesizing plant secondary metabolites successfully achieved the synthesis of dammarenediol-II at a titer of 2.6 mg/L by co-expressing PgDDS, a cytochrome P450 enzyme gene (PgCYP716A47), and a NADPH-cytochrome P450 reductase gene (AtCPR), under methyl jasmonate elicitation. This work lays a foundation for the production of ginsenosides in algal systems [ 145 146 Nicotiana tabacum 41 DS CYP716A47 CYP716A53v2 147 Furthermore, advanced gene editing technologies, particularly the sophisticated CRISPR/Cas systems, including the newly developed, highly efficient gene editing vectors (ScCas9 ++ 148 149 150 151 152 153 151 152 153 154 UGT45 94 In conclusion, synthetic biology presents promising avenues to achieve efficient and sustainable production of ginsenosides. Through continued scientific research and technological innovation, combined with integrated assessment of economic viability, regulatory frameworks, and ethical implications, synthetic biology can transform ginsenoside supply paradigms, while significantly contributing to global health industries and agricultural sustainability. Acknowledgments Parts of the figures were created with BioRender (Liu, J. 2025, https://BioRender.com/4zk1bev Disclaimer/Publisher’s Note: Author Contributions Conceptualization and design, Q.Z., N.C. and Y.X. (Yang Xiang); methodology, Y.X. (Yang Xue) and R.Z.; investigation, T.L., Q.D.,W.L. and R.C.; data curation, D.Z., J.T. and T.S.; writing—original draft preparation, Y.X. (Yang Xue), Q.Z. and N.C.; writing—review and editing, Q.Z. and N.C.; visualization, R.Z.; supervision, Q.Z.; project administration, N.C. and Y.X. (Yang Xiang); funding acquisition, Q.Z., N.C., Y.-G.L. and Y.X. (Yang Xiang). All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: ginseng Panax ginseng MVA Mevalonate MEP Methylerythritol phosphate IPP Isopentenyl diphosphate DMAPP Isomer dimethylallyl diphosphate HMGR HMG-CoA reductase DXP 1-Deoxy-D-xylulose-5-phosphate GPP Geranyl diphosphate DMAPP 3,3-Dimethylallyl diphosphate FPP Farnesyl pyrophosphate FPS Farnesyl pyrophosphate synthase SQS Squalene synthase DDS Dammarenediol synthase CYP716A47 Cytochrome P450 oxidases enzymes PPD Protopanaxadiol CYP716A53v2 Cytochrome P450 oxidases enzymes PPT Protopanaxatriol β-AS β-Amyrin synthase CYP716A52v2 Cytochrome P450 oxidases enzymes OA Oleanolic acid SQE Squalene epoxidase OSCs Oxidosqualene cyclases DD Dammarenediol-II DS Dammarenediol-II synthase CYP450 Cytochrome P450 UGTs UDP-glycosyltransferases notoginseng Panax notoginseng E. coli Escherichia coli B. subtilis Bacillus subtilis MeJA Methyl jasmonic acid JA Jasmonic acid CAGR Compound annual growth rate References 1. Lee Y.-M. Yoon H. Park H.-M. Song B.C. Yeum K.-J. Implications of Red Panax ginseng J. Ginseng Res. 2017 41 113 119 10.1016/j.jgr.2016.03.003 28413314 PMC5386131 2. Baeg I.-H. So S.-H. The World Ginseng Market and the Ginseng (Korea) J. Ginseng Res. 2013 37 1 7 10.5142/jgr.2013.37.1 23717152 PMC3659626 3. Radad K. Gille G. Liu L.L. Rausch W.D. Use of Ginseng in Medicine with Emphasis on Neurodegenerative Disorders J. Pharmacol. Sci. 2006 100 175 186 10.1254/jphs.CRJ05010X 16518078 4. Kim Y.-J. Jeon J.-N. Jang M.-G. Oh J.Y. Kwon W.-S. Jung S.-K. Yang D.-C. Ginsenoside Profiles and Related Gene Expression during Foliation in Panax ginseng J Ginseng Res. 2014 38 66 72 10.1016/j.jgr.2013.11.001 24558313 PMC3915334 5. Christensen L.P. Ginsenosides Chemistry, Biosynthesis, Analysis, and Potential Health Effects Adv. Food Nutr. Res. 2009 55 1 99 10.1016/S1043-4526(08)00401-4 18772102 6. Zhang C.X. Study on the Chemical Constituents from Ginseng and American Ginseng and Notoginseng Ph.D. Thesis Jilin Agricultural University Changchun, China 2004 Available online: https://www.dissertationtopic.net/doc/1579829 (accessed on 29 August 2025) 7. Wang J.-R. Yau L.-F. Gao W.-N. Liu Y. Yick P.-W. Liu L. Jiang Z.-H. Quantitative Comparison and Metabolite Profiling of Saponins in Different Parts of the Root of Panax notoginseng J. Agric. Food Chem. 2014 62 9024 9034 10.1021/jf502214x 25118819 PMC4160291 8. Chen Y. Liu M. Wen J. Yang Z. Li G. Cao Y. Sun L. Ren X. Panax japonicus Chin. Med. 2023 18 148 10.1186/s13020-023-00857-y 37950271 PMC10636818 9. Liang Y. Zhao S. Progress in Understanding of Ginsenoside Biosynthesis Plant Biol. 2008 10 415 421 10.1111/j.1438-8677.2008.00064.x 18557901 10. Kim Y.-J. Zhang D. Yang D.-C. Biosynthesis and Biotechnological Production of Ginsenosides Biotechnol. Adv. 2015 33 717 735 10.1016/j.biotechadv.2015.03.001 25747290 11. Yang J.-L. Hu Z.-F. Zhang T.-T. Gu A.-D. Gong T. Zhu P. Progress on the Studies of the Key Enzymes of Ginsenoside Biosynthesis Molecules 2018 23 589 10.3390/molecules23030589 29509695 PMC6017814 12. Son S.-H. Kang J. Shin Y. Lee C. Sung B.H. Lee J.Y. Lee W. Sustainable Production of Natural Products Using Synthetic Biology: Ginsenosides J. Ginseng Res. 2024 48 140 148 10.1016/j.jgr.2023.12.006 38465212 PMC10920010 13. DesRochers N. Walsh J.P. Renaud J.B. Seifert K.A. Yeung K.K.-C. Sumarah M.W. Metabolomic Profiling of Fungal Pathogens Responsible for Root Rot in American Ginseng Metabolites 2020 10 35 10.3390/metabo10010035 31947697 PMC7023087 14. Yao L. Lu J. Wang J. Gao W.-Y. Advances in Biosynthesis of Triterpenoid Saponins in Medicinal Plants Chin. J. Nat. Med. 2020 18 417 424 10.1016/S1875-5364(20)30049-2 32503733 15. Han M. Sha X.Y. Wu Y.J. Fang X.L. Oral Absorption of Ginsenoside Rb1 Using in Vitro and in Vivo Models Planta Med. 2006 72 398 404 10.1055/s-2005-916211 16557452 16. Niu X.-N. Luo W. Lv C.-N. Lu J.-C. Research Progress on Naturally-Occurring and Semi-Synthetic Ocotillol-Type Ginsenosides in the genus Panax Araliaceae Chin. J. Nat. Med. 2021 19 648 655 10.1016/S1875-5364(21)60089-4 34561075 17. Piao X. Zhang H. Kang J.P. Yang D.U. Li Y. Pang S. Jin Y. Yang D.C. Wang Y. Advances in Saponin Diversity of Panax ginseng Molecules 2020 25 3452 10.3390/molecules25153452 32751233 PMC7435442 18. Cao Y. Wang K. Wang J. Cheng H. Ma M. Meng Q. Li X. Bi Y. Design, Synthesis and Antibacterial Evaluation of Ocotillol Derivatives with Polycyclic Nitrogen-Containing Groups Future Med. Chem. 2021 13 1025 1039 10.4155/fmc-2020-0364 33928790 19. Liu J. Gan H. Li T. Wang J. Du G. An Y. Yan X. Geng C. The Metabolites and Biotransformation Pathwaysin Vivoafter Oral Administration of Ocotillol, RT5, and PF11 Biomed. Chromatogr. 2020 34 e4856 10.1002/bmc.4856 32307731 20. Zhang D. Cao Y. Wang K. Shi Z. Wang R. Meng Q. Bi Y. Design, Synthesis, and Antibacterial Evaluation of Novel Ocotillol Derivatives and Their Synergistic Effects with Conventional Antibiotics Molecules 2021 26 5969 10.3390/molecules26195969 34641512 PMC8512374 21. Kim D.-H. Chemical Diversity of Panax ginseng Panax quinquifolium Panax notoginseng J. Ginseng Res. 2012 36 1 15 10.5142/jgr.2012.36.1.1 23717099 PMC3659563 22. Liu J.-P. Wang F. Li P.-Y. Lu D. A New Ocotillol-Type Triterpenoid Saponin from Red American Ginseng Nat. Prod. Res. 2012 26 731 735 10.1080/14786419.2010.551644 22010954 23. Dou W. Wu Z. Huang C. Yang X. Ding L. Han Z. Yang L. Wang Z. Wang R. Strategic Enrichment of Ocotillol-Type Ginsenosides F11, RT5 and Ocotillol from Panax quinquefolium Ind. Crop. Prod. 2024 218 118953 10.1016/j.indcrop.2024.118953 24. Kim J.H. Yi Y.-S. Kim M.-Y. Cho J.Y. Role of Ginsenosides, the Main Active Components of Panax ginseng J. Ginseng Res. 2017 41 435 443 10.1016/j.jgr.2016.08.004 29021688 PMC5628327 25. Han M. Fang X.-L. Difference in Oral Absorption of Ginsenoside Rg1 between in Vitro and in Vivo Models Acta Pharmacol. Sin. 2006 27 499 505 10.1111/j.1745-7254.2006.00303.x 16539852 26. Han J.Y. Kwon Y.S. Yang D.C. Jung Y.R. Choi Y.E. Expression and RNA Interference-Induced Silencing of the Dammarenediol Synthase Gene in Panax ginseng Plant Cell Physiol. 2006 47 1653 1662 10.1093/pcp/pcl032 17088293 27. Hasegawa H. Lee K.S. Nagaoka T. Tezuka Y. Uchiyama M. Kadota S. Saiki I. Pharmacokinetics of Ginsenoside Deglycosylated by Intestinal Bacteria and Its Transformation to Biologically Active Fatty Acid Esters Biol. Pharm. Bull. 2000 23 298 304 10.1248/bpb.23.298 10726882 28. Zhang J. Ma X. Fan D. Ginsenoside CK Inhibits Hypoxia-Induced Epithelial-Mesenchymal Transformation through the HIF-1α/NF-κB Feedback Pathway in Hepatocellular Carcinoma Foods 2021 10 1195 10.3390/foods10061195 34073155 PMC8227303 29. Jiang G.-Z. Yao M.-D. Wang Y. Zhou L. Song T.-Q. Liu H. Xiao W.-H. Yuan Y.-J. Manipulation of GES and ERG20 for Geraniol Overproduction in Saccharomyces cerevisiae Metab. Eng. 2017 41 57 66 10.1016/j.ymben.2017.03.005 28359705 30. Yan X. Fan Y. Wei W. Wang P. Liu Q. Wei Y. Zhang L. Zhao G. Yue J. Zhou Z. Production of Bioactive Ginsenoside Compound K in Metabolically Engineered Yeast Cell Res. 2014 24 770 773 10.1038/cr.2014.28 24603359 PMC4042165 31. Kim Y.-J. Lee O.R. Oh J.Y. Jang M.-G. Yang D.-C. Functional Analysis of 3-Hydroxy-3-Methylglutaryl Coenzyme A Reductase Encoding Genes in Triterpene Saponin-Producing Ginseng Plant Physiol. 2014 165 373 387 10.1104/pp.113.222596 24569845 PMC4012596 32. Hou M. Wang R. Zhao S. Wang Z. Ginsenosides in Panax genus Acta Pharm. Sin. B 2021 11 1813 1834 10.1016/j.apsb.2020.12.017 34386322 PMC8343117 33. Cordoba E. Porta H. Arroyo A. San Roman C. Medina L. Rodriguez-Concepcion M. Leon P. Functional Characterization of the Three Genes Encoding 1-Deoxy-D-Xylulose 5-Phosphate Synthase in Maize J. Exp. Bot. 2011 62 2023 2038 10.1093/jxb/erq393 21199890 34. Enfissi E.M.A. Fraser P.D. Lois L.M. Boronat A. Schuch W. Bramley P.M. Metabolic Engineering of the Mevalonate and Non-Mevalonate Isopentenyl Diphosphate-Forming Pathways for the Production of Health-Promoting Isoprenoids in Tomato Plant Biotechnol. J. 2005 3 17 27 10.1111/j.1467-7652.2004.00091.x 17168896 35. Lee M.H. Jeong J.H. Seo J.W. Shin C.G. Kim Y.S. In J.G. Yang D.C. Yi J.S. Choi Y.E. Enhanced Triterpene and Phytosterol Biosynthesis in Panax ginseng Plant Cell Physiol. 2004 45 976 984 10.1093/pcp/pch126 15356323 36. Kim T.-D. Han J.-Y. Huh G.H. Choi Y.-E. Expression and Functional Characterization of Three Squalene Synthase Genes Associated with Saponin Biosynthesis in Panax ginseng Plant Cell Physiol. 2011 52 125 137 10.1093/pcp/pcq179 21134898 37. Vincken J.-P. Heng L. de Groot A. Gruppen H. Saponins, Classification and Occurrence in the Plant Kingdom Phytochemistry 2007 68 275 297 10.1016/j.phytochem.2006.10.008 17141815 38. Han J.-Y. In J.-G. Kwon Y.-S. Choi Y.-E. Regulation of Ginsenoside and Phytosterol Biosynthesis by RNA Interferences of Squalene Epoxidase Gene in Panax ginseng Phytochemistry 2010 71 36 46 10.1016/j.phytochem.2009.09.031 19857882 39. Xu J. Chu Y. Liao B. Xiao S. Yin Q. Bai R. Su H. Dong L. Li X. Qian J. Panax ginseng GigaScience 2017 6 gix093 10.1093/gigascience/gix093 PMC5710592 29048480 40. Lee M.-H. Han J.-Y. Kim H.-J. Kim Y.-S. Huh G.H. Choi Y.-E. Dammarenediol-II Production Confers TMV Tolerance in Transgenic Tobacco Expressing Panax ginseng Plant Cell Physiol. 2012 53 173 182 10.1093/pcp/pcr160 22102695 41. Ren S. Sun Q. Zhang L. Sun W. Li Y. Feng X. Li C. Sustainable Production of Rare Oleanane-Type Ginsenoside Ro with an Artificial Glycosylation Pathway in Saccharomyces cerevisiae Green Chem. 2022 24 8302 8313 10.1039/D2GC02639B 42. Han J.-Y. Kim H.-J. Kwon Y.-S. Choi Y.-E. The Cyt P450 Enzyme CYP716A47 Catalyzes the Formation of Protopanaxadiol from Dammarenediol-II During Ginsenoside Biosynthesis in Panax ginseng Plant Cell Physiol. 2011 52 2062 2073 10.1093/pcp/pcr150 22039120 43. Han J.-Y. Hwang H.-S. Choi S.-W. Kim H.-J. Choi Y.-E. Cytochrome P450 CYP716A53v2 Catalyzes the Formation of Protopanaxatriol from Protopanaxadiol During Ginsenoside Biosynthesis in Panax ginseng Plant Cell Physiol. 2012 53 1535 1545 10.1093/pcp/pcs106 22875608 44. Li C. Yan X. Xu Z. Wang Y. Shen X. Zhang L. Zhou Z. Wang P. Pathway Elucidation of Bioactive Rhamnosylated Ginsenosides in Panax ginseng Saccharomyces cerevisiae Commun. Biol. 2022 5 775 10.1038/s42003-022-03740-y 35918414 PMC9345943 45. Park S.-B. Chun J.-H. Ban Y.-W. Han J.Y. Choi Y.E. Alteration of Panax ginseng J. Ginseng Res. 2016 40 47 54 10.1016/j.jgr.2015.04.010 26843821 PMC4703803 46. Han J.-Y. Kim M.-J. Ban Y.-W. Hwang H.-S. Choi Y.-E. The Involvement of β-Amyrin 28-Oxidase (CYP716A52v2) in Oleanane-Type Ginsenoside Biosynthesis in Panax ginseng Plant Cell Physiol. 2013 54 2034 2046 10.1093/pcp/pct141 24092881 47. Chu L.L. Montecillo J.A.V. Bae H. Recent Advances in the Metabolic Engineering of Yeasts for Ginsenoside Biosynthesis Front. Bioeng. Biotechnol. 2020 8 139 10.3389/fbioe.2020.00139 32158753 PMC7052115 48. Nguyen H.T. Malla S. Nguyen T.T. Dhakal D. Pokhrel A.R. Chu L.L. Sohng J.K. Microbial Production of Astilbin, a Bioactive Rhamnosylated Flavanonol, from Taxifolin World J. Microbiol. Biotechnol. 2017 33 36 10.1007/s11274-017-2208-7 28120309 49. Tong Y. Song X. Zhang Y. Xu Y. Liu Q. Insight on Structural Modification, Biological Activity, Structure-Activity Relationship of PPD-Type Ginsenoside Derivatives Fitoterapia 2022 158 105135 10.1016/j.fitote.2022.105135 35101587 50. Guo H.-Y. Xing Y. Sun Y.-Q. Liu C. Xu Q. Shang F.-F. Zhang R.-H. Jin X.-J. Chen F. Lee J.J. Ginsengenin Derivatives Synthesized from 20(R)-Panaxotriol: Synthesis, Characterization, and Antitumor Activity Targeting HIF-1 Pathway J. Ginseng Res. 2022 46 738 749 10.1016/j.jgr.2022.03.001 36312731 PMC9597438 51. Seki H. Tamura K. Muranaka T. P450s and UGTs: Key Players in the Structural Diversity of Triterpenoid Saponins Plant Cell Physiol. 2015 56 1463 1471 10.1093/pcp/pcv062 25951908 PMC7107090 52. Zhao J.-N. Wang R.-F. Zhao S.-J. Wang Z.-T. Advance in Glycosyltransferases, the Important Bioparts for Production of Diversified Ginsenosides Chin. J. Nat. Med. 2020 18 643 658 10.1016/S1875-5364(20)60003-6 32928508 53. Lu J. Yao L. Li J.-X. Liu S.-J. Hu Y.-Y. Wang S.-H. Liang W.-X. Huang L.-Q. Dai Y.-J. Wang J. Characterization of UDP-Glycosyltransferase Involved in Biosynthesis of Ginsenosides Rg1 and Rb1 and Identification of Critical Conserved Amino Acid Residues for Its Function J. Agric. Food Chem. 2018 66 9446 9455 10.1021/acs.jafc.8b02544 30095259 54. Yang C. Li C. Wei W. Wei Y. Liu Q. Zhao G. Yue J. Yan X. Wang P. Zhou Z. The Unprecedented Diversity of UGT94-Family UDP-Glycosyltransferases in Panax Plants and Their Contribution to Ginsenoside Biosynthesis Sci. Rep. 2020 10 15394 10.1038/s41598-020-72278-y 32958789 PMC7506552 55. Jung S.-C. Kim W. Park S.C. Jeong J. Park M.K. Lim S. Lee Y. Im W.-T. Lee J.H. Choi G. Two Ginseng UDP-Glycosyltransferases Synthesize Ginsenoside Rg3 and Rd Plant Cell Physiol. 2014 55 2177 2188 10.1093/pcp/pcu147 25320211 56. Wang P. Wei Y. Fan Y. Liu Q. Wei W. Yang C. Zhang L. Zhao G. Yue J. Yan X. Production of Bioactive Ginsenosides Rh2 and Rg3 by Metabolically Engineered Yeasts Metab. Eng. 2015 29 97 105 10.1016/j.ymben.2015.03.003 25769286 57. Li Y. Li J. Diao M. Peng L. Huang S. Xie N. Characterization of a Group of UDP-Glycosyltransferases Involved in the Biosynthesis of Triterpenoid Saponins of Panax notoginseng ACS Synth. Biol. 2022 11 770 779 10.1021/acssynbio.1c00469 35107265 58. Wei W. Wang P. Wei Y. Liu Q. Yang C. Zhao G. Yue J. Yan X. Zhou Z. Characterization of Panax ginseng Mol. Plant 2015 8 1412 1424 10.1016/j.molp.2015.05.010 26032089 59. Zhang H. Hua X. Zheng D. Wu H. Li C. Rao P. Wen M. Choi Y.-E. Xue Z. Wang Y. De Novo Biosynthesis of Oleanane-Type Ginsenosides in Saccharomyces cerevisiae Panax ginseng J. Agric. Food Chem. 2022 70 2231 2240 10.1021/acs.jafc.1c07526 35148079 60. Choi J. Kim J. Yoon H.I. Son J.E. Effect of Far-Red and UV-B Light on the Growth and Ginsenoside Content of Ginseng ( Panax ginseng Hortic. Environ. Biotechnol. 2022 63 77 87 10.1007/s13580-021-00380-9 61. Gao D. Kim J.H. Vinh L.B. Seo E.-Y. Yang S.Y. Cho C.W. Kim Y.H. Kim K.T. Sim J. Kang J.S. Effect of Citric Acid and Heat Treatment on the Content of Less-Polar Ginsenosides in Flower Buds of Panax ginseng Prep. Biochem. Biotechnol. 2022 52 144 153 10.1080/10826068.2021.1920036 33950798 62. Attele A.S. Wu J.A. Yuan C.S. Ginseng Pharmacology: Multiple Constituents and Multiple Actions Biochem. Pharmacol. 1999 58 1685 1693 10.1016/S0006-2952(99)00212-9 10571242 63. Li X. Yan Y.Z. Jin X. Kim Y.K. Uddin M.R. Kim Y.B. Bae H. Kim Y.C. Lee S.W. Park S.U. Ginsenoside Content in The Leaves and Roots of Panax ginseng Life Sci. J. 2012 9 679 683 64. Murthy H.N. Georgiev M.I. Kim Y.-S. Jeong C.-S. Kim S.-J. Park S.-Y. Paek K.-Y. Ginsenosides: Prospective for Sustainable Biotechnological Production Appl. Microbiol. Biotechnol. 2014 98 6243 6254 10.1007/s00253-014-5801-9 24859520 65. Wu J. Zhong J.J. Production of Ginseng and Its Bioactive Components in Plant Cell Culture: Current Technological and Applied Aspects J. Biotechnol. 1999 68 89 99 10.1016/S0168-1656(98)00195-3 10194851 66. Wu J.Y. Wong K. Ho K.P. Zhou L.G. Enhancement of Saponin Production in Panax ginseng Enzym. Microb. Technol. 2005 36 133 138 10.1016/j.enzmictec.2004.07.010 67. Paek K.-Y. Murthy H.N. Hahn E.-J. Zhong J.-J. Large Scale Culture of Ginseng Adventitious Roots for Production of Ginsenosides Biotechnology in China I: From Bioreaction to Bioseparation and Bioremediation Zhong J.J. Bai F.W. Zhang W. Springer Berlin, Germany 2009 Volume 113 151 176 978-3-540-88414-9 10.1007/10_2008_31 19373448 68. Baque M.A. Moh S.-H. Lee E.-J. Zhong J.-J. Paek K.-Y. Production of Biomass and Useful Compounds from Adventitious Roots of High-Value Added Medicinal Plants Using Bioreactor Biotechnol. Adv. 2012 30 1255 1267 10.1016/j.biotechadv.2011.11.004 22123438 69. Gao X.F. Zhu C.B. Jia W. Gao W.Y. Qiu M.F. Zhang Y.Y. Xiao P.G. Induction and Characterization of Adventitious Roots Directly from the Explants of Panax notoginseng Biotechnol. Lett. 2005 27 1771 1775 10.1007/s10529-005-3553-4 16314969 70. Mathur A. Gangwar A. Mathur A.K. Verma P. Uniyal G.C. Lal R.K. Growth Kinetics and Ginsenosides Production in Transformed Hairy Roots of American Ginseng- Panax quinquefolium Biotechnol. Lett. 2010 32 457 461 10.1007/s10529-009-0158-3 19898783 71. Gutierrez-Valdes N. Hakkinen S.T. Lemasson C. Guillet M. Oksman-Caldentey K.-M. Ritala A. Cardon F. Hairy Root Cultures-A Versatile Tool with Multiple Applications Front. Plant Sci. 2020 11 33 10.3389/fpls.2020.00033 32194578 PMC7064051 72. Palazón J. Mallol A. Eibl R. Lettenbauer C. Cusidó R.M. Piñol M.T. Growth and Ginsenoside Production in Hairy Root Cultures of Panax ginseng Planta Med. 2003 69 344 349 10.1055/s-2003-38873 12709902 73. Zhao B. Agblevor F.A. Jelesko J.G. Enhanced Production of Hairy Root Metabolites Using Microbubble Generator Plant Cell Tissue Organ Cult. 2014 117 157 165 10.1007/s11240-014-0428-1 74. Kim Y.-S. Yeung E.C. Hahn E.-J. Paek K.-Y. Combined Effects of Phytohormone, Indole-3-Butyric Acid, and Methyl Jasmonate on Root Growth and Ginsenoside Production in Adventitious Root Cultures of Panax ginseng Biotechnol. Lett. 2007 29 1789 1792 10.1007/s10529-007-9442-2 17609860 75. Wang J. Gao W. Zuo B. Zhang L. Huang L. Effect of Methyl Jasmonate on the Ginsenoside Content of Panax ginseng Res. Chem. Intermed. 2013 39 1973 1980 10.1007/s11164-012-0730-7 76. Kim O.T. Bang K.H. Kim Y.C. Hyun D.Y. Kim M.Y. Cha S.W. Upregulation of Ginsenoside and Gene Expression Related to Triterpene Biosynthesis in Ginseng Hairy Root Cultures Elicited by Methyl Jasmonate Plant Cell Tissue Organ Cult. 2009 98 25 33 10.1007/s11240-009-9535-9 77. Wang W. Zhong J.J. Manipulation of Ginsenoside Heterogeneity in Cell Cultures of Panax notoginseng J. Biosci. Bioeng. 2002 93 48 53 10.1016/S1389-1723(02)80053-6 16233164 78. Hu F.-X. Zhong J.-J. Role of Jasmonic Acid in Alteration of Ginsenoside Heterogeneity in Elicited Cell Cultures of Panax notoginseng J. Biosci. Bioeng. 2007 104 513 516 10.1263/jbb.104.513 18215640 79. Thanh N.T. Murthy H.N. Yu K.W. Hahn E.J. Paek K.Y. Methyl Jasmonate Elicitation Enhanced Synthesis of Ginsenoside by Cell Suspension Cultures of Panax ginseng Appl. Microbiol. Biotechnol. 2005 67 197 201 10.1007/s00253-004-1759-3 15578180 80. Zhu F. Zhong X. Hu M. Lu L. Deng Z. Liu T. In Vitro Reconstitution of Mevalonate Pathway and Targeted Engineering of Farnesene Overproduction in Escherichia coli Biotechnol. Bioeng. 2014 111 1396 1405 10.1002/bit.25198 24473754 81. Song Y. Guan Z. van Merkerk R. Pramastya H. Abdallah I.I. Setroikromo R. Quax W.J. Production of Squalene in Bacillus Subtilis by Squalene Synthase Screening and Metabolic Engineering J. Agric. Food Chem. 2020 68 4447 4455 10.1021/acs.jafc.0c00375 32208656 PMC7168599 82. Li D. Wu Y. Zhang C. Sun J. Zhou Z. Lu W. Production of Triterpene Ginsenoside Compound K in the Non-Conventional Yeast Yarrowia lipolytica J. Agric. Food Chem. 2019 67 2581 2588 10.1021/acs.jafc.9b00009 30757901 83. Li X. Sun L. Zhao D. Current Status and Problem-Solving Strategies for Ginseng Industry Chin. J. Integr. Med. 2019 25 883 886 10.1007/s11655-019-3046-2 31630359 84. Wang D. Wang J. Shi Y. Li R. Fan F. Huang Y. Li W. Chen N. Huang L. Dai Z. Elucidation of the Complete Biosynthetic Pathway of the Main Triterpene Glycosylation Products of Panax notoginseng Metab. Eng. 2020 61 131 140 10.1016/j.ymben.2020.05.007 32454222 85. Nan W. Zhao F. Zhang C. Ju H. Lu W. Promotion of Compound K Production in Saccharomyces cerevisiae Microb. Cell. Fact. 2020 19 41 10.1186/s12934-020-01306-3 32075645 PMC7029525 86. Wang P. Wang J. Zhao G. Yan X. Zhou Z. Systematic Optimization of the Yeast Cell Factory for Sustainable and High Efficiency Production of Bioactive Ginsenoside Compound K Synth. Syst. Biotechnol. 2021 6 69 76 10.1016/j.synbio.2021.03.002 33869813 PMC8040117 87. Shin J.Y. Pandey R.P. Jung H.Y. Chu L.L. Park Y.I. Sohng J.K. In Vitro Single-Vessel Enzymatic Synthesis of Novel Resvera-A Glucosides Carbohydr. Res. 2016 424 8 14 10.1016/j.carres.2016.02.001 26918515 88. Jiang Z. Gao H. Liu R. Xia M. Lu Y. Wang J. Chen X. Zhang Y. Li D. Tong Y. Key Glycosyltransferase Genes of Panax notoginseng ACS Synth. Biol. 2022 11 2394 2404 10.1021/acssynbio.2c00094 35687875 89. Jiang F. Zhou C. Li Y. Deng H. Gong T. Chen J. Chen T. Yang J. Zhu P. Metabolic Engineering of Yeasts for Green and Sustainable Production of Bioactive Ginsenosides F2 and 3β,20S-Di-O-Glc-DM Acta Pharm. Sin. B 2022 12 3167 3176 10.1016/j.apsb.2022.04.012 35865098 PMC9293705 90. Zhuang Y. Yang G.-Y. Chen X. Liu Q. Zhang X. Deng Z. Feng Y. Biosynthesis of Plant-Derived Ginsenoside Rh2 in Yeast via Repurposing a Key Promiscuous Microbial Enzyme Metab. Eng. 2017 42 25 32 10.1016/j.ymben.2017.04.009 28479190 91. Wang P. Wei W. Ye W. Li X. Zhao W. Yang C. Li C. Yan X. Zhou Z. Synthesizing Ginsenoside Rh2 in Saccharomyces cerevisiae Cell Discov. 2019 5 5 10.1038/s41421-018-0075-5 30652026 PMC6331602 92. Dai L. Liu C. Li J. Dong C. Yang J. Dai Z. Zhang X. Sun Y. One-Pot Synthesis of Ginsenoside Rh2 and Bioactive Unnatural Ginsenoside by Coupling Promiscuous Glycosyltransferase from Bacillus subtilis J. Agric. Food Chem. 2018 66 2830 2837 10.1021/acs.jafc.8b00597 29484884 93. Ma W. Zhao L. Ma Y. Li Y. Qin S. He B. Oriented Efficient Biosynthesis of Rare Ginsenoside Rh2 from PPD by Compiling UGT-Yjic Mutant with Sucrose Synthase Int. J. Biol. Macromol. 2020 146 853 859 10.1016/j.ijbiomac.2019.09.208 31726169 94. Fu Y. Biotransformation of Ginsenoside Rb1 to Gyp-XVII and Minor Ginsenoside Rg3 by Endophytic Bacterium Flavobacterium Sp. GE 32 Isolated from Panax ginseng Lett. Appl. Microbiol. 2019 68 134 141 10.1111/lam.13090 30362617 95. Ko S.R. Choi K.J. Suzuki K. Suzuki Y. Enzymatic Preparation of Ginsenosides Rg2, Rh1, and F1 Chem. Pharm. Bull. 2003 51 404 408 10.1248/cpb.51.404 12672992 96. Ko S.-R. Suzuki Y. Suzuki K. Choi K.-J. Cho B.-G. “Enzymatic Preparation of Minor Saponins and Intestinal Bacterial Saponin Metabolites of Ginseng.: Part III”.: Marked Production of Ginsenosides Rd, F2, Rg3, and Compound K by Enzymatic Method Chem. Pharm. Bull. 2007 55 1522 1527 10.1248/cpb.55.1522 17917300 97. Noh K.-H. Son J.-W. Kim H.-J. Oh D.-K. Ginsenoside Compound K Production from Ginseng Root Extract by a Thermostable β-Glycosidase from Sulfolobus solfataricus Biosci. Biotechnol. Biochem. 2009 73 316 321 10.1271/bbb.80525 19202288 98. Yoo M.-H. Yeom S.-J. Park C.-S. Lee K.-W. Oh D.-K. Production of Aglycon Protopanaxadiol via Compound K by a Thermostable β-Glycosidase from Pyrococcus furiosus Appl. Microbiol. Biotechnol. 2011 89 1019 1028 10.1007/s00253-010-2960-1 21052989 99. Wu L. Bai L. Dai W. Wu Y. Xi P. Zheng L. Zhang J. Ginsenoside Rg3: A Review of Its Anticancer Mechanisms and Potential Therapeutic Applications Curr. Top. Med. Chem. 2024 24 869 884 10.2174/0115680266283661240226052054 38441023 100. Liang L.-D. He T. Du T.-W. Fan Y.-G. Chen D.-S. Wang Y. Ginsenoside-Rg5 Induces Apoptosis and DNA Damage in Human Cervical Cancer Cells Mol. Med. Rep. 2015 11 940 946 10.3892/mmr.2014.2821 25355274 PMC4262516 101. Paik S. Song G.Y. Jo E.-K. Ginsenosides for Therapeutically Targeting Inflammation through Modulation of Oxidative Stress Int. Immunopharmacol. 2023 121 110461 10.1016/j.intimp.2023.110461 37331298 102. Feng S. Li T. Wei X. Zheng Y. Zhang Y. Li G. Zhao Y. The Antioxidant and Anti-Fatigue Effects of Rare Ginsenosides and γ-Aminobutyric Acid in Fermented Ginseng and Germinated Brown Rice Puree Int. J. Mol. Sci. 2024 25 10359 10.3390/ijms251910359 39408689 PMC11476846 103. Arring N.M. Millstine D. Marks L.A. Nail L.M. Ginseng as a Treatment for Fatigue: A Systematic Review J. Altern. Complement. Med. 2018 24 624 633 10.1089/acm.2017.0361 29624410 104. Balusamy S.R. Perumalsamy H. Huq M.A. Yoon T.H. Mijakovic I. Thangavelu L. Yang D.C. Rahimi S. A Comprehensive and Systemic Review of Ginseng-Based Nanomaterials: Synthesis, Targeted Delivery, and Biomedical Applications Med. Res. Rev. 2023 43 1374 1410 10.1002/med.21953 36939049 105. Cho S.-H. Chung K.-S. Choi J.-H. Kim D.-H. Lee K.-T. Compound K, a Metabolite of Ginseng Saponin, Induces Apoptosis via Caspase-8-Dependent Pathway in HL-60 Human Leukemia Cells BMC Cancer 2009 9 449 10.1186/1471-2407-9-449 20017956 PMC2806409 106. Han G.C. Ko S.K. Sung J.H. Chung S.H. Compound K Enhances Insulin Secretion with Beneficial Metabolic Effects in Db/Db Mice J. Agric. Food Chem. 2007 55 10641 10648 10.1021/jf0722598 18034458 107. Park E.K. Shin Y.W. Lee H.U. Kim S.S. Lee Y.C. Lee B.Y. Kim D.H. Inhibitory Effect of Ginsenoside Rb1 and Compound K on NO and Prostaglandin E2 Biosyntheses of RAW264.7 Cells Induced by Lipopolysaccharide Biol. Pharm. Bull. 2005 28 652 656 10.1248/bpb.28.652 15802804 108. Shin Y.W. Bae E.A. Kim S.S. Lee Y.C. Kim D.H. Effect of Ginsenoside Rb1 and Compound K in Chronic Oxazolone-Induced Mouse Dermatitis Int. Immunopharmacol. 2005 5 1183 1191 10.1016/j.intimp.2005.02.016 15914323 109. Jeong A. Lee H.-J. Jeong S.-J. Lee H.-J. Lee E.-O. Bae H. Kim S.-H. Compound K Inhibits Basic Fibroblast Growth Factor-Induced Angiogenesis via Regulation of P38 Mitogen Activated Protein Kinase and AKT in Human Umbilical Vein Endothelial Cells Biol. Pharm. Bull. 2010 33 945 950 10.1248/bpb.33.945 20522957 110. Kim S. Kang B.Y. Cho S.Y. Sung D.S. Chang H.K. Yeom M.H. Kim D.H. Sim Y.C. Lee Y.S. Compound K Induces Expression of Hyaluronan Synthase 2 Gene in Transformed Human Keratinocytes and Increases Hyaluronan in Hairless Mouse Skin Biochem. Biophys. Res. Commun. 2004 316 348 355 10.1016/j.bbrc.2004.02.046 15020224 111. Park J.-S. Shin J.A. Jung J.-S. Hyun J.-W. Le T.K.V. Kim D.-H. Park E.-M. Kim H.-S. Anti-Inflammatory Mechanism of Compound K in Activated Microglia and Its Neuroprotective Effect on Experimental Stroke in Mice J. Pharmacol. Exp. Ther. 2012 341 59 67 10.1124/jpet.111.189035 22207656 112. Shieh P.-C. Tsao C.-W. Li J.-S. Wu H.-T. Wen Y.-J. Kou D.-H. Cheng J.-T. Role of Pituitary Adenylate Cyclase-Activating Polypeptide (PACAP) in the Action of Ginsenoside Rh2 against Beta-Amyloid-Induced Inhibition of Rat Brain Astrocytes Neurosci. Lett. 2008 434 1 5 10.1016/j.neulet.2007.12.032 18313848 113. Niu C.-S. Yeh C.-H. Yeh M.-F. Cheng J.-T. Increase of Adipogenesis by Ginsenoside (Rh2) in 3T3-L1 Cell via an Activation of Glucocorticoid Receptor Horm. Metab. Res. 2009 41 271 276 10.1055/s-0028-1103277 19048455 114. Hwang J.-T. Kim S.-H. Lee M.-S. Kim S.H. Yang H.-J. Kim M.-J. Kim H.-S. Ha J. Kim M.S. Kwon D.Y. Anti-Obesity Effects of Ginsenoside Rh2 Are Associated with the Activation of AMPK Signaling Pathway in 3T3-L1 Adipocyte Biochem. Biophys. Res. Commun. 2007 364 1002 1008 10.1016/j.bbrc.2007.10.125 17971295 115. Park J.-S. Park E.-M. Kim D.-H. Jung K. Jung J.-S. Lee E.-J. Hyun J.-W. Kang J.L. Kim H.-S. Anti-Inflammatory Mechanism of Ginseng Saponins in Activated Microglia J. Neuroimmunol. 2009 209 40 49 10.1016/j.jneuroim.2009.01.020 19232442 116. Choi S. Kim T.W. Singh S.V. Ginsenoside Rh2-Mediated G1 Phase Cell Cycle Arrest in Human Breast Cancer Cells Is Caused by P15 Ink4B and p27 Kip1-dependent inhibition of cyclin-dependent kinases Pharm. Res. 2009 26 2280 2288 10.1007/s11095-009-9944-9 19629651 PMC2745112 117. Liu J. Shimizu K. Yu H. Zhang C. Jin F. Kondo R. Stereospecificity of Hydroxyl Group at C-20 in Antiproliferative Action of Ginsenoside Rh2 on Prostate Cancer Cells Fitoterapia 2010 81 902 905 10.1016/j.fitote.2010.05.020 20554003 118. Hou J. Cui C. Kim S. Sung C. Choi C. Ginsenoside F1 Suppresses Astrocytic Senescence-Associated Secretory Phenotype Chem.-Biol. Interact. 2018 283 75 83 10.1016/j.cbi.2018.02.002 29412148 119. Qin M. Luo Y. Lu S. Sun J. Yang K. Sun G. Sun X. Ginsenoside F1 Ameliorates Endothelial Cell Inflammatory Injury and Prevents Atherosclerosis in Mice through A20-Mediated Suppression of NF-κB Signaling Front. Pharmacol. 2017 8 953 10.3389/fphar.2017.00953 29311947 PMC5744080 120. Li B. Qu G. Inhibition of the Hypoxia-Induced Factor-1α and Vascular Endothelial Growth Factor Expression through Ginsenoside Rg3 in Human Gastric Cancer Cells J. Cancer Res. Ther. 2019 15 1642 1646 10.4103/jcrt.JCRT_77_17 31939450 121. Sun M.-Y. Song Y.-N. Zhang M. Zhang C.-Y. Zhang L.-J. Zhang H. Ginsenoside Rg3 Inhibits the Migration and Invasion of Liver Cancer Cells by Increasing the Protein Expression of ARHGAP9 Oncol. Lett. 2019 17 965 973 10.3892/ol.2018.9701 30655855 PMC6313058 122. Song M. Jia F. Cao Z. Zhang H. Liu M. Gao L. Ginsenoside Rg3 Attenuates Aluminum-Induced Osteoporosis Through Regulation of Oxidative Stress and Bone Metabolism in Rats Biol. Trace Elem. Res. 2020 198 557 566 10.1007/s12011-020-02089-9 32173789 123. Liu Y. Fan D. The Preparation of Ginsenoside Rg5, Its Antitumor Activity against Breast Cancer Cells and Its Targeting of PI3K Nutrients 2020 12 246 10.3390/nu12010246 31963684 PMC7019936 124. Zhang D. Wang A. Feng J. Zhang Q. Liu L. Ren H. Ginsenoside Rg5 Induces Apoptosis in Human Esophageal Cancer Cells through the Phosphoinositide-3 Kinase/Protein Kinase B Signaling Pathway Mol. Med. Rep. 2019 19 4019 4026 10.3892/mmr.2019.10093 30942438 PMC6471319 125. Gao X.-F. Zhang J.-J. Gong X.-J. Li K.-K. Zhang L.-X. Li W. Ginsenoside Rg5: A Review of Anticancer and Neuroprotection with Network Pharmacology Approach Am. J. Chin. Med. 2022 50 2033 2056 10.1142/S0192415X22500872 36222119 126. Wei B. Duan Z. Zhu C. Deng J. Fan D. Anti-Anemia Effects of Ginsenoside Rk3 and Ginsenoside Rh4 on Mice with Ribavirin-Induced Anemia Food Funct. 2018 9 2447 2455 10.1039/C8FO00368H 29632923 127. Duan Z. Wei B. Deng J. Mi Y. Dong Y. Zhu C. Fu R. Qu L. Fan D. The Anti-Tumor Effect of Ginsenoside Rh4 in MCF-7 Breast Cancer Cells in Vitro and in Vivo Biochem. Biophys. Res. Commun. 2018 499 482 487 10.1016/j.bbrc.2018.03.174 29596831 128. Jeong S.Y. Kim J.-E. Song G.-Y. Bae J.-S. Rgx365, a Rare Protopanaxatriol-Type Ginsenoside Fraction from Black Ginseng, Suppresses Inflammatory Gene iNOS via the Iinhibition of p-STAT-1 and NF-κB Am. J. Chin. Med. 2020 48 1091 1102 10.1142/S0192415X20500536 32668967 129. Yu Q. Zeng K.-W. Ma X.-L. Jiang Y. Tu P.-F. Wang X.-M. Ginsenoside Rk1 Suppresses Pro-Inflammatory Responses in Lipopolysaccharide-Stimulated RAW264.7 Cells by Inhibiting the Jak2/Stat3 Pathway Chin. J. Nat. Med. 2017 15 751 757 10.1016/S1875-5364(17)30106-1 29103460 130. Hu J.-N. Xu X.-Y. Li W. Wang Y.-M. Liu Y. Wang Z. Wang Y.-P. Ginsenoside Rk1 Ameliorates Paracetamol-Induced Hepatotoxicity in Mice through Inhibition of Inflammation, Oxidative Stress, Nitrative Stress and Apoptosis J. Ginseng Res. 2019 43 10 19 10.1016/j.jgr.2017.07.003 30662289 PMC6323149 131. Hu M. Yang J. Qu L. Deng X. Duan Z. Fu R. Liang L. Fan D. Ginsenoside Rk1 Induces Apoptosis and Downregulates the Expression of PD-L1 by Targeting the NF-κB Pathway in Lung Adenocarcinoma Food Funct. 2020 11 456 471 10.1039/C9FO02166C 31830168 132. Liu H. Zhao J. Fu R. Zhu C. Fan D. The Ginsenoside Rk3 Exerts Anti-Esophageal Cancer Activity in Vitro and in Vivo by Mediating Apoptosis and Autophagy through Regulation of the PI3K/Akt/mTOR Pathway PLoS ONE 2019 14 e0216759 10.1371/journal.pone.0216759 31091245 PMC6519821 133. Tian M. Ma P. Zhang Y. Mi Y. Fan D. Ginsenoside Rk3 Alleviated DSS-Induced Ulcerative Colitis by Protecting Colon Barrier and Inhibiting NLRP3 Inflammasome Pathway Int. Immunopharmacol. 2020 85 106645 10.1016/j.intimp.2020.106645 32521491 134. Rahimi S. Kim J. Mijakovic I. Jung K.-H. Choi G. Kim S.-C. Kim Y.-J. Triterpenoid-Biosynthetic UDP-Glycosyltransferases from Plants Biotechnol. Adv. 2019 37 107394 10.1016/j.biotechadv.2019.04.016 31078628 135. Dai Z. Wang B. Liu Y. Shi M. Wang D. Zhang X. Liu T. Huang L. Zhang X. Producing Aglycons of Ginsenosides in Bakers’ Yeast Sci. Rep. 2014 4 3698 10.1038/srep03698 24424342 PMC3892717 136. Xu F. Valappil A.K. Mathiyalagan R. Tran T.N.A. Ramadhania Z.M. Awais M. Yang D.C. In Vitro Cultivation and Ginsenosides Accumulation in Panax ginseng Plants 2023 12 3165 10.3390/plants12173165 37687411 PMC10489967 137. Chai N. Xu J. Zhang R. Li G. Wen J. Su L. Xue Y. Li T. Liu J. Zeng D. Synthetic Metabolic Engineering of Functional Crops: Boosting Nutrition and Human Health Crop J. 2025 10.1016/j.cj.2025.06.003 138. Zhu Q. Tan J. Liu Y.-G. Molecular Farming Using Transgenic Rice Endosperm Trends Biotechnol. 2022 40 1248 1260 10.1016/j.tibtech.2022.04.002 35562237 139. Zhu Q. Yu S. Zeng D. Liu H. Wang H. Yang Z. Xie X. Shen R. Tan J. Li H. Development of “Purple Endosperm Rice” by Engineering Anthocyanin Biosynthesis in the Endosperm with a High-Efficiency Transgene Stacking System Mol. Plant 2017 10 918 929 10.1016/j.molp.2017.05.008 28666688 140. Zhu Q. Zeng D. Yu S. Cui C. Li J. Li H. Chen J. Zhang R. Zhao X. Chen L. From Golden Rice to aSTARice: Bioengineering Astaxanthin Biosynthesis in Rice Endosperm Mol. Plant 2018 11 1440 1448 10.1016/j.molp.2018.09.007 30296601 141. Chen K. Sun K. Ye C. Liu Y. Hu Y. Jia B. Jiang S. Zou Y. Cao R. Guo J. Metabolic Engineering of Theanine Biosynthesis in Rice Endosperm to Develop Biofortified theaRice for Benefiting Human Health Plant Commun. 2025 6 101411 10.1016/j.xplc.2025.101411 40483556 PMC12447429 142. Zhao M.-L. Li X.-Y. Lan C.-X. Yuan Z.-L. Zhao J.-L. Huang Y. Hu Z.-L. Jia B. Promoting Photosynthetic Production of Dammarenediol-II in Chlamydomonas reinhardtii Int. J. Mol. Sci. 2023 24 11002 10.3390/ijms241311002 37446180 PMC10341690 143. Hu Q.-R. Hong H. Zhang Z.-H. Feng H. Luo T. Li J. Deng Z.-Y. Chen F. Methods on Improvements of the Poor Oral Bioavailability of Ginsenosides: Pre-Processing, Structural Modification, Drug Combination, and Micro- or Nano- Delivery System J. Ginseng Res. 2023 47 694 705 10.1016/j.jgr.2023.07.005 38107396 PMC10721471 144. Gwak Y.S. Han J.Y. Choi Y.E. Production of Ginsenoside Aglycone (Protopanaxatriol) and Male Sterility of Transgenic Tobacco Co-Overexpressing Three Panax ginseng J. Ginseng Res. 2019 43 261 271 10.1016/j.jgr.2018.02.005 30976164 PMC6437448 145. Zheng Z. Liu T. Chai N. Zeng D. Zhang R. Wu Y. Hang J. Liu Y. Deng Q. Tan J. PhieDBEs: A DBD-Containing, PAM-Flexible, High-Efficiency Dual Base Editor Toolbox with Wide Targeting Scope for Use in Plants Plant Biotechnol. J. 2024 22 3164 3174 10.1111/pbi.14438 39031643 PMC11500981 146. Liu T. Zeng D. Zheng Z. Lin Z. Xue Y. Li T. Xie X. Ma G. Liu Y.-G. Zhu Q. The ScCas9 ++ J. Integr. Plant Biol. 2021 63 1611 1619 10.1111/jipb.13164 34411422 147. Liu J. Zhang R. Chai N. Su L. Zheng Z. Liu T. Guo Z. Ma Y. Xie Y. Xie X. Programmable Genome Engineering and Gene Modifications for Plant Biodesign Plant Commun. 2025 6 101427 10.1016/j.xplc.2025.101427 40566685 PMC12365832 148. Sun K. Cheng S. Chai N. Mi J. Zhang R. Qian Q. Zheng Z. Chen K. Zeng D. Peng X. Engineering Adenine Deaminase TadA for Precise and PAM-Flexible Point Mutagenesis and Gradient-Tuning Endogenous Protein Design Adv. Sci. 2025 6 e06644 10.1002/advs.202506644 PMC12442613 40539817 149. Tan J. Sun K. Qian Q. Chai N. Peng X. Shen M. Zhou D. Liu Y.-G. Zhu Q. Liu Q. Development of PAM-Flexible Multiplex Genome Editors for Enhancing Cold-Tolerance in Indica Crop J. 2025 13 991 995 10.1016/j.cj.2025.02.005 150. Zhang R. Chai N. Liu T. Zheng Z. Lin Q. Xie X. Wen J. Yang Z. Liu Y.-G. Zhu Q. The Type V Effectors for CRISPR/Cas-Mediated Genome Engineering in Plants Biotechnol. Adv. 2024 74 108382 10.1016/j.biotechadv.2024.108382 38801866 151. Nielsen J. Synthetic Biology for Engineering Acetyl Coenzyme A Metabolism in Yeast mBio 2014 5 e02153-14 10.1128/mBio.02153-14 25370498 PMC4222110 152. Sun Z. Meng H. Li J. Wang J. Li Q. Wang Y. Zhang Y. Identification of Novel Knockout Targets for Improving Terpenoids Biosynthesis in Saccharomyces cerevisiae PLoS ONE 2014 9 e112615 10.1371/journal.pone.0112615 25386654 PMC4227703 153. Gao H. Pei X. Song X. Wang S. Yang Z. Zhu J. Lin Q. Zhu Q. Yang X. Application and Development of CRISPR Technology in the Secondary Metabolic Pathway of the Active Ingredients of Phytopharmaceuticals Front Plant Sci. 2024 15 1477894 10.3389/fpls.2024.1477894 39850214 PMC11753916 154. Zhang R. Wang Y. Yang W. Wen J. Liu W. Zhi S. Li G. Chai N. Huang J. Xie Y. PlantGPT: An Arabidopsis-Based Intelligent Agent That Answers Questions about Plant Functional Genomics Adv. Sci. 2025 12 e03926 10.1002/advs.202503926 PMC12376578 40397417 Figure 1 Biosynthetic pathway of ginsenosides. G-3-P, Glyceraldehyde 3-phosphate; DXP, 1-Deoxy-D-xylulose 5-phosphate; HMBPP, 4-Hydroxy-3-methylbut-2-enyl diphosphate; HMG-CoA, 3-Hydroxy-3-methylglutaryl-coenzyme A; IPP, isopentanyl pyrophosphate; DMAPP, 3,3-dimethylallyl diphosphate; FPP, farnesyl pyrophosphate; FPS, farnesyl pyrophosphate synthase; SQS, squalene synthase; SQE, squalene epoxidase; DDS, dammarenediol synthase; CYP716A47, CYP716A53v2, and CYP716A52v2 are all Cytochrome P450 oxidases enzymes; PPD, protopanaxadiol; PPT, protopanaxatriol; β-AS, β-amyrin synthase; OA, oleanolic acid. R0, F11, Rh2, Rg3, C-K, F2, F1, Rh1, and Rg2 are all commonly used abbreviations for various ginsenosides. The background colors indicate different biosynthetic pathways: gray for the precursor synthesis MEP and MVA pathways; blue for the carbon chain elongation process; orange for the biosynthesis of OA-type ginsenosides; light yellow for OT-type; pink for PPD-type; and green for PPT-type ginsenosides. Figure 2 Glycosyltransferases: Types and Action Sites. Figure 3 Sustainable production of ginsenosides driven by synthetic biology. ( A Panax B Panax C D plants-14-02821-t001_Table 1 Table 1 Ginsenoside Varieties and Production Levels in Microbial Synthesis Systems. Rare Ginsenoside Synthetic Metabolic Engineering Strategies Microbial Chassis Yield Reference Ginsenoside CK tHMGR PPD ATR2-1 UGTPg1  S. cerevisiae 1.4 mg/L [ 30 tHMG1 ERG9 ERG20 OpDDs PPDDS ATR1 UGT1  Yarrowia lipolytica 161.8 mg/L [ 86 Synpggdds SynPgPPDS VvCPR Pn3-29 PGM1 PGM2 UGP1  S. cerevisiae 1.17 g/L [ 87 PGM2 UGP1 UGT1  S. cerevisiae 1.7 g/L [ 88 tHMG1 PgCPR1 ERG1 ERG20 ERG9 PgDDS PgPPDS ERG12 ERG13 ERG8 ERG19 IDI ERG10 PgUGT1 UGP1 PGM2 YNK1 ALG5  S. cerevisiae 5.74 g/L [ 89 Ginsenoside Rg2 CYP716A53v2 PgUGT71A54 PgURT94 RHM  S. cerevisiae 1.3 g/L [ 45 Ginsenoside Rg3 PgUGT74AE2 PgUGT94Q2  S. cerevisiae 1.3 mg/L [ 56 PgDDS PgPPDS ATR2.1 tHMG1 ERG20 PgERG1 ERG9 PgUGT45 PgUGT29  S. cerevisiae 3.49 μmol/g (DCW) [ 90  PnUGT33  S. cerevisiae 51 mg/L [ 91 Ginsenoside F1 ERG20 ERG1 ERG9 tHMG1 CYP716A53v2 PgCPR1 UGTPg100  S. cerevisiae 42.1 mg/L [ 60 Ginsenoside F2 PgDS tHMG1 PgPPDS IDI AtATR2 PgUGT1 UGT74AE2 ERG20 ERG9 ERG1 ERG7 HAC1 PGM1 PGM2 UGP1  S. cerevisiae 21.0 mg/L [ 92 Ginsenoside Rh1 ERG20 PgERG1 ERG9 tHMG1 CYP716A53v2 PgCPR1 UGTPg100  S. cerevisiae 98.2 mg/L [ 60 Ginsenoside Rh2 ERG20 PgERG1 ERG9 tHMG1 M7-1 PGM.1 UGP1 PgPPDS  S. cerevisiae 300 mg/L [ 93 PgDDS synPgPPDS ATR2.1 tHMG1 ERG20 ERG1 ERG9 UGT45  S. cerevisiae 1.45 μmol/g (DCW) [ 90 ERG20 ERG9 ERG1 tHMG1 DS CYP716A47-ATR1 RG12 ERG13 ERG19 ERG8 IDI ERG1 tHMG1 UGTPn17  S. cerevisiae 354.69 mg/L [ 61 tHMG1 synPgCPR1 ERG1 ERG20 ERG9 synDD SynPPDS  S. cerevisiae 2.25 g/L [ 94  AtSuSy  E. coli 0.20 g/L [ 95 AtSuSy M315F  E. coli 3.7 g/L [ 96 Ginsenoside Re CYP716A53v2 PgUGT71A53 PgUGT71A54 PgURT94 RHM  S. cerevisiae 3.6 g/L [ 12 Ginsenoside Ro GgbAS MtCPR MtCYP716A12 tHMG1 ERG9 ERG1  S. cerevisiae 528.0 ± 18.0 mg/L [ 42 Ginsenoside production. In Table 1 VvCPR Pn3-29 Panax notoginseng PGM YNK ALG RHM M7-1 Panax ginseng SuSy M315F Panax ginseng plants-14-02821-t002_Table 2 Table 2 Pharmacological Activities and Underlying Mechanisms of Key Rare Ginsenosides. Rare Ginsenosides Pharmacological Activity Effects Function Reference Ginsenoside Anticancer Caspase-8 plays a key role in Compound K-stimulated apoptosis via the activation of caspase-3 directly or indirectly through Bid cleavage Inhibit the viability of HL-60 cells, andan IC50 values of 14 muM [ 108 Anti-diabetes By elevating plasma adiponectin levels, hepatic glucose metabolism shifts from gluconeogenesis to glycogenesis, consequently improving insulin sensitivity and leading to upregulated expression of lipogenic genes and glucose transporters in adipose tissue Oral glucose tolerance test (OGTT) using mice, revealed that CK improved glucose tolerance [ 109 Anti-inflammatory Inhibited prostaglandin E2, inducible NO synthase (iNOS) and COX-2 proteins expression in lipopolysaccharide (LPS)-induced RAW264.7 cell Inhibited LPS-induced RAW 264.7 cells, IC50 values of 0.012 and 0.004 mM [ 110 Anti-allergy May ameliorate contact dermatitis or psoriasis by regulating COX-2 produced by macrophages cells and interferon-γ IL-5 and IL-4 induced by Th cells. The level in interferon-γ IL-5 and IL-4 model group decreased 60–70%; 70–80%; 80–90% [ 111 Anti-angiogenesis It exerts anti-angiogenic activity by inhibiting p38 MAPK and AKT in HUVECs, with potential as a cancer chemopreventive agent. Increased the phosphorylation level of p38(50%), blocked the AKT phosphorylation induced (10–20%). [ 112 Antioxidant Up-regulated the gene of hyaluronan synthase2 (HAS2), increased hyaluronan (HA) production in HaCaT cells. The expression level in HaCaT cells was increased by 2.5-fold [ 113 Anti-central neuroinflammatory disorders Reduces the volume of ischemic cerebral infarction induced by middle cerebral artery occlusion and suppresses the activation of microglia in the ischemic cortex The infarction volume was significantly reduced by 30–40%. [ 114 Ginsenoside Rh2 Anti-anxiety, anti-dementia Can induce an increase in PACAP to activate PAC1, but not estrogen receptor, and thereby leads to attenuate Abeta-induced toxicity The expression of PACAP and PCA1 mRNA increased by 200–250% and 180–220%. [ 115 Anti-obesity Can promote preadipocytes differentiation through activating glucocorticoid receptor (GR). The fat-producing capacity of 3T3-L1 cells was increased by 2.2 times, and the expression of adipogenic genes was upregulated by 2 to 8 times. [ 116 Activation of the AMPK signaling pathway leads to the phosphorylation and inhibition of its downstream target ACC, ultimately downregulating the expression of key adipogenic transcription factors PPARγ and C/EBPα. The level of p-AMPKα and p-ACC increased by 2.0–2.5 times and 2.0–3.0 times. [ 117 Anti-inflammatory Significantly suppressed NF-kappaB and MAP kinase activities, which are upstream signaling molecules in inflammation. Inhibit the degradation of IκB-α (by 70–80%) and the phosphorylation of ERK and p38 (by 60–80%) [ 118 Anti-tumor Rh2-mediated cell cycle arrest in human breast cancer cells is caused by p15 (Ink4B) and p27 (Kip1)-dependent inhibition of kinase activities of G(1)-S specific Cdks/cyclin complexes. The expression of p27 (Kip1) protein and p15 (Ink4B) increased by 3 to 4 times and 2 to 3 times [ 119 C 20 IC50 values of 14 μM, induce 35% of cell apoptosis. [ 120 Ginsenoside F1 Antioxidant By inhibiting p38 MAPK-dependent NF-κB activity, it suppresses the senescence-associated secretory phenotype (SASP) in D-galactose-induced astrocytes. The survival rate of neurons has recovered to approximately 85–90%. [ 121 Anti-atherosclerosis Significantly increased A20 expression level and A20 siRNA markedly abolished the attenuation of GF1 on NF-κB nuclear translocation and inflammatory factors expression The expression of A20 increased by 3.5 times, inhibiting approximately 70% of NF-κB pathway activations. [ 122 Ginsenoside Rg3 Anticancer Can inhibit expression of HIF-1α and VEGF in human gastric cancer cells and may influence abdominal implantation metastasis of gastric cancer through inhibiting its expression. Accumulation of HIF-1α protein and VEGF protein secretion lead to an inhibition rate of 60–70% [ 123 Effectively suppressed the migration and invasion of liver cancer cells by upregulating the protein expression of ARHGAP9. Inhibits the migration and invasion abilities of liver cancer cells by 70–75%, and increases the expression of ARHGAP9 by 3 times. [ 124 Anti-osteoporosis By activating the Nrf2/HO-1 signaling pathway, it enhances the body’s antioxidant capacity and alleviates oxidative stress-induced damage to bone cells. And, through activation of the Wnt/β-catenin signaling pathway, it upregulates osteogenesis- related factors (e.g., Runx2) and modulates the OPG/RANKL ratio, thereby promoting bone formation and inhibiting bone resorption. The expression of β-catenin and Nrf2 protein in bone tissue increased by ~60–80% and 150–200%. [ 125 Ginsenoside Rg5 Anticancer Decreased the phosphorylation levels of PI3K, Akt, mTOR, and Bad and suppressed the PI3K/Akt signaling pathway in breast cancer. The IC50 values of 27–33 μM, induces approximately 40% cell apoptosis and inhibits approximately 50–60% of cell migration and invasion. [ 126 May have a tumor-suppressive effect on esophageal cancer by promoting apoptosis and may be associated with the downregulation of the PI3K/Akt signaling pathway. The expression of p-PI3K p85 and p-Akt (Ser473) protein was inhibited by ~50–60% and 60–70%. [ 127 neuroprotective Exerts its therapeutic effects mainly through PI3K/AKT, MAPK signaling pathways, and the regulation of apoptosis and cell cycle. Protect neurons from damage (increase cell vitality by 30%). [ 128 Ginsenoside Rh4 Anti-anemia Some positive regulators (EPO, erythroid transcription factor-1, and interleukin-3) related to hematopoiesis increased and some negative regulators (interferon-γ and tumor necrosis factor-α) decreased in vivo The expression of Nrf2/HO-1 protein increased by 150–200%, inhibiting the apoptosis of bone marrow hematopoietic cells. [ 129 Anti-tumor Decreasing Bcl-2, increasing Bax, and activating caspase-8, -3 and PARP. Repressing 60% of tumor growth [ 130 Ginsenoside Rs6 Anti-inflammatory By suppressing the activation of p-STAT-1 (phosphorylated signal transducer and activator of transcription 1) and NF-KB (nuclear factor kappa- light-chain-enhancer of activated B cells), it blocks the inflammatory signaling pathway. Inhibit the NF-κB and STAT1 pathway by 50–60%. [ 131 Ginsenoside Rk1 Anti-inflammatory Inhibited the lipopolysaccharide-stimulated phosphorylation of NF-κB and janus kinase (Jak)2 and signal transducer and activator of transcription (Stat)3 at Ser727 and Tyr705. The inhibition rates of p-Jak2 and p-Stat3 reached 80% and 90%. [ 132 Antioxidation Due to its antioxidation, antiapoptosis, anti- inflammation, and antinitrative effects in APAP- induced hepatotoxicity. The apoptotic index of liver tissue (TUNEL) decreased by 70–80% [ 133 Anticancer Reduced the high expression of PD-L1 in lung adenocarcinoma cells by inhibiting NF-κB signaling. By inhibiting the NF-κB pathway (80% for p-p65), 50% of tumor growth can be suppressed. [ 134 Ginsenoside Rk3 Anticancer Inhibit Eca109 and KYSE150 cell proliferation through activating apoptosis and autophagy by blocking the PI3K/Akt/mTOR pathway. The volume and weight of the tumor in the body was reduced by 50–60%, and 55–65%. [ 135 Anti-inflammatory Can improve DSS-induced ulcerative colitis by protecting intestinal barrier function and inhibiting NLRP3 inflammasome expression, The length of the colon was improved by approximately 42%, tissue damage was reduced by about 60%, [ 136 ",
  "metadata": {
    "Title of this paper": "PlantGPT: An Arabidopsis-Based Intelligent Agent That Answers Questions about Plant Functional Genomics",
    "Journal it was published in:": "Plants",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473280/"
  }
}