{
  "title": "Paper_236",
  "abstract": "pmc J Clin Nurs J Clin Nurs 379 blackwellopen JOCN Journal of Clinical Nursing 0962-1067 1365-2702 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12489446 PMC12489446.1 12489446 12489446 40033381 10.1111/jocn.17710 JOCN17710 JCN-2024-3104.R1 1 Empirical Research Quantitative Empirical Research Quantitative Geriatric Nutritional Risk Index and In‐Hospital Mortality and Costs in Older Inpatients With and Without Cancer: A Retrospective Observational Study Huang Lujiao https://orcid.org/0009-0009-4336-6057  1  2 Zhou Xue  2 Song Yi  2 Xiao Xiong  3 Cui Mingyu  1 Zhu Zhu  4 Yang Mengjiao  1  5 Pei Yu  1 Anme Tokie  6 tokieanme@gmail.com   1 Graduate School of Comprehensive Human Sciences University of Tsukuba Tsukuba Japan   2 Department of Clinical Nutrition, Sichuan Provincial People's Hospital University of Electronic Science and Technology of China Chengdu China   3 West China School of Public Health and West China Fourth Hospital Sichuan University Chengdu China   4 School of Nursing Hangzhou Normal University Hangzhou China   5 Department of Cardiovascular Surgery Affiliated Hospital of North Sichuan Medical College Nanchong China   6 Faculty of Medicine University of Tsukuba Tsukuba Japan * Correspondence: tokieanme@gmail.com 03 3 2025 11 2025 34 11 498134 10.1111/jocn.v34.11 4630 4641 26 1 2025 05 8 2024 18 2 2025 02 10 2025 03 10 2025 03 10 2025 © 2025 The Author(s). Journal of Clinical Nursing https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Aims To explore the association of the Geriatric Nutritional Risk Index (GNRI) with in‐hospital mortality and costs in older inpatients and to compare these associations between cancer and non‐cancer patients to inform clinical practice. Design Retrospective observational study. Methods A hospital‐based study was conducted in Southwest China between January 2018 and December 2020. Demographic, clinical, laboratory and anthropometric data of inpatients aged 65 and over, along with hospitalisation deaths and costs, were collected through the Hospital Information System of a general hospital and its affiliates. GNRI was calculated at admission to assess nutritional risk. Marginal structural models and stratified analyses estimated hospitalisation outcomes for older inpatients with and without various types of cancer across different nutritional risk grades. Results Among 37,267 participants, in‐hospital mortality and costs increased with higher nutritional risk. Older inpatients with major nutritional risk had significantly higher mortality and costs than those with no nutritional risk. Older cancer inpatients with major nutritional risk had the highest mortality and costs, significantly exceeding those of non‐cancer inpatients. For each cancer type, increased nutritional risk was associated with higher in‐hospital mortality and costs. Respiratory cancer inpatients with major nutritional risk had the highest mortality, while digestive cancer inpatients had the highest costs. Conclusion Higher GNRI‐assessed nutritional risk was associated with increased in‐hospital mortality and costs in older inpatients, with stronger associations observed in cancer patients compared to non‐cancer patients. Integrating GNRI into routine nursing practice could have significant clinical and economic benefits by promoting early nutritional screening in patient care and targeted interventions to reduce mortality and healthcare costs in high‐risk populations. Implications for the Profession and/or Patient Care Integrating GNRI assessment into routine patient care can effectively identify patients at high risk for in‐hospital mortality and costs, allowing for timely nutritional support to enhance patient outcomes. GNRI, as a simple and globally applicable tool, can be integrated into diverse healthcare settings, providing an effective method for nutritional risk screening in older patients. When applying GNRI in clinical nursing and medical practice, special consideration should be given to the presence and type of cancer, as cancer patients with severe nutritional risk may benefit the most from targeted interventions. Impact What problem did the study address? This study investigated the association between GNRI‐assessed nutritional risk and in‐hospital mortality and costs in older inpatients. It further examined whether these associations differ between cancer and non‐cancer patients and among different cancer types to improve clinical application. What were the main findings? The study found that higher nutritional risk assessed by GNRI was associated with increased in‐hospital mortality and costs in older inpatients. These associations were stronger in older cancer patients compared to non‐cancer patients, with respiratory cancers showing the highest mortality and digestive cancers incurring the highest costs. These findings emphasise the important role of nutritional screening using GNRI in patient care with varying clinical profiles and informing nursing and medical strategies globally, particularly in resource‐limited settings. Where and on whom will the research have an impact? The findings are relevant to older inpatients in hospital settings worldwide, particularly those with cancer, as well as to nurses and healthcare professionals. GNRI provides a practical and easily implementable tool for them to assess nutritional risks upon admission and guide timely nutritional support strategies based on clinical profiles including cancer presence and type in older inpatients. Incorporating GNRI into routine nursing care, nurses and healthcare professionals will be better equipped to address nutritional risks, ultimately improving patient care and optimising clinical and economic outcomes for older patients. Reporting Method We have adhered to relevant EQUATOR guidelines, specifically following the STROBE (strengthening the reporting of observational studies in epidemiology) guidelines for reporting this observational study. Patient or Public Contribution No public contribution was required in the design or conduct of this research. Patients contributed through data collected from the Hospital Information System, which was used for analysis. aged geriatric nursing geriatric nutritional risk index GNRI hospital costs hospital mortality inpatients neoplasms nutrition assessment pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date November 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:02.10.2025  Funding: Statistician: Xiong Xiao. Abbreviations Alb albumin BMI body mass index ESPEN European Society of Clinical Nutrition and Metabolism GNRI geriatric nutritional risk index HIS hospital information system ICD‐10 International Classification of Diseases, 10th Revision IPW inverse probability weighting  Summary  What does this paper contribute to the wider global clinical community? ○ Highlighting GNRI‐assessed nutritional risk as a reliable indicator of in‐hospital mortality and costs in a large sample of older inpatients, addressing a pressing global healthcare challenge. ○ Demonstrating significant differences in the associations of GNRI with in‐hospital mortality and costs between cancer and non‐cancer patients, as well as among cancer types, providing evidence for context‐specific nursing and medical strategies. ○ Supporting the integration of GNRI into routine care worldwide, particularly in settings with growing aging populations and increasing cancer prevalence. 1 Introduction Malnutrition is a prevalent yet often overlooked issue among older inpatients (Bellanti et al. 2022 2017 2008 2012 2020 2019 2005 2011 2021 2020 2020 2022 2 Background Cancer has emerged as a significant health and economic challenge worldwide, with its disease burden rapidly increasing due to population growth and ageing (Sung et al. 2021 2023 2023 2020 Malnutrition as an intervenable factor affects approximately half of hospitalised older patients globally (Bellanti et al. 2022 2015 2021 2019 2016 2003 2016 2019 2008 2021 2017 2020 2023 2003 3 Aims This study aimed to answer: (1) What is the association of GNRI‐assessed nutritional risk with in‐hospital mortality and costs in older inpatients? (2) Do these associations differ between cancer and non‐cancer patients, and among different cancer types? We hypothesised that a lower GNRI score (indicating higher nutritional risk) is associated with increased in‐hospital mortality and costs, with more pronounced associations in cancer patients compared to non‐cancer patients, and with variations among cancer types. 4 Methods 4.1 Study Design and Setting A retrospective observational study was designed to examine the association of GNRI with in‐hospital mortality and costs in older inpatients using medical data from the Hospital Information System (HIS) of a large general hospital (A comprehensive teaching hospital with 4300 beds and the Geriatrics Center of Sichuan Province) and its affiliated hospitals between January 2018 and December 2020. 4.2 Data Extraction and Preprocessing All inpatients aged 65 and over were selected from the HIS. The extracted data fields, including admission and discharge details, demographics, diagnosis information, surgical information, hospital expenditure, laboratory results and anthropometric measurements, were sourced from clinical, laboratory and anthropometry datasets. The hospital information department mapped this data to its corresponding locations within the HIS database. Information from the three datasets was then integrated into corresponding records for each patient using the unique inpatient number. For patients with multiple hospitalisations, the most recent record based on the ‘record date’ was selected. If the required data were unavailable for the most recent admission, the second most recent record was used. For multiple measurements of height, weight and albumin during a single admission, the earliest measurements based on the ‘measurement date’ were chosen. Finally, each patient had one hospitalisation record included in the preliminary screening dataset. 4.3 Sample Selection The initial geriatric inpatient dataset comprised 39,653 patients (age ≥ 65 years). Inpatients missing height, weight or albumin information, essential for calculating GNRI and central to this study, were excluded ( n 2023 n 1 FIGURE 1 Flow chart illustrating the sample selection process of the study. 4.4 Data Collection 4.4.1 Nutritional Risk Assessment The GNRI was calculated to assess the nutritional risk of the older inpatients using height, body weight and albumin upon admission. Height (cm) was measured with a stadiometer (accuracy of 0.1 cm) or estimated from knee height for non‐ambulatory inpatients using validated equations (Chumlea et al. 1985 2000 The formula for calculating GNRI is as follows: GNRI = 1.489 × serum albumin + 41.7 × (actual body weight/ideal body weight) (Bouillanne et al. 2005 2009 2 Nutritional risk was classified into four grades based on GNRI values (Bouillanne et al. 2005 4.4.2 Hospitalisation Outcomes 4.4.2.1 In‐Hospital Mortality This was defined as any death occurring during the hospitalisation period, from admission until discharge or death. The in‐hospital mortality rate was calculated as follows: (number of in‐hospital deaths/number of admissions) × 100%. 4.4.2.2 Hospital Costs Total hospital costs were calculated by summing all charges incurred during the older patient's hospitalisation, including accommodation, medication, laboratory tests, surgeries and other healthcare services. This calculation captured all costs from admission until discharge or death. 4.4.3 Covariates Covariates were selected based on existing literature and clinical relevance. These include demographic factors (age, sex, ethnicity, marital status) and clinical variables (admission diagnosis, surgical status) (Castel et al. 2006 2023 2019 2019 2014 4.4.4 Classification of Diseases Diseases of the inpatients were categorised according to the International Classification of Diseases 10th Revision (ICD‐10). All inpatients were divided into cancer and non‐cancer groups based on admission diagnosis (C00–C97). Cancer patients were further categorised into four sub‐groups: digestive system (C15–C26), respiratory and intrathoracic system (C30–C39), lymphoid and haematopoietic system (C81–C96) and others. 4.5 Statistical Analysis Inpatient characteristics were described as mean (SD) for continuous variables and numbers (%) for categorical variables, based on cancer status and nutritional risk assessed by GNRI. T To estimate in‐hospital mortality and costs among older inpatients with varying nutritional risks, a marginal structural model based on inverse probability weighting (IPW) was implemented in a two‐step procedure. First, a logistic model using potential confounders was fitted to predict the propensity score for each individual inpatient; then, IPW with the propensity score was applied to balance confounders between different GNRI groups and ensure comparability. Second, logistic and log‐linear models were fitted as the marginal structural model, with in‐hospital death and costs as the dependent variables and GNRI‐based nutritional risk as the independent variable. This method was chosen because it better balances confounders via IPW and allows for direct estimation of outcomes for each nutritional risk subgroup without requiring a reference group (Hernan and Robins 2020 4.6 Ethical Considerations This study was approved by the Medical Ethics Committee of the University of Tsukuba [Approval Number: No. 1829], as well as by the Medical Ethics Committee of Sichuan Academy of Medical Sciences and Sichuan Provincial People's Hospital, with exemption from informed consent granted [Approval Number: Lunshen (Yan), 2021, No. 258]. 5 Results 5.1 Comparison of Patient Characteristics A total of 37,267 older inpatients were enrolled in the study, including 2013 cancer patients (5.4%) and 35,254 non‐cancer patients (94.6%). There were 20,993 men (56.3%) and 16,274 women (43.7%), with an average age of 74.6 (7.4) years. More than half (56.3%) had varying nutritional risks: 9008 with low nutritional risk (24.2%), 8229 with moderate nutritional risk (22.1%) and 3716 with major nutritional risk (10.0%). The older inpatients' in‐hospital mortality was 1.7%, and the total hospital cost was 31,819 (38,635) CNY. Comparisons of characteristics by cancer status and nutritional risk grades are shown in Table 1 TABLE 1 Characteristics of the study population according to cancer status and nutritional risk grades  a Characteristics Total Cancer status  p  b Nutritional risk (Assessed by GNRI)  p  b Cancer Non‐cancer No risk (GNRI > 98) Low risk (92 ≤ GNRI ≤ 98) Moderate risk (82 ≤ GNRI < 92) Major risk (GNRI < 82) Number of the study population 37,267 2013 35,254 — 16,314 (43.7%) 9008 (24.2%) 8229 (22.1%) 3716 (10.0%) — Age (years) 74.6 (7.4) 73.1 (6.6) 74.7 (7.4) < 0.001 73.2 (6.56) 75.1 (7.38) 76.3 (7.98) 76.2 (7.99) < 0.001 Sex Male 20,993 (56.3%) 1349 (67.0%) 19,644 (55.7%) < 0.001 8393 (51.4%) 5116 (56.8%) 5114 (62.1%) 2370 (63.8%) < 0.001 Female 16,274 (43.7%) 664 (33.0%) 15,610 (44.3%) 7921 (48.6%) 3892 (43.2%) 3115 (37.9%) 1346 (36.2%) BMI 22.97 (3.6) 22.3 (3.3) 23.0 (3.6) < 0.001 24.3 (3.00) 23.2 (3.37) 21.5 (3.56) 19.8 (3.83) < 0.001 Thinness (BMI < 18.5) 3947 (10.6%) 266 (13.2%) 3681 (10.4%) < 0.001 205 (1.26%) 539 (5.98%) 1648 (20.0%) 1555 (41.8%) < 0.001 Normal (18.5 ≤ BMI ≤ 24) 19,187 (51.5%) 1126 (55.9%) 18,061 (51.2%) 7849 (48.1%) 5081 (56.4%) 4632 (56.3%) 1625 (43.7%) Overweight (24 ≤ BMI < 28) 11,135 (29.9%) 532 (26.4%) 10,603 (30.1%) 6514 (39.9%) 2632 (29.2%) 1572 (19.1%) 417 (11.2%) Obesity (BMI ≥ 28) 2998 (8.0%) 89 (4.4%) 2909 (8.2%) 1746 (10.7%) 756 (8.39%) 377 (4.58%) 119 (3.20%) Ethnicity Ethnic minority 1495 (4.0%) 76 (3.8%) 1419 (4.0%) 0.619 479 (2.94%) 421 (4.67%) 396 (4.81%) 199 (5.36%) < 0.001 Non‐ethnic minority 35,772 (96.0%) 1937 (96.2%) 33,835 (96.0%) 15,835 (97.1%) 8587 (95.3%) 7833 (95.2%) 3517 (94.6%) Marital status Married 35,058 (94.2%) 1934 (96.2%) 33,124 (94.1%) < 0.001 15,488 (94.9%) 8483 (94.2%) 7653 (93.0%) 3434 (92.4%) < 0.001 Unmarried 205 (0.6%) 12 (0.6%) 193 (0.6%) 81 (0.50%) 40 (0.44%) 58 (0.70%) 26 (0.70%) Others 1955 (5.3%) 65 (3.2%) 1890 (5.4%) 745 (4.57%) 485 (5.38%) 518 (6.29%) 256 (6.89%) Disease type  c Malignant neoplasms 2013 (5.4%) 2013 (100%) — — 539 (3.30%) 495 (5.50%) 583 (7.08%) 396 (10.7%) < 0.001 Diseases of the circulatory system 10,676 (28.6%) — 10,676 (30.3%) 5937 (36.4%) 2562 (28.4%) 1751 (21.3%) 426 (11.5%) Diseases of the respiratory system 4230 (11.4%) — 4230 (12.0%) 1062 (6.51%) 1078 (12.0%) 1367 (16.6%) 723 (19.5%) Diseases of the digestive system 3725 (10.0%) — 3725 (10.6%) 1406 (8.62%) 767 (8.51%) 959 (11.7%) 593 (16.0%) Diseases of the genitourinary system 2024 (5.4%) — 2024 (5.8%) 632 (3.87%) 505 (5.61%) 542 (6.59%) 345 (9.28%) Diseases of the nervous system 1344 (3.6%) — 1344 (3.8%) 758 (4.65%) 318 (3.53%) 222 (2.70%) 46 (1.24%) Diseases of the blood 281 (0.8%) — 281 (0.8%) 58 (0.36%) 68 (0.75%) 96 (1.17%) 59 (1.59%) Endocrine, nutritional, metabolic diseases 1356 (3.6%) — 1356 (3.9%) 723 (4.43%) 324 (3.60%) 237 (2.88%) 72 (1.94%) Injury, poisoning 701 (1.9%) — 701 (2.0%) 181 (1.11%) 183 (2.03%) 226 (2.75%) 111 (2.99%) Others 10,917 (29.3%) — 10,917 (31.0%) 5018 (30.8%) 2708 (30.1%) 2246 (27.3%) 945 (25.4%) Undergoing surgery Yes 23,177 (37.8%) 1589 (78.9%) 21,588 (61.2%) < 0.001 10,121 (62.0%) 5336 (59.2%) 5093 (61.9%) 2627 (70.7%) < 0.001 No 14,090 (62.2%) 424 (21.1%) 13,666 (38.8%) 6193 (38.0%) 3672 (40.8%) 3136 (38.1%) 1089 (29.3%) Laboratory indicator Serum Albumin (Alb) (g/L) 37.3 (5.6) 34.8 (6.05) 37.4 (5.5) < 0.001 41.8 (2.65) 37.1 (1.99) 33.2 (2.91) 26.9 (4.27) < 0.001 GNRI 95.2 (9.6) 91.0 (10.2) 95.4 (9.4) < 0.001 103 (3.86) 95.2 (1.75) 87.7 (2.82) 75.7 (5.30) < 0.001 No nutritional risk (GNRI > 98) 16,314 (43.7%) 539 (26.8%) 15,775 (44.7%) < 0.001 16,314 (100%) — — — — Low nutritional risk (92 ≤ GNRI ≤ 98) 9008 (24.2%) 495 (24.6%) 8513 (24.1%) — 9008 (100%) — — — Moderate nutritional risk (82 ≤ GNRI < 92) 8229 (22.1%) 583 (29.0%) 7646 (21.7%) — — 8229 (100%) — — Major nutritional risk (GNRI < 82) 3716 (10.0%) 396 (19.7%) 3320 (9.42%) — — — 3716 (100%) — In‐hospital mortality 632 (1.7%) 85 (4.22%) 547 (1.55%) < 0.001 84 (0.51%) 89 (0.99%) 220 (2.67%) 239 (6.43%) < 0.001 Hospital costs (CNY) 31,819 (38,635) 51,846 (49,139) 30,676 (37,628) < 0.001 27,134 (32,686) 30,713 (37,367) 35,810 (42,960) 46,232 (49,665) < 0.001  a Statistical descriptions for continuous variables were presented as mean and standard deviation (SD), and categorical variables were presented as numbers and percentages (%).  b Chi‐square test, t  c The disease types were classified according to the ICD‐10 code of admission diagnosis of patients. The admission diagnosis of patients collected in this study was the only major diagnosis, so the disease classifications of cancer patients and non‐cancer patients were consistent with that of all patients. Older cancer inpatients had lower Alb levels 34.8 (6.05) g/L and higher rates of thinness (13.2%), surgery (78.9%) and low, moderate and major nutritional risks assessed by GNRI (24.6%, 29.0% 19.7%), in‐hospital mortality (4.22%), and greater hospital costs 51,846 (49,139) CNY than non‐cancer inpatients. Among different nutritional risk grades, older inpatients with lower GNRI had higher rates of thinness (41.8%), surgery (70.7%), in‐hospital mortality (6.43%), elevated hospital costs 46,232 (49,665) CNY and lower albumin levels 26.9 (4.27) g/L compared to those with higher GNRI. All differences were statistically significant ( p 5.2 The Associations of GNRI The estimated in‐hospital mortality and hospital costs of older inpatients associated with GNRI‐assessed nutritional risks were calculated using a marginal structural model. After adjusting for potential confounders, a consistent increase in the values of the hospitalisation outcomes from no nutritional risk to major nutritional risk was observed, as shown in Table 2 TABLE 2 Marginal structural model estimates of in‐hospital mortality and costs across nutritional risk grades assessed by GNRI in cancer and non‐cancer patients  a Nutritional risk assessed by GNRI In‐hospital mortality (%)  χ 2  b  p Hospital costs (CNY)  χ 2  b  p Total Cancer Non‐cancer Total Cancer Non‐cancer No nutritional risk  0.6 (0.5, 0.7)  1.4 (1.0, 2.1)  0.5 (0.5, 0.6) 25.4 < 0.001  26,606 (25,791, 27,446)  43,633 (39,573, 48,109)  25,621 (24,800, 26,469)  102.7  < 0.001 Low nutritional risk  1.0 (0.8, 1.2)  1.4 (0.8, 2.3)  1.0 (0.8, 1.1)  1.2 0.279  31,511 (30,253, 32,821)  48,456 (42,474, 55,279)  30,537 (29,265, 31,864)  27.5   < 0.001 Moderate nutritional risk  2.5 (2.2, 2.9)  4.0 (2.7, 6)  2.4 (2.1, 2.8)  3.0 0.084  36,775 (35,389, 38,216)  52,612 (46,327, 59,750)  35,865 (34,456, 37,331)  19.9  < 0.001 Major nutritional risk  5.5 (4.9, 6.3)  12.3 (8.7, 17)  5.1 (4.5, 5.9) 10.6 0.001  42,739 (41,197, 44,340)  65,670 (58,400, 73,845)  41,379 (39,818, 43,002) 31.7 < 0.001  t  c 42.4 15.0 39.67 — — 27.6 7.3 26.8 — —  p < 0.001 < 0.001 < 0.001 — — < 0.001 < 0.001 < 0.001 — —  a In‐hospital mortality and Hospital costs were presented by estimated values and 95% Confidence Intervals.  b The χ 2  c The t The in‐hospital mortality and costs were significantly affected by the nutritional risk assessed by GNRI. Compared to patients with no nutritional risk, those with major nutritional risk had a higher in‐hospital mortality rate of 5.5%, representing a 4.9% increase. Similarly, there was a noticeable increase in hospital costs among patients with major nutritional risk, amounting to 42,739 CNY compared to 26,606 CNY for those with no nutritional risk. Significant differences were observed across nutritional risk groups, with a linear trend in estimated outcomes with increasing nutritional risk ( p 5.3 Stratified Analysis The estimated values for in‐hospital mortality and hospital costs varied substantially between cancer and non‐cancer inpatients. Older cancer patients had even worse hospitalisation outcomes, with the highest mortality (12.3%) in those with major nutritional risk, while non‐cancer patients with major nutritional risk had a 5.1% mortality rate. Non‐cancer patients with no nutritional risk had the lowest mortality, indicating the benefits of maintaining proper nutrition. Regarding the financial implications of GNRI, older cancer patients with major nutritional risk incurred costs (65,670 CNY) nearly 2.6 times higher than non‐cancer patients with no nutritional risk (25,621 CNY). Furthermore, our study revealed potential cost savings of up to 22,037 and 15,758 CNY for cancer and non‐cancer patients with no nutritional risk, respectively. Significant differences were observed across cancer status and nutritional risk groups, with a linear trend in estimated outcomes with increasing nutritional risk ( p In the sub‐analysis of cancer patients, as nutritional risk increased, both in‐hospital mortality and costs rose for each type of cancer, and the differences were statistically significant (Figure 2 p FIGURE 2 Estimated in‐hospital mortality and costs across nutritional risk grades assessed by GNRI in various types of cancer. *The value could not be estimated due to a relatively small sample size, likely caused by unstable weights in the IPW method. Sample sizes for each cancer type and nutritional risk grade are provided in Table S1 wileyonlinelibrary.com 6 Discussion The present study revealed that a higher nutritional risk assessed by GNRI was significantly associated with increased in‐hospital mortality and costs in both cancer and non‐cancer inpatients, with the association being stronger in cancer patients, and respiratory and digestive cancers being the most affected. These results support our hypothesis that GNRI‐assessed nutritional risk is a key factor associated with hospitalisation outcomes, particularly in older cancer patients who face unique nutritional challenges due to the disease and its treatments. Our study found that over half (56.3%) of older inpatients had varying degrees of nutritional risk, similar to reports from Europe (58.0%) and America (66.7%) (Cereda et al. 2015 2020 2013 2010 2021 2019 2017 Unadjusted descriptive analysis in Table 1 2006 2017 2005 2008 2021 2012 It is worth noting that our results showed differences in the associations between GNRI and hospitalisation outcomes for cancer and non‐cancer patients. Cancer patients with major nutritional risk had the highest mortality and costs, while non‐cancer patients with no nutritional risk had the lowest. For cancer patients, a lower GNRI not only indicated high‐risk malnutrition but also reflected overall deterioration, including immune suppression, reduced treatment compliance and cachexia, leading to poor prognosis (Ruan et al. 2021 1989 2021 Additionally, older cancer patients, who are highly susceptible to malnutrition due to both ageing and cancer‐related factors, often experience higher mortality rates (Zhang et al. 2021 This study has some limitations that should be noted. This research was conducted in a single comprehensive hospital, potentially introducing selection bias and limiting the generalisability of findings to other regions or populations. The theoretical applicability of GNRI findings may also vary across different healthcare settings and patient populations, influenced by cultural and systemic factors. Additionally, as a retrospective observational study, causality cannot be established. This study also did not account for temporal changes in GNRI scores or other clinical variables during hospitalisation, which could provide evidence into the dynamic relationship between nutritional risk and outcomes. While well‐established covariates were included to adjust for confounding, residual confounding may still exist due to unmeasured factors such as comorbidities, variations in treatment protocols or differences in healthcare access. 7 Implications Integrating GNRI into routine nursing care provides a practical tool for early identification of nutritional risk among older inpatients, particularly those with cancer. By incorporating GNRI screening at admission, healthcare providers can target high‐risk patients for timely nutritional interventions, potentially reducing in‐hospital mortality and healthcare costs. Special attention should be given to older cancer patients with major nutritional risks, as they are particularly vulnerable to poor outcomes. Training programmes for healthcare professionals should focus on the importance of nutritional risk screening and the application of GNRI in diverse clinical settings. Nurses, as primary facilitators of nutritional care, should be equipped with skills to interpret GNRI scores and implement targeted interventions. Interdisciplinary training that includes dietitians and physicians can foster collaboration, ensuring a comprehensive approach to managing malnutrition. Future research should validate these findings in multi‐centre studies across diverse healthcare settings and explore the cost‐effectiveness of GNRI‐based interventions to support their practical application in resource‐limited environments. Longitudinal studies are also needed to estimate the long‐term association of nutritional interventions guided by GNRI with post‐discharge outcomes. Furthermore, addressing unmeasured confounding factors, such as comorbidities and treatment protocols, could refine the clinical utility of GNRI and ensure its effective integration into routine care for older inpatients. 8 Conclusion In conclusion, GNRI is an easy‐to‐assess nutritional screening tool that shows an association with in‐hospital mortality and costs in older inpatients with and without cancer. Higher nutritional risk assessed by GNRI is significantly associated with increased in‐hospital mortality and costs in older inpatients, with stronger associations observed in cancer patients compared to non‐cancer patients. These findings highlight the importance of nutritional risk assessment in identifying high‐risk populations upon admission. Integrating GNRI into routine nursing practice provides a practical approach to early nutritional screening and intervention. By enabling timely identification of high‐risk patients, particularly those with cancer, GNRI can help improve clinical outcomes and reduce healthcare costs. Author Contributions Lujiao Huang, Tokie Anme: Conceptualisation. Xue Zhou: Project administration. Lujiao Huang, Xue Zhou, Yi Song, Xiong Xiao: Data Curation. Lujiao Huang, Xiong Xiao: Formal analysis. Xiong Xiao: Software. Tokie Anme: Supervision. Lujiao Huang: Writing – original draft. Mingyu Cui, Zhu Zhu, Mengjiao Yang, Yu Pei: Writing – review and editing. All authors have read and approved the final version of the manuscript. Disclosure The authors confirm that the data utilised in this manuscript have been lawfully acquired and comply with The Nagoya Protocol on Access to Genetic Resources and the Fair and Equitable Sharing of Benefits Arising from Their Utilisation to the Convention on Biological Diversity. Conflicts of Interest The authors declare no conflicts of interest. Supporting information Table S1 Data S1 Acknowledgements The authors are deeply grateful to the patients whose data were used in this study; their participation is invaluable. We would also like to thank all the staff at the hospital information department for their assistance in providing the necessary data for this research. Data Availability Statement The datasets analysed in this study are available from the corresponding author upon a reasonable request. References Arends J. P. Bachmann V. Baracos 2017 ESPEN Guidelines on Nutrition in Cancer Patients Clinical Nutrition 36 1 11 48 10.1016/j.clnu.2016.07.015 27637832 Bellanti F. A. Lo Buglio S. Quiete G. Vendemiale 2022 Malnutrition in Hospitalized Old Patients: Screening and Diagnosis, Clinical Outcomes, and Management Nutrients 14 4 910 10.3390/nu14040910 35215559 PMC8880030 Bouillanne O. G. Morineau C. Dupont 2005 Geriatric Nutritional Risk Index: A New Index for Evaluating At‐Risk Elderly Medical Patients American Journal of Clinical Nutrition 82 4 777 783 10.1093/ajcn/82.4.777 16210706 Castel H. D. Shahar I. Harman‐Boehm 2006 Gender Differences in Factors Associated With Nutritional Status of Older Medical Patients Journal of the American College of Nutrition 25 2 128 134 10.1080/07315724.2006.10719523 16582029 Cereda E. C. Klersy C. Pedrolli 2015 The Geriatric Nutritional Risk Index Predicts Hospital Length of Stay and In‐Hospital Weight Loss in Elderly Patients Clinical Nutrition 34 1 74 78 10.1016/j.clnu.2014.01.017 24508351 Cereda E. D. Limonta C. Pusani A. Vanotti 2006 Geriatric Nutritional Risk Index: A Possible Indicator of Short‐Term Mortality in Acutely Hospitalized Older People Journal of the American Geriatrics Society 54 6 1011 1012 10.1111/j.1532-5415.2006.00754.x 16776806 Cereda E. C. Pedrolli A. Zagami 2011 Nutritional Screening and Mortality in Newly Institutionalised Elderly: A Comparison Between the Geriatric Nutritional Risk Index and the Mini Nutritional Assessment Clinical Nutrition 30 6 793 798 10.1016/j.clnu.2011.04.006 21723010 Chumlea W. C. A. F. Roche M. L. Steinbaugh 1985 Estimating Stature From Knee Height for Persons 60 to 90 Years of Age Journal of the American Geriatrics Society 33 2 116 120 10.1111/j.1532-5415.1985.tb02276.x 3968366 D'Almeida C. A. W. A. F. Peres N. B. De Pinho R. B. Martucci V. D. Rodrigues A. Ramalho 2020 Prevalence of Malnutrition in Older Hospitalized Cancer Patients: A Multicenter and Multiregional Study Journal of Nutrition, Health & Aging 24 2 166 171 10.1007/s12603-020-1309-4 32003406 Dent E. E. O. Hoogendijk R. Visvanathan O. R. L. Wright 2019 Malnutrition Screening and Assessment in Hospitalised Older People: A Review Journal of Nutrition, Health & Aging 23 5 431 441 10.1007/s12603-019-1176-z PMC12280429 31021360 Dou Y. P. Wang F. Yuan 2017 The Geriatric Nutritional Risk Index May Predict Healthcare Costs and Health Transitions During Hemodialysis in China Asia Pacific Journal of Clinical Nutrition 26 1 6 10 10.6133/apjcn.122015.03 28049255 Ferrari‐Baliviera E. S. Pierdominici L. Sarcinelli 1989 Effects of the Nutritional Status on the Respiratory System Minerva Anestesiologica 55 11 443 450 2699012 Guerra R. S. A. S. Sousa I. Fonseca 2016 Comparative Analysis of Undernutrition Screening and Diagnostic Tools as Predictors of Hospitalisation Costs Journal of Human Nutrition and Dietetics 29 2 165 173 10.1111/jhn.12288 25532556 Hernan M. A. J. M. Robins 2020 Causal Inference: What If Boca Raton Chapman and Hall/CRC Holder H. 2003 Nursing Management of Nutrition in Cancer and Palliative Care British Journal of Nursing 12 11 667 674 10.12968/bjon.2003.12.11.11316 12829966 Isabel T. D. M. Correia 2003 The Impact of Malnutrition on Morbidity, Mortality, Length of Hospital Stay and Costs Evaluated Through a Multivariate Model Analysis Clinical Nutrition 22 3 235 239 10.1016/S0261-5614(02)00215-7 12765661 Isenring E. M. Elia 2015 Which Screening Method Is Appropriate for Older Cancer Patients at Risk for Malnutrition? Nutrition 31 4 594 597 10.1016/j.nut.2014.12.027 25770324 Jia Z. M. El Moheb A. Nordestgaard 2020 The Geriatric Nutritional Risk Index Is a Powerful Predictor of Adverse Outcome in the Elderly Emergency Surgery Patient Journal of Trauma and Acute Care Surgery 89 2 397 404 10.1097/TA.0000000000002741 32744834 Ju W. R. Zheng S. Wang 2023 The Occurrence of Cancer in Ageing Populations at Global and Regional Levels, 1990 to 2019 Age and Ageing 52 9 afad043 10.1093/ageing/afad043 37725972 Ju W. R. Zheng S. Zhang 2023 Cancer Statistics in Chinese Older People, 2022: Current Burden, Time Trends, and Comparisons With the US, Japan, and the Republic of Korea Science China Life Sciences 66 5 1079 1091 10.1007/s11427-022-2218-x 36543994 Kwaśny A. K. Łokieć B. Uchmanowicz A. Młynarska J. Smereka M. Czapla 2023 Sex‐Related Differences in the Impact of Nutritional Status on In‐Hospital Mortality in Acute Coronary Syndrome: A Retrospective Cohort Study Nutrition, Metabolism, and Cardiovascular Diseases 33 11 2242 2250 10.1016/j.numecd.2023.06.010 37516641 Leandro‐Merhi V. A. J. L. B. de Aquino 2014 Determinants of Malnutrition and Post‐Operative Complications in Hospitalized Surgical Patients Journal of Health, Population, and Nutrition 32 3 400 410 25395903 PMC4221446 Lidoriki I. D. Schizas M. Frountzas 2021 GNRI as a Prognostic Factor for Outcomes in Cancer Patients: A Systematic Review of the Literature Nutrition and Cancer 73 3 391 403 10.1080/01635581.2020.1756350 32321298 Lim S. L. K. C. B. Ong Y. H. Chan W. C. Loke M. Ferguson L. Daniels 2012 Malnutrition and Its Impact on Cost of Hospitalization, Length of Stay, Readmission and 3‐Year Mortality Clinical Nutrition 31 3 345 350 10.1016/j.clnu.2011.11.001 22122869 Liu C. Z. Lu L. Chen 2022 Predictive Value of Geriatric Nutritional Risk Index in Older Adult Cancer Patients Journal of Nutrition, Health & Aging 26 2 153 156 10.1007/s12603-022-1729-4 35166307 Nahler G. 2009 Lorentz‐Formula Dictionary of Pharmaceutical Medicine G. Nahler 107 Springer 10.1007/978-3-211-89836-9_803 Niccoli T. L. Partridge 2012 Ageing as a Risk Factor for Disease Current Biology 22 17 R741 R752 10.1016/j.cub.2012.07.024 22975005 Nigatu Y. D. S. H. Gebreyesus J. P. Allard B. S. Endris 2021 The Effect of Malnutrition at Admission on Length of Hospital Stay Among Adult Patients in Developing Country: A Prospective Cohort Study Clinical Nutrition ESPEN 41 217 224 10.1016/j.clnesp.2020.12.013 33487267 Norman K. U. Haß M. Pirlich 2021 Malnutrition in Older Adults—Recent Advances and Remaining Challenges Nutrients 13 8 2764 10.3390/nu13082764 34444924 PMC8399049 Norman K. C. Pichard H. Lochs M. Pirlich 2008 Prognostic Impact of Disease‐Related Malnutrition Clinical Nutrition 27 1 5 15 10.1016/j.clnu.2007.10.007 18061312 Payette H. M. J. Kergoat B. Shatenstein V. Boutier S. Nadon 2000 Validity of Self‐Reported Height and Weight Estimates in Cognitively‐Intact and Impaired Elderly Individuals Journal of Nutrition, Health & Aging 4 4 223 228 11115805 Pimiento J. M. ASPEN Value Project Scientific Advisory Council D. C. Evans 2021 Value of Nutrition Support Therapy in Patients With Gastrointestinal Malignancies: A Narrative Review and Health Economic Analysis of Impact on Clinical Outcomes in the United States Journal of Gastrointestinal Oncology 12 2 864 873 10.21037/jgo-20-326 34012673 PMC8107619 Prado C. M. S. A. Purcell A. Laviano 2020 Nutrition Interventions to Treat Low Muscle Mass in Cancer Journal of Cachexia, Sarcopenia and Muscle 11 2 366 380 10.1002/jcsm.12525 31916411 PMC7113510 Reber E. K. A. Schönenberger M. F. Vasiloglou Z. Stanga 2021 Nutritional Risk Screening in Cancer Patients: The First Step Toward Better Clinical Outcome Frontiers in Nutrition 8 603936 10.3389/fnut.2021.603936 33898493 PMC8058175 Ruan G. Q. Zhang X. Zhang 2021 Geriatric Nutrition Risk Index: Prognostic Factor Related to Inflammation in Elderly Patients With Cancer Cachexia Journal of Cachexia, Sarcopenia and Muscle 12 6 1969 1982 10.1002/jcsm.12800 34585849 PMC8718015 Rui H. W. Yuqian 2023 Dietary Intervention in Enhancing Immunity of Cancer Patients Journal of Vaccines and Immunology 9 1 24 29 10.17352/jvi.000057 Ruiz A. J. G. Buitrago N. Rodríguez 2019 Clinical and Economic Outcomes Associated With Malnutrition in Hospitalized Patients Clinical Nutrition 38 3 1310 1316 10.1016/j.clnu.2018.05.016 29891224 Schindler K. E. Pernicka A. Laviano 2010 How Nutritional Risk Is Assessed and Managed in European Hospitals: A Survey of 21,007 Patients Findings From the 2007–2008 Cross‐Sectional nutritionDay Survey Clinical Nutrition 29 5 552 559 10.1016/j.clnu.2010.04.001 20434820 Shakersain B. G. Santoni G. Faxén‐Irving D. Rizzuto L. Fratiglioni W. Xu 2016 Nutritional Status and Survival Among Old Adults: An 11‐Year Population‐Based Longitudinal Study European Journal of Clinical Nutrition 70 3 320 325 10.1038/ejcn.2015.109 26153193 Sheean P. I. C. Farrar S. Sulo J. Partridge L. Schiffer M. Fitzgibbon 2019 Nutrition Risk Among an Ethnically Diverse Sample of Community‐Dwelling Older Adults Public Health Nutrition 22 5 894 902 10.1017/S1368980018002902 30396375 PMC6521784 Söderström L. A. Rosenblad E. Thors Adolfsson L. Bergkvist 2017 Malnutrition Is Associated With Increased Mortality in Older Adults Regardless of the Cause of Death British Journal of Nutrition 117 4 532 540 10.1017/S0007114517000435 28290264 Sung H. J. Ferlay R. L. Siegel 2021 Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA: A Cancer Journal for Clinicians 71 3 209 249 10.3322/caac.21660 33538338 Volkert D. A. M. Beck T. Cederholm 2019 ESPEN Guideline on Clinical Nutrition and Hydration in Geriatrics Clinical Nutrition 38 1 10 47 10.1016/j.clnu.2018.05.024 30005900 Wanphen W. 2019 Factors Associated With Nutritional Status of Elderly in Ubon Ratchathani, Thailand Asia‐Pacific Journal of Science and Technology 24 111 10.14456/APST.2019.5 Wild C. P. E. Weiderpass B. W. Stewart International Agency for Research on Cancer 2020 World Cancer Report: Cancer Research for Cancer Prevention International Agency for Research on Cancer 39432694 Wu M. L. Xia L. Zhang 2023 Perioperative Management for Elderly Patients Undergoing Day Surgery: Evidence‐Based Practice for Nursing Care and Day Surgery Frontiers in Medicine 10 1298778 10.3389/fmed.2023.1298778 38076270 PMC10702948 Yamada K. R. Furuya T. Takita 2008 Simplified Nutritional Screening Tools for Patients on Maintenance Hemodialysis American Journal of Clinical Nutrition 87 1 106 113 10.1093/ajcn/87.1.106 18175743 Yu K. X. Zhou S. He 2013 A Multicentre Study to Implement Nutritional Risk Screening and Evaluate Clinical Outcome and Quality of Life in Patients With Cancer European Journal of Clinical Nutrition 67 7 732 737 10.1038/ejcn.2013.81 23594841 Zhang X. B. J. Edwards 2019 Malnutrition in Older Adults With Cancer Current Oncology Reports 21 9 80 10.1007/s11912-019-0829-8 31359189 Zhang X. L. Pang S. V. Sharma R. Li A. G. Nyitray B. J. Edwards 2021 Malnutrition and Overall Survival in Older Patients With Cancer Clinical Nutrition 40 3 966 977 10.1016/j.clnu.2020.06.026 32665101 Zhao Y. X. Xia D. Xie 2020 Geriatric Nutritional Risk Index Can Predict Postoperative Delirium and Hospital Length of Stay in Elderly Patients Undergoing Non‐Cardiac Surgery Geriatrics & Gerontology International 20 8 759 764 10.1111/ggi.13963 32570290 PMC7496996 ",
  "metadata": {
    "Title of this paper": "Geriatric Nutritional Risk Index Can Predict Postoperative Delirium and Hospital Length of Stay in Elderly Patients Undergoing Non‐Cardiac Surgery",
    "Journal it was published in:": "Journal of Clinical Nursing",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489446/"
  }
}