{
  "title": "Paper_187",
  "abstract": "pmc Oncol Lett Oncol Lett 1736 onclett OL Oncology Letters 1792-1074 1792-1082 Spandidos Publications PMC12490292 PMC12490292.1 12490292 12490292 10.3892/ol.2025.15295 OL-30-6-15295 1 Articles Protein arginine methyltransferase 7 regulates the cell cycle and promotes the progression of prostate cancer Wan Hongyuan 1 2 * Zhou Hangshen 1 2 * Gui Jiandong 1 2 * Yang Dongjie 3 * Wang Rong 2 Ni Jiang 4 Wu Sheng 1 Qin Yan 3 Qi Qiaowei 3 Zhu Lijie 1 Feng Ninghan 5 Mi Yuanyuan 1 1 2 3 4 5 Correspondence to n.feng@jiangnan.edu.cn Dr Yuanyuan Mi, Department of Urology, Affiliated Hospital of Jiangnan University, 1000 Hefeng Road, Wuxi, Jiangsu 214122, P.R. China, E-mail: 9862019090@jiangnan.edu.cn * Contributed equally 12 2025 23 9 2025 30 6 498062 549 05 2 2025 11 8 2025 23 09 2025 03 10 2025 03 10 2025 Copyright: © 2025 Wan et al. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs License Prostate cancer (PCa) is the second most common cancer in men worldwide. Protein arginine methyltransferase 7 (PRMT7) expression is associated with tumor growth, as it can drive tumor cell proliferation and promote its invasiveness in several types of cancer. However, its mechanism in PCa remains to be elucidated. In the present study, the function and associated mechanism of PRMT7 in PCa cells were investigated. The relationship between PRMT7 and PCa was analyzed using The Cancer Genome Atlas online database. Tissue chip techniques were used to identify the clinical relevance of PRMT7 expression. PRMT7 expression levels in PCa tissues and cells were verified using reverse transcription-quantitative PCR (RT-qPCR). Cell cycle, migration, proliferation and apoptosis of PC3 and DU145 cells were observed using flow cytometry, Cell Counting Kit-8, wound healing, plate cloning and cell invasion assays. Gene set enrichment analysis and chip expression profiles were used to predict the potential signaling pathway involved in the action of PRMT7 in PCa. First, The Cancer Genome Atlas database, tissue microarray analysis and RT-qPCR revealed that PRMT7 expression was increased in PCa tissues and cells. Furthermore, small interfering RNA-mediated PRMT7 knockdown led to a notable reduction in the proliferation of cells, increased apoptosis, affected the cell cycle and decreased cell migration and invasion. Furthermore, PRMT7 regulated the functions of Yin Yang 1 (YY1), tumor protein p53 (TP53), cyclin D2 (CCND2), CDK6 and retinoblastoma 1 (RB1) in PCa. PRMT7 may promote proliferation, migration and metastasis in PCa cells by regulating the activity of YY1, TP53, CCND2, CDK6 and RB1 in the cell cycle signaling pathway. prostate cancer protein arginine methyltransferase 7 cell cycle tumor marker progression The National Natural Science Foundation 81802576 Wuxi Commission of Health and Family Planning T202102 Z202011 M202330 Talent plan of Taihu Lake in Wuxi (Double Hundred Medical Youth Professionals Program) from Health Committee of Wuxi BJ2020061 BJ2023051 Clinical Trial of Affiliated Hospital of Jiangnan University LCYJ202227 LCYJ202323 Research Topic of Jiangsu Health Commission Z2022047 Jiangsu Province 7th phase ‘333’ high-level talents (2024)3-2425 The present study was financially supported by the following entities: The National Natural Science Foundation (grant no. 81802576), Wuxi Commission of Health and Family Planning (grant nos. T202102, Z202011 and M202330) and Talent plan of Taihu Lake in Wuxi (Double Hundred Medical Youth Professionals Program) from Health Committee of Wuxi (grant nos. BJ2020061 and BJ2023051). Furthermore, the Clinical Trial of Affiliated Hospital of Jiangnan University (grant nos. LCYJ202227 and LCYJ202323), Research Topic of Jiangsu Health Commission (grant no. Z2022047) and Jiangsu Province 7th phase ‘333’ high-level talents [grant no. (2024)3-2425] also provided funding support for the present study. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Prostate cancer (PCa) is one of the most common malignancies in men worldwide. According to the 2024 data from the American Cancer Society, PCa is the second leading cause of mortality in men, after lung cancer ( 1 2 3 4 6 7 8 The 5- and 10-year survival rates for PCa depend on the stage and grade of the cancer at diagnosis. For localized or regional PCa, when the cancer is confined to the prostate or nearby areas, the 5-year relative survival rate is ~100%. For metastatic PCa, in which the cancer has spread to distant parts of the body, the 5-year survival rate is markedly reduced, ~37% ( 9 10 The high risk of PCa is primarily attributed to its aggressive metastasis. In cases where cancer types are hidden, it is difficult for clinicians to diagnose and treat the disease early. In several cases, by the time PCa is diagnosed, tumor tissues have metastasized to areas outside the prostate, such as in the bone ( 11 12 13 14 Cytokines serve an important role in the development of cancer ( 15 16 17 22 PTMs regulated by PRMT7 and its proteins are associated with tumor growth and metastasis ( 23 24 25 26 27 28 29 30 31 In 2014, Vieira et al 32 28 31 Materials and methods Patient samples In the present study, 159 PCa samples were prospectively collected from patients diagnosed at the Affiliated Hospital of Jiangnan University (Wuxi, China) between December 2023 and June 2024. The tissue samples were obtained through standard hospital procedures. Patients were evaluated through clinical and histological analyses. The present study strictly adhered to the following predefined inclusion criteria: i) Histopathologically confirmed primary prostate adenocarcinoma [International Society of Urological Pathology (ISUP) grade ≥2]; ii) no prior history of radiotherapy or systemic therapy; and iii) availability of matched tumor-normal paired tissue samples for genomic analysis. The exclusion criteria comprised cases with metastasis at diagnosis (to avoid confounding by advanced disease biology) and specimens that did not meet tissue quality standards (RNA integrity number >7). The age distribution of the cohort (median, 68 years; range, 52–81 years), PSA levels and ISUP grades mirrored regional epidemiology. The tissue samples were collected for tissue microarray analysis and the correlation between PRMT7 and the age of the patients, Gleason score ( 33 34 Bioinformatics analysis PRMT7 expression data were downloaded from The Cancer Genome Atlas (TCGA) online database ( http://tcga-data.nci.nih.gov/tcga/ http://www.r-project.org Immunohistochemistry staining and scoring Paraformaldehyde (4%) was used to fix collected tissue samples at room temperature (25°C) for 24 h. Paraffin-embedded tissues were cut into 4-µm-thick sections. Tissue sections were dewaxed, hydrated, then permeabilized with 0.5% Triton X-100 at room temperature (25°C) for 10 min, blocked with 3% H 2 2 35 36 https://www.proteinatlas.org/ENSG00000132600-PRMT7/tissue/prostate# Cell culture Human PCa cell lines PC3, DU145, LNCAP, 22RV1 and WPMY-1 were purchased from the Cell Bank of the Chinese Academy of Science. DU145 and WPMY-1 cells were cultured in DMEM (Cytiva) supplemented with 10% FBS (Shenzhen Aipno Biomedical Technology Co., Ltd.). PC3, LNCAP and 22RV1 cells were cultured in RPMI-1640 (Cytiva) medium supplemented with 10% FBS (Shenzhen Aipno Biomedical Technology Co., Ltd.). All cells were incubated at 37°C with 5% CO 2 RT-qPCR RNA extraction from PC3, DU145, LNCAP, 22RV1 and WPMY-1 cells (each sample used 3×10 6 ® ® Table SI ® −ΔΔCq 35 35 Plasmid transfection Small interfering (si)PRMT7 was designed based on the PRMT7 ( NM_019023.5 Infection http://www.ncbi.nlm.nih.gov/nuccore/NM_019023.5 BsmBI Escherichia coli 8 5 ® 6 ® ® ® Other assays Western blot analysis, cell proliferation and colony formation assays, apoptosis analysis and cell cycle detection, wound healing, cell migration and invasion assays were carried out as previously described ( 35 36 GB111880 GB111740 Transcriptome sequencing and analysis Total RNA was isolated from all samples (4 PRMT7-KD replicates and 4 Control replicates) using TRIzol™ reagent (cat. no. 15596026CN, Thermo Fisher Scientific, Inc.). RNA integrity was assessed using the Agilent Bioanalyzer 2100 system (RNA Nano 6000 Assay Kit; Agilent Technologies), and purity was confirmed using a NanoPhotometer ® ® ® http://www.ncbi.nlm.nih.gov/datasets/genome/GCF_000001405.26/ http://daehwankimlab.github.io/hisat2/ http://ccb.jhu.edu/software/stringtie/ https://cn.string-db.org/ Statistical analysis Data were analyzed using SPSS software (version 17.0; SPSS, Inc.). All data were presented as the mean ± SEM. The normality of the data was analyzed using the Shapiro-Wilk test. P<0.05 was considered to indicate normally distributed data. Homogeneity of variance was assessed using Levene's test, with P>0.05 considered to indicate homogenous data. For data that met normal distribution assumptions and equal variances, an unpaired Student's t-test was used to analyze the differences between two groups and one-way ANOVA and Bonferroni's post hoc test for multiple comparisons. All P-values derived from high-throughput analyses (for example, differential gene expression and pathway enrichment) were adjusted for multiple comparisons using the Benjamini-Hochberg false discovery rate (FDR) method with a significance threshold of FDR <0.05. P<0.05 was considered to indicate a statistically significant difference. Images were generated using GraphPad Prism 8 (Dotmatics) and Illustrator CC 2018 software (v22.0; Adobe Systems, Inc.). Principal Component Analysis (PCA) was performed to reduce dimensionality and identify patterns. The raw dataset was standardized by mean-centering and scaling to unit variance. The covariance matrix of the standardized data was computed and decomposed into its eigenvalues and eigenvectors. Principal Components (PCs) were selected based on eigenvalues sorted in descending order, retaining components explaining >80% cumulative variance. The standardized data was projected onto the orthogonal axes defined by the selected PCs. Analysis was implemented using: Python, scikit-learn (v1.2.2) with PCA(svd_solver=‘auto’); R, stats::prcomp() (R v4.3.0); MATLAB, pca() (MATLAB R2023a). Results PRMT7 is highly expressed in PCa To explore whether there is a potential association between PRMT7 and PCa, relevant data were searched and analyzed in TCGA database. Significant differences in PRMT7 expression were identified in cancerous and adjacent tissues and in terms of the age of patients with PCa, Gleason score, PSA levels and TNM stage ( Fig. 1A-H Figs. 1I SIA Table I To verify the differential upregulation of PRMT7 expression in PCa tissues, PRMT7 PRMT7 Fig. 1J PRMT7 Fig. 1K PRMT7 PRMT7 promotes PCa cell proliferation, migration and invasion, and affects the cell cycle and apoptosis To explore the biological mechanism underlying the effect of PRMT7 expression on PCa cells, siRNA-mediated PRMT7 silencing was performed to observe the biological changes in cancer cells. A total of three siRNA-coding clones were designed based on the PRMT7 sequence; they could be used for both stable and transient expression in vertebrate cells to decrease the expression levels of PRMT7. Subsequently, RT-qPCR was performed to verify the silencing efficiency of the three siRNAs in PC3 and DU145 cells. Analysis suggested that after 3 days of siRNA (43684-1, 43685-1 and 43686-1) transfection, the mRNA and protein expression levels of PRMT7 in the experimental group (si-43686-1) was reduced ( Fig. 2A Fig. 2B CCK-8 assays indicated that the proliferation rates of PC3 and DU145 cells were significantly reduced after PRMT7 knockdown, which suggested that PRMT7 significantly affected cell proliferation ( Fig. 2C Fig. 2D Fig. 2E Fig. S1B and C Fig. 2F and G 1 2 1 2 Fig. 2H Fig. 2I PRMT7 influences the cell cycle in PCa cells Next, the PRMT7 knockdown plasmid siPRMT7 was transfected into the PCa cell line PC3 ( Fig. 3A Fig. 3B Fig. 3C Fig. 3D and E Figs. S2 S3 To explore the functional characteristics of the differentially expressed genes and predict the downstream pathways of PRMT7, the differentially expressed genes were classified according to their functions and gene function enrichment analyses were carried out, including GO, KEGG, DO and other pathway analyses. DO analysis revealed that the differential genes were enriched in ‘prostate cancer’ pathways, which confirmed the data presented in Fig. 4A Fig. 4B Fig. 4C and D PRMT7 promotes the malignant progression of PCa through the YY1/TP53/CCND2/CDK6/RB1 signaling axis To further explore the downstream mechanisms of PRMT7 in PCa, transcriptome sequencing data were used to map the differentially expressed genes associated with the cell cycle ( Fig. 5A Fig. 5B 12 Fig. S4 Discussion The occurrence and progression of cancer involves several cancer-promoting and cancer-suppressing genes. With the development of epigenetics, numerous tumor-related epigenetic changes have become the focus of research on cancer-related mechanisms. PTMs involved in PCa are also a current research focus ( 37 38 et al 30 CAMK2N1 39 27 40 41 42 43 et al 44 24 45 Based on a previous study by Vieira et al 32 Subsequently, siRNAs were used to knock down PRMT7 expression in PC3 and DU145 cells. PRMT7 promoted PCa cell proliferation, migration and invasion and affected the cell cycle and apoptosis. These results demonstrated that PRMT7 is an oncogene that contributes to the malignant phenotype of PCa. Furthermore, the present study explored the specific regulatory mechanisms by which PRMT7 exerts oncogenic effects in PCa. Bioinformatics analysis and transcriptome sequencing were used to search for PRMT7-related differentially expressed genes in PCa and predict the potential downstream cancer-promoting signaling molecules. The present study determined that PRMT7 may be involved in cell cycle control pathways, particularly the YY1/TP53/CCND2/CDK6/RB1 signaling pathway. p53 is a stress-activated transcription factor that regulates the expression of target genes involved in DNA repair, cell cycle arrest, and apoptosis to maintain genomic stability and suppress tumorigenesis ( 46 47 46 48 52 YY1 is a member of the GLI-Kruppel zinc finger protein family that has two opposing abilities: Inhibiting and activating gene transcription ( 53 26 54 56 56 57 CCND2 is a member of the cyclin family that encodes cyclin D2. It regulates cancer cell processes through the cell cycle. Cyclin D2 reduces the inhibitory effect of miR-615 on the proliferation, migration and invasion of PCa cells ( 58 in vivo 59 60 63 64 Previous studies on blocking AR resistance have indicated the role of AR-related cell cycle pathways in PCa ( 65 67 68 0 69 71 1 72 74 71 75 74 76 The present study had several limitations. For instance, the sample collection period was relatively short (~6 months). Although an adequate sample size was achieved from this high-volume tertiary hospital (Affiliated Hospital of Jiangnan University; Wuxi, China), the potential for temporal bias requires consideration. Furthermore, the present study primarily relied on in vitro 0 in vivo 77 78 The present study confirmed that PRMT7 was involved in the proliferation and invasion of PCa cells and potentially promoted the malignant progression through the YY1/TP53/CCND2/CDK6/RB1 cell cycle signaling axis. Supplementary Material Supporting Data Supporting Data Acknowledgements Not applicable. Availability of data and materials The data generated in the present study may be found in the Gene Expression Omnibus under accession number ( GSE302155 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE302155 Authors' contributions HW, HZ, JG, NF and DY conceived and designed the present study; HW, RW, JN and YM performed the experiments and acquired the data. SW, YQ, QQ and LZ contributed to data analysis. HW and YM confirm the authenticity of all the raw data. All authors were involved in drafting and revising the manuscript. All authors read and approved the final manuscript. Ethics approval and consent to participate The present study was approved by the Ethics Committee of Affiliated Hospital of Jiangnan University (approval no. LS2023099; Wuxi, China) and written informed consent was obtained from all patients prior to sample collection. Patient consent for publication Not applicable. Competing interests The authors declare that they have no competing interests. References 1 Siegel RL Giaquinto AN Jemal A Cancer statistics, 2024 CA Cancer J Clin 74 12 49 2024 38230766 10.3322/caac.21820 2 Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Jemal A Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 74 229 263 2024 38572751 10.3322/caac.21834 3 Sugiura M Sato H Kanesaka M Imamura Y Sakamoto S Ichikawa T Kaneda A Epigenetic modifications in prostate cancer Int J Urol 28 140 149 2021 10.1111/iju.14406 33111429 4 Liu J Dong L Zhu Y Dong B Sha J Zhu HH Pan J Xue W Prostate cancer treatment-China's perspective Cancer Lett 550 215927 2022 10.1016/j.canlet.2022.215927 36162714 5 Liu X Yu C Bi Y Zhang ZJ Trends and age-period-cohort effect on incidence and mortality of prostate cancer from 1990 to 2017 in China Public Health 172 70 80 2019 10.1016/j.puhe.2019.04.016 31220754 6 Wang F Wang C Xia H Lin Y Zhang D Yin P Yao S Burden of prostate cancer in China, 1990–2019: Findings from the 2019 global burden of disease study Front Endocrinol (Lausanne) 13 853623 2022 10.3389/fendo.2022.853623 35692392 PMC9175004 7 Han B Zheng R Zeng H Wang S Sun K Chen R Li L Wei W He J Cancer incidence and mortality in China, 2022 J Natl Cancer Cent 4 47 53 2024 39036382 10.1016/j.jncc.2024.01.006 PMC11256708 8 Cao W Chen HD Yu YW Li N Chen WQ Changing profiles of cancer burden worldwide and in China: A secondary analysis of the global cancer statistics 2020 Chin Med J (Engl) 134 783 791 2021 10.1097/CM9.0000000000001474 33734139 PMC8104205 9 Allemani C Matsuda T Di Carlo V Harewood R Matz M Nikšić M Bonaventure A Valkov M Johnson CJ Estève J Global surveillance of trends in cancer survival 2000–14 (CONCORD-3): Analysis of individual records for 37 513 025 patients diagnosed with one of 18 cancers from 322 population-based registries in 71 countries Lancet 391 1023 1075 2018 10.1016/S0140-6736(17)33326-3 29395269 PMC5879496 10 Pound CR Partin AW Eisenberger MA Chan DW Pearson JD Walsh PC Natural history of progression after PSA elevation following radical prostatectomy JAMA 281 1591 1597 1999 10.1001/jama.281.17.1591 10235151 11 Lobo J Barros-Silva D Henrique R Jeronimo C The emerging role of epitranscriptomics in cancer: Focus on urological tumors Genes (Basel) 9 552 2018 10.3390/genes9110552 30428628 PMC6265908 12 Rebello RJ Oing C Knudsen KE Loeb S Johnson DC Reiter RE Gillessen S Van der Kwast T Bristow RG Prostate cancer Nat Rev Dis Primers 7 9 2021 10.1038/s41572-020-00243-0 33542230 13 Barsouk A Padala SA Vakiti A Mohammed A Saginala K Thandra KC Rawla P Barsouk A Epidemiology, staging and management of prostate cancer Med Sci (Basel) 8 28 2020 32698438 10.3390/medsci8030028 PMC7565452 14 Feldman BJ Feldman D The development of androgen-independent prostate cancer Nat Rev Cancer 1 34 45 2001 10.1038/35094009 11900250 15 Hirst M Marra MA Epigenetics and human disease Int J Biochem Cell Biol 41 136 146 2009 10.1016/j.biocel.2008.09.011 18852064 16 Miremadi A Oestergaard MZ Pharoah PD Caldas C Cancer genetics of epigenetic genes Hum Mol Genet 16 R28 R49 2007 10.1093/hmg/ddm021 17613546 17 Fisk JC Sayegh J Zurita-Lopez C Menon S Presnyak V Clarke SG Read LK A type III protein arginine methyltransferase from the protozoan parasite Trypanosoma brucei J Biol Chem 284 11590 11600 2009 10.1074/jbc.M807279200 19254949 PMC2670164 18 Feng Y Hadjikyriacou A Clarke SG Substrate specificity of human protein arginine methyltransferase 7 (PRMT7): The importance of acidic residues in the double E loop J Biol Chem 289 32604 32616 2014 10.1074/jbc.M114.609271 25294873 PMC4239614 19 Zurita-Lopez CI Sandberg T Kelly R Clarke SG Human protein arginine methyltransferase 7 (PRMT7) is a type III enzyme forming omega-NG-monomethylated arginine residues J Biol Chem 287 7859 7870 2012 10.1074/jbc.M111.336271 22241471 PMC3318701 20 Debler EW Jain K Warmack RA Feng Y Clarke SG Blobel G Stavropoulos P A glutamate/aspartate switch controls product specificity in a protein arginine methyltransferase Proc Natl Acad Sci USA 113 2068 2073 2016 10.1073/pnas.1525783113 26858449 PMC4776506 21 Bedford MT Richard S Arginine methylation an emerging regulator of protein function Mol Cell 18 263 272 2005 10.1016/j.molcel.2005.04.003 15866169 22 Bedford MT Clarke SG Protein arginine methylation in mammals: Who, what, and why Mol Cell 33 1 13 2009 10.1016/j.molcel.2008.12.013 19150423 PMC3372459 23 Yang Y Bedford MT Protein arginine methyltransferases and cancer Nat Rev Cancer 13 37 50 2013 10.1038/nrc3409 23235912 24 Liu F Wan L Zou H Pan Z Zhou W Lu X PRMT7 promotes the growth of renal cell carcinoma through modulating the beta-catenin/C-MYC axis Int J Biochem Cell Biol 120 105686 2020 10.1016/j.biocel.2020.105686 31926310 25 Baldwin RM Haghandish N Daneshmand M Amin S Paris G Falls TJ Bell JC Islam S Côté J Protein arginine methyltransferase 7 promotes breast cancer cell invasion through the induction of MMP9 expression Oncotarget 6 3013 3032 2015 10.18632/oncotarget.3072 25605249 PMC4413634 26 Yao R Jiang H Ma Y Wang L Wang L Du J Hou P Gao Y Zhao L Wang G PRMT7 induces epithelial-to-mesenchymal transition and promotes metastasis in breast cancer Cancer Res 74 5656 5667 2014 10.1158/0008-5472.CAN-14-0800 25136067 27 Ma W Sun X Zhang S Chen Z Yu J Circ_0039960 regulates growth and Warburg effect of breast cancer cells via modulating miR-1178/PRMT7 axis Mol Cell Probes 64 101829 2022 10.1016/j.mcp.2022.101829 35597500 28 Fuhrmann J Thompson PR Protein arginine methylation and citrullination in epigenetic regulation ACS Chem Biol 11 654 668 2016 10.1021/acschembio.5b00942 26686581 PMC4802296 29 Fuhrmann J Clancy KW Thompson PR Chemical biology of protein arginine modifications in epigenetic regulation Chem Rev 115 5413 5461 2015 10.1021/acs.chemrev.5b00003 25970731 PMC4463550 30 Yao B Zhu S Wei X Chen MK Feng Y Li Z Xu X Zhang Y Wang Y Zhou J The circSPON2/miR-331-3p axis regulates PRMT5, an epigenetic regulator of CAMK2N1 transcription and prostate cancer progression Mol Cancer 21 119 2022 10.1186/s12943-022-01598-6 35624451 PMC9137111 31 Beketova E Fang S Owens JL Liu S Chen X Zhang Q Asberry AM Deng X Malola J Huang J Protein arginine methyltransferase 5 promotes pICln-dependent androgen receptor transcription in castration-resistant prostate cancer Cancer Res 80 4904 4917 2020 10.1158/0008-5472.CAN-20-1228 32999000 PMC7669631 32 Vieira FQ Costa-Pinheiro P Ramalho-Carvalho J Pereira A Menezes FD Antunes L Carneiro I Oliveira J Henrique R Jerónimo C Deregulated expression of selected histone methylases and demethylases in prostate carcinoma Endocr Relat Cancer 21 51 61 2014 10.1530/ERC-13-0375 24200674 33 Epstein JI Egevad L Amin MB Delahunt B Srigley JR Humphrey PA The 2014 international society of urological pathology (ISUP) consensus conference on gleason grading of prostatic carcinoma: Definition of grading patterns and proposal for a new grading system Am J Surg Pathol 40 244 252 2016 10.1097/PAS.0000000000000530 26492179 34 Xiao WJ Zhu Y Zhu Y Dai B Ye DW Evaluation of clinical staging of the American Joint Committee on Cancer (eighth edition) for prostate cancer World J Urol 36 769 774 2018 10.1007/s00345-018-2183-0 29372356 35 Feng Y Sun C Zhang L Wan H Zhou H Chen Y Zhu L Xia G Mi Y Upregulation of COPB2 promotes prostate cancer proliferation and invasion through the MAPK/TGF-β signaling pathway Front Oncol 12 865317 2022 10.3389/fonc.2022.865317 35600351 PMC9120942 36 Mi YY Ji Y Zhang L Sun CY Wei BB Yang DJ Wan HY Qi XW Wu S Zhu LJ A first-in-class HBO1 inhibitor WM-3835 inhibits castration-resistant prostate cancer cell growth in vitro and in vivo Cell Death Dis 14 67 2023 10.1038/s41419-023-05606-5 36709328 PMC9884225 37 Jaiswal B Agarwal A Gupta A Lysine acetyltransferases and their role in AR signaling and prostate cancer Front Endocrinol (Lausanne) 13 886594 2022 10.3389/fendo.2022.886594 36060957 PMC9428678 38 Cocchiola R Romaniello D Grillo C Altieri F Liberti M Magliocca FM Chichiarelli S Marrocco I Borgoni G Perugia G Eufemi M Analysis of STAT3 post-translational modifications (PTMs) in human prostate cancer with different Gleason Score Oncotarget 8 42560 42570 2017 10.18632/oncotarget.17245 28489571 PMC5522088 39 Deng X Shao G Zhang HT Li C Zhang D Cheng L Elzey BD Pili R Ratliff TL Huang J Hu CD Protein arginine methyltransferase 5 functions as an epigenetic activator of the androgen receptor to promote prostate cancer cell growth Oncogene 36 1223 1231 2017 10.1038/onc.2016.287 27546619 PMC5322258 40 Liu L Zhang X Ding H Liu X Cao D Liu Y Liu J Lin C Zhang N Wang G Arginine and lysine methylation of MRPS23 promotes breast cancer metastasis through regulating OXPHOS Oncogene 40 3548 3563 2021 10.1038/s41388-021-01785-7 33927350 41 Liu Y Li L Liu X Wang Y Liu L Peng L Liu J Zhang L Wang G Li H Arginine methylation of SHANK2 by PRMT7 promotes human breast cancer metastasis through activating endosomal FAK signalling Elife 9 e57617 2020 10.7554/eLife.57617 32844749 PMC7494359 42 Nicot C PRMT7: A survive-or-die switch in cancer stem cells Mol Cancer 21 127 2022 10.1186/s12943-022-01602-z 35689285 PMC9188132 43 Liu C Zou W Nie D Li S Duan C Zhou M Lai P Yang S Ji S Li Y Loss of PRMT7 reprograms glycine metabolism to selectively eradicate leukemia stem cells in CML Cell Metab 34 818 35.e7 2022 10.1016/j.cmet.2022.04.004 35508169 44 Rodrigo-Faus M Vincelle-Nieto A Vidal N Puente J Saiz-Pardo M Lopez-Garcia A Mendiburu-Eliçabe M Palao N Baquero C Linzoain-Agos P CRISPR/Cas9 screenings unearth protein arginine methyltransferase 7 as a novel essential gene in prostate cancer metastasis Cancer Lett 588 216776 2024 10.1016/j.canlet.2024.216776 38432581 45 Cheng D He Z Zheng L Xie D Dong S Zhang P PRMT7 contributes to the metastasis phenotype in human non-small-cell lung cancer cells possibly through the interaction with HSPA5 and EEF2 Onco Targets Ther 11 4869 4876 2018 10.2147/OTT.S166412 30147338 PMC6098420 46 Chen J The Cell-cycle arrest and apoptotic functions of p53 in tumor initiation and progression Cold Spring Harb Perspect Med 6 a026104 2016 10.1101/cshperspect.a026104 26931810 PMC4772082 47 Marei HE Althani A Afifi N Hasan A Caceci T Pozzoli G Morrione A Giordano A Cenciarelli C p53 signaling in cancer progression and therapy Cancer Cell Int 21 703 2021 10.1186/s12935-021-02396-8 34952583 PMC8709944 48 Hashimoto N Nagano H Tanaka T The role of tumor suppressor p53 in metabolism and energy regulation, and its implication in cancer and lifestyle-related diseases Endocr J 66 485 496 2019 10.1507/endocrj.EJ18-0565 31105124 49 Liu J Zhang C Hu W Feng Z Tumor suppressor p53 and metabolism J Mol Cell Biol 11 284 292 2019 10.1093/jmcb/mjy070 30500901 PMC6487777 50 Zhang H Xu J Long Y Maimaitijiang A Su Z Li W Li J Unraveling the guardian: P53′s multifaceted role in the DNA Damage response and tumor treatment strategies Int J Mol Sci 25 12928 2024 10.3390/ijms252312928 39684639 PMC11641486 51 Mirzayans R Andrais B Kumar P Murray D Significance of Wild-type p53 signaling in suppressing apoptosis in response to chemical genotoxic agents: Impact on chemotherapy outcome Int J Mol Sci 18 928 2017 10.3390/ijms18050928 28452953 PMC5454841 52 Madan E Gogna R Bhatt M Pati U Kuppusamy P Mahdi AA Regulation of glucose metabolism by p53: Emerging new roles for the tumor suppressor Oncotarget 2 948 957 10.18632/oncotarget.389 22248668 PMC3282098 53 Wang W Li D Sui G YY1 is an inducer of cancer metastasis Crit Rev Oncog 22 1 11 2017 10.1615/CritRevOncog.2017021314 29604932 54 Li Z Wang F Tian X Long J Ling B Zhang W Xu J Liang A HCK maintains the self-renewal of leukaemia stem cells via CDK6 in AML J Exp Clin Cancer Res 40 210 2021 10.1186/s13046-021-02007-4 34167558 PMC8223385 55 Buontempo F McCubrey JA Orsini E Ruzzene M Cappellini A Lonetti A Evangelisti C Chiarini F Evangelisti C Barata JT Martelli AM Therapeutic targeting of CK2 in acute and chronic leukemias Leukemia 32 1 10 2018 10.1038/leu.2017.301 28951560 PMC5770594 56 Rizkallah R Alexander KE Kassardjian A Lüscher B Hurt MM The transcription factor YY1 is a substrate for Polo-like kinase 1 at the G2/M transition of the cell cycle PLoS One 6 e15928 2011 10.1371/journal.pone.0015928 21253604 PMC3017090 57 Dong X Guo R Ji T Zhang J Xu J Li Y Sheng Y Wang Y Fang K Wen Y YY1 safeguard multidimensional epigenetic landscape associated with extended pluripotency Nucleic Acids Res 50 12019 12038 2022 10.1093/nar/gkac230 35425987 PMC9756953 58 Huang F Zhao H Du Z Jiang H miR-615 inhibits prostate cancer cell proliferation and invasion by directly targeting Cyclin D2 Oncol Res 27 293 299 2019 10.3727/096504018X15190399381143 29471894 PMC7848464 59 Dong Q Meng P Wang T Qin W Qin W Wang F Yuan J Chen Z Yang A Wang H MicroRNA let-7a inhibits proliferation of human prostate cancer cells in vitro and in vivo by targeting E2F2 and CCND2 PLoS One 5 e10147 2010 10.1371/journal.pone.0010147 20418948 PMC2854685 60 Chen X Wu Y Wang X Xu C Wang L Jian J Wu D Wu G CDK6 is upregulated and may be a potential therapeutic target in enzalutamide-resistant castration-resistant prostate cancer Eur J Med Res 27 105 2022 10.1186/s40001-022-00730-y 35780240 PMC9250190 61 Yu Z Zhan C Du H Zhang L Liang C Zhang L Baicalin suppresses the cell cycle progression and proliferation of prostate cancer cells through the CDK6/FOXM1 axis Mol Cell Biochem 469 169 178 2020 10.1007/s11010-020-03739-1 32385718 62 Chakraborty G Armenia J Mazzu YZ Nandakumar S Stopsack KH Atiq MO Komura K Jehane L Hirani R Chadalavada K Significance of BRCA2 and RB1 Co-loss in aggressive prostate cancer progression Clin Cancer Res 26 2047 2064 2020 10.1158/1078-0432.CCR-19-1570 31796516 PMC7416644 63 Ku SY Rosario S Wang Y Mu P Seshadri M Goodrich ZW Goodrich MM Labbé DP Gomez EC Wang J Rb1 and Trp53 cooperate to suppress prostate cancer lineage plasticity, metastasis, and antiandrogen resistance Science 355 78 83 2017 10.1126/science.aah4199 28059767 PMC5367887 64 Li Y Wang F Xu J Ye F Shen Y Zhou J Lu W Wan X Ma D Xie X Progressive miRNA expression profiles in cervical carcinogenesis and identification of HPV-related target genes for miR-29 J Pathol 224 484 495 2011 10.1002/path.2873 21503900 65 McNair C Urbanucci A Comstock CE Augello MA Goodwin JF Launchbury R Zhao SG Schiewer MJ Ertel A Karnes J Cell cycle-coupled expansion of AR activity promotes cancer progression Oncogene 36 1655 1668 2017 10.1038/onc.2016.334 27669432 PMC5364060 66 Oner M Lin E Chen MC Hsu FN Shazzad Hossain Prince GM Chiu KY Teng CJ Yang TY Wang HY Yue CH Future aspects of CDK5 in prostate cancer: From pathogenesis to therapeutic implications Int J Mol Sci 20 3881 2019 10.3390/ijms20163881 31395805 PMC6720211 67 Zolochevska O Figueiredo ML Cell cycle regulator cdk2ap1 inhibits prostate cancer cell growth and modifies androgen-responsive pathway function Prostate 69 1586 1597 2009 10.1002/pros.21007 19585490 68 Schiewer MJ Augello MA Knudsen KE The AR dependent cell cycle: Mechanisms and cancer relevance Mol Cell Endocrinol 352 34 45 2012 10.1016/j.mce.2011.06.033 21782001 PMC3641823 69 Agus DB Cordon-Cardo C Fox W Drobnjak M Koff A Golde DW Scher HI Prostate cancer cell cycle regulators: Response to androgen withdrawal and development of androgen independence J Natl Cancer Inst 91 1869 1876 1999 10.1093/jnci/91.21.1869 10547394 70 Huggins C Hodges CV Studies on prostatic cancer: I. The effect of castration, of estrogen and of androgen injection on serum phosphatases in metastatic carcinoma of the prostate. 1941 J Urol 168 9 12 2002 10.1016/S0022-5347(05)64820-3 12050481 71 Knudsen KE Arden KC Cavenee WK Multiple G1 regulatory elements control the androgen-dependent proliferation of prostatic carcinoma cells J Biol Chem 273 20213 20222 1998 10.1074/jbc.273.32.20213 9685369 72 Lee YM Sicinski P Targeting cyclins and cyclin-dependent kinases in cancer: Lessons from mice, hopes for therapeutic applications in human Cell Cycle 5 2110 2114 2006 10.4161/cc.5.18.3218 16969111 73 Malumbres M Barbacid M Cell cycle kinases in cancer Curr Opin Genet Dev 17 60 65 2007 10.1016/j.gde.2006.12.008 17208431 74 Sherr CJ Roberts JM Living with or without cyclins and cyclin-dependent kinases Genes Dev 18 2699 2711 2004 10.1101/gad.1256504 15545627 75 Xu Y Chen SY Ross KN Balk SP Androgens induce prostate cancer cell proliferation through mammalian target of rapamycin activation and post-Transcriptional increases in cyclin D proteins Cancer Res 66 7783 7792 2006 10.1158/0008-5472.CAN-05-4472 16885382 76 Knudsen ES Knudsen KE Tailoring to RB: Tumour suppressor status and therapeutic response Nat Rev Cancer 8 714 724 2008 10.1038/nrc2401 19143056 PMC2914856 77 Jain K Jin CY Clarke SG Epigenetic control via allosteric regulation of mammalian protein arginine methyltransferases Proc Natl Acad Sci USA 114 10101 10106 2017 10.1073/pnas.1706978114 28874563 PMC5617285 78 Jain K Clarke SG PRMT7 as a unique member of the protein arginine methyltransferase family: A review Arch Biochem Biophys 665 36 45 2019 10.1016/j.abb.2019.02.014 30802433 PMC6461449 Figure 1. Differential gene expression patterns of PRMT7 in PCa. (A) The correlation between PRMT7 expression in cancerous and adjacent tissues of patients with PCa in TCGA database. (B) The correlation between PRMT7 expression and age of patients with PCa in TCGA database. (C) The correlation between PRMT7 expression and Gleason score of patients with PCa in TCGA database. (D) The correlation between PRMT7 expression and PSA levels of patients with PCa in TCGA database. The correlation between PRMT7 expression and (E) T, (F) N and (G) M stage of patients with PCa in TCGA database. (H) The correlation between PRMT7 expression and OS event of patients with PCa in TCGA database. (I) Representative image of PRMT7 immunohistochemical staining of PCa tissues and adjacent normal tissues (magnification, 50 and 100×; scale bar, 40 and 10 µm). The red arrows indicate the PRMT7 positive areas. (J) The expression levels of PRMT7 in PCa tissues was detected using RT-qPCR. The blue circle represents the normal tissue around the cancer, while the red arrow represents the tumor tissue. (K) The expression level of PRMT7 in PCa cell lines and normal prostate cells was detected using RT-qPCR. *P<0.05, **P<0.01 and ***P<0.001. PRMT7, protein arginine methyltransferase 7; PCa, prostate cancer; PSA, protein specific antigen; TPM, transcript per million; TCGA, The Cancer Genome Atlas; RT-qPCR, reverse transcription-quantitative PCR; ns, not significant. Figure 1. Differential gene expression patterns of PRMT7 in PCa. (A) The corre lation between PRMT7 expression in cancerous and adjacent tissues of patients with PCa in TCGA database. (B) The correlat... Figure 2. Function of PRMT7 in the PC3 and DU145 cell lines. (A) The inhibition efficiency of siPRMT7 in cell lines was determined using RT-qPCR. (B) Western blotting was used to detect the protein expression levels of PRMT7 in the siPRMT7 and siCtrl groups. (C) Cell proliferation in the siCtrl and siPRMT7 groups was assessed using a Cell Counting Kit-8 assay. (D) A wound healing assay was used to investigate the migratory ability of PCa cells after PRMT7 knockdown (scale bar, 500 µm). (E) Plate colony formation assays were performed to determine the proliferation abilities of PC3 and DU145 cells treated with siCtrl and siPRMT7. The (F) migration and (G) invasion of PC3 and DU145 cells were investigated using a Transwell assay after PRMT7 knockdown (scale bar, 100 µm). (H) PI-FACS detection of the effect of PRMT7 knockdown on the PCa cell cycle. (I) The effect of PRMT7 knockdown on the apoptosis of PCa cells was detected using Annexin V-APC single staining. *P<0.05, **P<0.01 and ***P<0.001. PRMT7, protein arginine methyltransferase 7; PCa, prostate cancer; RT-qPCR, reverse transcription-quantitative PCR; siRNA, small interfering RNA; si, siRNA; Ctrl; control; NC, negative control; CCK-8, Cell Counting Kit-8. Figure 2. Function of PR MT7 in the PC3 and DU145 cell lines. (A) The inhibi tion efficiency of siPRMT7 in cell lines was determined using RT–qPCR. (B) Western blotting was used to detect the protein ... Figure 3. Transcriptome sequencing reveals differential gene expression after PRMT7 knockdown. (A) PRMT7 expression differences among transcriptome sequencing samples were detected using RT-qPCR. (B) Sample gene expression distribution box diagram. After calculating the FPKM values for all genes in each sample, the distribution of gene expression levels across different samples were visualized using boxplots. (C) Co-expression Venn diagram demonstrates the number of genes uniquely expressed in each group/sample. The overlapping regions indicate the number of co-expressed genes in two or more groups/samples. The comparison of the number of differentially expressed genes is displayed in the form of (D) volcano plot and (E) statistical histogram. Volcano plot displaying DEGs. The x-axis demonstrates log 2 10 2 2 2 2 Figure 3. Transc riptome sequencing reveals differential gene expression after PRMT7 knockdown. (A) PRMT7 expression differences among transcriptome sequencing samples were detected using RT–qPCR. (B)... Figure 4. PRMT7 is involved in the regulation of cell cycle-related pathways and affects the cell cycle in PCa. (A) The DO enrichment distribution map of the DEGs associated with PRMT7. DO is a biomedical database that systematically annotates associations between human gene functions and diseases, providing standardized disease descriptors for functional genomics research. (B) Map of the GO enrichment sites of the DEGs associated with PRMT7. GO is a comprehensive bioinformatics resource that systematically characterizes gene functions through three orthogonal categories: Biological processes, cellular components and molecular functions. (C) KEGG enrichment analysis of the DEGs associated with PRMT7. KEGG is an integrated database that systematically consolidates genomic, chemical and systems functional information to facilitate biological pathway analysis and network modeling. (D) KEGG enrichment and distribution map of the PRMT7 differential genes. PRMT7, protein arginine methyltransferase 7; DEGs, Differentially expressed genes; log 2 2 Figure 4. PRMT7 is involved in the regulation of cell cycle–related pathways and affects the cell cycle in PCa. (A) The DO enrichment distribution map of the DEGs associated with PRMT7. DO is a biomed... Figure 5. PRMT7 is involved in the YY1/TP53/CCND2/CDK6/RB1 cell cycle signaling axis. (A) Heatmaps of cell cycle-related differential genes identified using transcriptome sequencing. (B) Cell cycle-related regulatory proteins predicted in the STRING database and their component signaling axes. PRMT7, protein arginine methyltransferase 7; YY1, Yin Yang 1; TP53, tumor protein p53; CCND2, cyclin D2; RB1, retinoblastoma 1; STRING, Search Tool for the Retrieval of Interacting Genes/Proteins. Figure 5. PRMT7 is involved in the YY1 / TP53 / CCND2 / CDK6 / RB1 cell cycle signaling axis. (A) Heatmaps of cell cycle–related differential genes identified using transcriptome sequencing. (B) Cell ... Table I. Correlation between PRMT7 expression and clinicopathological factors. PRMT7 expression  Covariates Total, n (%) Low, n (%) High, n (%) P-value Statistical test Age, years <70 91 (57.23) 40 (56.34) 51 (57.95) 0.838 χ 2 ≥70 68 (42.77) 31 (43.67) 37 (42.05) PSA value <10 64 (40.25) 22 (34.40) 42 (65.60) 0.032 a χ 2 ≥10 95 (59.75) 49 (51.60) 46 (48.40) Gleason score ≤7 114 (71.70) 52 (73.24) 62 (70.45) 0.698 χ 2 >7 45 (28.30) 19 (26.76) 26 (29.55) TNM stage T1-T2 157 (98.74) 69 (97.18) 88 (100) 0.198 Fisher's exact test T3-T4 2 (1.26) 2 (2.82) 0 (0.00) a P<0.05. PRMT7, protein arginine methyltransferase 7; PSA, prostate-specific antigen. ",
  "metadata": {
    "Title of this paper": "PRMT7 as a unique member of the protein arginine methyltransferase family: A review",
    "Journal it was published in:": "Oncology Letters",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490292/"
  }
}