{
  "title": "Paper_461",
  "abstract": "pmc Commun Biol Commun Biol 3495 commbiol Communications Biology 2399-3642 Nature Publishing Group PMC12485074 PMC12485074.1 12485074 12485074 41028907 10.1038/s42003-025-08868-1 8868 1 Article Casein kinase I isoforms contribute to platelet activation and thrombogenesis via RIPK3–MLKL signaling http://orcid.org/0000-0001-7078-4320 Singh Vipin http://orcid.org/0000-0003-1041-2175 Ekhlak Mohammad http://orcid.org/0000-0002-4207-8805 Chaurasia Susheel N. http://orcid.org/0009-0008-3595-8928 Dash Debabrata ddash.biochem@gmail.com https://ror.org/04cdn2797 grid.411507.6 0000 0001 2287 8816 Centre for Advanced Research on Platelet Signaling and Thrombosis Biology, Department of Biochemistry, Institute of Medical Sciences, Banaras Hindu University, 30 9 2025 2025 8 478257 1384 22 11 2024 9 9 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Platelets are small, enucleate blood cells having life span of 10-12 days that play fundamental role in hemostasis and thrombosis. Casein Kinase 1 (CK1) is a serine/threonine-specific protein kinase that governs multiple cellular processes including circadian rhythm, morphogen signaling and apoptosis; however, its role in platelet biology and thrombogenesis remains unexplored. Employing a CK1-specific pharmacological inhibitors, we demonstrate here a pivotal role of CK1 in agonist-induced platelet activation. Inhibition of CK1 disrupts platelet functions that include aggregation, integrin activation, interaction with leukocytes, and thrombus formation under arterial shear ex vivo as well as in a murine model of thrombosis. CK1 maintains mitochondrial integrity by stabilizing inner mitochondrial membrane that propels energy metabolism in activated platelets. Notably, CK1 inhibition suppresses phosphorylation of receptor-interacting protein kinase 3 (RIPK3) and mixed lineage kinase domain-like protein (MLKL), key arbiters of platelet activation leading to necroptosis, thus mechanistically linking CK1 activity to platelet prothrombotic responses. Downregulation of CK1 did not affect primary hemostasis nor platelet viability while significantly deferring thrombus formation, which underscores its potential as a safe therapeutic option against thrombotic disorders. This study uncovers an emerging role of CK1 in unleashing of prothrombotic phenotype and positions CK1 as a potential target for antithrombotic measures. CK1 drives platelet activation and thrombosis via RIPK3–MLKL signaling, sustaining mitochondrial integrity and energy metabolism. Its inhibition curbs thrombosis without affecting viability or primary hemostasis, offering a safe antithrombotic target. Subject terms Medical research Cell signalling https://doi.org/10.13039/501100001407 Department of Biotechnology, Ministry of Science and Technology (DBT) BT/PR48671/CMD/150/41/2023 Dash Debabrata https://doi.org/10.13039/501100001411 Indian Council of Medical Research (ICMR) IIRP-2023-2835 IIRPIG-2025-01-00124 Dash Debabrata pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Enucleate platelets, the principal hemostatic agents in blood, circulate in non-adhesive quiescent states. Platelets become activated at sites of vascular damage and adhere to exposed sub-endothelial matrix components 1 2 3 Casein kinase-1 (CK1) is a family of serine/threonine protein kinases comprising seven human isoforms, namely α, γ1, γ2, γ3, δ, ε and less described α-like 4 5 6 7 8 10 11 12 13 14 15 6 16 17 Several signaling pathways in which CK1 plays a significant role are known to be operational in platelets. These include Wnt 18 19 20 21 19 Results Casein kinase-1 activity boosts platelet hemostatic responses to physiological agonists Platelets were pre-treated with either longdaysin or D4476, two pharmacologically distinct inhibitors of CK1, or the vehicle, followed by exposure to different physiological agonists. Neither of the inhibitors had any effect on resting (unstimulated) platelets (Supplementary Fig. 1J, K 11 22 23 1A, B 1D, E 1D–M 1F, G Ibα Fig. 1 Casein kinase-1 governs agonist-induced platelet activation responses. A B C D E D E F G H I H I J K L M N P O Q R S T t Aggregation of platelets entails fibrinogen forming bridges between neighboring platelets, as it binds to the ‘active’ conformers of α IIb 3 IIb 3 1N, O 2A, B 24 25 2A, B Fig. 2 Casein kinase-1 mediates hemostatic responses in agonist-stimulated platelets. A B C D E F G I J n K L Platelets, too, adhere to immobilized fibrinogen through integrins α IIb 3 26 28 1R, S 1R, T Secretion of granule contents is a hallmark of robust platelet activation. Release of adenine nucleotides from dense granules of thrombin-stimulated platelets was significantly abrogated (by 23.35% ± 3.47) in the presence of longdaysin (Fig. 1A, C 1P, Q We investigated the impact of CK1 downregulation in thrombin-challenged platelets pre-supplemented with aspirin, an irreversible inhibitor of cyclooxygenase-1. Both PAC-1 binding as well as P-selectin externalization were impaired to a similar extent in aspirin-treated platelets compared to non-aspirinated counterparts (Supplementary Fig. 1A–C 1H–K As P-selectin possesses high affinity toward P-selectin glycoprotein ligand-1 (PSGL-1) expressed on leukocyte membranes 29 2C–F M 2 Ibα 30 33 34 36 Reactive oxygen species are critical mediators of platelet activation 37 1H, I Intracellular Ca 2+ 38 6 2G 2G 2H, I A sub-population of stimulated platelets externalizes phosphatidylserine (PS) on surface membranes, thus rendering them ‘procoagulant’ at the site of vascular injury 39 2I, J Stimulated platelets also release extracellular vesicles (PEVs) 40 43 44 3A, B Fig. 3 Casein kinase-1 induces PEV release and Tyr/Ser phosphorylation of peptides in agonist-challenged platelets. A B C D E F G I K M Src H J L Src N O Platelet activation is typified by a significant rise in the pool of tyrosine phosphoproteome attributable to stimulation of Src 45 46 3M–O 4 Src 3G–L 4 In an elegant study, Hanna-Addams and coworkers have demonstrated a fundamental role of CK1 in phosphorylation of RIPK3 and MLKL, the key molecular arbiters governing necroptosis 15 47 21 Stimulation of platelets with thrombin (0.25 U/ml) triggered phosphorylation of RIPK3 (at Ser-227) as well as MLKL (at Ser-358), which were significantly abrogated upon pre-treatment with GSK’872, a pharmacological inhibitor of RIPK3, by 27.31% ± 0.05 and 20% ± 0.05, respectively (Fig. 3C–F 4 3C–F Taken together, our findings suggest dual regulatory roles for CK1 in driving platelet activation signaling. CK1 instigates canonical Akt-GSK-3β signaling essential for agonist-induced platelet functional responses. In parallel, it prompts the activation of the RIPK3-MLKL axis, which has been increasingly implicated in the regulation of platelet thrombogenicity. Casein kinase-1 governs mitochondrial integrity and platelet bioenergetics Despite lacking nucleus, platelets typically harbor well-coupled functional mitochondria averaging between 4 and 8 units per cell 48 50 37 48 51 53 Oxygen flux was monitored in a stirred platelet suspension at high resolution, with samples analyzed at 2 s intervals, employing a Clark amperometric electrode. Prior exposure to longdaysin was observed to minimally affect baseline respiration in resting platelets. However, the surge in oxygen consumption provoked by thrombin (0.25 U/ml) was partially abrogated (by 38% ± 1.6) in platelets treated with longdaysin (Fig. 4A–C 4A, B, E 4 Fig. 4 Casein kinase-1 ensures the preservation of functional mitochondria in thrombin-stimulated platelets. A B A B C F G H J K I L t The escape of protons from the intermembrane space into the mitochondrial matrix would ensue the collapse of transmembrane potential (ΔΨm), leading to a drop in mitochondrial ROS production 48 54 4G–K m 55 4I, L 56 Casein kinase-1 governs arterial thrombosis in mice and regulates the generation of platelet thrombi ex vivo Platelets play a critical role in the development of arterial thrombosis, which is central to emergencies such as acute myocardial infarction and ischemic stroke. To investigate the involvement of CK1 in the generation of occlusive intramural thrombi in vivo, we tested the effect of longdaysin in a murine model of mesenteric arteriolar thrombosis. Platelets were fluorescently labeled, and mice were intraperitoneally administered with either longdaysin (5 mg/kg) or vehicle (DMSO). Intramural thrombus was induced by topical application of 20% ferric chloride for 3 min on exteriorized mesenteric arterioles. Thrombus formation was visualized in real time by intravital imaging employing an epifluorescence video microscope equipped with a high-speed camera (Fig. 5A Fig. 5 Inhibition of casein kinase-1 activity impedes arterial thrombosis and pulmonary thromboembolism in mice, and restricts formation of platelet thrombi upon immobilized collagen. A B D B C D E n n F − 1 G n H I J n n K L n M n B D J M G L t We measured the time to first thrombus formation, the rate of thrombus growth and the time till complete vessel occlusion as indicators of the initiation, propagation and stabilization of thrombus, respectively. Remarkably, mice administered with longdaysin exhibited significantly delayed thrombus formation compared to vehicle-treated animals (average times to form first thrombus: control, 8.21 min; longdaysin, 10.75 min) (Fig. 5B 5C 5D 5E 5E 1 2 In order to explore the role of casein kinase-1 in the generation of thrombus ex vivo, we next studied dynamic adhesion of human platelets and thrombus formation on immobilized collagen under arterial shear (1500 s − 1 5F, G 2I, J To further corroborate these findings, we employed a mouse model of collagen-epinephrine-induced pulmonary thromboembolism. Hematoxylin and eosin-stained lung sections from longdaysin-treated mice revealed significantly fewer thrombosed pulmonary vessels than their control counterparts (longdaysin, 1.37 per low-power field or lpf; control, 3.5/lpf) (Fig. 5H–J 2C, E, F, H 2D, E, G, H In keeping with the above, we next analyzed the contribution of CK1 on intrinsic pathway of blood coagulation by employing kaolin-activated thromboelastography. Reaction time (R) denotes the time of latency from the start of the test to initial fibrin formation. Pre-treatment of platelets with longdaysin significantly prolonged the reaction time from 5.9 to 6.9 min (Fig. 5K, L 2K–M Subsequently, we investigated the impact of longdaysin on primary hemostasis in mice employing tail-bleeding assay. Administration of longdaysin (5 mg/kg) did not affect the bleeding time (time required until the cessation of bleeding for ≥10 s) when compared to vehicle-treated control mice (Fig. 5M To evaluate the impact of CK1 inhibition on platelet viability, platelets were incubated with varying concentrations of the longdaysin (5, 10, 20, and 30 µM) or longdaysin with thrombin (0.25 U/ml) and subjected to MTT assay. We observed no significant alteration in the number of viable cells under above experimental conditions (Supplementary Fig. 1L Discussion Employing longdaysin and D4476, two pharmacologically independent cell-permeable inhibitors of α and δ isoforms of CK1 11 22 57 58 59 12/13 q 12/13 60 62 Further insights into CK1’s involvement in the generation of procoagulant platelet sub-population can be drawn from elegant studies by Agbani et al. 63 64 65 66 2 3A 67 Overall, the agonist-induced platelet activation and aggregation processes rely heavily on ATP supplied by mitochondrial oxidative phosphorylation (OXPHOS) 68 69 m 48 The role of CK1 in the phosphorylation of RIPK3 and MLKL, molecules that govern necroptosis, has already been acknowledged in HeLa cells 15 21 48 CK2β has been shown to participate in thrombopoiesis, platelet activation, and arterial thrombosis in vivo 70 71 72 73 74 3 75 77 In summary, this study presents compelling evidence in support of a central role of CK1 in orchestrating agonist-induced platelet activation progressing to prothrombotic phenotype. The existing antiplatelet regimens are commonly plagued by bleeding complications. Remarkably, inhibition of CK1 did neither impair the viability of platelets nor impact primary hemostasis, while it significantly retarded thrombosis as evident from the in vivo and ex vivo studies. Thus, CK1 may potentially serve as a promising target for therapeutic intervention against thrombotic disorders. Methods Materials Anti-MLKL polyclonal antibody and anti-phospho (Ser-358)-MLKL (p-MLKL) monoclonal antibody were the products of GeneTex (#GTX107538) and Abcam (#ab187091), respectively. Monoclonal antibodies against phospho-RIPK3 (Ser-227) (#93654), RIPK3 (# 13526), phospho-AKT (Ser-473) (#4051), AKT (#9272), phospho-GSK-3β (Ser-9) (#9336), and GSK-3β (#12456) were from Cell Signaling Technology. Antibody against phosphotyrosine (pY99, #sc-7020) was procured from Santa Cruz Biotechnology. PE-mouse anti-human CD62P (#550561), FITC-mouse anti-human PAC-1 (#340507), FITC-mouse anti-human CD14 (#555397), APC-mouse anti-human CD15 (#551376) were from BD Biosciences. Anti-phospho- Src F13191 F14201 2 Platelet isolation Platelets were isolated from fresh human blood by differential centrifugation 21 78 79 g g 2 2 4 3 8 20 37 g Platelet aggregation Washed human platelets or platelets suspended in plasma (PRP), pre-treated either with longdaysin or D4476 or vehicle (DMSO), were stirred at 1200 rpm in a Chrono-log optical lumi-aggregometer (Model 700-2) at 37 °C for 5 min following the addition of the agonist. Platelet aggregation was recorded as the percentage change in light transmission over time, whereas 100% represents maximum light transmission through a platelet-free buffer B. Secretion of platelet granule contents Surface expression of P-selectin (CD62P) was assessed as a marker of α-granule secretion in platelets 68 Secretion of adenine nucleotides from platelet dense granules was measured by adding 15 μl of Chrono-lume reagent (2 μM luciferase/luciferin stock concentration) before agonist stimulation. The luminescence generated was monitored in a lumi-aggregometer simultaneously with platelet aggregation. Study of platelet integrin α IIb 3 Platelet activation induces a conformational change in surface α IIb 3 80 Measurement of annexin V binding Phosphatidylserine (PS) externalization, a key marker of procoagulant platelets, was assessed via annexin V binding, as previously 81 Immunoblotting Platelet proteins were separated on 10% SDS-PAGE (sodium dodecyl sulfate polyacrylamide gel electrophoresis) gels and electrophoretically transferred onto polyvinylidene difluoride (PVDF) membrane by employing Trans-Blot Turbo Transfer System (Bio-Rad) at 20 V/1.3 A for 20 to 25 min. Nonspecific protein binding sites were blocked with 5% non-fat dry milk in Tris-buffered saline (10 mM Tris-HCl and 150 mM NaCl, pH 8.0) with 0.05% Tween-20 (TBST) for 1 h at RT. Following 3 washing with TBST for 5 min each, membranes were incubated overnight at 4 °C with following primary antibodies at specified dilutions under gentle agitation: p-MLKL (1:1000), MLKL (1:1000), p-RIPK3 (1:800), RIPK3 (1:800), p-Y 99 418 Analysis of leukocyte-platelet interaction in whole blood Leukocyte-platelet interaction was measured as described earlier 21 29 82 21 29 48 82 3 Isolation and analysis of platelet-derived extracellular vesicles (PEVs) PEVs were isolated and characterized as described previously 21 42 g g Evaluation of platelet intracellular free calcium [Ca 2+ i Washed platelets (2 × 10 6 21 38 83 Prothrombin time assay Prothrombin time (PT) assay for evaluating the extrinsic coagulation pathway is based on the principle that tissue factor, in the presence of calcium ions, activates factor VII, which subsequently activates factor X, leading to the conversion of prothrombin (factor II) to thrombin, and ultimately resulting in fibrin clot formation 84 g STart 85 High-resolution mitochondrial respirometry Mitochondrial respiration was assessed utilizing a high-resolution respirometer (Oxygraph-2k, Oroboros Instruments) at 37 °C under stirring conditions (750 rpm). Washed human platelets (1.5 × 10 8 2 37 86 Quantification of mitochondrial transmembrane potential (Δψ m Washed human platelets (2.5 × 10⁸/ml) were pre-treated with Longdaysin, or vehicle, followed by stimulation with thrombin (0.25 U/ml) for 5 min at RT. Platelets were then stained with MitoTracker Red (500 nM) for 20 min at room temperature. Fluorescence from the labeled platelets was analyzed by flow cytometry (BD Biosciences, FACSCalibur). Quantification of mitochondrial reactive oxygen species (mROS) Mitochondrial superoxide generation in platelets was evaluated as described previously 21 Flow cytometric analysis of mitochondrial calcium flux Platelets (2.5 × 10 8 Platelet adhesion and spreading Glass slides were first cleaned and coated with fibrinogen (100 µg/ml) for 1 h, followed by blocking with 100 µl bovine serum albumin (10 mg/ml) for 1 h. The slides were then washed three times with 1X PBS. Washed platelets (2 × 10⁷ cells/ml), pre-treated with either longdaysin or vehicle for 20 min, were overlaid onto the fibrinogen-coated slides for 30 min at room temperature. The cells were fixed with 2% paraformaldehyde (PFA) for 20 min, followed by three washes with 1X PBS. Platelets were then permeabilized with 0.02% Triton X-100 for 1 min, washed, and stained with Alexa Fluor 488-conjugated phalloidin (1 µM) for 15 min. Adherent cells were examined using a Zeiss LSM 700 laser scanning confocal microscope with a ×63 objective and a pinhole size of 1 AU. Images were acquired using ZEN imaging software and further analyzed using ImageJ (National Institutes of Health). Four to five distinct fields were captured for each slide 20 Platelet thrombus formation on immobilized collagen matrix under arterial shear Platelet adhesion and thrombus growth on immobilized collagen matrix were quantified employing BioFlux (Fluxion Biosciences) microfluidics system as described previously 79 Study of intravital imaging of thrombus formation in murine mesenteric arterioles Thrombus formation in murine mesenteric arterioles induced by ferric chloride was imaged using intravital microscopy as already described 37 79 Pulmonary thromboembolism Pulmonary thromboembolism (PTE) was induced in 18 to 20 g Swiss albino mice of either sex as already described 37 87 Thromboelastography (TEG) Hemostatic parameters in human blood were investigated with the help of Thromboelastograph 5000 Hemostasis Analyzer System (Haemonetics) and TEG analytical software. Citrated whole human blood (1 ml) was incubated with CK1 inhibitor or vehicle for 15 min at RT, followed by transfer to kaolin vials with proper mixing. A 340 µl volume of kaolinized blood was added to disposable TEG cups that had pre-added 20 µl CaCl₂ (0.2 M) to initiate the coagulation cascade. Data were acquired in accordance with the manufacturer’s instructions until the maximum amplitude was achieved or 60 min had lapsed. The TEG parameters, such as R (reaction time), K (kinetics), α angle (rate of clot formation, i.e., ‘thrombin burst’) and MA (maximum amplitude) were recorded and analyzed. Mouse tail-bleeding assay Age-matched Swiss albino mice (10–12 weeks old) weighing 18–20 g were intraperitoneally administered with either longdaysin (5 mg/kg) or the vehicle. After 30 min, mice were intraperitoneally anesthetized with a ketamine/xylazine cocktail. The distal 3-mm segment of the tail was amputated with a fresh surgical blade. The tail was immediately submerged in PBS (pre-warmed at 37 °C), and bleeding was monitored. ‘Bleeding time’ was recorded as the time required until the cessation of bleeding for ≥10 s. The experiment was terminated in case bleeding continued until 20 min after injury 37 MTT assay for platelet viability Mitochondrial metabolic activity in platelets was evaluated using the MTT assay as described previously 88 90 Statistical methods Statistical analyses were conducted utilizing Prism 8.4.0 software (GraphPad). Multiple t p Ethics statement Fresh venous blood from healthy volunteers was collected under informed consent strictly in accordance with the recommendations and as approved by the Ethical Committee of the Institute of Medical Sciences, Banaras Hindu University. The study methodologies conformed to the standards set by the Declaration of Helsinki. The animal experiments were approved by the Central Animal Ethical Committee of the Institute of Medical Sciences, Banaras Hindu University (approval no. Dean/2017/CAEC/83). All procedures involving animals were conducted in strict accordance with relevant ethical guidelines. Efforts were made to minimize both the number of animals used and any potential suffering. All research involving human participants was conducted in compliance with applicable ethical standards and regulatory requirements. Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information Supplementary Information Description of Additional Supplementary files Supplementary Video-1 Supplementary Video-2 Supplementary Data 1 Reporting Summary Publisher’s Note Supplementary information The online version contains supplementary material available at 10.1038/s42003-025-08868-1. Acknowledgements This research was supported by a J. C. Bose National Fellowship (JBR/2023/000004), and grants received by D. Dash from the Department of Biotechnology (DBT) (BT/PR48671/CMD/150/41/2023), Government of India, the Indian Council of Medical Research (ICMR) under Extramural Program (IIRP-2023-2835 and IIRPIG-2025-01-00124), and Institute of Eminence (IoE) Faculty Incentive Grant (OH-31-IOE/6031) from Banaras Hindu University. Author contributions D.D. supervised the entire work. V.S., M.E. and S.N.C. performed various experiments and analyzed results. D.D., V.S. and M.E. wrote the manuscript. Peer review Peer review information Communications Biology Data availability All relevant data that support the findings of this study are within the paper. The raw numerical values are provided in Supplementary Data 1 4 Competing interests The authors declare no competing interests. References 1. Semple JW Italiano JE Jr. Freedman J Platelets and the immune continuum Nat. Rev. Immunol. 2011 11 264 274 10.1038/nri2956 21436837 Semple, J. W., Italiano, J. E. Jr. & Freedman, J. Platelets and the immune continuum. Nat. Rev. Immunol. 11 21436837 10.1038/nri2956 2. Scridon, A. Platelets and their role in hemostasis and thrombosis—from physiology to pathophysiology and therapeutic implications. Int. J. Mol. Sci. 10.3390/ijms232112772 PMC9653660 36361561 3. Barry FA Graham GJ Fry MJ Gibbins JM Regulation of glycogen synthase kinase 3 in human platelets: a possible role in platelet function? FEBS Lett. 2003 553 173 178 10.1016/S0014-5793(03)01015-9 14550568 Barry, F. A., Graham, G. J., Fry, M. J. & Gibbins, J. M. Regulation of glycogen synthase kinase 3 in human platelets: a possible role in platelet function? FEBS Lett. 553 14550568 10.1016/s0014-5793(03)01015-9 4. Knippschild U The casein kinase 1 family: participation in multiple cellular processes in eukaryotes Cell. Signal. 2005 17 675 689 10.1016/j.cellsig.2004.12.011 15722192 Knippschild, U. et al. The casein kinase 1 family: participation in multiple cellular processes in eukaryotes. Cell. Signal. 17 15722192 10.1016/j.cellsig.2004.12.011 5. Knippschild U The CK1 family: contribution to cellular stress response and its role in carcinogenesis Front. Oncol. 2014 4 96 10.3389/fonc.2014.00096 24904820 PMC4032983 Knippschild, U. et al. The CK1 family: contribution to cellular stress response and its role in carcinogenesis. Front. Oncol. 4 24904820 10.3389/fonc.2014.00096 PMC4032983 6. Francisco JC Virshup DM Casein kinase 1 and human disease: insights from the circadian phosphoswitch Front. Mol. Biosci. 2022 9 911764 10.3389/fmolb.2022.911764 35720131 PMC9205208 Francisco, J. C. & Virshup, D. M. Casein kinase 1 and human disease: insights from the circadian phosphoswitch. Front. Mol. Biosci. 9 35720131 10.3389/fmolb.2022.911764 PMC9205208 7. Jiang J CK1 in developmental signaling: Hedgehog and Wnt Curr. Top. Dev. Biol. 2017 123 303 329 10.1016/bs.ctdb.2016.09.002 28236970 PMC5837819 Jiang, J. CK1 in developmental signaling: Hedgehog and Wnt. Curr. Top. Dev. Biol. 123 28236970 10.1016/bs.ctdb.2016.09.002 PMC5837819 8. Cheong JK Virshup DM Casein kinase 1: complexity in the family Int. J. Biochem. Cell Biol. 2011 43 465 469 10.1016/j.biocel.2010.12.004 21145983 Cheong, J. K. & Virshup, D. M. Casein kinase 1: complexity in the family. Int. J. Biochem. Cell Biol. 43 21145983 10.1016/j.biocel.2010.12.004 9. Franks ZG Campbell RA Weyrich AS Rondina MT Platelet-leukocyte interactions link inflammatory and thromboembolic events in ischemic stroke Ann. N. Y. Acad. Sci. 2010 1207 11 17 10.1111/j.1749-6632.2010.05733.x 20955420 PMC3245960 Franks, Z. G., Campbell, R. A., Weyrich, A. S. & Rondina, M. T. Platelet-leukocyte interactions link inflammatory and thromboembolic events in ischemic stroke. Ann. N. Y. Acad. Sci. 1207 20955420 10.1111/j.1749-6632.2010.05733.x PMC3245960 10. Gross SD Anderson RA Casein kinase I: spatial organization and positioning of a multifunctional protein kinase family Cell. Signal. 1998 10 699 711 10.1016/S0898-6568(98)00042-4 9884021 Gross, S. D. & Anderson, R. A. Casein kinase I: spatial organization and positioning of a multifunctional protein kinase family. Cell. Signal. 10 9884021 10.1016/s0898-6568(98)00042-4 11. Hirota T High-throughput chemical screen identifies a novel potent modulator of cellular circadian rhythms and reveals CKIα as a clock regulatory kinase PLoS Biol. 2010 8 e1000559 10.1371/journal.pbio.1000559 21179498 PMC3001897 Hirota, T. et al. High-throughput chemical screen identifies a novel potent modulator of cellular circadian rhythms and reveals CKIα as a clock regulatory kinase. PLoS Biol. 8 21179498 10.1371/journal.pbio.1000559 PMC3001897 12. Takano A A missense variation in human casein kinase I epsilon gene that induces functional alteration and shows an inverse association with circadian rhythm sleep disorders Neuropsychopharmacology 2004 29 1901 1909 10.1038/sj.npp.1300503 15187983 Takano, A. et al. A missense variation in human casein kinase I epsilon gene that induces functional alteration and shows an inverse association with circadian rhythm sleep disorders. Neuropsychopharmacology 29 15187983 10.1038/sj.npp.1300503 13. Liu J Wnt/β-catenin signalling: function, biological mechanisms, and therapeutic opportunities Signal Transduct. Target. Ther. 2022 7 3 10.1038/s41392-021-00762-6 34980884 PMC8724284 Liu, J. et al. Wnt/β-catenin signalling: function, biological mechanisms, and therapeutic opportunities. Signal Transduct. Target. Ther. 7 34980884 10.1038/s41392-021-00762-6 PMC8724284 14. Pietrobono S Gagliardi S Stecca B Non-canonical Hedgehog signaling pathway in cancer: activation of GLI transcription factors beyond smoothened Front. Genet. 2019 10 556 10.3389/fgene.2019.00556 31244888 PMC6581679 Pietrobono, S., Gagliardi, S. & Stecca, B. Non-canonical Hedgehog signaling pathway in cancer: activation of GLI transcription factors beyond smoothened. Front. Genet. 10 31244888 10.3389/fgene.2019.00556 PMC6581679 15. Hanna-Addams S Liu S Liu H Chen S Wang Z CK1α, CK1δ, and CK1ε are necrosome components which phosphorylate serine 227 of human RIPK3 to activate necroptosis Proc. Natl. Acad. Sci. USA 2020 117 1962 1970 10.1073/pnas.1917112117 31932442 PMC6995002 Hanna-Addams, S., Liu, S., Liu, H., Chen, S. & Wang, Z. CK1α, CK1δ, and CK1ε are necrosome components which phosphorylate serine 227 of human RIPK3 to activate necroptosis. Proc. Natl. Acad. Sci. USA 117 31932442 10.1073/pnas.1917112117 PMC6995002 16. Schittek B Sinnberg T Biological functions of casein kinase 1 isoforms and putative roles in tumorigenesis Mol. Cancer 2014 13 231 10.1186/1476-4598-13-231 25306547 PMC4201705 Schittek, B. & Sinnberg, T. Biological functions of casein kinase 1 isoforms and putative roles in tumorigenesis. Mol. Cancer 13 25306547 10.1186/1476-4598-13-231 PMC4201705 17. Sunkari YK Meijer L Flajolet M The protein kinase CK1: inhibition, activation, and possible allosteric modulation Front. Mol. Biosci. 2022 9 916232 10.3389/fmolb.2022.916232 36090057 PMC9449355 Sunkari, Y. K., Meijer, L. & Flajolet, M. The protein kinase CK1: inhibition, activation, and possible allosteric modulation. Front. Mol. Biosci. 9 36090057 10.3389/fmolb.2022.916232 PMC9449355 18. Kumari S Dash D Regulation of β-catenin stabilization in human platelets Biochimie 2013 95 1252 1257 10.1016/j.biochi.2013.01.021 23402908 Kumari, S. & Dash, D. Regulation of β-catenin stabilization in human platelets. Biochimie 95 23402908 10.1016/j.biochi.2013.01.021 19. Steele BM WNT-3a modulates platelet function by regulating small GTPase activity FEBS Lett. 2012 586 2267 2272 10.1016/j.febslet.2012.05.060 22705156 Steele, B. M. et al. WNT-3a modulates platelet function by regulating small GTPase activity. FEBS Lett. 586 22705156 10.1016/j.febslet.2012.05.060 20. Tiwari A Noncanonical Sonic Hedgehog signaling amplifies platelet reactivity and thrombogenicity Blood Adv. 2022 6 5024 5040 10.1182/bloodadvances.2021006560 35704688 PMC9631642 Tiwari, A. et al. Noncanonical Sonic Hedgehog signaling amplifies platelet reactivity and thrombogenicity. Blood Adv. 6 35704688 10.1182/bloodadvances.2021006560 PMC9631642 21. Ekhlak M Necroptosis executioner MLKL plays pivotal roles in agonist-induced platelet prothrombotic responses and lytic cell death in a temporal order Cell Death Differ. 2023 30 1886 1899 10.1038/s41418-023-01181-6 37301927 PMC10406901 Ekhlak, M. et al. Necroptosis executioner MLKL plays pivotal roles in agonist-induced platelet prothrombotic responses and lytic cell death in a temporal order. Cell Death Differ. 30 37301927 10.1038/s41418-023-01181-6 PMC10406901 22. Xiong Y Longdaysin inhibits Wnt/β-catenin signaling and exhibits antitumor activity against breast cancer Onco Targets Ther. 2019 12 993 1005 10.2147/OTT.S193024 30787621 PMC6368421 Xiong, Y. et al. Longdaysin inhibits Wnt/β-catenin signaling and exhibits antitumor activity against breast cancer. Onco Targets Ther. 12 30787621 10.2147/OTT.S193024 PMC6368421 23. Hirota T Identification of small molecule activators of cryptochrome Science 2012 337 1094 1097 10.1126/science.1223710 22798407 PMC3589997 Hirota, T. et al. Identification of small molecule activators of cryptochrome. Science 337 22798407 10.1126/science.1223710 PMC3589997 24. Shattil SJ Kim C Ginsberg MH The final steps of integrin activation: the end game Nat. Rev. Mol. Cell Biol. 2010 11 288 300 10.1038/nrm2871 20308986 PMC3929966 Shattil, S. J., Kim, C. & Ginsberg, M. H. The final steps of integrin activation: the end game. Nat. Rev. Mol. Cell Biol. 11 20308986 10.1038/nrm2871 PMC3929966 25. Jackson SP Nesbitt WS Kulkarni S Signaling events underlying thrombus formation J. Thromb. Haemost. 2003 1 1602 1612 10.1046/j.1538-7836.2003.00267.x 12871297 Jackson, S. P., Nesbitt, W. S. & Kulkarni, S. Signaling events underlying thrombus formation. J. Thromb. Haemost. 1 12871297 10.1046/j.1538-7836.2003.00267.x 26. Durrant TN van den Bosch MT Hers I Integrin α(IIb)β(3) outside-in signaling Blood 2017 130 1607 1619 10.1182/blood-2017-03-773614 28794070 PMC5672329 Durrant, T. N., van den Bosch, M. T. & Hers, I. Integrin α(IIb)β(3) outside-in signaling. Blood 130 28794070 10.1182/blood-2017-03-773614 PMC5672329 27. Ni H Freedman J Platelets in hemostasis and thrombosis: role of integrins and their ligands Transfus. Apher. Sci. 2003 28 257 264 10.1016/S1473-0502(03)00044-2 12725952 Ni, H. & Freedman, J. Platelets in hemostasis and thrombosis: role of integrins and their ligands. Transfus. Apher. Sci. 28 12725952 10.1016/S1473-0502(03)00044-2 28. Shen B Delaney MK Du X Inside-out, outside-in, and inside-outside-in: G protein signaling in integrin-mediated cell adhesion, spreading, and retraction Curr. Opin. Cell Biol. 2012 24 600 606 10.1016/j.ceb.2012.08.011 22980731 PMC3479359 Shen, B., Delaney, M. K. & Du, X. Inside-out, outside-in, and inside-outside-in: G protein signaling in integrin-mediated cell adhesion, spreading, and retraction. Curr. Opin. Cell Biol. 24 22980731 10.1016/j.ceb.2012.08.011 PMC3479359 29. Gerrits AJ Frelinger AL 3rd Michelson AD Whole blood analysis of leukocyte-platelet aggregates Curr. Protoc. Cytom. 2016 78 6.15.11 16.15.10 10.1002/cpcy.8 27723089 Gerrits, A. J., Frelinger, A. L. 3rd & Michelson, A. D. Whole blood analysis of leukocyte-platelet aggregates. Curr. Protoc. Cytom. 78 10.1002/cpcy.8 27723089 30. Chavakis T High molecular weight kininogen regulates platelet-leukocyte interactions by bridging Mac-1 and glycoprotein Ib J. Biol. Chem. 2003 278 45375 45381 10.1074/jbc.M304344200 12952972 Chavakis, T. et al. High molecular weight kininogen regulates platelet-leukocyte interactions by bridging Mac-1 and glycoprotein Ib. J. Biol. Chem. 278 12952972 10.1074/jbc.M304344200 31. Ehlers R Targeting platelet-leukocyte interactions: identification of the integrin Mac-1 binding site for the platelet counter receptor glycoprotein Ibalpha J. Exp. Med. 2003 198 1077 1088 10.1084/jem.20022181 14530377 PMC2194217 Ehlers, R. et al. Targeting platelet-leukocyte interactions: identification of the integrin Mac-1 binding site for the platelet counter receptor glycoprotein Ibalpha. J. Exp. Med. 198 14530377 10.1084/jem.20022181 PMC2194217 32. Simon DI Platelet glycoprotein ibalpha is a counterreceptor for the leukocyte integrin Mac-1 (CD11b/CD18) J. Exp. Med. 2000 192 193 204 10.1084/jem.192.2.193 10899906 PMC2193258 Simon, D. I. et al. Platelet glycoprotein ibalpha is a counterreceptor for the leukocyte integrin Mac-1 (CD11b/CD18). J. Exp. Med. 192 10899906 10.1084/jem.192.2.193 PMC2193258 33. Wang Y Leukocyte integrin Mac-1 regulates thrombosis via interaction with platelet GPIbα Nat. Commun. 2017 8 15559 10.1038/ncomms15559 28555620 PMC5477519 Wang, Y. et al. Leukocyte integrin Mac-1 regulates thrombosis via interaction with platelet GPIbα. Nat. Commun. 8 28555620 10.1038/ncomms15559 PMC5477519 34. Gros A Ollivier V Ho-Tin-Noé B Platelets in inflammation: regulation of leukocyte activities and vascular repair Front. Immunol. 2014 5 678 25610439 10.3389/fimmu.2014.00678 PMC4285099 Gros, A., Ollivier, V. & Ho-Tin-Noé, B. Platelets in inflammation: regulation of leukocyte activities and vascular repair. Front. Immunol. 5 25610439 10.3389/fimmu.2014.00678 PMC4285099 35. Gaertner F Massberg S Patrolling the vascular borders: platelets in immunity to infection and cancer Nat. Rev. Immunol. 2019 19 747 760 10.1038/s41577-019-0202-z 31409920 Gaertner, F. & Massberg, S. Patrolling the vascular borders: platelets in immunity to infection and cancer. Nat. Rev. Immunol. 19 31409920 10.1038/s41577-019-0202-z 36. Schrottmaier WC Mussbacher M Salzmann M Assinger A Platelet-leukocyte interplay during vascular disease Atherosclerosis 2020 307 109 120 10.1016/j.atherosclerosis.2020.04.018 32439204 Schrottmaier, W. C., Mussbacher, M., Salzmann, M. & Assinger, A. Platelet-leukocyte interplay during vascular disease. Atherosclerosis 307 32439204 10.1016/j.atherosclerosis.2020.04.018 37. Kulkarni PP Aerobic glycolysis fuels platelet activation: small-molecule modulators of platelet metabolism as anti-thrombotic agents Haematologica 2019 104 806 818 10.3324/haematol.2018.205724 30381300 PMC6442984 Kulkarni, P. P. et al. Aerobic glycolysis fuels platelet activation: small-molecule modulators of platelet metabolism as anti-thrombotic agents. Haematologica 104 30381300 10.3324/haematol.2018.205724 PMC6442984 38. Mallick RL Kumari S Singh N Sonkar VK Dash D Prion protein fragment (106-126) induces prothrombotic state by raising platelet intracellular calcium and microparticle release Cell Calcium 2015 57 300 311 10.1016/j.ceca.2015.02.002 25749016 Mallick, R. L., Kumari, S., Singh, N., Sonkar, V. K. & Dash, D. Prion protein fragment (106-126) induces prothrombotic state by raising platelet intracellular calcium and microparticle release. Cell Calcium 57 25749016 10.1016/j.ceca.2015.02.002 39. Reddy EC Rand ML Procoagulant phosphatidylserine-exposing platelets in vitro and in vivo Front. Cardiovasc. Med. 2020 7 15 10.3389/fcvm.2020.00015 32195268 PMC7062866 Reddy, E. C. & Rand, M. L. Procoagulant phosphatidylserine-exposing platelets in vitro and in vivo. Front. Cardiovasc. Med. 7 32195268 10.3389/fcvm.2020.00015 PMC7062866 40. Chaurasia SN Platelet HIF-2α promotes thrombogenicity through PAI-1 synthesis and extracellular vesicle release Haematologica 2019 104 2482 2492 10.3324/haematol.2019.217463 31004026 PMC6959171 Chaurasia, S. N. et al. Platelet HIF-2α promotes thrombogenicity through PAI-1 synthesis and extracellular vesicle release. Haematologica 104 31004026 10.3324/haematol.2019.217463 PMC6959171 41. Heijnen HF Schiel AE Fijnheer R Geuze HJ Sixma JJ Activated platelets release two types of membrane vesicles: microvesicles by surface shedding and exosomes derived from exocytosis of multivesicular bodies and alpha-granules Blood 1999 94 3791 3799 10.1182/blood.V94.11.3791 10572093 Heijnen, H. F., Schiel, A. E., Fijnheer, R., Geuze, H. J. & Sixma, J. J. Activated platelets release two types of membrane vesicles: microvesicles by surface shedding and exosomes derived from exocytosis of multivesicular bodies and alpha-granules. Blood 94 10572093 42. Kushwaha G Chaurasia SN Pandey A Dash D Characterization of fibrinogen binding on platelet-derived extracellular vesicles Thromb. Res. 2018 172 135 138 10.1016/j.thromres.2018.10.021 30412835 Kushwaha, G., Chaurasia, S. N., Pandey, A. & Dash, D. Characterization of fibrinogen binding on platelet-derived extracellular vesicles. Thromb. Res. 172 30412835 10.1016/j.thromres.2018.10.021 43. Lopez E Platelet-derived- extracellular vesicles promote hemostasis and prevent the development of hemorrhagic shock Sci. Rep. 2019 9 17676 10.1038/s41598-019-53724-y 31776369 PMC6881357 Lopez, E. et al. Platelet-derived- extracellular vesicles promote hemostasis and prevent the development of hemorrhagic shock. Sci. Rep. 9 31776369 10.1038/s41598-019-53724-y PMC6881357 44. Dyer MR Platelet-derived extracellular vesicles released after trauma promote hemostasis and contribute to DVT in mice J. Thromb. Haemost. 2019 17 1733 1745 10.1111/jth.14563 31294514 PMC6773503 Dyer, M. R. et al. Platelet-derived extracellular vesicles released after trauma promote hemostasis and contribute to DVT in mice. J. Thromb. Haemost. 17 31294514 10.1111/jth.14563 PMC6773503 45. Santos MT Participation of tyrosine phosphorylation in cytoskeletal reorganization, alpha(IIb)beta(3) integrin receptor activation, and aspirin-insensitive mechanisms of thrombin-stimulated human platelets Circulation 2000 102 1924 1930 10.1161/01.CIR.102.16.1924 11034940 Santos, M. T. et al. Participation of tyrosine phosphorylation in cytoskeletal reorganization, alpha(IIb)beta(3) integrin receptor activation, and aspirin-insensitive mechanisms of thrombin-stimulated human platelets. Circulation 102 11034940 10.1161/01.cir.102.16.1924 46. Golden A Brugge JS Shattil SJ Role of platelet membrane glycoprotein IIb-IIIa in agonist-induced tyrosine phosphorylation of platelet proteins J. Cell Biol. 1990 111 3117 3127 10.1083/jcb.111.6.3117 1702789 PMC2116418 Golden, A., Brugge, J. S. & Shattil, S. J. Role of platelet membrane glycoprotein IIb-IIIa in agonist-induced tyrosine phosphorylation of platelet proteins. J. Cell Biol. 111 1702789 10.1083/jcb.111.6.3117 PMC2116418 47. Zhang Y Receptor-interacting protein kinase 3 promotes platelet activation and thrombosis Proc. Natl. Acad. Sci. USA 2017 114 2964 2969 10.1073/pnas.1610963114 28242694 PMC5358369 Zhang, Y. et al. Receptor-interacting protein kinase 3 promotes platelet activation and thrombosis. Proc. Natl. Acad. Sci. USA 114 28242694 10.1073/pnas.1610963114 PMC5358369 48. Kulkarni PP Ekhlak M Sonkar VK Dash D Mitochondrial ATP generation in stimulated platelets is essential for granule secretion but dispensable for aggregation and procoagulant activity Haematologica 2022 107 1209 1213 10.3324/haematol.2021.279847 34937318 PMC9052923 Kulkarni, P. P., Ekhlak, M., Sonkar, V. K. & Dash, D. Mitochondrial ATP generation in stimulated platelets is essential for granule secretion but dispensable for aggregation and procoagulant activity. Haematologica 107 34937318 10.3324/haematol.2021.279847 PMC9052923 49. Melchinger H Jain K Tyagi T Hwa J Role of platelet mitochondria: life in a nucleus-free zone Front. Cardiovasc. Med. 2019 6 153 10.3389/fcvm.2019.00153 31737646 PMC6828734 Melchinger, H., Jain, K., Tyagi, T. & Hwa, J. Role of platelet mitochondria: life in a nucleus-free zone. Front. Cardiovasc. Med. 6 31737646 10.3389/fcvm.2019.00153 PMC6828734 50. Shuster RC Rubenstein AJ Wallace DC Mitochondrial DNA in anucleate human blood cells Biochem. Biophys. Res. Commun. 1988 155 1360 1365 10.1016/S0006-291X(88)81291-9 3178814 Shuster, R. C., Rubenstein, A. J. & Wallace, D. C. Mitochondrial DNA in anucleate human blood cells. Biochem. Biophys. Res. Commun. 155 3178814 10.1016/s0006-291x(88)81291-9 51. Holmsen H Energy metabolism and platelet responses Vox Sang. 1981 40 1 7 10.1111/j.1423-0410.1981.tb00732.x 6794222 Holmsen, H. Energy metabolism and platelet responses. Vox Sang. 40 6794222 10.1111/j.1423-0410.1981.tb00732.x 52. Ravi S Metabolic plasticity in resting and thrombin activated platelets PLoS ONE 2015 10 e0123597 10.1371/journal.pone.0123597 25875958 PMC4395425 Ravi, S. et al. Metabolic plasticity in resting and thrombin activated platelets. PLoS ONE 10 25875958 10.1371/journal.pone.0123597 PMC4395425 53. Verhoeven AJ Mommersteeg ME Akkerman JW Metabolic energy is required in human platelets at any stage during optical aggregation and secretion Biochim. Biophys. Acta 1984 800 242 250 10.1016/0304-4165(84)90402-1 6466703 Verhoeven, A. J., Mommersteeg, M. E. & Akkerman, J. W. Metabolic energy is required in human platelets at any stage during optical aggregation and secretion. Biochim. Biophys. Acta 800 6466703 10.1016/0304-4165(84)90402-1 54. Cardenes N Platelet bioenergetic screen in sickle cell patients reveals mitochondrial complex V inhibition, which contributes to platelet activation Blood 2014 123 2864 2872 10.1182/blood-2013-09-529420 24677541 PMC4007612 Cardenes, N. et al. Platelet bioenergetic screen in sickle cell patients reveals mitochondrial complex V inhibition, which contributes to platelet activation. Blood 123 24677541 10.1182/blood-2013-09-529420 PMC4007612 55. Choo HJ Saafir TB Mkumba L Wagner MB Jobe SM Mitochondrial calcium and reactive oxygen species regulate agonist-initiated platelet phosphatidylserine exposure Arterioscler. Thromb. Vasc. Biol. 2012 32 2946 2955 10.1161/ATVBAHA.112.300433 23087357 PMC3545632 Choo, H. J., Saafir, T. B., Mkumba, L., Wagner, M. B. & Jobe, S. M. Mitochondrial calcium and reactive oxygen species regulate agonist-initiated platelet phosphatidylserine exposure. Arterioscler. Thromb. Vasc. Biol. 32 23087357 10.1161/ATVBAHA.112.300433 PMC3545632 56. McCormack JG Denton RM Role of calcium ions in the regulation of intramitochondrial metabolism. Properties of the Ca 2+ Biochem. J. 1980 190 95 105 10.1042/bj1900095 6778477 PMC1162067 McCormack, J. G. & Denton, R. M. Role of calcium ions in the regulation of intramitochondrial metabolism. Properties of the Ca 2+ Biochem. J. 190 6778477 10.1042/bj1900095 PMC1162067 57. Rena G Bain J Elliott M Cohen P D4476, a cell-permeant inhibitor of CK1, suppresses the site-specific phosphorylation and nuclear exclusion of FOXO1a EMBO Rep. 2004 5 60 65 10.1038/sj.embor.7400048 14710188 PMC1298959 Rena, G., Bain, J., Elliott, M. & Cohen, P. D4476, a cell-permeant inhibitor of CK1, suppresses the site-specific phosphorylation and nuclear exclusion of FOXO1a. EMBO Rep. 5 14710188 10.1038/sj.embor.7400048 PMC1298959 58. Seger D Seger R Shaltiel S The CK2 phosphorylation of vitronectin. Promotion of cell adhesion via the alpha(v)beta 3-phosphatidylinositol 3-kinase pathway J. Biol. Chem. 2001 276 16998 17006 10.1074/jbc.M003766200 11278271 Seger, D., Seger, R. & Shaltiel, S. The CK2 phosphorylation of vitronectin. Promotion of cell adhesion via the alpha(v)beta 3-phosphatidylinositol 3-kinase pathway. J. Biol. Chem. 276 11278271 10.1074/jbc.M003766200 59. Guidetti GF Torti M Canobbio I Focal adhesion kinases in platelet function and thrombosis Arterioscler. Thromb. Vasc. Biol. 2019 39 857 868 10.1161/ATVBAHA.118.311787 30894012 Guidetti, G. F., Torti, M. & Canobbio, I. Focal adhesion kinases in platelet function and thrombosis. Arterioscler. Thromb. Vasc. Biol. 39 30894012 10.1161/ATVBAHA.118.311787 60. Calderwood DA Campbell ID Critchley DR Talins and kindlins: partners in integrin-mediated adhesion Nat. Rev. Mol. Cell Biol. 2013 14 503 517 10.1038/nrm3624 23860236 PMC4116690 Calderwood, D. A., Campbell, I. D. & Critchley, D. R. Talins and kindlins: partners in integrin-mediated adhesion. Nat. Rev. Mol. Cell Biol. 14 23860236 10.1038/nrm3624 PMC4116690 61. Bearer EL Prakash JM Li Z Actin dynamics in platelets Int. Rev. Cytol. 2002 217 137 182 10.1016/S0074-7696(02)17014-8 12019562 PMC3376087 Bearer, E. L., Prakash, J. M. & Li, Z. Actin dynamics in platelets. Int. Rev. Cytol. 217 12019562 10.1016/s0074-7696(02)17014-8 PMC3376087 62. Holinstat M Normal platelet function Cancer Metastasis Rev. 2017 36 195 198 10.1007/s10555-017-9677-x 28667366 PMC5709181 Holinstat, M. Normal platelet function. Cancer Metastasis Rev. 36 28667366 10.1007/s10555-017-9677-x PMC5709181 63. Agbani EO Coordinated membrane ballooning and procoagulant spreading in human platelets Circulation 2015 132 1414 1424 10.1161/CIRCULATIONAHA.114.015036 26330411 Agbani, E. O. et al. Coordinated membrane ballooning and procoagulant spreading in human platelets. Circulation 132 26330411 10.1161/CIRCULATIONAHA.114.015036 64. Agbani, E. O. et al. Aquaporin-1 regulates platelet procoagulant membrane dynamics and in vivo thrombosis. JCI Insight. 10.1172/jci.insight.99062 PMC6012506 29769447 65. Heemskerk JW Mattheij NJ Cosemans JM Platelet-based coagulation: different populations, different functions J. Thromb. Haemost. 2013 11 2 16 10.1111/jth.12045 23106920 Heemskerk, J. W., Mattheij, N. J. & Cosemans, J. M. Platelet-based coagulation: different populations, different functions. J. Thromb. Haemost. 11 23106920 10.1111/jth.12045 66. Agbani EO Poole AW Procoagulant platelets: generation, function, and therapeutic targeting in thrombosis Blood 2017 130 2171 2179 10.1182/blood-2017-05-787259 28972013 Agbani, E. O. & Poole, A. W. Procoagulant platelets: generation, function, and therapeutic targeting in thrombosis. Blood 130 28972013 10.1182/blood-2017-05-787259 67. Schols SE Impaired thrombin generation and fibrin clot formation in patients with dilutional coagulopathy during major surgery Thromb. Haemost. 2010 103 318 328 10.1160/TH09-06-0396 20024495 Schols, S. E. et al. Impaired thrombin generation and fibrin clot formation in patients with dilutional coagulopathy during major surgery. Thromb. Haemost. 103 20024495 10.1160/TH09-06-0396 68. Kulkarni PP Fatty acid oxidation fuels agonist-induced platelet activation and thrombus formation: targeting β-oxidation of fatty acids as an effective anti-platelet strategy FASEB J. 2023 37 e22768 10.1096/fj.202201321RR 36624703 Kulkarni, P. P. et al. Fatty acid oxidation fuels agonist-induced platelet activation and thrombus formation: targeting β-oxidation of fatty acids as an effective anti-platelet strategy. FASEB J. 37 36624703 10.1096/fj.202201321RR 69. Kulkarni PP Ekhlak M Dash D Energy metabolism in platelets fuels thrombus formation: halting the thrombosis engine with small-molecule modulators of platelet metabolism Metabolism 2023 145 155596 10.1016/j.metabol.2023.155596 37244415 Kulkarni, P. P., Ekhlak, M. & Dash, D. Energy metabolism in platelets fuels thrombus formation: halting the thrombosis engine with small-molecule modulators of platelet metabolism. Metabolism 145 37244415 10.1016/j.metabol.2023.155596 70. Münzer P CK2β regulates thrombopoiesis and Ca 2+ Blood 2017 130 2774 2785 10.1182/blood-2017-05-784413 28928125 Münzer, P. et al. CK2β regulates thrombopoiesis and Ca 2+ Blood 130 28928125 10.1182/blood-2017-05-784413 71. Vainchenker W Raslova H CK2: a key regulator of thrombopoiesis Blood 2017 130 2695 2697 10.1182/blood-2017-10-808568 29269531 Vainchenker, W. & Raslova, H. CK2: a key regulator of thrombopoiesis. Blood 130 29269531 10.1182/blood-2017-10-808568 72. McCubrey JA Multifaceted roles of GSK-3 and Wnt/β-catenin in hematopoiesis and leukemogenesis: opportunities for therapeutic intervention Leukemia 2014 28 15 33 10.1038/leu.2013.184 23778311 PMC3887408 McCubrey, J. A. et al. Multifaceted roles of GSK-3 and Wnt/β-catenin in hematopoiesis and leukemogenesis: opportunities for therapeutic intervention. Leukemia 28 23778311 10.1038/leu.2013.184 PMC3887408 73. Gao C Xiao G Hu J Regulation of Wnt/β-catenin signaling by posttranslational modifications Cell Biosci. 2014 4 13 10.1186/2045-3701-4-13 24594309 PMC3977945 Gao, C., Xiao, G. & Hu, J. Regulation of Wnt/β-catenin signaling by posttranslational modifications. Cell Biosci. 4 24594309 10.1186/2045-3701-4-13 PMC3977945 74. Wang L Li J Di LJ Glycogen synthesis and beyond, a comprehensive review of GSK3 as a key regulator of metabolic pathways and a therapeutic target for treating metabolic diseases Med. Res. Rev. 2022 42 946 982 10.1002/med.21867 34729791 PMC9298385 Wang, L., Li, J. & Di, L. J. Glycogen synthesis and beyond, a comprehensive review of GSK3 as a key regulator of metabolic pathways and a therapeutic target for treating metabolic diseases. Med. Res. Rev. 42 34729791 10.1002/med.21867 PMC9298385 75. Li D August S Woulfe DS GSK3beta is a negative regulator of platelet function and thrombosis Blood 2008 111 3522 3530 10.1182/blood-2007-09-111518 18218855 PMC2275019 Li, D., August, S. & Woulfe, D. S. GSK3beta is a negative regulator of platelet function and thrombosis. Blood 111 18218855 10.1182/blood-2007-09-111518 PMC2275019 76. Moore, S. F. et al. Opposing roles of GSK3α and GSK3β phosphorylation in platelet function and thrombosis. Int. J. Mol. Sci. 10.3390/ijms221910656 PMC8508950 34638997 77. Ono M Matsubara Y Shibano T Ikeda Y Murata M GSK-3β negatively regulates megakaryocyte differentiation and platelet production from primary human bone marrow cells in vitro Platelets 2011 22 196 203 10.3109/09537104.2010.541959 21231855 Ono, M., Matsubara, Y., Shibano, T., Ikeda, Y. & Murata, M. GSK-3β negatively regulates megakaryocyte differentiation and platelet production from primary human bone marrow cells in vitro. Platelets 22 21231855 10.3109/09537104.2010.541959 78. Chaurasia, S. N. et al. Notch signaling functions in noncanonical juxtacrine manner in platelets to amplify thrombogenicity. Elife. 10.7554/eLife.79590 PMC9629830 36190110 79. Chaurasia SN Ayurvedic preparations of Raudra Rasa inhibit agonist-mediated platelet activation and restrict thrombogenicity without affecting cell viability FEBS Open Bio 2023 13 2342 2355 10.1002/2211-5463.13713 37787005 PMC10699108 Chaurasia, S. N. et al. Ayurvedic preparations of Raudra Rasa inhibit agonist-mediated platelet activation and restrict thrombogenicity without affecting cell viability. FEBS Open Bio 13 37787005 10.1002/2211-5463.13713 PMC10699108 80. Joo SJ Mechanisms of platelet activation and integrin αIIβ3 Korean Circ. J. 2012 42 295 301 10.4070/kcj.2012.42.5.295 22701130 PMC3369959 Joo, S. J. Mechanisms of platelet activation and integrin αIIβ3. Korean Circ. J. 42 22701130 10.4070/kcj.2012.42.5.295 PMC3369959 81. Ramstrom S O’Neill S Dunne E Kenny D Annexin V binding to platelets is agonist, time and temperature dependent Platelets 2010 21 289 296 10.3109/09537101003660564 20230207 Ramstrom, S., O’Neill, S., Dunne, E. & Kenny, D. Annexin V binding to platelets is agonist, time and temperature dependent. Platelets 21 20230207 10.3109/09537101003660564 82. Hui H Fuller KA Erber WN Linden MD Imaging flow cytometry in the assessment of leukocyte-platelet aggregates Methods 2017 112 46 54 10.1016/j.ymeth.2016.10.002 27720831 Hui, H., Fuller, K. A., Erber, W. N. & Linden, M. D. Imaging flow cytometry in the assessment of leukocyte-platelet aggregates. Methods 112 27720831 10.1016/j.ymeth.2016.10.002 83. Dev P Ekhlak M Dash D Pathak A Platelet function suggests cardioembolic aetiology in cryptogenic stroke Sci. Rep. 2023 13 7615 10.1038/s41598-023-32143-0 37165007 PMC10172292 Dev, P., Ekhlak, M., Dash, D. & Pathak, A. Platelet function suggests cardioembolic aetiology in cryptogenic stroke. Sci. Rep. 13 37165007 10.1038/s41598-023-32143-0 PMC10172292 84. Chu AJ Tissue factor, blood coagulation, and beyond: an overview Int. J. Inflam. 2011 2011 367284 21941675 10.4061/2011/367284 PMC3176495 Chu, A. J. Tissue factor, blood coagulation, and beyond: an overview. Int. J. Inflam. 2011 21941675 10.4061/2011/367284 PMC3176495 85. Gutierres PG Action of varespladib (LY-315920), a phospholipase A 2 Lachesis muta rhombeata Front. Pharm. 2021 12 812295 10.3389/fphar.2021.812295 PMC8790531 35095526 Gutierres, P. G. et al. Action of varespladib (LY-315920), a phospholipase A 2 Lachesis muta rhombeata Front. Pharm. 12 10.3389/fphar.2021.812295 PMC8790531 35095526 86. Sonkar VK Kulkarni PP Dash D Amyloid β peptide stimulates platelet activation through RhoA-dependent modulation of actomyosin organization FASEB J. 2014 28 1819 1829 10.1096/fj.13-243691 24421399 Sonkar, V. K., Kulkarni, P. P. & Dash, D. Amyloid β peptide stimulates platelet activation through RhoA-dependent modulation of actomyosin organization. FASEB J. 28 24421399 10.1096/fj.13-243691 87. Goldhaber SZ Bounameaux H Pulmonary embolism and deep vein thrombosis Lancet 2012 379 1835 1846 10.1016/S0140-6736(11)61904-1 22494827 Goldhaber, S. Z. & Bounameaux, H. Pulmonary embolism and deep vein thrombosis. Lancet 379 22494827 10.1016/S0140-6736(11)61904-1 88. Singh P Srivastava S Singh SK Mesoporous nanosilica: a thromboprotective nanomaterial for biomedical applications Toxicol. Vitr. 2022 83 105421 10.1016/j.tiv.2022.105421 35724835 Singh, P., Srivastava, S. & Singh, S. K. Mesoporous nanosilica: a thromboprotective nanomaterial for biomedical applications. Toxicol. Vitr. 83 10.1016/j.tiv.2022.105421 35724835 89. Singh SK Amine-modified graphene: thrombo-protective safer alternative to graphene oxide for biomedical applications ACS Nano 2012 6 2731 2740 10.1021/nn300172t 22376049 Singh, S. K. et al. Amine-modified graphene: thrombo-protective safer alternative to graphene oxide for biomedical applications. ACS Nano 6 22376049 10.1021/nn300172t 90. NaveenKumar SK Hemshekhar M Kemparaju K Girish KS Hemin-induced platelet activation and ferroptosis is mediated through ROS-driven proteasomal activity and inflammasome activation: protection by melatonin Biochim. Biophys. Acta Mol. Basis Dis. 2019 1865 2303 2316 10.1016/j.bbadis.2019.05.009 31102787 NaveenKumar, S. K., Hemshekhar, M., Kemparaju, K. & Girish, K. S. Hemin-induced platelet activation and ferroptosis is mediated through ROS-driven proteasomal activity and inflammasome activation: protection by melatonin. Biochim. Biophys. Acta Mol. Basis Dis. 1865 31102787 10.1016/j.bbadis.2019.05.009 ",
  "metadata": {
    "Title of this paper": "Hemin-induced platelet activation and ferroptosis is mediated through ROS-driven proteasomal activity and inflammasome activation: protection by melatonin",
    "Journal it was published in:": "Communications Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485074/"
  }
}