{
  "title": "Paper_817",
  "abstract": "pmc Brief Funct Genomics Brief Funct Genomics 1458 bfg bfgp Briefings in Functional Genomics 2041-2649 2041-2657 Oxford University Press PMC12479113 PMC12479113.1 12479113 12479113 41022541 10.1093/bfgp/elaf016 elaf016 1 Primary Research AcademicSubjects/SCI01140  Unmeasured https://orcid.org/0000-0001-6343-2589 Tahara Saeko  Bioinformatics Laboratory, Institute of Medicine, University of Tsukuba Tsukuba 1-1-1 Tennodai, Tsukuba, Ibaraki 305-8577 Japan https://orcid.org/0000-0002-1606-2762 Ozaki Haruka  Bioinformatics Laboratory, Institute of Medicine, University of Tsukuba Tsukuba 1-1-1 Tennodai, Tsukuba, Ibaraki 305-8577 Japan  Center for Artificial Intelligence Research, University of Tsukuba 1-1-1 Tennodai, Tsukuba, Ibaraki 305-8577 Japan  Laboratory for AI Biology, RIKEN Center for Biosystems Dynamics 2-2-3 Minatojima-minamimachi, Chuo-ku, Kobe, Hyogo 650-0047 Japan Corresponding author. Saeko Tahara, Bioinformatics Laboratory, Institute of Medicine, University of Tsukuba, Tsukuba 1-1-1 Tennodai, Tsukuba, Ibaraki 305-8577, Japan. E-mail: tahara.saeko.ss@alumni.tsukuba.ac.jp haruka.ozaki@md.tsukuba.ac.jp The Institute integrates genomics, bioinformatics, and biomedical research to advance precision medicine. 2025 30 9 2025 24 479690 elaf016 11 6 2025 30 7 2025 18 8 2025 30 09 2025 30 09 2025 01 10 2025 © The Author(s) 2025. Published by Oxford University Press. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract Transcription factor (TF) chromatin immunoprecipitation followed by sequencing (ChIP-seq) is essential for identifying genome-wide TF-binding sites (TFBSs), and the collected datasets offer a variety of opportunities for downstream analyses such as inference of gene regulatory network and prediction for effects of single-nucleotide polymorphisms (SNPs) on TFBSs. Although TF ChIP-seq data continue to accumulate in public databases, comprehensive coverage of biologically relevant TF-sample pairs (i.e. combination of targeted TF and cell type) remains elusive. This is due to the need for TF-specific antibodies and large cell numbers, limiting feasible TF–cell type combinations. Moreover, ChIP-seq is measurable when the TF is expressed in the target cell type. Thus, defining the full space of biologically relevant TF–sample pairs—including both measured and unmeasured—is essential to assess and improve dataset comprehensiveness. Here, we investigated publicly available human TF ChIP-seq datasets and introduced the concept of unmeasured https://moccs-db.shinyapps.io/Unmeasured_shiny_v1/ TF ChIP-seq transcription factor regulatory TF prediction unbiased large-scale data unmeasured JST-Mirai Program 10.13039/501100020959 JPMJMI20G7 JSPS KAKENHI JP22K17992 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Transcription factor (TF) chromatin immunoprecipitation followed by sequencing (ChIP-seq) is a technique that combines immunoprecipitation using antibodies specific to TFs with high-throughput sequencing technology to identify genome-wide TF-binding sites (TFBSs). International consortia, such as the Encyclopedia of DNA Elements (ENCODE) project [ 1 2–5 2–4 6–8 9–12 6 13–16 17 18 19 20 Despite these valuable resources and their broad applications, there remains a critical yet often overlooked limitation: many biologically relevant TF–sample combinations remain entirely unmeasured by ChIP-seq, resulting in significant gaps in our understanding of the functional genomic landscape. Given that the human genome encodes over 1600 TFs [ 21 22 A balanced and near-complete TF–cell-type atlas would replicate, for TF binding, the catalytic effect that community reference resources have had in genomics. Landmark consortia such as the Human Genome Project, ENCODE, and The Cancer Genome Atlas Program have shown that when data generation is decoupled from any single hypothesis and made openly available, the wider community repeatedly repurposes these data for unanticipated discoveries [ 1 23 24 25 26–30 In this study, we introduce the concept of unmeasured Results Past and current research attention strongly influences human transcription factor ChIP-seq data To investigate the distribution of publicly available human TF ChIP-seq data across TFs and cell types, we utilized ChIP-Atlas [ 4 Fig. S1a b Figs 1a–c S1c d Fig. S1E F Figure 1 Past and current research attention strongly influences human TF ChIP-seq data. (a) Dot plot illustrating the number and proportion of human TF ChIP-seq experiments per TF family and cell type class. (b, c) Distribution of ChIP-seq experiments across individual TFs (b) and cell types (c). (d, e) Lorenz curves showing the cumulative distribution of ChIP-seq experiments across TFs (d) and cell types (e) in three databases: ChIP-Atlas, GTRD, and ReMap. The x y Supplementary Table 1 Multi-panel scientific figure summarizing human TF ChIP-seq distributions, Lorenz curves for three databases, model feature importance, positive correlations with publications and ChIP-seq, and early–late TF ChIP-seq counts. To quantitatively assess this imbalance, we calculated the Gini coefficients for the number of ChIP-seq experiments targeting each TF and cell type ( Methods Fig. 1d e Methods 2 3 To investigate the factors contributing to this observed imbalance, we developed a machine learning model (XGBoost [ 31 et al. 32 Methods Fig. S1G Supplementary Table 1 Fig. S1h Fig. 1f Fig. 1g 32 We further investigated whether the popularity of specific TFs in ChIP-seq experiments has shifted over time or whether certain TFs have remained consistently popular. Comparing the number of ChIP-seq experiments conducted before 2012 to those after 2013 for each TF revealed a positive Spearman correlation coefficient of 0.35 ( Fig. 1h 32 33 Potentially measurable ChIP-seq experiments remain unmeasured across various tissue types Although TF ChIP-seq data are unevenly distributed, the extent to which biologically relevant TF–sample combinations remain unmeasured has not been fully explored. To identify such missing yet potentially measurable TF–sample pairs in TF ChIP-seq coverage, we explicitly defined unmeasured Fig. 2a 34 35 Methods Fig. S2a Fig. S2b Fig. 2b Fig. 2c Figure 2 Potentially measurable ChIP-seq experiments remain unmeasured across various tissue types. (a) Schematic illustration defining unmeasured P P Composite figure introducing unmeasured TF–sample pairs, mapping proportions of unmeasured expressed TFs by TF family and cell-type class, and comparing DEG counts in KO/KD experiments. Next, we examined whether these unmeasured TF–sample pairs might possess functional importance. To assess functional significance, we calculated the number of differentially expressed genes (DEGs) following the knockout (KO) or knockdown (KD) of TFs, comparing measured and unmeasured TF–sample pairs. First, to confirm that the number of DEGs serves as an appropriate metric for functional importance, we compared DEG counts between known cell-type-specific TF markers (TFs serving as markers in specific tissues or cell types) and nonspecific TFs. As expected, cell-type-specific TF markers exhibited significantly higher DEG counts than nonspecific TFs (Wilcoxon rank sum test, P Fig. 2d P Fig. 2d Prioritization of candidate transcription factor–sample pairs for future ChIP-seq experiments To systematically identify priority candidates for future ChIP-seq experiments among the unmeasured hidden gems 36 Fig. 3a 37 Fig. 3b Fig. 3c Figure 3 Prioritization of candidate TF–sample pairs for future ChIP-seq experiment. (a, b) Comparison of DEG counts from KO/KD experiments and associated publication numbers between measured and unmeasured TF–cell type class pairs (a) and specifically among TFMarker TFs (b). The dashed line indicates the threshold of 1000 DEGs. (c) Identified candidates (“ hidden gems” Composite figures showing the prioritization of TF–sample pairs via the number of DEGs and publication and unmeasured “hidden gem” candidates. For instance, the ATM gene is well-known as the third most frequently mutated gene in hereditary breast and ovarian cancer (HBOC) after BRCA1 and BRCA2. ATM deficiency has been shown to lead to abnormal transcriptional responses to estrogen, including activation of the oncogene c-MYC [ 38 hidden gems Diversity of targeted transcription factors influences downstream analyses using transcription factor ChIP-seq datasets The extensive accumulation of ChIP-seq data provides foundational resources for predicting regulatory TFs [ 39–42 17 18 First, we assessed how comprehensively existing human TF ChIP-seq datasets cover regulatory TFs across various cell lines. For each cell line, we calculated the proportion of expressed genes having at least one TF ChIP-seq peak near their transcription start sites (TSS ± 500 bp), defined as the “regulatory TF (Reg-TF) cover ratio” ( Methods Fig. 4a Fig. 4b Fig. 4c Figure 4 Diversity of targeted TFs influences downstream analyses using TF ChIP-seq datasets. (a) Overview of the calculation method for the regulatory TF (Reg-TF) cover ratio. (b) Annual changes in Reg-TF cover ratios across different cell lines (each color/line represents a distinct cell line). (c) Relationship between the number of measured unique TFs and the Reg-TF cover ratio. Each dot represents one cell line per year. (d) Overview of the calculation method for the GWAS-SNP cover ratio. (e) Annual changes in GWAS-SNP cover ratios across different cell lines (each color/line represents a distinct cell line). (f) Relationship between the number of measured unique TFs and the GWAS-SNP cover ratio. Each dot represents one cell line per year. Composite figure showing methods for Reg-TF and GWAS-SNP cover ratios, annual changes across cell lines/cell type classes, and associations between the number of measured unique TFs and cover ratios. Next, we evaluated the extent to which GWAS-identified SNPs are represented within the current TF ChIP-seq dataset. For each cell line, we calculated the “GWAS-SNP cover ratio,” defined as the proportion of GWAS-identified SNPs overlapping at least one TF ChIP-seq peak measured in the corresponding cell or tissue type ( Methods Fig. 4d Fig. 1a Fig. 4e Fig. 4f Feasibility of alternative strategies for conducting transcription factor ChIP-seq experiments Our analysis of Reg-TF and GWAS-SNP cover ratios indicates that diversity in targeted TFs critically enhances the quality of downstream analyses utilizing TF ChIP-seq data. This observation raises an important question: What measurement strategy would maximize these cover ratios efficiently, particularly during the initial phases of data collection? To explore this, we performed simulations to identify an optimal ordering of TF ChIP-seq experiments that would most rapidly increase the GWAS-SNP cover ratio in the early stages ( Fig. 5a Figure 5 Feasibility of alternative strategies for conducting TF ChIP-seq experiments. (a) Schematic overview of the simulation examining optimal TF ChIP-seq measurement sequences to maximize the GWAS-SNP cover ratio. (b, c) Annual trends of GWAS-SNP cover ratios (b) and cumulative number of unique TFs (c) under simulated random measurement orders. Higher AUC indicates better early performance. Red lines represent the simulation order with the highest AUC, blue lines represent the lowest AUC, and gray lines depict the actual historical measurement order. Composite figures showing the simulation of TF ChIP-seq measurement orders to maximize GWAS-SNP coverage, with yearly cover ratio and cumulative unique-TF trajectories. Our simulations identified several alternative experimental orders yielding higher AUC values compared to the original measurement sequence ( Figs 5b S3a t P Fig. S3b c Methods Figs 5c S3d Discussion In this study, we systematically examined the comprehensiveness and biases within current human TF ChIP-seq datasets, revealing substantial imbalances in the coverage across TFs and cell types ( Fig. 1 43 44 Fig. 1f g 45 46 47 48 Importantly, we identified numerous biologically relevant but currently unmeasured Figs 2 3 Fig. 4 Fig. 5 While many meta-scientific studies [ 32 49–52 We note several limitations of our study and outline future directions. First, the observed coverage imbalance may partly reflect “survivor bias”—TF–cell-type pairs lacking high-affinity antibodies or that are otherwise intractable seldom yield usable ChIP-seq data and therefore never enter public repositories, so pursuing such unmeasured pairs without accounting for these hidden failures could waste resources. Second, our definition of TF expression relies on the expression thresholds applied to RNA-seq distributions across 317 cell lines annotated in both the Human Protein Atlas and ChIP-Atlas; this approach may potentially overlook low-level or context-specific TF activity and exclude additional cell types present only in ChIP-Atlas, reducing resolution and potentially obscuring subtle lineage- or state-specific patterns. Future work will integrate more comprehensive ontology-based mapping and single-cell expression resources to enable higher-resolution analyses that capture additional unmeasured functional TF–cell-type relationships. Third, we used the number of DEGs as a proxy for functional importance, yet DEG counts are sensitive to KD methods (e.g., small Interfering RNA [siRNA] versus Auxin-Inducible Degron system [AID]), recovery time, and cell context and are not linearly proportional to regulatory impact. A more realistic prioritization scheme should combine DEG information with orthogonal evidence—including motif conservation, TF-expression levels, chromatin-accessibility footprints, and proximity to disease-associated variants—to generate a composite score that accounts for both biological relevance and experimental constraints. Finally, ChIP-seq peak density itself can be biased by GC content, open-chromatin artifacts, and antibody quality, so high apparent promoter coverage does not necessarily indicate functional binding. Addressing these limitations will be essential for translating our in silico Computational methods predicting TFBSs from gene expression, ATAC-seq data, and TF motifs have been proposed as alternatives to ChIP-seq experiments. While these computational methods achieve relatively high accuracy (auPR; Area Under the Precision-Recall Curve ~0.8) for TFs with stable motifs (e.g. CTCF), their performance significantly declines (auPR ~0.2) for TFs with less stable motifs [ 39 40 39 26 27 28–30 Nevertheless, despite these technological advancements, conducting experiments for all potential TF–sample pairs remains impractical. Strategic prioritization of future experiments is therefore crucial. To facilitate informed prioritization, we provide an online resource containing a comprehensive list of unmeasured TF–sample pairs ( https://moccs-db.shinyapps.io/Unmeasured_shiny_v1/ In conclusion, our study presents a systematic framework to identify and address biases and missing data in human TF ChIP-seq datasets, providing actionable strategies to improve dataset comprehensiveness. Enhancing the diversity and coverage of TF ChIP-seq data will significantly advance our understanding of gene regulatory mechanisms and strengthen the robustness of biomedical research dependent on these essential resources. Materials and Methods Data preparation ChIP-seq peak data The peak calling data of human TF ChIP-seq experiments (hg38) were obtained from the ChIP-Atlas database ( https://chip-atlas.org/ ChIP-seq metadata The metadata of human TF ChIP-seq data in ChIP-Atlas [ 4 53 https://chip-atlas.dbcls.jp/data/metadata/experimentList.tab 2 http://gtrd20–06.biouml.org/downloads/20.06/metadata/ 3 https://remap.univ-amu.fr/download_page 54 Publication data We downloaded the gene2pubmed data from the File Transfer Protocol server ( ftp://ftp.ncbi.nlm.nih.gov/gene/DATA/gene2pubmed.gz Gene feature data The data of 427 z et al. 32 z z Transcription start site data The TSS annotations of human genes were downloaded from the UCSC table browser [ 55 56 57 Genome-wide association study-single-nucleotide polymorphism data GWAS summary statistics were downloaded from the GWAS catalog [ 58 RNA-seq data RNA expression data for 1206 human cell lines were obtained from the Human Protein Atlas [ 59 https://www.proteinatlas.org/about/download#single_cell_type Knock transcription factor, transcription factor marker data DEGs in TF-knockout/knockdown experiments were obtained from KnockTFv2.0 [ 36 https://bio.liclab.net/KnockTFv2/index.php 37 https://bio.liclab.net/TF-Marker/ Data analysis Integration of cell type class and cell type category among different databases Annotations of cell type class and cell type in ChIP-Atlas were manually integrated with annotations of tissue name in other databases (RefEx, KnockTF, TF marker, and Human Protein Atlas) ( Supplementary Table 2 Definition of expressed transcription factors We standardized and matched cell line names between the Human Protein Atlas (1206 cell lines) and ChIP-Atlas (1098 cell types) datasets using Jaro–Winkler similarity with additional digit consistency checks with an in-house R script, resulting in the 317 common cell lines. Expressed TF–cell-type pairs were identified by fitting a step function to each TF’s RNA-seq expression distribution across 317 cell lines and classifying the expression as “expressed” or “not expressed” with the StepMiner algorithm [ 34 35 Fig. S2a Calculation of the Gini index as a measure of imbalance in transcription factor ChIP-seq data The Gini index for the number of ChIP-seq across TFs and cell types was calculated by using `ineq` R package (version 0.2.13). Expressed TFs in each cell type were defined as in Definition of Expressed Transcription Factors Machine learning We removed duplicates and unavailable features from 433 gene features and used the remaining z Calculation of regulatory transcription factor cover ratio Expressed genes were defined as the top 25% highly expressed genes per cell line. TSS regions were defined as TSS +/− 500 bps. For the TSS region of each expressed gene, “bedtools intersect” was used to determine whether the TSS region overlapped with any TF ChIP-seq peaks from ChIP-Atlas. The “regulatory-TF (Reg-TF) cover ratio” was calculated per cell line and year and defined as follows:  Reg-TF cover ratio = Number of expressed genes with any ChIP–seq peaks measured until target year/Number of expressed genes Calculation of genome-wide association study-single-nucleotide polymorphism cover ratio For each GWAS SNP, “bedtools intersect” was used to determine whether the GWAS-SNP overlapped with any TF ChIP-seq peaks from ChIP-Atlas. The “GWAS-SNP cover ratio” was calculated per cell type class and one year and defined as follows: GWAS-SNP cover ratio = Number of GWAS-SNPs with any ChIP-seq peaks measured until target year/Number of GWAS-SNPs. Simulation of genome-wide association study-single-nucleotide polymorphism cover ratio ChIP-seq data conducted in Blood were used for the simulation of the GWAS-SNP cover ratio. ChIP-seq IDs with deposited dates were prepared, and the dates were randomly shuffled, calculating the GWAS-SNP cover ratio until the target year. The simulation was repeated 100 times. For statistical analysis, sub-sampling experiments (90% and 50%) for each of the randomized acquisition order simulations (best performance top3; simulation no. 42, 11, 18, and worst performance top3; simulation no. 1, 3, 37) were conducted, and AUCs were computed for each sub-sample. Welch’s t Statistical analysis of the number of differentially expressed genes in transcription factor-knock-out experiments The number of DEGs in TF-KO or KD experiments between TF marker and non-TF marker or between measured TF and unmeasured TF was compared by the Wilcoxon rank sum test. Filtering unmeasured but potentially functional ChIP-seq Measured combinations of TFs and cell type class in KnockTF were filtered, and then, combinations with >1000 DEGs in TF-knockout and TF marker in TF marker database were selected as candidates for unmeasured but potentially functional ChIP-seq. Ethics approval and consent to participate. Not applicable. Consent for publication All authors have approved the manuscript for submission. Declaration of generative AI and AI-assisted technologies in the writing process During manuscript preparation, the authors used ChatGPT (GPT-4o, o3, and GTP-4.5) (OpenAI, CA, USA), a large language model, for English translation, grammar correction, and stylistic refinement. The AI tool was applied to individual sentences and paragraphs but was not used to generate new content or modify scientific conclusions. All content was thoroughly reviewed and edited by the authors, who take full responsibility for the manuscript’s accuracy, originality, and integrity. Key Points We systematically investigated comprehensiveness and biases in current human TF ChIP-seq datasets, emphasizing the importance of identifying missing but measurable TF ChIP-seq experiments. We introduced the concept of unmeasured We demonstrated that increasing the diversity of TF ChIP-seq data significantly enhances our understanding of gene regulatory mechanisms and strengthens biomedical research relying on these datasets. Supplementary Material Supplementary_rev1_elaf016 Supplementary_table1_elaf016 Supplementary_table2_elaf016 Supplementary_table3_Fig2B_unmeasured_elaf016 Acknowledgements Computations were partially performed on the National Institute of Genetics (NIG) supercomputer at the Research Organization of Information and Systems (ROIS) National Institute of Genetics, Japan. We thank Tazro Ohta (Database Center for Life Science, ROIS) and Dr Shinya Oki (Kyoto University) for technical assistance on the use of the ChIP-Atlas data. Author contributions S.T. and H.O. conceived the project. S.T. collected data and performed analysis. S.T. and H.O. wrote the manuscript. S.T. and H.O. conducted project administration. H.O. supervised the project. All authors discussed the results and approved the manuscript. Conflict of interest: None declared. Funding H.O. was supported by JSPS KAKENHI (grant number JP22K17992) and JST-Mirai Program (grant number JPMJMI20G7). Data availability The codes and data are available on the GitHub repository. ( https://github.com/bioinfo-tsukuba/Unmeasured  Saeko Tahara  Haruka Ozaki References 1. ENCODE Project Consortium Snyder MP Gingeras TR et al. Perspectives on ENCODE Nature 2020 583 693 8 32728248 10.1038/s41586-020-2449-8 PMC7410827 2. Kolmykov S Yevshin I Kulyashov M et al. GTRD: an integrated view of transcription regulation Nucleic Acids Res 2021 49 D104 11 33231677 10.1093/nar/gkaa1057 PMC7778956 3. Hammal F de Langen P Bergon A et al. ReMap 2022: a database of human, mouse, drosophila and Arabidopsis regulatory regions from an integrative analysis of DNA-binding sequencing experiments Nucleic Acids Res 2022 50 D316 25 34751401 10.1093/nar/gkab996 PMC8728178 4. Oki S Ohta T Shioi G et al. ChIP-atlas: a data-mining suite powered by full integration of public ChIP-seq data EMBO Rep 2018 19 10.15252/embr.201846255 PMC6280645 30413482 5. Mei S Qin Q Wu Q et al. Cistrome data browser: a data portal for ChIP-Seq and chromatin accessibility data in human and mouse Nucleic Acids Res 2017 45 D658 62 27789702 10.1093/nar/gkw983 PMC5210658 6. Zou Z Yoshimura Y Yamanishi Y et al. Elucidating disease-associated mechanisms triggered by pollutants via the epigenetic landscape using large-scale ChIP-Seq data Epigenetics Chromatin 2023 16 34 37743474 10.1186/s13072-023-00510-w PMC10518938 7. McLean CY Bristor D Hiller M et al. GREAT improves functional interpretation of cis-regulatory regions Nat Biotechnol 2010 28 495 501 20436461 10.1038/nbt.1630 PMC4840234 8. Zheng R Wan C Mei S et al. Cistrome data browser: expanded datasets and new tools for gene regulatory analysis Nucleic Acids Res 2019 47 D729 35 30462313 10.1093/nar/gky1094 PMC6324081 9. Neph S Stergachis AB Reynolds A et al. Circuitry and dynamics of human transcription factor regulatory networks Cell 2012 150 1274 86 22959076 10.1016/j.cell.2012.04.040 PMC3679407 10. Tu X Mejía-Guerra MK Valdes Franco JA et al. Reconstructing the maize leaf regulatory network using ChIP-seq data of 104 transcription factors Nat Commun 2020 11 5089 33037196 10.1038/s41467-020-18832-8 PMC7547689 11. Roadmap Epigenomics Consortium Kundaje A Meuleman W et al. Integrative analysis of 111 reference human epigenomes Nature 2015 518 317 30 25693563 10.1038/nature14248 PMC4530010 12. Chen C-H Zheng R Tokheim C et al. Determinants of transcription factor regulatory range Nat Commun 2020 11 2472 32424124 10.1038/s41467-020-16106-x PMC7235260 13. Griffon A Barbier Q Dalino J et al. Integrative analysis of public ChIP-seq experiments reveals a complex multi-cell regulatory landscape Nucleic Acids Res 2015 43 e27 25477382 10.1093/nar/gku1280 PMC4344487 14. Zhang J Lee D Dhiman V et al. An integrative ENCODE resource for cancer genomics Nat Commun 2020 11 3696 32728046 10.1038/s41467-020-14743-w PMC7391744 15. Karczewski KJ Dudley JT Kukurba KR et al. Systematic functional regulatory assessment of disease-associated variants Proc Natl Acad Sci USA 2013 110 9607 12 23690573 10.1073/pnas.1219099110 PMC3677437 16. Chen X Zhou J Zhang R et al. Tissue-specific enhancer functional networks for associating distal regulatory regions to disease Cell Syst 2021 12 353 362.e6 33689683 10.1016/j.cels.2021.02.002 17. Chen KM Wong AK Troyanskaya OG et al. A sequence-based global map of regulatory activity for deciphering human genetics Nat Genet 2022 54 940 9 35817977 10.1038/s41588-022-01102-2 PMC9279145 18. Tahara S Tsuchiya T Matsumoto H et al. Transcription factor-binding k-mer analysis clarifies the cell type dependency of binding specificities and cis-regulatory SNPs in humans BMC Genomics 2023 24 597 37805453 10.1186/s12864-023-09692-9 PMC10560430 19. Eguchi R Hamano M Iwata M et al. TRANSDIRE: data-driven direct reprogramming by a pioneer factor-guided trans-omics approach Bioinformatics 2022 38 2839 46 35561200 10.1093/bioinformatics/btac209 20. Zou Z Iwata M Yamanishi Y et al. Epigenetic landscape of drug responses revealed through large-scale ChIP-seq data analyses BMC Bioinformatics 2022 23 51 35073843 10.1186/s12859-022-04571-8 PMC8785570 21. Lambert SA Jolma A Campitelli LF et al. The human transcription factors Cell 2018 172 650 65 29425488 10.1016/j.cell.2018.01.029 22. Tabula Sapiens Consortium* Jones RC Karkanias J et al. The tabula sapiens: a multiple-organ, single-cell transcriptomic atlas of humans Science 2022 376 eabl4896 35549404 10.1126/science.abl4896 PMC9812260 23. Gibbs RA The human genome project changed everything Nat Rev Genet 2020 21 575 6 32770171 10.1038/s41576-020-0275-3 PMC7413016 24. Ganini C Amelio I Bertolo R et al. Global mapping of cancers: the cancer genome atlas and beyond Mol Oncol 2021 15 2823 40 34245122 10.1002/1878-0261.13056 PMC8564642 25. Lee S Lin C Chen C-Y et al. ChromBERT: uncovering chromatin state motifs in the human genome using a BERT-based approach bioRxiv 2024 2024.07.25.605219 26. Savic D Partridge EC Newberry KM et al. CETCh-seq: CRISPR epitope tagging ChIP-seq of DNA-binding proteins Genome Res 2015 25 1581 9 26355004 10.1101/gr.193540.115 PMC4579343 27. Perez AA Goronzy IN Blanco MR et al. ChIP-DIP maps binding of hundreds of proteins to DNA simultaneously and identifies diverse gene regulatory elements Nat Genet 2024 56 2827 41 39587360 10.1038/s41588-024-02000-5 PMC12136341 28. Borisova E Nishimura K An Y et al. Structurally-discovered KLF4 variants accelerate and stabilize reprogramming to pluripotency iScience 2022 25 103525 35106457 10.1016/j.isci.2021.103525 PMC8786646 29. Liu C Cassidy J Appel M Automation of ChIP-seq library preparation for next generation sequencing on the ep motion ® Biotechniques 2013 55 89 92 30. Kaneko S Mitsuyama T Shiraishi K et al. Genome-wide chromatin analysis of FFPE tissues using a dual-arm robot with clinical potential Cancers 2021 13 (9) 33924956 10.3390/cancers13092126 PMC8125448 31. Chen T Guestrin C XGBoost: A Scalable Tree Boosting System Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining 2016 32. Stoeger T Gerlach M Morimoto RI et al. Large-scale investigation of the reasons why potentially important genes are ignored PLoS Biol 2018 16 e2006643 30226837 10.1371/journal.pbio.2006643 PMC6143198 33. Perc M The Matthew effect in empirical data J R Soc Interface 2014 11 20140378 24990288 10.1098/rsif.2014.0378 PMC4233686 34. Seita J Sahoo D Rossi DJ et al. Gene expression commons: an open platform for absolute gene expression profiling PLoS One 2012 7 e40321 22815738 10.1371/journal.pone.0040321 PMC3399844 35. Sahoo D Dill DL Tibshirani R et al. Extracting binary signals from microarray time-course data Nucleic Acids Res 2007 35 3705 12 17517782 10.1093/nar/gkm284 PMC1920252 36. Feng C Song C Liu Y et al. KnockTF: a comprehensive human gene expression profile database with knockdown/knockout of transcription factors Nucleic Acids Res 2020 48 D93 100 31598675 10.1093/nar/gkz881 PMC6943067 37. Xu M Bai X Ai B et al. TF-marker: a comprehensive manually curated database for transcription factors and related markers in specific cell and tissue types in human Nucleic Acids Res 2022 50 D402 12 34986601 10.1093/nar/gkab1114 PMC8728118 38. Najnin RA Al Mahmud MR Rahman MM et al. ATM suppresses c-Myc overexpression in the mammary epithelium in response to estrogen Cell Rep 2023 42 111909 36640339 10.1016/j.celrep.2022.111909 PMC10023214 39. Karimzadeh M Hoffman MM Virtual ChIP-seq: predicting transcription factor binding by learning from the transcriptome Genome Biol 2022 23 126 35681170 10.1186/s13059-022-02690-2 PMC9185870 40. Keilwagen J Posch S Grau J Accurate prediction of cell type-specific transcription factor binding Genome Biol 2019 20 9 30630522 10.1186/s13059-018-1614-y PMC6327544 41. Li H Quang D Guan Y Anchor: trans-cell type prediction of transcription factor binding sites Genome Res 2019 29 281 92 30567711 10.1101/gr.237156.118 PMC6360811 42. Chen C Hou J Shi X et al. DeepGRN: prediction of transcription factor binding site across cell-types using attention-based deep neural networks BMC Bioinformatics 2021 22 38 33522898 10.1186/s12859-020-03952-1 PMC7852092 43. Gates AJ Gysi DM Kellis M et al. A wealth of discovery built on the Human Genome Project — by the numbers London, UK: Nature Publishing Group UK 2021 10.1038/d41586-021-00314-6 33568828 44. Hoffmann R Valencia A Life cycles of successful genes Trends Genet 2003 19 79 81 12547515 10.1016/s0168-9525(02)00014-8 45. Mestres J Gregori-Puigjané E Valverde S et al. Nat Biotechnol 2008 26 983 4 18779805 10.1038/nbt0908-983 46. Hakes L Pinney JW Robertson DL et al. Nat Biotechnol 2008 26 69 72 18183023 10.1038/nbt0108-69 47. Kretschmer F Seipp J Ludwig M et al. Coverage bias in small molecule machine learning Nat Commun 2025 16 554 39788952 10.1038/s41467-024-55462-w PMC11718084 48. Hasanzadeh F Josephson CB Waters G et al. Bias recognition and mitigation strategies in artificial intelligence healthcare applications NPJ Digit Med 2025 8 154 40069303 10.1038/s41746-025-01503-7 PMC11897215 49. Messeni Petruzzelli A Rotolo D Albino V Determinants of patent citations in biotechnology: An analysis of patent influence across the industrial and organizational boundaries Technol Forecast Soc Change 2015 91 208 21 50. Ofer D Kaufman H Linial M What’s next? Forecasting scientific research trends Heliyon 2024 10 e23781 38223716 10.1016/j.heliyon.2023.e23781 PMC10784166 51. Richardson R Tejedor Navarro H Amaral LAN et al. Meta-research: understudied genes are lost in a leaky pipeline between genome-wide assays and reporting of results elife 2024 12:RP93429 10.7554/eLife.93429 PMC10977968 38546716 52. Rzhetsky A Foster JG Foster IT et al. Choosing experiments to accelerate collective discovery Proc Natl Acad Sci USA 2015 112 14569 74 26554009 10.1073/pnas.1509757112 PMC4664375 53. Zou Z Ohta T Miura F et al. ChIP-atlas 2021 update: a data-mining suite for exploring epigenomic landscapes by fully integrating ChIP-seq, ATAC-seq and Bisulfite-seq data Nucleic Acids Res 2022 50 W175 82 35325188 10.1093/nar/gkac199 PMC9252733 54. Weirauch MT Yang A Albu M et al. Determination and inference of eukaryotic transcription factor sequence specificity Cell 2014 158 1431 43 25215497 10.1016/j.cell.2014.08.009 PMC4163041 55. Raney BJ Barber GP Benet-Pagès A et al. The UCSC genome browser database: 2024 update Nucleic Acids Res 2024 52 D1082 8 37953330 10.1093/nar/gkad987 PMC10767968 56. Durinck S Spellman PT Birney E et al. Mapping identifiers for the integration of genomic datasets with the R/Bioconductor package biomaRt Nat Protoc 2009 4 1184 91 19617889 10.1038/nprot.2009.97 PMC3159387 57. Quinlan AR Hall IM BEDTools: a flexible suite of utilities for comparing genomic features Bioinformatics 2010 26 841 2 20110278 10.1093/bioinformatics/btq033 PMC2832824 58. Sollis E Mosaku A Abid A et al. The NHGRI-EBI GWAS Catalog: knowledgebase and deposition resource Nucleic Acids Res 2023 51 D977 85 36350656 10.1093/nar/gkac1010 PMC9825413 59. Uhlén M Fagerberg L Hallström BM et al. Proteomics. Tissue-based map of the human proteome Science 2015 347 1260419 25613900 10.1126/science.1260419 ",
  "metadata": {
    "Title of this paper": "Proteomics. Tissue-based map of the human proteome",
    "Journal it was published in:": "Briefings in Functional Genomics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479113/"
  }
}