{
  "title": "Paper_1126",
  "abstract": "pmc Toxics Toxics 3287 toxics toxics Toxics 2305-6304 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474032 PMC12474032.1 12474032 12474032 41012407 10.3390/toxics13090786 toxics-13-00786 1 Article Mercury Exposure, Gene Expression, and Intelligence Quotient in Afro-Descendant Children from Two Colombian Regions Galvis-Ballesteros Javier Methodology Validation Formal analysis Investigation Data curation Writing – original draft Duran-Izquierdo Margareth Methodology Validation Formal analysis Investigation Data curation Valdelamar-Villegas Juan Methodology Validation Formal analysis Investigation Visualization https://orcid.org/0000-0003-0821-6263 Sierra-Marquez Lucellys Methodology Formal analysis Investigation Data curation Supervision Project administration https://orcid.org/0000-0003-3089-5872 Olivero-Verbel Jesus Methodology Resources Writing – review & editing Supervision Project administration Funding acquisition * Henríquez-Hernández Luis Alberto Academic Editor Environmental and Computational Chemistry Group, School of Pharmaceutical Sciences, Zaragocilla Campus, University of Cartagena, Cartagena 130015, Colombia; jgalvisb@unicartagena.edu.co mdurani@unicartagena.edu.co jvaldelamarv1@unicartagena.edu.co lsierram@unicartagena.edu.co * joliverov@unicartagena.edu.co 17 9 2025 9 2025 13 9 497672 786 09 6 2025 23 7 2025 24 7 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The impact of mercury (Hg) on biological systems is well documented; however, the long-term effects of low-level exposure in children remain unclear, particularly with respect to oxidative stress and cognitive outcomes. This study evaluated Hg exposure and its associations with the gene expression and intelligence quotient (IQ) in two Afro-descendant child populations in Colombia. Hair total mercury (T-Hg) was quantified in 163 children under 7 years old, along with their sociodemographic data. Significant differences ( p p oxidative stress gene expression gold mining intelligence quotient Ministry of Health and Social Protection National Doctoral Training Program Minciencias, 647-2014 This research was funded by a grant from the Ministry of Health and Social Protection, granted under Contract 848 of the Ministry of Science, Technology, and Innovation (MINCIENCIAS). J.V.-V. and L.S.-M. were funded by the National Doctoral Training Program (Minciencias, 647-2014). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Mercury is a global pollutant that poses significant public health concerns. Atmospheric deposition can easily reach ecosystems, thereby having a significant environmental impact [ 1 2 3 4 5 Populations living in regions affected by mining activities are at significant risk of experiencing the adverse effects of metal exposure, which can manifest in multiple organ systems, especially in vulnerable populations [ 6 7 8 9 10 10 The health impacts of T-Hg exposure are known; however, its molecular-level effects are yet to be determined [ 11 12 13 13 In order to combat the toxic effects of heavy metals, organisms employ a defense mechanism involving metallothioneins (MTs) for detoxification. These metal-transporting proteins are characterized by their high cysteine content, which enables them to bind and sequester metals [ 14 15 The impacts of mercury on neurodevelopment in children are well documented. A systematic review in children from low- and middle-income countries (Bangladesh, n = 1; Brazil, n = 14; China, n = 3; Ecuador, n = 1) found that 8 of 17 studies reported an adverse association between mercury exposure and at least one neurodevelopmental domain [ 16 Although some information is available on the relationship between low-level total mercury (T-Hg) exposure and the intelligence quotient (IQ) in children [ 9 12 2. Materials and Methods 2.1. The Study Area and Population This study began with a meeting of community leaders, who were provided with various aspects of research information. Children up to 7 years old from two rural communities of Afro-descendant people were included in this study. The study was conducted from January to June of 2020. For all participants, informed consent was obtained from their parents. The first community, Remanso de Paz, has a population of 302 residents, 87 of whom are children under the age of 7. The community is located in the municipality of Mahates, which has a rural population of 26,075 residents, according to municipal sources ( https://www.dane.gov.co/ The Dique Channel is a hydrological basin that facilitates fluvial transportation between the Magdalena River and the Caribbean Sea. It empties into the Bay of Cartagena, which houses the Port of Cartagena, the busiest container port in the Americas. The channel receives domestic, agricultural, and gold mining waste discharged from the central and northern regions of the country. The Dique and its marshes are the primary sources of water for agriculture and fishing in the region, representing the main economic activities [ 17 The second community studied was Zanjón (Southwest Colombia), located in the municipality of Santander of Quilichao, the Department of Cauca (3°06′00″ N, 76°31′00″ W). It is home to 2536 inhabitants and encompasses an area of 5136 ha, which includes the communities of Ardovelas, Santa Lucia, El Palmar, Mazamorrero, Alto Palmar, Bajo San Francisco, and La Toma (see Figure 1 18 2.2. The Questionnaire The representatives of the selected participants completed a health questionnaire following the World Health Organization’s guidelines for identifying populations at risk of T-Hg exposure [ 19 2.3. Assessment of Hair T-Hg Concentrations A total of 20 to 200 milligrams of hair samples was collected from the occipital region of the head using sterile stainless-steel scissors and then placed into paper envelopes at room temperature [ 5 20 The concentrations of T-Hg in the hair samples were quantified using an RA-915+ Zeeman Mercury Analyzer (Lumex, St. Peterburgo, Russia). The analysis was performed with the RP-915P software and the RP-91c pyrolysis unit (Lumex, St. Peterburgo, Russia). The protocol of the United States Environmental Protection Agency was followed [ 21 2 2.4. The Gene Expression Analysis For the gene expression assays, blood samples were collected through venipuncture using a BD Vacutainer and vacuum tube needles. Standard aseptic techniques were employed. Gene expression studies were conducted to determine the effects of T-Hg exposure on the cells. To isolate total RNA from the whole blood samples, the Tempus™ Blood RNA Tube (Applied Biosystems, Foster City, CA, USA) was employed. Each tube in the Tempus Blood RNA Kit contained 6 mL of Stabilizing Reagent and allowed up to 3 mL of blood to be collected. In accordance with the manufacturer’s instructions, the samples for mRNA analysis were stored at −80 °C as soon as they arrived in the laboratory [ 22 Spectrophotometry using a NanoDrop 2000 (Thermo Scientific, Wilmington, NC, USA) was employed to measure RNA concentrations, and the A260/A280 ratio was used to assess purity. DNA synthesis was conducted employing the high-capacity cDNA reverse transcription kit from Applied Biosystems in Foster City, CA, USA. RT-PCR was conducted utilizing the SYBR Green qPCR Master Mix from Thermo Scientific in Wilmington, NC, USA, on a Step One Plus thermal cycler from Applied Biosystems. The conditions for RT-PCR followed the manufacturer’s recommendations. Three genes related to metal exposure and oxidative stress were examined: metallothionein 1A (MT1A), 1K (MT1K or MT1M), and superoxide dismutase 1 (SOD1). The comparative CT method (ΔCT) was employed to evaluate these genes, using the geometric mean of glyceraldehyde-3-phosphate dehydrogenase (GAPDH) and beta-2-microglobulin (β2M) as reference genes [ 23 2.5. The Cognitive Assessment The previously validated Kaufman IQ test was employed in Colombia [ 22 2.6. The Statistical Analysis The data are presented as the mean ± standard error. For each variable, a frequency distribution, measures of central tendency, and variability were assessed. Prior to the analysis, normality tests were conducted using the Shapiro–Wilk and Bartlett tests. Mean comparisons were conducted using either the T U p 3. Results 3.1. Sociodemographic Data The general characteristics of the study population are presented in Table 1 p p All participants were classified within the lowest socioeconomic stratum of the six available categories. An analysis of the economic situation of the households in Mahates revealed an average income of COP 526.191 ± 276.988. In the community of Zanjón specifically, the average income was COP 519.323 ± 334.026, with no significant difference between this figure and the overall average ( p p Zanjón shows a significantly higher rate of high school attainment among parents/guardians at 74%, nearly double that in Mahates at 37% ( p p 3.2. T-Hg Hair Concentrations The mean hair T-Hg concentrations in the children from Mahates and Zanjón are shown in Figure 2 Table S1 p Figure 2 3.3. The Gene Expression Results In relation to the findings, it was observed that the SOD1 gene expression was higher in the children from Mahates ( p Figure 2 3.4. The Cognitive Test Results As the Kaufman test has been validated exclusively for use in individuals aged four and above, we administered it to 20 children from Mahates and 41 from Zanjón. The IQ scores of the children from Mahates and Zanjón are presented in Figure 3 Figure 3 Notably, only 10% of the children in Mahates and 7.32% in Zanjón scored within the medium–high IQ range, and no individuals with high or very high levels were identified in either community. Furthermore, although both communities demonstrated average scores on the second scale (low), the children from Mahates exhibited a significantly lower mean IQ score (71.7) compared to that for those from the Zanjón community (74.7) ( p 3.5. Relationships Between the Concentration of T-Hg in the Hair, Gene Expression, and IQ The correlation analysis in Table 2 p ρ A principal component analysis was used to assess the multivariate relationships among the study variables ( Figure 4 4. Discussion This study is pioneering in its assessment of T-Hg exposure, cognitive development, and gene expression in Afro-descendant children from Mahates and Zanjón, thus distinguishing it from previous research, which was primarily focused on mining areas in Colombia. However, the T-Hg concentrations observed in the hair were notably lower than those reported for other Colombian child populations [ 24 25 26 27 28 29 30 31 Table S2 While the T-Hg levels in the children in this study were lower than those in the Faroe Islands (a seafood-dependent country) [ 32 33 Overall, the mean fish consumption across both Colombian communities was low (1.5 ± 0.06 meals/week), as were the T-Hg concentrations (0.28 ± 0.01 µg/g). However, children from Mahates ate fish more frequently (2.66 ± 0.30 meals/week) and had higher T-Hg levels than those in children from Zanjón. The children from Zanjón also showed higher fruit and vegetable consumption (94.4%) compared to that in Mahates (89.5%). This suggests that children in Mahates might be more reliant on fish, potentially leading to less dietary diversity and a greater risk of T-Hg exposure. Future research should measure T-Hg in fruits and vegetables from both communities to confirm this. The lower T-Hg levels in this study likely stem from dietary differences and less frequent consumption of fish compared to that in other Colombian and global populations. The primary source of exposure to T-Hg is contaminated fish [ 20 24 34 35 36 37 38 While our study found low T-Hg levels in these children, further analysis is needed to confirm its conclusions. Other factors, such as income and education levels, are known to influence IQ in communities near mining areas [ 29 Although Mahates and Zanjón differed in their fish consumption, hair T-Hg levels, SOD1 expression, and mean IQ scores, no significant associations were detected between T-Hg and the variables evaluated. These findings contrast with those of previous studies [ 31 37 14 18 While environmental pollutants’ impact on oxidative stress is well researched [ 39 40 41 42 43 44 45 46 47 Metallothioneins are vital for metal transport and detoxification and are key indicators of the body’s antioxidant response to contaminants. While MT1A expression has been linked to T-Hg exposure and cognitive decline in adults [ 43 44 9 12 29 However, previous studies have described that MT1A, compared to SOD1, has low specificity; its expression is influenced by various pollutants, including cadmium [ 39 45 46 47 29 48 While some studies [ 49 28 50 51 29 29 52 This study, despite its innovative assessment of the T-Hg exposure, cognitive development, and gene expression in Afro-descendant children from Mahates and Zanjón, faces several limitations, requiring cautious interpretation. A key constraint is that the T-Hg concentrations observed in the hair were lower than those reported in other Colombian and global populations of children, indicating that these findings may not be generalizable to communities with higher mercury exposure. Future research is strongly recommended to thoroughly investigate additional sociodemographic factors, such as parental education levels, and other pollutant exposures like pesticides (which significantly differed between the studied communities), as these could significantly impact neurodevelopment and introduce biases not fully explored in this study. Consequently, it is imperative that future research endeavors focus on the collection of comprehensive data on these variables. This study aligns with international guidelines, including those from the European Commission, which emphasize testing for T-Hg health effects, particularly in vulnerable populations. It also follows the World Health Organization’s recommendations for evaluating groups exposed to varying T-Hg levels [ 53 5. Conclusions This study demonstrates that Afro-descendant children from Mahates and Zanjón exhibit distinct multivariate profiles, with Mahates clustering toward relatively greater mercury exposure and SOD1 upregulation and Zanjón showing comparatively better cognitive outcomes. Although the overall mercury concentrations were low and no significant correlations were found between Hg levels, gene expression, and cognitive variables, the PCA highlighted clear differences between the two populations. These findings suggest that even in the absence of direct associations in bivariate analyses, multivariate approaches can reveal differentiated community profiles. Future longitudinal studies are required to clarify these patterns and assess the potential long-term effects of low-level mercury exposure on gene expression and neurodevelopment. Acknowledgments We would like to express our gratitude to the leaders of the Mahates and Zanjón communities for their invaluable support in the execution of this project. We would also like to acknowledge the financial assistance provided by the Ministry of Health and Social Protection. We would like to express our gratitude to the University of Cartagena, Support Research Groups (2024–2025). Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/toxics13090786/s1 Author Contributions J.G.-B.: Investigation; formal analysis; writing—original draft preparation; writing—revised manuscript writing. M.D.-I.: Investigation; formal analysis; supervision; writing—revised manuscript writing. J.V.-V.: Investigation; formal analysis; writing—revised manuscript writing. L.S.-M.: Investigation; formal analysis; writing—revised manuscript writing. J.O.-V.: Conceptualization; supervision; resources; funding acquisition; writing—revised manuscript writing. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the ethical standards set forth in the Declaration of Helsinki and approved by the Ethics Committee of the University of Cartagena (Act No. 115 of 7 December 2018). Informed Consent Statement Informed consent was obtained from all subjects prior to their participation, ensuring complete transparency regarding the study’s purpose and procedures and any associated risks. Participants were explicitly informed of their right to withdraw at any point and how their data and/or images would be handled and utilized. Data Availability Statement The data cannot be disclosed due to confidentiality reasons. Conflicts of Interest The authors declare that they have no conflicts of interest. References 1. Tomiyasu T. Kono Y. Kodamatani H. Hidayati N. Rahajoe J.S. The distribution of mercury around the small-scale gold mining area along the Cikaniki river, Bogor, Indonesia Environ. Res. 2013 125 12 19 10.1016/j.envres.2013.03.015 23890827 2. Kimáková T. Kuzmová L. Nevolná Z. Bencko V. Fish and fish products as risk factors of mercury exposure Ann. Agric. Environ. Med. 2018 25 488 493 10.26444/aaem/84934 30260185 3. Diringer S.E. Berky A.J. Marani M. Ortiz E.J. Karatum O. Plata D.L. Pan W.K. Hsu-Kim H. Deforestation due to artisanal and small-scale gold mining exacerbates soil and mercury mobilization in Madre de Dios, Peru Environ. Sci. Technol. 2020 54 286 296 10.1021/acs.est.9b06620 31825606 PMC7244384 4. Esdaile L.J. Chalker J.M. The Mercury Problem in Artisanal and Small-Scale Gold Mining Chemistry 2018 24 6905 6916 10.1002/chem.201704840 29314284 PMC5969110 5. Carranza-Lopez L. Caballero-Gallardo K. Cervantes-Ceballos L. Turizo-Tapia A. Olivero-Verbel J. Multicompartment Mercury Contamination in Major Gold Mining Districts at the Department of Bolivar, Colombia Arch. Environ. Contam. Toxicol. 2019 76 640 649 10.1007/s00244-019-00609-w 30806724 6. Gibb H. O’Leary K.G. Mercury exposure and health impacts among individuals in the artisanal and small-scale gold mining community: A comprehensive review Environ. Health Perspect. 2014 122 667 672 10.1289/ehp.1307864 24682486 PMC4080518 7. Bose-O’Reilly S. Bernaudat L. Siebert U. Roider G. Nowak D. Drasch G. Signs and symptoms of mercury-exposed gold miners Int. J. Occup. Med. Environ. Health 2017 30 249 269 10.13075/ijomeh.1896.00715 28366955 8. Bermea O.M. Castro-Larragoitia J. Álvarez A.A. Mercury in blood of children exposed to historical residues from metallurgical activity Expo. Health 2021 13 281 292 10.1007/s12403-021-00382-z 9. Rangel-Méndez J.A. Arcega-Cabrera F.E. Fargher L.F. Moo-Puc R.E. Mercury levels assessment and its relationship with oxidative stress biomarkers in children from three localities in Yucatan, Mexico Sci. Total Environ. 2016 543 187 196 10.1016/j.scitotenv.2015.10.152 26580741 10. Zhou C.C. Fu H. Zhang G.Y. Ma J.W. Ni M. Li D.J. Shen F.M. Huang F. Effects of low-level mercury exposure on brain-derived neurotrophic factor in preschool children Ecotoxicol. Environ. Saf. 2021 15 111642 10.1016/j.ecoenv.2020.111642 33396162 11. Rupa S.A. Patwary M.A.M. Matin M.M. Ghann W.E. Uddin J. Kazi M. Interaction of mercury species with proteins: Towards possible mechanism of mercurial toxicology Toxicol. Res. 2023 12 355 368 10.1093/toxres/tfad039 37397928 PMC10311172 12. Carvalho L.V.B. Hacon S.S. Vega C.M. Vieira J.A. Larentis A.L. Mattos R.C.O.C. Valente D. Costa-Amaral I.C. Mourão D.S. Silva G.P. Oxidative Stress Levels Induced by Mercury Exposure in Amazon Juvenile Populations in Brazil Int. J. Environ. Res. Public Health 2019 16 2682 10.3390/ijerph16152682 31357573 PMC6696106 13. Zhang H. Sun X. Hwarari D. Du X. Wang Y. Xu H. Hou D. Oxidative stress response and metal transport in roots of Macleaya cordata exposed to lead and zinc Plants 2023 12 516 10.3390/plants12030516 36771604 PMC9920459 14. Tejeda-Benitez L. Flegal R. Odigie K. Olivero-Verbel J. Pollution by metals and toxicity assessment using Caenorhabditis elegans in sediments from the Magdalena River, Colombia Environ. Pollut. 2016 212 238 250 10.1016/j.envpol.2016.01.057 26851980 15. Galvis-Ballesteros J. Valdelamar-Villegas J. Duran-Izquierdo M. Sierra-Marquez L. Olivero-Verbel J. Environmental pollution by mercury and trace metals in highly vulnerable afro-descendant territories in the Department of Cauca, Colombia Soil Sediment Contam. 2024 34 510 527 16. Heng Y.Y. Asad I. Coleman B. Menard L. Benki-Nugent S. Hussein Were F. McHenry M.S. Heavy metals and neurodevelopment of children in low and middle-income countries: A systematic review PLoS ONE 2022 17 e0265536 10.1371/journal.pone.0265536 35358213 PMC8970501 17. Municipality of Mahates Municipal Development Plan 2020–2023 Municipality of Mahates Mahates, Colombia 2020 Available online: https://s6a4399c8c25e6d07.jimcontent.com/download/version/1617373866/module/10877614983/name/PDM%20MAHATES.pdf (accessed on 2 May 2025) 18. Carrasco-Gallegos C.L. Respuestas Comunitarias Ante Conflictos Territoriales. Casos de Estudio en México y Latinoamérica 1st ed. Universidad Autónoma del Estado de México Toluca, Mexico 2017 1 27 19. UNEP DTIE Chemical Branch and World Health Organization (WHO) Department of Food Safety Guidance for Identifying Populations at Risk from Mercury Exposure WHO Geneva, Switzerland 2008 Available online: https://www.who.int/publications/m/item/guidance-for-identifying-populations-at-risk-from-mercury-exposure (accessed on 1 May 2025) 20. Canela T.A. Monteiro L.C. Cabral C.D.S. Ximenes F.D.S. Oliveira I.D.S. Bernardi J.V.E. Almeida R. Bastos W.R. Mercury in Fish and Human Hair and Estimated Dietary Intake in a Riverside Community of the Madeira River Basin in the Brazilian Amazon Toxics 2024 12 208 10.3390/toxics12030208 38535941 PMC10975148 21. United States Environmental Protection Agency (US-EPA) Mercury in Solids and Solutions by Thermal Decomposition, Amalgamation, and Atomic Absorption Spectrophotometry US-EPA Washington, DC, USA 1998 EPA-Method 7473 22. Alvarez-Ortega N. Caballero-Gallardo K. Olivero-Verbel J. Toxicological effects in children exposed to lead: A cross-sectional study at the Colombian Caribbean coast Environ. Int. 2019 130 104809 10.1016/j.envint.2019.05.003 31302530 23. Manjarres-Suarez A. De la Rosa J. Gonzalez-Montes A. Galvis-Ballesteros J. Olivero-Verbel J. Trace elements, peripheral blood film, and gene expression status in adolescents living near an industrial area in the Colombian Caribbean Coastline J. Expo. Sci. Environ. Epidemiol. 2022 32 146 155 10.1038/s41370-021-00340-6 34083740 24. De la Ossa C.A. Ramírez-Giraldo A.F. Arroyo-Alvis K. Marrugo-Negrete J. Díez S. Neuropsychological effects and cognitive deficits associated with exposure to mercury and arsenic in children and adolescents of the Mojana region, Colombia Environ. Res. 2022 216 114467 10.1016/j.envres.2022.114467 36265603 25. Marrugo-Negrete J.L. Ruiz-Guzmán J.A. Díez S. Relationship Between Mercury Levels in Hair and Fish Consumption in a Population Living Near a Hydroelectric Tropical Dam Biol. Trace Elem. Res. 2013 151 187 194 10.1007/s12011-012-9561-z 23242864 26. Santos-Lima C.D. Mourão D.S. Carvalho C.F. Souza-Marques B. Vega C.M. Gonçalves R.A. Argollo N. Menezes-Filho J.A. Abreu N. Hacon S.S. Neuropsychological Effects of Mercury Exposure in Children and Adolescents of the Amazon Region, Brazil Neurotoxicology 2020 79 48 57 10.1016/j.neuro.2020.04.004 32335201 27. Basu N. Tutino R. Zhang Z. Cantonwine D.E. Goodrich J.M. Somers E.C. Rodriguez L. Schnaas L. Solano M. Mercado A. Mercury levels in pregnant women, children, and seafood from Mexico City Environ. Res. 2014 135 63 69 10.1016/j.envres.2014.08.029 25262076 PMC4262596 28. Gustin K. Tofail F. Mehrin F. Levi M. Vahter M. Kippler M. Methylmercury exposure and cognitive abilities and behavior at 10 years of age Environ. Int. 2017 102 97 105 10.1016/j.envint.2017.02.004 28216013 29. Feng L. Zhang C. Liu H. Li P. Hu X. Wang H. Chan H.M. Feng X. Impact of low-level mercury exposure on intelligence quotient in children via rice consumption Ecotoxicol. Environ. Saf. 2020 202 110870 10.1016/j.ecoenv.2020.110870 32593806 30. Kim S.A. Jeon C.K. Paek D.M. Hair mercury concentrations of children and mothers in Korea: Implication for exposure and evaluation Sci. Total Environ. 2008 402 36 42 10.1016/j.scitotenv.2008.04.010 18502474 31. Kusanagi E. Takamura H. Chen S.J. Adachi M. Hoshi N. Children’s Hair Mercury Concentrations and Seafood Consumption in Five Regions of Japan Arch. Environ. Contam. Toxicol. 2018 74 259 272 10.1007/s00244-017-0502-x 29313075 32. Budtz-Jørgensen E. Grandjean P. Jørgensen P.J. Weihe P. Keiding N. Association between mercury concentrations in blood and hair in methylmercury-exposed subjects at different ages Environ. Res. 2004 95 385 393 10.1016/j.envres.2003.11.001 15220072 33. McDowell M.A. Dillon C.F. Osterloh J. Bolger P.M. Pellizzari E. Fernando R. Montes de Oca R. Schober S.E. Sinks T. Jones R.L. Hair mercury levels in U.S. children and women of childbearing age: Reference range data from NHANES 1999–2000 Environ. Health Perspect. 2004 112 1165 1171 10.1289/ehp.7046 15289161 PMC1247476 34. Ealo-Tapia D. Torres-Abad J. Madera M. Márquez-Lázaro J. Mercury and neurodevelopmental disorders in children: A systematic review Arch. Argent. Pediatr. 2023 121 e202202838 37145892 10.5546/aap.2022-02838.eng 35. Siegel S. Community without Solidarity: Mercury Pollution from Small-Scale Mining and Colombia’s Crisis of Authority Community Dev. J. 2013 48 451 465 10.1093/cdj/bst027 36. Balaji S.M. Mercury, dentistry, minamata convention and research opportunities Indian J. Dent. Res. 2019 30 819 10.4103/ijdr.IJDR_924_19 31939353 37. Feingold B.J. Berky A. Hsu-Kim H. Jurado E.R. Pan W.K. Population- based dietary exposure to mercury through fish consumption in the Southern Peruvian Amazon Environ. Res. 2020 183 108720 10.1016/j.envres.2019.108720 31627842 PMC8299663 38. Valdelamar-Villegas J. Olivero-Verbel J. High mercury levels in the indigenous population of the Yaigojé Apaporis National Natural Park, Colombian Amazon Biol. Trace Elem. Res. 2020 194 3 12 10.1007/s12011-019-01760-0 31222622 39. Kluxen F.M. Höfer N. Kretzschmar G. Degen G.H. Diel P. Cadmium modulates expression of aryl hydrocarbon receptor-associated genes in rat uterus by interaction with the 1 estrogen receptor Arch. Toxicol. 2012 86 591 601 10.1007/s00204-011-0787-x 22127542 40. Pizzino G. Bitto A. Interdonato M. Galfo F. Irrera N. Mecchio A. Altavilla D. Oxidative stress and DNA repair and detoxification gene expression in adolescents exposed to heavy metals living in the Milazzo-Valle del Mela area (Sicily, Italy) Redox Biol. 2014 2 686 693 10.1016/j.redox.2014.05.003 24936443 PMC4052524 41. Singh A. Kukreti R. Saso L. Kukreti S. Oxidative stress: A key modulator in neurodegenerative diseases Molecules 2019 24 1583 10.3390/molecules24081583 31013638 PMC6514564 42. Dalkiran T. Carman K.B. Unsal V. Belge Kurutas E. Kandur Y. Dilber C. Evaluation of oxidative stress biomarkers in acute mercury intoxication Folia Med. 2021 63 704 709 10.3897/folmed.63.e56110 35851205 43. Sirivarasai J. Chaisungnern K. Panpunuan P. Chanprasertyothin S. Chansirikanjana S. Sritara P. Role of MT1A Polymorphism and Environmental Mercury Exposure on the Montreal Cognitive Assessment (MoCA) Neuropsychiatr. Dis. Treat. 2021 17 2429 2439 10.2147/NDT.S320374 34326641 PMC8314684 44. Carneiro M.F.H. Grotto D. Barbosa F. Inorganic and Methylmercury Levels in Plasma Are Differentially Associated with Age, Gender, and Oxidative Stress Markers in a Population Exposed to Mercury through Fish Consumption J. Toxicol. Environ. Health A 2014 77 69 79 10.1080/15287394.2014.865584 24555648 45. Irvine G.W. Stillman M.J. Topographical analysis of As-induced folding of α-MT1a Biochem. Biophys. Res. Commun. 2013 441 208 213 10.1016/j.bbrc.2013.10.044 24140052 46. Rosa-Casillas M. Crespo-Hernández B.S. Ortiz-Martínez M. Jiménez-Vélez B. MT1a mRNA Expression in Human Lung Cells (BEAS 2B) After Airborne PM10 and Copper Exposure: A Possible Biomarker for Asthma J. Health Disparities Res. Pract. 2016 9 96 47. Michalczyk K. Kapczuk P. Witczak G. Tousty P. Bosiacki M. Kurzawski M. Chlubek D. Cymbaluk-Płoska A. An Assessment of MT1A (rs11076161), MT2A (rs28366003) and MT1L (rs10636) Gene Polymorphisms and MT2 Concentration in Women with Endometrial Pathologies Genes 2023 14 773 10.3390/genes14030773 36981043 PMC10048541 48. Jeong K.S. Park H. Ha E. Shin J. Hong Y.C. Ha M. Park H. Kim B.N. Lee B. Lee S.J. High Maternal Blood Mercury Level Is Associated with Low Verbal IQ in Children J. Korean Med. Sci. 2017 7 1097 1104 10.3346/jkms.2017.32.7.1097 PMC5461312 28581265 49. Hibbeln J. Gregory S. Iles-Caven Y. Taylor C.M. Emond A. Golding J. Total mercury exposure in early pregnancy has no adverse association with scholastic ability of the offspring particularly if the mother eats fish Environ. Int. 2018 116 108 115 10.1016/j.envint.2018.03.024 29665469 PMC5993870 50. Bellinger D.C. The protean toxicities of lead: New chapters in a familiar story Int. J. Environ. Res. Public Health. 2011 8 2593 2628 21845148 10.3390/ijerph8072593 PMC3155319 51. Nišević J.R. Prpić I. Kolić I. Baždarić K. Tratnik J.S. Prpić I.Š. Mazej D. Špirić Z. Barbone F. Horvat M. Combined prenatal exposure to mercury and LCPUFA on newborn’s brain measures and neurodevelopment at the age of 18 months Environ. Res. 2019 178 108682 10.1016/j.envres.2019.108682 31450150 52. Holmes P. James K.A. Levy L.S. Is low-level environmental mercury exposure of concern to human health? Sci. Total Environ. 2009 408 171 182 10.1016/j.scitotenv.2009.09.043 19850321 53. World Health Organization Children’s Exposure to Mercury Compounds WHO Geneva, Switzerland 2010 Figure 1 A location map of the study area. Figure 2 T-Hg concentrations in hair ( A B C D GAPDH 2M p Figure 3 IQ evaluated in children residing in the Mahates and Zanjón communities. Relative frequency distribution of IQ ( A B p Figure 4 Diagram of principal component analysis for selected variables. toxics-13-00786-t001_Table 1 Table 1 Sociodemographic characteristics and dietary and health habits of children in Mahates and Zanjón. Variable Categories Study Area Statistic p Mahates n Zanjón n Age (years) ≤4 years 18 (47.4) 84 (67.2) X 2 0.023 * >4 years 20 (52.6) 41 (32.8) Sex Girl 19 (50.0) 69 (55.2) X 2 0.352 Boy 19 (50.0) 56 (44.8) Educational level a None 2 (5.0) 0 (0.0) X 2 0.006 * Elementary school 8 (21.0) 17 (14.0) High school 14 (37.0) 93 (74.0) Technical 11 (29.0) 11 (9.0) Technologist 1 (3.0) 3 (2.0) College 0 (0.0) 1 (1.0) DK/NA b 2 (5.0) 0 (0.0)  0 1 (2.6) 32 (25.6) X 2 0.001 * Fish intake (meals/week) 1–2 21 (55.3) 85 (68.0) ≥3 16 (42.1) 8 (6.4) Mean ± SEM 2.66 ± 0.30 1.24 ± 0.09 U 0.001 * Exposure to tobacco i Yes 8 (21.1) 14 (11.2) X 2 0.102 No 30 (78.9) 111 (88.8) Pesticide use a Yes 27 (71.0) 56 (45.0) X 2 0.006 * No 10 (26.0) 68 (54.0) DK/NA b 1 (3.0) 1 (1.0) i X 2 U = U a b p toxics-13-00786-t002_Table 2 Table 2 Spearman’s correlations between T-Hg concentrations in hair and age, fish intake, IQ, and molecular variables in children from Mahates and Zanjón. Variables Study Area  Mahates Zanjón  Spearman Correlation p Spearman Correlation p Age 0.164 0.394 −0.015 0.890 Fish intake i 0.113 0.559 0.044 0.695  Molecular     SOD1/β2M −0.017 0.932 −0.135 0.225 SOD1/GAPDH −0.077 0.691 −0.090 0.421 MT1K/1M/β2M 0.061 0.760 −0.111 0.318 MT1K/1M/GAPDH 0.166 0.390 −0.053 0.634 MT1A/β2M 0.313 0.119 −0.131 0.257 MT1A/GAPDH 0.310 0.123 −0.130 0.260  IQ     Score −0.321 0.482 0.032 0.886 Vocabulary scale (VoS) −0.179 0.702 0.004 0.987 Matrices scale (MaS) −0.393 0.383 0.051 0.817 i ",
  "metadata": {
    "Title of this paper": "Is low-level environmental mercury exposure of concern to human health?",
    "Journal it was published in:": "Toxics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474032/"
  }
}