{
  "title": "Paper_1034",
  "abstract": "pmc J Liq Biopsy J Liq Biopsy 4709 jlibiop The Journal of Liquid Biopsy 2950-1954 Elsevier PMC12475853 PMC12475853.1 12475853 12475853 41018162 10.1016/j.jlb.2025.100321 S2950-1954(25)00037-2 100321 1 Original Article BLOODPAC's collaborations with European Union liquid biopsy initiatives Dickey Jennifer a # Katrivanos Elaine b # Leiman Lauren C. Lauren@bloodpac.org c ⁎ Abukhdeir Abde M. d Cardone Antonella e Saritas-Yildirim Banu f Galamba Carlos g Jankiewicz Cheyenne c Rolfo Christian h Bhandari Deepshikha i Finnegan Emily j 1 Fenizia Francesca k Celik Haydar l Mehlhorn Ingrid m Walker Jillian n Costa Jose Luis o Williams Kathy p Sewart Mark q Olsen Matias r Wierzba Michael j Sanzone Pia b Fijneman Remond J.A. s Dumanois Robert o Mbella Valerie t Gonzales Veronica u a b c d e f g h i j k l m n o p q r s t u ⁎ Lauren@bloodpac.org # Co-First Authors. 1 formerly with BMS at time of contribution. 12 2025 21 8 2025 10 497701 100321 22 7 2025 6 8 2025 21 08 2025 28 09 2025 29 09 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). The adoption of liquid biopsy into clinical practice has revolutionized the landscape of cancer diagnostics and treatment monitoring. In the U.S., the Blood Profiling Atlas in Cancer (BLOODPAC) has significantly supported the advancement of these technologies through consensus building [ 1 The European Union faces regulatory and access challenges that hinder widespread adoption of liquid biopsy technologies. Complexities under the In Vitro Diagnostic Regulation (IVDR) and Clinical Trials Regulation (CTR) have introduced variability and delays across member states. While recognizing Europe's strengths in developing robust frameworks and high standards for advancing precision oncology, this paper explores how BLOODPAC's efforts—particularly in standardization, validation, and data sharing—could inform and complement EU initiatives. BLOODPAC's experience in developing fit-for-purpose validation frameworks and fostering regulatory-industry dialogue offers particularly relevant insights for addressing EU-specific challenges. This paper proposes opportunities for collaboration and guidance development that could enhance European access to liquid biopsy-based tests for precision medicine, ultimately improving patient access and outcomes for cancer care and management. Keywords Liquid biopsy Regulatory harmonization ctDNA Analytical validation Data sharing pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction As precision medicine becomes increasingly central to oncology, liquid biopsy technologies—particularly those leveraging circulating tumor DNA (ctDNA)—are reshaping how cancer is diagnosed and monitored. These minimally invasive tools offer the potential for earlier detection, dynamic treatment monitoring, and broader access to genomic profiling. In the United States (US), the clinical utility of liquid biopsy was formally recognized with the US Food and Drug Administration's (FDA) first approval of a ctDNA-based assay in 2016 [ 2 In contrast, the European Union (EU) has acknowledged the clinical promise of liquid biopsy—as reflected in the 2022 recommendations from the European Society for Medical Oncology (ESMO) which advocated for the use of ctDNA assays [ 3 4 5 This paper explores how BLOODPAC's initiatives in the U.S.—including standardized technical protocols, validation frameworks, and data sharing tools—can inform and potentially support the EU's efforts to integrate liquid biopsy technologies into clinical care. By drawing on BLOODPAC's regulatory collaboration experience, this paper identifies opportunities for global synergy aimed at accelerating patient access to precision oncology solutions. 2 BLOODPAC's contributions to advancing liquid biopsy technologies in the United States (U.S.) 10.13039/100030996 BLOODPAC Through strategic partnerships—such as with the U.S. Food and Drug Administration (FDA)—BLOODPAC has pioneered key tools and frameworks that address regulatory, technical, and data-sharing barriers. These contributions offer a scalable model for international adoption and present particular relevance as the European Union (EU) navigates implementation of the IVDR and CTR frameworks. BLOODPAC's work is most evident in four core areas: (1) standardization of preanalytical variables, (2) analytical validation of ctDNA-based assays, (3) development of frameworks for emerging liquid biopsy applications, and (4) infrastructure for secure, collaborative data sharing. 2.1 Development of minimum technical data elements (MTDEs) for preanalytical variable standardization To address variability in pre-analytical processes, BLOODPAC's introduction of MTDEs represents a significant stride in harmonizing the preanalytical phase of liquid biopsy research. These MTDEs encompass a comprehensive set of guidelines that define blood sample collection, handling, and storage. These uniform protocols decrease variability and improve the integrity of data, creating a meticulous approach to standardization that can not only enhance the reproducibility of liquid biopsy tests but also foster their wider acceptance and integration into routine clinical practice [ 6 7 2.2 Development of analytical validation protocols for ctDNA comprehensive genomic profiling BLOODPAC's Analytical Variables Working Group developed consensus-based guidelines to standardize the analytical validation of ctDNA-based next-generation sequencing (NGS) assays [ 8 2.3 Development of frameworks and analytical validation protocols for other clinical applications of liquid biopsy BLOODPAC's collaborative efforts also focus on patient tumor characterization by extending into the field of Molecular Residual Disease (MRD) detection and Multi-cancer Detection (MCD). Recognizing the growing importance of sensitive and accurate MRD detection in patient management, BLOODPAC is developing guidelines to establish analytical and clinical performance measures for MRD detection. These guidelines address unique challenges in MRD testing, including the need for standardized terminology and definitions to promote consistency across studies and reports. The goal is to create assays capable of detecting the minimal levels of tumor-derived DNA that indicate residual disease, thereby providing clinicians with critical information for patient management. Similarly, the development and discussion of appropriate risk frameworks for MCD assays was published to help accelerate the design and development of clinical utility studies [ 9 2.4 Evolution of data infrastructure: from the Data Commons to the BLOODPAC portal BLOODPAC developed the Data Commons, a centralized repository that streamlines the aggregation and dissemination of liquid biopsy data [ 10 Building on this success, BLOODPAC is now transitioning from the Data Commons to the BLOODPAC Portal. The BLOODPAC Portal is a comprehensive public resource that enables the scientific community to store, share and analyze liquid biopsy datasets with associated publications seamlessly. BLOODPAC's goal is to develop the Portal into a centralized knowledge resource, aggregating liquid biopsy publications and datasets to benefit both BLOODPAC members and the broader community. 3 European initiatives advancing liquid biopsy technologies In parallel with overarching guidance from the Medical Device Coordination Group on in vitro diagnostics (MDCG IVD), numerous European organizations are advancing the clinical integration of liquid biopsy technologies. These initiatives address critical components of the diagnostic pipeline—from standardizing blood collection protocols and validating next-generation sequencing assays to driving biomarker discovery and promoting regulatory harmonization. While not exhaustive, Table 1 10.13039/501100000780 European Union Table 1 [Organizational contributions to the advancement of liquid biopsy ]. Table 1 ORGANIZATION DESCRIPTION BLOODPAC BLOODPAC is a non-profit organization with the goal to accelerate the development, validation and clinical use of liquid biopsy tests to better inform medical decisions to improve outcomes of patients with cancer. Their Global Regulatory and Accessibility Working Groups collaborate with EU IVDR and CTR experts to catalyze a U.S.-EU project aimed at enhancing patient access and integrating liquid biopsy into cancer care across Europe. here European Coalition for Access to Comprehensive Genomic Profiling (ECGP) ECGP brings together key stakeholders in Europe, including patients, clinicians, pathologists and industry to identify and share best practices, and develop evidence-based policy recommendations on the clinical and economic utility of CGP for payers and other decision-makers. Its initiatives include advocating for both tissue and liquid biopsy CGP to inform treatment decisions and improve cancer care in Europe. here EUROPEAN COMMITTEE FOR STANDARDIZATION (CEN) CEN facilitates the development of European Standards, for industries, including medical diagnostics. It has led efforts to establish CEN/TS 17390–3:2020, focusing on the analytical staining of circulating tumor cells (CTCs). This specification is part of a broader set of preanalytical standards for liquid biopsy, alongside ISO 20186–3:2019, which addresses the isolation of circulating cell-free DNA (ccfDNA) from plasma. here EUROPEAN CONFEDERATION OF PHARMACEUTICAL ENTREPRENEUR EUCOPE) EUCOPE is Europe's trade body that gives a bigger voice to small and mid-sized innovative companies working in the field of biopharmaceuticals and medical technologies. EUCOPE collaborates with BLOODPAC and other stakeholders to push for the adoption of liquid biopsy in Europe, advocating for regulatory frameworks and standards that support its integration into cancer diagnostics and treatment here EUROPEAN LIQUID BIOPSY SOCIETY (ELBS) The ELBS aims to ensure that liquid biopsy (LB) tests soon become part of clinical routine to benefit cancer patients (<5 years). It is our mission to promote comprehensive research on liquid biopsy leading to robust LB assays that are subsequently validated in clinical trials providing evidence for the clinical utility of LB. here EUROPEAN ORGANIZATION FOR RESEARCH AND TREATMENT OF CANCER (EORTC) EORTC aims ultimately to increase people's survival and quality of life by testing new therapeutic strategies based on existing drugs, surgery, and radiotherapy. EORTC also helps develop new drugs and approaches in partnership with the pharmaceutical industry and in patients' best interests. here EUROPE’S BEATING CANCER PLAN Europe's Beating Cancer Plan prioritizes cancer, including cancer in women, with policy actions, research efforts, and unprecedented funding. For example, the SHINE project within this plan has developed a proof of concept for the rapid detection of breast cancer from a blood droplet, advancing liquid biopsy technologies in Europe. here INTERNATIONAL QUALITY NETWORK FOR PATHOLOGY (IQN PATH) IQN Path is an international multi-stakeholder expert group focused on improving quality of clinical biomarker testing. IQN Path brings together organizations and key stakeholders involved in quality implementation. here INTERNATIONAL SOCIETY OF LIQUID BIOPSY (ISLB) ISLB was founded in 2017 with an aspiring objective: to become the scientific reference in Liquid Biopsy and the unique link of all stakeholders in the LB theme. ISLB connects liquid biopsy professionals globally. In Europe, it provides a platform for sharing best practices and fostering collaboration among researchers and clinicians to advance the clinical use of liquid biopsy in cancer diagnostics and monitoring. here MEDICAL DEVICE COORDINATION GROUP (MDCG) The MDCG provides regulatory guidance to support the uniform application of the Medical Devices Regulation (MDR) and In Vitro Diagnostic Regulation (IVDR) across EU Member States. While there are currently no liquid biopsy-specific MDCG guidelines, existing MDCG guidance documents on IVD classification, clinical evidence requirements, and performance studies are commonly applied to liquid biopsy technologies. In the absence of dedicated guidance, these general documents serve as the de facto reference for regulatory expectations related to liquid biopsy assays. here MEDTECH EUROPE MedTech Europe is the European trade association for the medical technology industry, advocating for access to innovative technologies. Recently, with the European Federation of Clinical Chemistry and Laboratory Medicine (EFLM) and BioMed Alliance, they published a position paper calling for a reconsideration of Article 58.1(a) of the IVDR. They argue that routine venous and capillary blood draws should not face the same strict standards as invasive procedures, which would reduce delays and improve access to liquid biopsy and other diagnostics in Europe. here THE NATIONAL INSTITUTE FOR BIOLOGICAL STANDARDS AND CONTROL (NIBSC) NIBSC, an agency of the Medicines and Healthcare products Regulatory Agency (MHRA), is responsible for developing biological standards and reference materials. Endorsed by the WHO Expert Committee on Biological Standards (ECBS) in 2018, NIBSC is developing ctDNA primary standards, initially for EGFR variants. here EUROPEAN SOCIETY FOR MEDICAL ONCOLOGY (ESMO) ESMO is a leading professional organization for oncologists, dedicated to advancing the practice of medical oncology through education, research, and collaboration. ESMO provides a platform for sharing knowledge, fostering best practices, and supporting cancer care worldwide. here ∗The materials in this table are not comprehensive. This is a high-level overview of groups participating in bringing liquid biopsy to patients in Europe, this table is not intended to be an exhaustive list. 4 Bridging the gap: Proposed synergies between BLOODPAC and European Union initiatives The European Union has made notable progress in advancing liquid biopsy technologies, despite navigating a complex and evolving regulatory landscape. With initiatives emerging across member states, a unified approach remains essential to ensure consistency, reduce duplication, and speed clinical adoption. The EU's collective efforts, combined with BLOODPAC's initiatives, can help accelerate global access to liquid biopsy technologies. BLOODPAC's work in aiding regulatory bodies around the world to find common ground promises to positively reshape the challenging landscape created by evolving regulatory expectations, including the IVDR and CTR. A harmonized approach could streamline the adoption of liquid biopsy, thereby facilitating consistency among regulators including EU member states, educating Notified Bodies, arriving at common frameworks for Health Technology Assessments (HTA), and increasing investment in biomarker research. While the European Commission provides guidelines and validation standards to ensure the safety, effectiveness, and quality of in vitro diagnostic devices, specific guidance for liquid biopsy technologies remains limited, potentially delaying their market entry and clinical adoption. A liquid biopsy diagnostic test typically requires conformity assessment by a Notified Body under the IVDR depending on its intended clinical use. Additionally, a clinical performance study application may be required when using an IVD that is not Conformité Européenne (CE) marked depending on the intended purpose in the clinical study. To receive a companion diagnostic (CDx) designation following the clinical performance study, a consultation between the Notified Body and the European Medicines Agency (EMA) is required. Understanding the regulatory and reimbursement pathways are crucial to formulating strategies that are in line with EU standards and promote the uptake of cutting-edge diagnostics like liquid biopsy. While the EU regulatory environment differs from that of the US, the principles and methodologies developed by BLOODPAC could be adapted accordingly. In collaboration with partners in the EU, BLOODPAC recommends the following areas of synergy to accelerate the use of liquid biopsy globally. a. Harmonizing minimum technical data elements (MTDEs) for preanalytical processing to ensure data traceability. BLOODPAC's minimum technical data elements (MTDEs) for preanalytical processing provide a critical foundation for data traceability and standardization. These include specifications for blood collection tube type, sample composition, shipping and storage temperatures, time to fractionation, and time to freezing—factors that directly impact data quality and reproducibility. These are particularly relevant to the IVDR's Annex II [ 11 Importantly, these standardized elements help mitigate discrepancies in blood draw practices, which can vary widely and are sometimes subject to differing interpretations under the IVDR. For example, blood draws from standard-of-care procedures may be classified as invasive and require a performance study application depending on the member state. Position papers from groups like MedTech Europe [ 12 10.13039/501100000780 European Commission b. Utilize protocols developed in collaboration with regulatory bodies to streamline analytical performance study design. BLOODPAC's collaboration with the U.S. Food and Drug Administration (FDA) to develop analytical validation protocols for ctDNA-based assays has established performance benchmarks essential for test development. These protocols, which address key parameters such as Limit of Detection (LoD), reproducibility, specificity, sensitivity, and interference—are in line with the IVDR's General Safety and Performance Requirements (GSPRs) in Annex I. The potential for these protocols to be adapted to the EU regulatory environment under the IVDR is significant and could be used to streamline the conformity assessment process of liquid biopsy tests. This approach could mitigate challenges such as limited Notified Body capacity and regulatory discrepancies, accelerating the adoption of validated and approved assays for genomic profiling in clinical practice and medicinal product trials across the EU. These protocols could also ensure that liquid biopsy tests are suitable for investigational and research purposes, particularly in advanced solid tumor applications making them ideal for inclusion in clinical performance study plans to facilitate submissions to ethics committees and competent authorities. Finally, BLOODPAC's ongoing efforts on MRD detection protocols highlight the importance of biomarker research for patient characterization beyond therapy selection [ 13 EU c. Utilize the BLOODPAC Portal to freely share liquid biopsy clinical data. BLOODPAC's achievements in standardizing preanalytical processes and promoting collaboration through platforms like the BLOODPAC Portal could be instrumental in the EU. The BLOODPAC Portal stands as a model for secure data management and reproducibility of liquid biopsy results, which is essential for maintaining the integrity of clinical evidence in accordance with EU regulations. The platform's commitment to transparency and reproducibility aligns with the EU's requirements on clinical evidence. This approach could greatly benefit projects like CAN.HEAL and CANCER-ID, which have the potential to make strides in biomarker research for early detection and disease monitoring. These projects could benefit from participating in BLOODPAC's data-sharing platform and collaborative frameworks. Strategies could be developed to overcome common challenges, ensuring that biomarker research extends beyond therapy selection to include patient characterization and long-term disease management. Moreover, the BLOODPAC Portal's analytical tools provide a rigorous assessment of preanalytical variables enhancing standardization and validation processes. This standardized approach helps to generate evidence that meets the regulatory requirements for technical documentation and performance evaluation in the EU. By promoting standardization and harmonization consistent with evolving regulatory requirements, the BLOODPAC Portal could be instrumental in advancing liquid biopsy technologies within clinical settings while reducing duplicative efforts in assay validation. 5 Conclusions and next steps As liquid biopsy technologies continue to evolve, global collaboration and regulatory alignment are essential to accelerate their clinical adoption. 10.13039/100030996 BLOODPAC Adapting BLOODPAC's protocols to align with EU regulatory requirements presents a significant opportunity to accelerate harmonized implementation. Strengthening collaboration between BLOODPAC and EU partners, including the European Commission and patients advocacy groups and the International Medical Device Regulators Forum (IMDRF), will be key for the provisional global adoption of these protocols. This harmonization will not only benefit patients by providing quicker access to innovative diagnostic tools but will also support the medical community and industry members by reducing complexity and fostering international collaboration. Additionally, joint development of guidelines for performance studies of liquid biopsy technologies would address a critical gap in the regulatory frameworks across international boundaries while ensuring methodological standardization and reproducibility. In conclusion, by leveraging the groundwork laid by BLOODPAC and working in concert with EU and international regulatory bodies, a cohesive and dynamic pathway for the adoption of these life-changing technologies can be created. The next steps require continued dialogue, shared learning, and a unified commitment to refining and harmonizing guidelines that will ultimately lead to improved patient outcomes and elevates the global standard of cancer care. Ethical approval/Patient consent No ethical approvals or patient consent were necessary for the study. Declaration of competing interest The authors declare the following financial interests/personal relationships which may be considered as potential competing interests: Lauren C. Leiman reports administrative support, article publishing charges, and writing assistance were provided by 10.13039/100030996 BLOODPAC References 1 BLOODPAC Accelerating the development of liquid biopsy technologies https://www.bloodpac.org/ 2 Kwapisz D. The first liquid biopsy test approved. Is it a new era of mutation testing for non-small cell lung cancer? Ann Transl Med 5 3 2017 46 10.21037/atm.2017.01.32 28251125 PMC5326656 3 Pascual J. Attard G. Bidard F.C. ESMO recommendations on the use of circulating tumour DNA assays for patients with cancer: a report from the ESMO Precision Medicine Working Group Ann Oncol 33 8 2022 750 768 10.1016/j.annonc.2022.05.520 35809752 4 European Parliament and Council of the European Union Regulation (EU) 2017/746 of the European parliament and of the council of 5 april 2017 on in vitro diagnostic medical devices and repealing directive 98/79/EC and commission decision 2010/227/EU Off J Eur Union L117 2017 176 332 https://eur-lex.europa.eu/eli/reg/2017/746/oj/eng 5 European Medicines Agency. Clinical trials regulation. European Medicines Agency. Accessed May 23, 2025. https://www.ema.europa.eu/en/human-regulatory-overview/research-development/clinical-trials-human-medicines/clinical-trials-regulation. 6 Febbo P.G. Martin A.M. Scher H.I. Minimum technical data elements for liquid biopsy data submitted to public databases Clin Pharmacol Ther 107 4 2020 730 734 10.1002/cpt.1747 32017048 PMC7158216 7 Association for Molecular Pathology, Department of Laboratory Medicine and Pathology, University of Minnesota, Mayo Clinic, and BloodPAC Consortium Towards preanalytical best practices for liquid biopsy studies Clin Pharmacol Ther July 2023 10.1002/cpt.3416 8 Godsey J.H. Silvestro A. Barrett J.C. Generic protocols for the analytical validation of next-generation sequencing-based ctDNA assays: a joint consensus recommendation of the BloodPAC's analytical variables working group Clin Chem 66 9 2020 1156 1166 10.1093/clinchem/hvaa164 32870995 PMC7462123 9 Clarke C.A. Liao L. Miksad R.A. Navigating complexity: perspectives on risk assessment in the era of new blood-based tests for early cancer detection Clin Cancer Res May 2025 10.1158/1078-0432.CCR-24-4269 PMC12163593 40198129 10 Grossman R.L. Dry J.R. Hanlon S.E. BloodPAC data commons for liquid biopsy data JCO Clin Cancer Inform 5 2021 479 486 10.1200/CCI.20.00179 33929890 PMC8140805 11 European Parliament and Council of the European Union Regulation (EU) 2017/746 of the European parliament and of the council of 5 April 2017 on in vitro diagnostic medical devices and repealing directive 98/79/EC and commission decision 2010/227/EU Off J Eur Union 60 May 5, 2017 97 101 https://eur-lex.europa.eu/legal-content/EN/TXT/PDF/?uri=CELEX:32017R0746 12 MedTech Europe Recommendations for improving the EU public procurement directive: position paper following response to the EU public procurement directive consultation https://www.medtecheurope.org/wp-content/uploads/2025/03/medtech-europe_position-paper_ppd-consultation_final.pdf March 24, 2025 13 Hadd A.G. Silvestro A. McKelvey B.A. Establishing a common lexicon for circulating tumor DNA analysis and molecular residual disease: insights from the BLOODPAC Consortium Clin Transl Sci 18 3 2025 2 10.1111/cts.70185 PMC11897061 40070025 ",
  "metadata": {
    "Title of this paper": "Establishing a common lexicon for circulating tumor DNA analysis and molecular residual disease: insights from the BLOODPAC Consortium",
    "Journal it was published in:": "The Journal of Liquid Biopsy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475853/"
  }
}