{
  "title": "Paper_242",
  "abstract": "pmc J Mol Diagn J Mol Diagn 375 jmd The Journal of Molecular Diagnostics : JMD 1525-1578 1943-7811 American Society for Investigative Pathology PMC12489365 PMC12489365.1 12489365 12489365 40578550 10.1016/j.jmoldx.2025.05.007 S1525-1578(25)00141-2 1 Regular Articles Cell-Free DNA, Tumor Molecular Concordance, and Clinical Correlates of Patients with Cancer Treated in a Large Community Health Care Network LaFramboise William A. william.laframboise@ahn.org ∗ ∗ Petrosko Patti ∗ Gallo Phillip H. ∗ Gil Louis ∗ Lam Tuong L. ∗ Barr Robin M. ∗ Schumacher Philip E. ∗ Kharoud Harmeet K. ∗ Taylor Katherine M. ∗ Dalton Emily † Bapat Bella † Patel Sefali ∗ Nakayama John ∗ Hilton Christie J. ∗ Ercolano Lisa B. ∗ Zaidi Ali H. ∗ Allen Casey J. ∗ Rachman Thomas ‡ Carja Oana ‡ Schwartz Russell ‡ § Wagner Patrick L. ∗ Bartlett David L. ∗ ∗ † ‡ § ∗ william.laframboise@ahn.org 9 2025 25 6 2025 27 9 498162 882 898 30 5 2025 25 06 2025 03 10 2025 03 10 2025 © 2025 Association for Molecular Pathology and American Society for Investigative Pathology. Published by Elsevier Inc. 2025 Association for Molecular Pathology and American Society for Investigative Pathology https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Blood collection, plasma processing, and cell-free DNA (cfDNA) purification were optimized to capture circulating tumor DNA without blood cell background DNA among 874 patients with cancer. cfDNA comprised predominantly mononucleosomal fragments [ n x ¯ x ¯ n pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Comprehensive genomic profiling (CGP) of solid tumors using next-generation sequencing (NGS) has become a standard of care for patients with cancer to obtain diagnostic information, identify biomarkers for growing numbers of targeted therapies, follow guideline-endorsed use of US Food and Drug Administration–approved drugs, or select among extensive clinical trials for those applicable to individual patients. Clinical CGP assays evolved largely through adaptation of NGS methods to interrogate short DNA fragments typical of formalin-fixed, paraffin-embedded (FFPE), pathology tumor specimens incorporating an enrichment process for target cancer genes or hot spot domains using hybridization-capture enrichment or amplicon PCR, respectively. 1 , 2 3 National Comprehensive Cancer Network policy guidelines indicate that blood samples should not replace tumor tissue as the standard for diagnosis and treatment of patients with cancer. However, National Comprehensive Cancer Network policy recognizes the use of ctDNA when tumor tissue is inaccessible to identify a targeted drug therapy for specific gene mutations [eg, non–small-cell lung cancer, https://www.nccn.org/professionals/physician_gls/pdf/nscl.pdf https://www.nccn.org/professionals/physician_gls/pdf/colon.pdf + – https://www.nccn.org/professionals/physician_gls/pdf/breast.pdf https://www.nccn.org/professionals/physician_gls/pdf/pancreatic.pdf https://www.nccn.org/professionals/physician_gls/pdf/prostate.pdf 4 5 6 7 8 9 4 10 11 12 A major hurdle in developing and optimizing concordant tumor and blood-based CGP assays is the limited availability of paired tumor and blood specimens with precisely characterized collection times, treatment status, tumor stage, and preanalytical processing protocols to directly compare solid tumor DNA (stDNA) and ctDNA genomic results. The Allegheny Health Network (AHN) Cancer Institute launched an Oncology Biobank and Data Repository initiative in March 2021 for collection of tissue, blood, and comprehensive clinical data to address these issues. Blood was obtained from consenting patients with cancer across the 14 hospitals of the AHN for identification of cancer biomarkers in tumor tissue and blood samples (Oncology Sample Biobank and Data Repository; institutional review board number 2020-258). More than 7000 unique patients contributed to the AHN Biobank by March of 2025, providing initial diagnostic and longitudinal blood samples throughout their course of treatment. All samples in the AHN Cancer Institute biorepository contained comprehensive clinical data using the mCODE framework (Minimal Common Oncology Data Elements) to standardize data collection and ensure efficient data integration and analysis. The aim of this study was to interrogate cell-free DNA of patients with cancer at AHN Cancer Institute using a ctDNA assay in a paired comparison to the clinically validated solid tumor CGP assay. The differences in timing of sample acquisition, tumor stage, interventional therapy, and the presence of other primary tumors were precisely monitored to ensure the highest fidelity comparison attainable. Included in this initiative was the i) standardization of patient blood collection, preservation, and transport of samples to a centralized AHN Genomics Facility, ii) development of a plasma separation and storage protocol to minimize background blood cell–derived germline DNA, iii) implementation of a bead-based, cfDNA purification and quality assurance/quality control protocol to characterize the quantity and integrity of each patient's cfDNA sample, and iv) utilization of a 523-gene NGS panel and analysis pipeline equivalent to the College of American Pathologists/Clinical Laboratory Improvement Amendments–approved CGP solid tumor assay to compare ctDNA results with stDNA profiles from matched FFPE tissue specimens (TruSight Oncology 500: ctTSO500 versus stTSO500; Illumina, San Diego, CA). Materials and Methods Consent and Sample Collection This study included male and female patients (aged 18 to 100 years) diagnosed with cancer of any origin who came to AHN for clinical care. Participants signed a Health Insurance Portability and Accountability Act Authorization Statement of informed consent (institutional review board number 2020-258: Oncology Sample Biobank and Data Repository) to contribute de-identified data to a database linking their tumor and blood sequencing data with clinicopathologic tumor information. The protocol included access to tissues from patients with cancer having procedures at 1 of 21 AHN Cancer Institute treatment sites and provision of blood samples obtained during routine, clinical laboratory draws or i.v. therapy at an AHN hospital. Whole blood samples were collected in three, 10-mL Streck, Cell-Free DNA BCT tubes (Streck, LaVista, NE) followed by gentle inversion of each tube 10 times and maintenance of samples at room temperature (18°C to 25°C), according to the manufacturer's recommendation. Streck tubes were encased in bubble wrap and transferred daily by medical courier to the AHN Genomics Facility for processing. Samples subjected to undue agitation, including pneumatic tube system transport, were not included on the basis of previous studies and National Cancer Institute guidelines. 13 , 14 Isolation of Plasma from Streck Tube Samples A three-step sequential centrifugation protocol was developed to separate plasma devoid of cells and debris from patient blood samples. This was based on the preliminary observation that a substantial number of cancer patient samples contained visible cell pellets after a second centrifugation. Consequently, a third centrifugation step was incorporated to eliminate these cells as a potential source of germline DNA contamination. Whole blood in Streck tubes was gently mixed and placed in a chilled, swinging bucket rotor for centrifugation at 1600 × g g Purification of Cell-Free DNA from Plasma Frozen plasma was thawed at room temperature (60 minutes) and the volume adjusted as needed (1× phosphate-buffered saline, pH 7.4; catalog number 10010-023; ThermoFisher) for purification of cfDNA using the Apostle MiniMax High Efficiency cfDNA Isolation Kit (catalog number A17622-250; Beckman, Indianapolis, IN). The only protocol modification was the primary Proteinase K digestion incubation that was optimized to 1 hour at 60°C. Cell-free DNA was eluted using magnetic beads in 40 to 50 μL of elution buffer per sample, and 2 μL was assayed for concentration by fluorometry (Qubit Flex; ThermoFisher) using the Qubit dsDNA High Sensitivity kit (catalog number Q32854 15 Purification of DNA from FFPE specimens FFPE tumor specimens were obtained from pathology blocks after review of a correlative hematoxylin and eosin slide by a surgical pathologist (P.L.W.). Cores were punched to obtain pure tumor specimens (1-mm by 0.5-cm punch biopsy) when accessible, or 10 to 20 slides containing unstained sections (5 to 10 μm thickness) were cut for macrodissection of tumor regions demarcated by the reviewer. Unstained slides were deparaffinized in xylene (5 minute immersion × 3), dried, aligned in register with the corresponding hematoxylin and eosin slide, and the tumor tissue was removed using a scalpel (Penblade-size 10, 15, or 22; ThermoFisher) after applying 2 to 4 μL of molecular-grade water (ThermoFisher) to the unstained tissue. Tumor tissue was collected in a 2-mL Eppendorf tube and dehydrated in 500 μL xylene. The xylene was removed after centrifugation (Eppendorf Minispin plus, 10,000 × g Purification of DNA from Buffy Coat Samples Frozen buffy coat was thawed at room temperature (40 minutes) before processing, and the volume was adjusted as needed (1× phosphate-buffered saline, pH 7.4; catalog number 10010023; ThermoFisher) for purification using the column-based Quick-DNA Midiprep Plus Kit (D4075; Zymo Research, Irvine, CA), according to the manufacturer's protocol. The only protocol modification was the primary Proteinase K digestion incubation that was optimized to 2 hours at 60°C. Purified buffy coat DNA was checked for purity and quantity, as described in the preceding paragraph for cell-free and solid tumor DNA. An aliquot of the buffy coat genomic DNA was diluted to 3 ng/μL for analysis by capillary electrophoresis (5200 Fragment Analyzer, HS Genomic DNA Kit: DNF-488; Agilent) and advanced for fragmentation with genomic size distribution routinely exceeding 20 kb. Sequencing Library Preparation of Solid Tumor, Buffy Coat, and Cell-Free DNA Samples DNA from solid tumor and buffy coat was prepared according to the Illumina TruSight Oncology 500 Reference Guide (document number 1000000067621 version 10, July 2022; Illumina). The minimum input requirement of 40 ng DNA was sheared (12°C, 10 seconds duration, 20 bursts, 30% duty factor, 1000 cycles/burst) using the Covaris ME220 (Covaris, Woburn, MA) to obtain 80- to 170-bp fragments. The DNA was subjected to end repair and A-tailing reactions, including addition of adapters and unique molecular identifiers to each fragment followed by an index PCR amplification step (15 cycles: 10 seconds at 98°C, 30 seconds at 60°C, and 30 seconds at 72°C) to obtain a yield of 60 to 120 ng/μL. Genomic targets in each sample were selected using hybrid capture probes linked to streptavidin magnetic beads in an overnight incubation (16 to 18 hours at 57°C). After bead separation and clean up, a second enrichment capture step was performed (2 hours at 57°C). After bead capture and clean up, the targets were amplified (18 cycles: 10 seconds at 98°C, 30 seconds at 60°C, and 30 seconds at 72°C) to obtain a final library for sequencing with a peak fragment size range from 325 to 375 bp at a concentration of approximately 20 ng/μL after enrichment. Eight purified DNA libraries were diluted and combined in a final library pool manually normalized to 1.1 pmol/L according to the NextSeq System Denature and Dilute Libraries Guide (document number 15048776 version 16, July 2020; Illumina). Paired-end sequencing (2 × 100 bp or 2 × 150 bp) was performed on the NextSeq 550Dx following the NextSeq550 Sequencing Systems protocol (document number 15069765 version 07, October 2021; Illumina). Libraries prepared for sequencing from cfDNA followed the Illumina TruSight Oncology 500 ctDNA Reference Guide (document number 1000000092559 version 00, February 2020; Illumina). Briefly, a minimum of 25 to 30 ng cfDNA contained within the 75- to 300-bp DNA domain was required. Library preparation proceeded without fragmentation, including end repair, A-tailing, unique molecular identifier adapter ligation, and index PCR, yielding a concentration of approximately 80 to 170 ng/μL. Two rounds of target enrichment were performed, followed by PCR, to obtain fragments in the 325- to 375-bp range at a concentration of 20 ng/μL. Twenty-four sample libraries were manually normalized (0.65 nmol/L), and paired-end sequencing (2 × 150 bp) was performed on the NovaSeq 6000 according to the NovaSeq 6000 Sequencing System Guide (document number 1000000019358 version 17, September 2022; Illumina). Data Analysis Pipeline FFPE tumor and buffy coat derived binary base call files were generated by the NextSeq Local Run Manager (TruSight Oncology 500 version 2.2 software; document number 10000000151997 version 01, September 2021, Illumina), including read collapsing and error correction to remove sequencing mistakes, low-quality and duplicate reads, deamination artifacts, and high background noise or low coverage regions (Pepe blacklist; Illumina). Binary base call files were converted to aligned BAM files (Burrows-Wheeler Aligner: HG19 reference), followed by local realignment to insertions or deletions and paired-end stitching using the GEMINI software module. Single-nucleotide variants and insertions or deletions were called by PISCES software, multiple nucleotide variants by SCYLLA, and copy number variants by the CRAFT program. Small variants were filtered at read depth ≥100 reference calls and 1% variant allele frequency as the analytical limit of detection. VCF files were annotated by the Nirvana Annotation Engine using public databases (dbSNP, Genome Aggregation Database, 1000 Genomes, ClinVar, RefSeq, and Ensembl). Tumor mutation burden was generated from small variant files across 1.33 Mb of exonic sequence after removing germline variants using TMBRaider software. Mutation annotation format files were generated from JSON files (maftools module of R/Bioconductor: vcf2maf conversion) to interrogate the OncoKB Oncology Knowledge Database version 4.9 for pathogenicity and clinical actionability of variants for US Food and Drug Administration–approved level 1 and Standard Care Level 2 oncology drugs dating back to 1998. 16 , 17 Cell-free DNA libraries sequenced on the NovaSeq6000 (Illumina) were transferred to and processed in Illumina Connected Analytics using the DRAGEN TruSight Oncology 500 ctDNA Analysis software version 2.1 (document number 200028897 version 01, November 2023). Analysis followed the Local Run Manager processing paradigm converting binary base call files to FASTQ and BAM files incorporating the DRAGEN aligner followed by stretched realignment using GEMINI. High background noise or low coverage regions were removed using a Pepe blacklist specific to the ctDNA assay. Single-nucleotide variants and insertions or deletions were called by PISCES, multiple nucleotide variants by SCYLLA, and copy number variants by the CRAFT module. Clonal hematopoietic variants of indeterminate potential in cfDNA (<1% variant allele frequency) were removed using germline (>30% variant allele frequency) and/or the Genome Aggregation Database of population frequencies (<0.001). 16 17 18 Supplemental Figure S1 Statistical Analysis Correlation analysis between solid tissue and circulating tumor data was performed to determine shared and exclusionary variants. Variants within the combined domains of the Pepe blacklists were removed and missense, frameshift, stop-gained, splice region, splice donor, and in-frame insertions and deletions were processed in R using an inner join merging function based on the chromosome start position, end position, reference allele, altered allele, and lower limit of detection to identify mutations in common. A subsequent anti-join function was used to identify mutations unique to the solid tissue, buffy coat, or circulating tumor DNA. Concordance for each of these comparisons was calculated by dividing the total number of variants shared between the plasma and tumor tissue assays by the total number of variants specifically detected in the solid tumors. The normality of data distribution was assessed using the Kolmogorov-Smirnov test. Between-group differences for normally distributed data were analyzed by t U 19 P Survival analysis was performed using Cox proportional hazards regression after calculating the time interval for each patient from the date of the initial blood draw to the date of death or censoring on the date of study data lockout (August 9, 2024). For multivariable analysis, patient age was calculated for the date of the initial blood draw; primary tumor site was verified by individual chart review, and tumor stage was assigned according to the American Joint Cancer Committee T/N/M (tumor/node/metastasis) framework. Statistical analysis was performed using SAS version 9.4 or STATA version 16 (StataCorp, College Station, TX) with P Results From inception of the AHN Oncology Biobank initiative in March of 2021 to March 1, 2025, 26,358 diagnostic (initial) and longitudinal samples were processed from 7155 unique patients in the ongoing program. Patients comprised 28 different general tumor types, with largest representation from lung (12.3%), breast (11.9%), colon (10.1%), endometrial (9.7%), and pancreatic (5.9%) cancer specimens ( Supplemental Figure S2 Supplemental Figure S3 Figure 1 20 x ¯ n Figure 1 Figure 1 x ¯ n Figure 1 Figure 1 Cell-free DNA (cfDNA), sequencing library, and read length size profiles. A: Materials and Methods B: A A C: B The cfDNA concentration of plasma samples (75 to 1200 bp) spanned two to three orders of magnitude across tumor types with a minimum value of 0.50 ng/mL of plasma from a patients with osteosarcoma to a maximum of 1132.9 ng/mL from a patient with lung cancer ( Figure 2 P Figure 2 Cell-free DNA (cfDNA) concentrations across tumor types. Concentration in nanograms per milliliter of plasma (ng/mL) for each patient in the study is plotted (log base 10) on the vertical axis for 874 tumors comprising 21 different tumor classifications. Specimens are color coded by tumor type, and individual samples within a tumor type are plotted arbitrarily from low to high concentration (see Materials and Methods Figure 1 FFPE blocks were selected as primary diagnostic tumor specimens based on their histopathology and clinical record for comparison to each patient diagnostic blood sample acquired through the biobanking protocol. Residual, matching tumor tissue specimens were obtained for 447 of the 874 patients. These 447 plasma samples were targeted for the concordance sequencing study of matched tumor specimens with a concentration range from 27.6 ng/mL (breast) up to 491.4 ng/mL of plasma (esophagus) measured over the 75- to 1200-bp range that served as the benchmark. Clinical status, histologic grade, tumor stage, and timing of tumor tissue and blood collection were curated for each sample, including delineation of clinical therapeutic interventions before or between collection of blood and tumor specimens (eg, surgery, chemotherapy, immunotherapy, or radiation therapy) ( Table 1 Figure 3 Figure 3 Table 1 Table 1 Demographic Characteristics of Patients in the Concordance Study Age, years Sex Cancer status Plasma processing, hours Blood vs tumor sample acquisition Therapy intervention 63.8 ± 13.3 Male Female Stage 1 65 ≤24 308 Prior: >20 weeks 1 None 291 191 239 Stage 2 54 25–48 77 Prior: 5–20 weeks 10 Prior 92 Stage 3 128 49–72 28 Prior: 1–4 weeks 17 Between 47 Stage 4 174 73–118 8 Same day 174 NA 9 After: 1–4 weeks 102 Multiple 45 After: 5–20 weeks 102 After: <20 weeks 24 Age indicates the average for 430 patients at the date of their diagnostic blood draw. Cancer status: American Joint Committee on Cancer clinical stage; Multiple includes patients previously diagnosed and treated for a primary cancer or who had an additional primary cancer diagnosed within the period of the study. Plasma processing indicates the number of patients classified according to the time between their blood draw and storage of their plasma in the –80°C freezer biorepository. Blood vs tumor sample acquisition delineates numbers of patients based on the time differential between acquisition of their blood and tumor samples. Therapy intervention refers to cases where patients underwent therapy (chemotherapy, immunotherapy, or radiotherapy) before acquisition of their samples or therapy was initiated between acquisition of samples. NA, not available. Figure 3 Blood to plasma processing intervals and time proximity of matched blood and tissue acquisition. A: B: n A The characteristics of the 430 patients in the concordance study were representative of the overall population in the biorepository, with 70% from patients with late-stage cancer, including 45 with a history of multiple cancers ( Table 1 P Supplemental Figure S4 Table 2 r P r P Table 2 Concordance of Variants Detected by CGP of Matched Tumors and Plasma Samples VAL ALL VAR CODING VAR OncoKB VAR BOTH CF ST CONCORD, % BOTH CF ST CONCORD, % BOTH CF ST CONCORD, % AVE 1134.7 39.0 38.6 96.9 165.5 16.0 10.6 94.7 7.5 4.4 2.1 81.8 MED 1123.0 31.0 20.0 98.3 163.0 14.0 5.0 96.9 7.0 4.0 1.0 87.5 MIN 775.0 8.0 7.0 105.0 1.0 0.0 2.0 0.0 0.0 MAX 1455.0 406.0 531.0 262.0 123.0 176.0 27.0 29.0 32.0 SD 79.7 43.6 70.7 16.2 12.2 18.0 2.9 3.6 3.1 LEVEL 1 THERAPEUTIC ( n BOTH CF ST NONE 233 48 23 126 ALL VAR indicates the overall number of variants, including synonymous and nonsynonymous variants detected by CGP profiling. CODING VAR indicates nonsynonymous, coding variants that alter the RNA transcript, amino acid sequence, and/or peptide sequence if expressed and translated. OncoKB VAR are variants classified using the OncoKB database to determine nonpolymorphic, likely oncogenic, and oncogenic variants, including actionable mutations (level 1) with an approved therapy targeting that mutation. VAL indicates the category of values provided for that column, including AVE for average, MED for median, MIN for minimum, MAX for maximum, and SD for standard deviation for the concordance values. CONCORD indicates the concordance of values detected in the solid tumor tissue that were also identified in the cell-free DNA (cfDNA). BOTH indicates that a specific variant was concomitantly detected in the solid tumor and cfDNA assays for a patient. CF indicates that the variant was detected in the cell-free DNA only. ST indicates that the variant was detected in the solid tumor tissue only. LEVEL 1 THERAPEUTIC refers to the total number of patients with an actionable mutation and their detection by the solid tumor and/or plasma CGP assays. CGP, comprehensive genomic profiling. Variants were compared with the OncoKB clinical database version 4.9 (810 genes) to identify oncogenic mutations, including therapeutically actionable mutations from among the 53 level 1 genes in the database ( Table 2 16 , 17 Table 2 Table 2 r P The number of total, coding, and clinically oncogenic variants in ctDNA and their concordance values in solid tumors were tested for an effect of independent clinical variables, including cancer stage, therapeutic interventions associated with the timing of sample collection, and tumor type. Although concordance was high across these samples regardless of stage for overall and coding variants, there was a significant difference detected for OncoKB clinical variants, indicating that concordance increased progressively from stage 1 and 2 to higher values obtained for stage 3 and 4 patients (Kruskal-Wallace test; χ 2 P Figure 4 Table 3 Figure 4 Table 3 Figure 4 Effect of tumor stage, therapeutic intervention, and vital status on concordance and cell-free DNA (cfDNA) concentration. A: 2 horizontal line B: 2 P A C: 2 Results A D: A P P Table 3 Variants Detected by CGP in Matched Tumor and Plasma Samples According to Tumor Type TUMOR CODING VAR OncoKB VAR LEVEL 1 THERAPEUTIC BOTH CF ST CONCORD, % BOTH CF ST CONCORD, % BOTH CF ST NONE Appendix AVE 163.5 10.5 7.5 95.9 6.8 3.0 1.8 81.3 22 3 3 17 MED 159.0 9.0 5.0 96.9 7.0 3.0 1.0 85.7 n SD 14.8 5.9 12.7 1.9 2.5 1.9 Bladder AVE 161.2 18.8 11.8 93.3 7.9 5.3 3.0 71.4 9 1 0 2 MED 159.5 15.5 10.0 94.3 6.5 4.0 3.0 71.4 n SD 9.7 17.2 7.9 3.2 5.9 1.9 Blood AVE 168.4 23.1 11.6 94 8.3 6.1 1.1 89.9 4 1 0 6 MED 168.0 19.0 6.0 97 8.0 5.0 1.0 90.9 n SD 17.0 9.7 12.6 6 2.9 4.0 1.3 Breast AVE 163.2 12.7 11.5 94.2 7.2 4.0 2.0 79.4 24 2 3 7 MED 160.5 9.5 5.5 96.9 7.0 3.0 1.0 82.3 n SD 15.5 9.3 17.7 2.5 4.8 1.8 CHOLANG AVE 165.9 15.6 5.8 96.7 7.1 3.7 1.5 84.0 9 2 0 5 MED 161.5 14.0 4.0 97.9 7.0 4.0 1.0 87.5 n SD 14.6 10.8 5.4 2.1 2.0 2.4 Colon AVE 171.0 17.2 17.4 92.0 9.0 4.6 3.3 78.0 24 1 4 8 MED 171.0 15.0 6.0 96.5 8.0 4.0 1.0 85.7 n SD 18.0 19.4 26.5 4.2 4.3 4.2 ENDOMET AVE 170.6 13.6 10.1 94.8 6.9 3.9 3.5 72.1 18 2 3 9 MED 167.0 13.0 7.0 95.7 7.0 3.5 2.0 73.2 n SD 18.6 6.6 12.0 2.2 2.8 4.0 ESOPHAG AVE 162.0 17.4 13.9 93.0 8.0 5.3 1.9 84.1 3 1 0 7 MED 165.0 18.0 8.0 95.2 9.0 5.0 1.0 90.0 n SD 8.1 8.6 21.1 1.8 3.5 2.6 H & N AVE 165.7 22.5 15.3 93.0 7.5 4.0 2.1 83.9 9 1 1 0 MED 165.0 17.0 5.0 96.8 8.0 3.0 1.0 88.9 n SD 11.0 22.8 25.1 2.1 3.3 3.6 Kidney AVE 163.7 16.3 7.8 95.5 8.1 5.6 1.7 82.3 9 1 0 4 MED 160.5 16.0 8.5 95.2 9.0 5.5 2.0 80.6 n SD 14.1 6.5 4.1 2.1 2.9 1.4 Lung AVE 173.3 20.4 12.8 93.5 8.3 5.1 2.2 79.0 25 6 3 7 MED 172.0 17.0 7.0 95.8 8.0 4.0 2.0 83.3 n SD 15.8 11.3 15.0 2.9 2.9 2.0 Ovary AVE 161.2 19.1 4.3 97.4 7.8 5.6 0.8 91.8 16 7 1 6 MED 163.0 16.0 3.0 98.1 7.5 5.0 0.0 100.0 n SD 11.4 12.4 3.3 2.2 5.0 1.1 Pancreas AVE 159.5 12.5 6.5 96.4 7.2 4.3 1.4 84.1 10 3 1 5 MED 161.0 13.0 4.0 97.4 7.0 4.0 1.0 88.9 n SD 10.4 6.4 10.5 2.2 3.1 1.5 Sarcoma AVE 162.0 16.5 9.3 95.5 6.5 4.3 1.1 89.6 20 7 1 14 MED 163.5 15.5 3.5 97.8 6.0 3.0 0.0 100.0 n SD 16 11 18 2 3 2 Stomach AVE 161.3 17.7 31.1 87.7 6.6 6.2 6.4 64.5 4 3 3 1 MED 165.0 17.0 7.0 96.0 7.0 6.0 2.0 71.4 n SD 8.6 7.6 48.8 2.0 3.0 9.1 All labels are displayed according to Table 2 n CGP, comprehensive genomic profiling; CHOLANG, cholangiocarcinoma; ENDOMET, endometrial cancer; ESOPHAG, esophageal cancer; H & N, head and neck cancer. The relationship of preanalytical clinical variables was evaluated on the cfDNA plasma concentrations of diagnostic blood samples ( Figure 4 P 2 P x ¯ x ¯ P x ¯ P x ¯ P There was an effect of cancer stage on overall cfDNA concentration values based on the Kruskal-Wallace test for nonparametric data (χ 2 P Figure 4 P P Figure 4 n x ¯ n x ¯ The relationship of initial cell-free DNA plasma concentrations was compared with vital status (alive versus deceased) of the patients, many of whom were still undergoing care. This analysis controlled for incremental but significant differences in cfDNA concentrations based on stage, tumor type, and the age of living patients who were significantly younger than decedents (alive n x ¯ n x ¯ P x ¯ x ¯ P Figure 4 x ¯ x ¯ P n x ¯ n x ¯ P On the basis of the vital status analysis, the relationship of cfDNA concentration in our patients to overall duration of survival was tested as a continuous variable from the time of their initial blood draw by a Cox proportional hazards survival regression model, and a significant effect was found after adjusting for age, stage, and tumor type ( Figure 5 n 2 P Figure 5 Supplemental Table S1 n Figure 5 Supplemental Table S1 2 P 2 P Supplemental Table S1 Figure 5 Kaplan-Meier survival probability curve versus cell-free DNA (cfDNA) concentration and tumor stage. A: Results 2 P B: A B: Supplemental Table S1 n A n A Variant profiles were interrogated across tumor types to evaluate their mutational landscapes defined concurrently by stDNA and ctDNA assays. Concordant, tumor-specific mutations were identified after removal of germline and clonal hematopoiesis of indeterminate potential variants and classified against the OncoKB database for genes that play a role in cancer, excluding benign or likely neutral variants. 16 17 18 21 22 23 TERT 24 GNAS KRAS TP53 ATM Figure 6 25 , 26 PIK3CA TP53 CDH1 Figure 6 27 , 28 BARD1 ATM BRCA1 BARD1 ATM BRCA1 27 APC TP53 KRAS PIK3CA Figure 6 26 , 29 TP53 KRAS RB1 NRG TET1 MET Figure 6 26 , 30 31 TET1 PTPRT PIK3R2 TP53 RB1 Figure 6 31 TERT 32 TERT Figure 6 Figure 6 Coding gene mutations detected by solid tumor and plasma assays classified by individual tumor type and telomerase reverse transcriptase ( TERT A E: A B C D E F: TERT TERT TERT TERT Discussion A primary goal of this study was to evaluate and standardize all preanalytical variables required for comprehensive genomic profiling of cancer patient blood samples across the Allegheny Health Network. Concordance values obtained in precisely matched tumor and blood specimens after optimization of these protocols reached 97% for coding mutations and 88% for specification of interventional chemotherapy or immunotherapies using blood samples. We selected the CGP assay based on its comprehensive design and performance characterization in previous solid tumor and circulating tumor DNA studies. 33 , 34 Optimization of blood collection, transfer, and processing protocols allowed us to standardize downstream technical quality assurance/quality control protocols for evaluating cfDNA concentration, yield, and fragment size. High-resolution, microcapillary electrophoresis combined with cfDNA fluorometry was applied uniformly across all samples to quantitate cfDNA nucleosome related fractions and, in the absence of background germline DNA, utilize the 75- to 1200-bp DNA size range as a benchmark for screening cfDNA plasma concentrations across the patient population. This systematic approach assured accurate quantitation of starting substrate, resulting in successful genomic sequencing and informative diagnostic results generated from each cfDNA sample sequenced. These results were notable given that the tumor fraction of ctDNA versus normal DNA was likely changing across the specimens based on tumor type and stage and consistent with the broad range of cfDNA values that were obtained regardless of tumor type and stage. We speculate that the extra precautions taken to rapidly process samples, minimize blood cell lysis, and remove all blood cells during plasma separation contributed to dependable, high-resolution ctDNA sequencing results from each sample tested. The approach contrasted with liquid biopsy protocols that rely on volumetric standards of plasma input that may yield negative results due to large biologic variability of cfDNA concentrations or differing amounts of blood cell–derived germline DNA. The broad range of cfDNA concentrations across cancer types encountered was consistent with previous publications where methodological details were available for direct comparison to our data. 5 , 35 36 37 38 39 33 , 35 36 37 Implementing genomic assays in-house proved invaluable in controlling preanalytical variables, establishing internal quality assurance/quality control benchmarks, and reducing turnaround times. The results demonstrated efficacy of the ctDNA CGP assay for identification of clinically relevant oncogenic mutations found in the diversity of tumor types and patients treated across the integrated, community health care network. A significant advantage of the local testing approach used was the unbroken stewardship of all specimens and data within the Allegheny Health Network that comprises a critical resource for designing patient-specific, follow-up assays and represents the framework for a precision medicine initiative within the health care network. If the high fidelity of ctDNA variants in mirroring tumor content in this study extends throughout the patient treatment paradigm, longitudinal blood samples after tumor excision could serve as a biomarker bellwether of the response of residual tumor or metastases to the treatment paradigm. It remains to be determined if diminishing mutation levels or a reduced cfDNA tumor fraction represent challenges that will require higher sensitivity than NGS methods to quantitatively interrogate a patient's response to therapy and alter therapeutic choices or de-escalate treatment protocols. However, these data demonstrated that precise control and quality assurance/quality control of preanalytical variables, including rapid processing of blood samples, can deliver high concordance and acuity of ctDNA testing when performed on-site within a large community health care network. We used a uniform sequencing and analysis platform across all assays to control for variability in these complex technical processes. All samples contained clinically relevant oncogenic mutations with 60% of the tumors and 65% of the plasma samples containing at least one therapeutically actionable mutation based on the OncoKB database. We identified primary somatic mutations within genes and across individual tumor types that have been identified in other recent studies of ctDNA. 4 , 5 , 9 , 10 Disclosure Statement C.J.H. serves in a consultant/advisory role for Astra Zeneca, Biotheranostics, and Gilead; and has been on the speaker's bureau for AstraZeneca and Diiachi Sanyo. A.H.Z. serves in a consultant/advisory role for Previse, Delfi Diagnostics, Prognomiq, BilliontoOne, and Gilead; has received research funding from Eli Lilly, Prognomiq, Delfi Diagnostics, BilliontoOne, Genece Health, Exai Bio, Myriad Genetics, and Tempus; and has equity interest in Previse, TG Therapeutics, and Gritstone Bio. J.N. serves in a consultant role for AstraZeneca and Eisai Inc.; has received research funding from Myriad Genetics; and has been on the speaker's bureau for AstraZeneca, Eisai, and Merck. B.B. and E.D. are full-time employees of Illumina, Inc. C.J.A., D.L.B., R.M.B., O.C., L.B.E., P.H.G., L.G., H.K.K., T.L.L., W.A.L., P.P., P.E.S., S.P., R.S., T.R., K.M.T., and P.L.W. have no commercial relationships to declare. References 1 Cheng D.T. Mitchell T.N. Zehir A. Shah R.H. Benayed R. Syed A. Chandramohan R. Liu Z.Y. Won H.H. Scott S.N. Brannon A.R. O'Reilly C. Sadowska J. Casanova J. Yannes A. Hechtman J.F. Yao J. Song W. Ross D.S. Oultache A. Dogan S. Borsu L. Hameed M. Nafa K. Arcila M.E. Ladanyi M. Berger M.F. Memorial Sloan Kettering-Integrated Mutation Profiling of Actionable Cancer Targets (MSK-IMPACT): a hybridization capture-based next-generation sequencing clinical assay for solid tumor molecular oncology J Mol Diagn 17 2015 251 264 25801821 10.1016/j.jmoldx.2014.12.006 PMC5808190 2 Tsongalis G.J. Peterson J.D. de Abreu F.B. Tunkey C.D. Gallagher T.L. Strausbaugh L.D. Wells W.A. Amos C.I. Routine use of the Ion Torrent AmpliSeq™ cancer hotspot panel for identification of clinically actionable somatic mutations Clin Chem Lab Med 52 2014 707 714 24334431 10.1515/cclm-2013-0883 3 Diehl F. Li M. Dressman D. He Y. Shen D. Szabo S. Diaz L.A. Jr. Goodman S.N. David K.A. Juhl H. Kinzler K.W. Vogelstein B. Detection and quantification of mutations in the plasma of patients with colorectal tumors Proc Natl Acad Sci U S A 102 2005 16368 16373 16258065 10.1073/pnas.0507904102 PMC1283450 4 Rose Brannon A. Jayakumaran G. Diosdado M. Patel J. Razumova A. Hu Y. Enhanced specificity of clinical high-sensitivity tumor mutation profiling in cell-free DNA via paired normal sequencing using MSK-ACCESS Nat Commun 12 2021 3770 34145282 10.1038/s41467-021-24109-5 PMC8213710 5 Bale T.A. Yang S.R. Solomon J.P. Nafa K. Middha S. Casanova J. Sadowska J. Skakodub A. Ahmad H. Yu H.A. Riely G.J. Kris M.G. Chandarlapaty S. Rosenblum M.K. Gavrilovic I. Karajannis M.A. Pentsova E. Miller A. Boire A. Mellinghoff I. Berger M.F. Zehir A. Ladanyi M. Benayed R. Arcila M.E. Clinical experience of cerebrospinal fluid-based liquid biopsy demonstrates superiority of cell-free DNA over cell pellet genomic DNA for molecular profiling J Mol Diagn 23 2021 742 752 33781965 10.1016/j.jmoldx.2021.03.001 PMC8207471 6 Odegaard J.I. Vincent J.J. Mortimer S. Vowles J.V. Ulrich B.C. Banks K.C. Fairclough S.R. Zill O.A. Sikora M. Mokhtari R. Abdueva D. Nagy R.J. Lee C.E. Kiedrowski L.A. Paweletz C.P. Eltoukhy H. Lanman R.B. Chudova D.I. Talasaz A. Validation of a plasma-based comprehensive cancer genotyping assay utilizing orthogonal tissue- and plasma-based methodologies Clin Cancer Res 24 2018 3539 3549 29691297 10.1158/1078-0432.CCR-17-3831 7 Woodhouse R. Li M. Hughes J. Delfosse D. Skoletsky J. Ma P. Meng W. Dewal N. Milbury C. Clark T. Donahue A. Stover D. Kennedy M. Dacpano-Komansky J. Burns C. Vietz C. Alexander B. Hegde P. Dennis L. Clinical and analytical validation of FoundationOne Liquid CDx, a novel 324-gene cfDNA-based comprehensive genomic profiling assay for cancers of solid tumor origin PLoS One 15 2020 e0237802 10.1371/journal.pone.0237802 PMC7518588 32976510 8 Finkle J.D. Boulos H. Driessen T.M. Lo C. Blidner R.A. Hafez A. Khan A.A. Lozac'hmeur A. McKinnon K.E. Perera J. Zhu W. Dowlati A. White K.P. Tell R. Beaubier N. Validation of a liquid biopsy assay with molecular and clinical profiling of circulating tumor DNA NPJ Precis Oncol 5 2021 63 34215841 10.1038/s41698-021-00202-2 PMC8253837 9 Aggarwal C. Thompson J.C. Black T.A. Katz S.I. Fan R. Yee S.S. Chien A.L. Evans T.L. Bauml J.M. Alley E.W. Ciunci C.A. Berman A.T. Cohen R.B. Lieberman D.B. Majmundar K.S. Savitch S.L. Morrissette J.J.D. Hwang W.T. Elenitoba-Johnson K.S.J. Langer C.J. Carpenter E.L. Clinical implications of plasma-based genotyping with the delivery of personalized therapy in metastatic non-small cell lung cancer JAMA Oncol 5 2019 173 180 30325992 10.1001/jamaoncol.2018.4305 PMC6396811 10 Iams W.T. Mackay M. Ben-Shachar R. Drews J. Manghnani K. Hockenberry A.J. Cristofanilli M. Nimeiri H. Guinney J. Bennson A.B. Concurrent tissue and circulating tumor DNA molecular profiling to detect guideline-based targeted mutations in a multicancer cohort JAMA Netw Open 7 2024 e2351700 10.1001/jamanetworkopen.2023.51700 PMC10804266 38252441 11 Rosenberg S. Ben Cohen G. Kato S. Okamura R. Lippman S.M. Kurzrock R. Concordance between cancer gene alterations in tumor and circulating tumor DNA correlates with poor survival in a real-world precision-medicine population Mol Oncol 17 2023 1844 1856 36694946 10.1002/1878-0261.13383 PMC10483598 12 Park S. Olsen S. Ku B.M. Lee M.S. Jung H.A. Sun J.M. Lee S.H. Ahn J.S. Park K. Choi Y.L. Ahn M.J. High concordance of actionable genomic alterations identified between circulating tumor DNA-based and tissue-based next-generation sequencing testing in advanced non-small cell lung cancer: the Korean Lung Liquid versus Invasive Biopsy Program Cancer 127 2021 3019 3028 33826761 10.1002/cncr.33571 13 El Messaoudi S. Rolet F. Mouliere F. Thierry A.R. Circulating cell free DNA: preanalytical considerations Clin Chim Acta 424 2013 222 230 23727028 10.1016/j.cca.2013.05.022 14 Greytak S.R. Engel K.B. Parpart-Li S. Murtaza M. Bronkhorst A.J. Pertile M.D. Moore H.M. Harmonizing cell-free DNA collection and processing practices through evidence-based guidance Clin Cancer Res 26 2020 3104 3109 32122922 10.1158/1078-0432.CCR-19-3015 PMC7334102 15 Jahr S. Hentze H. Englisch S. Hardt D. Fackelmayer F.O. Hesch R.D. Knippers R. DNA fragments in the blood plasma of cancer patients: quantitations and evidence for their origin from apoptotic and necrotic cells Cancer Res 61 2001 1659 1665 11245480 16 Chakravarty D. Gao J. Phillips S.M. Kundra R. Zhang H. Wang J. OncoKB: a precision oncology knowledge base JCO Precis Oncol 2017 2017 00011 10.1200/PO.17.00011 PMC5586540 28890946 17 Suehnholz S.P. Nissan M.H. Zhang H. Kundra R. Nandakumar S. Lu C. Carrero S. Dhaneshwar A. Fernandez N. Xu B.W. Arcila M.E. Zehir A. Syed A. Brannon A.R. Rudolph J.E. Paraiso E. Sabbatini P.J. Levine R.L. Dogan A. Gao J. Ladanyi M. Drilon A. Berger M.F. Solit D.B. Schultz N. Chakravarty D. Quantifying the expanding landscape of clinical actionability for patients with cancer Cancer Discov 14 2024 49 65 37849038 10.1158/2159-8290.CD-23-0467 PMC10784742 18 Yaung S.J. Fuhlbrück F. Peterson M. Zou W. Palma J.F. Patil N.S. Jiang Y. Clonal hematopoiesis in late-stage non-small-cell lung cancer and its impact on targeted panel next-generation sequencing JCO Precis Oncol 4 2020 1271 1279 35050787 10.1200/PO.20.00046 19 Shreffler J. Huecker M.R. Diagnostic testing accuracy: sensitivity, specificity, predictive values and likelihood Ratios [Updated 2023 Mar 6] StatPearls [Internet] 2024 StatPearls Publishing Treasure Island, FL https://www.ncbi.nlm.nih.gov/books/NBK557491/ 32491423 20 Noll M. Internal structure of the chromatin subunit Nucleic Acids Res 1 1974 1573 1578 10793712 10.1093/nar/1.11.1573 PMC343436 21 Vogelstein B. Papadopoulos N. Velculescu V.E. Zhou S. Diaz L.A. Jr. Kinzler K.W. Cancer genome landscapes Science 339 2013 1546 1558 23539594 10.1126/science.1235122 PMC3749880 22 Dressler L. Bortolomeazzi M. Keddar M.R. Misetic H. Sartini G. Acha-Sagredo A. Montorsi L. Wijewardhane N. Repana D. Nulsen J. Goldman J. Pollitt M. Davis P. Strange A. Ambrose K. Ciccarelli F.D. Comparative assessment of genes driving cancer and somatic evolution in non-cancer tissues: an update of the Network of Cancer Genes (NCG) resource Genome Biol 23 2022 35 35078504 10.1186/s13059-022-02607-z PMC8790917 23 Sinkala M. Mutational landscape of cancer-driver genes across human cancers Sci Rep 13 2023 12742 10.1038/s41598-023-39608-2 PMC10406856 37550388 24 Dratwa M. Wysoczańska B. Łacina P. Kubik T. Bogunia-Kubik K. TERT-regulation and roles in cancer formation Front Immunol 11 2020 589929 10.3389/fimmu.2020.589929 PMC7717964 33329574 25 Lee E.Y. Muller W.J. Oncogenes and tumor suppressor genes Cold Spring Harb Perspect Biol 2 2010 a003236 10.1101/cshperspect.a003236 PMC2944361 20719876 26 Myint K.Z.Y. Shimabuku M. Horio R. Kaneda M. Shimizu Y. Taguchi J. Identification of circulating tumour DNA (ctDNA) from the liquid biopsy results: findings from an observational cohort study Cancer Treat Res Commun 35 2023 100701 10.1016/j.ctarc.2023.100701 37094468 27 LaFramboise W.A. Pai R.K. Petrosko P. Belsky M.A. Dhir A. Howard P.G. Becich M.J. Holtzman M.P. Ahrendt S.A. Pingpank J.F. Zeh H.J. Dhir R. Bartlett D.L. Choudry H.A. Discrimination of low- and high-grade appendiceal mucinous neoplasms by targeted sequencing of cancer-related variants Mod Pathol 32 2019 1197 1209 30962504 10.1038/s41379-019-0256-2 28 Constantin M. Mătanie C. Petrescu L. Bolocan A. Andronic O. Bleotu C. Mitache M.M. Tudorache S. Vrancianu C.O. Landscape of genetic mutations in appendiceal cancers Cancers (Basel) 15 2023 3591 37509254 10.3390/cancers15143591 PMC10377024 29 Slattery M.L. Herrick J.S. Mullany L.E. Samowitz W.S. Sevens J.R. Sakoda L. Wolff R.K. The co-regulatory networks of tumor suppressor genes, oncogenes, and miRNAs in colorectal cancer Genes Chromosomes Cancer 56 2017 769 787 28675510 10.1002/gcc.22481 PMC5597468 30 Chevallier M. Borgeaud M. Addeo A. Friedlaender A. Oncogenic driver mutations in non-small cell lung cancer: past, present and future World J Clin Oncol 12 2021 217 237 33959476 10.5306/wjco.v12.i4.217 PMC8085514 31 Nacev B.A. Sanchez-Vega F. Smith S.A. Antonescu C.R. Rosenbaum E. Shi H. Clinical sequencing of soft tissue and bone sarcomas delineates diverse genomic landscapes and potential therapeutic targets Nat Commun 13 2022 3405 35705560 10.1038/s41467-022-30453-x PMC9200818 32 Tornesello M.L. Cerasuolo A. Starita N. Amiranda S. Bonelli P. Tuccillo F.M. Buonaguro F.M. Buonaguro L. Tornesello A.L. Reactivation of telomerase reverse transcriptase expression in cancer: the role of TERT promoter mutations Front Cell Dev Biol 11 2023 1286683 10.3389/fcell.2023.1286683 PMC10684755 38033865 33 Conroy J.M. Pabla S. Glenn S.T. Seager R.J. Van Roey E. Gao S. Burgher B. Andreas J. Giamo V. Mallon M. Lee Y.H. DePietro P. Nesline M. Wang Y. Lenzo F.L. Klein R. Zhang S. A scalable high-throughput targeted next-generation sequencing assay for comprehensive genomic profiling of solid tumors PLoS One 16 2021 e0260089 10.1371/journal.pone.0260089 PMC8639101 34855780 34 Harter J. Buth E. Johaenning J. Battke F. Kopp M. Zelba H. Schulze M. Koedding J. Biskup S. Analytical performance evaluation of a 523-gene circulating tumor DNA assay for next-generation sequencing-based comprehensive tumor profiling in liquid biopsy samples J Mol Diagn 26 2024 61 72 37865292 10.1016/j.jmoldx.2023.10.001 35 Perkins G. Yap T.A. Pope L. Cassidy A.M. Dukes J.P. Riisnaes R. Massard C. Cassier P.A. Miranda S. Clark J. Denholm K.A. Thway K. Gonzalez De Castro D. Attard G. Molife L.R. Kaye S.B. Banerji U. de Bono J.S. Multi-purpose utility of circulating plasma DNA testing in patients with advanced cancers PLoS One 7 2012 e47020 10.1371/journal.pone.0047020 PMC3492590 23144797 36 Bettegowda C. Sausen M. Leary R.J. Kinde I. Wang Y. Agrawal N. Detection of circulating tumor DNA in early- and late-stage human malignancies Sci Transl Med 6 2014 224ra24 10.1126/scitranslmed.3007094 PMC4017867 24553385 37 Kowal-Wisniewska E. Jaskiewicz K. Bartochowska A. Kiwerska K. Ustaszewski A. Gorecki T. Giefing M. Paluszczak J. Wierzbicka M. Jarmuz-Szymczak M. Towards effectiveness of cell free DNA based liquid biopsy in head and neck squamous cell carcinoma Sci Rep 14 2024 2251 38278927 10.1038/s41598-024-52031-5 PMC10817923 38 Mouliere F. El Messaoudi S. Pang D. Dritschilo A. Thierry A.R. Multi-marker analysis of circulating cell-free DNA toward personalized medicine for colorectal cancer Mol Oncol 8 2014 927 941 24698732 10.1016/j.molonc.2014.02.005 PMC5528519 39 Liu H. Gao Y. Vafaei S. Gu X. Zhong X. The prognostic value of plasma cell-free DNA concentration in the prostate cancer: a systematic review and meta-analysis Front Oncol 11 2021 599602 10.3389/fonc.2021.599602 PMC7991303 33777743 Supplemental Data  Supplemental Figure S1 Schematic of substrate processing workflow and timelines. The individual columns delineate major steps and timeframes for processing the plasma, buffy coat cells, and tumor tissue derived from formalin-fixed, paraffin-embedded (FFPE), tumor tissue blocks (see Materials and Methods Supplemental Figure S2 Distribution of plasma samples in the Allegheny Health Network Cancer Institute Biorepository. Horizontal bars delineate the numbers of unique patients collected for each cancer type indicated on the vertical axis from March 1, 2021, until March 1, 2025, from a total of 7155 unique patients. Each patient provided an initial, diagnostic whole blood sample (three Streck cell-free DNA BCT Tubes) that was processed to plasma for storage in our –80 0 Supplemental Figure S3 Blood to plasma processing times. Vertical bars indicate the number of blood samples processed to plasma at each hourly time point from inception of the Biobank to March 1, 2025, with the 0 time point representing the time of the blood draw. These data include longitudinal samples obtained from patients that were collected and transported in the same manner as initial diagnostic samples. Eighty percent of blood samples (80.3%) were processed to plasma within 29 hours of the patient blood draw, and 96.1% were completed by 72 hours. Supplemental Figure S4 Variant detection and distribution in concordance samples. Vertical bars indicate the number of overall variants found in the 430 matched tumor tissue and cell-free DNA samples that underwent sequencing in this study. Individual bins indicate the number of variants detected in samples with each bin increasing in variant number across the range we detected. The circulating tumor DNA variant frequencies and concordance values obtained after sequencing did not conform to a normal distribution (Kolmogorov-Smirnov: P Supplemental Table 1 Author Contributions B.B., D.L.B., O.C., E.D., W.A.L., P.P., R.S., P.L.W., and A.H.Z. conceived the study, interpreted all data, and wrote the manuscript; C.J.A., D.L.B., L.B.E., C.J.H., W.A.L., J.N., S.P., P.P., K.M.T., and P.L.W. evaluated patients and clinical data for study selection and analyzed pathology samples for inclusion; B.B., D.L.B., E.D., L.B.E., L.G., P.H.G., H.K.K., C.J.H., S.P., P.P., P.E.S., R.S., and A.H.Z. provided technical and material support for all sequencing studies and the cloud-based informatics database and analytical pipeline; R.M.B., L.G., P.H.G., T.L.L., P.P., S.P., and K.M.T. optimized sample preparation method, developed quality assurance/quality control analysis, and performed technical validation, collection, and processing of all samples and primary data; C.J.A., O.C., L.G., P.H.G., H.K.K., W.A.L., J.N., P.P., T.R., P.E.S., R.S., and K.M.T. established multiple analytical pipelines and performed interrogation of clinical and genomic databases, including primary through tertiary analysis of genomics results; O.C., H.K.K., W.A.L., T.R., P.E.S., R.S., and P.L.W. performed statistical analysis and interpreted differential data sets; and all authors read and approved the final manuscript. This work was performed as part of the AHNCI Moonshot Biomarker Program and supported in part by Highmark Health. Also supported in part by a Johns Hopkins–AHN Cancer Research Alliance grant (C.J.H., W.A.L., and J.N.), Pittsburgh Cure Sarcoma Foundation 10.13039/100000945 Pittsburgh Foundation 10.13039/100025561 Glimmer of Hope Foundation 10.13039/100013778 Appendix Cancer Pseudomyxoma Peritonei Research Foundation 10.13039/100014150 Claude Worthington Benedum Foundation The funding sources had no role in the study design, data collection, analysis, interpretation of the data and in the writing of the manuscript. The content is solely the responsibility of the authors and does not necessarily represent the official views of the NIH. Supplemental material for this article can be found at https://doi.org/10.1016/j.jmoldx.2025.05.007 ",
  "metadata": {
    "Title of this paper": "The prognostic value of plasma cell-free DNA concentration in the prostate cancer: a systematic review and meta-analysis",
    "Journal it was published in:": "The Journal of Molecular Diagnostics : JMD",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489365/"
  }
}