{
  "title": "Paper_46",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490220 PMC12490220.1 12490220 12490220 40829595 10.1016/j.xcrm.2025.102301 S2666-3791(25)00374-X 102301 1 Article Clinical and molecular dissection of CAR T cell resistance in pancreatic cancer Aznar M. Angela 1 2 17 Good Charly R. 3 17 Barber-Rotenberg Julie S. 1 Agarwal Sangya 1 15 Wilson Wesley 1 Watts Alex 4 Zhang Zhen 3 Gonzales Donna 1 Donahue Greg 3 Hwang Wei-Ting 4 Rennels Austin K. 1 Rech Andrew J. 1 Kuramitsu Shunichiro 1 16 Huang Hua 3 13 14 Glastad Karl M. 3 Alexander Katherine A. 3 Plesa Gabriela 1 Dowd Emily 1 Brennan Andrea 1 Siegel Donald L. 1 2 Tanyi Janos 5 6 Haas Andrew 5 7 Torigian Drew A. 5 8 Nadolski Gregory 5 8 Gonzalez Vanessa E. 1 Hexner Elizabeth O. 1 9 Fraietta Joseph A. 1 2 5 10 Jadlowsky Julie K. 1 Young Regina M. ryoung@upenn.edu 1 2 11 18 ∗ Berger Shelley L. bergers@pennmedicine.upenn.edu 3 18 ∗∗ June Carl H. cjune@upenn.edu 1 2 11 18 19 ∗∗∗ O’Hara Mark H. mark.ohara@pennmedicine.upenn.edu 5 12 18 ∗∗∗∗ 1 2 3 4 5 6 7 8 9 10 11 12 13 14 ∗ ryoung@upenn.edu ∗∗ bergers@pennmedicine.upenn.edu ∗∗∗ cjune@upenn.edu ∗∗∗∗ mark.ohara@pennmedicine.upenn.edu 15 Present address: Center for Personal Dynamic Regulomes, Stanford University School of Medicine, Stanford, CA 94305, USA 16 Present address: Department of Neurosurgery, National Hospital Organization Nagoya Medical Center, Nagoya 460-0001, Japan 17 These authors contributed equally 18 These authors contributed equally 19 Lead contact 16 9 2025 18 8 2025 6 9 498186 102301 15 11 2024 29 5 2025 23 7 2025 18 08 2025 03 10 2025 03 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article under the CC BY-NC license (http://creativecommons.org/licenses/by-nc/4.0/). Summary Patients with advanced pancreatic ductal adenocarcinoma (PDAC) have a median survival of less than a year, highlighting the urgent need for treatment advancements. We report on a phase 1 clinical trial assessing the safety and feasibility of intravenous and local administration of anti-mesothelin CAR T cells in patients with advanced PDAC. While therapy is well tolerated, it demonstrates limited clinical efficacy. Analyses of patient samples provide insights into mechanisms of treatment resistance. Single-cell genomic approaches reveal that post-infusion CAR T cells express exhaustion signatures, including previously identified transcription factors ID3 and SOX4, and display enrichment for a GZMK + NCT03323944 Graphical abstract Highlights • Anti-mesothelin CAR T therapy is well tolerated in advanced PDAC but shows limited efficacy • Transcriptomic analyses reveal that patient CAR T cells are dysfunctional • ID3 and SOX4 double-knockout CAR T cells elicited prolonged relapse-free survival in vivo Aznar and Good et al. report a phase 1 trial of anti-mesothelin CAR T cells in pancreatic cancer, demonstrating safety but limited efficacy. Locally delivered CAR T cells exhibit GZMK + in vivo Keywords CAR T cells clinical trial pancreatic cancer T cell dysfunction immunotherapy T cell exhaustion single-cell RNA-seq cancer ID3 SOX4 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: August 18, 2025 Introduction Combination chemotherapy is the standard of care for metastatic pancreatic ductal adenocarcinoma (PDAC), but the overall benefit is marginal, and PDAC remains one of the most lethal malignancies. 1 , 2 , 3 4 , 5 , 6 7 , 8 9 , 10 , 11 , 12 10 , 13 14 , 15 Our group has performed several phase 1 clinical trials evaluating MSLN-directed CAR T cells. First, we treated patients with chemotherapy-refractory metastatic PDAC with T lymphocytes electroporated with the murine anti-human MSLN ScFv SS-1 mRNA. This yielded a transient expression of the CAR and was associated with stable disease as the best response in two of five patients treated. 16 NCT02159716 17 Current challenges limiting the efficacy of CAR T cell therapy for solid tumors include a hostile tumor microenvironment (TME), tumor heterogeneity, poor CAR T cell trafficking, T cell exhaustion and persistence, and the need for robust tumor-specific targets. 18 19 , 20 , 21 22 23 24 , 25 , 26 24 , 27 Developing synthetically enhanced CAR T cell therapies for solid tumors offers a promising strategy to overcome CAR T cell dysfunction. 28 in vitro 26 , 29 , 30 , 31 in vitro in vitro. 26 Here, we report the clinical results of a phase 1 study of huCART-meso cells in patients with metastatic PDAC. To better understand responses, we report correlative analyses of blood, ascites fluid, and paired pre- and post-treatment biopsies of assessable metastases. We coupled these results with in vivo in vivo Results Efficacy of huCART-meso cell therapy is limited This was a phase 1, single-institution trial (ClinicalTrials.gov: NCT03323944 7 2 Figure 1 Table S1 Figure 1 huCART-meso cells are tolerated and safe in a patient population with minimal cell expansion and cytokine response (A) Protocol schema for screening, apheresis, T cell manufacture, treatment with huCART-meso cells, and follow-up. i.v., intravenous; i.p., intraperitoneal, i.h.; intrahepatic. (B and C) (B) Overall survival and (C) progression-free survival of patients enrolled on the trial. (D) huCART-meso cell engraftment in peripheral blood by qPCR-based detection of CAR-specific sequences in genomic DNA. (E) huCART-meso cell expansion in pre- and post-infusion biopsy tissue samples by qPCR. Wilcoxon matched-pairs signed rank test, n (F) Heatmap grouped by cohort depicting fold changes in proinflammatory cytokine production from baseline/pre-CAR T cell infusion to the peak cytokine level post infusion. IL-2 levels for patient 07 were below the range of detection of the assay and are indicated as “X” in the figure. See also Figure S1 Table S1 All patients received the protocol-specified dose of huCART-meso cells. All adverse events are summarized in Table 1 32 Table 1 All adverse events Toxicity category Grade 1 Grade 2 Grade 3 Grade 4 Grade 5 Total Blood and lymphatic system disorders 0 3 5 0 0 8 Anemia 0 3 4 0 0 7 Disseminated intravascular coagulation 0 0 1 0 0 1 Cardiac disorders 1 1 0 0 0 2 Atrial fibrillation 0 1 0 0 0 1 Sinus tachycardia 1 0 0 0 0 1 Eye disorders 0 1 0 0 0 1 Blurred vision 0 1 0 0 0 1 Gastrointestinal disorders 4 8 5 0 1 18 Abdominal pain 1 2 0 0 0 3 Ascites 0 1 1 0 0 2 Constipation 0 2 0 0 0 2 Diarrhea 1 1 0 0 0 2 Duodenal obstruction 0 0 0 0 1 1 Gastrointestinal disorders – other (tongue white) 0 1 0 0 0 1 Gastroparesis 0 1 0 0 0 1 Ileal obstruction 0 0 1 0 0 1 Nausea 1 0 0 0 0 1 Obstruction gastric 0 0 2 0 0 2 Upper gastrointestinal hemorrhage 0 0 1 0 0 1 Vomiting 1 0 0 0 0 1 General disorders and administration site conditions 5 3 3 0 4 15 Fatigue 1 3 2 0 0 6 Fever 2 0 0 0 0 2 General disorders and administration site conditions – other (disease progression) 0 0 0 0 4 4 General disorders and administration site conditions – other (generalized edema) 0 0 1 0 0 1 General disorders and administration site conditions – other (night sweats) 1 0 0 0 0 1 Pain 1 0 0 0 0 1 Hepatobiliary disorders 0 1 1 0 0 2 Hepatic failure 0 0 1 0 0 1 Portal vein thrombosis 0 1 0 0 0 1 Immune system disorders 1 1 0 0 0 2 Cytokine release syndrome 1 1 0 0 0 2 Infections and infestations 0 1 2 1 1 5 Infections and infestations – other (thrush) 0 1 0 0 0 1 Lung infection 0 0 1 0 0 1 Peritoneal infection 0 0 0 0 1 1 Sepsis 0 0 1 1 0 2 Injury, poisoning, and procedural complications 2 3 0 0 0 5 Injury, poisoning, and procedural complications – other (citrate reaction) 2 3 0 0 0 5 Investigations 8 5 8 3 0 24 Alanine aminotransferase increased 2 0 0 0 0 2 Alkaline phosphatase increased 0 0 1 0 0 1 Aspartate aminotransferase increased 0 1 0 0 0 1 Blood bilirubin increased 0 1 1 0 0 2 Creatinine increased 2 0 0 0 0 2 Fibrinogen decreased 1 0 0 0 0 1 INR increased 1 1 0 0 0 2 Lymphocyte count decreased 1 1 4 2 0 8 Neutrophil count decreased 0 0 1 0 0 1 Platelet count decreased 0 0 1 1 0 2 White blood cell decreased 1 1 0 0 0 2 Metabolism and nutrition disorders 9 12 5 0 0 26 Anorexia 1 3 0 0 0 4 Dehydration 0 3 0 0 0 3 Hyperglycemia 0 0 1 0 0 1 Hyperuricemia 1 0 0 0 0 1 Hypoalbuminemia 2 5 0 0 0 7 Hypocalcemia 2 0 0 0 0 2 Hypokalemia 0 1 1 0 0 2 Hyponatremia 3 0 2 0 0 5 Tumor lysis syndrome 0 0 1 0 0 1 Musculoskeletal and connective tissue disorders 1 4 0 0 0 5 Back pain 0 3 0 0 0 3 Bone pain 0 1 0 0 0 1 Flank pain 1 0 0 0 0 1 Nervous system disorders 3 1 3 0 0 7 Encephalopathy 0 0 1 0 0 1 Headache 2 0 0 0 0 2 Nervous system disorders – other (confusion, expressive aphasia secondary to brain metastases) 0 0 1 0 0 1 Nervous system disorders – other (foot drop) 1 0 0 0 0 1 Paresthesia 0 1 0 0 0 1 Stroke 0 0 1 0 0 1 Psychiatric disorders 2 3 0 0 0 5 Anxiety 0 1 0 0 0 1 Confusion 1 1 0 0 0 2 Delirium 1 1 0 0 0 2 Renal and urinary disorders 0 0 0 0 1 1 Acute kidney injury 0 0 0 0 1 1 Respiratory, thoracic, and mediastinal disorders 2 2 5 0 0 9 Cough 1 0 0 0 0 1 Dyspnea 1 0 1 0 0 2 Hypoxia 0 2 4 0 0 6 Skin and subcutaneous tissue disorders 1 0 0 0 0 1 Skin and subcutaneous tissue disorders – other (raised areas underneath skin) 1 0 0 0 0 1 Vascular disorders 4 2 1 1 0 8 Flushing 1 0 0 0 0 1 Hematoma 2 0 0 0 0 2 Hypotension 0 1 1 1 0 3 Thromboembolic event 1 1 0 0 0 2 Total 43 51 38 5 7 144 Clinical activity of huCART-meso in metastatic PDAC was limited. All nine subjects received the target dose of huCART-meso cells and were thus considered evaluable for response. In cohort 1 (i.v.), the best response was stable disease by Response Evaluation Criteria in Solid Tumors version 1.1 (RECIST1.1) 33 Table 2 Figure 1 Figure 1 Table 2 Response data of patients Subject ID Cohort Days post infusion Total target tumor response Total non-target tumor response Overall tumor response Patient 01 1 day 28 stable disease progressive disease progressive disease Patient 02 1 day 28 stable disease progressive disease progressive disease Patient 03 1 day 28 stable disease stable disease stable disease Patient 03 1 month 3 progressive disease progressive disease progressive disease Patient 04 2 day 23 progressive disease not evaluable progressive disease Patient 05 2 day 25 progressive disease progressive disease progressive disease Patient 06 3 day 28 progressive disease progressive disease progressive disease Patient 06 3 month 3 progressive disease progressive disease progressive disease Patient 07 3 day 27 progressive disease progressive disease progressive disease Patient 08 3 day 19 progressive disease stable disease progressive disease Patient 09 3 day 25 progressive disease progressive disease progressive disease The post-infusion kinetics of peripheral huCART-meso cell expansion and persistence are displayed in Figure 1 Figure S1 Figure 1 Figure S1 + The kinetics of serum cytokines for 31 different analytes were assessed ( Figure S1 Figure 1 Cellular analyses reveal a cold-tumor phenotype and limited T cell infiltration in the metastases of locally infused patients Tumor tissue from metastatic lesions and peritoneal fluid were collected in patients for further analysis ( Table 3 + + + + − + + + − + + − + + + + Figure S2 + Figures S2 + Figure S2 p p p Figure S2 Figure S2 Figure S2 Figure S2 26 , 34 Table 3 Samples collected from patients Cohort Subject ID Sample type Trial time point Analysis performed C2 (intraperitoneal) patient 04 peritoneal fluid day 0, day 7 flow cytometry C2 (intraperitoneal) patient 04 peritoneal fluid day 7 scRNA-seq C2 (intraperitoneal) patient 05 peritoneal Met (FNA) day 0, day 14 flow cytometry C2 (intraperitoneal) patient 05 peritoneal fluid day 26 scRNA-seq C3 (intrahepatic) patient 06 liver met (FNA) day 0, day 14 flow cytometry C3 (intrahepatic) patient 07 liver met (FNA) day 0, day 14 flow cytometry C3 (intrahepatic) patient 08 liver met (FNA) day 0 flow cytometry C3 (intrahepatic) patient 09 liver met (FNA) day 0, day 14 flow cytometry FNA, fine needle aspirate; C2, cohort 2; C3, cohort 3; Met, metastasis. MSLN protein levels were assessed in patients 05, 07, and 09 by flow cytometry ( Figures S2 + + Figures S2 + + Figures S2 huCART-meso cells acquire an exhausted T cell phenotype after infusion into the ascites fluid To better characterize the intratumoral huCART-meso cells, we collected ascites fluid from patients 04 and 05 (cohort 2) following i.p. infusion ( Figure 2 Figure 2 Figure S2 Figures 2 + Figures S2 Figure 2 Figure 2 35 35 , 36 37 Figure 2 38 39 , 40 + + 41 42 41 Figure 2 + Figure 2 + Figure 2 Figure 2 Locally delivered huCART-meso cells are enriched for GzmK + (A) Summary of the samples collected for flow cytometry and scRNA-seq analyses. (B) Representative flow cytometry plot of patient 04 showing detection of peritoneal fluid infiltrating CD3 + (C and D) CAR detection performed by qPCR on peripheral blood (left) and peritoneal fluid (right) of patient 04 (C) and patient 05 (D). (E) UMAP projection of scRNA-seq data from sorted CD3 + + (F) huCART-meso expression associated with (E). (G) Distribution of huCAR-meso+ (CARpos) and endogenous CAR-negative T cells (CARneg) across cell type clusters defined in (E). Unknown cluster from (E) was excluded. The y n p p p (H) Expression of the 30-gene CAR T dysfunction signature 26 + (I) Gene expression levels of huCART-meso, SOX4, ID3, SRGAP3, NDFIP2, CTLA4, TNFRSF9, PDCD1, HAVCR2, and TIGIT in CARpos (left, red) and CARneg cells (right, green). CARneg cells were randomly downsampled to have an equal number of CARpos and CARneg cells for analyses in (G)–(I). See also Figure S2 In our previous study, 26 in vitro Figure 2 Figure 2 Figure 2 Figure 2 26 in vitro in vivo. 26 Donor characteristics influence the in vivo Our previous findings systematically investigated the drivers of CAR T cell exhaustion; we found that the transcriptional regulators ID3 and SOX4 were upregulated following chronic antigen exposure and that genetic deletion of each transcription factor demonstrated improved cytotoxicity compared to wild-type (WT) CAR T cells in chronic activation settings in vitro. 26 in vitro 26 To evaluate whether ID3KO and SOX4KO huCART-meso cells have improved in vivo Figures S3 Figure S3 3 Figure 3 in vivo Figure 3 6 Figure 3 Figure 3 Figure 3 Figure 3 in vivo Table S2 in vivo Figure 3 Figure 3 Figure 3 Single KO of ID3KO or SOX4KO in huCART-meso cells induces variable antitumor primary responses (A) Experimental design to evaluate the efficacy of ID3KO and SOX4KO huCART-meso cells in AsPC-1 tumor-bearing mice. Suboptimal doses of huCART-meso cells were injected i.v. when tumors reached ∼250–300 mm 3 n (B) Tumor growth volumes of AsPC-1 tumor-bearing mice treated with 1 × 10 6 n (C) Percentage of weight loss of mice infused with UTD, WT, ID3KO, or SOX4KO ND561 huCART-meso cells; mean ± SEM. (D) Tumor growth profiles of a representative good (ND539), intermediate (ND582), and non-responder (ND602) compared to mice treated with WT (black) or SOX4KO huCART-meso cells (green). 1 × 10 6 5 n (E) Tumor volumes of representative WT and SOX4KO huCART- meso n n n (F) Post-expansion phenotype huCART-meso cells derived from healthy donors. ∗∗∗∗ p p p Figure S3 Table S2 Taken together, single SOX4 and, to a lesser extent, single ID3KO CAR T cells improve efficacy in vivo. Mice injected with single KO of SOX4 or ID3 eventually experience tumor recurrence Some WT and KO huCART-meso-treated mice that initially cleared tumors relapsed at the primary tumor site, beginning approximately 2 months after CAR T infusion ( Figures S3 Figure 4 Figure 4 Figure 3 Figure 4 Figure 4 Figure S4 Figure 4 + Figure 4 − + Figure 4 Figure 4 Mice injected with single KO of SOX4 or ID3 eventually experience tumor recurrence (A) Experimental design for recurrent tumor model. (B) KO efficiency in sorted T cells from relapsing tumors. Each dot represents a technical replicate (independent sequencing for KO assessment from one mouse per group); mean ± SEM. (C) CD3 + + + + n (D) Total number of MSLN + + n (E) UMAP projection of scRNA-seq data from recurrent TILs harvested from mice injected with WT CAR T cells (ND561, n n (F) UMAP projection with broad T cell subsets labeled. NK-like T cells clustered on the left (cluster 2) and all other clusters were defined as GZMK + (G) huCART-meso expression in recurrent tumor TILs. (H) Cluster distribution depicting the frequency that WT and SOX4KO-injected recurrent tumor TILs were found within the broad clusters defined in (F). y (I) Gene expression levels of TNFRSF9, TIGIT, LAG3, and HAVCR2 in recurrent tumor CARpos TILs extracted from mice injected with WT and SOX4KO CAR T cells. ∗∗∗∗ p p Figure S4 To investigate mechanisms underlying tumor recurrence, we sorted the CD8 + Figures 4 S4 Figure 4 Figure 4 + Figure 4 + Figure S4 Figure S4 + 43 Figure S4 Figure S4 in vitro Figure S4 Figure 4 In the recurrent tumor model, SOX4KO CAR T cells did not protect against tumor recurrence compared to WT CAR T cells ( Figure S3 Figure 4 Figure 4 in vivo Double KO of SOX4 and ID3 in huCART-meso cells provides sustained protection against tumor recurrence Considering that both ID3 and SOX4 were upregulated in exhausted cells and the single-KO CAR T cells experienced tumor relapse, we sought to investigate whether simultaneous KO of SOX4 and ID3 genes would improve antitumor responses and long-term protection from relapse. We generated WT, single-KO, and double-KO (DKO) CAR T cells from seven healthy donors and achieved high levels of editing efficiency ( Figure S5 Figure 5 Figure S5 Figure 5 Figure 5 Double KO of SOX4 and ID3 in huCART-meso cells provides sustained protection against tumor recurrence (A) Population doublings, viability, and average cell volume of ND584 WT, ID3KO, SOX4KO, and DKO huCART-meso (solid lines) and un-transduced cells (UTD) (dashed lines). (B) Post-expansion phenotype characterization using flow cytometry of huCART-meso DKO cells derived from healthy donors; mean ± SEM. Each dot represents one donor, n (C) Tumor growth volumes of AsPC-1 tumor-bearing mice treated with suboptimal doses of UTD ( n 5 n (D) Percentage of weight loss of mice shown in (C), mean ± SEM. (E) Experimental design for relapse analyses in AsPC-1 tumor-bearing xenografts treated with curative doses of WT, ID3KO, SOX4KO, and DKO huCART-meso cells (1 × 10 6 (F) Individual tumor volumes of mice cured with ND528 UTD, WT, ID3KO, SOX4KO, and DKO huCART-meso cells until 4 months after infusion (day 123). (G) Individual tumor volumes of mice treated with curative doses of ND528 and ND584 WT, ID3KO, SOX4KO, and DKO huCART-meso cells at the end of the study or last seen, whatever comes first; Kruskal-Wallis plus Dunn’s test (mean ± SEM). (H) Relapse-free survival (RFS) plot for mice treated with WT, ID3KO, SOX4KO, or DKO huCART-meso cells. Plot represents RFS of all groups combined (ND528 + ND584, n (I) RFS analysis by treatment group. Based on Kaplan-Meier method, median RFS for the WT group ( n n n n ∗∗ p p Figure S5 To assess the antitumor efficacy of DKO CAR T cells, suboptimal doses of WT, single-KO, or DKO CAR T cells were injected into AsPC-1 tumor-bearing mice. DKO CAR T cells demonstrated comparable antitumor efficacy to single KOs at suboptimal doses (ND584, 5 × 10 5 Figure 5 Figure 5 Figure 5 6 Figure 5 Figure S5 Figure 5 in vivo Figures 5 Table 4 Table 4 Relapse-free survival Characteristic N Event N Median survival Overall 170 51 NR (NE, NE) Treatment WT 42 17 111 (86, NE) ID3KO 42 18 115 (100, NE) SOX4KO 43 12 NR (100, NE) DKO 43 4 NR (NE, NE) N N Discussion This phase 1 study investigated the safety and feasibility of huCART-meso therapy in patients with advanced PDAC and found limited clinical response. Given this, we conducted an in-depth analysis of tumor-infiltrating CAR T cells from patients with PDAC to understand resistance mechanisms in the pancreatic cancer microenvironment, providing valuable insights into their behavior in solid tumors. Following our prior work with murine-derived anti-MSLN SS1 CAR T cells, 16 , 17 44 45 , 46 32 Despite encouraging safety results, the best response observed was transient stable disease in a single patient of cohort 1. This limited clinical efficacy could be explained by a number of factors. First, huCART-meso cells are present at low to moderate levels in blood and tumor metastases, with limited expansion with subsequent infusions. Second, although we confirmed CAR T cell trafficking into metastases following hepatic artery infusion (consistent with prior reports using i.h. delivery 47 48 , 49 16 , 17 50 We observed a decrease in MSLN + + 51 Consistent with previous reports, we observed low infiltration of endogenous T cells at baseline in the metastases of all patients analyzed, indicative of a cold-tumor phenotype. 52 + 53 54 55 , 56 , 57 , 58 , 59 To further investigate the molecular basis of this limited efficacy, we performed scRNA-seq on post-infusion CAR T cells obtained from the peritoneal fluid. This analysis revealed a transcriptional phenotype consistent with chronic activation-induced dysfunction, including the upregulation of transcriptional regulators such as SOX4 and ID3, 26 + 60 61 , 62 41 + 63 63 , 64 64 To enhance huCART-meso efficacy, we targeted transcription factors linked to T cell exhaustion. Our previous work showed that knocking out SOX4 or ID3 improves effector function following chronic antigen stimulation in vitro 26 41 , 65 , 66 , 67 in vivo 68 , 69 70 71 , 72 73 Given heterogeneity in the single-KO phenotypes, we tested whether dual KO of ID3 and SOX4 improves CAR T effector function using xenograft mouse models. Mice treated with dual-KO CAR T cells exhibited delayed tumor relapse compared to single-KO and WT CAR T cells, suggesting a cooperative role for SOX4 and ID3 in regulating long-term responses. This supports findings that targeting multiple transcription factors simultaneously, such as NR4A family members, 30 74 , 75 in vivo Lastly, the challenging TME of PDAC likely played a significant role in the limited efficacy of huCART-meso as a monotherapy. Strategies to activate immunity in PDAC are under investigation and hold promise to boost immunotherapy results. 76 25 , 77 , 78 79 80 , 81 , 82 , 83 In conclusion, this study provides important insights into the challenges of CAR T cell therapy for PDAC. While huCART-meso therapy demonstrated a favorable safety profile, its efficacy was limited by poor persistence and low huCART-meso tumor infiltration. Future strategies, including combination therapies and transcription factor modulation, hold promise for enhancing CAR T cell function in solid tumors. Continued research in these areas will be essential to unlocking the full therapeutic potential of cell-based immunotherapies for PDAC. Limitations of the study Limited sample availability, small patient cohorts, and variability in prior treatments challenge definitive conclusions for certain aspects of our investigation. We focused on uncovering the intrinsic mechanisms driving CAR T cell exhaustion using subcutaneous xenograft models, which provide a controlled platform for assessing CAR T cell dynamics but do not fully mimic the pancreatic TME. The use of immunocompromised mice also limits the evaluation of interactions with endogenous immune cells. Future studies using orthotopic syngeneic models and tumor re-challenge experiments will be important to further validate the long-term efficacy and durability of DKO CAR T cells in more physiological settings. Despite these constraints, our in vivo Resource availability Lead contact Further information and requests for resources and reagents should be directed to and will be fulfilled by the lead contact, Dr. Carl H. June ( cjune@upenn.edu Materials availability The CAR construct will be available under a material transfer agreement upon request. The sgRNAs and primer sequences are listed in Table S3 Data and code availability  • Single-cell RNA-sequencing data generated in this study are available through GEO. The accession number is listed in the deposited data section of the key resources table • This paper does not report original code. Seurat was used to analyze scRNA-seq data; see STAR Methods • Any additional information required to reanalyze the data reported in this paper is available from the lead contact Acknowledgments We thank patients and their families for participating in this clinical trial. We thank the CCI Clinical Trials Unit; Clinical Operations, Monitoring, and Safety Teams; the Hospital of the University of Pennsylvania Apheresis Unit for PBMC collections; the Clinical Cell and Vaccine Production Facility; the Translational and Correlative Studies Laboratory; and the Product Development Lab from Penn CCI. We acknowledge the Human Immunology Core at Penn for providing human T cells. Immunohistochemistry and slide imaging have been provided by the Penn Vet Comparative Pathology Core (RRID: SCR_022438 10.13039/100017006 Abramson Cancer Center P30 CA016520 NIH Shared Instrumentation S10 OD023465-01A1 Research was supported by a SU2C-Lustgarten Foundation Translational Cancer Research Team SU2C-AACR-DT21-17 SU2C-RT6162 10.13039/100000002 NIH CA263922 American Cancer Society Post-doctoral Fellowship PF-19-202-01-DMC 10.13039/100000002 NIH P01CA214278 Parker Institute for Cancer Immunotherapy Project CJ13 BioRender.com Author contributions M.A.A. and C.R.G. designed, conducted, and analyzed experiments and wrote the manuscript. J.S.B.-R. analyzed data and co-wrote the manuscript. S.A., D.G., A.K.R., and S.K. assisted with experiments. S.A. and A.J.R. assisted with assays, analysis, and manuscript editing. A.W. and W.-T.H. performed RFS analyses. H.H., W.W., K.M.G., and G.D. assisted with bioinformatics. Z.Z. assisted with genomics assays. V.E.G. and E.O.H. contributed to resources, funding, investigation, and administration. J.T., A.H., D.A.T., and G.N. contributed to investigation. E.D., G.P., A.B., D.L.S., J.K.J., and J.A.F. contributed to investigation, methodology, and administration. C.H.J., S.L.B., R.M.Y., and M.H.O. led conceptualization, design, interpretation, analysis, and manuscript preparation. Declaration of interests J.K.J. consults for BlueWhale Bio. A.J.R. consults for Affini-T Therapeutics. C.H.J. is an inventor on patents related to CAR therapy products and may receive a portion of royalties from Kite to the University of Pennsylvania. J.A.F. receives funding from Tmunity Therapeutics and Danaher Corporation, consults for Retro Biosciences, and serves on the Scientific Advisory Boards for Cartography Bio and Shennon Biotechnologies, Inc. C.H.J. is a scientific co-founder and holds equity in Capstan Therapeutics, Dispatch Biotherapeutics, and BlueWhale Bio; serves on the board of AC Immune; and is a scientific advisor to BlueSphere Bio, Cabaletta, Carisma, Cartography, Cellares, CellCarta, Celldex, Danaher, Decheng, ImmuneSensor, Kite Pharma, Poseida, Verismo, Viracta, ViTToria, and WIRB-Copernicus Group. C.H.J. and R.M.Y. are inventors on patents and/or patent applications licensed to Novartis and Kite Pharma and may receive revenue from them. M.H.O. is a consultant for Alligator and Merus and received funding from BMS, Akamis, Genmab, Geistlich, Arcus, Celldex, Elicio, and Revolution Medicine. Declaration of generative AI and AI-assisted technologies in the writing process M.A.A. and C.R.G. used AI-assisted resources during the manuscript preparation to improve text clarity and writing efficiency. After using this tool, the authors thoroughly reviewed and edited the content as needed and take full responsibility for the content of the publication. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies anti-human CD3 Biolegend Cat# 317322; RRID: AB_2561911 anti-human CD3 Biolegend Cat# 317308; RRID: AB_571913 anti-human CD4 Biolegend Cat# 357412; RRID: AB_2565664 anti-human CD4 Biolegend Cat# 317440; RRID: AB_2562912 anti-human CD4 Biolegend Cat# 317428; RRID: AB_1186122 anti-human CD8 BD Pharmingen Cat# 560179; RRID: AB_1645481 anti-human CD8 Biolegend Cat# 344748; RRID: AB_2629584 anti-human CD14 Biolegend Cat# 301838; RRID: AB_2562909 anti-human CD45 Biolegend Cat# 304032; RRID: AB_2561357 anti-human CD45 Biolegend Cat# 304017; RRID: AB_389314 anti-human CD45 Biolegend Cat# 304028; RRID: AB_893338 anti-human CD56 Biolegend Cat# 304608; RRID: AB_314450 anti-human EpCAM Biolegend Cat# 324226; RRID: AB_2562735 anti-human EpCAM Biolegend Cat# 324238; RRID: AB_2632937 anti-human CD235a Biolegend Cat# 349104; RRID: AB_10613463 anti-human Mesothelin Biolegend Cat# 530203; RRID: AB_2571909 anti-human CD45RO Biolegend Cat# 304244; RRID: AB_2564160 anti-human CCR7 BD Pharmingen Cat# 561271; RRID: AB_10561679 anti-human IgG F(ab’)2 Jackson ImmunoResearch Cat# 109-066-006; RRID: AB_2337634 TruStain FcX™ PLUS (anti-mouse CD16/32) Antibody Biolegend Cat# 156604; RRID: AB_2783138 Human TruStain FcX™ (Fc Receptor Blocking Solution) Biolegend Cat# 422302; RRID: AB_2818986 Anti-human CD45 (CD45-LCA) Cell Signaling Technology Cat# 13917; RRID: AB_2750898 Biotinylated goat anti-human IgG F(ab’)2 Jackson ImmunoResearch Cat# 109-066-006; RRID:AB_2337634 Bacterial and virus strains One Shot™ Stbl3™ Chemically Competent E. coli Invitrogen C7373-03 Biological samples T lymphocytes from human healthy donors UPenn Human Immunology Core N/A Peritoneal fluid CCI Clinical Trials Unit/Translational and Correlative Studies Laboratory N/A Tumor biopsies (Fine needle aspirates) CCI Clinical Trials Unit/Translational and Correlative Studies Laboratory N/A Blood CCI Clinical Trials Unit/Translational and Correlative Studies Laboratory N/A Chemicals, peptides, and recombinant proteins Live/Dead Aqua ThermoFisher Cat# L34957 Zombie NIR (Biolegend) Fixable Viability Kits Biolegend Cat# 423106 Ficoll® Paque Plus Millipore Cat# GE17-1440-0 Alt-R® Cas9 Electroporation Enhancer, 10 nmol Integrated DNA Technologies Cat# 1075916 SpyFi Cas9 Aldeveron Cat# 9214 P3 Primary cell 4D-nucleofactor X Kit L Lonza Cat# V4XP-3024 OpTmizer T cell Expansion SFM Gibco Cat# A1048501 Human AB Serum GeminiBio Cat#100-512 Recombinant Human IL-7 Peprotech Cat#200-07 Recombinant Human IL-15 Peprotech Cat#200-15 DNAse I Sigma Cat#10104159001 Lipofectamine 3000 Thermo Fisher Scientific Cat#L3000015 Matrigel Membrane Matrix Corning Cat#356234 Collagenase D Sigma Cat# 11088866001 DNase I from bovine pancreas Sigma Cat# 11284932001 Ack lysing buffer Gibco Cat# A1049201 EDTA (0.5 M), pH 8.0, RNase-free Thermo Fisher Cat# AM92 61 BV421 Streptavidin Biolegend Cat# 405225 Alexa Fluor 488 Streptavidin Biolegend Cat# 405235 APC Streptavidin Biolegend Cat# 405235 Critical commercial assays NEBNext® Library Quant Kit for Illumina® New England Biolabs E7630L NextSeq 500/550 High Output Kit (75 cycles) v2.5 kit Illumina 20024906 NextSeq 500/550 High Output Kit v2.5 (150 Cycles) Illumina 20024907 Chromium Next GEM Single Cell 3′ GEM, Library & Gel Bead Kit v3.1 10X Genomics 1000128 Single Index Kit T Set A 10X Genomics 1000213 Qubit™ dsDNA HS Assay Kit ThermoFisher Q32854 BioAnalyzer High Sensitivity DNA Kit Agilent 5067–4626 DynaBeads CD3x28 (Human) ThermoFisher Cat# 11131D NucleoSpin Gel and PCR Clean-up Macherey-Nagel Cat# 74609.50 QIAGEN Plasmid Plus Maxi Kit QIAGEN Cat# 12963 EasySep™ Release Human CD45 Positive Selection Kit for Humanized Mice STEMCELL Technologies Cat# 100-0140 CountBright Absolute Counting Beads, (ThermoFisher) Thermo Fisher Cat# C36950 Milliplex Human 31-plex Millipore Cat# SPRCUS707 Milliplex Human 32-Plex Millipore Cat# SPRCUS1673 LongAmp™ Taq 2X Master Mix New England Biolabs Cat# M0287S Vacuum Filter/Storage Systems Corning Cat# 430770 Deposited data Raw and analyzed data This paper Database: GEO: GSE276061 Experimental models: Cell lines Human (female) HEK293T ATCC CRL-11268 Human (female) ASPC-1 ATCC CRL-1682 Experimental models: Organisms/strains NOD/scid/IL2rγ−/− (NSG) Jackson Laboratory Cat# 5557 Oligonucleotides See Table S3 N/A Recombinant DNA pTRPE M5BBz This paper N/A Software and algorithms R version 4.2.0 CRAN https://cran.r-project.org/ Speckle 1.2.0 (Phipson et al. 84 https://www.bioconductor.org/packages/release/bioc/html/speckle.html RStudio 2022.02.2 RStudio Team http://www.rstudio.com/ Seurat_4.3.0.1 (Butler et al. 85 86 https://satijalab.org/seurat/ Cell Ranger v3.1.0 10X Genomics https://www.10xgenomics.com/ sctransform_0.3.5 (Hafemeister and Satija 87 https://cran.r-project.org/web/packages/sctransform/index.html SeuratWrappers 0.3.0 (Butler et al. 85 86 https://satijalab.org/seurat/articles/install.html Prism v10 Software GraphPad Software https://www.graphpad.com/ FlowJo™ v10.8 Software BD Life Sciences https://www.flowjo.com Other CRISPick sgRNA designer ([2020]) The Broad Institute https://portals.broadinstitute.org/gppx/crispick/public Benchling sgRNA designer tool ( https://www.benchling.com Benchling https://benchling.com/ Synthego’s Performance Analysis ICE (short for Inference of CRISPR Edits) tool Synthego https://ice.synthego.com/ BioRender illustration design tool BioRender https://biorender.com/ Experimental model and study participant details Study participants This trial was conducted in accordance with guidelines from the United States Food and Drug Administration (FDA), the International Conference on Harmonization for Good Clinical Practice, the Declaration of Helsinki, and applicable institutional review board (IRB) requirements. The study protocol was approved by the University of Pennsylvania Institutional Review Board (IRB protocol number 827644). All patients provided written informed consent in accordance with local regulatory review. Patient samples were collected with written informed consent and ethics approval under the same IRB protocol. The Data Safety Monitoring Board provided oversight and monitored the safety of the study. The median age at study entry was 61 years (range: 45–74 years). Among the patients infused with huCART-meso cells, three (33.3%) were reported as male and six (66.7%) as female. All participants were Caucasian. Gender information was based on patient self-report. Patient characteristics are summarized in Table S1 Cell lines AsPC-1 (human cell line, female) and HEK293T (human cell line, female) cells were acquired from the American Type Culture Collection (ATCC), which reports cell line sex information. AsPC-1 cells were cultured in DMEM/F12 (1:1) (Gibco, Life Technologies), 20% fetal bovine serum (FBS), and 1% penicillin/streptomycin (Gibco, Life Technologies). HEK293T cells were maintained in RPMI-1640 (Gibco, Life Technologies) supplemented with 10% FBS, 2% HEPES (Gibco), 1% GlutaMAX (Gibco), and 1% penicillin/streptomycin. Authentication of all cell lines was regularly performed by the University of Arizona Genetics Core, and mycoplasma contamination was routinely assessed using the MycoAlert Mycoplasma Detection Kit (Lonza). Mice Animal experiments were conducted following protocols approved by the Institutional Animal Care and Use Committee of the University of Pennsylvania. Six-to eight-week-old NOD/scid/IL2rγ−/− (NSG) female mice were obtained from Jackson Laboratories and bred in the vivarium at the University of Pennsylvania under pathogen-free conditions. The mice were housed and maintained in a pathogen-free environment throughout the study. Sex was assigned based on provider information and visual inspection. Primary human T lymphocytes from healthy donors Primary T lymphocytes from healthy donors were sourced from the University of Pennsylvania Human Immunology Core, with the approval of the University of Pennsylvania Institutional Review Board (IRB protocol number 700906) All samples were deidentified to comply with HIPAA rules. Participants in the study provided written informed consent, adhering to the principles outlined in the Declaration of Helsinki, the International Conference on Harmonization’s Good Clinical Practice guidelines, and the United States Common Rule. The reported gender and age for each sample are as follows: ND539 (male, 39), ND561(male, 27), ND410 (female, 59), ND582 (female, 54), ND602 (male, 40), ND609 (male, 25), ND584 (male, 31), ND528 (male, 31). Gender information was based on donor’s self-report. Method details Lentiviral vector production The production of lentiviral vectors was conducted following previously established protocols. 88 Transduction of CAR-redirected human T cells The huCART-meso is a second-generation CAR comprising a human MSLN-binding single-chain variable fragment (scFv), and CD8α hinge and transmembrane domains fused to 4-1BB and CD3-ζ cytoplasmic signaling domains. CAR T cells were manufactured as previously described. 89 + + 6 5 Flow cytometry and sorting Fresh metastatic tissue collected by fine-needle aspiration and recurrent tumors from in vivo in vitro Patient ascites were collected and centrifuged at 500g, at 4C for 20min. Patient’s 04 sample was enriched by Ficoll Paque Plus density gradient following manufacturer’s protocol. Viable T cell counts were determined using a trypan blue stain (Invitrogen) and a Countess automated cell counter (Invitrogen). Samples were then stained in fluorescence-activated cell sorting (FACS) buffer, which consisted of PBS (Gibco), 0.5% bovine serum albumin (BSA) (GEMINI), 2 mM EDTA (Invitrogen), and 100 μg/mL DNase (Roche). To calculate absolute cell counts in cell suspensions, CountBrightTM Absolute Counting Beads (ThermoFisher) were used as an internal standard following the manufacturer’s instructions. Antibodies for surface staining are detailed in the key resources table key resources table Live/dead staining was performed using Live/Dead Aqua (Life Technologies) or Zombie NIR (Biolegend) Fixable Viability Kits according to the manufacturer’s protocol, followed by cell surface staining for 15 min at 4°C in the dark. Samples were analyzed on an LSRII Fortessa and BD Symphony A5 Flow Cytometers (BD Biosciences) and processed using FlowJo v10 software (FlowJo, LLC). Sorting assays were performed using a FACS Aria Fusion Cytometer (BD Biosciences). Clinical trial design This was a single-center, single-arm phase 1 study designed to evaluate the safety and feasibility of both intravenous and local administration of lentivirally transduced huCART-meso cells in patients with histologically confirmed unresectable or metastatic pancreatic adenocarcinoma. The rationale for the phase 1 study was informed by previous CAR T cell trials conducted by our group. Based on prior experience with MSLN-directed CAR T cell therapies, we hypothesized that local delivery of the maximum tolerated dose (MTD) of huCART-meso cells (established by i.v. infusion under NCT03054298 7 2 Eligible patients for the study have histologically confirmed unresectable or metastatic pancreatic adenocarcinoma. Additional enrollment criteria included: (1) failure of at least one prior standard of care chemotherapy for advanced stage disease; (2) measurable disease as defined by RECIST 1.1 criteria; (3) patients ≥18 years of age; (4) Eastern Cooperative Oncology Group performance status of 0 or 1; (5) satisfactory organ and bone marrow function; (6) blood coagulation parameters: PT such that internal normalized ration is ≤1.5 and a PTT ≤1.2 time the upper limit of normal unless the patient is therapeutically anti-coagulated for history of cancer-related thrombosis and has stable coagulation parameters; (7) provides informed written consent; and (8) patients of reproductive potential must agree to use acceptable birth control methods. All subjects who received the target dose of huCART-meso cells were considered evaluable for response, including progression-free survival and overall survival. All subjects with radiologically confirmed measurable disease (per RECIST 1.1) at baseline were considered evaluable for overall radiologic response. Clinical Cell manufacture Enrolled patients underwent apheresis at the Hospital of the University of Pennsylvania Apheresis Center. The manufacture and release testing of huCART-meso cells were performed by the Clinical Cell and Vaccine Production Facility at the University of Pennsylvania, according to Phase 1 IND current Good Clinical Manufacturing Practice guidelines and FACT Common Standards for Cellular Therapies. huCART-meso cells are autologous T cells that have been engineered to express an extracellular single chain antibody with mesothelin specificity and 4-1BB/TCRζ intracellular signaling domains. T cells were enriched from autologous leukapheresis products and activated with anti-CD3/CD28 antibody-coated magnetic beads, followed by transduction with the lentiviral vector containing the huCART-meso transgene. T cells were expanded in culture and washed, de-beaded, and cryopreserved in infusible grade cryomedia prior to product release following confirmation of FDA-specified release criteria for sterility, purity, and identity. Quantitative PCR analysis of clinical samples Each amplification reaction contained 200 ng of genomic DNA per time point for peripheral blood and tumor samples. To determine copy number per unit DNA, an eight-point standard curve was generated consisting of between 5 and 10 6 90 Serum cytokine profiling Serum samples obtained before and after huCART-meso infusion and cryopreserved at −80°C were thawed and analyzed for cytokine measurements using a 31-plex panel (Millipore Sigma) as previously described. 91 Production of human CRISPR-Engineered CAR-T cells The design and synthesis of single guide RNA (sgRNA) sequences targeting ID3 and SOX4 were performed according to previously established methods. 26 92 6 6 For each target locus defined by two sgRNA cut sites (spanning 100 and 130 bp for SOX4 and ID3, respectively), PCR and sequencing primers were designed to detect the target loci. LongAmp Taq 2X Master Mix (NEB) was utilized for target sequence amplification following the manufacturer’s protocol, and DNA purification was performed using NucleoSpin Gel and PCR Clean-up (Macherey-Nagel). Gene editing efficiency was evaluated by Sanger sequencing as previously described. 26 Table S3 Mouse experiments NOD/scid/IL2rγ−/− (NSG) mice were purchased from The Jackson Laboratory and bred and housed in the vivarium at the University of Pennsylvania in pathogen-free conditions. Animal studies were approved by the University of Pennsylvania Institutional Animal Care and Use Committee. Mice were subcutaneously injected with 2 × 10 6 3 6 l e n g t h × w i t h 2 ÷ 2 Standard immunohistochemistry (IHC) analyses Recurrent tumors were collected and processed for standard IHC analysis by the Comparative Pathology Core at the School of Veterinary Medicine of the University of Pennsylvania. Formalin-fixed tissues were routinely processed for paraffin embedding, sectioning, and staining. 5-μm-thick paraffin sections were mounted on ProbeOn slides (Thermo Fisher Scientific). The immunostaining procedure was performed using a Leica BOND RXm automated platform in combination with the Bond Polymer Refine Detection Kit (Leica). Rabbit monoclonal primary antibody against human CD45 (CD45-LCA; Cell Signaling Technology, catalog no. 13917) was used at concentrations of 1:300 and incubated on the sections for 45 min at room temperature. A biotin-free polymeric IHC detection system, consisting of horseradish peroxidase–conjugated anti-rabbit immunoglobulin G (IgG), was applied for 25 min at room temperature. Immunoreactivity was visualized using the diaminobenzidine chromogen. CD45 infiltration was quantified using Aperio ImageScope v12.4 (Aperio Technologies, Vista, CA, USA). Single-cell RNA-seq library preparation scRNA-seq libraries were generated using a Chromium Single-Cell 3′ v3.1 Library and Gel Bead Kit (10x Genomics) following the manufacturer’s protocol. Briefly, for recurrent mouse tumor and chronic antigen stimulation assays, CD8 + + Single-cell RNA-seq analysis To assess the expression of huCART-meso CAR in the scRNA-seq data, the cellranger reference was reindexed (mkref) by adding a single contig for the 818 bp WPRE sequence (a unique sequence in the CAR plasmid) to the GRCh38 assembly of the human genome (the gene annotation GTF file was appended with CDS and exon entries spanning the entire sequence and gene_id ‘‘CAR-Ligand’’). Sequencing data were aligned to the GRCh38 genome with the WPRE sequence and then barcodes and unique molecular identifiers were counted using the Cell Ranger v3.1.0 command cellranger count. See below detailed analyses for each experiment. Patient and recurrent tumor TILS single cell ( Figures 2 4 Data were further analyzed in R (version 4.2.0) using Seurat version 4.3.0.1. 85 , 86 87 86 Patient single cell ( Figure 2 Marker genes were determined using the FindAllMarkers function in Seurat using SCTransform normalized expression values where at least 25% of the cells must be expressing the gene with a logfc.threshold = 0.25. Next, ALRA imputation method 93 T cell subpopulations were defined using canonical markers. In the CD4 population, we detected regulatory T cells (Tregs; FOXP3, IL2RA, IKZF2), naive (SELL, CCR7, LEF1), and effector memory T cells (Tem; IL7R, KLRB1). In the CD8 population, we detected memory T cells (Tmem; CCR7, LEF1, SELL, IL7R, TCF7), effector memory (Tem; IL7R, KLRG1, NKG7), GZMK+ effector memory (GZMK+ Tem; GZMK, NKG7, PRF1, GZMH, CCL5), terminally differentiated Tem (Temra; NKG7, PRF1, GZMH, CCL5), and an NK-like T cell population (NK-like; NCAM1, FCGR3A, GNLY, GZMB, KLRC1, KLRC2). To display changes in T cell subpopulations, the number of cells found within each cluster for each condition was normalized by the total number of cells per condition and expressed as percentages. Cell type composition analysis in single-cell data was implemented using propeller from speckle R package. 84 Recurrent tumor TILs single cell ( Figure 4 To isolate CARpos cells, the subset function was used with parameter CAR-Ligand>0. SCTransform normalized expression values were used to make violin plots and UMAP feature plots. Genes differentially expressed between WT and SOX4KO recurrent tumor CARpos TILs were identified using FindMarkers. Wilcoxon Rank-Sum test was used to measure significance and adjusted p T cell subpopulations were defined using canonical markers. All cell clusters expressed exhaustion markers LAG3, HAVCR2, TOX, TIGIT. Clusters were further classified by NK-like Tex which expressed high levels of NK receptors and CAR T cell exhaustion genes identified in 26 84 Quantification and statistical analysis Statistical analyses were performed using Prism 10.1.2 GraphPad (GraphPad software) are represented by the following ∗∗∗∗ p p p p Statistical details for all experiments, including the statistical tests used, exact values of n, definitions of n, measures of central tendency, and measures of variability are provided in the figure legends. For CAR T cell expansion in biopsy samples, statistical analysis was performed using a Wilcoxon matched-pairs signed rank test. For in vitro in vivo Kaplan-Meier curves were generated for relapse-free survival (RFS) analyses, defined as the number of days between the date of infusion and the first of the following dates: recurrence, death, end of the experiment (censored). A log rank test for RFS, restricting to WT or DKO subjects was performed. To identify changes in cell populations from single-cell RNA-seq datasets, significance was evaluated using the moderated t-test using the propeller method, speckle package in R. Data were visualized using the following R packages and functions ggplot2, pheatmap, RColorBrewer, gplots, dplyr, plotly. RFS was analyzed using the survival, SurvMisc, survminer packages in R. See key resources table References 1 Park W. Chawla A. O'Reilly E.M. Pancreatic Cancer: A Review JAMA 326 2021 851 862 10.1001/jama.2021.13027 34547082 PMC9363152 2 Conroy T. Desseigne F. Ychou M. Bouché O. Guimbaud R. Bécouarn Y. Adenis A. Raoul J.L. Gourgou-Bourgade S. de la Fouchardière C. FOLFIRINOX versus gemcitabine for metastatic pancreatic cancer N. Engl. J. Med. 364 2011 1817 1825 10.1056/NEJMoa1011923 21561347 3 Von Hoff D.D. Ervin T. Arena F.P. Chiorean E.G. Infante J. Moore M. Seay T. Tjulandin S.A. Ma W.W. Saleh M.N. Increased survival in pancreatic cancer with nab-paclitaxel plus gemcitabine N. Engl. J. Med. 369 2013 1691 1703 10.1056/NEJMoa1304369 24131140 PMC4631139 4 Topalian S.L. Hodi F.S. Brahmer J.R. Gettinger S.N. Smith D.C. McDermott D.F. Powderly J.D. Carvajal R.D. Sosman J.A. Atkins M.B. Safety, activity, and immune correlates of anti-PD-1 antibody in cancer N. Engl. J. Med. 366 2012 2443 2454 10.1056/NEJMoa1200690 22658127 PMC3544539 5 Brahmer J.R. Tykodi S.S. Chow L.Q.M. Hwu W.J. Topalian S.L. Hwu P. Drake C.G. Camacho L.H. Kauh J. Odunsi K. Safety and activity of anti-PD-L1 antibody in patients with advanced cancer N. Engl. J. Med. 366 2012 2455 2465 10.1056/NEJMoa1200694 22658128 PMC3563263 6 Royal R.E. Levy C. Turner K. Mathur A. Hughes M. Kammula U.S. Sherry R.M. Topalian S.L. Yang J.C. Lowy I. Rosenberg S.A. Phase 2 trial of single agent Ipilimumab (anti-CTLA-4) for locally advanced or metastatic pancreatic adenocarcinoma J. Immunother. 33 2010 828 833 10.1097/CJI.0b013e3181eec14c 20842054 PMC7322622 7 Boyiadzis M.M. Dhodapkar M.V. Brentjens R.J. Kochenderfer J.N. Neelapu S.S. Maus M.V. Porter D.L. Maloney D.G. Grupp S.A. Mackall C.L. Chimeric antigen receptor (CAR) T therapies for the treatment of hematologic malignancies: clinical perspective and significance J. Immunother. Cancer 6 2018 137 10.1186/s40425-018-0460-5 30514386 PMC6278156 8 June C.H. Sadelain M. Chimeric Antigen Receptor Therapy N. Engl. J. Med. 379 2018 64 73 10.1056/NEJMra1706169 29972754 PMC7433347 9 Scales S.J. Gupta N. Pacheco G. Firestein R. French D.M. Koeppen H. Rangell L. Barry-Hamilton V. Luis E. Chuh J. An antimesothelin-monomethyl auristatin e conjugate with potent antitumor activity in ovarian, pancreatic, and mesothelioma models Mol. Cancer Ther. 13 2014 2630 2640 10.1158/1535-7163.MCT-14-0487-T 25249555 10 Shimizu A. Hirono S. Tani M. Kawai M. Okada K.I. Miyazawa M. Kitahata Y. Nakamura Y. Noda T. Yokoyama S. Yamaue H. Coexpression of MUC16 and mesothelin is related to the invasion process in pancreatic ductal adenocarcinoma Cancer Sci. 103 2012 739 746 10.1111/j.1349-7006.2012.02214.x 22320398 PMC7659350 11 Swierczynski S.L. Maitra A. Abraham S.C. Iacobuzio-Donahue C.A. Ashfaq R. Cameron J.L. Schulick R.D. Yeo C.J. Rahman A. Hinkle D.A. Analysis of novel tumor markers in pancreatic and biliary carcinomas using tissue microarrays Hum. Pathol. 35 2004 357 366 10.1016/j.humpath.2003.10.012 15017593 12 Argani P. Iacobuzio-Donahue C. Ryu B. Rosty C. Goggins M. Wilentz R.E. Murugesan S.R. Leach S.D. Jaffee E. Yeo C.J. Mesothelin is overexpressed in the vast majority of ductal adenocarcinomas of the pancreas: identification of a new pancreatic cancer marker by serial analysis of gene expression (SAGE) Clin. Cancer Res. 7 2001 3862 3868 11751476 13 Winter J.M. Tang L.H. Klimstra D.S. Brennan M.F. Brody J.R. Rocha F.G. Jia X. Qin L.X. D'Angelica M.I. DeMatteo R.P. A novel survival-based tissue microarray of pancreatic cancer validates MUC1 and mesothelin as biomarkers PLoS One 7 2012 e40157 10.1371/journal.pone.0040157 PMC3391218 22792233 14 Bharadwaj U. Li M. Chen C. Yao Q. Mesothelin-induced pancreatic cancer cell proliferation involves alteration of cyclin E via activation of signal transducer and activator of transcription protein 3 Mol. Cancer Res. 6 2008 1755 1765 10.1158/1541-7786.MCR-08-0095 19010822 PMC2929833 15 Li M. Bharadwaj U. Zhang R. Zhang S. Mu H. Fisher W.E. Brunicardi F.C. Chen C. Yao Q. Mesothelin is a malignant factor and therapeutic vaccine target for pancreatic cancer Mol. Cancer Ther. 7 2008 286 296 10.1158/1535-7163.MCT-07-0483 18281514 PMC2929838 16 Beatty G.L. O'Hara M.H. Lacey S.F. Torigian D.A. Nazimuddin F. Chen F. Kulikovskaya I.M. Soulen M.C. McGarvey M. Nelson A.M. Activity of Mesothelin-Specific Chimeric Antigen Receptor T Cells Against Pancreatic Carcinoma Metastases in a Phase 1 Trial Gastroenterology 155 2018 29 32 10.1053/j.gastro.2018.03.029 29567081 PMC6035088 17 Haas A.R. Tanyi J.L. O'Hara M.H. Gladney W.L. Lacey S.F. Torigian D.A. Soulen M.C. Tian L. McGarvey M. Nelson A.M. Phase I Study of Lentiviral-Transduced Chimeric Antigen Receptor-Modified T Cells Recognizing Mesothelin in Advanced Solid Cancers Mol. Ther. 27 2019 1919 1929 10.1016/j.ymthe.2019.07.015 31420241 PMC6838875 18 Albelda S.M. CAR T cell therapy for patients with solid tumours: key lessons to learn and unlearn Nat. Rev. Clin. Oncol. 21 2024 47 66 10.1038/s41571-023-00832-4 37904019 19 Satpathy A.T. Granja J.M. Yost K.E. Qi Y. Meschi F. McDermott G.P. Olsen B.N. Mumbach M.R. Pierce S.E. Corces M.R. Massively parallel single-cell chromatin landscapes of human immune cell development and intratumoral T cell exhaustion Nat. Biotechnol. 37 2019 925 936 10.1038/s41587-019-0206-z 31375813 PMC7299161 20 McLane L.M. Abdel-Hakeem M.S. Wherry E.J. CD8 T Cell Exhaustion During Chronic Viral Infection and Cancer Annu. Rev. Immunol. 37 2019 457 495 10.1146/annurev-immunol-041015-055318 30676822 21 Pauken K.E. Sammons M.A. Odorizzi P.M. Manne S. Godec J. Khan O. Drake A.M. Chen Z. Sen D.R. Kurachi M. Epigenetic stability of exhausted T cells limits durability of reinvigoration by PD-1 blockade Science 354 2016 1160 1165 10.1126/science.aaf2807 27789795 PMC5484795 22 Vigano S. Bobisse S. Coukos G. Perreau M. Harari A. Cancer and HIV-1 Infection: Patterns of Chronic Antigen Exposure Front. Immunol. 11 2020 1350 10.3389/fimmu.2020.01350 32714330 PMC7344140 23 Pauken K.E. Wherry E.J. Overcoming T cell exhaustion in infection and cancer Trends Immunol. 36 2015 265 276 10.1016/j.it.2015.02.008 25797516 PMC4393798 24 Fraietta J.A. Lacey S.F. Orlando E.J. Pruteanu-Malinici I. Gohil M. Lundh S. Boesteanu A.C. Wang Y. O'Connor R.S. Hwang W.T. Determinants of response and resistance to CD19 chimeric antigen receptor (CAR) T cell therapy of chronic lymphocytic leukemia Nat. Med. 24 2018 563 571 10.1038/s41591-018-0010-1 29713085 PMC6117613 25 Cherkassky L. Morello A. Villena-Vargas J. Feng Y. Dimitrov D.S. Jones D.R. Sadelain M. Adusumilli P.S. Human CAR T cells with cell-intrinsic PD-1 checkpoint blockade resist tumor-mediated inhibition J. Clin. Investig. 126 2016 3130 3144 10.1172/JCI83092 27454297 PMC4966328 26 Good C.R. Aznar M.A. Kuramitsu S. Samareh P. Agarwal S. Donahue G. Ishiyama K. Wellhausen N. Rennels A.K. Ma Y. An NK-like CAR T cell transition in CAR T cell dysfunction Cell 184 2021 6081 6100.e26 10.1016/j.cell.2021.11.016 34861191 PMC8827167 27 Schuster S.J. Bishop M.R. Tam C.S. Waller E.K. Borchmann P. McGuirk J.P. Jäger U. Jaglowski S. Andreadis C. Westin J.R. Tisagenlecleucel in Adult Relapsed or Refractory Diffuse Large B-Cell Lymphoma N. Engl. J. Med. 380 2019 45 56 10.1056/NEJMoa1804980 30501490 28 Hou A.J. Chen L.C. Chen Y.Y. Navigating CAR-T cells through the solid-tumour microenvironment Nat. Rev. Drug Discov. 20 2021 531 550 10.1038/s41573-021-00189-2 33972771 29 Seo H. Chen J. González-Avalos E. Samaniego-Castruita D. Das A. Wang Y.H. López-Moyado I.F. Georges R.O. Zhang W. Onodera A. TOX and TOX2 transcription factors cooperate with NR4A transcription factors to impose CD8(+) T cell exhaustion Proc. Natl. Acad. Sci. USA 116 2019 12410 12415 10.1073/pnas.1905675116 31152140 PMC6589758 30 Chen J. López-Moyado I.F. Seo H. Lio C.W.J. Hempleman L.J. Sekiya T. Yoshimura A. Scott-Browne J.P. Rao A. NR4A transcription factors limit CAR T cell function in solid tumours Nature 567 2019 530 534 10.1038/s41586-019-0985-x 30814732 PMC6546093 31 Liu X. Wang Y. Lu H. Li J. Yan X. Xiao M. Hao J. Alekseev A. Khong H. Chen T. Genome-wide analysis identifies NR4A1 as a key mediator of T cell dysfunction Nature 567 2019 525 529 10.1038/s41586-019-0979-8 30814730 PMC6507425 32 Haas A.R. Golden R.J. Litzky L.A. Engels B. Zhao L. Xu F. Taraszka J.A. Ramones M. Granda B. Chang W.J. Two cases of severe pulmonary toxicity from highly active mesothelin-directed CAR T cells Mol. Ther. 31 2023 2309 2325 10.1016/j.ymthe.2023.06.006 37312454 PMC10422001 33 Eisenhauer E.A. Therasse P. Bogaerts J. Schwartz L.H. Sargent D. Ford R. Dancey J. Arbuck S. Gwyther S. Mooney M. New response evaluation criteria in solid tumours: revised RECIST guideline (version 1.1) Eur. J. Cancer 45 2009 228 247 10.1016/j.ejca.2008.10.026 19097774 34 Weber E.W. Parker K.R. Sotillo E. Lynn R.C. Anbunathan H. Lattin J. Good Z. Belk J.A. Daniel B. Klysz D. Transient rest restores functionality in exhausted CAR-T cells through epigenetic remodeling Science 372 2021 eaba1786 10.1126/science.aba1786 PMC8049103 33795428 35 Guo X. Zhang Y. Zheng L. Zheng C. Song J. Zhang Q. Kang B. Liu Z. Jin L. Xing R. Global characterization of T cells in non-small-cell lung cancer by single-cell sequencing Nat. Med. 24 2018 978 985 10.1038/s41591-018-0045-3 29942094 36 Wang X. Shen X. Chen S. Liu H. Hong N. Zhong H. Chen X. Jin W. Reinvestigation of Classic T Cell Subsets and Identification of Novel Cell Subpopulations by Single-Cell RNA Sequencing J. Immunol. 208 2022 396 406 10.4049/jimmunol.2100581 34911770 37 Cano-Gamez E. Soskic B. Roumeliotis T.I. So E. Smyth D.J. Baldrighi M. Willé D. Nakic N. Esparza-Gordillo J. Larminie C.G.C. Single-cell transcriptomics identifies an effectorness gradient shaping the response of CD4(+) T cells to cytokines Nat. Commun. 11 2020 1801 10.1038/s41467-020-15543-y 32286271 PMC7156481 38 Wang H. Fu Y. Da B.B. Xiong G. Single-Cell Sequencing Identifies the Heterogeneity of CD8+ T Cells and Novel Biomarker Genes in Hepatocellular Carcinoma J. Healthc. Eng. 2022 2022 8256314 10.1155/2022/8256314 PMC9018173 35449866 39 Giles J.R. Manne S. Freilich E. Oldridge D.A. Baxter A.E. George S. Chen Z. Huang H. Chilukuri L. Carberry M. Human epigenetic and transcriptional T cell differentiation atlas for identifying functional T cell-specific enhancers Immunity 55 2022 557 574.e7 10.1016/j.immuni.2022.02.004 35263570 PMC9214622 40 Chen Y. Shen J. Kasmani M.Y. Topchyan P. Cui W. Single-Cell Transcriptomics Reveals Core Regulatory Programs That Determine the Heterogeneity of Circulating and Tissue-Resident Memory CD8(+) T Cells Cells 10 2021 2143 10.3390/cells10082143 PMC8392357 34440912 41 Zheng L. Qin S. Si W. Wang A. Xing B. Gao R. Ren X. Wang L. Wu X. Zhang J. Pan-cancer single-cell landscape of tumor-infiltrating T cells Science 374 2021 abe6474 10.1126/science.abe6474 34914499 42 Szabo P.A. Levitin H.M. Miron M. Snyder M.E. Senda T. Yuan J. Cheng Y.L. Bush E.C. Dogra P. Thapa P. Single-cell transcriptomics of human T cells reveals tissue and activation signatures in health and disease Nat. Commun. 10 2019 4706 10.1038/s41467-019-12464-3 31624246 PMC6797728 43 Li J. He Y. Hao J. Ni L. Dong C. High Levels of Eomes Promote Exhaustion of Anti-tumor CD8(+) T Cells Front. Immunol. 9 2018 2981 10.3389/fimmu.2018.02981 30619337 PMC6305494 44 Klampatsa A. Dimou V. Albelda S.M. Mesothelin-targeted CAR-T cell therapy for solid tumors Expert Opin. Biol. Ther. 21 2021 473 486 10.1080/14712598.2021.1843628 33176519 45 Katz S.C. Burga R.A. McCormack E. Wang L.J. Mooring W. Point G.R. Khare P.D. Thorn M. Ma Q. Stainken B.F. Phase I Hepatic Immunotherapy for Metastases Study of Intra-Arterial Chimeric Antigen Receptor-Modified T-cell Therapy for CEA+ Liver Metastases Clin. Cancer Res. 21 2015 3149 3159 10.1158/1078-0432.CCR-14-1421 25850950 PMC4506253 46 Annunziata C.M. Ghobadi A. Pennella E.J. Vanas J. Powell C. Pavelova M. Wagner C. Kuo M. Dansky Ullmann C. Hassan R. Thaker P.H. Feasibility and preliminary safety and efficacy of first-in-human intraperitoneal delivery of MCY-M11, anti-human-mesothelin CAR mRNA transfected into peripheral blood mononuclear cells, for ovarian cancer and malignant peritoneal mesothelioma J. Clin. Oncol. 38 2020 3014 10.1200/JCO.2020.38.15_suppl.3014 47 Katz S.C. Moody A.E. Guha P. Hardaway J.C. Prince E. LaPorte J. Stancu M. Slansky J.E. Jordan K.R. Schulick R.D. HITM-SURE: Hepatic immunotherapy for metastases phase Ib anti-CEA CAR-T study utilizing pressure enabled drug delivery J. Immunother. Cancer 8 2020 e001097 10.1136/jitc-2020-001097 PMC7449487 32843493 48 Narayan V. Barber-Rotenberg J.S. Jung I.Y. Lacey S.F. Rech A.J. Davis M.M. Hwang W.T. Lal P. Carpenter E.L. Maude S.L. PSMA-targeting TGFbeta-insensitive armored CAR T cells in metastatic castration-resistant prostate cancer: a phase 1 trial Nat. Med. 28 2022 724 734 10.1038/s41591-022-01726-1 35314843 PMC10308799 49 Steffin D. Ghatwai N. Montalbano A. Rathi P. Courtney A.N. Arnett A.B. Fleurence J. Sweidan R. Wang T. Zhang H. Interleukin-15-armored GPC3-CAR T cells for patients with solid cancers Preprint at Res. Sq. 2024 10.21203/rs.3.rs-4103623/v1 39604730 50 Wang Y. Chen M. Wu Z. Tong C. Dai H. Guo Y. Liu Y. Huang J. Lv H. Luo C. CD133-directed CAR T cells for advanced metastasis malignancies: A phase I trial OncoImmunology 7 2018 e1440169 10.1080/2162402X.2018.1440169 PMC5993480 29900044 51 Zhang Y. Chertov O. Zhang J. Hassan R. Pastan I. Cytotoxic activity of immunotoxin SS1P is modulated by TACE-dependent mesothelin shedding Cancer Res. 71 2011 5915 5922 10.1158/0008-5472.CAN-11-0466 21775520 PMC3165076 52 Li J. Byrne K.T. Yan F. Yamazoe T. Chen Z. Baslan T. Richman L.P. Lin J.H. Sun Y.H. Rech A.J. Tumor Cell-Intrinsic Factors Underlie Heterogeneity of Immune Cell Infiltration and Response to Immunotherapy Immunity 49 2018 178 193.e7 10.1016/j.immuni.2018.06.006 29958801 PMC6707727 53 Kim R.H. Plesa G. Gladney W. Kulikovskaya I. Levine B.L. Lacey S.F. June C.H. Melenhorst J.J. Beatty G.L. Effect of chimeric antigen receptor (CAR) T cells on clonal expansion of endogenous non-CAR T cells in patients (pts) with advanced solid cancer J. Clin. Oncol. 35 2017 3011 10.1200/JCO.2017.35.15_suppl.3011 54 Halbrook C.J. Lyssiotis C.A. Pasca di Magliano M. Maitra A. Pancreatic cancer: Advances and challenges Cell 186 2023 1729 1754 10.1016/j.cell.2023.02.014 37059070 PMC10182830 55 Camviel N. Wolf B. Croce G. Gfeller D. Zoete V. Arber C. Both APRIL and antibody-fragment-based CAR T cells for myeloma induce BCMA downmodulation by trogocytosis and internalization J. Immunother. Cancer 10 2022 e005091 10.1136/jitc-2022-005091 PMC9639149 36323436 56 Caruso H.G. Hurton L.V. Najjar A. Rushworth D. Ang S. Olivares S. Mi T. Switzer K. Singh H. Huls H. Tuning Sensitivity of CAR to EGFR Density Limits Recognition of Normal Tissue While Maintaining Potent Antitumor Activity Cancer Res. 75 2015 3505 3518 10.1158/0008-5472.CAN-15-0139 26330164 PMC4624228 57 Davenport A.J. Jenkins M.R. Cross R.S. Yong C.S. Prince H.M. Ritchie D.S. Trapani J.A. Kershaw M.H. Darcy P.K. Neeson P.J. CAR-T Cells Inflict Sequential Killing of Multiple Tumor Target Cells Cancer Immunol. Res. 3 2015 483 494 10.1158/2326-6066.CIR-15-0048 25711536 58 Hamieh M. Dobrin A. Cabriolu A. van der Stegen S.J.C. Giavridis T. Mansilla-Soto J. Eyquem J. Zhao Z. Whitlock B.M. Miele M.M. CAR T cell trogocytosis and cooperative killing regulate tumour antigen escape Nature 568 2019 112 116 10.1038/s41586-019-1054-1 30918399 PMC6707377 59 Zhai Y. Du Y. Li G. Yu M. Hu H. Pan C. Wang D. Shi Z. Yan X. Li X. Trogocytosis of CAR molecule regulates CAR-T cell dysfunction and tumor antigen escape Signal Transduct. Target. Ther. 8 2023 457 10.1038/s41392-023-01708-w 38143263 PMC10749292 60 Jonsson A.H. Zhang F. Dunlap G. Gomez-Rivas E. Watts G.F.M. Faust H.J. Rupani K.V. Mears J.R. Meednu N. Wang R. Granzyme K(+) CD8 T cells form a core population in inflamed human tissue Sci. Transl. Med. 14 2022 eabo0686 10.1126/scitranslmed.abo0686 PMC9972878 35704599 61 Flemming A. GZMK(+) T cells a hallmark of immune ageing Nat. Rev. Immunol. 21 2021 1 10.1038/s41577-020-00486-8 33303954 62 Mogilenko D.A. Shpynov O. Andhey P.S. Arthur L. Swain A. Esaulova E. Brioschi S. Shchukina I. Kerndl M. Bambouskova M. Comprehensive Profiling of an Aging Immune System Reveals Clonal GZMK(+) CD8(+) T Cells as Conserved Hallmark of Inflammaging Immunity 54 2021 99 115.e12 10.1016/j.immuni.2020.11.005 33271118 63 Good Z. Spiegel J.Y. Sahaf B. Malipatlolla M.B. Ehlinger Z.J. Kurra S. Desai M.H. Reynolds W.D. Wong Lin A. Vandris P. Post-infusion CAR T(Reg) cells identify patients resistant to CD19-CAR therapy Nat. Med. 28 2022 1860 1871 10.1038/s41591-022-01960-7 36097223 PMC10917089 64 Haradhvala N.J. Leick M.B. Maurer K. Gohil S.H. Larson R.C. Yao N. Gallagher K.M.E. Katsis K. Frigault M.J. Southard J. Distinct cellular dynamics associated with response to CAR-T therapy for refractory B cell lymphoma Nat. Med. 28 2022 1848 1859 10.1038/s41591-022-01959-0 36097221 PMC9509487 65 Bachireddy P. Azizi E. Burdziak C. Nguyen V.N. Ennis C.S. Maurer K. Park C.Y. Choo Z.N. Li S. Gohil S.H. Mapping the evolution of T cell states during response and resistance to adoptive cellular therapy Cell Rep. 37 2021 109992 10.1016/j.celrep.2021.109992 PMC9035342 34758319 66 Li H. van der Leun A.M. Yofe I. Lubling Y. Gelbard-Solodkin D. van Akkooi A.C.J. van den Braber M. Rozeman E.A. Haanen J.B.A.G. Blank C.U. Dysfunctional CD8 T Cells Form a Proliferative, Dynamically Regulated Compartment within Human Melanoma Cell 176 2019 775 789.e18 10.1016/j.cell.2018.11.043 30595452 PMC7253294 67 Lipp J.J. Wang L. Yang H. Yao F. Harrer N. Müller S. Berezowska S. Dorn P. Marti T.M. Schmid R.A. Functional and molecular characterization of PD1(+) tumor-infiltrating lymphocytes from lung cancer patients OncoImmunology 11 2022 2019466 10.1080/2162402X.2021.2019466 PMC8837234 35154905 68 Kavyanifar A. Turan S. Lie D.C. SoxC transcription factors: multifunctional regulators of neurodevelopment Cell Tissue Res. 371 2018 91 103 10.1007/s00441-017-2708-7 29079881 69 Fraidenraich D. Stillwell E. Romero E. Wilkes D. Manova K. Basson C.T. Benezra R. Rescue of cardiac defects in id knockout embryos by injection of embryonic stem cells Science 306 2004 247 252 10.1126/science.1102612 15472070 PMC1351017 70 Kontarakis Z. Stainier D.Y.R. Genetics in Light of Transcriptional Adaptation Trends Genet. 36 2020 926 935 10.1016/j.tig.2020.08.008 32928563 PMC7612536 71 Brodin P. Davis M.M. Human immune system variation Nat. Rev. Immunol. 17 2017 21 29 10.1038/nri.2016.125 27916977 PMC5328245 72 Brodin P. Jojic V. Gao T. Bhattacharya S. Angel C.J.L. Furman D. Shen-Orr S. Dekker C.L. Swan G.E. Butte A.J. Variation in the human immune system is largely driven by non-heritable influences Cell 160 2015 37 47 10.1016/j.cell.2014.12.020 25594173 PMC4302727 73 Bai Z. Feng B. McClory S.E. de Oliveira B.C. Diorio C. Gregoire C. Tao B. Yang L. Zhao Z. Peng L. Single-cell CAR T atlas reveals type 2 function in 8-year leukaemia remission Nature 634 2024 702 711 10.1038/s41586-024-07762-w 39322664 PMC11485231 74 Jung I.Y. Narayan V. McDonald S. Rech A.J. Bartoszek R. Hong G. Davis M.M. Xu J. Boesteanu A.C. Barber-Rotenberg J.S. BLIMP1 and NR4A3 transcription factors reciprocally regulate antitumor CAR T cell stemness and exhaustion Sci. Transl. Med. 14 2022 eabn7336 10.1126/scitranslmed.abn7336 PMC10257143 36350986 75 Pal S.K. Tran B. Haanen J.B.A.G. Hurwitz M.E. Sacher A. Tannir N.M. Budde L.E. Harrison S.J. Klobuch S. Patel S.S. CD70-Targeted Allogeneic CAR T-Cell Therapy for Advanced Clear Cell Renal Cell Carcinoma Cancer Discov. 14 2024 1176 1189 10.1158/2159-8290.CD-24-0102 38583184 PMC11215406 76 Vonderheide R.H. CD40 Agonist Antibodies in Cancer Immunotherapy Annu. Rev. Med. 71 2020 47 58 10.1146/annurev-med-062518-045435 31412220 77 Bayne L.J. Beatty G.L. Jhala N. Clark C.E. Rhim A.D. Stanger B.Z. Vonderheide R.H. Tumor-derived granulocyte-macrophage colony-stimulating factor regulates myeloid inflammation and T cell immunity in pancreatic cancer Cancer Cell 21 2012 822 835 10.1016/j.ccr.2012.04.025 22698406 PMC3575028 78 Soares K.C. Rucki A.A. Kim V. Foley K. Solt S. Wolfgang C.L. Jaffee E.M. Zheng L. TGF-beta blockade depletes T regulatory cells from metastatic pancreatic tumors in a vaccine dependent manner Oncotarget 6 2015 43005 43015 10.18632/oncotarget.5656 26515728 PMC4767487 79 Adusumilli P.S. Zauderer M.G. Rivière I. Solomon S.B. Rusch V.W. O'Cearbhaill R.E. Zhu A. Cheema W. Chintala N.K. Halton E. A Phase I Trial of Regional Mesothelin-Targeted CAR T-cell Therapy in Patients with Malignant Pleural Disease, in Combination with the Anti-PD-1 Agent Pembrolizumab Cancer Discov. 11 2021 2748 2763 10.1158/2159-8290.CD-21-0407 34266984 PMC8563385 80 Kuhn N.F. Purdon T.J. van Leeuwen D.G. Lopez A.V. Curran K.J. Daniyan A.F. Brentjens R.J. CD40 Ligand-Modified Chimeric Antigen Receptor T Cells Enhance Antitumor Function by Eliciting an Endogenous Antitumor Response Cancer Cell 35 2019 473 488.e6 10.1016/j.ccell.2019.02.006 30889381 PMC6428219 81 Wehrli M. Guinn S. Birocchi F. Kuo A. Sun Y. Larson R.C. Almazan A.J. Scarfò I. Bouffard A.A. Bailey S.R. Mesothelin CAR T-cells secreting anti-FAP/anti-CD3 molecules efficiently target pancreatic adenocarcinoma and its stroma Clin. Cancer Res. 30 2024 1859 1877 10.1158/1078-0432.CCR-23-3841 38393682 PMC11062832 82 Xiao Z. Todd L. Huang L. Noguera-Ortega E. Lu Z. Huang L. Kopp M. Li Y. Pattada N. Zhong W. Desmoplastic stroma restricts T cell extravasation and mediates immune exclusion and immunosuppression in solid tumors Nat. Commun. 14 2023 5110 10.1038/s41467-023-40850-5 37607999 PMC10444764 83 Zhang Y. Wang P. Wang T. Fang Y. Ding Y. Qian Q. Chimeric antigen receptor T cells engineered to secrete CD40 agonist antibodies enhance antitumor efficacy J. Transl. Med. 19 2021 82 10.1186/s12967-021-02750-4 33602263 PMC7890961 84 Phipson B. Sim C.B. Porrello E.R. Hewitt A.W. Powell J. Oshlack A. propeller: testing for differences in cell type proportions in single cell data Bioinformatics 38 2022 4720 4726 10.1093/bioinformatics/btac582 36005887 PMC9563678 85 Butler A. Hoffman P. Smibert P. Papalexi E. Satija R. Integrating single-cell transcriptomic data across different conditions, technologies, and species Nat. Biotechnol. 36 2018 411 420 10.1038/nbt.4096 29608179 PMC6700744 86 Stuart T. Butler A. Hoffman P. Hafemeister C. Papalexi E. Mauck W.M. 3rd Hao Y. Stoeckius M. Smibert P. Satija R. Comprehensive Integration of Single-Cell Data Cell 177 2019 1888 1902.e21 10.1016/j.cell.2019.05.031 31178118 PMC6687398 87 Hafemeister C. Satija R. Normalization and variance stabilization of single-cell RNA-seq data using regularized negative binomial regression Genome Biol. 20 2019 296 10.1186/s13059-019-1874-1 31870423 PMC6927181 88 Kutner R.H. Zhang X.Y. Reiser J. Production, concentration and titration of pseudotyped HIV-1-based lentiviral vectors Nat. Protoc. 4 2009 495 505 10.1038/nprot.2009.22 19300443 89 Carpenito C. Milone M.C. Hassan R. Simonet J.C. Lakhal M. Suhoski M.M. Varela-Rohena A. Haines K.M. Heitjan D.F. Albelda S.M. Control of large, established tumor xenografts with genetically retargeted human T cells containing CD28 and CD137 domains Proc. Natl. Acad. Sci. USA 106 2009 3360 3365 10.1073/pnas.0813101106 19211796 PMC2651342 90 Porter D.L. Kalos M. Zheng Z. Levine B. June C. Chimeric Antigen Receptor Therapy for B-cell Malignancies J. Cancer 2 2011 331 332 10.7150/jca.2.331 21716851 PMC3119397 91 Teachey D.T. Lacey S.F. Shaw P.A. Melenhorst J.J. Maude S.L. Frey N. Pequignot E. Gonzalez V.E. Chen F. Finklestein J. Identification of Predictive Biomarkers for Cytokine Release Syndrome after Chimeric Antigen Receptor T-cell Therapy for Acute Lymphoblastic Leukemia Cancer Discov. 6 2016 664 679 10.1158/2159-8290.CD-16-0040 27076371 PMC5448406 92 Agarwal S. Wellhausen N. Levine B.L. June C.H. Production of Human CRISPR-Engineered CAR-T Cells J. Vis. Exp. 169 2021 e62299 10.3791/62299 33779622 93 Linderman G.C. Zhao J. Roulis M. Bielecki P. Flavell R.A. Nadler B. Kluger Y. Zero-preserving imputation of single-cell RNA-seq data Nat. Commun. 13 2022 192 10.1038/s41467-021-27729-z 35017482 PMC8752663 Supplemental information  Document S1. Figures S1–S5 and Tables S1–S3 Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102301 ",
  "metadata": {
    "Title of this paper": "Zero-preserving imputation of single-cell RNA-seq data",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490220/"
  }
}