{
  "title": "Paper_838",
  "abstract": "Br J Cancer Br J Cancer 319 nihpa British journal of cancer 0007-0920 1532-1827 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12478594 PMC12478594.1 12478594 12478594 NIHMS2108678 40825849 10.1038/s41416-025-03121-2 NIHMS2108678 NIHPA2108678 1 Article Anti-tumor activity of camptothecin analog conjugate of an RSPO4-based peptibody targeting LGR4/5/6 in preclinical models of colorectal cancer Toh Yukimatsu 1 Wu Ling 1 Tu Jianghua 1 Liang Zhengdong 1 Aldana Adela M. 1 Wen Jake J. 1 Li Li 1 Pan Sheng 1 Rowe Julie H. 2 Hensel Martha E. 3 Hodo Carolyn L. 3 Finch Rick A. 3 Carmon Kendra S. 1 Liu Qingyun J. 1 * 1 2 3 Author Contribution Y.T., K.S.C., and Q.J.L. devised the concept. Y.T., L.W., J.T., Z.L., A.M.A., J.J.W., L.L., S.P., R.H.J., M.E.H., C.L.H., R.A.F., K.S.C., and Q.J.L designed, performed, and analyzed experiments. Y.T. and Q.J.L. wrote the manuscript. All coauthors reviewed and approved of the final manuscript. * Qingyun.liu@uth.tmc.edu Competing Interest: 18 8 2025 497744 10.1038/s41416-025-03121-2 14 09 2025 29 09 2025 30 09 2025 30 09 2025 Anti-tumor activity of camptothecin analog conjugate of a RSPO4-based peptibody targeting LGR4/5/6 in preclinical models of colorectal cancer 16 1 2025 2024.10.08.616548 bioRxiv PMC11482909 39415992 Background: Antibody-drug conjugates (ADCs) are a significant advancement in targeted cancer therapy, but none are approved for colorectal cancer (CRC). LGR4/5/6, highly expressed in most CRCs, are promising targets. While LGR5-targeting ADCs show strong anti-tumor effects, their efficacy is limited by LGR5 loss in some CRC cells. RSPO4, a natural ligand for LGR4/5/6, binds all three receptors with high affinity. This research develops RSPO4-based peptibody drug-conjugates (PDCs) to simultaneously target LGR4/5/6, offering a novel therapeutic approach for CRC. Methods: LGR4/5/6 expression in CRCs was analyzed using RNA-seq datasets and Western blot. Peptibody binding affinities were measured, conjugated to camptothecin analog, CPT2, and tested for cytotoxicity in CRC cell lines. Antitumor efficacy was evaluated in vivo using CRC cell line and patient-derived xenograft (PDX) models. Results: Peptibody was engineered by fusing a mutant RSPO4 furin-domain to human IgG1 Fc, retaining high-affinity LGR4/5/6 binding without enhancing Wnt/β-catenin signaling. Conjugated with CPT2 molecules, the PDC showed strong antitumor activity in CRC cell lines and dose-dependent tumor growth inhibition in xenograft and patient-derived models. Conclusion: Preclinical data showed that LGR4/5/6-targeting PDC exhibited potent cytotoxicity in vitro and robust antitumor efficacy in CRC xenograft and PDX models, making its potential as a promising CRC therapy. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf yes pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "\nAnti-tumor activity of camptothecin analog conjugate of a RSPO4-based peptibody targeting LGR4/5/6 in preclinical models of colorectal cancer\n",
    "Journal it was published in:": "British journal of cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478594/"
  }
}