{
  "title": "Paper_342",
  "abstract": "pmc Kardiochir Torakochirurgia Pol Kardiochir Torakochirurgia Pol 2650 poljtcsurg KITP Kardiochirurgia i Torakochirurgia Polska = Polish Journal of Cardio-Thoracic Surgery 1731-5530 1897-4252 Termedia Publishing PMC12487640 PMC12487640.1 12487640 12487640 41041349 10.5114/kitp.2019.91392 39482 1 Letter to the Editor Long-term follow-up after surgical removal of thymolipoma Amini Mahnaz 1 Fattahi Masuom Seyed Hossein 2 Sadat Fattahi Asieh 2 1 2 Address for correspondence: emis@mums.ac.ir 31 12 2019 12 2019 16 4 498099 206 208 22 9 2019 12 11 2019 31 12 2019 02 10 2025 03 10 2025 Copyright: © 2019 Polish Society of Cardiothoracic Surgeons (Polskie Towarzystwo KardioTorakochirurgów) and the editors of the Polish Journal of Cardio-Thoracic Surgery (Kardiochirurgia i Torakochirurgia Polska) 2019 https://creativecommons.org/licenses/by-nc-sa/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International (CC BY-NC-SA 4.0) License, allowing third parties to copy and redistribute the material in any medium or format and to remix, transform, and build upon the material, provided the original work is properly cited and states its license. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes The thymus is the largest lymphoid tissue of the human body, located in the superior mediastinum, growing until puberty and then involuting to nearly disappear around 18 years [ 1 1 2 A 22-year-old man was admitted to Ghaem teaching hospital, Mashhad, Iran with 3 months history of dyspnea on exertion and chest heaviness. He had no other chest, constitutional symptoms or signs of autoimmune disorders. On physical examination the only abnormal finding was complete absence of vesicular breath sounds in the left hemithorax. Posteroanterior chest radiograph revealed a huge fat density obscuring the left heart and mediastinal border ( Figure 1 Figure 1 Chest radiograph of the case showing huge mass with fat density in left hemithorax obscuring left heart border Chest computed tomography (CT) showed a large mass (22 × 19 × 17 cm) with fat density admixed with soft tissue strands occupying the anterosuperior mediastinum extending to the left hemithorax ( Figure 2 Figure 3 Figure 2 Chest computed tomography of the case representing huge left mass comprising fat density with strands of soft tissue density with mild compressing effect on the heart pushing it to the right Figure 3 Intra-operative view of soft encapsulated large mass removed totally via left thoracotomy A large encapsulated tumor with a yellowish elastic surface and soft yellowish fatty tissue by incision was removed ( Figure 4 Figure 4 Excised soft encapsulated mass (31 × 15 × 12 cm) The postoperative period was uneventful, and the patient was discharged on the 5 th Lange reported the first case of thymolipoma in 1612, but the term of thymolipoma was used many years later by Eid et al. 3 Many different pathogenic mechanisms have been proposed for thymolipoma [ 4 Patients are usually asymptomatic, but most patients complain of vague symptoms in the chest because of compression of fatty tissue on adjacent structures including the heart, the great vessels, the lungs or the bronchi [ 5 6 7 8 As in the case of thymoma, thymolipoma can present with some autoimmune disorders such as myasthenia gravis, systemic lupus erythematosus, hypogammaglobulinemia, Graves’ disease and red cell aplasia (RCA) [ 9 et al. 10 Characteristic CT findings include a usually huge mass originating from or connected to the thymus gland with fatty tissue and soft tissue strands as islands of normal thymic components [ 11 12 13 As thymolipoma is a benign neoplasm with no reported case of recurrence, its main treatment is complete surgical removal. Preoperative tissue diagnosis with biopsy is not usually needed. The surgical approach to resection of thymolipoma is through sternotomy, anterolateral thoracotomy, clamshell incision or sternotomy accompanied by anterolateral thoracotomy (hemi-clamshell incision). The natural course of thymolipoma after surgical removal is usually uneventful [ 14 et al. 9 To the best of our knowledge this is the first case of thymolipoma surgical treatment with 10 years’ symptom-free follow-up. Our patient had no sign of recurrence or autoimmune disorders after about one decade, emphasizing the benign nature of thymolipoma. This is one of the longest symptom-free survival reports of thymolipoma after surgical removal with about one decade of no complaints or autoimmune symptoms. This case report emphasizes the benign nature of thymolipoma after surgical removal even after many years.  Disclosure The authors report no conflict of interest. References 1 Nishino M Ashiku SK Kocher ON Thurer RL Boiselle PM Hatabu H The thymus: a comprehensive review Radiographics 2006 26 335 348 16549602 10.1148/rg.262045213 2 Premananth P Dhanasekar T Baby MK Rajagopalan B Thymolipoma: a rare, large anterior mediastinal mass J Evol Med Dental Sci 2015 4 10556 10562 3 Eid HA Ali AE Elsabry MA Enormous thymolipoma: a case report Egypt J Bronchol 2017 11 165 167 4 Mourad OM Andrade FM Abrahão P Monnerat A Judice LF Asymptomatic giant mediastinal mass: a rare case of thymolipoma J Brasil Pneumol 2009 35 1049 1052 10.1590/s1806-37132009001000012 19918636 5 Moschos C Kalomenidis I Roussos C Stathopoulos GT A 35-year-old male with chronic cough Eur Respir J 2007 29 608 611 17329496 10.1183/09031936.00099706 6 Roque C Rodríguez P Quintero C Santana N Hussein M Freixinet J Giant thymolipoma Arch Bronconeumol 2005 41 402 403 16029736 10.1016/s1579-2129(06)60250-4 7 Dongel I Imamoglu H Şahin AF Yıldırım S Bayram M A rare mediastinal tumor: thymolipoma Eur J General Med 2014 11 Suppl 1 21 23 8 Ceran S Tulek B Sunam G Suerdem M Respiratory failure caused by giant thymolipoma Ann Thor Surg 2008 86 661 663 10.1016/j.athoracsur.2008.02.042 18640359 9 Rieker RJ Schirmacher P Schnabel PA Moser K Hoffmann H Dienemann H Pfannschmidt J Thymolipoma. A report of nine cases, with emphasis on its association with myasthenia gravis . Surgery Today 2010 40 132 136 20107952 10.1007/s00595-009-4042-5 10 Huang CS Li WY Lee PC Kao KP Chou TY Wu MH Hsu HS Wu YC Hsu WH Huang BS Analysis of outcomes following surgical treatment of thymolipomatous myasthenia gravis: comparison with thymomatous and non-thymomatous myasthenia gravis Inter Cardiovasc Thorac Surg 2013 18 475 481 10.1093/icvts/ivt531 PMC3957287 24366316 11 Bogot NR Quint LE Imaging of thymic disorders Cancer Imaging 2005 5 139 149 16361143 10.1102/1470-7330.2005.0107 PMC1665238 12 Vaziri M Rad K Progressive dyspnea in a 40-year-old man caused by giant mediastinal thymolipoma Case Rep Surg 2016 2016 3469395 27293949 10.1155/2016/3469395 PMC4886086 13 Shirkhoda A Chasen MH Eftekhari F Goldman AM Decaro LF MR imaging of mediastinal thymolipoma J Comput Assist Tomogr 1987 11 364 365 3819147 10.1097/00004728-198703000-00040 14 Baby MK Thymolipoma, mediastinum, thymus, histopathological, neoplasm Thymolipoma: a rare, large anterior mediastinal mass 2015 Jul 27 8521 ",
  "metadata": {
    "Title of this paper": "Thymolipoma, mediastinum, thymus, histopathological, neoplasm",
    "Journal it was published in:": "Kardiochirurgia i Torakochirurgia Polska = Polish Journal of Cardio-Thoracic Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487640/"
  }
}