{
  "title": "Paper_3",
  "abstract": "pmc Case Rep Med Case Rep Med 945 casrepmed CRIM Case Reports in Medicine 1687-9627 1687-9635 Wiley PMC12490913 PMC12490913.1 12490913 12490913 10.1155/carm/1490289 1 Case Report A Heterozygous Variant in HABP2 Al-Busaidi Salim  1 Al-Maqrashi Nasiba  2  3 https://orcid.org/0000-0001-7518-4615 Al-Thihli Khalid  4 Al Rawahi Bader  3 Al Farhan Hatem  1 https://orcid.org/0000-0003-2077-7186 Al Alawi Abdullah M. alalawi2@squ.edu.om  1  2  1  2  3  4 Academic Editor: Andee Dzulkarnaen Zakaria 2025 25 9 2025 2025 479320 1490289 28 2 2025 18 8 2025 1 9 2025 25 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Salim Al-Busaidi et al. Case Reports in Medicine published by John Wiley & Sons Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. Thrombosis is a major clinical issue, affecting venous and arterial circulation, increasing morbidity and mortality. While thrombophilia syndromes are established, new genetic polymorphisms in the hyaluronan binding protein 2 (HABP2) HABP2 HABP2 Keywords genetic polymorphism HABP2 myocardial infarction stroke thrombophilia thrombosis The authors declare that no funding was received for this study. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Thrombosis is the pathological formation of intravascular blood clots, affecting both venous and arterial circulation, thereby causing disruption to blood flow and leading to consequential clinical outcomes [ 1 1 2 2 3 Our comprehension of thrombosis throughout history has been shaped by “Virchow's triad,” introduced by Rudolf Virchow in 1856. This triad encapsulates three essential factors: damage to the endothelial lining of blood vessels, a hypercoagulable state, and arterial or venous blood stasis [ 4 5 Genetic variation plays a significant role in determining the risk of thrombosis, even though only a small fraction of patients with thrombosis are discovered to have one of the five established heritable causes of thrombophilia: Factor V Leiden, Prothrombin G20210A mutation, antithrombin (AT) deficiency, protein C (PC) deficiency, and protein S (PS) deficiency [ 6 8 9 6 9 Here, we present a rare and challenging case involving a 31-year-old male with no prior medical comorbidities apart from smoking. He experienced arterial and venous thrombosis events including myocardial infarction, ischemic stroke, and left upper extremity deep venous thrombosis. A comprehensive, multidisciplinary approach was undertaken to evaluate causes of his extensive thrombosis, including investigations for thrombophilia, atherosclerosis, thromboembolism, medications, substances, vascular and anatomical abnormalities, and systemic disorders. WES revealed a heterozygous variant in hyaluronan binding protein 2 (HABP2) 10 11 2. Case Presentation A 31-year-old male with long-standing angina and smoking history presented to the emergency on January 10, 2024, with central chest pain associated with shortness of breath and sweating. The patient collapsed on arrival, and cardiopulmonary resuscitation (CPR) was initiated. The initial rhythm was VF for which he received several electrical shocks as well as epinephrine and amiodarone as per advanced cardiac life support (ACLS). Return of spontaneous circulation (ROSC) was achieved after 11 cycles and he required intubation. Initial ECG revealed junctional rhythm with ST-segment elevation in inferolateral leads ( Figure 1 The patient had a complex hospital course. He had oliguric AKI and profound unexplained rhabdomyolysis that peaked at a value of CK 580,000 U/L with negative autoimmune workup as well as muscle biopsy. He also developed severe thrombocytopenia consistent with eptifibatide-induced thrombocytopenia (nadir platelet count: 13 × 10 9 On Day 8, the patient showed weakness in the right upper and lower limbs (motor scale of 3/5 for both) without any voluntary movement on the left side. The brain MRI showed multifocal ischemic brain infarctions ( Figure 2 Coronary angiography excluded atherosclerosis and magnetic resonance imaging of the intracranial arteries was normal. No specific aortic or carotid imaging was done unfortunately. The possibility of embolic sources was entertained but the echocardiogram with bubble studies was noncontributory and there were no any arrhythmias after the admission. Other vascular anatomy appeared normal on multiple imaging studies. Drug-induced thrombosis was considered, but it did not appear that the patient used illicit drugs. Investigations to rule out other systemic disorders with a pan-CT excluding malignancy as well as OGD and colonoscopy with biopsies are normal. Hematological and autoimmune workup is listed in Table 1 Considering the severe renal impairment, intravenous heparin was given and dual antiplatelet therapy was carefully introduced. The therapy had to be held in view of gastrointestinal bleed, anticoagulation was then cautiously restarted with heparin using low doses and slowly titrating to full-dose infusion. He eventually transitioned to apixaban, starting at 2.5 mg twice daily and later up titrated to 5-mg BID prior to discharge. The patient was discharged in a good clinical condition with improving neurological status and stable renal function. He was discharged home on apixaban and scheduled for further tight outpatient follow-up. Subsequently, the WES results were negative for CPT1 deficiency but revealed a heterozygous NM_004132.4 HABP2 After discharge, a follow-up included a virtual counseling session to discuss the results of his WES. A hematologist advised on long-term anticoagulation therapy with warfarin, targeting an INR of 2-3, or alternative direct oral anticoagulants (DOACs). Moreover, a comprehensive family history disclosed early-onset coronary artery disease in his father and the sudden death of his uncle, indicating an autosomal-dominant manner of inheritance as well (family lineage; Figure 3 HABP2 This case highlights important clinical challenges in managing thrombosis associated with rare genetic variants in genes associated with increased risk of thrombophilia like HABP2 3. Discussion This case presents a rare and complex scenario involving a 31-year-old male with no significant medical history aside from smoking, who developed multiple thrombotic events, including myocardial infarction, ischemic stroke, and DVT in the left upper extremity. The unusual combination of both arterial and venous thrombosis in a young, otherwise, healthy individual prompted a thorough and multidisciplinary approach to guide the management. The patient underwent extensive thrombophilia evaluation which was negative. WES resulted in identification of a heterozygous specifically the p.(Asp193del) variant ( NM_004132.4 HABP2 The HABP2 12 13 Despite the classification as a variant of unknown significance, the role of HABP2 12 14 15 Recent research highlights the connection between HABP2 HABP2 p 16 HABP2 17 HABP2 NM_004132.4 In our patient, the combination of venous and arterial thrombosis in the absence of clear atherosclerosis and negative conventional thrombophilia workup suggests a genetic predisposition as a compelling mechanism for this unusual presentation. Although the exact role of the HABP2 11 18 19 21 HABP2 22 There is insufficient evidence in the literature to guide an optimal antithrombotic strategy for patients with inherited genetic thrombophilias, with most sources recommending longer term anticoagulation [ 23 24 Further clarification of the family history, as outlined in the family pedigree, suggests a possible autosomal dominant inheritance pattern, making the role of this gene mutation more compelling in explaining our patient's complex thrombosis. This pattern of inheritance has also been reported in cases of familial nonmedullary thyroid cancer involving the same gene mutation [ 15 In summary, this case highlights the complexity of managing arterial and venous thrombosis in a young patient with a HABP2 4. Conclusion This case report highlights the challenges of diagnosing and managing a complex, stormy disease course triggered by thrombotic events in a young patient with a HABP2 HABP2 Data Availability Statement The datasets generated and/or analyzed during the current study are available from the corresponding author upon reasonable request. Patient Perspective Patient consent was obtained. Disclosure All authors have read and approved the final manuscript. Conflicts of Interest All authors declare no conflicts of interest. Author Contributions All authors had access to the data and contributed to writing the manuscript. Salim Al-Busaidi and Nasiba Al-Maqrashi contributed significantly to the conception, design, data collection, and drafting of the manuscript. Khalid Al-Thihli provided genetic expertise, assisted with data interpretation, and contributed to manuscript revisions. Bader Al Rawahi supported the clinical management of the patient and provided critical feedback on the manuscript. Abdullah M. Al Alawi and Hatem Al Farhan oversaw the multidisciplinary management of the patient, revised the manuscript, and provided feedback. 1 Mackman N. Triggers, Targets and Treatments for Thrombosis Nature 2008 451 7181 914 918 10.1038/nature06797 2-s2.0-39749109478 18288180 PMC2848509 2 Raskob G. E. Angchaisuksiri P. Blanco A. N. Thrombosis: A Major Contributor to Global Disease Burden Arteriosclerosis, Thrombosis, and Vascular Biology 2014 34 11 2363 2371 10.1161/atvbaha.114.304488 25304324 3 Wendelboe A. M. Raskob G. E. Global Burden of Thrombosis: Epidemiologic Aspects Circulation Research 2016 118 9 1340 1347 10.1161/circresaha.115.306841 2-s2.0-84968584117 27126645 4 Chung I. Lip G. Y. Virchow’s Triad Revisited: Blood Constituents Pathophysiology of Haemostasis and Thrombosis 2003 33 5-6 449 454 10.1159/000083844 2-s2.0-14044276226 15692259 5 May J. E. Moll S. Unexplained Arterial Thrombosis: Approach to Diagnosis and Treatment Hematology 2021 2021 1 76 84 10.1182/hematology.2021000235 34889390 PMC8791102 6 Lee E. J. Dykas D. J. Leavitt A. D. Whole-Exome Sequencing in Evaluation of Patients With Venous Thromboembolism Blood Advances 2017 1 16 1224 1237 10.1182/bloodadvances.2017005249 2-s2.0-85033388606 29296762 PMC5728544 7 Lee E.-J. Dykas D. Bale A. Whole Exome Sequencing in Evaluation of Thrombophilia: A Novel 33-Gene Panel Blood 2015 126 23 p. 3529 10.1182/blood.v126.23.3529.3529 8 Shevell L. M. Lee E.-J. Dhodapkar R. Whole Exome Sequencing and Extended Thrombophilia Testing in Patients With Venous Thromboembolism Blood 2018 132 Supplement 1 p. 2506 10.1182/blood-2018-99-115529 9 Lunghi B. Ziliotto N. Balestra D. Whole-Exome Sequencing in a Family With an Unexplained Tendency for Venous Thromboembolism: Multicomponent Prediction of Low-Frequency Variant Deleteriousness and of Individual Protein Interaction International Journal of Molecular Sciences 2023 24 18 p. 13809 10.3390/ijms241813809 PMC10530467 37762110 10 Cheng Y. Stanne T. Giese A. Genome-Wide Association Analysis of Young-Onset Stroke Identifies a Locus on Chromosome 10q25 near HABP2 Stroke 2016 47 2 307 316 10.1161/strokeaha.115.011328 2-s2.0-84969389433 26732560 PMC4729659 11 Mambetsariev N. Mirzapoiazova T. Mambetsariev B. Hyaluronic Acid Binding Protein 2 is a Novel Regulator of Vascular Integrity Arteriosclerosis, Thrombosis, and Vascular Biology 2010 30 3 483 490 10.1161/atvbaha.109.200451 2-s2.0-77649084110 20042707 PMC2825278 12 HABP2 Hyaluronan Binding Protein 2 [ Homo sapiens (US) NLoM 2024 National Center for Biotechnology Information 13 Sumiya J. Asakawa S. Tobe T. Isolation and Characterization of the Plasma Hyaluronan-Binding Protein (PHBP) Gene (HABP2) Journal of Biochemistry 1997 122 5 983 990 10.1093/oxfordjournals.jbchem.a021861 2-s2.0-0030772845 9443814 14 Mirzapoiazova T. Mambetsariev N. Lennon F. E. HABP2 is a Novel Regulator of Hyaluronan-Mediated Human Lung Cancer Progression Frontiers in Oncology 2015 5 p. 164 10.3389/fonc.2015.00164 2-s2.0-84940100723 PMC4508840 26258071 15 Gara S. K. Jia L. Merino M. J. Germline HABP2 Mutation Causing Familial Nonmedullary Thyroid Cancer New England Journal of Medicine 2015 373 5 448 455 10.1056/nejmoa1502449 2-s2.0-84938346586 26222560 PMC4562406 16 Chen W. Li J. Zhou J. Yi X. Chen H. Inflammation and Endothelial Gene Polymorphism are Associated With Ischemic Stroke Frontiers in Neurology 2025 16 10.3389/fneur.2025.1465559 PMC11835671 39974357 17 Sponziello M. Durante C. Filetti S. HABP2 Mutation and Nonmedullary Thyroid Cancer New England Journal of Medicine 2015 373 2085 2086 10.1056/NEJMc1511631 2-s2.0-84952719124 26581004 18 Stavenuiter F. Ebberink E. Mertens K. Meijer A. Role of Glycine 221 in Catalytic Activity of Hyaluronan-Binding Protein 2 Journal of Biological Chemistry 2017 292 15 6381 6388 10.1074/jbc.m116.757849 2-s2.0-85017685412 28246168 PMC5391765 19 Zakai N. A. Lange L. Longstreth W. T. Association of Coagulation-Related and Inflammation-Related Genes and Factor VIIc Levels With Stroke: The Cardiovascular Health Study Journal of Thrombosis and Haemostasis 2011 9 2 267 274 10.1111/j.1538-7836.2010.04149.x 2-s2.0-79251581612 21114618 PMC3030667 20 Miller G. E Webb K. Cooper J. Humphries S. Ireland H. The Factor VII Activating Protease G511E (Marburg) Variant and Cardiovascular Risk Thrombosis and Haemostasis 2004 92 11 986 992 10.1160/th04-05-0275 2-s2.0-9144235694 15543324 21 Hoppe B. Tolou F. Radtke H. Kiesewetter H. Dörner T. Salama A. Marburg I Polymorphism of Factor VII-Activating Protease is Associated With Idiopathic Venous Thromboembolism Blood 2005 105 4 1549 1551 10.1182/blood-2004-08-3328 2-s2.0-13544261410 15486068 22 Parahuleva M. Muhl L. Kemkes-Matthes B. Sedding D. Preissner K. T. Kanse S. M. Factor VII-Activating Protease (FSAP): Vascular Functions and Role in Atherosclerosis Thrombosis and Haemostasis 2008 99 02 286 289 10.1160/th07-10-0640 2-s2.0-38949131230 18278176 23 Cushman M. Inherited Risk Factors for Venous Thrombosis Hematology 2005 2005 1 452 457 10.1182/asheducation-2005.1.452 2-s2.0-33748481507 16304419 24 Bojovski I. Stankovic S. Petlichkovski A. Bosevski M. Duration of Anticoagulation Therapy in Patients With Genetic Inherited Thrombophilia Pril 2022 43 2 33 40 10.2478/prilozi-2022-0016 35843922 Figure 1 Electrocardiography of the patient on presentation. Figure 2 Brain MRI showing multiple area of infracts involving bilateral cerebellum and right frontal. Figure 3 Detailed family pedigree highlighting inherited thrombosis risk. Table 1 Relevant hematological and autoimmune workup. Protein C functional chromogenic > 1.5  Protein S functional 1.413  Paroxysmal nocturnal hemoglobinuria (PNH) Negative for PNH clone on neutrophils and monocytes  Heparin-induced thrombocytopenia (HIT) Screening for antiheparin-platelet factor 4 (PF4) antibodies (IgG) by rapid test using STic Expert HIT is negative  Myeloproliferative neoplasms (MPNs) Negative JAK2 (V617F), JAK2 exon12–14, CALR exon 9  Antinuclear antibody (ANA) 1/80  Extractable nuclear antigen (ENA) Negative  Anti-double-stranded deoxyribonucleic acid antibodies (dsDNA Abs) < 1  Anti-B 2 glycoprotein 1 < 1  Anticardiolipin antibody 1  Lupus anticoagulant (LA) Not detected  Antiproteinase 3 Negative  Antimyeloperoxidase Negative ",
  "metadata": {
    "Title of this paper": "Duration of Anticoagulation Therapy in Patients With Genetic Inherited Thrombophilia",
    "Journal it was published in:": "Case Reports in Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490913/"
  }
}