{
  "title": "Paper_135",
  "abstract": "pmc Front Pharmacol Front Pharmacol 1524 frontpharmacol Front. Pharmacol. Frontiers in Pharmacology 1663-9812 Frontiers Media SA PMC12488592 PMC12488592.1 12488592 12488592 10.3389/fphar.2025.1673086 1673086 1 Pharmacology Case Report Severe skin toxicity and early progression following neoadjuvant ensartinib and surgery in anaplastic lymphoma kinase-positive locally advanced lung cancer: a case report Wang et al. 10.3389/fphar.2025.1673086 Wang Hongming  1 Li Shiyan  1 Wu Zhijun  1 Xu Wei  2 Wang Nuoni  3 *  † Xiao Zemin  1 *  †  1 Department of Oncology, Changde Hospital, Xiangya School of Medicine, Central South University, The First People’s Hospital of Changde City Changde China  2 Department of Thoracic Surgery, Changde Hospital, Xiangya School of Medicine, Central South University, The First People’s Hospital of Changde City Changde China  3 Department of Electrophysiology, Changde Hospital, Xiangya School of Medicine, Central South University, The First People’s Hospital of Changde City Changde China  Edited by: Ji Yichun  Reviewed by: Fu Gao  Shuhui Li *Correspondence: Nuoni Wang, wangnuoni2023@163.com xiaozemindoc@126.com  † These authors have contributed equally to this work and share last authorship 18 9 2025 2025 16 480654 1673086 25 7 2025 09 9 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Wang, Li, Wu, Xu, Wang and Xiao. 2025 Wang, Li, Wu, Xu, Wang and Xiao https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Anaplastic lymphoma kinase (ALK) fusion mutations exhibit exceptional sensitivity to tyrosine kinase inhibitors (TKIs) in patients with advanced non-small cell lung cancer (NSCLC). Ensartinib, a second-generation ALK-TKI, represents a promising therapeutic option for ALK mutation-associated NSCLC; however, its clinical application in perioperative therapy remains to be elucidated. Case description We report the case of a 45-year-old female diagnosed with stage IIIA (cT2N2M0, AJCC eighth edition) adenocarcinoma of the right lung harboring an EML4-ALK fusion (E6:A20) and a TP53 mutation. Following 3-month neoadjuvant therapy with ensartinib, surgical conversion from R(un) to R0 resection was achieved, accompanied by histopathological assessment and confirmation of a major pathological response (MPR) (<10% viable tumor cells) and negative postoperative molecular residual disease (MRD) surveillance. Despite effective neoadjuvant targeted therapy and the absence of significant adverse events, the patient experienced drug-refractory grade 3 cutaneous toxicity (CTCAE v5.0) 4 weeks after surgery and was subsequently found to have a T12 vertebral metastasis on 3-month surveillance imaging. After multidisciplinary evaluation and considering the patient’s refusal to undergo local therapies, treatment was switched to lorlatinib. The patient subsequently experienced complete resolution of skin toxicity, sustained disease control, and a significantly improved quality of life. Conclusion This case report describes a patient with an MPR subsequent to neoadjuvant ensartinib, who nonetheless developed early postoperative progression. Our case cautions that although MPR and MRD negativity can strongly predict lower recurrence risk, these markers may not universally guarantee long-term remission in every individual. The case underscores the need for continued vigilance and individualized surveillance strategies even once favorable pathological responses are achieved. Additionally, the perioperative evolution of skin toxicity highlights the importance of continuous adverse event monitoring and management. neoadjuvant ensartinib anaplastic lymphoma kinase (ALK) lung cancer skin toxicity early progression The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Pharmacology of Anti-Cancer Drugs 1 Introduction Non-small cell lung cancer (NSCLC) represents approximately 85% of all diagnosed lung cancer cases, with adenocarcinoma being the predominant subtype, followed by squamous cell carcinoma ( Thai et al., 2021 Tan and Tan, 2022 Gandhi et al., 2015 Molecular Pathology Collaboration Group of Tumor Pathology Committee of China Anti-Cancer Association et al., 2023 Zhang et al., 2021 NCT02767804 Horn et al., 2021 Stage III NSCLC exhibits significant heterogeneity, posing a clinical challenge for optimal treatment selection. Unlike stage IV disease, stage III NSCLC is potentially curable and warrants aggressive management. Multidisciplinary team consensus is essential for defining individualized treatment, and requires input from thoracic surgery, radiation oncology, medical oncology, respiratory medicine, pathology, and radiology specialists. For patients harboring driver gene-negative stage II–III NSCLC, neoadjuvant chemotherapy has been replaced by neoadjuvant immunotherapy combined with chemotherapy, unless contraindications to immunotherapy exist. This paradigm shift is supported by robust evidence from multiple large-scale phase III clinical trials ( Forde et al., 2022 Wakelee et al., 2023 Yue et al., 2025 Lee et al., 2023 This report describes the case of a patient with stage IIIA ALK-positive NSCLC who underwent R0 resection following neoadjuvant therapy with ensartinib. The patient achieved a major pathological response (MPR) and pathological downstaging but developed a grade 3 rash and experienced early postoperative progression, highlighting the multifaceted challenges in the perioperative use of ALK-TKIs. 2 Case presentation 2.1 Clinical information A 45-year-old Chinese woman incidentally presented with a 32 × 24 mm mass in the right-upper lung lobe with enlarged mediastinal nodes (stations 2R and 4R per IASLC classification) on chest computed tomography (CT) images during a checkup visit on 14 November 2023. The findings were suggestive of lung cancer with possible lymph node metastases ( Figure 1A Figure 1B FIGURE 1 Images before and after neoadjuvant targeted therapy with ensartinib. (A) (B) (C) Three sets of axial view medical imaging scans. Panel A shows CT scans with arrows indicating lesions in each scan. Panel B displays PET/CT scans highlighting areas of bright uptake with arrows. Panel C presents follow-up CT scans with arrows marking the lesions. Each row shows progressive changes in size and position of the lesions. 2.2 Course of treatment Given the metastatic involvement of upper mediastinal lymph nodes (station 2R), the surgical outcome was initially classified as an uncertain resection [R(un)]. Following multidisciplinary consensus, neoadjuvant ensartinib 225 mg daily was initiated on 11 December 2023. No significant adverse effects were observed. Imaging after 3 months revealed a partial response (PR) per RECIST 1.1 criteria, with significant regression of the primary lesion and metastatic lymph nodes ( Figure 1C 2.3 Toxicity and disease progression At 4 weeks postoperatively, the patient developed CTCAE v5.0 grade 3 dermatological toxicity characterized by a pruritic rash. This adverse event persisted despite stepwise dose reduction (from 225 mg to 150 mg) and combination therapy with systemic corticosteroids and antihistamines ( Figure 2 Figure 3 FIGURE 2 Cutaneous adverse events associated with ensartinib therapy. Grade 3 skin toxicity developed postoperatively in this patient, characterized by rash, pruritus, and visible scratching on the extremities (A–C) (D) Four images labeled A to D show a person with a multitude of skin lesions. Image A displays the forearms, B the front of the legs, C the back of the legs, and D the back, all with similar skin markings. FIGURE 3 Images before and 3 months after surgery. (A) (B) (C,D) Panels A and B are CT scans showing a lesion near the vertebra with red arrows indicating the location. Panel C is an MRI highlighting the same area, marked by a red arrow. Panel D is a PET scan displaying metabolic activity in the region, also marked by a red arrow. 2.4 Adjustment of treatment program and follow-up Following reassessment by the multidisciplinary team, ensartinib was switched to lorlatinib (100 mg daily) on 22 June 2024, which achieved complete resolution of cutaneous toxicity within 14 days, although asymptomatic grade 1 hyperlipidemia (CTCAE v5.0) remained, requiring atorvastatin management. Serial radiographic surveillance demonstrated sustained disease stability with preserved quality of life (ECOG PS 0) through the 13-month follow-up. Longer-term monitoring will evaluate response durability and inform future clinical strategies. Her therapeutic timeline is depicted in Figure 4 FIGURE 4 The patient’s therapeutic timeline. Timeline depicting a patient's treatment journey with right lung adenocarcinoma. Diagnosed on December 6, 2023, followed by neoadjuvant ensartinib therapy for three months. Right-upper lung lobectomy and lymph node dissection on March 15, 2024, then adjuvant ensartinib therapy for three months. A pruritic rash occurred, followed by early disease progression. Switched to targeted therapy with lorlatinib on June 22, 2024. 3 Discussion NSCLC represents a paradigm of precision therapy. ALK fusion-targeted treatment significantly benefits patients and has earned the “diamond target” designation. However, not all ALK fusion variants respond well to ALK-TKIs, as they rarely occur alone and often co-mutate with other genes. These variants and co-mutations complicate clinical management ( Zhang et al., 2021 Christopoulos et al., 2018 Zhang et al., 2021 In a real-world study that included 307 patients with advanced ALK-positive NSCLC, 50% of patients harbored the ALK fusion V1, and 36% had ALK fusion V3. The co-occurrence frequencies of ALK fusion V1 with TP53mt and ALK fusion V3 with TP53mt were 18% and 14%, respectively. For the entire cohort, the median time to discontinuation (TTD) for first-line targeted therapy was 19.9 months (95% confidence interval [CI]: 13.8–28.7). By subgroup analysis, the median TTD was not evaluable (NE) (95% CI: 14.3–NE) for patients with TP53-ND (TP53 mutation not detected)/V1, compared with 17.1 months (95% CI: 8.7–37.5) for patients with TP53mt/V1. For patients harboring the TP53-ND/V3 variant, the median TTD was 23.8 months (95% CI: 9.4–NE), compared with only 7.4 months (95% CI: 4.2–31.1) for patients having the TP53mt/V3 variant ( Parikh et al., 2024 The EML4-ALK variants most described in clinical studies are variant 1 (V1) and variant 3a/b (V3) ( Zhang et al., 2021 Bayliss et al., 2016 Heuckmann et al., 2012 in vitro Heuckmann et al., 2012 Lin et al., 2018 Song et al., 2022 Zhou et al., 2022 Ou et al., 2017 TP53 mutations correlate with increased chromosomal instability and MYC amplification ( Alidousty et al., 2018 Zheng et al., 2020 Canale et al., 2022 Chan et al., 2025 Neoadjuvant targeted therapy for locally advanced NSCLC is an innovative strategy, aiming to reduce tumor size, improve surgical resectability, and thereby enhance postoperative survival rates. Currently, several clinical trials evaluating neoadjuvant targeted therapies have shown preliminary positive results that warrant further research and exploration ( Lee et al., 2023 NCT05380024 Lu et al., 2023 Wang et al., 2025 NCT05341583 To date, three published case reports have described ensartinib as neoadjuvant therapy for locally advanced ALK-positive NSCLC. All patients achieved tumor downstaging with complete surgical resection, demonstrating favorable pathological responses: one attained a pathological complete response (pCR) and two others achieved an MPR. Adverse events included mild rash ( n n Wang et al., 2022 Wu et al., 2023 Zhang et al., 2025 In our case, neoadjuvant targeted therapy with ensartinib was successful, the surgery achieved R0 resection, and postoperative histopathology showed an MPR, indicating that the tumor was highly sensitive to the treatment. Additionally, the postoperative molecular residual disease surveillance results were negative, suggesting a low risk of recurrence and a favorable prognosis. Nonetheless, 3 months after surgery, the patient developed bone metastasis, marking the failure of postoperative adjuvant therapy. Our results indicate that ALK mutation subtypes and co-mutations may be associated with therapeutic response and prognosis following neoadjuvant targeted therapy in early-stage NSCLC. Incorporating these genetic characteristics into regimen selection may be justified, pending confirmation in large-scale clinical studies. The early onset of bone metastases may indicate underlying tumor heterogeneity, potentially contributing to resistance to ensartinib. It is currently believed that the primary cause of postoperative recurrence in lung cancer is owing to the presence of preoperative occult micrometastases. However, these small metastases are beyond the detection capabilities of current imaging techniques. Over time, these hidden foci may “resurrect” and proliferate, eventually leading to tumor recurrence. Theoretically, since postoperative histopathology is not reflective of distant occult metastases, even patients evaluated as having achieved a pCR remain at risk for postoperative recurrence. Indeed, based on available data, approximately 15% of surgical patients who achieve a pCR after neoadjuvant immunochemotherapy will experience disease recurrence within 3 years ( Cascone et al., 2024 Spicer et al., 2024 Pathological evaluation of surgically resected lung cancer specimens after neoadjuvant therapy has become increasingly important with the growing use of pathological responses in clinical trials. Pathological response after neoadjuvant therapy serves as a validated prognostic indicator across multiple cancers, where a pCR and an MPR generally correlate with improved survival ( Allen et al., 2021 Shen et al., 2021 Chen et al., 2023 P Xu et al., 2025 In perioperative NSCLC management, circulating tumor DNA-based MRD (ctDNA-MRD) monitoring has emerged as a promising method for postoperative surveillance. ctDNA-MRD identifies potentially curable populations ( Zhang J. T. et al., 2022 Abbosh et al., 2023 Qiu et al., 2021 Herbst et al., 2025 NCT04385368 NCT04642469 The most common adverse reactions to ensartinib were skin-related adverse reactions, consistent with the results of previous studies ( Horn et al., 2021 Yang et al., 2020 in vitro Ning et al., 2013 Zhang and Yang, 2022b Wakelee et al., 2019 Desborough, 2000 Tanaka et al., 2014 Proksch et al., 2008 In conclusion, the case described herein supports the use of ensartinib as a promising targeted agent for neoadjuvant treatment of locally advanced ALK-mutant NSCLC. Nonetheless, based on previous literature, the established biomarkers, MPR and MRD, demonstrate incomplete predictive value for therapeutic efficacy. It should be kept in mind that treatment outcomes are also modulated by specific mutant subtypes and co-occurring genomic alterations, necessitating a comprehensive molecular characterization. Furthermore, the hierarchical management of toxicities associated with perioperative targeted therapy is crucial for ensuring patient quality of life and successful outcomes. We sincerely thank the patient for her valuable contribution and consent to publish this case report, as well as our radiology colleagues for providing the imaging data. Patient perspective The patient recognized our efforts and expressed his willingness to continue cooperating with follow-up treatment and to publish the case. Data availability statement The original contributions presented in the study are included in the article/supplementary material, further inquiries can be directed to the corresponding authors. Ethics statement The studies involving humans were approved by the Ethics Committee of The First People’s Hospital of Changde City (approval no: 2025-136-01; date: 11 April 2025). The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Written informed consent was obtained from the individual(s) for the publication of any potentially identifiable images or data included in this article. Author contributions HW: Conceptualization, Project administration, Resources, Writing – original draft, Writing – review and editing. SL: Investigation, Resources, Writing – review and editing. ZW: Investigation, Resources, Writing – review and editing. WX: Investigation, Resources, Writing – review and editing. NW: Supervision, Visualization, Writing – review and editing. ZX: Supervision, Visualization, Writing – review and editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Abbreviations ALK, Anaplastic lymphoma kinase; CT, Computed tomography; EGFR, Epidermal growth factor receptor; EML4, Echinoderm microtubule-associated protein-like 4; MPR, Major pathological response; MRD, Molecular residual disease; MRI, Magnetic resonance imaging; NGS, Next-generation sequencing; NSCLC, Non-small cell lung cancer; OS, Overall survival; pCR, Pathological complete response; PET-CT, Positron emission tomography-computed tomography; PFS, Progression-free survival; PR, Partial response; R(un), Uncertain resection; TKI, Tyrosine kinase inhibitor; TMB, Tumor mutational burden; TTD, Time to discontinuation. References Abbosh C. Frankell A. M. Harrison T. Kisistok J. Garnett A. Johnson L. 2023 Tracking early lung cancer metastatic dissemination in TRACERx using ctDNA Nature 616 7957 553 562 10.1038/s41586-023-05776-4 37055640 PMC7614605 Alidousty C. Baar T. Martelotto L. G. Heydt C. Wagener S. Fassunke J. 2018 Genetic instability and recurrent MYC amplification in ALK-Translocated NSCLC: a central role of TP53 mutations J. Pathol. 246 1 67 76 10.1002/path.5110 29885057 PMC6120547 Allen C. J. Pointer D. T. Jr. Blumenthaler A. N. Mehta R. J. Hoffe S. E. Minsky B. D. 2021 Chemotherapy versus chemotherapy plus chemoradiation as neoadjuvant therapy for resectable gastric adenocarcinoma: a multi-institutional analysis Ann. Surg. 274 4 544 548 10.1097/SLA.0000000000005007 34132693 PMC8988446 Bayliss R. Choi J. Fennell D. A. Fry A. M. Richards M. W. 2016 Molecular mechanisms that underpin EML4-ALK driven cancers and their response to targeted drugs Cell. Mol. Life Sci. 73 6 1209 1224 10.1007/s00018-015-2117-6 26755435 PMC4761370 Canale M. Petracci E. Cravero P. Mariotti M. Minuti G. Metro G. 2022 Prognosis of ALK-Rearranged non-small-cell lung cancer patients carrying TP53 mutations Transl. Oncol. 23 101471 10.1016/j.tranon.2022.101471 35779323 PMC9253903 Cascone T. Awad M. M. Spicer J. D. He J. Lu S. Sepesi B. 2024 Perioperative nivolumab in resectable lung cancer N. Engl. J. Med. 390 19 1756 1769 10.1056/NEJMoa2311926 38749033 Chan S. W. S. Zeng J. Young J. Barghout S. H. Al-Agha F. Raptis S. 2025 A poor prognostic ALK phenotype: a review of molecular markers of poor prognosis in ALK rearranged nonsmall cell lung cancer Clin. Lung Cancer 26 1 e22 e32.e2 10.1016/j.cllc.2024.10.009 39578168 Chen Y. Qin J. Wu Y. Lin Q. Wang J. Zhang W. 2023 Does major pathological response after neoadjuvant immunotherapy in resectable nonsmall-cell lung cancers predict prognosis? A systematic review and meta-analysis Int. J. Surg. 109 9 2794 2807 10.1097/JS9.0000000000000496 37247009 PMC10498860 Christopoulos P. Endris V. Bozorgmehr F. Elsayed M. Kirchner M. Ristau J. 2018 EML4-ALK fusion variant V3 is a high-risk feature conferring accelerated metastatic spread, early treatment failure and worse overall survival in ALK + Int. J. Cancer. 142 12 2589 2598 10.1002/ijc.31275 29363116 Desborough J. P. 2000 The stress response to trauma and surgery Br. J. Anaesth. 85 1 109 117 10.1093/bja/85.1.109 10927999 Forde P. M. Spicer J. Lu S. Provencio M. Mitsudomi T. Awad M. M. 2022 Neoadjuvant nivolumab plus chemotherapy in resectable lung cancer N. Engl. J. Med. 386 21 1973 1985 10.1056/NEJMoa2202170 35403841 PMC9844511 Gandhi S. Chen H. Zhao Y. Dy G. K. 2015 First-line treatment of advanced ALK-positive non-small-cell lung cancer Lung Cancer (Auckl., N.Z.) 6 71 82 10.2147/LCTT.S63491 28210152 PMC5217519 Herbst R. S. John T. Grohé C. Goldman J. W. Kato T. Laktionov K. 2025 Molecular residual disease analysis of adjuvant osimertinib in resected EGFR-mutated stage IB-IIIA non-small-cell lung cancer Nat. Med. 31 6 1958 1968 10.1038/s41591-025-03577-y 40097663 PMC12176615 Heuckmann J. M. Balke-Want H. Malchers F. Peifer M. Sos M. L. Koker M. 2012 Differential protein stability and ALK inhibitor sensitivity of EML4-ALK fusion variants Clin. Cancer Res. 18 17 4682 4690 10.1158/1078-0432.CCR-11-3260 22912387 Horn L. Wang Z. Wu G. Poddubskaya E. Mok T. Reck M. 2021 Ensartinib vs crizotinib for patients with anaplastic lymphoma kinase-positive non-small cell lung cancer: a randomized clinical trial JAMA Oncol. 7 11 1617 1625 10.1001/jamaoncol.2021.3523 34473194 PMC8414368 Lee J. M. McNamee C. J. Toloza E. Negrao M. V. Lin J. Shum E. 2023 Neoadjuvant targeted therapy in resectable NSCLC: current and future perspectives J. Thorac. Oncol. 18 11 1458 1477 10.1016/j.jtho.2023.07.006 37451404 PMC11040203 Lin J. J. Zhu V. W. Yoda S. Yeap B. Y. Schrock A. B. Dagogo-Jack I. 2018 Impact of EML4-ALK variant on resistance mechanisms and clinical outcomes in ALK-positive lung cancer J. Clin. Oncol. 36 12 1199 1206 10.1200/JCO.2017.76.2294 29373100 PMC5903999 Lu F. L. Lv C. Zhuo M. L. Yang X. Yan S. Chen J. F. 2023 EP07.05-02 NEOEAST: a phase II study of ensartinib as neoadjuvant therapy for stage II-IIIB ALK-rearranged non-small cell lung cancer J. Thorac. Oncol. 18 11_Suppl. l S558 10.1016/j.jtho.2023.09.1045 Molecular Pathology Collaboration Group of Tumor Pathology Committee of China Anti-Cancer Association, Chinese Medical Association Chinese Society of Oncology, Pathology Quality Control Center 2023 Expert consensus on clinical practice of fusion genes detection in non-small cell lung cancer in China (2023 version) Zhonghua Bing Li Xue Za Zhi 52 6 565 573 10.3760/cma.j.cn112151-20221111-00946 37263920 Ning H. Mitsui H. Wang C. Q. Suárez-Fariñas M. Gonzalez J. Shah K. R. 2013 Identification of anaplastic lymphoma kinase as a potential therapeutic target in basal cell carcinoma Oncotarget 4 12 2237 2248 10.18632/oncotarget.1357 24163262 PMC3926823 Ou S. H. I. Schrock A. B. Gowen K. Stephens P. J. Ross J. S. Johnson M. L. 2017 Association of ALK resistance mutations by EML4-ALK variant (v3 vs. non-v3) in ALK+ non-small cell lung cancer (NSCLC) J. Clin. Oncol. 35 15_Suppl. l 9010 10.1200/JCO.2017.35.15_suppl.9010 Parikh K. Dimou A. Leventakos K. Mansfield A. S. Shanshal M. Wan Y. 2024 Impact of EML4-ALK variants and co-occurring TP53 mutations on duration of first-line ALK tyrosine kinase inhibitor treatment and overall survival in ALK fusion-positive NSCLC: real-world outcomes from the guardant INFORM database J. Thorac. Oncol. 19 11 1539 1549 10.1016/j.jtho.2024.07.009 39019326 Proksch E. Brandner J. M. Jensen J. M. 2008 The skin: an indispensable barrier Exp. Dermatol. 17 12 1063 1072 10.1111/j.1600-0625.2008.00786.x 19043850 Qiu B. Guo W. Zhang F. Lv F. Ji Y. Peng Y. 2021 Dynamic recurrence risk and adjuvant chemotherapy benefit prediction by ctDNA in resected NSCLC Nat. Commun. 12 1 6770 10.1038/s41467-021-27022-z 34799585 PMC8605017 Shen J. Kong M. Yang H. Jin K. Chen Y. Fang W. 2021 Pathological complete response after neoadjuvant treatment determines survival in esophageal squamous cell carcinoma patients (NEOCRTEC5010) Ann. Transl. Med. 9 20 1516 10.21037/atm-21-3331 34790722 PMC8576689 Song Z. Lian S. Mak S. Chow M. Z. Y. Xu C. Wang W. 2022 Deep RNA sequencing revealed fusion junctional heterogeneity may predict crizotinib treatment efficacy in ALK-rearranged NSCLC J. Thorac. Oncol. 17 2 264 276 10.1016/j.jtho.2021.09.016 34626839 Spicer J. D. Garassino M. C. Wakelee H. Liberman M. Kato T. Tsuboi M. 2024 Neoadjuvant pembrolizumab plus chemotherapy followed by adjuvant pembrolizumab compared with neoadjuvant chemotherapy alone in patients with early-stage non-small-cell lung cancer (KEYNOTE-671): a randomised, double-blind, placebo-controlled, phase 3 trial Lancet 404 10459 1240 1252 10.1016/S0140-6736(24)01756-2 39288781 PMC11512588 Tan A. C. Tan D. S. W. 2022 Targeted therapies for lung cancer patients with oncogenic driver molecular alterations J. Clin. Oncol. 40 6 611 625 10.1200/JCO.21.01626 34985916 Tanaka T. Narazaki M. Kishimoto T. 2014 IL-6 in inflammation, immunity, and disease Cold Spring Harb. Perspect. Biol. 6 10 a016295 10.1101/cshperspect.a016295 25190079 PMC4176007 Thai A. A. Solomon B. J. Sequist L. V. Gainor J. F. Heist R. S. 2021 Lung cancer Lancet 398 10299 535 554 10.1016/S0140-6736(21)00312-3 34273294 Wakelee H. Reckamp K. Leal T. Chiappori A. Waqar S. Zeman K. 2019 P1.14-32 rash and efficacy in anaplastic lymphoma kinase positive (ALK+) non-small cell lung cancer patients treated with ensartinib J. Thorac. Oncol. 14 10_Suppl. l S566 10.1016/j.jtho.2019.08.1183 Wakelee H. Liberman M. Kato T. Tsuboi M. Lee S. H. Gao S. 2023 Perioperative pembrolizumab for early-stage non-small-cell lung cancer N. Engl. J. Med. 389 6 491 503 10.1056/NEJMoa2302983 37272513 PMC11074923 Wang C. Hu Q. Sun Y. Yu F. Peng M. 2022 Complete pathological remission after neoadjuvant ensartinib in patients with locally advanced lung adenocarcinoma and with CTLC-ALK and ALK-DHX8 rearrangements Eur. J. Cancer. 169 131 134 10.1016/j.ejca.2022.04.012 35567918 Wang L. Zhang J. Wang S. Dong S. Qiu X. Zhao L. 2025 Ensartinib as postoperative adjuvant therapy in patients with ALK-positive non-small cell lung cancer (NSCLC): a registered, retrospective, real-world study J. Clin. Oncol. 43 16_Suppl. l 8024 10.1200/JCO.2025.43.16_suppl.8024 Wu Y. Huang L. Li W. Chai Y. 2023 Neoadjuvant target therapy with ensartinib in lung adenocarcinoma with EML4-ALK fusion variant: a case report and literature review Anti-Cancer Drugs. 34 5 699 706 10.1097/CAD.0000000000001432 36730477 Xu Y. Ma D. Qin Y. Liu H. 2025 Prognostic significance of pathological response and lymph node status in neoadjuvant immunotherapy for potentially resectable non-small cell lung cancer Ann. Med. 57 1 2453825 10.1080/07853890.2025.2453825 39838946 PMC11755730 Yang Y. Zhou J. Zhou J. Feng J. Zhuang W. Chen J. 2020 Efficacy, safety, and biomarker analysis of ensartinib in crizotinib-resistant, ALK-positive non-small-cell lung cancer: a multicentre, phase 2 trial Lancet Respir. Med. 8 1 45 53 10.1016/S2213-2600(19)30252-8 31628085 Yue D. Wang W. Liu H. Chen Q. Chen C. Liu L. 2025 Perioperative tislelizumab plus neoadjuvant chemotherapy for patients with resectable non-small-cell lung cancer (RATIONALE-315): an interim analysis of a randomised clinical trial Lancet Respir. Med. 13 2 119 129 10.1016/S2213-2600(24)00269-8 39581197 Zhang S. S. Nagasaka M. Zhu V. W. Ou S. I. 2021 Going beneath the tip of the iceberg. Identifying and understanding EML4-ALK variants and TP53 mutations to optimize treatment of ALK fusion positive (ALK+) NSCLC Lung Cancer 158 126 136 10.1016/j.lungcan.2021.06.012 34175504 Zhang J. T. Liu S. Y. Gao W. Liu S. M. Yan H. H. Ji L. 2022a Longitudinal undetectable molecular residual disease defines potentially cured population in localized non-small cell lung cancer Cancer Discov. 12 7 1690 1701 10.1158/2159-8290.CD-21-1486 35543554 PMC9394392 Zhang L. Yang Y. P. Committee of Cancer Rehabilitation and Palliative Care of China Anti-Cancer Association, Expert Panel for Expert Consensus Development of Ensartinib in the Treatment of Anaplastic Lymphoma Kinase-Positive Non-Small Cell Lung Cancer 2022b Expert consensus on ensartinib in the treatment of anaplastic lymphoma kinase-positive non-small cell lung cancer Zhonghua Zhong Liu Za Zhi 44 4 297 307 10.3760/cma.j.cn112152-20220113-00033 35448917 Zhang H. Xia W. Zhang Y. Bao S. Zeng J. Li X. 2025 Ensartinib as a neoadjuvant therapy for stage IIIA non-small cell lung cancer patients with EML4-ALK fusion: a case report and literature review Front. Oncol. 15 1474997 10.3389/fonc.2025.1474997 40071084 PMC11893432 Zheng J. Zhu Y. Sun K. Shen Q. Wang Y. Cao H. 2020 Investigation on the prognostic impact of concurrent genomic alterations in crizotinib-treated EML4-ALK-rearranged advanced non-small cell lung cancer patients Lung Cancer 146 209 216 10.1016/j.lungcan.2020.05.026 32563740 Zhou X. He L. Fan Z. Zuo J. Feng L. Wang L. 2022 ALK fusion typing and response to crizotinib in ALK+ lung cancer-naive patients J. Clin. Oncol. 40 16_Suppl. l e21008 10.1200/JCO.2022.40.16_suppl.e21008 ",
  "metadata": {
    "Title of this paper": "ALK fusion typing and response to crizotinib in ALK+ lung cancer-naive patients",
    "Journal it was published in:": "Frontiers in Pharmacology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488592/"
  }
}