{
  "title": "Paper_204",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490211 PMC12490211.1 12490211 12490211 40845841 10.1016/j.xcrm.2025.102312 S2666-3791(25)00385-4 102312 1 Article Biomimetic nanoimmunotherapy boosts spatiotemporal PANoptosis and reshapes desmoplastic tumor microenvironment Huang Hui 1 7 Xiao Zebin 3 7 Feng Wei 1 5 7 Song Xinran 1 Chen Liang 1 Huang Lili huangll_@fudan.edu.cn 2 ∗ Ding Li dingli@tongji.edu.cn 4 ∗∗ Chen Yu chenyuedu@shu.edu.cn 1 5 6 8 ∗∗∗ 1 2 3 4 5 6 ∗ huangll_@fudan.edu.cn ∗∗ dingli@tongji.edu.cn ∗∗∗ chenyuedu@shu.edu.cn 7 These authors contributed equally 8 Lead contact 16 9 2025 21 8 2025 6 9 498186 102312 29 1 2025 25 5 2025 28 7 2025 21 08 2025 03 10 2025 03 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary Dendritic cell (DC)-based vaccines for solid tumors face major challenges, including limited tumor-specific antigens and immunosuppressive stroma. Here, we present a therapeutic nanovaccine (UCNP@MOF@MI@FM [UMMF]) composed of a DC/tumor fused cytomembrane-coated UCNP@MOF nanoparticle, co-loaded with a MutT homolog 1 (MTH1) inhibitor and combined with tetrahydrobiopterin (BH4). The fused membrane facilitates dual targeting to tumors and lymph nodes while enabling broad-spectrum tumor antigen presentation. Upon near-infrared (NIR) irradiation, upconversion-triggered reactive oxygen species (ROS) generation and MTH1 inhibition synergistically induce immunogenic PANoptosis, releasing antigens and promoting DCs maturation. Simultaneously, ROS remodels the tumor stroma by depleting collagen and cancer-associated fibroblasts, enhancing T cell infiltration. BH4 counteracts IDO-mediated kynurenine accumulation, reversing immune tolerance and restoring T cell function. This multifunctional platform integrates tumor cell killing, immune priming, and stromal reprogramming, resulting in robust antitumor immunity, reduced relapse, and metastasis suppression. UMMF offers a promising strategy for precision nanoimmunotherapy through controlled PANoptosis and microenvironment modulation. Graphical abstract Highlights • Biomimetic nanovaccine spatiotemporally triggers ROS-induced immunogenic PANoptosis • NIR light-programmed therapy reshapes the immunosuppressive tumor microenvironment • BH4 synergism with UMMF nanovaccine counteracts immunotherapy tolerance Huang et al. develop a multifunctional nanovaccine (UMMF) composed of a DC/tumor fused cytomembrane-coated UCNP@MOF nanoparticle, co-loading a MTH1 inhibitor and combined with tetrahydrobiopterin, that induces immunogenic PANoptosis and remodels the stromal and immune landscapes through multi-layered mechanisms to reinforce anti-tumor immunity against solid tumors. Keywords immunotherapy biomimetic nanomaterials nanovaccine PANoptosis tumor microenvironment pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: August 21, 2025 Introduction Cancer immunotherapy, which harnesses the immune system to combat tumors, has emerged as a transformative approach in cancer treatment. 1 , 2 , 3 4 , 5 , 6 , 7 in vivo 8 , 9 , 10 11 , 12 13 14 , 15 16 , 17 One promising avenue is the induction of immunogenic cell death (ICD), specifically PANoptosis, which is an emerging inflammatory programmed cell death pathway combining the key characteristics of pyroptosis, apoptosis, and necroptosis. 18 19 , 20 21 , 22 in situ Photodynamic therapy (PDT), which generates reactive oxygen species (ROS) in a spatiotemporally controlled manner upon light activation, 23 , 24 , 25 , 26 27 , 28 , 29 30 , 31 , 32 , 33 34 , 35 , 36 37 , 38 , 39 , 40 41 , 42 , 43 In this work, we present the strategic construction of a biomimetic UCNP@MOF-based DC/tumor FM vaccine enhancer and regulatory nanoplatform. This approach allows for efficient energy transfer from the upconversion nanoparticle (UCNP) core to the metal-organic framework (MOF) shell, enabling NIR light-triggered ROS production. The MTH1 inhibitor is encapsulated within the pores of the MOF shell, resulting in the UCNP@MOF@MI (UMM) nanoplatform. We then extracted the cytomembrane from DC/tumor fusion cells and coated the UMM nanoparticles with it, creating UCNP@MOF@MI@FM (UMMF). Unlike traditional DC/tumor FM vaccines, which may become physically trapped in the tumor stroma and inhibit T cell function due to antigen overexposure, our newly designed therapeutic nanovaccine has several key advantages as follows: (1) it directly targets tumor tissues and lymph nodes to present the full tumor antigen to CTLs, enhancing local anti-tumor immunity; (2) it spatiotemporally disrupts the tumor stroma via ROS-induced DNA damage, promoting T cell infiltration into the tumor core; and (3) it induces immunogenic PANoptosis in tumor cells, boosting host adaptive immunity by activating immature DCs, which then traffic to lymph nodes to prime and activate CTLs to eliminate the primary tumor. Furthermore, the inclusion of BH4 helps overcome immune resistance caused by excessive kynurenine accumulation, synergistically enhancing the anti-tumoral efficacy of this therapeutic nanovaccine. This nanoimmunotherapeutic strategy, based on the UMMF-potentiated light-controlled treatment and BH4 molecules, coordinately triggers robust immunity to suppress tumor growth, recurrence, and metastasis. Results Biosynthesis and characterization of UMMF The synthesis of NaYF 4 4 4 Figures S1 4 4 Figures 1 S1 4 4 4 Figure 1 Figure 1 Figures 1 Figure 1 44 Figure 1 Figure 1 Figure 1 Biosynthesis and characterization of UMMF (A) Transmission electron microscopy (TEM; A1, scale bars, 200 nm) and EDS elemental mapping images (A2, scale bars, 100 nm) of UCNPs. (B) TEM images (B1, scale bars, 50 nm), size distribution analysis (B2), and elemental mapping images (B3, scale bars, 50 nm) of UM. (C) EDS line scan profile of a single UM along the line displayed in the HAADF-STEM image (insets). (D) Powder X-ray diffraction pattern of UM. (E) UV-vis absorption of ZrMOFs (black) and fluorescence emission of UCNPs (red) under the 980 nm laser irradiation. (F) Fluorescence emission spectrum of ZrMOFs (black) and UM (red) under the 980 nm laser irradiation. (G) Representative flow cytometric images of CFSE-labeled 4T1 cells (left), anti-CD11c Percp-Cy5.5 antibody-labeled DCs (middle), and the tumor-DC fused cells (right). (H) Confocal laser scanning microscopy (CLSM) of the tumor-DC fused cells, in which the tumor cells were labeled with FITC-Dio (green), DCs were marked using Alexa Fluor 555-conjugated anti-CD11c (red), and nuclei were stained with DAPI (blue). Scale bars, 10 μm. (I) Sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE) of the membrane protein of 4T1 (CM), DCs (DM), and fused cells (FM). (J) Western blot analysis of the expression of membrane-specific protein markers, including EpCAM (upper), CD11c (middle), and Na + + (K) SDS-PAGE of the UM, FM, and UMMF. (L) Western blot analysis of EpCAM (upper), CD11c (middle), and Na + + (N) ζ potential of the UM, UMM, and UMMF, respectively. The numerical data are presented as the mean ± SEM ( n (O–Q) The absorption of 1,3-diphenylisobenzofuran (DPBF) in the NIR (O), UM upon NIR irradiation (P), and UMMF upon NIR irradiation (Q) over time. (R) The relative decreased absorption of DPBF at 425 nm in the conditions of NIR (blue), UM upon NIR irradiation (green), and UMMF upon NIR irradiation (red) over time. See also Figure S1 We then prepared the fused cells according to the established methods. 4 Figure S1 Figure 1 Figure S1 Figure 1 Figure S1 Figure 1 Figure 1 Next, we cloaked the nanoparticles of UMM with FM under ultrasound in the ice bath to formulate the UMMF. SDS-PAGE and WB analysis confirmed that UMMF preserved all the membrane proteins of FM, including the tumor cell’s and DC’s specific cell surface markers ( Figures 1 Figure 1 Figure 1 Figure S1 1 2 Figures 1 1 2 Figure S1 in vitro in vivo FM-mediated cellular uptake and UMMF-based ROS generation Subsequently, we explored in-depth the biological properties of UMMF in 4T1 mouse breast cancer cells. The cellular uptake and spatiotemporal distribution, crucial properties for a potential biological effect, of UCNP@MOF@FM (UMF) were investigated dynamically. With the prolongation of incubation time, an increasing amount of UMF was detected inside the cancer cells, with the peak of uptake at 8 h of co-incubation, and UMF inside the cancer cells was mainly accumulated in the lysosomes. After 8 h of co-incubation, the uptake of UMF did not evidently increase, and more UMF was secreted into the cytoplasm of tumor cells ( Figures 2 Figures 2 Figure 2 FM-mediated cellular uptake and UMMF-based ROS generation (A) Bio-TEM images of 4T1 tumor cells at 0, 2-, 4-, 8-, and 12-h co-incubation with UMF, respectively. Dashed boxes indicate the zoomed-in high-power TEM images. Red arrows indicate the location of UMF inside the tumor cells. Scale bars, 2 μm (top), 1 μm (bottom left), and 500 nm (bottom right). (B) The spatiotemporal localization and distribution of UMF inside the tumor cells were quantified ( n (C and D) Flow cytometric analysis (histogram images, C) and quantification (D) of FITC-labeled UM or UMF uptake by 4T1 tumor cells at 2-, 4-, 8-, and 12-h co-incubation, respectively ( n (E) Flow cytometric quantifications of ROS generation in 4T1 tumor cells after different treatments ( n (F and G) CLSM images (F) and quantifications (G) of DCFH-DA and DNA damage reactivated detector, Alexa Fluor 488-conjugated avidin, in 4T1 tumor cells treated with various formulations ( n p p p p A two-way ANOVA with Tukey’s multiple comparisons test (D) and a one-way ANOVA with Tukey’s multiple comparisons test (E and G) was used for statistical significance analysis. See also Figure S2 Given the aforementioned ability of ROS generation triggered by UMMF-based PDT, a fluorogenic probe of 2,7-dichlorofluorescein-diacetate (DCFH-DA) was adopted to detect the ROS in vitro Figures 2 S2 Figures 2 (Figures S2 UMMF-induced immunogenic PANoptosis in tumor cells Then, we systematically evaluated the in vitro Figures S2 Figure S2 To explore the underlying anti-tumor mechanism, we performed bulk RNA sequencing (RNA-seq) on untreated tumor cells and tumor cells co-incubated with UMMF following NIR irradiation. As shown in Figure 3 p Figure S2 Figures 3 Figures 3 S2 Figure 3 UMMF-induced immunogenic PANoptosis in tumor cells (A) Volcano plot of RNA-seq data displaying the gene expression comparing 4T1 tumor cells treated with UMMF upon NIR irradiation to no treatment controls (red, upregulated genes; blue, downregulated genes). (B) Bubble plot representation of Reactome enrichment analysis for the differentially expressed genes involved in pyroptosis- and apoptosis-associated signaling pathways. (C) Circular heatmap of differentially expressed genes related to apoptosis, pyroptosis, and necroptosis in 4T1 tumor cells subjected to various treatments ( n (D) Representative flow cytometric images (left) and quantifications (right) of apoptotic 4T1 tumor cells, measured by using annexin V-FITC/propidium iodide (PI) assay, respectively ( n (E) Necroptotic 4T1 tumor cells after different treatments observed by co-staining with YO-PRO-1/PI ( n (F) Bright field images of pyroptotic 4T1 tumor cells without treatment or treated with UMMF upon NIR irradiation ( n (G) Western blot analysis of caspase 8, RIPK3, MLKL, p-MLKL, ASC, NLRP3, caspase 1, cleaved caspase 1 (C-caspase 1), GSDMD, N-GSDMD, and ZBP1 in 4T1 tumor cells after various treatments ( n (H–J) IL-1β (H), IL-18 (I), and LDH (J) release in 4T1 tumor cells after different treatments ( n (K–N) CLSM and quantifications of HMGB1 (K and L; scale bars, 20 μm) and CRT (M and N; scale bars, 50 μm) in 4T1 tumor cells exposed to varied treatments (green, n (O) ATP secretion in 4T1 tumor cells after various treatments ( n The numerical data in (D, H–J, L, N, and O) are presented as the mean ± SEM. NS, not significant, ∗ p p p p A one-way ANOVA with Tukey’s multiple comparisons test (D, H–J, L, N, and O) was used for statistical significance analysis. See also Figure S2 PANoptosis is an inflammatory programmed cell death pathway modulated by the PANoptosome complex, incorporating key features of apoptosis, necroptosis, and pyroptosis. 18 Figure 3 Figure 3 Figure 3 45 Figure 3 Additionally, bright field observation revealed that 4T1 cells treated with UMMF and subjected to NIR irradiation exhibited swelling and the presence of large bubbles (indicated by red arrows), characteristic of pyroptosis initiation ( Figure 3 Figure 3 46 Figures 3 19 Figure 3 The PANoptotic process attracts inflammatory cells, thereby enhancing the inflammatory response. To determine whether ICD occurs during the PANoptosis of tumor cells induced by UMMF under NIR irradiation, the release of key immunostimulatory damage-associated molecular patterns, including high-mobility group protein 1 (HMGB1), adenosine triphosphate (ATP), and calreticulin (CRT), was assessed. Immunofluorescence (IF) staining was employed to assess HMGB1 release and CRT exposure in cancer cells. Notably, the UMMF treatment combined with NIR irradiation resulted in significantly lower intracellular HMGB content, but higher CRT expression compared to other treatment groups, including untreated cells, NIR alone, and UMF with or without NIR ( Figures 3 Figure 3 In vitro Next, we evaluated the ability of UMMF, under NIR irradiation, to initiate and activate immune responses in vitro Figure 4 Figures 4 S3 + + ex vivo Figures 4 S3 Figure 4 In vitro (A) Illustration of the indirect activation of naive T cells in vitro (B–D) Flow cytometric quantifications of the percentages of CD80 + + + + + + + n (E) Experimental design for direct activation of naive T cells in vitro (F and G) Flow cytometric quantifications of the percentages of CD4 + + + + n The numerical data in (B–D, F, and G) are presented as the mean ± SEM. NS, not significant, ∗ p p p p Figures S3 S4 Additionally, we assessed whether UMMF could directly activate T cells. Naive T cells were co-incubated with treatments including UM, UMF, and UMMF, with untreated naive T cells serving as the control ( Figure 4 + + Figures 4 S4 Figure S4 In vivo Encouraged by the aforementioned in vitro in vivo Figure 5 Figure S5 ex vivo Figure 5 ex vivo Figures 5 in vivo Figure S5 Figure 5 In vivo (A) Fluorescence imaging of the in vivo n (B–D) Representative fluorescence images and quantitative analysis of the radiant efficiency of Cy5.5 in excised tumors (B), spleen (C), and lymph nodes (D) with indicated treatments ( n (E) Scheme of treatment design for 4T1 tumor-bearing mice. (F) IF staining of dihydroethidium (DHE) in the tumors at endpoint with indicated treatments ( n (G) Tumor growth fold change curves for each treatment cohort in the 4T1 transplant model ( n (H) Bubble plot indicating selected pathways based on GO enrichment analysis on differentially expressed genes. (I) Heatmap showing differentially expressed genes related to negative regulation of T cell activation, negative regulation of T cell proliferation, T cell apoptotic process, and tolerance induction in late treatment tumors relative to early treatment tumors. (J) GSEA analysis of differentially expressed genes involved in negative regulation of T cell proliferation, negative regulation of T cell activation, aromatic amino acid family metabolic process, and indole-containing compound metabolic process. The numerical data in (B–D and G) are presented as the mean ± SEM. NS, not significant, ∗ p p p p Figure S5 Then, we explored the therapeutic capacity of UMMF under NIR irradiation to restrain tumor growth in vivo Figure 5 Figures 5 S5 Figure 5 To fully uncover the contributing factors that profoundly diminished the long-term efficacy of UMMF upon NIR irradiation, we collected the tumor tissues after treatment at day 8 (early stage) and day 15 (late stage) to perform bulk RNA-seq. We found that 187 genes (i.e., Mmp12 Ido1 Ido2 Itih5 Meg3 Ccl11 Figure S5 Figure 5 Figure 5 Ido1 Figures 5 S5 Ido1 36 , 37 , 38 42 40 Immunotherapeutic performance and mechanism of UMMF synergized with BH4 To evaluate the synergistic antitumor performance of the integrated BH4 molecule and UMMF-mediated PDT, a similar 4T1 breast cancer model was employed ( Figure 6 Figures 6 S6 Figures 6 S6 Figure S7 Figure S7 Figure S7 Figure 6 In vivo (A) Experimental timeline for the treatment of 4T1 tumor-bearing mice. (B and C) Tumor weight at endpoint (B) and modified Kaplan-Meier curves (C) for each treatment cohort. (D–I) H&E staining (D; scale bars, 100 μm), triple IF staining of Col-IA, α-SMA, and CD8 (D to G; scale bars, 100 μm), IF staining of CD4 (D and H; scale bars, 50 μm) and CD11c (D and I; scale bars, 50 μm), and related quantifications of the tumors with indicated treatments. (J–M) Flow cytometric analyses (left panel) and quantifications (right panel) of CD8 + + + + + + + + − + The numerical data in (B, C, and E–M) are presented as the mean ± SEM ( n p p p p Figures S6–S12 We further performed multiplex IHC/IF analysis to investigate the potential mechanisms involved. Consistent with our results in vitro Figures S6 Figures 6 + + + + + + Figures 6 S8 S9 + + + + Figures S10 S11 Figures S11 Hence, our data revealed that UMMF, upon NIR irradiation combined with BH4, can reprogram the tumor from immunologically “cold” to “hot” tumors. To assess the universality of our combination strategy, we also evaluated its effects on another subcutaneous B16F10 melanoma tumor model, which has been a widely used tumor model in preclinical investigation ( Figure S12 Figures S12 + + Figures S12 Nanovaccine-initiated systemic immunity to suppress tumor relapse and metastasis Our aforementioned data indicate that BH4 can synergize with the efficacy of UMMF upon NIR irradiation to induce strong local immune responses in the primary tumors. To further explore whether this combination could also enhance systemic adaptive anti-tumor immunity, we collected peripheral blood from mice subjected to the aforementioned treatments to measure proinflammatory cytokine levels ( Figure 6 Figures 7 + + + + + Figures 7 Figure 7 Nanovaccine-initiated systemic immunity to suppress tumor relapse and metastasis (A–C) Proinflammatory cytokines, including IFN-β (A), IFN-γ (B), and TNF-α (C), were measured by using ELISA assays on the peripheral blood from the mice with the indicated treatments. (D–H) Flow cytometric quantifications of immune cell populations, including CD8 + + + + + (I) Experimental timeline for the treatment of 4T1 tumor-bearing mice and monitoring the rechallenged tumors in the contralateral side. (J–M) Primary tumor weight at endpoint (J), primary tumor growth fold change curves (L), rechallenged tumor weight at endpoint (K), and rechallenged tumor growth fold change curves (M) for each treatment cohort. (N) Experimental timeline for treatment of 4T1 lung metastatic models. (O–Q) H&E and Ki-67 staining (O) and quantifications of metastatic area in the lungs (P) and Ki-67 expression (Q) in the metastatic lesions with indicated treatments. Scale bars, 2.5 mm (top), 300 μm (middle), and 50 μm (bottom). The numerical data in (A–H, J–M, P, and Q) are presented as the mean ± SEM ( n p p p p Figure S13 The aforementioned data further trigger us to test if the therapeutic nanovaccines have any effects in inhibiting metastasis in distant organs. The lungs from the mice with the aforementioned treatments ( Figure 6 Figure S13 Figure 7 Figures 7 S13 Then, we hypothesized that this phenotype can be extended to inhibit or even eliminate the formation and growth of metastatic tumors. To address this, we fully took advantage of this re-challenging experiment with some modifications ( Figure 7 + Figures 7 Discussion Cancer vaccines, particularly conventional DC-based vaccines, have demonstrated their potential to induce antigen-specific anti-tumor responses. However, the clinical translation of these vaccines remains limited, largely due to challenges such as the scarcity of tumor-specific antigens, the immunosuppressive TME dominated by CAFs and matrix components, immune tolerance, and systemic toxicity. Advances in nanotechnology present new opportunities for enhancing cancer vaccines by employing various strategies, such as reversing the immunosuppressive TME and triggering ICD. In this study, we developed a multifunctional fusion membrane-encapsulated UCNP@MOF-based therapeutic nanovaccine (UMMF) that spatiotemporally modulates immunogenic PANoptosis in tumor cells. Specifically, NIR irradiation activates UMMF to induce ROS-mediated PANoptosis in tumor cells. The PANoptotic or dying tumor cells subsequently release tumor-specific or tumor-associated antigens, facilitating DC recruitment into the TME and promoting DC maturation in tumors or lymphoid tissues. These mature DCs, in turn, activate naive T cells and promote their trafficking to the tumor. Additionally, the tumor cell/DC FM can actively target the UMMF nanovaccine to the spleen and lymph nodes, directly priming antigen-specific T cells to engage with tumor cells. Moreover, upon irradiation, UMMF exhibits a strong capacity for stromal remodeling, leading to significant depletion of stromal cells and ECM, which are key contributors to immune suppression and exclusion in the TME. These unique attributes position the UMMF-based therapeutic nanovaccine as an excellent candidate for modulating and reshaping the tumor immune landscape. Given the potential for immune tolerance to limit the efficacy of our nanovaccine platform, we incorporated BH4, a potent metabolic regulator that enhances T cell functionality, into our combination strategy. Notably, the combination of UMMF under NIR irradiation with BH4 synergistically augmented anti-tumor responses in primary tumors and inhibited metastasis in distant organs through multiple mechanisms. These include inducing extensive immunogenic PANoptosis, disrupting the physical barriers of the tumor stroma, facilitating effector T cell infiltration, and promoting the maturation of DCs. In addition to enhancing local anti-tumor immunity, UMMF combined with BH4 and NIR irradiation significantly boosted systemic adaptive immune responses. This was demonstrated by the inhibition of tumor growth upon re-challenge and the regression of metastatic lesions in distant organs, highlighting the potential of this strategy to achieve durable and comprehensive anti-tumor immunity. The UMMF nanovaccine integrates antigen delivery, stromal modulation, and immune reprogramming into a single platform, addressing key limitations of existing immunotherapies. Unlike traditional DC vaccines, which suffer from inefficient antigen presentation and poor stromal penetration, UMMF employs DC/tumor hybrid membranes to deliver diverse tumor antigens directly in vivo While the UMMF platform integrates multiple functional components, each element addresses critical barriers in solid tumor immunotherapy—limited antigen diversity, immunosuppressive stroma, and metabolic immune tolerance—that simpler systems cannot overcome. The modularity of UMMF introduces manufacturing challenges; however, its components are grounded in scalable technologies already transitioning to clinical use. For example, MOF synthesis via solvent-free/microwave methods enables industrial-scale production, 47 48 In summary, this study demonstrates that the biomimetic FM-camouflaged UMMF nanovaccine effectively inhibits tumor growth, relapse, and metastasis by integrating PDT-induced immunogenic PANoptosis with FM-based anti-tumor responses. Most notably, the UMMF nanovaccine can extensively reprogram key components of the desmoplastic and immunosuppressive TME, converting an immunologically “cold” TME into a “hot” one, thereby sensitizing tumors to subsequent immunotherapies. Additionally, the incorporation of BH4 into the UMMF platform further enhances local and systemic anti-tumor immunity, presenting significant potential for personalized combination immunotherapy. Limitations of the study Despite its promising anti-tumor efficacy, the UMMF therapeutic nanovaccine faces several limitations related to its architectural complexity and unsatisfactory penetration of light. The integration of multiple sophisticated components, including UCNPs, MOFs, and hybrid cell membranes, introduces manufacturing intricacies that may impede large-scale reproducibility. To overcome this limitation, future iterations will prioritize nanoplatform simplification through substitution of UCNP@MOF with organic photosensitizers or other multifunctional nanosystems, thereby reducing synthetic burden while preserving functional synergy, aiming to bridge preclinical and clinical development. Additionally, the dependence on NIR light for spatiotemporal activation presents a second limitation due to its restricted tissue penetration depth, which compromises efficacy in deep-seated neoplasms. Future efforts will explore alternative exogenous stimuli such as focused ultrasound or alternating magnetic fields, which offer superior penetration capabilities and non-invasive spatiotemporal control. Such refinements aim to enhance clinical adaptability while maintaining the core therapeutic paradigm of targeted immunomodulation and TME remodeling. Resource availability Lead contact Further information and requests for resources and reagents should be directed to and will be fulfilled by the lead contact, Yu Chen ( chenyuedu@shu.edu.cn Materials availability This study did not generate new unique materials. Data and code availability  • The RNA-seq data reported in this paper have been deposited in the National Center for Biotechnology Information (NCBI) Short Read Archive under BioProject accession numbers PRJNA1286157. Accession numbers are listed in the key resources table • This study did not report original code. • Any additional information required to reanalyze the data reported in this paper is available from the lead contact Acknowledgments We greatly acknowledge the financial support from National Key Research and Development Projects 2023YFC2306500 10.13039/501100001809 National Natural Science Foundation of China 52072393 52272279 82202942 82102085 Shanghai Science and Technology Program 25ZR1402154 24520712900 22140901700 22DZ2204700 22142202200 Postdoctoral Fellowship Program of CPSF GZB20250011 10.13039/100020732 Innovative Research Team of High-level Local Universities in Shanghai Shanghai Science and Technology Committee Biomedical Program 23S11900900 Author contributions Y.C., L.D., and L.H. conceived this project and designed the experiments. H.H. performed most experiments and analyzed data with assistance from Z.X. and W.F. X.S. and L.C. performed the material synthesis and characterization. H.H., Z.X., and W.F. prepared the manuscript, with input from all authors. Y.C., L.D., and L.H. acquired funding and supervised the entire project. Declaration of interests The authors declare no competing interests. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies PerCP/Cyanine5.5 anti-mouse CD11c antibody (Clone N418) Biolegend Cat#: 117328; RRID: AB_2129641 CD11c (D1V9Y) Rabbit mAb Cell Signaling Technology Cat#: 97585; RRID: AB_2800282 EpCAM (E6V8Y) XP® Rabbit mAb Cell Signaling Technology Cat#: 93790; RRID: AB_2800214 Recombinant Anti-HMGB1 antibody [EPR3507] Abcam Cat#: ab79823; RRID: AB_1603373 Recombinant Anti-Calreticulin antibody [EPR3924] Abcam Cat#: ab92516; RRID: AB_10562796 Anti-Ki67 antibody Abcam Cat#: ab15580; RRID: AB_443209 Recombinant Anti-CD31 antibody [ EPR17259 Abcam Cat#: ab182981; RRID: AB_2920881 COL1A1 (E8F4L) XP® Rabbit mAb Cell Signaling Technology Cat#: 72026; RRID: AB_2904565 Anti-alpha smooth muscle actin antibody [1A4] Abcam Cat#: ab7817; RRID: AB_262054 Recombinant Anti-CD8 alpha antibody [ EPR21769 Abcam Cat#: ab217344; RRID: AB_2890649 Recombinant Anti-CD4 antibody [ EPR19514 Abcam Cat#: ab183685; RRID: AB_2686917 CD11c Monoclonal antibody (N418) eBioscience Cat#: 14-0114-82; RRID: AB_467115 APC/Cyanine7 anti-mouse CD45 antibody (Clone 30-F11) Biolegend Cat#: 103116; RRID: AB_312981 Brilliant Violet 510™ anti-mouse CD3ε antibody (Clone 145-2C11) Biolegend Cat#: 100353; RRID: AB_2565879 Brilliant Violet 785™ anti-mouse CD4 antibody (Clone RM4-5) Biolegend Cat#: 100552; RRID: AB_2563053 PerCP/Cyanine5.5 anti-mouse CD8a antibody (Clone 53-6.7) Biolegend Cat#: 100734; RRID: AB_2075238 Brilliant Violet 605™ anti-mouse CD69 antibody (Clone H1.2F3) Biolegend Cat#: 104530; RRID: AB_2563062 BD OptiBuild™ BV650 mouse anti-human PD-1 antibody (CD279) BD Biosciences Cat#: 752738; RRID: AB_2917719 APC anti-mouse CD152 antibody (Clone UC10-4B9) Biolegend Cat#: 106310; RRID: AB_2087653 FITC anti-mouse/human CD44 antibody (Clone IM7) Biolegend Cat#: 103006; RRID: AB_312957 Brilliant Violet 421™ anti-mouse CD366 (Tim-3) antibody (Clone RMT3-23) Biolegend Cat#: 119723; RRID: AB_2616908 PE anti-mouse/rat/human FOXP3 antibody (Clone 150D) Biolegend Cat#: 320008; RRID: AB_492980 PE/Cyanine7 anti-human/mouse Bcl-6 antibody (Clone 7D1) Biolegend Cat#: 358512; RRID: AB_2566196 Brilliant Violet 510™ anti-mouse CD11c antibody (Clone N418) Biolegend Cat#: 117338; RRID: AB_2562016 Brilliant Violet 785™ anti-mouse I-A/I-E antibody (Clone M5/114.15.2) Biolegend Cat#: 107645; RRID: AB_2565977 PerCP/Cyanine5.5 anti-mouse Ly-6G antibody (Clone 1A8) Biolegend Cat#: 127616; RRID: AB_1877271 Brilliant Violet 605™ anti-mouse CD19 antibody (Clone 6D5) Biolegend Cat#: 115540; RRID: AB_2563067 PE/Cyanine7 anti-mouse CD49b antibody (Clone HMα2) Biolegend Cat#: 103518; RRID: AB_2566103 APC anti-mouse Ly-6C antibody (Clone HK1.4) Biolegend Cat#: 128016; RRID: AB_1732076 FITC anti-mouse/human CD11b antibody (Clone M1/70) Biolegend Cat#: 101206; RRID: AB_312789 Brilliant Violet 421™ anti-mouse CD103 antibody (Clone 2E7) Biolegend Cat#: 121422; RRID: AB_2562901 PE anti-mouse CD206 (MMR) antibody (Clone C068C2) Biolegend Cat#: 141706; RRID: AB_10895754 Chemicals, peptides, and recombinant proteins Yttrium chloride hexahydrate (YCl 3 2 Aladdin Cat#Y119236 Ytterbium(III) chloride hexahydrate (YbCl 3 2 Aladdin Cat#Y196893 Erbium chloride hexahydrate (ErCl 3 2 Aladdin Cat#E119092 Zirconium(IV) chloride (ZrCl 4 Aladdin Cat#Z109460 Ammonium fluoride (NH 4 Aladdin Cat#A111762 Sodium trifluoroacetate (C 2 3 2 Aladdin Cat#S665022 ( S Aladdin Cat#S288194 Tetrakis(4-carboxyphenyl)porphyrin (TCPP) TCI Cat#A5015 1-octadecene Sigma-Aldrich Cat#O806 Oleic acid Sigma-Aldrich Cat#364525 Polyethylene glycol (PEG) solution (50% (w/v)) Sigma-Aldrich Cat#P7306 Tetrahydrobiopterin (BH4, 11.212) Schircks Labs N/A Critical commercial assays Membrane and Cytosol Protein Extraction Kit Beyotime Cat#P0033 Reactive Oxygen Species Assay Kit Beyotime Cat#S0033 Alexa Fluor 488–conjugated avidin Thermo Fisher Cat# S11223 Cell Counting Kit-8 Beyotime Cat#C0038 Calcein/PI Cell Viability/Cytotoxicity Assay Kit Beyotime Cat#C2015 Annexin V-FITC Apoptosis Detection Kit Beyotime Cat#C1062 Apoptosis and Necrosis Detection Kit with YO-PRO-1 and PI Beyotime Cat#C1075 LDH Cytotoxicity Assay Kit Beyotime Cat#C0017 Mouse IL-1β ELISA Kit YUBIBIO Cat#U96-1494E Mouse IL-18 ELISA Kit YUBIBIO Cat#U96-3279E Deposited data Bulk RNA sequencing data This paper [NCBI]: [PRJNA1286157] Experimental models: Cell lines Murine 4T1 breast cancer cell line ATCC Cat#CRL-2539 Murine B16F10 melanoma cell line ATCC Cat#CRL-6475 Experimental models: Organisms/strains Mouse: Female BALB/c Shanghai Model Organisms Center N/A Mouse: Female C57BL/6J Shanghai Model Organisms Center N/A Mouse: Female BALB/c-nu Shanghai Model Organisms Center N/A Software and algorithms GraphPad Prism (version 9.5.1) GraphPad Software https://www.graphpad.com/ Adobe Illustrator Adobe https://www.adobe.com/products/illustrator/free-trial-download.html ZEN Zeiss https://www.zeiss.com/microscopy/en/products/software/zeiss-zen.html FlowJo (version 10.8.1) BD Biosciences https://www.flowjo.com/ Living Image (version 4.1) Caliper Life Sciences https://living-image.software.informer.com/4.1/ Experimental model and study participant details Cell lines The 4T1 mouse breast cancer cell (ATCC, CRL-2539) and B16F10 melanoma cell (ATCC, CRL-6475) were purchased from Shanghai Institutes for Biological Sciences (SIBS, Shanghai, China). The cells were cultured at 37°C and 5% CO 2 Mice models 6-week-old female BALB/c, BALB/c-nu, and C57BL/6J mice were purchased from Shanghai Model Organisms Center, Inc. (Shanghai, China) and maintained in a pathogen-free environment. All animal experiments were conducted with the approval of ethics by Ethics Committee of Shanghai University. Method details Synthesis of NaYF4:Yb/Er core nanoparticles YCl 3 2 3 2 3 2 4 Synthesis of core@shell structured NaYF4:Yb/Er@NaYF4 upconversion nanoparticles (UCNPs)  (1) Y-OA (0.10 M) shell precursor: 2.5 mmol of YCl 3 2 (2) Na-TFA-OA (0.40 M) shell precursor: 4.00 mmol of C 2 3 2 (3) Core@shell structured nanoparticles: The core@shell upconversion nanoparticles were constructed based on a one-pot successive layer-by-layer protocol. 49 4 4 4 Carboxylic acid group anchoring to UCNP 0.15 mmol of UCNP in 2 mL of tetrahydrofuran (THF) was mixed with 50 mg of 3,4- dihydroxyhydrocinnamic acid in 8 mL of THF. The reaction solution was first heated at 50°C for 3 h. After cooling to room temperature, 0.2 mL of aqueous NaOH (0.2 M) was added to precipitate UCNP. Finally, carboxylic acid-anchored UCNP was washed with ethanol and resuspended in N, N-dimethylformamide (DMF) for further use. Synthesis of UCNP@MOF nanoparticles Typically, solution A was obtained by introducing 12 mg of ZrCl 4 Loading of ( S The inhibitor of the human mutT homologue MTH1, ( S S S S S Generation of BMDCs and preparation of fused cells Bone marrow-derived monocyte was isolated from mice femurs and washed with PBS. Using Red Blood Cell Lysis Buffer (ACK) to lyse red cells and then passing them through a 40 μm cell strainer. Bone marrow cells were suspended in RPMI-1640 containing 10% FBS and 1% penicillin-streptomycin. Cells were seeded into the 6-well plate with a density of 1×10 6 Preparation of FM When tumor/DCs fused cells were well prepared, cells were collected for cell membrane extraction according to the manufacturer’s instructions of Beyotime Institute of Biotechnology using the Membrane Protein Extraction Kit. Cell pellets were obtained and resuspended in a lysis buffer with phenylmethanesulfonyl fluoride (PMSF) on ice, as well as vortexed and broken using a repeated freeze-thaw method three times. After 30 min incubation in the ice bath, the mixture was centrifuged at 700 g for 10 min, and the supernatant was centrifuged for another 30 min at 14000 g to collect the cracked cell membrane. The collected cell membrane was lyophilized and stored at −80°C for further use. By adding protein lysis buffer to the cell membrane, the cell membrane protein was obtained for the WB experiment. Western blot analysis The CM, DM, and FM protein lysates were extracted using RIPA lysis buffer supplemented with protease inhibitor cocktail. Protein samples were subjected to 4%–10% Tris-Glycine gels for electrophoresis for 90 min and then transferred to Polyvinylidene fluoride (PVDF) membranes for 2 h. The membranes were incubated with primary antibodies (EpCAM, CD11c, and Na + + Preparation of FM-coated UMM The UMM solution was introduced into the ultrapure water solution of FM with an equal weight of UMM and FM. Then the mixture was sonicated in an ice bath until the solution was transparent. The as-prepared UCNP@MOF@MI@FM (denoted as UMMF) was finally purified by centrifugation to remove the free FM. Nanovaccine characterization The morphology, elemental mapping, and EDS line scan were measured by a JEM-2100F electron microscope. The powder X-ray diffraction pattern was conducted on a D/MAX-TTRIII (CBO) series XRD. UV/vis spectra and UCL spectra were performed on a Hitachi 5300 spectrophotometer and a Hitachi F-4600 spectrometer with a 980 nm NIR laser as the excitation source, respectively. The hydrodynamic particle size and zeta potential were recorded on the Malvern Zetasizer Nanoseries (Nano ZS90). To quantitatively analyze the 1 2 2 Cellular uptake To effectively load fluorescein isothiocyanate (FITC), the FITC solution was mixed with the UM solution under magnetic stirring for 12 h to obtain UM@FITC. Next, the UM@FITC was further coated with FM to gain UMF@FITC. Then, 4T1 cells were incubated with pre-stained UM or UMF at varying time points (2 h, 4 h, 8 h, 12 h) at 37°C. Cells were finally collected and measured with flow cytometry. Similarly, after the as-prepared UMF was co-cultured with 4T1 cells for different times (2 h, 4 h, 8 h, 12 h), the cells were fixed in glutaraldehyde (2.5%) and collected for further Bio-TEM imaging. In vitro Five groups, including untreated, NIR, UMF, UMF+NIR, and UMMF+NIR, were set to measure the ability of UMMF nanovaccine in ROS production upon exposure to NIR irradiation. Briefly, 4T1 cells were treated with UMF or UMMF at 37°C for 12 h. Next, the culture media were replaced by DCFH-DA (Beyotime) and exposed to NIR or NIR-free irradiation (980 nm, 1.0 W/cm 2 Fluorescence imaging of the DNA damage Owing to the favorable binding affinity of avidin to 8-oxo-dG, Alexa Fluor 488-conjugated avidin was adopted to evaluate the incorporation of 8-oxo-dG in DNA. Firstly, the 4T1 cells were subjected to the same treatment in the ROS detection assay and then fixed in 4% paraformaldehyde (PFA) at 37°C for 15 min, followed by incubating with 0.2% Triton X-100 at room temperature for 10 min. After blocking at room temperature for 30 min using QuickBlock Blocking Buffer for Immunol Staining (Beyotime), the cells were subsequently incubated with Alexa Fluor 488-conjugated avidin (10 μg/mL, Thermo Fisher Scientific Inc.) for 1 h at 37°C. Finally, the cells were stained with DAPI and imaged with a confocal microscope. In vitro The cytotoxicity against tumor cells was explored using Cell Counting Kit-8 (CCK-8, Beyotime). In brief, 4T1 cells or B16F10 cells were seeded in 96-well plates with an intensity of 3000 cells per well and co-cultured with UMF or UMMF at varying concentrations for 12 h. Then the cells were exposed to NIR irradiation (980 nm, 1 W/cm 2 The in vitro Cell apoptosis 4T1 cells were incubated with the UMF or UMMF, followed by NIR irradiation. To compare the apoptotic effect of UMMF, cells were cultured with PBS or not irradiated by an NIR laser. After another 24 h of incubation, cells were collected and stained with FITC-Annexin V/Propidium Iodide as apoptosis markers, as well as analyzed by flow cytometer. PANopotosis evaluation 4T1 cells were seeded on 6-well plates at a density of 1×10 6 Lactic dehydrogenase, interleukin-1β, and IL-18 evaluation 4T1 cells were seeded on 96-well plates at a density of 5×10 3 ICD detection 4T1 cells were seeded on 6-well plates at a density of 1×10 6 Bulk RNA sequencing For bulk RNA-seq of 4T1 cells, total RNA was extracted from 4T1 cells treated with UMMF upon NIR irradiation. RNA isolation and library construction were performed by Shanghai Majorbio Bio-pharm Biotechnology Co., Ltd. RNA-seq transcriptome library was performed using Illumina Stranded mRNA Prep, Ligation from Illumina. Differentially expressed genes were identified using the transcripts per million reads method. Differential expression analysis was conducted using DESeq2. Differentially expressed genes with Log2Fold change ≥1 and FDR ≤0.05 were recognized to be significantly differentially expressed genes. Besides, KEGG pathway analysis was performed by KOBAS. GSEA was performed by the fgsea package based on differentially expressed genes with Log2Fold change >1.5 and p T cell and DC cell function assay To measure the antigen-specific T cell priming ability of UMMF nanovaccine under NIR irradiation, BMDCs were pre-incubated with differentially treated 4T1 cells (Untreated, NIR, UMF, UMF+NIR, UMMF+NIR) for 48 h. Then the BMDCs were co-cultured with Naive T cells from the spleen at a ratio of 1:3 for 2 days. To detect the cytokine production of T cells, cells were stimulated with 2.5 mg/mL Brefeldin A for 6 h at 37°C. Then cells were collected and resuspended in FACS buffer containing intracellular staining markers. Using Cytofix Fixation buffer to fix cells for 60 min at 4°C, followed by adding Permeabilization Wash buffer. Finally, cells were stained with intracellular markers in Stain buffer. T cell proliferation and DC function were analyzed by flow cytometry. In vivo BALB/c-nu mice were purchased from Shanghai Model Organisms Center, Inc. To detect the tumor and lymph node targeting ability and biodistribution of the nanovaccine in vivo i.v. In Vivo ex vivo Mouse breast cancer model  (1) BALB/c mice were purchased from Shanghai Model Organisms Center, Inc. For treating breast cancer, mice were orthotopically inoculated with a single-cell suspension of 4T1 cells (5×10 5 2 2 (2) For treating breast cancer, mice were orthotopically inoculated with a single-cell suspension of 4T1 cells (5×10 5 i.p. 2 Tumor digestion Tumor tissues were mechanically dissected and digested with 2.0 mg/mL Collagenase type IV (Worthington) and 0.1 mg/mL DNase I (Roche) in RPMI1640 for 30 min at 37°C. Digested medium was filtered with 70 μm cell strainers, followed by incubating with ACK lysis buffer for 10 min. For tumor single cell suspension, filtered cells were resuspended in staining buffer. Lymphoid nodes were mashed and passed through a 70 μm cell strainer and incubated with ACK lysis buffer. Filtered cells were washed with PBS and resuspended in stain buffer. Flow cytometry Single cell suspensions were incubated with Live/Dead fixable staining on ice for 15 min to exclude dead cells. Single cells were blocked with Fc receptor anti-CD16/32 for 10 min, followed by surface staining markers in FACS buffer for 30 min on ice. For extracellular staining, cells were fixed in Cytofix Fixation buffer for 60 min at 4°C followed by permeabilization with wash buffer. For transcription factor staining, cells were fixed in Mouse Foxp3 buffer set, then washed with permeabilization buffer. After that, cells were stained with an intracellular staining marker for 30 min on ice. Immune cell phenotypes were performed and analyzed by Cytoflex. Following anti-mouse antibodies are used: anti-CD45, anti-CD3, anti-CD4, anti-CD8, anti-FOXP3, anti-CD19, anti-CD44, anti-CD69 anti-PD-1, anti-CD11b, anti-CD11c, anti-CD206, anti-F4/80, anti-MHC-II, anti-MHC-I, anti-CD103, anti-Ly6G, anti-Ly6c, anti-CD49b.These antibodies were obtained from BioLegend, BD Biosciences, or eBiosciences. Lung metastasis model For the lung metastasis model, mice were injected with 5×10 5 i.v. 5 Rechallenge breast cancer model For the rechallenge mouse model, mice were injected with 5×10 5 5 Melanoma mouse model C57BL/6 mice were purchased from Shanghai Model Organisms Center, Inc. To elucidate the in vivo 5 Tissue immunofluorescence and immunohistochemistry Tumor, lung, and main organ tissues were examined using H&E staining. Tumor apoptosis was detected using Terminal deoxynucle otidyltransferase-mediated dUTP nick-end Labeling (TUNEL) Assay Kit (Fluorescence, 488nm). For IF staining, tissues were blocked using blocking buffer (3% BSA, 0.3% Triton X-100 in PBS) for 1 h. Sections were incubated with primary antibodies overnight at 4°C on a shaker. Secondary antibodies were incubated for 2 h at room temperature. Excess antibodies were removed and washed with TBST three times. Then, sections were labeled with DAPI. After labeling, tissue sections were mounted with mounting media. The following antibodies were used: HMGB1, CRT, COL1A, α-SMA, CD8, CD4, CD11c. ImageJ was used for image analysis and quantification. For IHC staining, 5-μm-thick tumor sections were blocked using Hydrogen Peroxide for 15 min. Sections were incubated with primary antibodies overnight at 4°C on a shaker. Secondary antibodies were incubated for 30 min at room temperature. Excess antibodies were removed and washed with TBST three times. Then, sections were labeled with DAB substrate for 10 min. After labeling, tissue sections were covered with Hematoxylin for 1 min and then mounted with mounting media. Images were analyzed with ImageJ software. The following antibodies were used for IHC staining: CD31, Ki-67, HMGB1, and CRT. Quantification and statistical analysis All data were presented as the mean ± SEM. Statistical analyses were performed using GraphPad Prism. Two-tailed, unpaired Student’s t test was used to analyze the two-group comparison. For more than two groups, data analysis was performed using One-way ANOVA or two-way ANOVA with multiple comparisons. Statistical significance is defined as ∗ p p p p References 1 Riley R.S. June C.H. Langer R. Mitchell M.J. Delivery technologies for cancer immunotherapy Nat. Rev. Drug Discov. 18 2019 175 196 10.1038/s41573-018-0006-z 30622344 PMC6410566 2 Park J.S. Gazzaniga F.S. Wu M. Luthens A.K. Gillis J. Zheng W. LaFleur M.W. Johnson S.B. Morad G. Park E.M. Targeting PD-L2–RGMb overcomes microbiome-related immunotherapy resistance Nature 617 2023 377 385 10.1038/s41586-023-06026-3 37138075 PMC10219577 3 Rojas L.A. Sethna Z. Soares K.C. Olcese C. Pang N. Patterson E. Lihm J. Ceglia N. Guasp P. Chu A. Personalized RNA neoantigen vaccines stimulate T cells in pancreatic cancer Nature 618 2023 144 150 10.1038/s41586-023-06063-y 37165196 PMC10171177 4 Miao L. Li L. Huang Y. Delcassian D. Chahal J. Han J. Shi Y. Sadtler K. Gao W. Lin J. Delivery of mRNA vaccines with heterocyclic lipids increases anti-tumor efficacy by STING-mediated immune cell activation Nat. Biotechnol. 37 2019 1174 1185 10.1038/s41587-019-0247-3 31570898 5 Baharom F. Ramirez-Valdez R.A. Khalilnezhad A. Khalilnezhad S. Dillon M. Hermans D. Fussell S. Tobin K.K.S. Dutertre C.A. Lynn G.M. Systemic vaccination induces CD8(+) T cells and remodels the tumor microenvironment Cell 185 2022 4317 4332.e15 10.1016/j.cell.2022.10.006 36302380 PMC9669246 6 Xiong X. Ke X. Wang L. Lin Y. Wang S. Yao Z. Li K. Luo Y. Liu F. Pan Y. Neoantigen-based cancer vaccination using chimeric RNA-loaded dendritic cell-derived extracellular vesicles J. Extracell. Vesicles 11 2022 e12243 10.1002/jev2.12243 PMC9451527 35927827 7 Liu C. Liu X. Xiang X. Pang X. Chen S. Zhang Y. Ren E. Zhang L. Liu X. Lv P. A nanovaccine for antigen self-presentation and immunosuppression reversal as a personalized cancer immunotherapy strategy Nat. Nanotechnol. 17 2022 531 540 10.1038/s41565-022-01098-0 35410368 8 Mo F. Xue D. Duan S. Liu A. Yang X. Hou X. Lu X. Novel fusion cells derived from tumor cells expressing the heterologous alpha-galactose epitope and dendritic cells effectively target cancer Vaccine 37 2019 926 936 10.1016/j.vaccine.2019.01.004 30661833 9 Pang Y.B. He J. Cui B.Y. Xu S. Li X.L. Wu M.Y. Liang R. Feng Y. Guo X. Zhang X.H. Luo X.L. A potential antitumor effect of dendritic cells fused with cancer stem cells in hepatocellular carcinoma Stem Cells Int. 2019 2019 5680327 10.1155/2019/5680327 PMC6466848 31065274 10 Takei J. Kamata Y. Tanaka T. Fukasawa N. Gomisawa K. Satake M. Mori R. Yamamoto Y. Suzuki T. Oda A. Prognostic survival biomarkers of tumor-fused dendritic cell vaccine therapy in patients with newly diagnosed glioblastoma Cancer Immunol. Immunother. 72 2023 3175 3189 10.1007/s00262-023-03482-8 37382632 PMC10491709 11 Liu W.L. Zou M.Z. Liu T. Zeng J.Y. Li X. Yu W.Y. Li C.X. Ye J.J. Song W. Feng J. Zhang X.Z. Cytomembrane nanovaccines show therapeutic effects by mimicking tumor cells and antigen presenting cells Nat. Commun. 10 2019 3199 10.1038/s41467-019-11157-1 31324770 PMC6642123 12 Xu J. Liu H. Wang T. Wen Z. Chen H. Yang Z. Li L. Yu S. Gao S. Yang L. CCR7 mediated mimetic dendritic cell vaccine homing in lymph node for head and neck squamous cell carcinoma therapy Adv. Sci. 10 2023 e2207017 10.1002/advs.202207017 PMC10265089 37092579 13 Zhou H. Tang D. Yu Y. Zhang L. Wang B. Karges J. Xiao H. Theranostic imaging and multimodal photodynamic therapy and immunotherapy using the mTOR signaling pathway Nat. Commun. 14 2023 5350 10.1038/s41467-023-40826-5 37660174 PMC10475087 14 Humblin E. Korpas I. Lu J. Filipescu D. van der Heide V. Goldstein S. Vaidya A. Soares-Schanoski A. Casati B. Selvan M.E. Sustained CD28 costimulation is required for self-renewal and differentiation of TCF-1(+) PD-1(+) CD8 T cells Sci. Immunol. 8 2023 eadg0878 10.1126/sciimmunol.adg0878 PMC10805182 37624910 15 Bolouri H. Young M. Beilke J. Johnson R. Fox B. Huang L. Santini C.C. Hill C.M. Vries A.R.v.d.V.d. Shannon P.T. Integrative network modeling reveals mechanisms underlying T cell exhaustion Sci. Rep. 10 2020 1915 10.1038/s41598-020-58600-8 32024856 PMC7002445 16 Hinshaw D.C. Shevde L.A. The tumor microenvironment innately modulates cancer progression Cancer Res. 79 2019 4557 4566 10.1158/0008-5472.CAN-18-3962 31350295 PMC6744958 17 Risom T. Glass D.R. Averbukh I. Liu C.C. Baranski A. Kagel A. McCaffrey E.F. Greenwald N.F. Rivero-Gutiérrez B. Strand S.H. Transition to invasive breast cancer is associated with progressive changes in the structure and composition of tumor stroma Cell 185 2022 299 310.e18 10.1016/j.cell.2021.12.023 35063072 PMC8792442 18 Wang Y. Kanneganti T.-D. From pyroptosis, apoptosis and necroptosis to PANoptosis: A mechanistic compendium of programmed cell death pathways Comput. Struct. Biotechnol. J. 19 2021 4641 4657 10.1016/j.csbj.2021.07.038 34504660 PMC8405902 19 Jiao H. Wachsmuth L. Kumari S. Schwarzer R. Lin J. Eren R.O. Fisher A. Lane R. Young G.R. Kassiotis G. Z-nucleic-acid sensing triggers ZBP1-dependent necroptosis and inflammation Nature 580 2020 391 395 10.1038/s41586-020-2129-8 32296175 PMC7279955 20 Wei W. Wang H. Ren C. Deng R. Qin Q. Ding L. Li P. Liu Y. Chang M. Chen Y. Zhou Y. Ultrasmall enzyodynamic PANoptosis nano-inducers for ultrasound-amplified hepatocellular carcinoma therapy and lung metastasis inhibition Adv. Mater. 36 2024 2409618 10.1002/adma.202409618 39225412 21 Karki R. Sharma B.R. Lee E. Banoth B. Malireddi R.K.S. Samir P. Tuladhar S. Mummareddy H. Burton A.R. Vogel P. Kanneganti T.-D. Interferon regulatory factor 1 regulates PANoptosis to prevent colorectal cancer JCI Insight 5 2020 e136720 10.1172/jci.insight.136720 PMC7406299 32554929 22 Malireddi R.K.S. Karki R. Sundaram B. Kancharana B. Lee S. Samir P. Kanneganti T.-D. Inflammatory cell death, PANoptosis, mediated by cytokines in diverse cancer lineages inhibits tumor growth ImmunoHorizons 5 2021 568 580 10.4049/immunohorizons.2100059 34290111 PMC8522052 23 Pham T.C. Nguyen V.-N. Choi Y. Lee S. Yoon J. Recent strategies to develop innovative photosensitizers for enhanced photodynamic therapy Chem. Rev. 121 2021 13454 13619 10.1021/acs.chemrev.1c00381 34582186 24 Liu M. Chen Y. Guo Y. Yuan H. Cui T. Yao S. Jin S. Fan H. Wang C. Xie R. Golgi apparatus-targeted aggregation-induced emission luminogens for effective cancer photodynamic therapy Nat. Commun. 13 2022 2179 10.1038/s41467-022-29872-7 35449133 PMC9023483 25 Li J. Song S. Meng J. Tan L. Liu X. Zheng Y. Li Z. Yeung K.W.K. Cui Z. Liang Y. 2D MOF periodontitis photodynamic ion therapy J. Am. Chem. Soc. 143 2021 15427 15439 10.1021/jacs.1c07875 34516125 26 Zheng Q. Liu X. Zheng Y. Yeung K.W.K. Cui Z. Liang Y. Li Z. Zhu S. Wang X. Wu S. The recent progress on metal–organic frameworks for phototherapy Chem. Soc. Rev. 50 2021 5086 5125 10.1039/D1CS00056J 33634817 27 Yang B. Chen Y. Shi J. Reactive oxygen species (ROS)-based nanomedicine Chem. Rev. 119 2019 4881 4985 10.1021/acs.chemrev.8b00626 30973011 28 Wang X. Liu Y. Xue C. Hu Y. Zhao Y. Cai K. Li M. Luo Z. A protein-based cGAS-STING nanoagonist enhances T cell-mediated anti-tumor immune responses Nat. Commun. 13 2022 5685 10.1038/s41467-022-33301-0 36167857 PMC9515186 29 Huang H. Banerjee S. Qiu K. Zhang P. Blacque O. Malcomson T. Paterson M.J. Clarkson G.J. Staniforth M. Stavros V.G. Targeted photoredox catalysis in cancer cells Nat. Chem. 11 2019 1041 1048 10.1038/s41557-019-0328-4 31548671 30 Wen S. Zhou J. Schuck P.J. Suh Y.D. Schmidt T.W. Jin D. Future and challenges for hybrid upconversion nanosystems Nat. Photonics 13 2019 828 838 10.1038/s41566-019-0528-x 31 Zhou B. Shi B. Jin D. Liu X. Controlling upconversion nanocrystals for emerging applications Nat. Nanotechnol. 10 2015 924 936 10.1038/nnano.2015.251 26530022 32 Wen S. Zhou J. Zheng K. Bednarkiewicz A. Liu X. Jin D. Advances in highly doped upconversion nanoparticles Nat. Commun. 9 2018 2415 10.1038/s41467-018-04813-5 29925838 PMC6010470 33 Sanders S.N. Schloemer T.H. Gangishetty M.K. Anderson D. Seitz M. Gallegos A.O. Stokes R.C. Congreve D.N. Triplet fusion upconversion nanocapsules for volumetric 3D printing Nature 604 2022 474 478 10.1038/s41586-022-04485-8 35444324 34 Huber K.V.M. Salah E. Radic B. Gridling M. Elkins J.M. Stukalov A. Jemth A.-S. Göktürk C. Sanjiv K. Strömberg K. Stereospecific targeting of MTH1 by (S)-crizotinib as an anticancer strategy Nature 508 2014 222 227 10.1038/nature13194 24695225 PMC4150021 35 Li F. Wu Y. Chen L. Hu L. Zhu F. He Q. High iodine induces DNA damage in autoimmune thyroiditis partially by inhibiting the DNA repair protein MTH1 Cell. Immunol. 344 2019 103948 10.1016/j.cellimm.2019.103948 31311621 36 Zhao L. Li J. Su Y. Yang L. Chen L. Qiang L. Wang Y. Xiang H. Tham H.P. Peng J. Zhao Y. MTH1 inhibitor amplifies the lethality of reactive oxygen species to tumor in photodynamic therapy Sci. Adv. 6 2020 eaaz0575 10.1126/sciadv.aaz0575 PMC7056313 32181355 37 Platten M. Nollen E.A.A. Röhrig U.F. Fallarino F. Opitz C.A. Tryptophan metabolism as a common therapeutic target in cancer, neurodegeneration and beyond Nat. Rev. Drug Discov. 18 2019 379 401 10.1038/s41573-019-0016-5 30760888 38 Pilotte L. Larrieu P. Stroobant V. Colau D. Dolušić E. Frédérick R. De Plaen E. Uyttenhove C. Wouters J. Masereel B. Van den Eynde B.J. Reversal of tumoral immune resistance by inhibition of tryptophan 2,3-dioxygenase Proc. Natl. Acad. Sci. USA 109 2012 2497 2502 10.1073/pnas.1113873109 22308364 PMC3289319 39 Zhai L. Ladomersky E. Lenzen A. Nguyen B. Patel R. Lauing K.L. Wu M. Wainwright D.A. IDO1 in cancer: a Gemini of immune checkpoints Cell. Mol. Immunol. 15 2018 447 457 10.1038/cmi.2017.143 29375124 PMC6068130 40 Uyttenhove C. Pilotte L. Théate I. Stroobant V. Colau D. Parmentier N. Boon T. Van den Eynde B.J. Evidence for a tumoral immune resistance mechanism based on tryptophan degradation by indoleamine 2,3-dioxygenase Nat. Med. 9 2003 1269 1274 10.1038/nm934 14502282 41 Cronin S.J.F. Seehus C. Weidinger A. Talbot S. Reissig S. Seifert M. Pierson Y. McNeill E. Longhi M.S. Turnes B.L. The metabolite BH4 controls T cell proliferation in autoimmunity and cancer Nature 563 2018 564 568 10.1038/s41586-018-0701-2 30405245 PMC6438708 42 Soula M. Weber R.A. Zilka O. Alwaseem H. La K. Yen F. Molina H. Garcia-Bermudez J. Pratt D.A. Birsoy K. Metabolic determinants of cancer cell sensitivity to canonical ferroptosis inducers Nat. Chem. Biol. 16 2020 1351 1360 10.1038/s41589-020-0613-y 32778843 PMC8299533 43 Franco F. Jaccard A. Romero P. Yu Y.-R. Ho P.-C. Metabolic and epigenetic regulation of T-cell exhaustion Nat. Metab. 2 2020 1001 1012 10.1038/s42255-020-00280-9 32958939 44 Liu Y. Yang Y. Sun Y. Song J. Rudawski N.G. Chen X. Tan W. Ostwald ripening-mediated grafting of metal–organic frameworks on a single colloidal nanocrystal to form uniform and controllable MXF J. Am. Chem. Soc. 141 2019 7407 7413 10.1021/jacs.9b01563 30987417 45 Zhang Y. Su S.S. Zhao S. Yang Z. Zhong C.-Q. Chen X. Cai Q. Yang Z.-H. Huang D. Wu R. Han J. RIP1 autophosphorylation is promoted by mitochondrial ROS and is essential for RIP3 recruitment into necrosome Nat. Commun. 8 2017 14329 10.1038/ncomms14329 PMC5309790 28176780 46 Shi J. Zhao Y. Wang K. Shi X. Wang Y. Huang H. Zhuang Y. Cai T. Wang F. Shao F. Cleavage of GSDMD by inflammatory caspases determines pyroptotic cell death Nature 526 2015 660 665 10.1038/nature15514 26375003 47 Wright A.M. Kapelewski M.T. Marx S. Farha O.K. Morris W. Transitioning metal–organic frameworks from the laboratory to market through applied research Nat. Mater. 24 2025 178 187 10.1038/s41563-024-01947-4 39117910 48 An Y. Ji C. Zhang H. Jiang Q. Maitz M.F. Pan J. Luo R. Wang Y. Engineered cell membrane coating technologies for biomedical applications: From nanoscale to macroscale ACS Nano 19 2025 11517 11546 10.1021/acsnano.4c16280 40126356 49 Chen L. Zhao T. Zhao M. Wang W. Sun C. Liu L. Li Q. Zhang F. Zhao D. Li X. Size and charge dual-transformable mesoporous nanoassemblies for enhanced drug delivery and tumor penetration Chem. Sci. 11 2020 2819 2827 10.1039/C9SC06260B 34084342 PMC8157500 Supplemental information  Document S1. Figures S1–S13 Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102312 ",
  "metadata": {
    "Title of this paper": "Size and charge dual-transformable mesoporous nanoassemblies for enhanced drug delivery and tumor penetration",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490211/"
  }
}