{
  "title": "Paper_888",
  "abstract": "pmc Cancer Med Cancer Med 1974 canmed CAM4 Cancer Medicine 2045-7634 Wiley PMC12477800 PMC12477800.1 12477800 12477800 41020616 10.1002/cam4.71259 CAM471259 CAM4-2025-02-0718.R2 1 Research Article Research Article Disaggregation of Hepatobiliary Cancer Mortality Among Asian Americans: Analysis of NVSS Park Anna  1 Vodinh‐Ho Andrew  2 Rok Ivory  3 Qi Xinran https://orcid.org/0000-0002-1348-5444  4 Hung George A.  5 Kikuta Nicholas  6 Jamal Armaan  6  7 Kim Gloria S.  6  8 Palaniappan Latha P.  6  8 Srinivasan Malathi  6  9 Huang Robert J.  6  10 Bacong Adrian M. https://orcid.org/0000-0003-0157-4754  6  8 abacong@stanford.edu   1 School of Medicine Georgetown University Washington DC USA   2 Department of Physics Princeton University Princeton New Jersey USA   3 Department of Medicine University of Nevada, Reno School of Medicine Reno Nevada USA   4 Department of Epidemiology Johns Hopkins Bloomberg School of Public Health Baltimore Maryland USA   5 Department of Medicine Rutgers New Jersey Medical School Newark New Jersey USA   6 Center for Asian Health Research and Education Stanford University School of Medicine Stanford California USA   7 Department of Medicine Johns Hopkins University School of Medicine Baltimore Maryland USA   8 Division of Cardiovascular Medicine Stanford University School of Medicine Stanford California USA   9 Division of Primary Care and Population Health Stanford University School of Medicine Stanford California USA   10 Division of Gastroenterology and Hepatology Stanford University School of Medicine Stanford California USA * Correspondence: abacong@stanford.edu 29 9 2025 10 2025 14 19 497574 10.1002/cam4.v14.19 e71259 28 8 2025 07 2 2025 08 9 2025 29 09 2025 30 09 2025 30 09 2025 © 2025 The Author(s). Cancer Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Background Asian Americans (AAs) are a diverse population, and aggregation of AA health data in national reports conceals significant differences between AA subgroups. As hepatobiliary cancer rates increase globally, a greater understanding of hepatobiliary mortality among AA subgroups could motivate precision intervention and screening programs. Methods Using national mortality data from 2005 to 2020, we report age‐adjusted mortality rates, standardized mortality ratios, and annual percent change for hepatocellular carcinoma (HCC), nonspecified liver cancer (NOS), intrahepatic cholangiocarcinoma (ICC), extrahepatic cholangiocarcinoma (ECC), and gallbladder cancer (GBC) using national mortality data for the six largest AA subgroups (Asian Indian, Chinese, Filipino, Japanese, Korean, and Vietnamese) compared to non‐Hispanic White people (NHW). Results All AA subgroups (except Asian Indians) had significantly higher hepatobiliary cancer mortality than NHW people. Vietnamese people demonstrated the highest mortality from HCC (7.65 per 100,000) and nonspecified liver cancer (5.57 per 100,000), while Korean people had the highest mortality from the biliary tract cancers: ICC (3.10 per 100,000), GBC (0.72 per 100,000), and ECC (0.97 per 100,000). Notably, ICC mortality increased across the study period. Across all subgroups, male individuals had significantly higher hepatobiliary cancer mortality than female individuals, with differences being largest for HCC and nonspecified liver cancer. Conclusions Differences in mortality across hepatobiliary cancer types demonstrate the importance of analyzing subtypes separately. These differences also highlight the importance of developing ethnically targeted screening, prevention strategies, and treatment. Aggregation of cancer health data for Asian Americans conceals potential high‐risk groups within this diverse population. Using mortality records from 2005 to 2020, we find considerable heterogeneity in liver and biliary cancer subtypes by disaggregated Asian subgroup when compared to non‐Hispanic White decedents. Asian Americans extrahepatic cholangiocarcinoma gallbladder cancer hepatobiliary cancer hepatocellular carcinoma intrahepatic cholangiocarcinoma mortality National Institutes of Health 10.13039/100000002 K24HL150476 National Cancer Institute 10.13039/100000054 K08CA252635 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  A. Park A. Vodinh‐Ho I. Rok Disaggregation of Hepatobiliary Cancer Mortality Among Asian Americans: Analysis of NVSS Cancer Medicine 14 19 2025 e71259 10.1002/cam4.71259  Funding: Anna Park and Andrew Vodinh‐Ho share co‐first authorship. Abbreviations AA Asian American ACS American Community Survey AMR age‐adjusted mortality rate per 100,000 individuals APC annual percent change CDC Centers for Disease Control and Prevention CI confidence interval ECC extrahepatic cholangiocarcinoma GBC gallbladder carcinoma HBsAg hepatitis B surface antigen HBV hepatitis B virus HCC hepatocellular carcinoma HCV hepatitis C virus ICC intrahepatic cholangiocarcinoma ICD‐10 International Classification of Diseases, 10th revision NAFLD nonalcoholic fatty liver disease NHW non‐Hispanic White NOS nonspecified liver cancer SMR standardized mortality ratio US United States USPSTF US Preventive Services Task Force 1 Introduction Asian Americans (AAs) are the fastest‐growing racial/ethnic group in the United States (US), comprising about 7% of the nation's overall population, and projected to surpass 46 million people by 2060 [ 1 1 2 3 AAs are the only racial or ethnic group in the US in which cancer is the leading cause of death in both men and women [ 4 4 5 6 6 7 8 8 9 10 11 12 Hepatobiliary cancers, encompassing liver and biliary tract cancers, are increasing both in the US and globally [ 4 13 14 15 16 15 17 18 19 20 4 5 21 22 22 23 24 25 23 Although there have been epidemiologic studies examining disaggregated mortality data for liver cancer among AAs [ 24 25 26 27 28 2 Methods 2.1 Study Data and Population The National Vital Statistics System (NVSS) Mortality Database provides detailed mortality records in the US from 2005 to 2020, including the year of death, age of death, sex, race, ethnicity, and underlying cause of death for each decedent [ 29 The International Classification of Disease, 10th revision (ICD‐10) codes were used to define the underlying cause of death based on death certificates. These codes defined the hepatobiliary cancers included in this study. Liver cancers included HCC (C22.0) and nonspecified liver cancer (NOS liver—C22.9), while biliary tract cancers included ICC (C22.1), ECC (C24.0, C24.8, and C24.9), and GBC (C23). “All hepatobiliary cancer” mortality rates were generated by combining all of these groups. We included all decedents that were identified in mortality records as non‐Hispanic Asian Indian, Chinese, Filipino, Japanese, Korean, and Vietnamese, and used the non‐Hispanic White (NHW) population as the reference group for analysis. Race in mortality records was based on reports from close relatives to decedents, linkage of mortality records to birth records, or by physician determination. These six AA subgroups were chosen for analysis because they collectively make up more than 85% of the Asian population in America [ 3 30 2.2 Calculation of Mortality Rates To calculate mortality rates (i.e., number of decedents for a cause of death divided by the underlying population strata), we used the NVSS Mortality Dataset to generate numerator data for each cancer subtype by race, sex, and 10‐year age category. We used annual estimates derived from the American Community Survey (ACS) to create population denominators, also stratified by race, sex, and 10‐year age category. The ACS is an annual survey conducted by the US Census that obtains social, economic, housing, and demographic information across the nation that influences the development of programs and policies [ 31 2.3 Statistical Analysis Direct age standardization was weighted according to the 2010 US Census estimated population. Specifically, for each given year (e.g., 2020), we calculated sex‐and age‐stratum‐specific mortality rates for a given cancer subtype and race group. We then applied the 2010 US Census estimated population as a weight to adjust for differences in age distribution between the given race group and the US population. We then combined the age‐specific rates to calculate an overall age‐standardized mortality rate (AMR) for the given year. Age standardization was done to account for the confounding of age demographics with race. For example, the Japanese‐American population is generally older than the NHW and other AA populations. We analyzed three outcomes stratified by sex: AMRs, proportional standardized mortality ratios (SMRs) with 95% confidence intervals (CIs), and trends over time using annual percent changes (APCs) and average annual percent changes (AAPCs). AMRs were calculated as deaths per 100,000 people following the method mentioned above. SMRs were calculated as the ratio of the AMRs of a specific AA subgroup divided by the rate of the reference NHW population. Data cleaning and analysis of AMRs and SMRs were performed using R version 4.3.1.22 [ 32 Trends over time and APCs were used to identify the direction and magnitude of mortality trends from 2005 to 2020 using Joinpoint Regression Version 5.0.2 [ 33 33 3 Results 3.1 All Hepatobiliary Cancers and Overall Cancer Burden Over the 16‐year study period, we observed 758,289 AA and 33,231,057 NHW deaths. From these, we identified 19,337 AA deaths and 282,935 NHW deaths from hepatobiliary cancer, accounting for 2.6% and 0.9% of all deaths among AAs and NHWs, respectively. Hepatobiliary cancer deaths constituted 1.4% of Asian Indian, 3.0% of Chinese, 2.0% of Filipino, 1.6% of Japanese, 3.9% of Korean, and 5.2% of Vietnamese deaths. The total number of hepatobiliary decedents and total population per racial subgroup from 2005 to 2020 is shown in Table 1 TABLE 1 Number of hepatobiliary cancer decedents and total population for non‐Hispanic White, Aggregated Asian American, and Disaggregated Asian American group by age and sex, 2005–2020 National Vital Statistics System. Aggregated Asian Asian Indian Chinese Filipino Total decedents (%) Total population (%) Total decedents (%) Total population (%) Total decedents (%) Total population (%) Total decedents (%) Total population (%) Age group 0–39 360 (1.8) 111 137 857 (52.4) 34 (2.3) 32,466,906 (62.8) 133 (2.1) 29 409 739 (51.0) 60 (1.7) 19 513 232 (47.3) 40–59 4141 (20.8) 62 240 682 (29.4) 328 (22.0) 13,143,146 (25.4) 1359 (21.5) 17 159 632 (29.8) 670 (19.5) 12 972 268 (31.4) 60+ 15,436 (77.4) 38 560 154 (18.2) 1131 (75.8) 6,091,967 (11.7) 4831 (76.4) 11 091 505 (19.2) 2706 (78.8) 8 800 941 (21.3) Sex Male 12,622 (63.3) 100 274 083 (47.3) 930 (62.3) 26,925,422 (52.1) 4243 (67.1) 27 036 775 (46.9) 2020 (58.8) 18 163 411 (44.0) Female 7315 (36.7) 111 664 610 (52.7) 563 (37.7) 24,746,597 (47.9) 2080 (32.9) 30 624 101 (53.1) 1416 (41.2) 23 123 030 (56.0) Japanese Korean Vietnamese Non‐Hispanic White Total decedents (%) Total population (%) Total decedents (%) Total population (%) Total decedents (%) Total population (%) Total decedents (%) Total population (%) Age Group 0–39 144 (7.4) * 4 019 395 (33.0) 40 (1.4) 11,674,378 (51.6) 84 (2.2) 14 054 207 (53.0) 2051 (0.7) 1 443 888 155 (45.8) 40–59 3 938 374 (32.4) 625 (21.5) 6,926,530 (30.6) 1024 (26.7) 8 100 732 (30.6) 55,003 (19.4) 893 827 269 (28.4) 60+ 1789 (92.6) 4 207 067 (34.6) 2247 (77.2) 4,036,532 (17.8) 2732 (71.2) 4 362 142 (16.5) 225,881 (79.8) 815 454 893 (25.9) Sex Male 829 (42.9) 5 150 270 (42.3) 1703 (58.5) 10,159,733 (44.9) 2897 (75.4) 12 838 472 (48.2) 177,877 (62.9) 1 551 964 725 (49.2) Female 1104 (57.1) 7 014 566 (57.7) 1209 (41.5) 12,477,707 (55.1) 943 (24.6) 13 679 609 (51.6) 105,058 (37.1) 1 601 205 592 (50.8) * The 0–39 age group was merged with the 40–59 group as it had fewer than 10 decedents. Note that “Total Population” represents the sum of the total population of the given race group from 2005 to 2020. Figure 1A S1 1B FIGURE 1 (A) Age‐standardized mortality rate (per 100,000 people) from hepatobiliary cancers for non‐Hispanic White, Asian Americans in aggregate, and disaggregated Asian American group, by sex, (B) Proportional mortality ratio from hepatobiliary cancers by race, 2005–2020 National Vital Statistics System. With respect to proportional mortality, HCC comprised the majority of hepatobiliary cancer deaths among each race group, with proportional mortality being highest among the Vietnamese. Additionally, nonspecified liver cancer was higher among Vietnamese individuals when compared to other racial and ethnic groups. 3.2 Hepatocellular Carcinoma In aggregate, AAs (4.14 per 100,000) demonstrated higher mortality from HCC than NHW people (2.33 per 100,000). Additionally, all AA subgroups besides Asian Indians (SMR = 0.54, 95% CI 0.50–0.58) had increased mortality compared to NHWs. Vietnamese (SMR = 3.29, 95% CI 3.14–3.43), Korean (SMR = 2.33, 95% CI 2.20–2.46), and Chinese (SMR = 2.03, 95% CI 1.95–2.11) people had between two and three‐fold higher HCC mortality when compared to NHW people. Figure 1B When analyzing males separately, differences in mortality across racial subgroups are similar to those for the general population. Vietnamese (SMR = 3.34, 95% CI 3.18–3.51), Korean (SMR = 2.13, 95% CI 1.99–2.28), and Chinese males (SMR = 2.00, 95% CI 1.91–2.09) had up to threefold higher mortality than NHW males (3.77 per 100,000). However, analyzing female mortality rates had a different trend. Japanese (SMR = 3.34, 95% CI 2.91–3.81), Korean (SMR = 3.17, 95% CI 2.85–3.51), Vietnamese (SMR = 3.04, 95% CI 2.74–3.36), and Chinese (SMR = 2.17, 95% CI 2.00–2.35) females demonstrated higher mortality than NHW females (0.89 per 100,000). Figure 2 S2 2B S3 S2 S3 S3 FIGURE 2 Annual age‐adjusted mortality rates (per 100,000 people) from all hepatobiliary cancers (Panel A), hepatocellular carcinoma (Panel B), nonspecified liver cancer (Panel C), intrahepatic cholangiocarcinoma (Panel D), extrahepatic cholangiocarcinoma (Panel E), and gallbladder cancers (Panel F). The data are presented for non‐Hispanic White people (NHWs) and disaggregated Asian American subgroups for the years 2005–2020. When stratified by sex, only Asian Indian males (AAPC = 4.2%, 95% CI 2.4, 6.9%) and Vietnamese males (AAPC = 1.5%, 95% CI 0.6, 2.8%) experienced increases in HCC mortality, while most other AA groups experienced declines in HCC mortality (Table S2 3.3 Nonspecified Liver Cancer As with HCC, AA people (2.77 per 100,000) demonstrated significantly higher mortality from NOS liver cancer than NHW people (2.00 per 100,000). Of the AA subgroups, only Asian Indian (SMR = 0.42, 95% CI 0.38–0.46) and Filipino (SMR = 1.04, 95% CI 0.97–1.11) people did not have higher mortality than NHW people. Vietnamese people (SMR = 2.79, 95% CI 2.65–2.93) demonstrated the highest mortality relative to NHW people. The proportional mortality ratio of NOS liver cancer was also highest for the Vietnamese group, potentially indicating that most liver cancer deaths that were not specified were actually HCC. Across all racial subgroups except for Japanese, male individuals had higher mortality than female individuals. Differences in mortality for male individuals are similar to those for both sexes in aggregate. Asian Indian people (SMR = 0.41, 95% CI 0.37–0.46) demonstrated lower mortality than NHW people, while mortality for both Filipino (SMR = 1.06, 95% CI 0.98–1.16) and Japanese (SMR = 0.87, 95% CI 0.72–1.03) people did not differ significantly from NHW mortality. Vietnamese males (SMR = 3.05, 95% CI 2.87–3.24) had the highest mortality relative to NHW males. Results are similar for females, with all groups besides Asian Indian (SMR = 0.45, 95% CI 0.38–0.53) and Filipino (SMR = 0.98, 95% CI 0.87–1.10) females having higher mortality than NHW females, and Vietnamese (SMR = 2.18, 95% CI 1.96–2.41) females having the highest mortality. From 2005 to 2020 (Figure 2C S2 S3 2C 2 When disaggregated by sex, AA males experienced a general decline in NOS liver cancer mortality (AAPC = −1.5%, 95% CI −1.9%, −0.8%) while AA females did not experience a significant change in NOS liver cancer mortality (AAPC = −2.1%, 95% CI −3.1%, 1.5%). However, similar to our general results, AA females experienced a nonsignificant increase from 2005 to 2014 (APC = 1.3%, 95% CI −1.4%, 27.9%) followed by a decline from 2014 to 2020 (APC = −7.0%, 95% CI −12.8%, −3.2%). 3.4 Intrahepatic Cholangiocarcinoma AA people (1.75 per 100,000) demonstrated significantly higher ICC mortality than NHW people (1.58 per 100,000). However, the Asian Indian (SMR = 0.67, CI 0.62–0.73) and Vietnamese (SMR = 0.83, 95% CI 0.75–0.92) people had lower mortality than NHW people, while Filipino people's mortality (SMR = 0.93, 95% CI 0.86–1.01) was not significantly different compared to NHW people. Alternatively, Japanese (SMR = 1.20, 95% CI 1.05–1.35) and Chinese (SMR = 1.28, 95% CI 1.21–1.35) people had higher mortality, and Korean people had the highest mortality (SMR = 1.96, 95% CI 1.82–2.11). Similar to the other liver cancers, males had significantly higher mortality than females across all racial subgroups, excluding Asian Indian people. Results are similar for males compared to the population as a whole, with AA males (2.01 per 100,000) demonstrating higher mortality than NHW males (1.74 per 100,000). Of the AA subgroups, Japanese (SMR = 1.24, 95% CI 1.02–1.48), Chinese (SMR = 1.33, 95% CI 1.22–1.43), and Korean (SMR = 2.31, 95% CI 2.09–2.54) males had higher mortality than NHW males, with the difference between Koreans and NHWs being the largest. Among females, similar but smaller differences emerged. While Asian Indian (SMR = 0.75, 95% CI 0.66–0.84) and Vietnamese (SMR = 0.67, 95% CI 0.56–0.79) females had lower mortality than NHW females, Chinese (SMR = 1.22, 95% CI 1.12–1.32) and Korean (SMR = 1.56, 95% CI 1.36–1.73) females had significantly higher mortality than NHW females. For both AA people (APC 3.0%, 95% CI 2.1, 4.5%) and NHW people (APC 3.5%, 95% CI 3.3, 3.7%), ICC mortality significantly increased over the study period (Figure 2D S2 S3 Trends are fairly similar between males and females. For males, all AA subgroups and NHWs had increases in ICC mortality over the study period, with the increase not being statistically significant for Koreans only. Again, no Joinpoints were included in any of the regressions. Similarly, for females, all AA subgroups and NHWs generally had increases in mortality over the study period, although these increases were not statistically significant for the Chinese and Japanese groups. 3.5 Extrahepatic Cholangiocarcinoma Of all of the hepatobiliary cancers, ECC is the only one for which AA mortality (0.38 per 100,000) was lower than NHW mortality (0.42 per 100,000). Although AA mortality was low overall, there were clear disparities between subgroups. While most subgroups had either similar or low ECC mortality compared to NHW people, Japanese (SMR = 1.38, 95% CI 1.07–1.72) and Korean (SMR = 1.73, 95% CI 1.47–2.00) people had significantly higher mortality. As with the liver cancers, male mortality (0.42 per 100,000) was higher than female mortality (0.33 per 100,000) for AA people. Besides this difference in overall mortality, there were no significant differences in mortality between the males and females when looking at racial subgroups individually. For both sexes, Korean (male SMR = 1.95, 95% CI 1.56–2.38, female SMR = 1.48, 95% CI 1.15–1.84) people had significantly higher mortality than NHW (male = 0.44 per 100,000, female = 0.39 per 100,000) people. Due to the relatively low number of ECC deaths, trends over time in mortality were mostly insignificant (Figure 2E S2 S3 Only Vietnamese (AAPC = 8.4%, 95% CI 4.5, 16.4%) and Chinese (AAPC = 2.6%, 95% CI 0.5, 10.9%) males had significant AAPCs. While the trend was steady across the study period for Vietnamese males, Chinese males experienced an insignificant increase in mortality from 2005 to 2010 (APC = 9.0%, 95% CI −1.8, 116.4%) followed by a decrease from 2010 to 2016 (APC = −10.3%, 95% CI −32.6, −3.2%) and another increase from 2016 to 2020 (APC = 16.5%, 95% CI 6.7, 59.1%). NHW males had no significant change over the study period, but they saw a significant decrease in mortality between 2005 and 2013 (APC = −1.5%, 95% CI −5.1, −0.2%) followed by an increase between 2013 and 2020 (APC = 2.2%, 95% CI 0.9, 5.9%). AA females as a whole experienced a significant increase in mortality over the study period (AAPC = 1.9%, 95% CI 0.1, 4.8%), which was driven by significant increases experienced by Asian Indian (AAPC = 6.0%, 95% CI 1.7, 14.2%), Korean (AAPC = 4.6%, 95% CI 2.2, 9.7%), and Vietnamese (AAPC = 2.9%, 95% CI 2.2, 9.7%) females. On the other hand, mortality decreased for NHW females (AAPC = −1.3%, 95% CI −1.8, −0.4%). This was driven by a sharp decrease from 2005 to 2009 (APC = −5.1%, 95% CI −11.4, 1.4%). 3.6 Gallbladder Carcinoma While low, aggregated AA people (0.59 per 100,000) had higher GBC mortality than NHW people (0.52 per 100,000). Of the AA subgroups, only Filipino (SMR = 0.84, 95% CI 0.73–0.97) people had significantly lower mortality than NHW people, while Chinese (SMR = 1.21, 95% CI 1.09–1.34) and Korean (SMR = 1.86, 95% CI 1.62–2.11) people had higher mortality. While males generally have higher hepatobiliary cancer mortality, AA females (0.65 per 100,000) had higher gallbladder cancer mortality than their male counterparts (0.52 per 100,000). Results for males individually are similar but more pronounced. While most subgroups had similar mortality to NHW people, Chinese (SMR = 1.55, 95% CI 1.32–1.80) and Korean (SMR = 2.52, 95% CI 2.04–3.05) people had significantly higher mortality, with the difference between Korean and NHW people being especially magnified. As a whole, female AAs (0.65 per 100,000) had similar gallbladder cancer mortality compared to that of NHW people (0.66 per 100,000). Filipino (SMR = 0.75, 95% CI 0.62–0.89) and Vietnamese (SMR = 0.78, 95% CI 0.61–0.97) females had low mortality compared to NHW females, while only Korean (SMR = 1.48) females had significantly higher mortality. Over the study period, mortality only decreased significantly for the Chinese (AAPC = −4.5%, 95% CI −5.7, −2.8%; Table S2 2F For males, only Asian Indians (AAPC = 4.8%, 95% CI 0.5, 16.5%) and NHWs (AAPC = −1.6%, CI −2.2, −0.9%) experienced significant changes in mortality across the study period. The Asian Indian trend was driven by a sharp increase in mortality from 2005 to 2010 (APC = 40.3%, 95% CI 10.8, 208.3%, Table S3 4 Discussion In our analysis of US death records from 2005 to 2020, we examined hepatobiliary cancer mortality trends among disaggregated AA subgroups in comparison to NHWs. Previous research has reported distinct and divergent temporal patterns of mortality rates between AA subgroups for GI cancers, including esophageal, gastric, colorectal, liver, and pancreatic cancers [ 33 33 4 Given that these subtypes have unique etiologies and environmental risk factors, more precise identification of hepatobiliary cancer subtypes can help guide targeted public health interventions and screening modalities, therapeutic strategies, and improve patient outcomes. Mortality from hepatobiliary cancer varies nearly threefold between high mortality (e.g., Vietnamese and Korean American people) and low mortality (e.g., Asian Indian people) subgroups. Moreover, the distribution of hepatobiliary cancer mortality demonstrates substantial variability among AA subgroups, underscoring the imperative need to develop national strategies for mitigating cancer risk and prevention, as well as treatment tailored to the diverse, multiethnic populations of the US. Cancer mortality incorporates both cancer incidence and measures of survival after diagnosis. The high and increasing incidence, coupled with the poor prognosis of liver cancer and disparities in risk factors and care, results in a strong association between the number of new cases and the number of deaths [ 34 35 HCC development is influenced by a range of factors, including chronic infections with HBV and HCV infections, alcoholic liver disease, hemochromatosis, and nonalcoholic steatohepatitis, alongside genetic and environmental contributions [ 34 36 37 33 Consistent with prior literature, we have found that in AA subgroups, male individuals experienced significantly higher hepatobiliary cancer mortality rates compared to females [ 33 38 Our analysis of trends over time reveals the heterogeneity in diverging temporal patterns of mortality among AA subgroups. Vietnamese people, for example, experienced a general increase in HCC from 2005 to 2020. However, during that same time period, Vietnamese people experienced a dramatic increase in nonspecified liver cancer from 2005 to 2014, only to experience a general decline from 2015 to 2020. Despite these heterogeneous trends, Vietnamese people continued to have some of the highest cancer mortality rates among disaggregated AA subgroups. The high burden of increasing mortality rates from liver cancer among Vietnamese Americans may likely be associated with the high prevalence of chronic HBV infection (estimated at > 10%) in Vietnam, when comparing infection rates to the general American population (estimated at < 1%) [ 39 40 41 42 Joinpoint regression analysis revealed important temporal trends in hepatobiliary cancer mortality. While HCC remains the most prevalent subtype, ICC mortality rates increased across every racial and ethnic group during the study period. This consistent upward trend in ICC underscores a shifting landscape in liver cancer burden and reinforces previous findings documenting rising ICC incidence and mortality in the US [ 4 43 44 45 46 42 4.1 Limitations and Strengths It is important to acknowledge the limitations in our analysis. First, race and ethnicity information collected from death certificates follows the classification standards set by the Office of Management and Budget (OMB) to ensure consistent reporting across the US [ 47 48 49 Similarly, classification of causes of death poses its own difficulties. These data are collected from decedents who may have comorbidities and are recorded by physicians, medical examiners, or funeral directors based on known clinical knowledge or information provided by next of kin or observation [ 35 48 49 49 Covariates such as HBV infection, alcohol consumption, stage of cancer at diagnosis, or access to healthcare were not considered. As previous literature suggests that hepatobiliary carcinomas may be associated with these environmental risk factors, which may differ between the US and Asian countries, future research on these related factors is warranted. Additionally, coding for biliary tract cancers may be imprecise, as the nonspecified (NOS) category is quite large and encompasses malignant neoplasms of the liver that are not specified as primary or secondary malignancies. Finally, although Joinpoint Regression allows us to evaluate possible nonlinear trends in cancer mortality by identifying key inflection points where the APCs change from 2005 to 2020, there are some inherent limitations. First, Joinpoint Regression is unable to incorporate additional covariates that may confound trends in hepatobiliary cancer over time. Additionally, Joinpoint regression simply describes trends in cancer mortality but cannot identify factors (e.g., medical innovations, public health interventions, policy changes) that underlie changes in trends. Finally, the accuracy of these trends also relies on the data quality, the time span of years examined, and model assumptions. Future work should examine how trends in hepatobiliary cancer are related to changes in medical innovations, public health interventions, and policy changes. Nonetheless, our study is novel in presenting unique data that pertains specifically to cultivating a baseline understanding of hepatobiliary cancer subtypes. However, aligned with prior research findings, we demonstrate strong sex‐ and race/ethnicity‐specific patterns in mortality rates of hepatobiliary cancer among AA subgroups. Notably, previous studies have shown that liver cancer constituted over 20% of Vietnamese male cancer deaths, higher than in any other racial group [ 15 36 15 36 4 15 33 5 Conclusion Our study contributes to the broader understanding of health disparities within AA subgroups within the US. By highlighting hepatobiliary cancer mortality rates across different AA subgroups, we provide valuable insights into the complex interplay of sociodemographic, cultural, and biological factors influencing disease outcomes. This nuanced understanding can inform targeted public health interventions aimed at reducing disparities and improving health equity among these populations. Additionally, our study underscores the importance of disaggregated data analysis in epidemiological research. By disaggregating data by AA subgroups, we were able to uncover disparities that may have been obscured in aggregated data collection and analyses. This approach allows for more precise identification of at‐risk populations and facilitates the development of tailored interventions to address their specific needs and risk factors. Author Contributions  Anna Park: Andrew Vodinh‐Ho: Ivory Rok: Xinran Qi: George A. Hung: Nicholas Kikuta: Armaan Jamal: Gloria S. Kim: Latha P. Palaniappan: Malathi Srinivasan: Robert J. Huang: Adrian M. Bacong: Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Figure S1:  Figure S2:  Figure S3:  Table S1:  Table S2:  Table S3: Acknowledgements The authors thank Karina M. Kim of Stanford University for providing administrative support for the project. Additionally, the authors thank the Stanford University Center for Asian Health Research and Education for administrative and financial support of the project. Data Availability Statement Restricted‐use mortality data were obtained from the United States National Center for Health Statistics (NHCS) under a data use agreement. The raw data can be accessed by submitting an application to the NCHS. The population data derived from the American Community Survey were obtained through the Integrated Public Use Microdata Series (IPUMS) through the University of Minnesota and are freely available to the public. References 1 A. Budiman N. G. Ruiz Pew Research Center Key Facts About Asian Americans, A Diverse and Growing Population 2021 https://www.pewresearch.org/short‐reads/2021/04/29/key‐facts‐about‐asian‐americans/ 2 A. Jamal M. Srinivasan G. Kim R. Huang L. Palaniappan Why Are We Going Backward? Barriers to Disaggregated Racial Information in Federal Data Sets American Journal of Public Health 113 8 2023 852 855 10.2105/AJPH.2023.307339 37319392 PMC10323851 3 A. Holland L. Palaniappan Problems With the Collection and Interpretation of Asian‐American Health Data: Omission, Aggregation, and Extrapolation Annals of Epidemiology 22 6 2015 397 405 10.1016/j.annepidem.2012.04.001 PMC4324759 22625997 4 Y. Jiang L. Jiang F. Li The Epidemiological Trends of Biliary Tract Cancers in The United States of America BMC Gastroenterology 22 1 2022 546 10.1186/s12876-022-02637-8 36581813 PMC9801670 5 R. Lee R. Madan J. Kim E. Posadas E. Yu Disparities in Cancer Care and the Asian American Population Oncologist 26 6 2021 453 560 10.1002/onco.13748 33683795 PMC8176990 6 A. M. Bacong S. L. Gibbs A. G. Rosales Obesity Disparities Among Adult Single‐Race and Multiracial Asian and Pacific Islander Populations JAMA Network Open 7 3 2024 e240734 https://jamanetwork.com/journals/jamanetworkopen/article‐abstract/2816463 38502128 10.1001/jamanetworkopen.2024.0734 PMC10951735 7 N. S. Shah C. Luncheon N. R. Kandula P. Cho F. Loustalot J. Fang Self‐Reported Diabetes Prevalence in Asian American Subgroups: Behavioral Risk Factor Surveillance System, 2013–2019 Journal of General Internal Medicine 37 2022 1902 1909 10.1007/s11606-021-06909-z 34109541 PMC9198162 8 N. S. Shah S. S. Khan M. R. Carnethon A. M. Bacong L. P. Palaniappan Diabetes‐Related Cardiovascular and All‐Cause Mortality in Asian American Subgroups Journal of the American College of Cardiology: Asia 3 3, Part 1 2023 365 372 https://www.sciencedirect.com/science/article/pii/S2772374723000029 9 Y. G. Daida A. G. Rosales T. B. Frankland Differences in Coronary Heart Disease and Stroke Incidence Among Single‐Race and Multiracial Asian and Pacific Islander Subgroups in Hawaii and California: A Retrospective Cohort Study Journal of the American Heart Association 14 2025 e039076 10.1161/JAHA.124.039076 40240959 PMC12184270 10 B. Waitzfelder L. Palaniappan A. Varga Prevalence of Cardiovascular Disease Among Asian, Pacific Islander and Multi‐Race Populations in Hawai'i and California BMC Public Health 23 2023 885 10.1186/s12889-023-15795-5 37189145 PMC10184427 11 J. Li Y. G. Daida A. M. Bacong Trends in Cigarette Smoking and the Risk of Incident Cardiovascular Disease Among Asian American, Pacific Islander, and Multiracial Populations American Journal of Preventive Cardiology 19 2024 100688 https://www.sciencedirect.com/science/article/pii/S2666667724000564 39070025 10.1016/j.ajpc.2024.100688 PMC11278113 12 N. S. Shah K. Xi K. I. Kapphahn Cardiovascular and Cerebrovascular Disease Mortality in Asian American Subgroups Circulation. Cardiovascular Quality and Outcomes 15 5 2022 e008651 10.1161/CIRCOUTCOMES.121.008651 35535589 PMC9117444 13 H. Rumgay M. Arnold J. Ferlay Global Burden of Primary Liver Cancer in 2020 and Predictions to 2040 Journal of Hepatology 77 6 2022 1598 1606 10.1016/j.hep.2022.08.021 36208844 PMC9670241 14 F. Castro J. Koshiol A. Hsing S. Devesa Biliary Tract Cancer Incidence in the United States – Demographic and Temporal Variations by Anatomic Site International Journal of Cancer 133 7 2013 1664 1671 10.1002/ijc.28161 23504585 PMC3713194 15 D. Li T. VoPham M. Tang C. Li Disparities in Risk of Advanced‐Stage Liver Cancer and Mortality by Race and Ethnicity Journal of the National Cancer Institute 114 9 2022 1238 1245 10.1093/jnci/djac097 35552746 PMC9468287 16 National Cancer Institute Liver and Bile Duct Cancer—Patient Version 2019 https://www.cancer.gov/types/liver 17 D. Kim P. Konyn G. Cholankeril C. Bonham A. Ahmed Trends in the Mortality of Biliary Tract Cancers Based on Their Anatomical Site in the United States From 2009 to 2018 American Journal of Gastroenterology 116 5 2021 1053 1062 10.14309/ajg.0000000000001151 33929380 18 A. B. Benson M. I. D'Angelica D. E. Abbott Hepatobiliary Cancers, Version 2.2021, NCCN Clinical Practice Guidelines in Oncology Journal of the National Comprehensive Cancer Network 19 5 2021 541 565 10.6004/jnccn.2021.0022 34030131 19 A. Arvind K. Redmon A. G. Singal Persisting Challenges in the Early Detection of Hepatocellular Carcinoma Expert Review of Anticancer Therapy 25 2025 1 12 10.1080/14737140.2025.2467184 39943795 PMC12353231 20 v. Meer S Surveillance for Hepatocellular Carcinoma in Chronic Liver Disease: Evidence and Controversies World Journal of Gastroenterology 19 40 2013 6744 10.3748/wjg.v19.i40.6744 24187450 PMC3812474 21 S. Yamamoto S. Kubo S. Hai Hepatitis C Virus Infection as a Likely Etiology of Intrahepatic Cholangiocarcinoma Cancer Science 95 7 2004 592 595 10.1111/j.1349-7006.2004.tb02492.x 15245596 PMC11158843 22 Columbia University Irving Medical Center Liver Disease and Why It's a Concern for Asian Americans and Pacific Islanders 2022 https://www.cuimc.columbia.edu/news/liver‐disease‐and‐why‐its‐concern‐asian‐americans‐and‐pacific‐islanders 23 UCLA Health Asian Liver Disease 2023 https://www.uclahealth.org/medical‐services/asian‐liver/asian‐liver‐disease 24 B. M. Fung K. D. Lindor J. H. Tabibian Cancer Risk in Primary Sclerosing Cholangitis: Epidemiology, Prevention, and Surveillance Strategies World Journal of Gastroenterology 25 6 2019 659 671 10.3748/wjg.v25.i6.659 30783370 PMC6378537 25 M. H. Nguyen A. S. Whittemore R. T. Garcia Role of Ethnicity in Risk for Hepatocellular Carcinoma in Patients With Chronic Hepatitis C and Cirrhosis Clinical Gastroenterology and Hepatology 2 9 2004 820 824 10.1016/S1542-3565(04)00353-2 15354283 26 J. Koshiol B. Yu S. M. Kabadi K. Baria R. T. Shroff Epidemiologic Patterns of Biliary Tract Cancer in the United States: 2001–2015 BMC Cancer 22 1 2022 1178 10.1186/s12885-022-10286-z 36384474 PMC9670575 27 H. N. Medina K. E. Callahan C. R. Morris C. A. Thompson A. Siweya P. S. Pinheiro Cancer Mortality Disparities Among Asian American and Native Hawaiian/Pacific Islander Populations in California Cancer Epidemiology, Biomarkers & Prevention 30 7 2021 1387 1396 10.1158/1055-9965.EPI-20-1528 PMC8254771 33879454 28 S. L. Kwong M. S. Chen K. P. Snipes D. G. Bal W. E. Wright Asian Subgroups and Cancer Incidence and Mortality Rates in California Cancer 104 S12 2005 2975 2981 10.1002/cncr.21511 16247792 PMC1810966 29 Centers for Disease Control and Prevention NVSS – National Vital Statistics System Homepage 2019 https://www.cdc.gov/nchs/nvss/index.htm 30 US Census Bureau About the Survey 2019 https://www.census.gov/programs‐surveys/acs/about.html 31 RStudio Team RStudio: Integrated Development for R 2020 http://www.rstudio.com/ 32 Statistical Methodology and Applications Branch, Surveillance Research Program, National Cancer Institute Joinpoint Regression Program, Version 5.0.2 2023 33 R. J. Huang N. Sharp R. Talamoa Disaggregated Mortality From Gastrointestinal Cancers in Asian Americans: Analysis of United States Death Records International Journal of Cancer 148 12 2021 2954 2963 10.1002/ijc.33490 33527405 34 S. K. Singh R. Singh Liver Cancer Incidence and Mortality: Disparities Based on Age, Ethnicity, Health and Nutrition, Molecular Factors, and Geography Cancer Health Disparities 4 2020 e1 https://pmc.ncbi.nlm.nih.gov/articles/PMC8218735/ PMC8218735 34164612 35 Y. Zhang Q. Wang H. Xie Incidence of Liver Cancer Among Asian Americans and Native Asians HPB: The Official Journal of the International Hepato Pancreato Biliary Association 25 2023 S116 https://www.hpbonline.org/article/S1365‐182X(23)00377‐5/fulltext 36 A. B. Ryerson C. R. Eheman S. F. Altekruse Annual Report to the Nation on the Status of Cancer, 1975–2012, Featuring the Increasing Incidence of Liver Cancer Cancer 122 9 2016 1312 1337 10.1002/cncr.29936 26959385 PMC4840031 37 P. S. Pinheiro J. Zhang V. W. Setiawan H. M. Cranford R. J. Wong L. Liu Liver Cancer Etiology in Asian Subgroups and American Indian, Black, Latino, and White Populations JAMA Network Open 8 3 2025 e252208 10.1001/jamanetworkopen.2025.2208 40146106 PMC11950898 38 D. T. Zhu I. R. Pompa D. Qi S. I. Goldberg R. J. Lee S. C. Kamran US Cancer Mortality Trends Among Asian and Pacific Islander Populations JAMA Network Open 7 11 2024 e2442451 10.1001/jamanetworkopen.2024.42451 39495513 PMC11581537 39 V. M. Taylor Y. Yasui N. Burke Hepatitis B Testing Among Vietnamese American Men Cancer Detection and Prevention 28 3 2004 170 177 10.1016/j.cdp.2004.01.003 15225896 PMC1618784 40 T. Pham L. Bui G. Kim D. Hoang T. Tran M. Hoang Cancers in Vietnam—Burden and Control Efforts: A Narrative Scoping Review. Cancer Control Journal of the Moffitt Cancer Center 26 1 2019 1073274819863802 10.1177/1073274819863802 PMC6643189 31319695 41 CDC Testing and Public Health Management of Persons With Chronic HBV 2020 https://www.cdc.gov/hepatitis/hbv/testingchronic.htm 42 W. C. Palmer T. Patel Are Common Factors Involved in the Pathogenesis of Primary Liver Cancers? A Meta‐Analysis of Risk Factors for Intrahepatic Cholangiocarcinoma Journal of Hepatology 57 1 2012 69 76 10.1016/j.jhep.2012.02.022 22420979 PMC3804834 43 O. Clements J. Eliahoo J. U. Kim S. D. Taylor‐Robinson S. A. Khan Risk Factors for Intrahepatic and Extrahepatic Cholangiocarcinoma: A Systematic Review and Meta‐Analysis Journal of Hepatology 72 1 2020 95 103 10.1016/j.jhep.2019.09.007 31536748 44 P. J. Brindley M. Bachini S. I. Ilyas Cholangiocarcinoma Nature Reviews Disease Primers 7 1 2021 65 10.1038/s41572-021-00300-2 PMC9246479 34504109 45 J. L. Petrick B. Yang S. F. Altekruse Risk Factors for Intrahepatic and Extrahepatic Cholangiocarcinoma in the United States: A Population‐Based Study in SEER‐Medicare PLoS One 12 10 2017 e0186643 10.1371/journal.pone.0186643 29049401 PMC5648218 46 P. L. Labib G. Goodchild S. P. Pereira Molecular Pathogenesis of Cholangiocarcinoma BMC Cancer 19 1 2019 185 10.1186/s12885-019-5391-0 30819129 PMC6394015 47 S. L. Murphy J. Xu K. D. Kochanek E. Arias B. Tejada‐Vera Deaths: Final Data for 2018 National Vital Statistics Reports: From the Centers for Disease Control and Prevention, National Center for Health Statistics, National Vital Statistics System 69 13 2021 1 83 https://pubmed.ncbi.nlm.nih.gov/33541516/ 33541516 48 F. B. Ahmad Provisional Mortality Data — United States, 2020 MMWR. Morbidity and Mortality Weekly Report 70 14 2021 519 522 10.15585/mmwr.mm7014e1 33830988 PMC8030985 49 U. S. H. Gamage T. Adair L. Mikkelsen The Impact of Errors in Medical Certification on the Accuracy of the Underlying Cause of Death PLoS One 16 11 2021 e0259667 10.1371/journal.pone.0259667 34748575 PMC8575485 ",
  "metadata": {
    "Title of this paper": "The Impact of Errors in Medical Certification on the Accuracy of the Underlying Cause of Death",
    "Journal it was published in:": "Cancer Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477800/"
  }
}