{
  "title": "Paper_317",
  "abstract": "pmc J Family Med Prim Care J Family Med Prim Care 2192 jfammpc JFMPC J Family Med Prim Care Journal of Family Medicine and Primary Care 2249-4863 2278-7135 Wolters Kluwer -- Medknow Publications PMC12488113 PMC12488113.1 12488113 12488113 41041192 10.4103/jfmpc.jfmpc_288_25 JFMPC-14-3298 1 Original Article Prevalence and sociodemographic correlates of second-hand smoke exposure among nonsmoking adults in district Rohtak, Haryana Chayal Vinod 1 Sasidharan Shravan Kumar 2 Verma Ramesh 1 Kalhan Meenakshi 1 Singh Yogender 1 Hussain Sadam 1 Rohilla Mohit 1 Yadav Rohit 1 Shivaji Bhavana 1 Gupta Bidipta S. 1  1 Department of Community Medicine, Pandit Bhagwat Dayal Sharma Post Graduate Institute of Medical Science (Pt. B.D Sharma PGIMS), Rohtak, Haryana, India  2 Senior Resident, Department of Community Medicine, A.C.S Medical College and Hospital, Dr. M.G.R Educational and Research Institute, Chennai, Tamilnadu, India Address for correspondence: imshravan10@gmail.com 8 2025 24 9 2025 14 8 498122 3298 3304 17 2 2025 01 4 2025 02 4 2025 01 08 2025 02 10 2025 03 10 2025 Copyright: © 2025 Journal of Family Medicine and Primary Care 2025 https://creativecommons.org/licenses/by-nc-sa/4.0/ This is an open access journal, and articles are distributed under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike 4.0 License, which allows others to remix, tweak, and build upon the work non-commercially, as long as appropriate credit is given and the new creations are licensed under the identical terms. A BSTRACT Background: Second-hand smoke (SHS) accounts for 0.9 million deaths and 24 million disability adjusted life years annually. SHS exposure has been associated to a wide range of diseases thus far, with the majority of studies focused on the link between SHS exposure and the development of cardiovascular disorders or lung cancer. Objectives: The objectives of the study were to estimate the prevalence of SHS exposure and identify its sociodemographic correlates among nonsmokers and also to assess knowledge and attitude toward SHS among nonsmokers in adults. Methodology: The study included 400 subjects where 200 each was recruited from rural and urban areas. Twenty were selected randomly using survey registers from each of the ten subcentes from rural areas. From urban areas, 66 subjects were selected randomly from three urban health posts. Data collection included information that was recorded on a predesigned, pretested semistructured interview schedule. Results: The prevalence of second-hand exposure at home was found to be 44% and 54% in urban and rural areas, respectively, whereas at workplaces, it was found to be 50.5% and 60.9%. It also reflected SHS exposure at home is significantly associated with study area, age category, occupation, and education, while SHS exposure at workplaces is significantly associated with occupation, education, and socioeconomic scale. Conclusion: The study highlights a high prevalence of second-hand smoke exposure among nonsmokers in both rural and urban areas, particularly at home and workplaces. Sociodemographic factors such as age, occupation, education, and socioeconomic status significantly influence SHS exposure. These findings underscore the need for targeted public health interventions, including awareness campaigns and policy enforcement, to reduce SHS exposure and protect nonsmokers from its harmful effects. Nonsmokers second-hand smoke SHS tobacco Nil. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Second-hand smoke (SHS), also known as environmental tobacco smoke (ETS) in the literature, is made up of side stream smoke discharged into the environment by burning cigarettes and other tobacco products in between puffs, as well as mainstream smoke exhaled by the smoker. Second-hand tobacco smoke is also referred to as ETS. Third-hand smoke occurs when tobacco smoke leaves residual nicotine and other chemicals on indoor surfaces, skin, fur, and furniture, even after the air has cleared.[ 1 Side-stream smoke releases five times as much carbon monoxide and twice as much tar into the air as compared to what enters a smoker’s lungs.[ 2 3 4 5 6 Second-hand smoke (SHS) accounts for 0.9 million deaths and 24 million disability adjusted life years (DALYs) annually. SHS exposure has been associated to a wide range of diseases thus far, with the majority of studies focused on the link between SHS exposure and the development of cardiovascular disorders or lung cancer. SHS increases the risk of heart disease and lung cancer by 25–30% and 20–30%, respectively, in people who are exposed to it.[ 7 8 9 10 11 12 Though there is general awareness among public about ill effects of SHS exposure through legislation of COTPA Act, strict implementation of various rules and penalization are not done at the ground level. In a state like Haryana, hookah usage has been seen in many houses and is used as a customary practice irrespective of their social and economic status. There are many literature studies about the prevalence of usage of hookah and other tobacco products, but studies about SHS exposure are very limited. The objectives of the study were to estimate the prevalence of SHS exposure and identify its sociodemographic correlates among nonsmokers. Also, this study assessed knowledge and attitude toward SHS among nonsmokers in adults of age 18–60 years in district Rohtak, Haryana. Material and Methods After obtaining ethical clearance, this descriptive cross-sectional study was conducted in rural and urban field practice areas attached to the Department of Community Medicine, Pt. BD Sharma PGIMS, Rohtak. The study was conducted over a period of 12 months (2022–2023) from the date of commencement. Nonsmoking adults in the age group of 18–60 years who were willing to participate and residing in the study area for more than 6 months were included. Study subjects who were using any form of tobacco including smokeless tobacco and those who were severely ill or have severe mental illness were excluded from the study. Sample size was calculated taking prevalence as 51% second hand exposed in home in urban areas from Global Adult Tobacco Survey (GATS) conducted in Haryana 2016–2017[ 13 Figure 1 Figure 1 Flowchart of Methodology A questionnaire was designed for the study which consisted of information regarding sociodemographic profiles of study subjects and information regarding SHS exposure of the study participants from the GATS, which was administered to the study subjects. It is the standardized tool and is freely available in the public domain. The questionnaire also consisted of information about knowledge and attitude toward SHS exposure which were in the form of Yes/No questions and Likert scale, respectively. The investigator met the subject to explain the purpose of the study with patient information sheets, and a written consent was sought to seek their cooperation before the study. Help of health workers/ASHA/Anganwadi workers at the time of the interview was taken. The purpose of the study was explained in the study subject’s vernacular language in detail. The confidentiality of the information obtained was maintained. Data were collected, compiled, and entered in the MS Excel sheet. Analysis was carried out using MS Excel with appropriate statistical tests wherever applicable. Results From Table 1 Table 1 Distribution of subjects according to whether smoking is allowed inside the home ( n Is smoking allowed inside the home Urban ( n Rural ( n   Frequency Percentage Frequency Percentage Yes 88 44 108 54 Not allowed but exceptions 24 12 35 17.5 Never allowed 88 44 57 28.5 Total 200 100 200 100 People who reported yes when they were asked if smoking was allowed inside home were considered exposed to SHS at home. Figure 2 Figure 2 Prevalence of SHS Exposure People who reported yes when they were asked if anyone smokes in indoor areas where they work in the past 30 days were considered exposed to SHS at workplace. Figure 2 Subjects who answered yes or not allowed but with exceptions when they were asked if smoking was allowed inside home were asked this question. Table 2 Table 2 Distribution of subjects according to how often anyone smokes inside the home ( n How often does anyone smoke inside home Urban ( n Rural ( n  Frequency Percentage Frequency Percentage Daily 64 57.2 86 60.1 Weekly 4 3.6 32 22.4 Monthly 0 0 6 4.2 Less than monthly 24 21.4 16 11.2 Never 20 17.8 3 2.1 Total 112 100 143 100 The present study collected data on exposure to SHS during 30 days prior to the interview at six different categories of public places: 1) government building/Government office, 2) healthcare facility, 3) restaurant/public eating places, 4) public transportation, 5) night club/bar, and 6) university buildings. Figure 3 Figure 3 Distribution of subjects who reported exposure to SHS at public places Table 3 P P P P P P Table 3 Association of second-hand exposure at home with various demographic predictors ( n Demographic Predictors Second-Hand Exposure at Home Total Association  Yes No Study Area χ 2 Urban 88 (44%) 112 (56%) 200 df=1 Rural 108 (54%) 92 (46%) 200 P Gender χ 2 Male 111 (43.5%) 144 (56.5%) 255 df=1 Female 85 (58.6%) 60 (41.4%) 145 P Age categories 18-30 83 (57.6%) 61 (42.4%) 144 χ 2 31-40 43 (46.2%) 50 (53.8%) 93 df=3 41-50 31 (47.7%) 34 (52.3%) 65 P 51-60 39 (39.8%) 59 (60.2%) 98 Occupation Homemaker 81 (70.4%) 34 (29.6%) 115 χ 2 Farmer 45 (73.8%) 16 (26.2%) 61 df=8 Laborer 35 (61.4%) 22 (38.6%) 57 P Government Job 6 (30%) 14 (70%) 20 Private Job 2 (6.9%) 27 (93.1%) 29 Business 11 (22.9%) 37 (77.1%) 48 Unemployed 4 (50%) 4 (50%) 8 Student 10 (17.9%) 46 (82.1%) 56 Retired 2 (33.3%) 4 (66.7%) 6 Education Illiterate 30 (62.5%) 18 (37.5%) 48 χ 2 Primary 71 (69.6%) 31 (30.4%) 102 df=5 Middle 38 (48.7%) 40 (51.3%) 78 P Secondary 29 (35.8%) 52 (64.2%) 81 Graduate 28 (34.1%) 54 (64.9%) 82 Postgraduate 0 (0%) 9 (100%) 9 Socio-Economic Status Upper Class 14 (33.3%) 28 (66.7%) 42 χ 2 Upper Middle 46 (45.1%) 56 (54.9%) 102 df=4 Middle 45 (48.9%) 47 (51.1%) 92 P Lower Middle 77 (57.5%) 57 (42.5%) 134 Lower 14 (48.3%) 16 (51.7%) 30 Table 4 P P P P Table 4 Association of second-hand exposure at workplace with various demographic predictors ( n Demographic Predictors Second-Hand Exposure at Workplace Total Association  Yes No Study Area χ 2 Urban 50 (50.5%) 49 (49.5%) 99 df=1 Rural 53 (60.9%) 34 (39.1%) 87 P Age categories 18-30 51 (54.8%) 42 (45.2%) 93 χ 2 31-40 25 (58.1%) 18 (41.9%) 43 df=3 41-50 13 (52%) 12 (48%) 25 P 51-60 14 (56%) 11 (44%) 25 Occupation Farmer 26 (76.5%) 8 (23.5%) 34 χ 2 Laborer 33 (94.3%) 2 (5.7%) 35 df=5 Government Job 6 (30%) 14 (70%) 20 P Private Job 9 (30%) 21 (70%) 30 Business 17 (77.3%) 5 (22.7%) 22 Student 12 (26.7%) 33 (73.3%) 45 Education Illiterate 15 (78.9%) 4 (21.1%) 19 χ 2 Primary 30 (71.4%) 12 (28.6%) 42 df=5 Middle 22 (50%) 22 (50%) 44 P Secondary 22 (51.2%) 21 (48.8%) 43 Graduate 14 (41.1%) 20 (58.9%) 34 Postgraduate 0 (0%) 4 (100%) 4 Socioeconomic Status 13 Upper Class 8 (61.5%) 5 (38.4%) χ 2 Upper Middle 16 (32%) 34 (68%) 50 df=4 Middle 31 (63.3%) 18 (36.7%) 49 P Lower Middle 43 (70.5%) 18 (29.5%) 61 Lower 5 (38.5%) 8 (61.5%) 13 Table 5 Table 5 Distribution of the study population based on responses of knowledgerelated questions about SHS exposure ( n Questions Yes No Breathing smoke from other people’s cigarette is harmful to one’s health 366 (91.5%) 34 (8.5%) Secondhand smoke contains substances known to be toxic 316 (79%) 84 (21%) If one smokes at his home, one’s spouse has a higher risk of developing lung cancer 238 (59.5%) 162 (40.5%) Risk of having heart diseases increases when exposed to second-hand smoke 148 (37%) 252 (63%) Maternal exposure to second-hand smoke during pregnancy causes low birthweight 80 (20%) 320 (80%) Asthmatic children living with smoker’s home are more likely to have asthma attacks 276 (69%) 124 (31%) Table 6 Table 6 Distribution of the study population based on responses of attituderelated questions about SHS exposure ( n Questions Strongly Disagree Disagree Undecided Agree Strongly Agree Let visitors smoke in my house 27.5% 25.75% 14.5% 26.5% 5.5% Parents have no right to smoke around children 5.25% 4.5% 5.5% 35.5% 49.25% Banning smoking in public places will protect the health of nonsmokers 1% 1.5% 7.25% 39.5% 50.75% All cigarette advertisements should be banned 1.5% 6% 8.5% 41.75% 42.25% I do not chat with people while they are smoking 5.5% 20.75% 24.25% 28% 21.75% I ask people to put their cigarettes out when they are talking to me 8.75% 20.75% 21% 29.5% 20% On the other hand, when exploring the participants’ attitudes toward SHS exposure, 53.25% of the participants expressed that they will not let their “visitors” smoke in their house. However, this percentage became lower as 49.5% of participants expressed that they would ask “people” around them to put out their cigarettes and 49.75% of participants expressed that they would not chat with people while they are smoking. Discussion The present study was conducted to find out the prevalence of SHS exposure among nonsmokers in adults and identify various sociodemographic correlates of SHS exposure. This study assessed knowledge and attitude among study participants about SHS exposure. The prevalence of second-hand exposure at home was found to be 44% and 54% in urban and rural areas, respectively. Similar trends were seen with GATS 2 India[ 13 et al 14 15 et al 16 In the present study, the prevalence of second-hand exposure at workplace was found to be 50.5% and 60.9% in urban and rural areas, respectively. This was in accordance with GATS 2 India[ 13 15 et al 16 et al 17 In the present study, it is found out that among those who visited the public places, 45.8% of them were exposed to SHS in government offices or buildings, 18.6% of them were exposed to SHS in health care facilities, 39.8% of them were exposed to SHS in restaurants, 84% of them were exposed to SHS in night clubs/bars, 50.8% of them were exposed to SHS during public transportation, and 26.2% of them were exposed to SHS in university buildings. In contrast to our study, GATS 2 India[ 13 et al et al 18 19 From the present study, it is understood that though study participants were aware that SHS exposure is harmful and contains substances known to be toxic, the knowledge about exact ill effects caused by SHS like risk of developing lung cancer and heart diseases was really lacking. Also, knowledge about risk of pregnant women having harmful effects when exposed to SHS is alarmingly low. Regarding attitude toward SHS exposure, the participants in the present study exhibited favorable attitude toward parents having no right to smoke around children, banning of cigarette advertisements, and smoking in public places. The majority of them felt helpless in restraining visitors from smoking, and smoking was allowed at some or all parts of their homes. In a state like Haryana, this is expected to be prominent as families are often more culturally conservative and more traditional to ask visitors to put out the cigarette or shy away from a conversation when the visitor starts to smoke. Limitations In this study, SHS exposure was defined as a proxy measure constructed from self-reported home smoking rules and might thus not always reflect real exposure to SHS at home. Also, we could not assess the cumulative effect of SHS exposure. For example, we did not evaluate that how many years the participants were exposed to SHS. Conclusion and Recommendations The present study reflected high prevalence of SHS exposure at home, workplace, and public places among nonsmoking adults of District Rohtak, Haryana. It also reflected SHS exposure at home is significantly associated with study area, age category, occupation, and education, while SHS exposure at workplace is significantly associated with occupation, education, and socioeconomic scale. There is no safe amount of SHS exposure. The home is the main place many children and adults breathe in SHS. Though study participants were aware that SHS exposure is harmful and contains substances known to be toxic, the knowledge about exact ill effects caused by SHS was really lacking. Therefore, education to promote smoke-free homes can be part of campaigns implemented to build public support for smoke-free legislation, which have included messages informing smokers, particularly as parents, of the impact of SHS exposure in the home and have urged them to make their homes smoke-free. The role of the National Tobacco Control Programme is crucial here. It should be expanded in monitoring and evaluation of tobacco control activities, supplemented by periodic surveys beside the enforcement of the law at the district and state levels. There should be stronger public health education and advocacy efforts for the general public about smoke-free legislation to improve compliance and implementation of antitobacco laws. Ethical clearance Ethical Clearance: Obtained (BREC/22/TH/COMMM. MED.-02) Conflicts of interest There are no conflicts of interest. 1 Oberg M Woodward A Jakkola M Peruga A Pruss-Ustun A Global estimate of the burden of disease from second-hand smoke Geneva, Switzerland World Health Organisation [Internet] 2010 Available from: https://apps.who.int/iris/bitstream/handle/10665/44426/9789241564076_eng.pdf [Last accessed on 2024 Apr 24] 2 Hulka BS Alexson O Brain J Buffler P Buist SA Hoffman D Environmental tobacco smoke: Measuring exposures and assessing health effects Washington D. C. National Academy Press [Internet] 1986 Available from: https://www.ncbi.nlm.nih.gov/books/NBK219205/pdf/Bookshelf_NBK219205.pdf [Last accessed on 2024 Apr 07] 25032469 3 Office on Smoking and Health (US) The health consequences of involuntary exposure to tobacco smoke: A report of the surgeon general [Internet] 2 nd Atlanta (GA) Centers for Disease Control and Prevention (US) 2006 Available from: https://www.ncbi.nlm.nih.gov/books/NBK44321/ [Last accessed on 2024 Apr 07] 20669524 4 Apelberg BJ Hepp LM Avila-Tang E Gundel L Hammond SK Hovell MF Environmental monitoring of secondhand smoke exposure Tob Control [Internet 2013 22 147 55 22949497 10.1136/tobaccocontrol-2011-050301 PMC3639351 5 Dinas PC Metsios GS Jamurtas AZ Tzatzarakis MN Wallace Hayes A Koutedakis Y Acute effects of second-hand smoke on complete blood count Int J Environ Health Res [Internet 2014 24 56 62 23544435 10.1080/09603123.2013.782603 6 Barnoya J Glantz SA Cardiovascular effects of secondhand smoke: Nearly as large as smoking Circulation [Internet 2005 111 2684 98 15911719 10.1161/CIRCULATIONAHA.104.492215 7 Darling H Reeder AI McGee R Williams S Brief report: Disposable income, and spending on fast food, alcohol, cigarettes, and gambling by New Zealand secondary school students J Adolesc [Internet 2006 29 837 43 16860384 10.1016/j.adolescence.2006.06.003 8 Seo DC Torabi MR Weaver AE Factors influencing openness to future smoking among nonsmoking adolescents J Sch Health [Internet 2008 78 328 36 18489466 10.1111/j.1746-1561.2008.00310.x 9 Lessov-Schlaggar CN Wahlgren DR Liles S Ji M Hughes SC Winickoff JP Sensitivity to secondhand smoke exposure predicts future smoking susceptibility Pediatrics [Internet 2011 128 254 62 21746728 10.1542/peds.2010-3156 PMC3146357 10 Okoli CT Kodet J A systematic review of secondhand tobacco smoke exposure and smoking behaviors: Smoking status, susceptibility, initiation, dependence, and cessation Addict Behav 2015 47 22 32 25863004 10.1016/j.addbeh.2015.03.018 11 Ghazali SM Huey TC Cheong KC Li LH Fadhli M Yusoff M Prevalence and factors associated with secondhand smoke exposure among Malaysian adolescents Tob Induc Dis [Internet 2019 17 22 31582933 10.18332/tid/102728 PMC6751970 12 World Health Organization Protecting people from tobacco smoke [Internet] Geneva, Switzerland World Health Organization Available from: https://www.who.int/activities/protecting-people-from-tobacco-smoke [Last accessed on 2024 Apr 09] 13 Tata Institute of Social Sciences, Mumbai and Minsitry of Health and Family Welfare, Government of India Global Adult Tobacco Survey-2 Haryana Fact Sheet Mumbai Ministry of Health and Family welfare [Internet] 2018 Available from: GATS-2-Haryana.pdf (rctfi.org) [Last accessed on 2024 Apr 07] 14 Abdullah AS Driezen P Sansone G Nargis N Hussain GA Quah AC Correlates of exposure to secondhand smoke (SHS) at home among non-smoking adults in Bangladesh:findings from the ITC Bangladesh survey BMC Pulm Med [Internet] 2014 14 117 25027238 10.1186/1471-2466-14-117 PMC4107590 15 Minsitry of Health and Family Welfare, Government of India and International Institute for Population Sciences Global Adult Tobacco Survey India 2009-2010 Mumbai International Institute for Population Sciences; [Internet] 2010 Available from: https://rctfi.org/wp-content/uploads/2023/10/GATS-1-Haryana.pdf [Last accessed on 2024 Apr 07] 16 Bhatt G Goel S Mor S Gupta R Exposure to second hand smoke and its correlates in Northern State of India Indian J Public Health [Internet] 2018 62 128 32 29923537 10.4103/ijph.IJPH_442_16 17 Sein AA Than Htike MM Sinha DN Kyaing NN Exposure to second-hand tobacco smoke among adults in Myanmar Indian J Cancer [Internet] 2012 49 410 8 23442406 10.4103/0019-509X.107749 18 Kumar R Goel S Harries AD Lal P Singh RJ Kumar AMV How good is compliance with smoke-free legislation in India?Results of 38 subnational surveys Int Health [Internet] 2014 6 189 95 Available from: https://doi.org/10.1093/inthealth/ihu028 [Last accessed on 2024 Apr 07] 24876270 10.1093/inthealth/ihu028 19 Ravindra K Tripathy JP Tripathy NK Dynamics of multi-stakeholder engagement and its role in achieving high compliance of a tobacco control programme World Dev Perspect [Internet] 2016 3 7 11 Available from: https://doi.org/10.1016/J. WDP.2016.10.002 [Last accessed on 2024 Apr 07] ",
  "metadata": {
    "Title of this paper": "Dynamics of multi-stakeholder engagement and its role in achieving high compliance of a tobacco control programme",
    "Journal it was published in:": "Journal of Family Medicine and Primary Care",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488113/"
  }
}