{
  "title": "Paper_517",
  "abstract": "pmc Med Phys Med Phys 379 blackwellopen MP Medical Physics 0094-2405 2473-4209 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12483971 PMC12483971.1 12483971 12483971 41027847 10.1002/mp.70040 MP70040 1 Research Article BIOLOGICAL PHYSICS AND RESPONSE PREDICTION Research Article Equivalent relative biological effectiveness for cell survival and micronuclei formation: insights from a biophysical approach MATSUYA et al. Matsuya Yusuke  1  2 matsuya.yusuke@hs.hokudai.ac.jp Saga Ryo  3 Wang Yidi  1 Sato Tatsuhiko  2   1 Faculty of Health Sciences Hokkaido University, Kita‐12 Nishi‐5, Kita‐ku Sapporo Hokkaido Japan   2 Nuclear Science and Engineering Center, Research Group for Radiation Transport Analysis Japan Atomic Energy Agency (JAEA), 2–4 Shirakata Tokai Ibaraki Japan   3 Department of Radiation Science Graduate School of Health Sciences Hirosaki University, 66‐1 Hon‐cho Hirosaki Aomori Japan * Correspondence matsuya.yusuke@hs.hokudai.ac.jp 30 9 2025 10 2025 52 10 498039 10.1002/mp.v52.10 e70040 25 8 2025 22 5 2025 13 9 2025 01 10 2025 02 10 2025 03 10 2025 © 2025 The Author(s). Medical Physics https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Background Micronuclei (MN), which are chromosome fragments, are formed after exposure to ionizing radiation. Radiation‐induced MN is currently used as a quantitative indicator of the chromosomal aberrations detectable at a relatively early phase (e.g., within one cell‐cycle progression). Meanwhile, the MN formation assay is also used to evaluate radiosensitivity (e.g., cell‐killing). As such, the technique to assay the MN formation has been followed with increasing interest. However, the meaning of MN and the corresponding cellular responses remains uncertain. Purpose This study presents a biophysical model for estimating MN frequency and theoretically explores the cellular responses associated with MN formation, such as the relationship between MN formation and cell survival. Methods We used an integrated microdosimetric‐kinetic (IMK) model that allows the prediction of cell survival after radiation exposure, and we extended the IMK model by introducing a probability of MN formation from lethal lesions by misrepair. To validate the developed model, we estimated the dose, linear energy transfer (LET), and dose‐rate dependencies of MN frequency as well as its relative biological effectiveness (RBE MN Results Our developed IMK model enables the prediction of the MN formation frequency and the RBE MN Conclusions The present model indicates that the analysis of MN is useful in both radiation therapy and radiation protection to quantitatively evaluate curative effects and histological damage at early stages after exposure. biophysical model microdosimetry micronuclei surviving fraction pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:30.09.2025  Matsuya Y Saga R Wang Y Sato T Equivalent relative biological effectiveness for cell survival and micronuclei formation: insights from a biophysical approach Med Phys 2025 52 e70040 10.1002/mp.70040 41027847 PMC12483971 1 INTRODUCTION Ionizing radiation is well known to induce DNA lesions (e.g., DNA double‐strand breaks (DSBs))  1  2  3  4  5  6  7  8  9  10  11 Radiation‐induced MN can be measured by means of several assays, for example, cytokinesis‐block micro‐nucleus assay (CBMN), mammalian erythrocyte MN assay, etc.  12  13  3  14 To date, several biophysical models have been developed worldwide,  15  16  17  18  19  16  17  18  19  20  21  22  23  20  21  24  25 In this study, we propose a biophysical model for estimating dose, LET, and dose‐rate dependencies of MN formation frequency and its relative value, including the relative biological effectiveness (RBE), by extending the IMK model. Assuming that the misrepair of PLLs forms MN, the developed model enables the exploration of the cellular responses associated with MN formation and the estimation of the RBE values. The RBE is used for evaluating curative effects and radiation risks. Through these model verifications in the comparison with the experimental data of LET and dose‐rate dependencies, including our in vitro work, we show that RBE values for both cell survival and MN frequency are equivalent under the same irradiation conditions. The present model would contribute to the precise understanding of radiation‐induced biological effects in both radiation therapy and protection. 2 OVERVIEW OF THE IMK MODEL This section introduces the IMK model for predicting DNA damage kinetics and the surviving fraction. To date, the model has considered various factors, such as cell recovery (sub‐lethal damage (SLD) repair),  26  27  20  28  29  30  31 2.1 Assumption in the IMK model In the IMK model, the nucleus of cells is divided into multiple small targets (so‐called domains). The energy deposition for each domain represents specific energy z  28  32  33 g z a b d c (i) A PLL may transform into an LL at a constant rate of a −1 (ii) Two PLLs may interact and transform into an LL at a constant rate of b d −1 (iii) A PLL may be repaired at a constant rate of c −1 (iv) An MN may form during the transformation of an LL with a probability of h The schematic representation of the assumptions in the IMK model in this study is depicted in Figure 1  17  17  34  17 FIGURE 1 Schematic representation of the assumptions of the IMK model. (a) The cell nucleus is divided into multiple small targets (so‐called domain), and the energy deposition for each domain (specific energy z h 2.2 Surviving fraction Based on the assumptions (i)–(iii) described above, the kinetics of PLLs and LLs during and after irradiation are expressed using the rate equations as described previously.  21  24  25  24  25 D S − ln S = < w > = α 0 + y * ρ π r d 2 β 0 D ˙ T + 2 β 0 ( a + c ) 2 T 2 × ( a + c ) T + e − ( a + c ) T − 1 D ˙ T 2 (1) = α 0 + z 1 D ∗ β 0 D + F β 0 D 2 = α D + β D 2 , w> D ˙ T α 0 β 0 2 α = α 0 + z 1 D ∗ β 0 β = F β 0 z 1 D ∗ y * r d 2 y * ρ r d y * (2) y * = y 0 2 ∫ [ 1 − exp ( − y 2 / y 0 2 ) ] f y d y ∫ yf y d y , y f y y y 0  15 y  35 F  36  26  27 2.3 Micronuclei formation In assumption (iv), an MN forms during the transformation of the LLs with a probability of h h a b d a b d 1 h F MN (3) F MN = h < w > = h ( α 0 + z 1 D * β 0 ) D + Fh β 0 D 2 = ( α m 0 + z 1 D * β m 0 ) D + F β m 0 D 2 = α m D + β m D 2 , α m0 β m0 D D 2 α m0 hα 0 hak d G a + β m0 hβ 0 hb d k d 2 G 2 p a + α m α m 0 + z 1 D * β m 0 β m = F β m 0 k d G p a c a c 1 h α 0 β 0 α 0 β 0 1 2.4 Relative biological effectiveness The IMK model allows the calculation of the relative biological effectiveness (RBE). When calculating the RBE for cell survival (RBE SF D 10  37  38 β ≅ β 0 D 10 SF (4) D 10 = 1 2 β α 2 + 4 β S * − α , (5) RB E SF = D 10 ( photon ) D 10 ∗ , S * S S * D 10 D 10 * D 10 Meanwhile, based on the previous report,  8 MN α m (6) RB E MN = α m ∗ α m ( photon ) = h α ∗ h α ( photon ) = α ∗ α ( photon ) , α m(photon) α m * α m α (photon) α * α  39 6 3 MATERIALS AND METHODS 3.1 Estimates of MN frequency from survival data To check the performance of the developed model, we first determined the model parameters by fitting the model to the dose–response curve of the surviving fraction. We then used the determined model parameters of human salivary gland (HSG) cells and squamous cell carcinoma (SCC) cells for estimating the LET dependence on MN formation. Meanwhile, we also used the determined model parameters of human prostate cancer cell line DU145 and human lung fibroblast WI‐38 cell line for estimating the dose‐rate dependence. 3.1.1 Determination of the model parameters The model parameters of the HSG and SCC cell lines were determined through the following procedures: (i) the lineal energy distributions and y *  35  40 α 0 β 0 a c 1  41  42  43 r d  41  42 r d a c  44 12  41 S1 S2 Meanwhile, the model parameters of the DU145 and WI‐38 cell lines were determined with only biological data after X‐ray irradiation following the approaches described below. As for the WI‐38 cell line, in our previous report, we obtained the model parameters [ α 0 β 0 a c  25 a c  34 α 0 β 0 a c h  41  42  45  46  47  48  49  50  51  52 The MCMC simulation enables us to study probability distributions of model parameters, as described previously.  43 θ (0) α 0 β 0 θ candidate d θ α 0 β 0 a c P d i θ α P (7) P ( d | θ ) = ∏ i = 1 N [ P ( d i | θ ) ] = ∏ i = 1 N 1 2 π σ exp − ( − ln S exp i + ln S cal i ) 2 2 σ 2 (8) α P = P ( θ candidate | d ) P ( θ ( t ) | d ) , d i i N d i D i S exp  i S exp S cal P θ d P θ candidate d t t 3 4 SF 12  6  41  42  53  54  55  25  34 3.1.2 Prediction of LET dependence of MN frequency Using the determined model parameters, we predicted the dose–response curve and the LET dependencies of MN formation for the HSG and SCC cells. When predicting the dose and LET dependencies, in the same manner as the procedure for determining the model parameters, the y 3  42 MN 6 MN MN  8  53  55 MN 3.1.3 Prediction of dose‐rate dependence of MN frequency In addition to the LET dependence described above, we also calculated the dose‐rate dependence of the MN formation frequency. In this calculation, using the model parameters of the WI‐38 and DU145 cell lines, we predicted the relationship between dose rate and the relative MN frequency. Note that the relative MN frequencies were normalized using those at high dose rate (i.e., at 60 Gy/h). The details of our in vitro experiments and protocols are described in the next subsection “3.1.4. Cell culture and MN formation assay” below. Because our in vitro experiments were performed at a constant dose of 4 Gy, so the total absorbed dose in this prediction was also set to be 4 Gy. As with the LET dependence of RBE MN 3.1.4 Cell culture and MN formation assay We used WI‐38 (IFO50075, Japanese Collection of Research Bioresources Cell Bank, Osaka, Japan) and DU145 (RCB2143, RIKEN BioResearch, Tsukuba, Japan) cell lines. Both the WI‐38 and the DU145 cell lines were grown in RPMI‐1640 with L‐glutamine (Thermo Fisher Scientific Inc.) supplemented with 10% fetal bovine serum (FBS) (Japan Bio Serum, Fukuyama, Japan) and 1% penicillin‐streptomycin (Life Technologies, CA, USA). Both cell lines were maintained at 37°C in a humidified atmosphere of 5% CO 2 The cells were exposed to 150 kVp X‐rays (MBR‐1520R‐3; Hitachi Medical Co., Ltd., Tokyo, Japan) at room temperature. For the continuous (acute) irradiation, the maximum dose rate used in this study was 1.0 Gy/min (equivalent to 60 Gy/h). In addition to the acute irradiation at 1.0 Gy/min, we also performed the fractionated irradiation comprised of 0.5 Gy/fraction (Fr) (with 30 s (0.5 min) dose‐delivery time at 1 Gy/min) at 30 s (0.5 min) intervals, 0.1 Gy/Fr (with 6 s dose‐delivery time) at 54 s (0.9 min) intervals, and 0.05 Gy/Fr (with 3 s dose‐delivery time) at 57 s (0.95 min) intervals. Based on the irradiation regimens, we made the average dose rates of 0.5, 0.1, and 0.05 Gy/min, respectively. The total dose was a constant 4 Gy for both cell lines. The WI‐38 and DU145 cells were seeded in the 4‐well slide chambers (WATSON CO., Ltd., Tokyo, Japan). After 48 h, the seeded cells were irradiated using the X‐ray irradiator following the above irradiation protocols. After 36 h for WI‐38 and 48 h for DU145  56,57 3.2 Estimates of the surviving fraction from MN data In the verification of the developed model, we estimated the MN frequency and the RBE MN SF Focusing on the HSG cell line because of the extensive data, we determined the model parameters (i.e., α m0 β m0 3  42 y * 12 α m0 β m0 a c 3  42 r d  42 After determining the model parameters [ α m0 β m0 a c SF 4 5 α 0 β 0 α m0 β m0 h h vice‐versa SF  6  42 3.3 Statistics To determine the significance of induction of the MN frequency depending on the difference in dose rates, the Tukey–Kramer post hoc test after a one‐way analysis of variance was conducted. Statistical analyses were performed using Microsoft Excel 2010 (Microsoft Corporation). In the same manner as the previous experimental report,  25 p R 2 4 RESULTS 4.1 Surviving fraction and the determined model parameters Figure 2 2 12 S3 1 1 S4 r d y 0 SF 5  6  41  53  54  55 S5 FIGURE 2 Dose–response curve of cell survival for determining the model parameters. (a) is for the HSG cell line, and (b) is for the SCC VII cell line. The surviving fractions after acute irradiation with 200 kVp X‐rays or the 290 MeV/n carbon beams (LET = 13–100 keV/µm) were estimated using the model parameters in Table 1 1  41  42 TABLE 1 Model parameters for various cell lines in the IMK model. Model parameter Cell line type unit HSG SCC WI‐38 DU145  α 0 1.50 × 10 −1 −2 8.25 × 10 −2 −2 5.90 × 10 −1 −1 7.74 × 10 −2 −2 Gy −1  β 0 4.67 × 10 −2 −3 2.98 × 10 −2 −3 1.63 × 10 −2 −2 3.80 × 10 −2 −3 Gy −2  a c 2.19 × 10 0 −1 2.19 × 10 0 −1 3.71 × 10 −1 −2 2.10 × 10 0 −1 h −1  r d 4.20 × 10 −1 4.20 × 10 −1 5.00 × 10 −1 5.00 × 10 −1 µm  h 2.75 × 10 −1 −3 2.75 × 10 −1 −3 2.75 × 10 −1 −3 2.75 × 10 −1 −3 – John Wiley & Sons, Ltd. The parameter of h 3  42  43  44  45  46  47  48  49  50  51  52 3  42  43  44  45  46  47  48  49  50  51  52 R 2 w h h 2 −1 −1 h S6 h R 2 3 FIGURE 3 Relation between the surviving fraction and MN per binucleated cell. From the fitting of the model to the experimental relationship,  41  42  45  46  47  48  49  50  51  52 h −1 −3 1 h 2 TABLE 2 Model parameter h Cell line type Radiation type  h CHO cells 250 kVp X‐rays, 125 3.65 × 10 −1 ± 3.17 × 10 −2 HSG cells 200 kVp X‐rays, 290 MeV/u 12 2.45 × 10 −1 ± 8.68 × 10 −3 U2OS cells  137 2.61 × 10 −1 ± 3.87 × 10 −2 MCF‐12A cells 10 kV, 25 kV, 200 kV X‐rays 2.29 × 10 −1 ± 3.72 × 10 −2 M5 cells  60 6 1.96 × 10 −1 ± 4.94 × 10 −2 V79 cells  60 6 1.97 × 10 −1 ± 5.70 × 10 −2 SCC VII cells 10 MV X‐rays, boron neutron capture therapy 2.81 × 10 −1 ± 7.47 × 10 −3 Abbreviation: MN, micronuclei. John Wiley & Sons, Ltd. 4.2 Dose and LET dependence of MN formation Using the model parameters listed in Table 1 4  42 y * 2a 4 h 3 FIGURE 4 Dose dependence on the MN formation of HSG cells estimated from cell survival data. Using the model parameters listed in Table 1 3  42 R 2 In addition to the dose–response curve on the MN formation (Figure 4 MN  8  42  53  54  55 5 MN 5 MN 4 5 SF MN 5 MN MN 5b FIGURE 5 LET dependence of RBE MN 1 6  8  42  53  54  55 MN 4.3 Dose‐rate dependence of the MN formation The developed model was verified compared to the dose and LET dependence of the MN frequency. To further verify the model, focusing on the different rates of SLD repair of normal and cancer cell lines, WI‐38 and DU145, we next measured the dose‐rate dependence of the MN formation and compared the model with the experimental data. Figure 6 6c,d 0 −1 −1 −2 a c 7 5 7 FIGURE 6 Microscopic images of the MN frequency and measured dose‐rate dependence. (a) is the DU145 and (b) is the WI‐38 cells, in which both cell lines were irradiated with a total dose of 4 Gy. The MN frequency in the DU145 cell line decreases with decreasing dose rate. Meanwhile, there seems to be less dose‐rate dependence in the WI‐38 cells. The symbols * and n.s. represent significant differences compared to 1 Gy/min and no significance, respectively. MN, micronuclei. FIGURE 7 Prediction of the dose‐rate dependence of the MN frequency estimated from cell survival data. (a) is the DU145, and (b) is the WI‐38 cells. In the same manner as Figure 6 R 2 4.4 Prediction of RBE SF In addition to the RBE MN 5 SF 3 SF 1 Figure 8a  42 θ MN α m0 β m0 a c r d −2 −2 −1 −2 −3 −2 0 −1 −1 8a 4 θ MN SF 8b  6  42 θ MN S7 FIGURE 8 Model predictions of RBE SF θ MN α m0 β m0 a c r d −2 −2 −1 −2 −3 −2 0 −1 −1 1 5 DISCUSSIONS By introducing the new parameter h  20  21 Overview of the IMK model h 3 h  41  42  45  46  47  48  49  50  51  52  9  58  59  60  61  62 h S6 h When evaluating the radiation‐induced MN formation using the IMK model (see Figures 4 5 7 h h h h 2 MN h  63  64  21  65  66  3 8b SF Because of its rapidness, simplicity, and potential for automation, the measurement of the MN micronucleated cells is believed to be a sensitive biological indicator of clastogenic effects (chromosome aberrations).  10  67 4 5 7  68  12  69 Overview of the IMK model  70  71 h 6 CONCLUSIONS This work presents a biophysical model for estimating micronuclei (MN) frequency by extending the IMK model. The developed model could successfully reproduce the experimental dose, LET, and dose‐rate dependencies of the MN formation and its relative biological effectiveness (RBE MN CONFLICT OF INTEREST STATEMENT The authors declare that they have no conflict of interest. Supporting information Supporting Information ACKNOWLEDGMENTS Dr Ryoichi Hirayama (Department of Charged Particle Therapy Research, QST Hospital) explained the meanings of his experimental data on MN formation frequency. The authors wish to thank him for his kind explanation. REFERENCES 1 Goodhead DT Initial events in the cellular effects of ionizing radiations: clustered damage in DNA Int J Radiat Biol 1994 65 7 17 7905912 10.1080/09553009414550021 2 Joiner MC van der Kogel AJ Steel GG Introduction: the significance of radiology and radiotherapy for cancer treatment Joiner M van der Kogel AJ Basic Clinical Radiobiology Edward Arnold 2009 1 10 3 Joiner MC Joiner M van der Kogel AJ Quantifying cell kill and cell survival Basic Clinical Radiobiology London: Edward Arnold 2009 41 55 4 ICRP. 1990. RBE for deterministic effects. ICRP Publication 58. Ann ICRP 20 4 http://www.icrp.org/publication.asp?id=ICRP%20Publication%2058 2699178 5 Friedrich T Scholz U Elsässer T Durante M Scholz M Systematic analysis of RBE and related quantities using a database of cell survival experiments with ion beam irradiation J Radiat Res 2013 54 3 494 514 23266948 10.1093/jrr/rrs114 PMC3650740 6 Friedrich T Pfuhl T Scholz M Update of the particle irradiation data ensemble (PIDE) for cell survival J Radiat Res 2021 62 4 645 655 33912970 10.1093/jrr/rrab034 PMC8273790 7 Masunaga S Ono K Significance of the response of quiescent cell populations within solid tumors in cancer therapy J Radiat Res 2002 43 11 25 12056326 10.1269/jrr.43.11 8 Hirayama R Uzawa A Obara M Determination of the relative biological effectiveness and oxygen enhancement ratio for micronuclei formation using high‐LET radiation in solid tumor cells: an in vitro and in vivo study Mutat Res 2015 793 41 47 10.1016/j.mrgentox.2015.08.003 26520371 9 Krupina K Goginashvili A Cleveland DW Causes and consequences of micronuclei Cur Opinion Cell Biol 2021 70 91 99 10.1016/j.ceb.2021.01.004 PMC8119331 33610905 10 Almássy A Krepinsky AB Bianco A Köteles GJ The present state and perspectives of micronucleus assay in radiation protection. A review Int J Radiat Appl Instr Part A Appl Radiat Isotopes 1987 38 4 241 249 10.1016/0883-2889(87)90033-5 3040627 11 Vral A Fenech M Thierens H The micronucleus assay as a biological dosimeter of in vivo ionising radiation exposure Mutagenesis 2011 26 1 11 17 21164177 10.1093/mutage/geq078 12 Sommer S Buraczewska I Kruszewski M Micronucleus assay: the state of art, and future directions Int J Mol Sci 2020 21 4 1534 32102335 10.3390/ijms21041534 PMC7073234 13 Ono K Masunaga S Akaboshi M Akuta K Estimation of the initial slope of the cell survival curve after irradiation from micronucleus frequency in cytokinesis‐blocked cells Radiat Res 1994 138 1 S101 S104 8146309 14 McMahon SJ The linear quadratic model: usage, interpretation, and challenges Phys Med Biol 2019 64 01TR01 10.1088/1361-6560/aaf26a 30523903 15 Kase Y Kanai T Matsumoto Y Furusawa Y Okamoto H Asaba T Microdosimetric measurements and estimation of human cell survival for heavy‐ion beams Radiat Res 2006 166 629 638 17007551 10.1667/RR0536.1 16 Grün R Friedrich T Elsässer T Impact of enhancements in the local effect model (LEM) on the predicted RBE‐weighted target dose distribution in carbon ion therapy Phys Med Biol 2012 57 7261 7274 23075883 10.1088/0031-9155/57/22/7261 17 Ballarini F Altieri S Bortolussi S Carante M Giroletti E Protti N The BIANCA model/code of radiation‐induced cell death: application to human cells exposed to different radiation types Radiat Environ Biophys 2014 53 525 533 24659413 10.1007/s00411-014-0537-6 18 Cunha M Monini C Testa E Beuve M NanOx, a new model to predict cell survival in the context of particle therapy Phys Med Biol 2017 62 124 10.1088/1361-6560/aa54c9 27995904 19 Sato T Furusawa Y Cell survival fraction estimation based on the probability densities of domain and cell nucleus specific energies using improved microdosimetric kinetic models Radiat Res 2012 178 4 341 356 22880622 10.1667/rr2842.1 20 Matsuya Y Fukunaga H Omura M Date H A model for estimating dose‐rate effects on cell‐killing of human melanoma after boron neutron capture therapy Cells 2020 9 5 1117 32365916 10.3390/cells9051117 PMC7290789 21 Matsuya Y McMahon SJ Tsutsumi K Investigation of dose‐rate effects and cell‐cycle distribution under protracted exposure to ionizing radiation for various dose‐rates Sci Rep 2018 8 8287 29844494 10.1038/s41598-018-26556-5 PMC5974424 22 Hawkins RB A statistical theory of cell killing by radiation of varying linear energy transfer Radiat Res 1994 140 366 374 7972689 23 Hawkins RB A microdosimetric‐kinetic model of cell death from exposure to ionizing radiation of any LET, with experimental and clinical applications Int J Radiat Biol 1996 69 739 755 8691026 10.1080/095530096145481 24 Matsuya Y Sasaki K Yoshii Y Okuyama G Date H Integrated modelling of cell responses after irradiation for dna‐targeted effects and non‐targeted effects Sci Rep 2018 8 4849 29555939 10.1038/s41598-018-23202-y PMC5859303 25 Matsuya Y Sato T Yachi Y Date H Hamada N The impact of dose rate on responses of human lens epithelial cells to ionizing irradiation Sci Rep 2024 14 12160 38802452 10.1038/s41598-024-62679-8 PMC11130169 26 Elkind MM Sutton H Radiation response of mammalian cells grown in culture. I. Repair of X‐ray damage in surviving Chinese hamster cells Radiat Res 1960 13 556 593 13726391 27 Elkind MM Repair processes in radiation biology Radiat Res 1984 100 425 449 6390488 28 ICRU. Microdosimetry. Report 36. International Commission on Radiation Units and Measurements. Bethesda: MD (1983) 29 Nagasawa H Little JB Induction of sister chromatid exchanges by extremely low doses of α‐ particles Can Res 1992 52 22 6394 6396 1423287 30 Nagasawa H Little JB Unexpected sensitivity to the induction of mutations by very low doses of alpha‐particle radiation: evidence for a bystander effect Radiat Res 1999 152 5 552 557 10521933 31 Matsuya Y McMahon SJ Ghita M Intensity Modulated radiation fields induce protective effects and reduce importance of dose‐rate effects Sci Rep 2019 9 9483 31263149 10.1038/s41598-019-45960-z PMC6603191 32 Sato T Watanabe R Kase Y Analysis of cell‐survival fractions for heavy‐ion irradiations based on microdosimetric kinetic model implemented in the particle and heavy ion transport code system Radiat Prot Dosim 2011 143 491 496 10.1093/rpd/ncq484 21148591 33 Parisi A Beltran CJ Furutani KM The Mayo Clinic Florida microdosimetric kinetic model of clonogenic survival: formalism and first benchmark against in vitro and in silico data Phys Med Biol 2022 67 185013 10.1088/1361-6560/ac7375 36097336 34 Matsuya Y McMahon SJ Butterworth KT Modeling oxygen effects on the in‐ and out‐of‐field radiosensitivity of cells exposed to intensity‐modulated radiation fields Phys Med Biol 2023 68 095008 10.1088/1361-6560/acc720 36958050 35 Sato T Iwamoto Y Hashimoto S Recent improvements of the particle and Heavy Ion transport code system—PHITS version 3.33 J Nucl Sci Technol 2023 61 1 127 135 36 Brenner DJ The linear–quadratic model is an appropriate methodology for determining isoeffective doses at large doses per fraction Semin Radiat Oncol 2008 18 1 234 239 18725109 10.1016/j.semradonc.2008.04.004 PMC2750078 37 Sato T Kase Y Watanabe R Niita K Sihver L Biological dose estimation for charged‐particle therapy using an improved PHITS code coupled with a microdosimetric kinetic model Radiat Res 2009 171 107 117 19138056 10.1667/RR1510.1 38 Okamoto H Kanai T Kase Y Relation between lineal energy distribution and relative biological effectiveness for photon beams according to the microdosimetric kinetic model J Radiat Res 2011 52 75 81 21160135 10.1269/jrr.10073 39 Joiner MC Linear energy transfer and relative biological effectiveness Joiner M van der Kogel AJ Basic Clinical Radiobiology Edward Arnold 2009 68 77 10.1201/b13224 40 Sato T Matsuya Y Ogawa T Improvement of the hybrid approach between Monte Carlo simulation and analytical function for calculating microdosimetric probability densities in macroscopic matter Phys Med Biol 2023 68 15 155005 10.1088/1361-6560/ace14c 37352865 41 Hirayama R Uzawa A Takase N Evaluation of SCCVII tumor cell survival in clamped and non‐clamped solid tumors exposed to carbon‐ion beams in comparison to X‐rays Mutat Res 2013 756 1–2 146 151 23735375 10.1016/j.mrgentox.2013.05.008 42 Shao C Aoki M Furusawa Y Medium‐mediated Bystander Effects on HSG Cells Co‐cultivated with Cells Irradiated by X‐rays or a 290 MeV/u Carbon Beam J Radiat Res 2001 42 3 305 316 11840647 10.1269/jrr.42.305 43 Matsuya Y Kimura T Date H Markov chain Monte Carlo analysis for the selection of a cell‐killing model under high‐dose rate irradiation Med Phys 2017 44 5522 5532 28786486 10.1002/mp.12508 44 Inaniwa T Suzuki M Furukawa T Effects of dose‐delivery time structure on biological effectiveness for therapeutic carbon‐ion beams evaluated with microdosimetric kinetic model Radiat Res 2013 180 44 59 23768075 10.1667/RR3178.1 45 Feinendegen LE Neumann RD Dosimetry and risk from low‐versus high‐LET radiation of Auger events and the role of nuclide carriers Int J Radiat Biol 2004 80 11–12 813 822 15764388 10.1080/09553000400007698 46 Olofsson D Cheng L Fernández RB Biological effectiveness of very high gamma dose rate and its implication for radiological protection Radiat Environ Biophys 2020 59 451 460 32488310 10.1007/s00411-020-00852-z PMC7368856 47 Lehnert A Lessmann E Pawelke J Dörr W RBE of 25 kV X‐rays for the survival and induction of micronuclei in the human mammary epithelial cell line MCF‐12A Radiat Environ Biophys 2006 45 4 253 260 16960687 10.1007/s00411-006-0062-3 48 Shibamoto Y Streffer C Fuhrmann C Budach V Tumor radiosensitivity prediction by the cytokinesis‐block micronucleus assay Radiat Res 1991 128 3 293 300 1961926 49 Pathak R Dey SK Sarma A Khuda‐Bukhsh AR Genotoxic effects in M5 cells and Chinese hamster V79 cells after exposure to 7 Mutat Res 2007 628 1 56 66 17258499 10.1016/j.mrgentox.2006.11.010 50 Pathak R Khuda Bukhsh AR Dey SK Resistance to induction of micronuclei, chromosomal aberrations and apoptosis by 60 J Radioanal Nucl Chem 2007 274 441 447 51 Masunaga S Ono K Abe M A method for the selective measurement of the radiosensitivity of quiescent cells in solid tumors–combination of immunofluorescence staining to BrdU and micronucleus assay Radiat Res 1991 125 3 243 247 1705716 52 Masunaga S Ono K Sakurai Y Applicability of combination with tirapazamine in boron neutron capture therapy Jpn J Cancer Res 1998 89 7 768 774 9738984 10.1111/j.1349-7006.1998.tb03282.x PMC5921891 53 Masunaga S Ando K Uzawa A The radiosensitivity of total and quiescent cell populations in solid tumors to 290 MeV/u carbon ion beam irradiation in vivo Acta Oncol 2008 47 6 1087 1093 18607878 10.1080/02841860701821999 54 Masunaga S Hirayama R Uzawa A The effect of post‐irradiation tumor oxygenation status on recovery from radiation‐induced damage in vivo: with reference to that in quiescent cell populations J Cancer Res Clin Oncol 2009 135 8 1109 1116 19214570 10.1007/s00432-009-0552-1 PMC12160208 55 Masunaga S Hirayama R Uzawa A Influence of manipulating hypoxia in solid tumors on the radiation dose‐rate effect in vivo, with reference to that in the quiescent cell population Jpn J Radiol 2010 28 132 142 20182848 10.1007/s11604-009-0397-1 56 OECD, Test No. 487: In Vitro Mammalian Cell Micronucleus Test, OECD Guidelines for the Testing of Chemicals, Section 4, OECD Publishing, Paris (2023) 57 Vered A Sarika C Jeffrey AC LET‐Dependent bystander effects caused by irradiation of human prostate carcinoma cells with X rays or alpha particles Radiat Res 2008 170 467 476 19024654 10.1667/rr1312.1 PMC4132631 58 Mao Z Bozzella M Seluanov A Gorbunova V Comparison of nonhomologous end joining and homologous recombination in human cells DNA Repair 2008 7 10 1765 1771 18675941 10.1016/j.dnarep.2008.06.018 PMC2695993 59 Hawkins RB Inaniwa T A microdosimetric‐kinetic model for cell killing by protracted continuous irradiation including dependence on LET I: repair in cultured mammalian cells Radiat Res 2013 180 584 594 24191898 10.1667/RR13257.1 60 Her J Bunting SF How cells ensure correct repair of DNA double‐strand breaks J Biol Chem 2018 293 27 10502 10511 29414795 10.1074/jbc.TM118.000371 PMC6036189 61 Oobatake Y Shimizu N Double‐strand breakage in the extrachromosomal double minutes triggers their aggregation in the nucleus, micronucleation, and morphological transformation Genes Chromosomes Cancer 2020 59 3 133 143 31569279 10.1002/gcc.22810 62 Mao Z Bozzella M Seluanov A Gorbunova V DNA repair by nonhomologous end joining and homologous recombination during cell cycle in human cells Cell cycle 2008 7 18 2902 2906 18769152 10.4161/cc.7.18.6679 PMC2754209 63 Hatcher‐Lamarre JL Sanders VA Rahman M Cutler CS Francesconi LC Alpha emitting nuclides for targeted therapy Nucl Med Biol 2021 92 228 240 33558017 10.1016/j.nucmedbio.2020.08.004 PMC8363053 64 Sato T Furuta T Liu Y Individual dosimetry system for targeted alpha therapy based on PHITS coupled with microdosimetric kinetic model EJNMMI phys 2021 8 1 16 33432383 10.1186/s40658-020-00350-7 PMC7801536 65 Hamada N Matsuya Y Zablotska LB Little MP Inverse dose protraction effects of low‐LET radiation: evidence and significance Mutat Res 2025 795 108531 10.1016/j.mrrev.2025.108531 PMC12124966 39814314 66 Hamada N Matsuya Y Zablotska LB Little MP Inverse dose protraction effects of high‐LET radiation: evidence and significance Mutat Res 2025 795 108530 10.1016/j.mrrev.2025.108531 PMC12124966 39814314 67 Miller B Albertini S Locher F Thybaud V Lorge E Comparative evaluation of the in vitro micronucleus test and the in vitro chromosome aberration test: industrial experience Mutat Res 1997 392 1–2 45 59 9269330 10.1016/s0165-1218(97)00044-x 68 Tucker JD Preston RJ Chromosome aberrations, micronuclei, aneuploidy, sister chromatid exchanges, and cancer risk assessment Mutat Res 1996 365 1–3 147 159 8898995 10.1016/s0165-1110(96)90018-4 69 Decordier I Dillen L Cundari E Kirsch‐Volders M Elimination of micronucleated cells by apoptosis after treatment with inhibitors of microtubules Mutagenesis 2002 17 4 337 344 12110631 10.1093/mutage/17.4.337 70 Hintzsche H Hemmann U Poth A Utesch D Lott J Stopper H Fate of micronuclei and micronucleated cells Mutat Res 2017 771 85 98 10.1016/j.mrrev.2017.02.002 28342454 71 Nakamura N Sposto R Miller RC Hiraoka T Takeichi N X‐ray‐induced mutations in cultured human thyroid cells Radiat Res 1989 119 1 123 133 2756103 ",
  "metadata": {
    "Title of this paper": "X‐ray‐induced mutations in cultured human thyroid cells",
    "Journal it was published in:": "Medical Physics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483971/"
  }
}