{
  "title": "Paper_264",
  "abstract": "pmc J Lipid Atheroscler J Lipid Atheroscler 3897 jlipidath JLA Journal of Lipid and Atherosclerosis 2287-2892 2288-2561 The Korean Society of Lipid and Atherosclerosis PMC12488795 PMC12488795.1 12488795 12488795 10.12997/jla.2025.14.3.350 1 Original Article Exhaled Breath Biomarkers Reflect the Inflammasome and Lipidome Changes in Ischemic Heart Disease: A Study Using Machine Learning Models and Network Analysis https://orcid.org/0000-0001-5507-2413 Marzoog Basheer Abdullah 1 https://orcid.org/0000-0003-1485-6072 Chomakhidze Peter 1 https://orcid.org/0000-0002-0451-2009 Gognieva Daria 1 https://orcid.org/0000-0001-8360-1415 Silantyev Artemiy 1 https://orcid.org/0000-0002-2224-0019 Suvorov Alexander 1 https://orcid.org/0009-0002-3694-5295 Stroeva Anastasia 1 https://orcid.org/0000-0002-0250-9949 Mustafina Malika 2 https://orcid.org/0000-0001-8283-5359 Fedorova Alina Yur'evna 3 https://orcid.org/0000-0002-9602-292X Syrkin Abram 2 https://orcid.org/0000-0001-5124-6383 Kopylov Philipp 1 1 Russia 2 Russia 3 Russia Correspondence to Basheer Abdullah Marzoog. World-Class Research Center, Digital Biodesign and Personalized Healthcare, I.M. Sechenov First Moscow State Medical University (Sechenov University), 8-2 Trubetskaya Street, Moscow 119991, Russia. marzug@mail.ru 9 2025 08 7 2025 14 3 498145 350 371 04 2 2025 18 4 2025 13 5 2025 01 09 2025 03 10 2025 03 10 2025 © 2025 The Korean Society of Lipid and Atherosclerosis. 2025 The Korean Society of Lipid and Atherosclerosis https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( https://creativecommons.org/licenses/by-nc/4.0/ Objective To define relationships between lipidomics, inflammasome, and exhaled volatile organic compounds (VOCs) in ischemic heart disease (IHD) and develop a VOC-based diagnostic machine learning model for non-invasive diagnosis. Methods A single-center prospective study involved 80 participants between 27 Oct 2023 and 11 Jun 2024: 31 with stress-computed tomography (CT) myocardial-perfusion–confirmed IHD and 49 perfusion-negative controls. All underwent stress CT perfusion, bicycle-ergometry, and breath collection at rest, peak exercise, and 3-minute recovery into a PTR-TOF-MS-1000. Lipid measurements were made (total, high-density lipoprotein [HDL]-, low-density lipoprotein [LDL]-, very LDL-cholesterol, triglycerides, apolipoprotein B [ApoB], lipoprotein-a) and inflammatory biomarkers (interleukin-6, C-reactive protein). LASSO regression mapped VOC–biomarker associations. An XGBoost classifier integrating VOCs, lipidome, inflammasome, and lipid-lowering therapy status was evaluated with cross-validated Youden index. Results Controls showed minimal biomarker-VOC relationships. Patients exhibited significant lipid-VOC correlations, including HDL-C with m/z 49.995 (r=0.31) and an inverse correlation between total cholesterol and m/z 94.053 (r=−0.35). Key discriminative VOCs were 2-ethyl-2,5-dihydro-4,5-dimethylthiazole, HO3PS2, CH8N3P, and m/z 49.995. Exercise revealed dynamic ApoB and LDL interactions exclusive to IHD. Inflammasome had limited direct VOC links; IL-6 inversely correlated with total cholesterol in IHD, while CRP aligned with HDL in controls. The final model achieved: AUC 0.931 (95% confidence interval [CI], 0.869–0.978), sensitivity 0.613 (95% CI, 0.435–0.793), specificity 1.000 (95% CI, 1.000–1.000), NPV 0.803 (95% CI, 0.692–0.903), PPV 1.000 (95% CI, 1.000–1.000). Conclusion Exhaled VOC patterns reflect lipid dysregulation in IHD. Combined with lipid and inflammatory data, VOCs enable high-accuracy, non-invasive IHD discrimination, supporting breathomics as a promising diagnostic adjunct. Trial Registration ClinicalTrials.gov Identifier: NCT06181799 Myocardial ischemia Mass spectrometry Inflammasomes Lipidomics CTP Volatile organic compounds Boosting machine learning algorithms government assignment 1023022600020-6 RSF 24-15-00549 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Ischemic heart disease is increasingly recognized as a global health emergency, due to the dramatic rise in the number of affected individuals each year. 1 2 3 4 5 6 7 7 4 8 Several methods and techniques have been used to assess changes in the biochemical composition of exhaled breath, including selected electronic nose sensors and mass spectrometers operating in time-of-flight mode, some of which require pre-processing of the collected breath sample. Published studies have indicated that exhaled breath analysis may serve as a non-invasive “mirror” of cardiac health, including the detection of ischemia. 7 9 10 11 12 13 The term \"volatilome\" refers broadly to the range of biochemical constituents in exhaled breath, commonly known as volatile organic compounds (VOCs). These VOCs are organic chemicals present in exhaled air as gaseous byproducts of metabolic processes, cellular activity, or interactions with exogenous sources such as environmental pollutants, diet, or the microbiota. 14 15 Previous investigations have not comprehensively addressed changes in exhaled breath biomarkers associated with IHD. Furthermore, to date, there has been no study reporting on lipidome and inflammasome alterations in patients with IHD confirmed by stress computed tomography perfusion (CTP) imaging with vasodilation testing. Additionally, correlations between exhaled breath biomarkers, lipidome, and inflammasome markers in IHD patients have not yet been explored. A recent study demonstrated elevated levels of acetone, ethanol, and phenol in the exhaled breath of patients with coronary artery disease. 16 17 The current investigation is the first worldwide to report changes in exhaled breath in patients with IHD confirmed by CTP and to correlate these changes with the lipidome and inflammasome. MATERIALS AND METHODS 1. Study design This was a prospective, single-center, cross-sectional diagnostic study conducted in a case-control format. Two groups were included: the first group (n=31) comprised patients with a myocardial perfusion defect identified by stress CTP imaging with a vasodilation test using ATP. The second group (n=49) consisted of participants without a myocardial perfusion defect on CTP imaging with the vasodilation test using ATP ( Fig. 1 Fig. 1 Flow chart of the main study steps. The time spent at the hospital for the first 4 steps (blue background, white font) was 1.5–2 hours. VOC, volatile organic compound. Exclusion and inclusion criteria are detailed in the Supplementary Table 1 All participants provided written informed consent for participation and for anonymous publication of any related images. The study was approved by the local ethics committee of Sechenov University (approval number 19-23, dated 26/10/2023). This study was conducted and reported in accordance with the STROBE guidelines. 2. Data collection Data were collected at Hospital No. 1 of Sechenov University from October 27, 2023, to June 11, 2024. The study protocol was registered at ClinicalTrials.gov for full transparency ( NCT06181799 https://clinicaltrials.gov/study/NCT06181799?a=1 3. Instrumental analysis All instrumental and laboratory analyses were performed in accordance with high-quality standards, following the Helsinki Declaration and Good Clinical Practice guidelines. 4. Stress CTP imaging with ATP Before CTP imaging, all participants were required to provide recent (within 30 days) venous creatinine results and estimated glomerular filtration rate values per the 2021 chronic kidney disease-epidemiology collaboration creatinine formula (>30 mL/min/1.73 m 2 18 19 20 21 Both groups underwent venous catheterization via the basilic or radial vein for administration of contrast (Iohexol, Omnipaque) and Natrii (10 mg/1 mL; TRIPHOSADENINUM) to pharmacologically induce cardiac stress. The same catheter was used for contrast administration during CTP. To prepare the ATP, 3 mL of ATP was diluted in 17 mL of isotonic sodium chloride solution (0.9%), resulting in a total of 20 mL per patient. The volume of diluted drug injected intravenously was calculated according to body weight: for 60 kg, 12 mL; for 70 kg, 14 mL; for 80 kg, 16 mL; and for 100 kg, 20 mL. Injection was performed manually over 2 minutes at a dose of 300 μg/kg. Stress CTP imaging was performed using a Canon Aquilion One Genesis scanner (640 slices, 0.5 mm thickness) with intravenous administration of 50 mL of Iohexol contrast. The protocol consisted of 3 steps. First, a non-contrast scan was obtained to assess calcification in the cardiac valves and ascending aorta. Second, contrast was injected, and a rest-phase myocardial perfusion image was acquired. The patient then remained supine on the scanner for 20 minutes, after which ATP (10 mg/1 mL) was administered intravenously via catheter at a dose calculated according to body weight to induce pharmacological cardiac stress over 2 minutes. Immediately following the ATP stress test—within 30 seconds—a post-stress myocardial perfusion image was acquired. 5. Mass spectrometry (PTR-TOF-MS-1000) At baseline, all participants underwent real-time mass spectrometry analysis of exhaled breath using the PTR-TOF-MS-1000 (IONICON PTR-TOF-1000-MS, Innsbruck). Testing was conducted in the hospital in the morning, with participants fasting and abstaining from exercise, food, and beverages (except water) for 6–8 hours beforehand. 22 3 + Immediately after the bicycle ergometry, participants provided a second exhaled breath sample into the PTR-TOF-MS-1000 (1 minute). A third breath sample was collected 3 minutes after the second exhalation, also over 1 minute. 6. Physical exertion test Participants first provided a baseline breath sample at rest using the PTR-TOF-MS-1000 real-time mass spectrometry device, in a controlled hospital environment with minimal atmospheric pollution. Following this, they underwent a bicycle ergometry test on a SCHILLER CS200 device, following either the Bruce protocol or a modified Bruce protocol to assess physiological responses to physical exertion. Immediately after completing the exercise test (within 1 minute), a second breath sample was collected using the same mass spectrometer. A third breath sample was obtained 3 minutes after the second exhalation, also within a 1-minute window. Functional classification (FC) of angina for participants with positive stress test results was determined using metabolic equivalent of task (Mets-BT or BT) thresholds: BT/Mets values below 50/4 corresponded to FC-III, values between 50–100/4–7 indicated FC-II, and values exceeding 100/7 were classified as FC-I. Throughout the test, participants were continuously monitored using a 12-lead electrocardiogram (ECG), with manual blood pressure measurements recorded every 2 minutes, especially toward the end of each exercise stage. The ergometry test was discontinued under the following conditions: systolic blood pressure ≥220 mmHg; horizontal or downsloping ST segment depression ≥1 mm on ECG; onset of angina-like chest pain; ventricular tachycardia; atrial fibrillation; or other clinically significant arrhythmias. The test was also terminated if the participant reached their target heart rate, defined as ≥86% of the age-predicted maximum (220 minus age). 7. Blood analysis On the study day, all participants underwent a single venous blood draw in the morning (after bicycle ergometry, vascular stiffness testing, single-channel ECG, and exhaled air analysis, but before or after myocardial perfusion assessment as applicable). Ten milliliters of venous blood were collected in a biochemical test tube. The sample was centrifuged at 2,000 rpm for 20 minutes, and the resulting plasma was aliquoted into 7 Eppendorf tubes using sterile pipettes. Each tube was labeled with the participant’s full name, and all tubes were placed in a single bag labeled with the participant’s name, date of birth, date of blood collection, and investigator’s signature. Samples were stored in a specialized ultra-low temperature refrigerator (–82°C to –84°C) until all collections were completed. Frozen plasma samples were then sent to the laboratory for analysis of total cholesterol, low-density lipoprotein (LDL), very low-density lipoprotein (VLDL), high-density lipoprotein (HDL), triglyceride (TG), C-reactive protein (CRP), lipoprotein(a), apolipoprotein B (ApoB), and interleukin-6 (IL-6). Lipid profile analyses (including total cholesterol, LDL, VLDL, HDL, TG, ApoB, and lipoprotein(a)) were performed on a Beckman Coulter AU-5800 automated biochemical analyzer (Beckman Coulter Inc., Brea, CA, USA), using Vector Best reagents. CRP and IL-6 were measured on the same analyzer with highly sensitive SRB-ELISA-BEST (RU No. RZN 2016/3872) and IL-6-ELISA-BEST (RU No. RZN 2022/18690) enzyme-linked immunosorbent assay (ELISA) kits. ELISA was used to assess inflammasome markers (CRP and IL-6). To ensure accuracy, laboratory staff were provided with an Excel spreadsheet listing participant names and required tests, allowing immediate data entry and minimizing the risk of error. Reference values used in the study were obtained directly from the laboratory that conducted the analysis. 8. CVD risk stratification Cardiovascular risk stratification was performed using the SCORE2 and SCORE2-OP tools for healthy participants, and the SMART risk score for individuals with positive perfusion defects on CTP with stress testing. Reference values for SCORE2, SCORE2-OP, and SMART risk score were obtained from established sources. 23 24 9. Statistical analysis For quantitative parameters, the distribution was assessed using the Shapiro–Wilk test, and summary statistics included mean, standard deviation, median, interquartile range, and minimum and maximum values. For categorical and qualitative variables, both absolute and proportional values were determined. Comparisons of normally distributed quantitative variables between groups were performed using the Welch t U 2 Given the relatively small sample size and the large number of variables analyzed, traditional group comparisons were often underpowered. Therefore, machine learning algorithms were employed for subsequent analyses. 10. Selection of significant predictors of perfusion defects and evaluation of model quality The analytical workflow consisted of several stages: 1) Identification of exhaled breath metabolites associated with the outcome, and assessment of the strength of these relationships. 2) Evaluation of the associations between plasma lipid spectrum, lipid-lowering therapy, inflammatory markers (CRP, IL-6), and the outcome. 3) Construction of associative models between plasma biochemical parameters and selected exhaled breath metabolites in each group (patients and controls). 11. Determination of outcome-associated exhaled air metabolites and cross-validation using machine learning models In the study, breath samples for mass spectrometry were collected at 3 defined time points ( Fig. 2 • Baseline: the patient exhaled calmly before any exertion. • After stress: the patient exhaled immediately after the stress test. • Recovery: the patient exhaled after 3 minutes of recovery after the stress test. Fig. 2 Flowchart of machine learning analysis of exhaled breath. Numbers indicate time points: 0 = rest, 1 = peak exertion, 3 = 3 minutes after exertion. VOC, volatile organic compound. The deltas were calculated as the difference between the corresponding endpoint and the starting point. Thus, the deltas reflect the relative change in the intensity of the mass spectra. D e l t a  1 = A f t e r  S t r e s s  1 − B a s e l i n e ( 0 ) B a s e l i n e  ( 0 ) D e l t a  3 = T h r e e  M i n u t e s  A f t e r  S t r e s s  3 − B a s e l i n e  ( 0 ) B a s e l i n e  ( 0 ) To identify relevant metabolites, we employed the XGBoost gradient boosting algorithm, which ranks predictors according to their importance. 25 For each interval and the set of common predictors, XGBoost models were built using repeated cross-validation (5 splits, 10 repeats). Model performance was evaluated using receiver operating characteristic (ROC) analysis, sensitivity, and specificity, with the optimal threshold determined by Youden’s index. 12. Assessment of the relationships between plasma lipid spectrum indicators, the use of lipid-lowering therapy, and inflammatory markers with the outcome A similar feature selection pipeline was applied to assess the associations between plasma biomarkers, lipid-lowering therapy, and the outcome. All plasma measurements (CRP, IL-6, total cholesterol and its fractions, ApoB, lipoprotein(a), and lipid-lowering therapy status) were performed at baseline, prior to exertion. 13. Associations between plasma biochemical parameters and selected metabolites in exhaled air The study hypothesized that associations between plasma parameters, inflammatory markers, and exhaled air metabolites may differ between healthy participants and patients. To robustly test this, 2,000 iterations of resampling with replacement were performed, and Spearman correlation coefficients between plasma variables and VOCs were calculated in each iteration. Correlation coefficients were then summarized by their median value across all iterations. Associative network graphs were constructed, with edges included only if the median correlation coefficient exceeded 0.3 in absolute value. Only VOCs with significant associations to lipid spectrum or inflammatory markers were included. This analysis pipeline was performed separately for both groups (patients and controls), for both time intervals (immediately after exertion and recovery), and for the set of common predictors. The goal was to identify VOCs whose changes were associated with lipid parameters or inflammation markers. All statistical analyses were performed using R v4.2, Python v3.10, and Statistica 12 (StatSoft, Inc., 2014). Results were considered statistically significant at p RESULTS A total of 101 individuals were initially enrolled, with 21 subsequently excluded due to discontinuation of participation. The final prospective cohort included 80 participants. Based on CTP results, participants were divided into 2 groups: group 1 (n=31) with positive stress-induced myocardial perfusion defect, and group 2 (n=49) without stress-induced myocardial perfusion defect. 1. Descriptive statistics Descriptive characteristics for the full sample and subgroups are provided in the tables. Continuous variables are detailed in Table 1 Table 1 Descriptive statistics of the continuous variables of the full sample and groups Variables Full sample Group 1 Group 2 p Age (yr) 56.28 ± 10.60 59.93 ± 11.70 53.96 ± 9.23 0.013 * Pulse rate at rest (beats/min) 70.29 ± 9.55 70.22 ± 10.74 70.32 ± 8.84 0.960 SBP at rest (mmHg) 123.16 ± 15.43 124.48 ± 20.56 122.32 ± 11.22 0.545 DBP at rest (mmHg) 80.61 ± 11.23 82.35 ± 13.16 79.51 ± 9.81 0.270 Body weight (kg) 77.92 ± 16.23 77.12 ± 14.71 78.42 ± 17.25 0.730 Height (cm) 169.95 ± 8.83 169.80 ± 9.41 170.04 ± 8.54 0.900 BMI (kg/m 2 26.93 ± 4.90 26.70 ± 4.23 27.06 ± 5.31 0.750 Goal heart rate (beat/min) 163.72 ± 10.60 160.06 ± 11.70 166.03 ± 9.23 0.013 * Maximum heart rate (beat/min) 146.25 ± 14.11 142.67 ± 17.66 148.51 ± 10.91 0.071 % from maximum heart rate 89.53 ± 9.16 89.42 ± 12.09 89.60 ± 6.84 0.930 WT 125.63 ± 44.11 120.96 ± 47.03 128.57 ± 42.38 0.450 METs 6.67 ± 1.97 6.32 ± 2.03 6.88 ± 1.92 0.220 Creatinine (µmol/L) 82.74 ± 16.01 80.37 ± 15.44 84.23 ± 16.34 0.290 eGFR (2021 CKD-EPI creatinine) mL/min/1.73 m 2 85.31 ± 14.68 84.85 ± 15.10 85.58 ± 14.53 0.820 Total cholesterol (mmol/L) 5.5 ± 1.47 5.61 ± 1.56 5.49 ± 1.43 0.710 TG (mmol/L) 1.3 ± 0.65 1.41 ± 0.77 1.16 ± 0.54 0.080 LDL (mmol/L) 3.4 ± 1.01 3.46 ± 1.08 3.27 ± 0.96 0.410 HDL (mmol/L) 1.4 ± 0.45 1.28 ± 0.34 1.44 ± 0.50 0.120 VLDL (mmol/L) 0.6 ± 0.29 0.64 ± 0.35 0.52 ± 0.25 0.080 Atherogenic index (calculated) 3.3 ± 1.42 3.60 ± 1.75 3.05 ± 1.14 0.090 ApoB (g/L) 1.1 ± 0.30 1.19 ± 0.35 1.08 ± 0.27 0.100 Lipoprotein a (mg/L) 238.0 ± 235.59 213.22 ± 207.23 253.67 ± 252.70 0.450 CRP (mg/L) 3.37 ± 3.19 3.81 ± 2.96 3.09 ± 3.33 0.330 IL-6 (pg/mL) 0.87 ± 1.04 0.88 ± 0.91 0.86 ± 1.12 0.950 SCORE2, SCORE2-OP - - 9.11 ± 6.99 SMART risk score - 15.07 ± 7.72 - Continuous sample variables are presented as mean ± standard deviation. The Student t SBP, systolic blood pressure; DBP, diastolic blood pressure; BMI, body mass index; WT, watt; MET, metabolic equivalent of task; eGFR, estimated glomerular filtration rate; CKD-EPI, chronic kidney disease-epidemiology collaboration; TG, triglyceride; LDL, low-density lipoprotein; HDL, high-density lipoprotein; VLDL, very low-density lipoprotein; ApoB, apolipoprotein B; CRP, C-reactive protein; IL-6, interleukin-6. * p Comparative characteristics for categorical variables are summarized in Table 2 Table 2 Descriptive statistics of the categorical variables of the full sample and groups Variables Category Full sample Group 1 Group 2 P Sex Male 41 (51.25) 14 (45.16) 27 (55.10) 0.380 Weight and stage of obesity Normal 30 (37.50) 12 (38.70) 18 (36.70) 0.980 Overweight 29 (36.25) 11 (35.48) 18 (36.73) Obesity (stage 1) 20 (25.00) 8 (25.80) 12 (24.48) Obesity (stage 3) 1 (1.25) 0 (0.00) 1 (2.04) Smoking No 66 (82.50) 24 (77.41) 42 (85.71) 0.340 Concomitant diseases No 35 (43.75) 12 (38.70) 23 (46.93) 0.830 Missing data 4 (5.00) 4 (12.90) 0 (0.00) Atherosclerosis of the coronary arteries No 49 (61.25) 15 (48.38) 34 (69.38) 0.060 Hemodynamically significant atherosclerosis of the coronary arteries according to the results of computed tomography with assessment of myocardial perfusion (stenosis >70%) No 71 (88.75) 23 (74.19) 48 (97.95) 0.002 * Stress-induced myocardial perfusion defect No 49 (61.25) 0 (0.00) 49 (100.00) <0.001 * Myocardial perfusion defect at rest No 54 (67.50) 10 (32.25) 44 (89.79) <0.001 * Atherosclerosis of arteries of other localizations No 32 (40.00) 7 (22.58) 25 (51.02) 0.006 * Missing data 7 (8.75) 2 (6.45) 5 (10.20) Arterial hypertension No 40 (50.00) 12 (38.70) 28 (57.14) 0.100 Stage of arterial hypertension I 5 (6.25) 4 (13.55) 1 (2.04) 0.070 II 20 (25.00) 6 (19.35) 14 (28.57) III 16 (20.00) 9 (29.03) 7 (14.28) Degree of arterial hypertension 1st degree 19 (23.75) 10 (32.25) 9 (18.36) 0.090 2nd degree 13 (16.25) 3 (9.67) 10 (20.40) 3rd degree 9 (11.25) 6 (19.35) 3 (6.12) History of IHD Yes 3 (3.75) 4 (12.90) 1 (2.04) <0.001 * No 29 (36.25) 2 (6.45) 25 (51.02) Missing data 48 (60.00) 25 (80.64) 23 (46.93) Type of blood pressure response to stress test Asthenic 4 (5.00) 2 (10.50) 2 (4.08) 0.070 Hypotonic 4 (5.00) 3 (15.80) 1 (2.04) Hypertonic 8 (10.00) 1 (5.30) 4 (8.16) Normotonic 64 (80.00) 1 (5.30) 0 (0.00) FC according to watts FC I 8 (10.00) 1 (3.22) 7 (14.28) 0.310 FC II 9 (11.25) 3 (9.67) 6 (12.24) No IHD 63 (78.75) 27 (87.09) 36 (73.46) FC according to MET FC I 6 (7.50) 1 (3.22) 5 (10.20) 0.550 FC II 10 (12.50) 3 (9.67) 7 (14.28) FC III 1 (1.25) 0 (0.00) 1 (2.04) No IHD 63 (78.75) 27 (87.09) 36 (73.46 ) Type of stress test response Negative 42 (52.50) 16 (51.61) 26 (53.06) 0.190 Suspicious 21 (22.50) 11 (35.45) 10 (20.40) Positive 17 (21.25) 4 (12.90) 13 (26.53) Reason for stopping the stress test Horizontal ST >1 mm 8 (10.00) 2 (6.45) 6 (12.24) 0.380 Reach target HR 72 (90.00) 29 (93.54) 42 (88.11) Exercise tolerance Low 2 (2.50) 1 (3.22) 1 (2.04) 0.410 Moderate 43 (53.75) 20 (64.45) 23 (46.93) Close to high 8 (10.00) 3 (9.67) 5 (10.20) High 16 (20.00) 3 (9.67) 13 (26.53) Very high 11 (13.75) 4 (12.90) 7 (14.28) CKD stage I 35 (43.75) 12 (38.70) 23 (46.93) 0.280 II 41 (51.25) 16 (51.61) 25 (51.02) IIIа 4 (5.00) 3 (9.67) 1 (2.04) Increase in TCH (mmol/L) Normal 34 (42.50) 10 (32.25) 24 (48.97) 0.140 Increase in TG (mmol/L) Normal 66 (82.50) 23 (74.19) 43 (87.75) 0.110 HDL reduction (mmol/L) Normal 22 (27.50) 6 (19.35) 16 (32.65) 0.190 Increase LDL (mmol/L) Normal 42 (52.50) 14 (45.16) 28 (57.14) 0.290 High 38 (47.50) 17 (54.83) 21 (42.85) Increase in VLDL(mmol/L) Normal 66 (82.50) 23 (74.19) 43 (87.75) 0.110 High 14 (17.50) 8 (25.80) 6 (12.24) Atherogenic index (calc.) Low 19 (23.75) 5 (16.12) 14 (28.57) 0.300 Increase in apolipoprotein B (g/L) Normal 32 (40.00) 12 (38.70) 20 (40.81) High 29 (36.25) 14 (45.16) 15 (30.61) Elevated lipoprotein (a) (mg/L) Normal 61 (76.25) 21 (67.74) 40 (81.63) 0.150 Elevated IL-6 (pg/mL) Normal 59 (73.75) 24 (77.41) 35 (71.42) 0.550 Elevated CRP (mg/L) Normal 80 (100.00) 31 (100.00) 49 (100.00) 1.000 Hypolipidemic therapy Normal 61 (76.25) 20 (64.51) 41 (83.67) 0.040 * Elevated VLDL (mmol/L) Yes 15 (18.75) 6 (19.35) 9 (14.75) 0.910 No 65 (81.25) 25 (80.64) 40 (65.57) SCORE2/SCORE2-OP Low - - 10 (20.40) Moderate - - 21 (42.85) High - - 18 (36.73) SMART risk score Low - 11 (35.48) - Moderate - 15 (48.38) - High - 5 (16.12) - Values are presented as number (%). IHD, ischemic heart disease; FC, functional class; MET, metabolic equivalent of task; HR, heart rate; CKD, chronic kidney disease; TCH, total cholesterol; TG, triglyceride; HDL, high-density lipoprotein; LDL, low-density lipoprotein; VLDL, very low-density lipoprotein; IL-6, interleukin-6; CRP, C-reactive protein. * p 2. The diagnostic accuracy of bicycle ergometry The diagnostic performance of standard exercise testing on a bicycle ergometer was evaluated. ROC analysis using the physical exertion test result (“Reaction_type” = ‘Positive’) as the predictor and myocardial perfusion defect after stress ATP as the outcome yielded an AUC of 0.507 (95% confidence interval [CI], 0.388–0.625), sensitivity of 0.484 (95% CI, 0.306–0.657), specificity of 0.531 (95% CI, 0.392–0.673), negative predictive value of 0.619 (95% CI, 0.465–0.758), and positive predictive value of 0.395 (95% CI, 0.238–0.553). 3. Lipidome and inflammasome changes with breathome changes The lipid profile and inflammasome results were analyzed across 3 time points to optimize predictor selection and increase confidence in findings. The following steps were performed: Step 1: selection of significant predictors of perfusion defects and evaluation of model quality Following feature selection procedures for the interval between baseline and completion of exercise, the most outcome-associated predictors were identified based on 2,000 iterations, using their median feature importance within the model. The key VOCs identified at the baseline stage included: 144.91780 (0.00938), 159.07365 (0.00803), 56.053529 (0.00718), 59.057819 (0.00385), 72.053678 (0.00223), 355.06911 (0.00217), 71.054029 (0.00212), 49.995012 (0.00195), 43.047418 (0.00184), 148.046732 (0.00171), 94.0537307 (0.00159), 44.9914437 (0.00138), 447.104551 (0.00137), 63.0213147 (0.00095), 144.084727 (0.00094), 359.066780 (0.00084), 430.085362 (0.00062), and 175.134685 (0.00043). The model rebuilt with these features demonstrated high predictive quality, with an AUC of 0.968 (95% CI, 0.931–0.993), sensitivity of 0.903 (95% CI, 0.786–1.000), specificity of 0.918 (95% CI, 0.833–0.981), negative predictive value of 0.938 (95% CI, 0.857–1.00), and positive predictive value of 0.875 (95% CI, 0.75–0.931). During the recovery phase, a different set of VOCs showed the strongest association with the outcome. Those most important during recovery included: 51.03878 (0.01694), 49.99501 (0.01478), 132.05190 (0.01418), 144.91780 (0.01034), 87.076848 (0.00865), 94.053730 (0.00587), 87.933677 (0.0047), 118.07092 (0.00376), 110.05349 (0.00205), 144.08472 (0.00158), 44.014505 (0.00153), 297.08451 (0.00121), and 119.95504 (0.00009). The rebuilt model for the recovery period also demonstrated strong performance, with an AUC of 0.994 (95% CI, 0.981–1.000), sensitivity of 0.903 (95% CI, 0.788–1.000), specificity of 0.980 (95% CI, 0.935–1.000), negative predictive value of 0.941 (95% CI, 0.873–1.000), and positive predictive value of 0.966 (95% CI, 0.889–1.000). A subset of VOCs—144.08472, 144.91780, 49.995012, and 94.053730—were identified as common predictors for both time intervals. A model constructed using only these common VOCs demonstrated moderate predictive performance, with an AUC of 0.931 (95% CI, 0.869–0.978), sensitivity of 0.613 (95% CI, 0.435–0.793), specificity of 1.000 (95% CI, 1.000–1.000), negative predictive value of 0.803 (95% CI, 0.692–0.903), and positive predictive value of 1.000 (95% CI, 1.000–1.000). Complete tables with all predictors and values derived from the XGBoost analysis are available in Supplementary Tables 2 3 Step 2: assessment of the relationships between plasma predictors and the outcome When selecting plasma predictors, lipid-lowering therapy was included as a variable. The resulting predictors, ranked by feature importance, were: HDL (0.110409), lipid-lowering drugs (0.108628), CRP (0.107933), lipoprotein(a) (0.103706), IL-6 (0.103494), total cholesterol (0.10115), ApoB (0.0975365), TG (0.0893278), LDL (0.0754772), and VLDL (0.000). It should be emphasized that the prominent role of lipid-lowering therapy reflects the higher likelihood of such therapy in patients with perfusion defects, which supports the validity of the boosting model’s selection. To assess the independent contribution of biochemical parameters, lipid-lowering therapy was excluded from the model, resulting in a substantially reduced predictive quality, with an AUC of 0.528 (95% CI, 0.367–0.568), sensitivity of 0.290 (95% CI, 0.133–0.45), specificity of 0.653 (95% CI, 0.521–0.784), negative predictive value of 0.593 (95% CI, 0.463–0.717), and positive predictive value of 0.346 (95% CI, 0.161–0.52). The low performance likely reflects the weak relationship between single time-point plasma lipid and inflammatory markers and outcomes from the exercise or recovery phases, as well as the limitation that plasma was sampled only prior to exertion. Step 3: associations between plasma biochemistry and sampled VOCs Correlation matrices and network graphs were generated after preprocessing and group stratification as described in the Methods. In the visualizations, the thickness of each graph edge reflects the median correlation coefficient, while the color indicates direction (red for negative, blue for positive). The size of the nodes corresponds to their valence by module, where valence or order of a graph vertex is the number of edges for which this vertex is a node, taking into account the weight (i.e., correlation coefficient) of the edge. The analysis confirmed that known associations, such as direct moderate correlations between inflammatory markers and strong correlations between lipid spectrum indicators, were present in both groups, mirroring the logic of the Friedewald formula. Upon analyzing changes immediately after physical activity, spectral indicators such as total cholesterol, HDL, LDL, and ApoB were negatively associated with VOCs in the patient group, while positive associations were seen for lipoprotein(a). These patterns were not observed in the healthy group ( Fig. 3 Supplementary Tables 4 5 Fig. 3 Associations between ML-derived VOC signatures, lipid profile, and inflammation biomarkers in delta 1. (A, B) Correlations between key volatile organic compounds (identified via machine learning) and lipid profile, hypolipidemic therapy, and inflammatory markers (IL-6, CRP), spanning baseline to completion of exercise. Edge thickness reflects median correlation; color indicates direction (red: inverse, blue: direct). Correlations below 0.3 are omitted. ML, machine learning; VOC, volatile organic compound; IL-6, interleukin-6; CRP, C-reactive protein; ApoB, apolipoprotein B; LDL, low-density lipoprotein; HDL, high-density lipoprotein; VLDL, very low-density lipoprotein. In the pre-recovery analysis, in the patient group, CRP and IL-6 were negatively associated with VOCs, and Lp(a) remained positive. In controls, total cholesterol and HDL were negatively associated with VOCs, and ApoB was positive ( Fig. 4 Supplementary Tables 6 7 Fig. 4 Associations between ML-derived VOC signatures, lipidome, and inflammation biomarkers in delta 3. (A, B) Correlations of key volatile organic compound predictors, identified by the machine learning model, with lipid profile, use of hypolipidemic therapy, and inflammatory markers (IL-6 and CRP), spanning baseline to completion of exercise. Edge thickness reflects median correlation; color indicates direction (red: inverse, blue: direct). Correlations below 0.3 are omitted. ML, machine learning; VOC, volatile organic compound; IL-6, interleukin-6; CRP, C-reactive protein; VLDL, very low-density lipoprotein; HDL, high-density lipoprotein; LDL, low-density lipoprotein; ApoB, apolipoprotein B. When considering graphs based on common VOCs, in the main group, a moderate association is observed between these VOCs and HDL (positive correlation) as well as with total cholesterol (negative correlation). In the control group, a moderate positive association can be visualized between these VOCs and TG, VLDL, and ApoB ( Fig. 5 Supplementary Tables 8 9 Fig. 5 Associations between common ML-derived VOC predictors, lipidome, and inflammation biomarkers for both delta 1 and delta 3. (A, B) Correlation of key volatile organic compound predictors (common to both time intervals) with lipid profile, use of hypolipidemic therapy, and inflammatory markers (IL-6 and CRP) in the main and control groups. Edge thickness reflects median correlation; color indicates direction (red: inverse, blue: direct). Correlations below 0.3 are omitted. ML, machine learning; VOC, volatile organic compound; IL-6, interleukin-6; CRP, C-reactive protein; VLDL, very low-density lipoprotein; HDL, high-density lipoprotein; LDL, low-density lipoprotein; ApoB, apolipoprotein B. 4. Annotation of the obtained m/z (mass/charge) The annotation was performed in several steps: At the first stage, for each mass-charge ratio (m/z), all possible gross formulas were found based on the following hypothesis space: 1) We only considered [M+H] adducts; 2) The molecule could include the following elemental composition: 1. C from 0 to 10; 2. H from 0 to 50; 3. N from 0 to 10; 4. O from 0 to 10; 5. P from 0 to 10; 6. S from 0 to 10; 7. The molecule should not include halogens (Cl, Br, I, or F); 8. Rings and double bond equivalents (RDB) from −0.5 to 20; 9. Error in determining the weight up to 50 ppm. At the second stage, a match search was carried out in the Human Metabolome Database library for each resulting formula under the following conditions: 1) Exact molecular formula match; 2) The search was limited to m/z values below 200 due to the large number of possibilities above this threshold. If no suitable gross formula could be found for a particular m/z, only the m/z value is reported. See Table 3 26 Supplementary Table 10 Table 3 Comparative listing of the most significant volatile organic compounds identified by exhaled breath analysis in individuals with and without ischemic heart disease m/z in our study Name of the chemical substance Chemical formula Annotation method Mass error Coeff Error (ppm) References 43.04741899 N/A N/A N/A N/A 0.00184 N/A  26 44.01450529 * Cyanate CHNO HMD −0.0014148530245989832 0.00153 −32.14515340515334  26 44.99144371 N/A N/A N/A N/A 0.00138 N/A  26 49.99501251 N/A N/A N/A N/A 0.00195 N/A  26 49.99501251 N/A N/A N/A N/A 0.01478 N/A  26 51.03878894 N/A N/A N/A N/A 0.01694 N/A  26 56.05352985 N/A N/A N/A N/A 0.00718 N/A  26 59.05781995 Acetamidine C2H6N2 HMD 0.0025544869753986177 0.00385 43.254000529672744  26 63.02131476 * N/A C5H2 HMD 0.0016116769754006555 0.00095 25.573521935210344  26 71.05402914 N/A N/A N/A N/A 0.00212 N/A  26 72.05367879 * Dihydrotriazole C2H5N3 HMD 0.001944646975402975 0.00223 26.988864525163752  26 87.07684847 * N/A C5H10O HMD 0.0035929669754040106 0.00865 41.26202358646307  26 87.93367781 N/A N/A N/A N/A 0.0047 N/A  26 94.05373076 * Methylphosphoramide CH8N3P HMD −0.000870323024585673 0.00159 −9.253466263943373  26 94.05373076 * Methylphosphoramide CH8N3P HMD −0.000870323024585673 0.00587 −9.253466263943373  26 110.0534923 * N/A CH7N3O3 or C4H5N4 HMD 0.0025261369754048246 or 0.005205136975405367 0.00205 22.953719346940023 or 47.296427097619386  26 118.0709267 * Indole C8H7N HMD −0.00580126302459405 0.00376 −49.13371298706043  26 119.9550439 * N/A C2HNOS2 HMD 0.002188536975396005 0.00009 18.24464319499953  26 132.0519023 * N/A C2H5N5O2 HMD −0.0003008630245915356 0.01418 −2.2783694846593328  26 144.0847275 * 2-Ethyl-2.5-dihydro-4.5-dimethylthiazole C7H13NS HMD −0.0005810630245832726 0.00094 −4.032787059844858  26 144.0847275 * 2-Ethyl-2,5-dihydro-4,5-dimethylthiazole C7H13NS HMD −0.0005810630245832726 0.00158 −4.032787059844858  26 144.9178093 Phosphorothioic acid HO3PS2 HMD −5.8863024577249234e-05 0.00938 −0.40618213083386184  26 144.9178093 Phosphorothioic acid HO3PS2 HMD −5.8863024577249234e-05 0.01034 −0.40618213083386184  26 148.0467325 * 1-Methyl-2-nitro-1-nitrosoguanidine C2H5N5O3 HMD −0.00021606302456689264 0.00171 −1.4594244730588204  26 159.0736551 * N/A C6H10N2O3 HMD 0.0027643369754173364 0.00803 17.377717093880598  26 175.134686 * N/A C12H16N HMD 0.0008644369754335912 0.00043 4.93584106710644  26 297.0845167 * N/A N/A N/A N/A 0.00121 N/A N/A 355.0691168 * N/A N/A N/A N/A 0.00217 N/A N/A 359.06678 * N/A N/A N/A N/A 0.00084 N/A N/A 430.085363 * N/A N/A N/A N/A 0.00062 N/A N/A 447.1045513 * N/A N/A N/A N/A 0.00137 N/A N/A Values shown in bold represent m/z ratios that were common to the baseline, immediately post-exercise, and recovery time intervals. The m/z (mass-to-charge) ratios reported in our study closely correspond to values published in the literature or found in the Human Metabolome Database. Where an m/z ratio does not have a known chemical name, it is presented as a chemical formula. N/A, not available. * 5. Limitations of this study The primary limitation of this study is the modest sample size, which may introduce potential bias into the results. To mitigate this, we employed resampling techniques over a large number of iterations, robust data normalization, and median-based averaging (a more stringent approach than using the mean). Additionally, several findings in our study are consistent with established knowledge—such as the observed order of correlations in the lipid spectrum (in line with the Friedewald formula) and expected relationships between proinflammatory markers—which helps increase confidence in the validity of the results. Another limitation concerns the proposed methodology itself: currently available spirograph devices are large and expensive, which limits their widespread use in clinical practice. For broader implementation, it will be necessary to develop compact, portable devices capable of detecting VOCs specific to ischemic heart disease—a process that will entail significant financial investment and development time. The lack of standardized protocols and incomplete reference libraries for ischemic heart disease-specific biomarkers also reduce the reproducibility and accuracy of this approach. Thus, clinical application will require unified protocols and expansion of these reference databases. Finally, the small sample size in this study restricts the reliability and generalizability of our conclusions. Large-scale clinical trials with external validation are needed to confirm the effectiveness of this approach—combining exhaled breath biomarkers, inflammasome, and lipidome analysis—for the diagnosis of ischemic heart disease. DISCUSSION No statistically significant difference was found in the concentrations of lipidome biomarkers between the 2 groups. This finding is likely related to the presence of different types of ischemia detected by CTP—specifically, microvascular ischemia (ischemia with non-obstructive coronary artery disease [INOCA]) and atherosclerotic ischemia. 27 28 By contrast, the pathophysiology of ischemia with obstructive coronary artery disease is classically driven by dyslipidemia. Accordingly, participants with this form of ischemia typically had elevated levels of atherogenic lipids such as LDL and TG. Notably, inflammatory biomarkers (CRP and IL-6) were also higher in IHD patients, reflecting the well-established link between inflammation and atherosclerosis. Many of these patients were also prescribed lipid-lowering agents such as statins. Several interesting associations emerged between lipid spectra and inflammatory markers, though the inflammatory marker levels themselves were not directly or strongly correlated with VOCs. In contrast, multiple correlations were observed for the lipid spectrum, particularly in the patient group: 1) Immediately after the load: • In the main group: ✓ Negative correlations with ApoB, HDL, LDL, and total cholesterol (TCH) in the study group ✓ Positive correlations with LPA in the study group ✓ Positive correlations with various VOCs in the study group among patients receiving lipid-lowering therapy • In the control group: ✓ Significantly fewer correlations ✓ Positive correlations between the lipid spectrum and VOCs 2) Three minutes after the second breath • In the main group: ✓ Important positive correlations with IL-6 and substances with highly similar mass spectra ✓ Positive correlations between 2 VOCs and CRP ✓ Only HDL (multidirectional) and LPA had correlations with VOCs ✓ There was a moderate negative relationship between the prescription of lipid-lowering therapy and some high-weight VOCs (i.e., VOC levels were higher in those who were not prescribed therapy). • In the control group: ✓ Significantly fewer correlations ✓ The correlations of TCH and HDL with VOCs were negative, with ApoB and lipid-lowering therapy having positive correlations. 3) Common VOCs at both points: • In the main group: ✓ No common VOCs (at both time stages) • In the control group: ✓ Significantly fewer correlations ✓ Only 1 VOC was common to both periods, directly related to the lipid spectrum. A key observation across all 3 stages of network analysis in healthy individuals was the absence of strong correlations between VOCs and plasma parameters. In contrast, numerous correlations were present between spectral indicators and VOCs in patients with ischemic heart disease. Focusing on inflammatory markers, a moderate negative correlation between CRP and HDL was detected in healthy controls, but not in patients. Conversely, a moderate inverse correlation between IL-6 and total cholesterol was observed in patients. Additionally, a consistent negative association between HDL and lipid-lowering therapy was present at all time points in the control group—which is expected—while this relationship was weak in the patient group, with no significant differences between groups for this parameter. The study identified 2-ethyl-2,5-dihydro-4,5-dimethylthiazole, HO 3 2 8 3 2-Ethyl-2,5-dihydro-4,5-dimethylthiazole is a thiazole derivative, a heterocyclic compound containing sulfur and nitrogen. 29 30 31 32 The molecular formulas HO 3 2 8 3 HO 3 2 33 34 35 33 36 CH 8 3 37 38 39 The high m/z value of 49.99501251 may correspond to a large biomolecule, such as a protein, peptide, or complex metabolite. In mass spectrometry, such peaks can represent either biomarkers or degradation products associated with heart disease. 40 41 42 43 Future research should focus on validating the specificity of these identified VOCs in larger, independent cohorts. It will also be important to explore the biochemical pathways connecting thiazole derivatives and phosphorus-containing compounds to the progression of IHD, and to investigate how lipid-lowering therapies may alter VOC profiles to further refine therapeutic monitoring strategies. This study demonstrates complex interactions between lipid profiles, inflammatory markers, and VOCs in patients with ischemic heart disease, with clear distinctions between patients and healthy controls. The findings indicate that 2-ethyl-2,5-dihydro-4,5-dimethylthiazole, HO3PS2, CH8N3P, and m/z 49.99501251 are among the most important VOCs, each showing relationships with both the lipid profile and inflammation biomarkers. Notably, patients with IHD exhibited numerous correlations between lipid spectrum indicators and VOCs, such as a positive correlation between HDL and m/z 49.995012 ( r r Funding: Conflict of Interest: Data Availability Statement: Author Contributions: Conceptualization: Data curation: Formal analysis: Funding acquisition: Investigation: Methodology: Project administration: Resources: Software: Supervision: Validation: Visualization: Writing - original draft: Writing - review & editing: 1 Martin SS Aday AW Almarzooq ZI Anderson CAM Arora P Avery CL 2024 Heart disease and stroke statistics: a report of US and global data from the American Heart Association Circulation 2024 149 e347 e913 38264914 10.1161/CIR.0000000000001209 PMC12146881 2 Knuuti J Wijns W Saraste A Capodanno D Barbato E Funck-Brentano C 2019 ESC guidelines for the diagnosis and management of chronic coronary syndromes Eur Heart J 2020 41 407 477 31504439 10.1093/eurheartj/ehz425 3 Gulati M Levy PD Mukherjee D Amsterdam E Bhatt DL Birtcher KK 2021 AHA/ACC/ASE/CHEST/SAEM/SCCT/SCMR guideline for the evaluation and diagnosis of chest pain: a report of the American College of Cardiology/American Heart Association Joint Committee on clinical practice guidelines J Cardiovasc Comput Tomogr 2022 16 54 122 34955448 10.1016/j.jcct.2021.11.009 4 Gulati M Levy PD Mukherjee D Amsterdam E Bhatt DL Birtcher KK 2021 AHA/ACC/ASE/CHEST/SAEM/SCCT/SCMR guideline for the evaluation and diagnosis of chest pain: a report of the American College of Cardiology/American Heart Association Joint Committee on clinical practice guidelines Circulation 2021 144 e368 e454 10.1161/CIR.0000000000001029 34709879 5 Barbarash OL Karpov YA Panov AV Akchurin RS Alekyan BG Alekhine MN Stable ischemic heart disease. Clinical guidelines 2024 Russ J Cardiol 2024 29 6110 6 Nakano S Kohsaka S Chikamori T Fukushima K Kobayashi Y Kozuma K JCS 2022 guideline focused update on diagnosis and treatment in patients with stable coronary artery disease Circ J 2022 86 882 915 35283401 10.1253/circj.CJ-21-1041 7 Marzoog BA Volatilome: a novel tool for risk scoring in ischemic heart disease Curr Cardiol Rev 2024 20 e080724231719 38982923 10.2174/011573403X304090240705063536 PMC11440330 8 Mancini GBJ Gosselin G Chow B Kostuk W Stone J Yvorchuk KJ Canadian Cardiovascular Society guidelines for the diagnosis and management of stable ischemic heart disease Can J Cardiol 2014 30 837 849 25064578 10.1016/j.cjca.2014.05.013 9 Marzoog BA Volatilome is inflammasome- and lipidome-dependent in ischemic heart disease Curr Cardiol Rev 2024 20 e190724232038 39039680 10.2174/011573403X302934240715113647 PMC11440324 10 Marzoog B Breathomics detect the cardiovascular disease: delusion or dilution of the metabolomic signature Curr Cardiol Rev 2024 20 e020224226647 38318837 10.2174/011573403X283768240124065853 PMC11327829 11 Marzoog BA Chomakhidze P Gognieva DG Gagarina NV Kopylov P Methods enhancing the diagnostic accuracy of the bicycle ergometry in ischemic heart disease Curr Cardiol Rev 2024 12 Marzoog BA Chomakhidze P Gognieva D Parunova AY Demchuk SN Silantyev A Updates in breathomics behavior in ischemic heart disease and heart failure, mass-spectrometry World J Cardiol 2025 17 102851 40061284 10.4330/wjc.v17.i2.102851 PMC11886397 13 Marzoog BA Kopylov P Volatilome and machine learning in ischemic heart disease: current challenges and future perspectives World J Cardiol 2025 17 106593 40308617 10.4330/wjc.v17.i4.106593 PMC12038700 14 Dharmawardana N Woods C Watson DI Yazbeck R Ooi EH A review of breath analysis techniques in head and neck cancer Oral Oncol 2020 104 104654 32200303 10.1016/j.oraloncology.2020.104654 15 Janssens E van Meerbeeck JP Lamote K Volatile organic compounds in human matrices as lung cancer biomarkers: a systematic review Crit Rev Oncol Hematol 2020 153 103037 32771940 10.1016/j.critrevonc.2020.103037 16 Lombardi M Segreti A Miglionico M Pennazza G Tocca L Amendola L Breath analysis via gas chromatography-mass spectrometry (GC-MS) in chronic coronary syndrome (CCS): a proof-of-concept study J Clin Med 2024 13 5857 39407917 10.3390/jcm13195857 PMC11477340 17 Marzoog BA Chomakhidze P Gognieva D Gagarina NV Silantyev A Suvorov A Machine learning model discriminate ischemic heart disease using breathome analysis Biomedicines 2024 12 2814 39767720 10.3390/biomedicines12122814 PMC11673773 18 Cockcroft DW Gault MH Prediction of creatinine clearance from serum creatinine Nephron J 1976 16 31 41 10.1159/000180580 1244564 19 Winter MA Guhr KN Berg GM Impact of various body weights and serum creatinine concentrations on the bias and accuracy of the Cockcroft-Gault equation Pharmacotherapy 2012 32 604 612 22576791 10.1002/j.1875-9114.2012.01098.x 20 Brown DL Masselink AJ Lalla CD Functional range of creatinine clearance for renal drug dosing: a practical solution to the controversy of which weight to use in the Cockcroft-Gault equation Ann Pharmacother 2013 47 1039 1044 23757387 10.1345/aph.1S176 21 Delgado C Baweja M Crews DC Eneanya ND Gadegbeku CA Inker LA A unifying approach for GFR estimation: recommendations of the NKF-ASN task force on reassessing the inclusion of race in diagnosing kidney disease Am J Kidney Dis 2022 79 268 288.e1 34563581 10.1053/j.ajkd.2021.08.003 22 Horváth I Barnes PJ Loukides S Sterk PJ Högman M Olin AC A European Respiratory Society technical standard: exhaled biomarkers in lung disease Eur Respir J 2017 49 1600965 28446552 10.1183/13993003.00965-2016 23 SCORE2 working group and ESC cardiovascular risk collaboration SCORE2 risk prediction algorithms: new models to estimate 10-year risk of cardiovascular disease in Europe Eur Heart J 2021 42 2439 2454 34120177 10.1093/eurheartj/ehab309 PMC8248998 24 Dorresteijn JAN Visseren FLJ Wassink AMJ Gondrie MJA Steyerberg EW Ridker PM Development and validation of a prediction rule for recurrent vascular events based on a cohort study of patients with arterial disease: the SMART risk score Heart 2013 99 866 872 23574971 10.1136/heartjnl-2013-303640 25 Hastie T Tibshirani R Friedman JH The elements of statistical learning: data mining, inference, and prediction Springer 2009 26 Wishart DS Guo A Oler E Wang F Anjum A Peters H HMDB 5.0: the human metabolome database for 2022 Nucleic Acids Res 2022 50 D622 D631 34986597 10.1093/nar/gkab1062 PMC8728138 27 Nagasawa N Nakamura S Ota H Ogawa R Nakashima H Hatori N Relationship between microvascular status and diagnostic performance of stress dynamic CT perfusion imaging Eur Radiol 2024 35 2855 2865 39419862 10.1007/s00330-024-11136-1 28 Michallek F Nakamura S Ota H Ogawa R Shizuka T Nakashima H Fractal analysis of 4D dynamic myocardial stress-CT perfusion imaging differentiates micro- and macrovascular ischemia in a multi-center proof-of-concept study Sci Rep 2022 12 5085 35332236 10.1038/s41598-022-09144-6 PMC8948301 29 Mandadapu SR Weerawarna PM Prior AM Uy RAZ Aravapalli S Alliston KR Macrocyclic inhibitors of 3C and 3C-like proteases of picornavirus, norovirus, and coronavirus Bioorg Med Chem Lett 2013 23 3709 3712 23727045 10.1016/j.bmcl.2013.05.021 PMC3750990 30 Chhabria MT Patel S Modi P Brahmkshatriya PS Thiazole: a review on chemistry, synthesis and therapeutic importance of its derivatives Curr Top Med Chem 2016 16 2841 2862 27150376 10.2174/1568026616666160506130731 31 Libby P Ridker PM Hansson GK Leducq Transatlantic Network on Atherothrombosis Inflammation in atherosclerosis: from pathophysiology to practice J Am Coll Cardiol 2009 54 2129 2138 19942084 10.1016/j.jacc.2009.09.009 PMC2834169 32 Meurillon M Marton Z Hospital A Jordheim LP Béjaud J Lionne C Structure-activity relationships of β-hydroxyphosphonate nucleoside analogues as cytosolic 5′-nucleotidase II potential inhibitors: synthesis, in vitro evaluation and molecular modeling studies Eur J Med Chem 2014 77 18 37 24607586 10.1016/j.ejmech.2014.02.055 33 Tonelli M Sacks F Pfeffer M Gao Z Curhan G Cholesterol And Recurrent Events Trial Investigators Relation between serum phosphate level and cardiovascular event rate in people with coronary disease Circulation 2005 112 2627 2633 16246962 10.1161/CIRCULATIONAHA.105.553198 34 Evans K Nasim Z Brown J Clapp E Amin A Yang B Inhibition of SNAT2 by metabolic acidosis enhances proteolysis in skeletal muscle J Am Soc Nephrol 2008 19 2119 2129 18650482 10.1681/ASN.2007101108 PMC2573006 35 Eckstein F Phosphorothioates, essential components of therapeutic oligonucleotides Nucleic Acid Ther 2014 24 374 387 25353652 10.1089/nat.2014.0506 36 Neubauer S The failing heart--an engine out of fuel N Engl J Med 2007 356 1140 1151 17360992 10.1056/NEJMra063052 37 Ingwall JS Energy metabolism in heart failure and remodelling Cardiovasc Res 2009 81 412 419 18987051 10.1093/cvr/cvn301 PMC2639129 38 Lesnefsky EJ Chen Q Hoppel CL Mitochondrial metabolism in aging heart Circ Res 2016 118 1593 1611 27174952 10.1161/CIRCRESAHA.116.307505 PMC5009371 39 Smith RAJ Murphy MP Mitochondria-targeted antioxidants as therapies Discov Med 2011 11 106 114 21356165 40 Gerszten RE Wang TJ The search for new cardiovascular biomarkers Nature 2008 451 949 952 18288185 10.1038/nature06802 41 Dettmer K Aronov PA Hammock BD Mass spectrometry-based metabolomics Mass Spectrom Rev 2007 26 51 78 16921475 10.1002/mas.20108 PMC1904337 42 McGarrah RW Crown SB Zhang GF Shah SH Newgard CB Cardiovascular metabolomics Circ Res 2018 122 1238 1258 29700070 10.1161/CIRCRESAHA.117.311002 PMC6029726 43 Rosendorff C Lackland DT Allison M Aronow WS Black HR Blumenthal RS Treatment of hypertension in patients with coronary artery disease: a scientific statement from the American Heart Association, American College of Cardiology, and American Society of Hypertension J Am Coll Cardiol 2015 65 1998 2038 25840655 10.1016/j.jacc.2015.02.038 SUPPLEMENTARY MATERIALS Supplementary Table 1 Selection criteria for the study participants Supplementary Table 2 The exhaled breath predictors (listed as column factors) correspond to the mass/charge (m/z) ratio, the sign in the predictor names “_” is “.” Supplementary Table 3 The predictors of the exhaled breath (column factors) are the same the mass/charge ratio, the sign in the predictor names “_” is “.” Supplementary Table 4 Correlation test, delta 1 for volatile organic compounds, patients group. In the variable names of the exhaled breath predictors, the underscore “_” represents a decimal point (“.”) Supplementary Table 5 Correlation test, delta 1 for volatile organic compounds, control group. In the variable names of the exhaled breath predictors, the underscore “_” represents a decimal point (“.”) Supplementary Table 6 Correlation test, delta 3 for volatile organic compounds, for patients group. In the variable names of the exhaled breath predictors, the underscore “_” represents a decimal point (“.”) Supplementary Table 7 Correlation test, delta 3 for volatile organic compounds, control group. In the variable names of the exhaled breath predictors, the underscore “_” represents a decimal point (“.”) Supplementary Table 8 Correlation test, common volatile organic compounds for delta 1 and delta 3, patients group. In the variable names of the exhaled breath predictors, the underscore “_” represents a decimal point (“.”) Supplementary Table 9 Correlation test, common volatile organic compounds for delta 1 and delta 3, control group. The sign in the variable’s names of the predictors of the exhaled breath “_” is “.”, and they are the same the mass/charge ratio of the found volatile organic compounds Supplementary Table 10 Annotation of the obtained m/z according to the built machine learning model ",
  "metadata": {
    "Title of this paper": "Treatment of hypertension in patients with coronary artery disease: a scientific statement from the American Heart Association, American College of Cardiology, and American Society of Hypertension",
    "Journal it was published in:": "Journal of Lipid and Atherosclerosis",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488795/"
  }
}