{
  "title": "Paper_223",
  "abstract": "pmc Oncol Lett Oncol Lett 1736 onclett OL Oncology Letters 1792-1074 1792-1082 Spandidos Publications PMC12489719 PMC12489719.1 12489719 12489719 10.3892/ol.2025.15289 OL-30-6-15289 1 Articles Preoperative peripheral blood routine indicators as predictors of prognosis and diagnosis in glioma under the 2021 World Health Organization classification Yang Qing 1 * Ni Jiaying 2 * Zhu Jiandong 3 * Fan Xiao 1 Cheng Xing 1 Yu Yun 2 Shi Zhumei 1 Wang Yingyi 1 You Yongping 1 4 1 2 3 4 Correspondence to yypl9@njmu.edu.cn * Contributed equally 12 2025 22 9 2025 30 6 498062 543 09 4 2025 28 8 2025 22 09 2025 03 10 2025 03 10 2025 Copyright: © 2025 Yang et al. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs License Multiple hematological indicators have been shown to be associated with the prediction and prognosis of gliomas. The present study aimed to explore the value of 22 preoperative peripheral blood routine indicators in the diagnosis and prognosis prediction of glioma. Patients with glioma were grouped according to the 2021 World Health Organization (WHO) guidelines for glioma. The correlations among preoperative peripheral blood routine indicators in all patients with glioma were assessed using Spearman's rank correlation analysis. The relationships between these indicators and glioma molecular subtypes were evaluated using ANOVA, independent samples t-test and logistic regression analysis. Analysis of prognosis prediction was conducted using multivariate Cox regression. Based on the WHO 2021 guidelines, patients with glioma were classified into 92 cases of astrocytoma, 77 cases of oligodendroglioma and 402 cases of glioblastoma. Among 22 routine blood indicators, 10 low-correlation indicators were identified, 9 of which demonstrated significant value for the diagnosis of glioma. Among them, the neutrophil percentage (NEUT%) showed a notable predictive power in glioma molecular subtypes classification. In the study of overall survival (OS) prediction in patients with glioma, 6 biomarkers were found to be significantly associated with OS. Through statistical analysis, 4 independent biomarkers were selected to construct a multivariable Cox regression model. However, in the regression model, NEUT% was identified as the sole statistically significant biomarker. Despite its statistical significance, the results indicated that NEUT% had limited effectiveness in predicting OS in patients with glioma. Certain preoperative blood indicators had significant predictive value for glioma diagnosis, with NEUT% emerging as a key biomarker for predicting the presence of glioma. For prognosis, although NEUT% showed a modest effect size, it was significantly associated with poor outcomes in patients with glioma. Monitoring preoperative NEUT% levels is therefore clinically important for glioma diagnosis and prognosis. glioma neutrophils molecular typing prognosis blood chemical analysis inflammation mediators National Natural Science Foundation of China 82272651 Jiangsu Province Capability Improvement Project through Science, Technology and Education ZDXK202225 The present work was supported by the National Natural Science Foundation of China (grant no. 82272651) and the Jiangsu Province Capability Improvement Project through Science, Technology and Education (grant no. ZDXK202225). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Glioma, originating from brain glial cells, is the most common malignant primary brain tumor in adults, accounting for 4% of primary central nervous system tumors and 81% of malignant brain tumors ( 1 3 4 Currently, histopathological examination of tumor specimens obtained through surgical resection or stereotactic biopsy is considered the gold standard for the classification and grading of gliomas ( 3 5 6 7 8 By contrast, blood indicators have been well established for cancer screening and early diagnosis, monitoring treatment response and predicting recurrence ( 9 11 12 13 14 15 16 17 19 4 Based on the role of systemic inflammation in tumor progression, the present study hypothesized that preoperative blood indicators could predict glioma diagnosis and prognosis. The present study aimed to systematically evaluate 22 routine blood indicators for their diagnostic and prognostic value in glioma under the WHO 2021 classification. Patients and methods Patients and healthy controls (HCs) The preoperative peripheral blood routine tests were conducted and retrospectively analyzed. All patients were confirmed to have glioma by the pathology department of the First Affiliated Hospital of Nanjing Medical University (Nanjing, China), and were classified according to the 2021 WHO classification of central nervous system tumors ( 4 Data collection The present study included clinical data from 571 patients with glioma who visited The First Affiliated Hospital of Nanjing Medical University between December 2014 and September 2021, along with 1,899 HCs from the hospital's Health Examination Center during the same period ( Table I Statistical analysis Categorical variables were presented as case numbers, while continuous variables were expressed as the mean ± standard deviation. One-way ANOVA tests were performed to compare continuous variables across multiple groups, followed by Tukey's post-hoc test for pairwise comparisons. To address multicollinearity, the correlations among 22 preoperative peripheral blood routine indicators were analyzed using Spearman correlation analysis, and biomarkers with a correlation coefficient |r|<0.35 were retained to reduce redundancy. The optimal thresholds for preoperative blood indicators were determined using receiver operating characteristic (ROC) curves and binary logistic regression was applied. Survival analysis was performed using the Kaplan-Meier (K-M) method and differences between groups were assessed with log-rank tests. Biomarkers with multicollinearity were excluded based on variance inflation factor (VIF) calculations and the remaining biomarkers were included in the Cox proportional hazards model. The proportional hazards assumption was verified by plotting Schoenfeld residuals. The model's performance was evaluated using the concordance index (C-index) and calibration curves for 3-year survival rates. All statistical analyses were conducted using R software (version 4.2.2; R Foundation for Statistical Computing). P<0.05 was considered to indicate a statistically significant difference. Results Clinical characteristics of patients The HC group comprised 1,034 males (54.45%) and 865 females (45.55%), with an age range of 18 to 84 years and a median age of 48 years. The glioma group included 332 males (58.14%) and 239 females (41.86%), with an age range of 19 to 84 years and a median age of 56 years ( Table I 2 Table SI Correlation analysis of preoperative peripheral blood routine indicators Due to the presence of multiple interrelated preoperative peripheral blood routine indicators, such as the NEUT% and NEUT#, EOS% and EOS#, retaining all indicators would affect the accuracy of subsequent analyses. Therefore, the present study first performed a Spearman correlation analysis of the 22 biomarkers and visualized the results in a heatmap ( Fig. 1A Fig. 1B Fig. 1C-L Table SI Fig. 1K Fig. 1E Binary logistic regression model for differentiating glioma molecular subtypes using preoperative peripheral blood routine indicators To construct the binary logistic regression model, all of the biomarkers were first transformed into binary classification data based on their optimal cut-off values. Data greater than or equal to the optimal threshold were recorded as high-level, while the remaining data were classified as low-level ( Table SII Fig. 2A Fig. 2B A similar model was also constructed for the classification of the low-grade glioma (LGG) and high-grade glioma (HGG) groups using the nine biomarkers that showed significant effects in the aforementioned binary logistic regression model. Astrocytoma and oligodendroglioma were classified as LGGs, while glioblastoma was classified as a HGG. The results showed that the PLT (OR, 0.63; P=0.025) and NEUT% (OR, 3.17; P<0.001) were identified as key biomarkers for distinguishing between LGG and HGG. A decrease in PLT was associated with a significantly higher risk of developing HGG in patients with glioma, while an increase in NEUT% indicated a significantly elevated risk of HGG progression. However, the remaining biomarkers did not show any significant differences (P>0.05) ( Fig. 2C Fig. 2D Association of preoperative blood routine indicators with survival outcomes in patients with glioma To evaluate whether preoperative blood routine indicators can predict survival (OS) in patients with glioma, patients with complete prognostic information were selected in the present study based on the WHO 2021 glioma grading guidelines ( 4 Fig. 3 Fig. 1A Table II Subsequently, a multivariable Cox regression analysis was performed, and residual plots were generated using the Schoenfeld residuals method ( Fig. 4A Table II The model showed good overall fit (likelihood ratio χ 2 Fig. 4B Fig. 4B Discussion The early diagnosis of glioma is important for patient treatment and recovery. It can be achieved via imaging modalities such as CT, MRI and positron emission tomography-CT ( 5 6 13 14 16 In the present study, significant differences were found between the healthy group and the glioma group in the following 7 indicators: HCT, RDW-CV, MCH, BASO#, EOS#, PDW and NEUT%. Many of these indicators are known to be influenced by the systemic inflammatory and nutritional status of patients. In this context, a study by Han et al 20 21 21 21 24 21 22 24 et al 25 et al 26 et al 27 et al 28 Inflammatory responses may play an important role in the progression of gliomas ( 29 30 Despite the promising findings of the present study, several limitations should be acknowledged: i) Age differed between the glioma and HC groups, but age was not incorporated into the analyses. Because age is associated with both disease risk and outcomes, the lack of age adjustment may introduce residual confounding and could partly account for some observed associations. Future work should include age (and other baseline covariates) as adjustment variables, perform stratified analyses or apply matching/weighting approaches to mitigate this bias. ii) Sample size disparity-while the overall number of patients was substantial (n=571), subgroup analyses for rare molecular subtypes, such as oligodendroglioma (n=88) and glioblastoma (n=402), may have lacked statistical power; iii) model performance-the prognostic model exhibited moderate discriminative ability (C-index, 0.62), indicating a need for integrating complementary biomarkers, such as genetic or imaging markers, to enhance clinical utility. In conclusion, the present study demonstrated that the combination of certain preoperative peripheral blood routine indicators has significant predictive value for glioma diagnosis. NEUT% exhibited significant predictive power for glioma diagnosis and warrants close attention. Although NEUT% showed a limited impact in the prediction of the OS of patients with glioma, it was significantly associated with poor outcomes in patients with glioma. The NEUT% level in preoperative peripheral blood tests holds clinical significance for both the diagnosis and prognosis of glioma and should be carefully monitored in clinical practice. Supplementary Material Supporting Data Acknowledgements Not applicable. Availability of data and materials The data generated in the present study may be requested from the corresponding author. Authors' contributions YYo and YW conceived and designed the study. QY, JN and JZ acquired the clinical data. YYu and ZS assisted with patient enrollment and clinical data interpretation. QY, JN, JZ, XF and XC analyzed and interpreted the data. XF and XC performed statistical analyses, developed analysis pipelines, and ensured data reproducibility. YYu developed the data visualization pipeline. YYu and QY drafted the manuscript. YYu, ZS, YW, XF and XC critically revised the manuscript for important intellectual content. ZS provided critical expertise on the 2021 WHO classification of gliomas. YYo and YW supervised the study. YYo, YYu and YW confirm the authenticity of all the raw data. All authors have read and approved the final version of the manuscript. Ethics approval and consent to participate The present study was completed with ethics committee approval from The First Affiliated Hospital of Nanjing Medical University (approval no. 2024-SR-1144). Patient consent for publication Not applicable. Competing interests The authors declare that they have no competing interests. Abbreviations HCT hematocrit RDW-CV red cell distribution width-coefficient of variation LYMPH# lymphocyte count MCH mean corpuscular hemoglobin BASO# basophil count EOS# eosinophil count PLT platelet count PDW platelet distribution width PCT plateletcrit NEUT% neutrophil percentage NEUT# neutrophil count References 1 Stupp R Mason WP van den Bent MJ Weller M Fisher B Taphoorn MJ Belanger K Brandes AA Marosi C Bogdahn U Radiotherapy plus concomitant and adjuvant temozolomide for glioblastoma New Engl J Med 352 987 996 2005 10.1056/NEJMoa043330 15758009 2 Grossman SA Ye X Piantadosi S Desideri S Nabors LB Rosenfeld M Fisher J NABTT CNS Consortium Survival of patients with newly diagnosed glioblastoma treated with radiation and temozolomide in research studies in the United States Clin Cancer Res 16 2443 2449 2010 10.1158/1078-0432.CCR-09-3106 20371685 PMC2861898 3 Yang K Wu Z Zhang H Zhang N Wu W Wang Z Dai Z Zhang X Zhang L Peng Y Glioma targeted therapy: Insight into future of molecular approaches Mol Cancer 21 39 2022 10.1186/s12943-022-01513-z 35135556 PMC8822752 4 WHO Classification of Tumours Editorial Board World Health Organization Classification of Tumours of the Central Nervous System 5th Edition International Agency for Research on Cancer Lyon 2021 5 Mettler FA Jr Thomadsen BR Bhargavan M Gilley DB Gray JE Lipoti JA McCrohan J Yoshizumi TT Mahesh M Medical radiation exposure in the US in 2006: Preliminary results Health Phys 95 502 507 2008 10.1097/01.HP.0000326333.42287.a2 18849682 6 Le Bihan D Breton E Lallemand D Grenier P Cabanis E Laval-Jeantet M MR imaging of intravoxel incoherent motions: Application to diffusion and perfusion in neurologic disorders Radiology 161 401 407 1986 10.1148/radiology.161.2.3763909 3763909 7 Upadhyay N Waldman A Conventional MRI evaluation of gliomas Brit J Radiol 84 (Spec Iss 2) S107 S111 2011 10.1259/bjr/65711810 22433821 PMC3473894 8 Qu S Guan J Liu Y Identification of microRNAs as novel biomarkers for glioma detection: A meta-analysis based on 11 articles J Neurol Sci 348 181 187 2015 10.1016/j.jns.2014.11.036 25510379 9 Loke SY Lee ASG The future of blood-based biomarkers for the early detection of breast cancer Eur J Cancer 92 54 68 2018 10.1016/j.ejca.2017.12.025 29413690 10 Duffy MJ O'Byrne K Tissue and blood biomarkers in lung cancer: A review Adv Clin Chem 86 1 21 2018 10.1016/bs.acc.2018.05.001 30144837 11 McMillan DC Systemic inflammation, nutritional status and survival in patients with cancer Curr Opin Clin Nutr 12 223 226 2009 10.1097/MCO.0b013e32832a7902 19318937 12 Hanahan D Weinberg RA Hallmarks of cancer: The next generation Cell 144 646 674 2011 10.1016/j.cell.2011.02.013 21376230 13 Wang ZL Zhang CB Liu YQ Wang Z Jiang T Peripheral blood test provides a practical method for glioma evaluation and prognosis prediction CNS Neurosci Ther 25 876 883 2019 10.1111/cns.13120 30912613 PMC6630006 14 Weng W Chen X Gong S Guo L Zhang X Preoperative neutrophil-lymphocyte ratio correlated with glioma grading and glioblastoma survival Neurol Res 40 917 922 2018 10.1080/01616412.2018.1497271 30074469 15 Yan P Li JW Mo LG Huang QR A nomogram combining inflammatory markers and clinical factors predicts survival in patients with diffuse glioma Medicine (Baltimore) 100 e27972 2021 10.1097/MD.0000000000027972 34964788 PMC8615312 16 Sharma G Jain SK Sinha VD Peripheral inflammatory blood markers in diagnosis of glioma and IDH status J Neurosci Rural Pract 12 88 94 2021 10.1055/s-0040-1721166 33551616 PMC7857957 17 Deng Q He B Liu X Yue J Ying H Pan Y Sun H Chen J Wang F Gao T Prognostic value of pre-operative inflammatory response biomarkers in gastric cancer patients and the construction of a predictive model J Transl Med 13 66 2015 10.1186/s12967-015-0409-0 25885254 PMC4343078 18 Afari ME Bhat T Neutrophil to lymphocyte ratio (NLR) and cardiovascular diseases: An update Expert Rev Cardiovasc Ther 14 573 577 2016 10.1586/14779072.2016.1154788 26878164 19 Zhou X Du Y Huang Z Xu J Qiu T Wang J Wang T Zhu W Liu P Prognostic value of PLR in various cancers: A meta-analysis PLoS One 9 e101119 2014 10.1371/journal.pone.0101119 24968121 PMC4072728 20 Han S Huang Y Li Z Hou H Wu A The prognostic role of preoperative serum albumin levels in glioblastoma patients BMC Cancer 15 108 2015 10.1186/s12885-015-1125-0 25880463 PMC4355370 21 Eckart A Struja T Kutz A Baumgartner A Baumgartner T Zurfluh S Neeser O Huber A Stanga Z Mueller B Schuetz P Relationship of nutritional status, inflammation, and serum albumin levels during acute illness: A prospective study Am J Med 133 713 722.e7 2020 10.1016/j.amjmed.2019.10.031 31751531 22 Ludwig H Van Belle S Barrett-Lee P Birgegård G Bokemeyer C Gascón P Kosmidis P Krzakowski M Nortier J Olmi P The European Cancer Anaemia Survey (ECAS): A large, multinational, prospective survey defining the prevalence, incidence, and treatment of anaemia in cancer patients Eur J Cancer 40 2293 2306 2004 10.1016/j.ejca.2004.06.019 15454256 23 Colloca G Venturino A Vitucci P Gianni W Management of anaemia in prostate cancer Cancer Invest 28 280 288 2010 10.3109/07357900903124480 19863346 24 Mercadante S Gebbia V Marrazzo A Filosto S Anaemia in cancer: Pathophysiology and treatment Cancer Treat Rev 26 303 311 2000 10.1053/ctrv.2000.0181 10913385 25 Zheng SH Huang JL Chen M Wang BL Ou QS Huang SY Diagnostic value of preoperative inflammatory markers in patients with glioma: A multicenter cohort study J Neurosurg 129 583 592 2018 10.3171/2017.3.JNS161648 29099300 26 Li B Gao B Zhu HJ Luwor RB Lu J Zhang L Kong B The prognostic value of preoperative inflammatory markers for pathological grading of glioma patients Technol Cancer Res Treat 23 15330338241273160 2024 10.1177/15330338241273160 39099463 PMC11301732 27 Stepanenko AA Sosnovtseva AO Valikhov MP Chernysheva AA Abramova OV Pavlov KA Chekhonin VP Systemic and local immunosuppression in glioblastoma and its prognostic significance Front Immunol 15 1326753 2024 10.3389/fimmu.2024.1326753 38481999 PMC10932993 28 Liang J Piao Y Holmes L Fuller GN Henry V Tiao N de Groot JF Neutrophils promote the malignant glioma phenotype through S100A4 Clin Cancer Res 20 187 198 2014 10.1158/1078-0432.CCR-13-1279 24240114 PMC4422653 29 Landskron G De la Fuente M Thuwajit P Thuwajit C Hermoso MA Chronic inflammation and cytokines in the tumor microenvironment J Immunol Res 2014 149185 2014 10.1155/2014/149185 24901008 PMC4036716 30 Turner MC Radzikowska U Ferastraoaru DE Pascal M Wesseling P McCraw A Backes C Bax HJ Bergmann C Bianchini R AllergoOncology: Biomarkers and refined classification for research in the allergy and glioma nexus-A joint EAACI-EANO position paper Allergy 79 1419 1439 2024 10.1111/all.15994 38263898 Figure 1. Correlations between preoperative peripheral blood routine indicators. (A) Spearman correlation coefficients for all 22 biomarkers from preoperative peripheral blood routine tests. (B) Spearman correlation coefficients among 10 biomarkers after preliminary exclusion. A correlation coefficient of |r|<0.35 was used as the screening criterion. (C) Distribution of HCT across healthy controls, astrocytoma, oligodendroglioma and glioblastoma. Distribution of (D) WBC, (E) MONO, (F) RDW-CV, (G) MCH, (H) BASO#, (I) EOS#, (J) PLT, (K) NEUT% and (L) PDW across the four groups. *P<0.05, **P<0.01, ***P<0.001 and ****P<0.0001. MCHC, mean corpuscular hemoglobin concentration; HCT, hematocrit; HGB, hemoglobin; MONO#, monocyte count; WBC, white blood cell count; MONO%, monocyte percentage; RBC, red blood cell count; RDW-CV, red cell distribution width-coefficient of variation; LYMPH%, lymphocyte percentage; LYMPH#, lymphocyte count; MCV, mean corpuscular volume; MCH, mean corpuscular hemoglobin; MPV, mean platelet volume; BASO%, basophil percentage; BASO#, basophil count; EOS#, eosinophil count; EOS%, eosinophil percentage; PLT, platelet count; PDW, platelet distribution width; PCT, plateletcrit; NEUT%, neutrophil percentage; NEUT#, neutrophil count. Figure 1. Correlations between preoperative peripheral blood routine indicators. (A) Spearman correlation coefficients for all 22 biomarkers from preoperative peripheral blood routine tests. (B) Spear... Figure 2. Results of binary logistic regression between different groups with preoperative blood routine indicators. (A) Forest plot of binary logistic regression comparing the effects of biomarkers in classification of healthy control group vs. glioma group. (B) ROC curve analysis for the classification model in A. (C) Forest plot of binary logistic regression comparing the effects of biomarkers in the classification of LGG vs. HGG. (D) ROC curve analysis for the classification model in C. ROC, receiver operating characteristic; LGG, low-grade glioma; HGG, high-grade glioma; OR, odds ratio; CI, confidence interval; AUC, area under curve; HCT, hematocrit; WBC, white blood cell count; MONO%, monocyte percentage; RDW-CV, red cell distribution width-coefficient of variation; MCH, mean corpuscular hemoglobin; BASO#, basophil count; PLT, platelet count; PDW, platelet distribution width; NEUT%, neutrophil percentage. Figure 2. Results of binary logistic regression between different groups with preoperative blood routine indicators. (A) Forest plot of binary logistic regression comparing the effects of biomarkers i... Figure 3. Kaplan-Meier survival curves for different biomarkers in the glioma group. Survival curves were stratified by baseline (A) LYMPH%, (B) LYMPH#, (C) MONO%, (D) PCT, (E) NEUT% and (F) NEUT# levels. The curves compared overall survival probabilities between low- and high-level groups defined by biomarker thresholds. LYMPH%, lymphocyte percentage; LYMPH#, lymphocyte count; MONO%, monocyte percentage; PCT, plateletcrit; NEUT%, neutrophil percentage; NEUT#, neutrophil count. Figure 3. Kaplan–Meier survival curves for different biomarkers in the glioma group. Survival curves were stratified by baseline (A) LYMPH%, (B) LYMPH#, (C) MONO%, (D) PCT, (E) NEUT% and (F) NEUT# lev... Figure 4. Evaluation of the multivariable Cox regression model. (A) The Schoenfeld residual tests for the Cox hazards model. The solid lines represented smoothing spline fits to the plot with the dashed lines representing the 95% CI around the fit. (B) 3-yearpp calibration curve for the multivariable Cox regression model. CI, confidence interval; MONO%, monocyte percentage; LYMPH#, lymphocyte count; PCT, plateletcrit; NEUT%, neutrophil percentage. Figure 4. Evaluation of the multivariable Cox regression model. (A) The Schoenfeld residual tests for the Cox hazards model. The solid lines represented smoothing spline fits to the plot with the dash... Table I. Clinical characteristics of glioma patients by World Health Organization grade. Group Total cases, n Age, mean ± standard deviation Gender, n (%) Cases with prognostic information, n (%) Survival/death, n (%) Glioma 571 54.19±13.77 Male 332 (58.14) 397 (69.53) 185/212 Female 239 (41.86) (46.60/53.40) Astrocytoma 92 43.02±12.42 Male 51 (55.43) 67 (72.8) 45/22 Female 41 (44.57) (67.16/32.84) Oligodendroglioma 77 46.86±10.12 Male 44 (57.14) 63 (81.8) 60/3 Female 33 (42.86) (95.24/4.76) Glioblastoma 402 58.16±12.87 Male 267 (66.41) 267 (66.4) 79/188 Female 155 (33.59) (29.59/70.41) Healthy controls 1899 47.54±13.97 Male 1034 (54.45) - - Female 865 (45.55) Table II. Results of VIF between different biomarkers and multivariable Cox regression analysis. Biomarker VIF β S x̄ Wald χ 2 HR 95% CI P-value MONO% 1.341141 0.017 0.039 0.186 1.017 0.943–1.097 0.666 LYMPH# 1.878677 0.119 0.175 0.462 1.126 0.798–1.588 0.496 PCT 1.091518 −2.198 1.398 2.469 0.111 0.007–1.253 0.116 NEUT% 1.163272 0.035 0.009 12.776 1.035 1.016–1.055 <0.001 VIF, variance inflation factor; β, regression coefficient; S x̄ ",
  "metadata": {
    "Title of this paper": "AllergoOncology: Biomarkers and refined classification for research in the allergy and glioma nexus-A joint EAACI-EANO position paper",
    "Journal it was published in:": "Oncology Letters",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489719/"
  }
}