{
  "title": "Paper_81",
  "abstract": "pmc Korean J Anesthesiol Korean J Anesthesiol 1237 kjanesth KJA Korean Journal of Anesthesiology 2005-6419 2005-7563 Korean Society of Anesthesiologists PMC12489586 PMC12489586.1 12489586 12489586 40685168 10.4097/kja.25320 kja-25320 1 Narrative Review Enhancing postoperative recovery with multimodal prehabilitation: the journey begins before surgery Multimodal prehabilitation http://orcid.org/0000-0002-7108-1384 Cho Ah-Reum  1  2  3 http://orcid.org/0000-0001-9235-513X Vongchaiudomchoke Wariya  1  4 http://orcid.org/0009-0003-3625-7449 Balde Detlef  1  5 http://orcid.org/0009-0004-5003-1996 Kim Do Jun  6 http://orcid.org/0000-0003-0610-4057 Carli Francesco  1  1 Canada  2 Korea  3 Korea  4 Thailand  5 Chile  6 Canada Corresponding author: Francesco Carli, M.D., M.Phil., FRCA, FRCPC Department of Anesthesia, Montreal General Hospital, McGill University Health Center, 1650 Cedar Avenue, L10-112, Montreal, QC H3G1A4, Canada Tel: +1-514-934-1934 (ext. 43728) Fax: +1-514-934-4446 franco.carli@mcgill.ca 10 2025 18 7 2025 78 5 498174 401 417 21 4 2025 5 6 2025 15 6 2025 01 10 2025 03 10 2025 03 10 2025 © The Korean Society of Anesthesiologists, 2025 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( https://creativecommons.org/licenses/by-nc/4.0/ This narrative review explores multimodal prehabilitation, a patient-centered, evidence-based, and multidisciplinary approach to enhance postoperative recovery. It shifts the focus from traditional intraoperative and postoperative care to a comprehensive process beginning at diagnosis. Multimodal prehabilitation integrates exercise, nutrition, and psychological strategies to improve preoperative functional capacity and physiological reserve, enabling better management of surgical stress. The review examines prehabilitation’s clinical efficacy, highlighting enhanced functional capacity as a key outcome. It details prehabilitation components: exercise (aerobic, resistance, and respiratory muscle training), nutritional optimization targeting modifiable risk factors such as malnutrition and sarcopenia, and psychological support to lower anxiety and boost patient motivation and adherence. Individualized approaches are emphasized due to significant patient variability. This review also presents a successful multimodal prehabilitation program implemented at the Montreal General Hospital, which has a strong track record in this area. The program is structured around four key phases: screening, assessment, intervention, and follow-up. It also discusses the barriers to implementation and the roles of stakeholders, including the government, hospitals, healthcare professionals, and patients and their families, within the context of South Korea’s unique healthcare system and socio-cultural environment. Multidisciplinary care team Nutritional support Prehabilitation Preoperative care Preoperative exercise Psychosocial support pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Numerous efforts have been made to enhance postoperative recovery. One of the most revolutionary strategies has been the implementation of the Enhanced Recovery After Surgery (ERAS) program. ERAS has shifted the paradigm from the traditional approach to a patient-centered, evidence-based, and multidisciplinary approach. The ERAS pathway provides a holistic approach throughout the perioperative period [ 1 2 3 6 The ERAS pathway mainly focuses on intraoperative and postoperative care, while preoperative components such as medical optimization, smoking cessation, patient education, and risk assessment remain similar to the traditional longstanding practices, as part of standard care [ 1 7 Also, the preoperative period offers the valuable teachable moment that surgical patients are most receptive to change. During this time, patients are at different stages of transtheoretical model of health behavior change, including precontemplation, contemplation, preparation, action, or maintenance, depending on their individual characteristics [ 8 9 a process from diagnosis to surgery, consisting of one or more preoperative interventions of exercise, nutrition, psychological strategies, and respiratory training, that aims to enhance functional capacity and physiological reserve to allow patients to withstand surgical stressors, improve postoperative outcomes, and facilitate recovery 10 In this context, anesthesiologists are well positioned to serve as perioperative physicians involved in collaborative decision-making with surgeons and allied health professionals. As the scope of anesthesiology expands to include preoperative risk assessment and patient optimization, prehabilitation aligns naturally with this evolution. With their expertise in perioperative care, anesthesiologists are uniquely suited to lead or support prehabilitation efforts, contributing to improved surgical outcomes and enhanced patient-centered care. This narrative review explores the core components of multimodal prehabilitation, including exercise, nutrition, and psychological support, and summarizes current evidence on its clinical efficacy and cost-effectiveness. It then presents a practical example from a high-volume academic center with extensive experience in implementing prehabilitation [ 11 16 17 18 How does prehabilitation enhance postoperative recovery? A recent scoping review aiming to establish a standardized definition of prehabilitation identified ‘enhanced functional capacity’ as the most frequently reported concept across trials [ 10 19 20 21 22 The definition of postoperative recovery has evolved alongside the development of ERAS. Traditionally, the definition of postoperative recovery was limited to the early and intermediate phase of recovery, from operating room to discharge from care, as an outcome measure for factors associated with the length of hospitalization [ 23 24 25 28 Functional capacity generally refers to an individual’s ability to endure physiological stress that demands sustained aerobic metabolism [ 29 30 31 32 33 34 35 36 37 38 39 40 Fig. 1 15 41 The components of multimodal prehabilitation Exercise Prehabilitation aims to enhance functional capacity, with early efforts focusing on unimodal, exercise-based interventions to improve cardiorespiratory fitness, muscle strength, and muscle mass [ 10 42 43 46 47 48 49 50 Surgery induces not only localized tissue injury but also systemic stress responses, including increased oxygen demand, inflammation and ischemia-reperfusion injury, and hyperglycemia and insulin resistance [ 51 52 53 54 54 55 56 Exercise also improves insulin sensitivity and enhances the capacity of muscles to utilize both glucose and fatty acids for energy that is central to metabolic flexibility [ 57 51 58 59 60 RMT in prehabilitation is gaining attention, as the simplicity and safety of the intervention further outweigh its effects on postoperative outcomes. A pragmatic, international, multicenter randomized controlled trial (RCT) demonstrated that a 30-minute preoperative education and breathing exercise training session, delivered by a physiotherapist within six weeks before surgery, halved the incidence of postoperative pulmonary complications (PPCs) after upper abdominal surgery [ 61 62 63 Nutrition Surgery creates a catabolic environment that modulates metabolic processes to mobilize energy reserves (glycogen, adipose tissue, and skeletal muscle) to provide substrates for metabolic fuel, tissue repair, and the synthesis of proteins involved in the immune response [ 51 52 64 65 66 Although numerous studies have demonstrated that nutritional status is a key determinant of surgical outcomes, and various medical associations emphasize the importance of perioperative nutritional intervention [ 66 67 68 69 70 While exercise remains the cornerstone of multimodal prehabilitation, severely malnourished patients are highly vulnerable to muscle loss when engaging in physical activity, as their protein reserves are insufficient to maintain and build muscle mass. A significant increase in energy expenditure from exercise, particularly with aerobic training, can lead to further muscle wasting and a worsening of their physiological reserve [ 71 35 72 Psychological support Although surgical patients often experience psychological distress during the perioperative period, there is limited direct evidence on how psychological interventions lead to improved postoperative outcomes [ 73 74 75 76 51 77 78 Another critical role of psychological support is to enhance patient motivation and adherence to the prehabilitation program [ 74 79 80 81 82 A Cochrane review encompassing 105 studies across various surgical specialties under general anesthesia found that psychological preparation had only small beneficial effects on all measured outcomes, with no evidence of harm [ 77 One size does not fit all Several systematic reviews evaluating the effectiveness of multimodal prehabilitation have reported its positive impact on postoperative outcomes, including functional recovery, rates and severity of complication, LOS, and readmission rates. However, the evidence supporting these benefits has been classified as low or very low quality [ 41 42 44 45 Patients present with diverse preoperative conditions; some are malnourished, some are sarcopenic, and others exhibit reduced physical functioning, with many experiencing overlapping characteristics ( Fig. 2 83 Previous studies further support the importance of individualized approaches. Patients with higher baseline fitness showed less improvement in functional walking capacity with prehabilitation than those with lower fitness levels and were less likely to recover their baseline six-minute walking distance (6MWD) at four weeks postoperatively [ 84 35 Beyond patient characteristics, the type of disease and surgery also influences prehabilitation strategies. For cancer patients, preoperative muscle loss and weight reduction are common concerns, and multimodal prehabilitation aims to minimize these losses or ideally promote muscle mass and weight gain. In particular, studies suggest that prehabilitation is highly beneficial for patients undergoing neoadjuvant therapy, as this population is vulnerable to rapid muscle wasting and deconditioning due to direct treatment toxicity and systemic side effects. Prehabilitation may help mitigate physical deterioration and maintain skeletal muscle mass. Ultimately, these positive effects can increase the likelihood that patients complete the full course of neoadjuvant therapy [ 85 86 85 Conversely, in patients with early-stage breast or endometrial cancer, as well as those undergoing orthopedic or hernia surgery, a weight loss strategy focused on reducing body fat while maintaining or increasing muscle mass may be preferable, particularly in patients with overweight or obesity [ 87 90 These examples highlight that a one-size-fits-all approach is not applicable to multimodal prehabilitation. To maximize the effectiveness of prehabilitation, multimodal prehabilitation must be customized to individual patient needs rather than applying a uniform intervention for all. Evidence for multimodal prehabilitation outcomes Improvements in postoperative clinical outcomes Recent large-scale meta-analyses and umbrella reviews (systematic reviews of systematic reviews) have been conducted to evaluate the evidence regarding the effects of prehabilitation on clinical outcomes, including LOS, incidence and severity of postoperative complications, functional recovery, and quality of life [ 41 44 45 Skořepa et al. [ 41 An umbrella review including 55 systematic reviews assessed the effects of prehabilitation programs in elective adult patients undergoing various types of surgery [ 44 A more recent meta-analysis aimed to estimate the relative efficacy of individual prehabilitation components and their combinations on postoperative outcomes [ 45 Despite the significant associations observed between prehabilitation and improved outcomes, the certainty of the available evidence remains low or very low. This limitation is primarily attributed to the inability to blind participants and caregiver, as well as the substantial heterogeneity in population, surgical procedures, and prehabilitation programs. Moreover, studies investigating patient-reported outcomes (PROs), including quality of life and psychological well-being, remain scarce. Conducting further multicenter trials with low risk of bias and a specific focus on PROs will be essential to establish a more robust evidence base for the benefits of prehabilitation. Cost impacts of multimodal prehabilitation to the health care system The hypothesis that overall healthcare costs may decrease despite the additional expenses of multimodal prehabilitation is supported by the notion that major complications, that prehabilitation can help reduce, significantly drive increased healthcare costs by admission to intensive care unit (ICU) and prolonged LOS [ 91 16 15 92 93 A recent retrospective cohort study conducted in a regional Dutch hospital analyzed the clinical outcomes and effects on hospital resources for colorectal surgery [ 94 Another cost-analysis study was conducted in a tertiary-care university hospital in Spain to assess health outcomes and the cost implications of prehabilitation [ 95 These findings suggest a strong correlation between improved clinical outcomes and reduced healthcare costs. The aforementioned Spanish study highlights the importance of patient compliance, indicating that higher compliance rates can independently contribute to cost reduction. Enhancing patient access and adherence to prehabilitation through home-based, community-based, or digitally supported programs should be explored [ 96 97 95 Nevertheless, systematic reviews of economic evaluations indicate a significant risk of bias and low methodological quality in existing studies [ 92 93 98 Multimodal perioperative program at McGill University Healthcare Center The introduction of a new healthcare service is always a challenging endeavor. The Multimodal Perioperative Program (MPOP) at McGill University Healthcare Center has been established based on over a decade of research and clinical experience. This section outlines the objectives and processes of the successfully implemented MPOP, providing a reference for the introduction of prehabilitation programs [ 11 14 99 Fully integrated within the preoperative center, the prehabilitation clinic delivers comprehensive, patient-centered, and multidisciplinary management of perioperative risk, from the initial consideration of surgery through to full recovery. Typically lasting four to 12 weeks, the program is based on team-based care and follows a structured framework consisting of screening, assessment, intervention, and follow-up ( Fig. 3 99 Screening Surgeons refer patients to the prehabilitation clinic by selecting the appropriate criteria from the referral checklist; frailty, high medical risk, smoking, neoadjuvant therapy, significant weight loss or oral intake, body mass index ≤ 20 kg/m 2 Supplemental Material 1 Physical screening includes the 6MWT, sit-to-stand test, handgrip strength assessment, arm curl test, and the Duke Activity Status Index (DASI). Patients who are unable to walk more than 400 m or have a DASI score below 34 are considered to have low physical status [ 100 101 2 2 102 103 104 Patients who do not exhibit any risk factors in the physical, nutritional, or mental domains during the screening phase are deemed low-risk. These patients receive the standard universal recommendations. These include the management of comorbidities and medications, blood management, smoking cessation, patient education, and all components of the ERAS pathways. Additionally, general guidance on exercise, nutrition, and mental health resources is provided through group classes, informational handouts, or online platforms. Assessment and intervention Any patient who shows a high-risk profile in the screening are then referred for further assessment to specialized healthcare professionals. Patients with low physical status are referred to a kinesiologist or physiotherapist for further physical assessment. Cardiopulmonary exercise test (CPET) is the gold standard for the quantification of cardiorespiratory fitness [ 53 105 TM 53 For patients identified as high risk for malnutrition through nutritional screening, a registered dietitian conducts a comprehensive nutritional assessment. To ensure a standardized evaluation and tailor interventions to individual clinical needs, the Patient-Generated Subjective Global Assessment (PG-SGA) is utilized. This assessment considers dietary habits, nutrient intake and goals, physical and body composition status, underlying causes of malnutrition, and potential barriers to adequate food intake. If patients are severely malnourished (PG-SGA > 9), they are followed by the dietitian closely. The program is designed to optimize macronutrient balance, targeting a protein intake of 1.2–1.5 g/kg/day, along with a calorie intake of 25–30 kcal/kg/day to support overall energy needs. If necessary, whey protein supplements, vitamin D, multivitamin, and omega 3 supplements are prescribed. Patients at high risk for mental distress receive a one-on-one session with a specially trained registered nurse who provides psychosocial support, tailored to the perioperative setting. Surgical stress resilience training, including deep breathing, progressive muscle relaxation, guided imagery, mindfulness meditation, body scanning, and present-focused attention, and goal setting, are introduced and practiced. If further specialized care is deemed necessary, referrals are made to social work, psychiatry, or geriatrics for additional support. Follow-up Multimodal prehabilitation is a personalized program that requires active patient participation. To ensure engagement and effectiveness, follow-up assessments are conducted every two to four weeks via phone or in-person before surgery, allowing for continuous monitoring and program adjustments based on patient progress and feedback. Postoperative recovery is assessed through a telehealth follow-up at four weeks and an in-person visit at eight weeks, during which the same measurements for functional capacity and body composition are repeated to evaluate recovery. At this stage, the program is formally concluded. If further management is needed after program completion, patients are referred to local cancer or rehabilitation facilities for continued care. Implementing multimodal prehabilitation in South Korea: a multi-stakeholder perspective Formal prehabilitation programs in South Korea are extremely limited. Only one feasibility study using the term ‘prehabilitation’ has been reported, conducted jointly by departments of physical education and obstetrics and gynecology [ 106 The barriers to implementing multimodal prehabilitation have been discussed in several previous studies [ 99 107 108 Fig. 4 Government South Korea’s healthcare system, established through government-led initiatives in the 1960s and 1970s, has evolved into a dual structure with limited financial resources. Approximately 90–95% of the healthcare services are provided by private institutions operating under the National Health Insurance Service (NHIS), a single, compulsory system regulated by the Ministry of Health and Welfare [ 109 110 Another significant barrier to EBM adoption in South Korea is the high prevalence of medical malpractice litigation. Compared to other countries, South Korea reports a far greater number of malpractice cases, with an average of 754.8 prosecutions annually; 14.7 times higher than Japan, 580.6 times higher than the UK, and 26.6 times higher than Germany [ 111 Addressing these challenges requires collaborative efforts from the government and medical institutions to establish and promote evidence-based perioperative guidelines [ 112 Additionally, the government can encourage private insurance companies to implement incentive programs that provide financial benefits to patients who undergo ERAS and prehabilitation. Numerous studies have demonstrated that these programs effectively reduce LOS and complications [ 41 42 44 93 94 The government can expand the Health Behavior Support Payment Program currently offered by the NHIS to surgical patients (https://www.nhis.or.kr/nhis/healthin/healthIncvInt.do). This program encourages individuals to proactively engage in healthy behaviors (such as walking, smoking cessation, blood pressure control, blood sugar control, and counseling/education), and points are awarded based on the level of participation and improvement. The points can be used for medical expenses or the purchase of health-related products. Similarly, if points were awarded to surgical patients participating in prehabilitation programs, it could increase participation and adherence, and improve postoperative recovery. Furthermore, patients can continue participating in the Health Behavior Support Payment Program after surgery that may help support the long-term maintenance of healthy lifestyle habits. Hospitals As hospitals grow larger and specialties become more segmented, surgical patients often face challenges in scheduling appointments with multiple departments that can be particularly burdensome for high-risk patients with multiple comorbidities. In cases where both surgical risk assessment and attenuation are needed quickly, early evaluation becomes crucial. Integrating a prehabilitation clinic within a preoperative clinic is an ideal approach [ 7 99 Although South Korean hospitals are generally well-equipped, there is a noticeable shortage of multidisciplinary clinics where specialists from various fields, such as internists, anesthesiologists, surgeons, physiotherapists, and nutritionists, collaborate effectively. Establishing multidisciplinary clinics is challenging not only due to the lack of dedicated spaces but also the difficulty in securing specialized personnel. A recent survey of major hospitals in South Korea highlighted the scarcity of physiotherapists, nurses, and doctors as a key barrier to implementing ERAS programs that require similar multidisciplinary coordination as multimodal prehabilitation [ 17 Decisions on resource allocation rely on evidence and cost-effectiveness data that may take time to gather. While multimodal prehabilitation has shown significant benefits, even unimodal approaches like exercise or nutritional support have outperformed usual care [ 45 96 Even if prehabilitation is implemented, healthcare professionals may resist changing their practices. To overcome this, hospital-level efforts are essential to facilitate the transition [ 113 114 115 Healthcare professionals The absence of established ERAS programs in South Korea further complicates the adoption of prehabilitation compared to countries where ERAS protocols are already in place. Implementing prehabilitation in this context demands additional time and effort to develop the necessary infrastructure and foster interdisciplinary collaboration. An encouraging development is the recent initiative by the Korean Ministry of Health and Welfare, in partnership with the Korean Society of Anesthesiologists and the Korean Surgical Society. Together, they have established a cooperative framework aimed at institutional improvements and have agreed to propose a pilot project introducing new incentive fees based on ERAS performance [ 18 107 South Korea’s traditional Confucian culture has deeply ingrained hierarchical relationships based on age and rank. In such environments, it is common for directives to flow top-down, with limited room for open dialogue, even among professionals within the same field [ 116 117 To address these issues, fostering open communication through regular interdisciplinary meetings and encouraging feedback can create a more inclusive and collaborative environment. Establishing clear guidelines that define roles and responsibilities will further promote mutual understanding and respect among healthcare professionals [ 118 119 Patients and their families Multimodal prehabilitation requires active patient engagement that is influenced by three key domains: capability (psychological, physical), opportunity (physical, social), and motivation (automatic, reflective) [ 120 96 97 South Korea’s family-centered culture highlights the potential benefits of adopting multimodal prehabilitation programs. Medical decisions are often made collectively, with family members playing a significant caregiving role despite the sacrifices involved, viewing it as a moral obligation [ 121 122 123 124 Conclusion Multimodal prehabilitation aims to improve the preoperative functional capacity of surgical patients during the preoperative period that is considered an optimal teachable moment. By enhancing physiological reserve through exercise training, nutritional support, and psychological preparation, prehabilitation contributes to better management of surgical stress, faster recovery, and long-term maintenance of healthy behaviors. Although multiple studies have shown promising results, the overall certainty of the evidence remains of low to moderate due to heterogeneity and methodological limitations. Furthermore, research on the cost-effectiveness of these programs that is of interest to decision-makers is still lacking. More studies addressing these gaps are necessary. The article introduces MPOP, one of the most successful prehabilitation programs globally. While benchmarking successful programs is important, it is equally crucial to adapt these programs to fit the specific medical systems and socio-cultural contexts of different regions. In South Korea, challenges such as a dual medical system, difficulties in implementing EBM, incomplete integration of preoperative clinics and ERAS programs, and hierarchical cultural norms hinder implementation. Nevertheless, several small but feasible interventions, such as brief preoperative nutrition consultations, simple home-based exercise programs, or the use of prehabilitation screening checklists in pre-anesthesia clinic, can serve as practical starting points. These efforts may help familiarize healthcare providers with multimodal prehabilitation and create momentum for broader implementation. Moving forward, building awareness among clinicians, piloting scalable models, and fostering multi-stakeholder collaboration will be key to advancing multimodal prehabilitation in South Korea.  Funding None.  Conflicts of Interest No potential conflict of interest relevant to this article was reported.  Data Availability Data sharing not applicable to this article as no datasets were generated or analyzed during the current study.  Author Contributions Ah-Reum Cho (Conceptualization; Investigation; Methodology; Software; Visualization; Writing – original draft; Writing – review & editing) Wariya Vongchaiudomchoke (Investigation; Validation; Writing – review & editing) Detlef Balde (Investigation; Validation; Writing – review & editing) Do Jun Kim (Investigation; Validation; Writing – review & editing) Francesco Carli (Conceptualization; Methodology; Resources; Supervision; Writing – review & editing) Supplementary Material Supplementary Material 1. Referral form for prehabilitation clinic. References 1 Ljungqvist O Scott M Fearon KC Enhanced recovery after surgery: a review JAMA Surg 2017 152 292 8 10.1001/jamasurg.2016.4952 28097305 2 Ljungqvist O de Boer HD Balfour A Fawcett WJ Lobo DN Nelson G Opportunities and challenges for the next phase of enhanced recovery after surgery: a review JAMA Surg 2021 156 775 84 10.1001/jamasurg.2021.0586 33881466 3 Elias KM Brindle ME Nelson G Enhanced recovery after surgery - evidence and practice NEJM Evid 2025 4 EVIDra2400012 10.1056/evidra2400012 39998302 4 Khoury AL McGinigle KL Freeman NL El-Zaatari H Feltner C Long JM Enhanced recovery after thoracic surgery: systematic review and meta-analysis JTCVS Open 2021 7 370 91 10.1016/j.xjon.2021.07.007 36003715 PMC9390629 5 Ripollés-Melchor J Ramírez-Rodríguez JM Casans-Francés R Aldecoa C Abad-Motos A Logroño-Egea M Association between use of enhanced recovery after surgery protocol and postoperative complications in colorectal surgery: the postoperative outcomes within enhanced recovery after surgery protocol (POWER) study JAMA Surg 2019 154 725 36 10.1001/jamasurg.2019.0995 31066889 PMC6506896 6 Sauro KM Smith C Ibadin S Thomas A Ganshorn H Bakunda L Enhanced recovery after surgery guidelines and hospital length of stay, readmission, complications, and mortality: a meta-analysis of randomized clinical trials JAMA Netw Open 2024 7 e2417310 10.1001/jamanetworkopen.2024.17310 38888922 PMC11195621 7 Carli F Prehabilitation for the anesthesiologist Anesthesiology 2020 133 645 52 10.1097/aln.0000000000003331 32358253 8 Prochaska JO Velicer WF The transtheoretical model of health behavior change Am J Health Promot 1997 12 38 48 10.4278/0890-1171-12.1.38 10170434 9 Robinson A Slight R Husband A Slight S The value of teachable moments in surgical patient care and the supportive role of digital technologies Perioper Med (Lond) 2020 9 2 10.1186/s13741-019-0133-z 32042404 PMC6998815 10 Fleurent-Grégoire C Burgess N McIsaac DI Chevalier S Fiore JF Jr Carli F Towards a common definition of surgical prehabilitation: a scoping review of randomised trials Br J Anaesth 2024 133 305 15 10.1016/j.bja.2024.02.035 38677949 PMC11282475 11 Carli F Bousquet-Dion G Awasthi R Elsherbini N Liberman S Boutros M Effect of multimodal prehabilitation vs postoperative rehabilitation on 30-day postoperative complications for frail patients undergoing resection of colorectal cancer: a randomized clinical trial JAMA Surg 2020 155 233 42 10.1001/jamasurg.2019.5474 31968063 PMC6990653 12 Gillis C Li C Lee L Awasthi R Augustin B Gamsa A Prehabilitation versus rehabilitation: a randomized control trial in patients undergoing colorectal resection for cancer Anesthesiology 2014 121 937 47 10.1097/aln.0000000000000393 25076007 13 Minnella EM Awasthi R Loiselle SE Agnihotram RV Ferri LE Carli F Effect of exercise and nutrition prehabilitation on functional capacity in esophagogastric cancer surgery: a randomized clinical trial JAMA Surg 2018 153 1081 9 10.1001/jamasurg.2018.1645 30193337 PMC6583009 14 Minnella EM Baldini G Quang AT Bessissow A Spicer J Carli F Prehabilitation in thoracic cancer surgery: from research to standard of care J Cardiothorac Vasc Anesth 2021 35 3255 64 10.1053/j.jvca.2021.02.049 33752968 15 Molenaar CJ Minnella EM Coca-Martinez M Ten Cate DW Regis M Awasthi R Effect of multimodal prehabilitation on reducing postoperative complications and enhancing functional capacity following colorectal cancer surgery: the PREHAB randomized clinical trial JAMA Surg 2023 158 572 81. Erratum in: JAMA Surg 2023; 158: 675 10.1001/jamasurg.2023.0198 36988937 PMC10061316 16 Cho AR Najafi T Ramanakumar AV Ferri L Spicer J Najmeh S The effect of multimodal prehabilitation on postoperative outcomes in lung cancer surgery J Thorac Cardiovasc Surg 2025 169 1631 44 10.1016/j.jtcvs.2025.02.013 40043941 17 Kim EY Lee IK Survey and analysis of the application and implementations of enhanced recovery after surgery (ERAS) program for surgical patients in the major hospitals in Korea Surg Metab Nutr 2019 10 32 45 10.18858/smn.2019.10.2.32 18 Yoon SH Lee HJ Challenging issues of implementing enhanced recovery after surgery programs in South Korea Anesth Pain Med (Seoul) 2024 19 24 34 10.17085/apm.23096 38311352 PMC10847003 19 Older PO Levett DZ Cardiopulmonary exercise testing and surgery Ann Am Thorac Soc 2017 14(Supplement_1) S74 83 10.1513/annalsats.201610-780fr 28511024 20 Eagle KA Brundage BH Chaitman BR Ewy GA Fleisher LA Hertzer NR Guidelines for perioperative cardiovascular evaluation for noncardiac surgery. Report of the American College of Cardiology/American Heart Association Task Force on Practice Guidelines. Committee on Perioperative Cardiovascular Evaluation for Noncardiac Surgery Circulation 1996 93 1278 317 8653858 21 Kristensen SD Knuuti J Saraste A Anker S Bøtker HE Hert SD 2014 ESC/ESA Guidelines on non-cardiac surgery: cardiovascular assessment and management: The Joint Task Force on non-cardiac surgery: cardiovascular assessment and management of the European Society of Cardiology (ESC) and the European Society of Anaesthesiology (ESA) Eur Heart J 2014 35 2383 431 10.1093/eurheartj/ehu282 25086026 22 Thompson A Fleischmann KE Smilowitz NR de Las Fuentes L Mukherjee D Aggarwal NR 2024 AHA/ACC/ACS/ASNC/HRS/SCA/SCCT/SCMR/SVM Guideline for Perioperative Cardiovascular Management for Noncardiac Surgery: a report of the American College of Cardiology/American Heart Association Joint Committee on Clinical Practice Guidelines Circulation 2024 150 e351 442. Erratum in: Circulation 2024; 150: e466 10.1161/CIR.0000000000001285 39316661 23 Bowyer AJ Royse CF Postoperative recovery and outcomes--what are we measuring and for whom? Anaesthesia 2016 71 Suppl 1 72 7 10.1111/anae.13312 26620150 24 Feldman LS Lee L Fiore J Jr What outcomes are important in the assessment of enhanced recovery after surgery (ERAS) pathways? Can J Anaesth 2015 62 120 30 10.1007/s12630-014-0263-1 25391733 25 Allvin R Berg K Idvall E Nilsson U Postoperative recovery: a concept analysis J Adv Nurs 2007 57 552 8 10.1111/j.1365-2648.2006.04156.x 17284272 26 Bowyer A Royse C The importance of postoperative quality of recovery: influences, assessment, and clinical and prognostic implications Can J Anaesth 2016 63 176 83 10.1007/s12630-015-0508-7 26475163 27 Neville A Lee L Antonescu I Mayo NE Vassiliou MC Fried GM Systematic review of outcomes used to evaluate enhanced recovery after surgery Br J Surg 2014 101 159 70 10.1002/bjs.9324 24469616 28 Royse CF The patient’s surgical journey and consequences of poor recovery Best Pract Res Clin Anaesthesiol 2018 32 253 8 10.1016/j.bpa.2018.06.001 30522715 29 Arena R Myers J Williams MA Gulati M Kligfield P Balady GJ Assessment of functional capacity in clinical and research settings: a scientific statement from the American Heart Association Committee on Exercise, Rehabilitation, and Prevention of the Council on Clinical Cardiology and the Council on Cardiovascular Nursing Circulation 2007 116 329 43 10.1161/circulationaha.106.184461 17576872 30 Forman DE Arena R Boxer R Dolansky MA Eng JJ Fleg JL Prioritizing functional capacity as a principal end point for therapies oriented to older adults with cardiovascular disease: a scientific statement for healthcare professionals from the American Heart Association Circulation 2017 135 e894 918 10.1161/cir.0000000000000483 28336790 PMC7252210 31 Moran J Wilson F Guinan E McCormick P Hussey J Moriarty J Role of cardiopulmonary exercise testing as a risk-assessment method in patients undergoing intra-abdominal surgery: a systematic review Br J Anaesth 2016 116 177 91 10.1093/bja/aev454 26787788 32 Wijeysundera DN Pearse RM Shulman MA Abbott TE Torres E Ambosta A Assessment of functional capacity before major non-cardiac surgery: an international, prospective cohort study Lancet 2018 391 2631 40 10.1016/S0140-6736(18)31131-0 30070222 33 Evans WJ Campbell WW Sarcopenia and age-related changes in body composition and functional capacity J Nutr 1993 123(2 Suppl) 465 8 10.1093/jn/123.suppl_2.465 8429405 34 Narici MV Maffulli N Sarcopenia: characteristics, mechanisms and functional significance Br Med Bull 2010 95 139 59 10.1093/bmb/ldq008 20200012 35 Gillis C Fenton TR Gramlich L Keller H Sajobi TT Culos-Reed SN Malnutrition modifies the response to multimodal prehabilitation: a pooled analysis of prehabilitation trials Appl Physiol Nutr Metab 2022 47 141 50 10.1139/apnm-2021-0299 34587460 36 Gn YM Abdullah HR Loke W Sim YE Prevalence and risk factors of preoperative malnutrition risk in older patients and its impact on surgical outcomes: a retrospective observational study Can J Anaesth 2021 68 622 32 10.1007/s12630-021-01933-3 33564992 37 Alvarez-Nebreda ML Bentov N Urman RD Setia S Huang JC Pfeifer K Recommendations for preoperative management of frailty from the Society for Perioperative Assessment and Quality Improvement (SPAQI) J Clin Anesth 2018 47 33 42 10.1016/j.jclinane.2018.02.011 29550619 38 Tjeertes EK van Fessem JM Mattace-Raso FU Hoofwijk AG Stolker RJ Hoeks SE Influence of frailty on outcome in older patients undergoing non-cardiac surgery - a systematic review and meta-analysis Aging Dis 2020 11 1276 90 10.14336/ad.2019.1024 33014537 PMC7505262 39 Barrett-Bernstein M Carli F Gamsa A Scheede-Bergdahl C Minnella E Ramanakumar AV Depression and functional status in colorectal cancer patients awaiting surgery: impact of a multimodal prehabilitation program Health Psychol 2019 38 900 9 10.1037/hea0000781 31380686 40 Fulop A Lakatos L Susztak N Szijarto A Banky B The effect of trimodal prehabilitation on the physical and psychological health of patients undergoing colorectal surgery: a randomised clinical trial Anaesthesia 2021 76 82 90 10.1111/anae.15215 32761611 41 Skořepa P Ford KL Alsuwaylihi A O’Connor D Prado CM Gomez D Lobo DN The impact of prehabilitation on outcomes in frail and high-risk patients undergoing major abdominal surgery: a systematic review and meta-analysis Clin Nutr 2024 43 629 48 10.1016/j.clnu.2024.01.020 38306891 42 Kovoor JG Nann SD Barot DD Garg D Hains L Stretton B Prehabilitation for general surgery: a systematic review of randomized controlled trials ANZ J Surg 2023 93 2411 25 10.1111/ans.18684 37675939 43 Esser T Zimmer P Schier R Preoperative exercise and prehabilitation Curr Opin Anaesthesiol 2022 35 667 73 10.1097/aco.0000000000001188 36156505 44 McIsaac DI Gill M Boland L Hutton B Branje K Shaw J Prehabilitation in adult patients undergoing surgery: an umbrella review of systematic reviews Br J Anaesth 2022 128 244 57 10.1016/j.bja.2021.11.014 34922735 45 McIsaac DI Kidd G Gillis C Branje K Al-Bayati M Baxi A Relative efficacy of prehabilitation interventions and their components: systematic review with network and component network meta-analyses of randomised controlled trials BMJ 2025 388 e081164 10.1136/bmj-2024-081164 39843215 PMC11752451 46 Voorn MJ Franssen RF Hoogeboom TJ van Kampen-van den Boogaart VE Bootsma GP Bongers BC Evidence base for exercise prehabilitation suggests favourable outcomes for patients undergoing surgery for non-small cell lung cancer despite being of low therapeutic quality: a systematic review and meta-analysis Eur J Surg Oncol 2023 49 879 94 10.1016/j.ejso.2023.01.024 36788040 47 Lambert CP Evans WJ Adaptations to aerobic and resistance exercise in the elderly Rev Endocr Metab Disord 2005 6 137 43 10.1007/s11154-005-6726-5 15843885 48 Frontera WR Meredith CN O’Reilly KP Evans WJ Strength training and determinants of VO2max in older men J Appl Physiol (1985) 1990 68 329 33 10.1152/jappl.1990.68.1.329 2312474 49 Villareal DT Aguirre L Gurney AB Waters DL Sinacore DR Colombo E Aerobic or resistance exercise, or both, in dieting obese older adults N Engl J Med 2017 376 1943 55 10.1056/nejmoa1616338 28514618 PMC5552187 50 Kim DJ Mayo NE Carli F Montgomery DL Zavorsky GS Responsive measures to prehabilitation in patients undergoing bowel resection surgery Tohoku J Exp Med 2009 217 109 15 10.1620/tjem.217.109 19212103 51 Desborough JP The stress response to trauma and surgery Br J Anaesth 2000 85 109 17 10.1093/bja/85.1.109 10927999 52 Stevens JL Feelisch M Martin DS Perioperative oxidative stress: the unseen enemy Anesth Analg 2019 129 1749 60 10.1213/ane.0000000000004455 31743197 53 Levett DZ Jack S Swart M Carlisle J Wilson J Snowden C Perioperative cardiopulmonary exercise testing (CPET): consensus clinical guidelines on indications, organization, conduct, and physiological interpretation Br J Anaesth 2018 120 484 500 10.1016/j.bja.2017.10.020 29452805 54 Roxburgh BH Cotter JD Campbell HA Reymann U Wilson LC Gwynne-Jones D Physiological relationship between cardiorespiratory fitness and fitness for surgery: a narrative review Br J Anaesth 2023 130 122 32 10.1016/j.bja.2022.10.039 36529576 55 Atalay M Laaksonen DE Diabetes, oxidative stress and physical exercise J Sports Sci Med 2002 1 1 14 24672266 PMC3957575 56 Powers SK Hogan MC Exercise and oxidative stress J Physiol 2016 594 5079 80 10.1113/jp272255 27629081 PMC5023702 57 Smith RL Soeters MR Wüst RCI Houtkooper RH Metabolic flexibility as an adaptation to energy resources and requirements in health and disease Endocr Rev 2018 39 489 517 10.1210/er.2017-00211 29697773 PMC6093334 58 Schricker T Lattermann R Perioperative catabolism Can J Anaesth 2015 62 182 93 10.1007/s12630-014-0274-y 25588775 59 Karimian N Niculiseanu P Amar-Zifkin A Carli F Feldman LS Association of elevated pre-operative hemoglobin A1c and post-operative complications in non-diabetic patients: a systematic review World J Surg 2018 42 61 72 10.1007/s00268-017-4106-4 28717914 60 Yu A Truong Q Whitfield K Hale A Taing MW Barker N Impact of preoperative haemoglobin A1c levels on postoperative outcomes in adults undergoing major noncardiac surgery: a systematic review Diabet Med 2024 41 e15380 10.1111/dme.15380 38853752 61 Boden I Skinner EH Browning L Reeve J Anderson L Hill C Preoperative physiotherapy for the prevention of respiratory complications after upper abdominal surgery: pragmatic, double blinded, multicentre randomised controlled trial BMJ 2018 360 j5916 10.1136/bmj.j5916 29367198 PMC5782401 62 Katsura M Kuriyama A Takeshima T Fukuhara S Furukawa TA Preoperative inspiratory muscle training for postoperative pulmonary complications in adults undergoing cardiac and major abdominal surgery Cochrane Database Syst Rev 2015 2015 CD010356 10.1002/14651858.cd010356.pub2 26436600 PMC9251477 63 Nomori H Kobayashi R Fuyuno G Morinaga S Yashima H Preoperative respiratory muscle training. Assessment in thoracic surgery patients with special reference to postoperative pulmonary complications Chest 1994 105 1782 8 10.1378/chest.105.6.1782 8205877 64 Dodd KM Tee AR Leucine and mTORC1: a complex relationship Am J Physiol Endocrinol Metab 2012 302 E1329 42 10.1152/ajpendo.00525.2011 22354780 65 Gorissen SH Crombag JJ Senden JM Waterval WA Bierau J Verdijk LB Protein content and amino acid composition of commercially available plant-based protein isolates Amino Acids 2018 50 1685 95 10.1007/s00726-018-2640-5 30167963 PMC6245118 66 Weimann A Braga M Carli F Higashiguchi T Hübner M Klek S ESPEN practical guideline: clinical nutrition in surgery Clin Nutr 2021 40 4745 61 10.1016/j.clnu.2021.03.031 34242915 67 Wischmeyer PE Carli F Evans DC Guilbert S Kozar R Pryor A American society for enhanced recovery and perioperative quality initiative joint consensus statement on nutrition screening and therapy within a surgical enhanced recovery pathway Anesth Analg 2018 126 1883 95 10.1213/ane.0000000000002743 29369092 68 Gillis C Buhler K Bresee L Carli F Gramlich L Culos-Reed N Effects of nutritional prehabilitation, with and without exercise, on outcomes of patients who undergo colorectal surgery: a systematic review and meta-analysis Gastroenterology 2018 155 391 410 10.1053/j.gastro.2018.05.012 29750973 69 Gillis C Ljungqvist O Carli F Prehabilitation, enhanced recovery after surgery, or both? A narrative review Br J Anaesth 2022 128 434 48 10.1016/j.bja.2021.12.007 35012741 70 Vaid S Bell T Grim R Ahuja V Predicting risk of death in general surgery patients on the basis of preoperative variables using American College of Surgeons National Surgical Quality Improvement Program data Perm J 2012 16 10 7 10.7812/tpp/12-019 23251111 PMC3523928 71 Hughes DC Ellefsen S Baar K Adaptations to endurance and strength training Cold Spring Harb Perspect Med 2018 8 a029769 10.1101/cshperspect.a029769 28490537 PMC5983157 72 Kamo T Ishii H Suzuki K Nishida Y The impact of malnutrition on efficacy of resistance training in community-dwelling older adults Physiother Res Int 2019 24 e1755 10.1002/pri.1755 30358013 73 Mehnert A Hartung TJ Friedrich M Vehling S Brähler E Härter M One in two cancer patients is significantly distressed: prevalence and indicators of distress Psychooncology 2018 27 75 82 10.1002/pon.4464 28568377 74 Levett DZ Grimmett C Psychological factors, prehabilitation and surgical outcomes: evidence and future directions Anaesthesia 2019 74 Suppl 1 36 42 10.1111/anae.14507 30604423 75 Kalogianni A Almpani P Vastardis L Baltopoulos G Charitos C Brokalaki H Can nurse-led preoperative education reduce anxiety and postoperative complications of patients undergoing cardiac surgery? Eur J Cardiovasc Nurs 2016 15 447 58 10.1177/1474515115602678 26304701 76 Zhang CY Jiang Y Yin QY Chen FJ Ma LL Wang LX Impact of nurse-initiated preoperative education on postoperative anxiety symptoms and complications after coronary artery bypass grafting J Cardiovasc Nurs 2012 27 84 8 10.1097/jcn.0b013e3182189c4d 21743344 77 Powell R Scott NW Manyande A Bruce J Vögele C Byrne-Davis LM Psychological preparation and postoperative outcomes for adults undergoing surgery under general anaesthesia Cochrane Database Syst Rev 2016 2016 CD008646 10.1002/14651858.cd008646.pub2 27228096 PMC8687603 78 Tsimopoulou I Pasquali S Howard R Desai A Gourevitch D Tolosa I Psychological prehabilitation before cancer surgery: a systematic review Ann Surg Oncol 2015 22 4117 23 10.1245/s10434-015-4550-z 25869228 79 Grimmett C Bradbury K Dalton SO Fecher-Jones I Hoedjes M Varkonyi-Sepp J The role of behavioral science in personalized multimodal prehabilitation in cancer Front Psychol 2021 12 634223 10.3389/fpsyg.2021.634223 33664701 PMC7921482 80 Barberan-Garcia A Navarro-Ripoll R Sánchez-Lorente D Moisés-Lafuente J Boada M Messaggi-Sartor M Cost-effectiveness of a technology-supported multimodal prehabilitation program in moderate-to-high risk patients undergoing lung cancer resection: randomized controlled trial protocol BMC Health Serv Res 2020 20 207 10.1186/s12913-020-05078-9 32164687 PMC7068871 81 Tang CY Turczyniak M Sayner A Haines K Butzkueven S O’Connell HE Adopting a collaborative approach in developing a prehabilitation program for patients with prostate cancer utilising experience-based co-design methodology Support Care Cancer 2020 28 5195 202 10.1007/s00520-020-05341-z 32072326 82 Doganay E Moorthy K Prehabilitation for esophagectomy J Thorac Dis 2019 11(Suppl 5) S632 8 10.21037/jtd.2019.02.12 31080639 PMC6503267 83 Cruz-Jentoft AJ Bahat G Bauer J Boirie Y Bruyère O Cederholm T Sarcopenia: revised European consensus on definition and diagnosis Age Ageing 2019 48 16 31 10.1093/ageing/afz046 30312372 PMC6322506 84 Minnella EM Awasthi R Gillis C Fiore JF Jr Liberman AS Charlebois P Patients with poor baseline walking capacity are most likely to improve their functional status with multimodal prehabilitation Surgery 2016 160 1070 9 10.1016/j.surg.2016.05.036 27476586 85 Allen SK Brown V White D King D Hunt J Wainwright J Multimodal prehabilitation during neoadjuvant therapy prior to esophagogastric cancer resection: effect on cardiopulmonary exercise test performance, muscle mass and quality of life-a pilot randomized clinical trial Ann Surg Oncol 2022 29 1839 50 10.1245/s10434-021-11002-0 34725764 86 Ikeda T Toyama S Harada T Noma K Hamada M Kitagawa T Effectiveness of prehabilitation during neoadjuvant therapy for patients with esophageal or gastroesophageal junction cancer: a systematic review Esophagus 2024 21 283 97 10.1007/s10388-024-01049-9 38411724 PMC11199248 87 Aubrey C Skeldon M Chapelsky S Giannakopoulos N Ghosh S Steed H Preoperative weight loss in women with obesity in gynaecologic oncology: a retrospective study Clin Obes 2021 11 e12445 10.1111/cob.12445 33710796 88 Chan DS Vieira AR Aune D Bandera EV Greenwood DC McTiernan A Body mass index and survival in women with breast cancer-systematic literature review and meta-analysis of 82 follow-up studies Ann Oncol 2014 25 1901 14 10.1093/annonc/mdu042 24769692 PMC4176449 89 Holland AM Lorenz WR Ayuso SA Katzen MM Kundu S Rosas DA Limited or lasting: is preoperative weight loss as part of prehabilitation maintained after open ventral hernia repair? J Am Coll Surg 2025 241 171 9 10.1097/xcs.0000000000001348 39907236 90 Rahman TM Fleifel D Padela MT Anoushiravani A Rizvi SA El-Othmani MM Interventions for obesity and nutritional status in arthroplasty patients JBJS Rev 2020 8 e0161 10.2106/jbjs.rvw.19.00161 32224637 91 Brunelli A Drosos P Dinesh P Ismail H Bassi V The severity of complications is associated with postoperative costs after lung resection Ann Thorac Surg 2017 103 1641 6 10.1016/j.athoracsur.2016.10.061 28189276 92 Crişan I Slankamenac K Bilotta F How much does it cost to be fit for operation? The economics of prehabilitation Curr Opin Anaesthesiol 2024 37 171 6 10.1097/aco.0000000000001359 38390954 93 Rombey T Eckhardt H Kiselev J Silzle J Mathes T Quentin W Cost-effectiveness of prehabilitation prior to elective surgery: a systematic review of economic evaluations BMC Med 2023 21 265 10.1186/s12916-023-02977-6 37468923 PMC10354976 94 Sabajo CR Ten Cate DW Heijmans MH Koot CT van Leeuwen LV Slooter GD Prehabilitation in colorectal cancer surgery improves outcome and reduces hospital costs Eur J Surg Oncol 2024 50 107302 10.1016/j.ejso.2023.107302 38043359 95 Risco R González-Colom R Montané-Muntané M Cano I Vela E Sebio R Actionable factors fostering health value generation and scalability of prehabilitation: a prospective cohort study Ann Surg 2023 278 e217 25 10.1097/sla.0000000000005662 35968894 PMC10321511 96 Oosting E Jans MP Dronkers JJ Naber RH Dronkers-Landman CM Appelman-de Vries SM Preoperative home-based physical therapy versus usual care to improve functional health of frail older adults scheduled for elective total hip arthroplasty: a pilot randomized controlled trial Arch Phys Med Rehabil 2012 93 610 6 10.1016/j.apmr.2011.11.006 22365481 97 Tay SS Zhang F Neo EJ The use of technology in cancer prehabilitation: a systematic review Front Oncol 2024 14 1321493 10.3389/fonc.2024.1321493 38706603 PMC11066209 98 Gillis C Coca-Martinez M Santa Mina D Tailoring prehabilitation to address the multifactorial nature of functional capacity for surgery J Hum Nutr Diet 2023 36 395 405 10.1111/jhn.13050 35716131 99 Carli F Awasthi R Gillis C Baldini G Bessissow A Liberman AS Integrating prehabilitation in the preoperative clinic: a paradigm shift in perioperative care Anesth Analg 2021 132 1494 500 10.1213/ane.0000000000005471 33724962 100 Gillis C Fenton TR Gramlich L Sajobi TT Culos-Reed SN Bousquet-Dion G Older frail prehabilitated patients who cannot attain a 400 m 6-min walking distance before colorectal surgery suffer more postoperative complications Eur J Surg Oncol 2021 47 874 81 10.1016/j.ejso.2020.09.041 33041092 101 Wijeysundera DN Beattie WS Hillis GS Abbott TE Shulman MA Ackland GL Integration of the Duke Activity Status Index into preoperative risk evaluation: a multicentre prospective cohort study Br J Anaesth 2020 124 261 70 10.1016/j.bja.2019.11.025 31864719 102 Cederholm T Bosaeus I Barazzoni R Bauer J Van Gossum A Klek S Diagnostic criteria for malnutrition - an ESPEN consensus statement Clin Nutr 2015 34 335 40 10.1016/j.clnu.2015.03.001 25799486 103 Bjelland I Dahl AA Haug TT Neckelmann D The validity of the Hospital Anxiety and Depression Scale. An updated literature review J Psychosom Res 2002 52 69 77 10.1016/s0022-3999(01)00296-3 11832252 104 Donovan KA Grassi L McGinty HL Jacobsen PB Validation of the distress thermometer worldwide: state of the science Psychooncology 2014 23 241 50 10.1002/pon.3430 25160838 105 Bartoszko J Thorpe KE Laupacis A Wijeysundera DN Association of preoperative anaemia with cardiopulmonary exercise capacity and postoperative outcomes in noncardiac surgery: a substudy of the Measurement of Exercise Tolerance before Surgery (METS) study Br J Anaesth 2019 123 161 9 10.1016/j.bja.2019.04.058 31227271 PMC6676367 106 Lee SH Lee NR Kim JW Lee M Seong SJ Song JY Feasibility and acceptability of prehabilitation before surgery for endometrial cancer Korean J Sports Med 2020 38 85 94 10.5763/kjsm.2020.38.2.85 107 Fuchs TI Pfab C Kiselev J Schaller SJ Spies C Rombey T Barriers and facilitators to the implementation of prehabilitation for elderly frail patients prior to elective surgery: a qualitative study with healthcare professionals BMC Health Serv Res 2024 24 536 10.1186/s12913-024-10993-2 38671446 PMC11046874 108 Moore J Merchant Z Rowlinson K McEwan K Evison M Faulkner G Implementing a system-wide cancer prehabilitation programme: the journey of Greater Manchester’s ‘Prehab4cancer’ Eur J Surg Oncol 2021 47 524 32 10.1016/j.ejso.2020.04.042 32439265 109 Kim D Awareness gaps in the public nature of Korea’s healthcare system Korean J Med Ethics 2024 27 89 102 10.35301/ksme.2024.27.2.89 110 Kim MJ Unintended consequences of healthcare reform in South Korea: evidence from a regression discontinuity in time design Health Res Policy Syst 2023 21 60 10.1186/s12961-023-00993-9 37349727 PMC10288796 111 Kim H, Lee J, Kim K. The criminalization of medical practice: current trends and implications. Seoul: KMA Research Institute for Healthcare Policy (KR); 2022 Nov. 1-239 p. Report No.: 2022-10 112 Bae JM Suggestions for the promotion of evidence-based public health in South Korea Epidemiol Health 2017 39 e2017030 10.4178/epih.e2017030 28728346 PMC5675982 113 Cabana MD Rand CS Powe NR Wu AW Wilson MH Abboud PA Why don’t physicians follow clinical practice guidelines? A framework for improvement JAMA 1999 282 1458 65 10.1001/jama.282.15.1458 10535437 114 Blumenthal DM Song Z Jena AB Ferris TG Guidance for structuring team-based incentives in healthcare Am J Manag Care 2013 19 e64 70 23448116 PMC3984877 115 Doran T Maurer KA Ryan AM Impact of provider incentives on quality and value of health care Annu Rev Public Health 2017 38 449 65 10.1146/annurev-publhealth-032315-021457 27992731 116 Moon SH Jeong H Jeong D Exploring the facilitators and barriers of rapid response teams in Korea: a qualitative study from the nursing perspective Korean J Adult Nurs 2025 37 1 12 10.7475/kjan.2025.37.1.1 117 Shin H Seo JY Choi ES De Gagne JC Facilitators and barriers to multidisciplinary teamwork in adolescent and young adult oncology care: a descriptive qualitative study J Multidiscip Healthc 2025 18 917 32 10.2147/jmdh.s501077 39990642 PMC11846609 118 Deneckere S Euwema M Van Herck P Lodewijckx C Panella M Sermeus W Care pathways lead to better teamwork: results of a systematic review Soc Sci Med 2012 75 264 8 10.1016/j.socscimed.2012.02.060 22560883 119 Zajac S Woods A Tannenbaum S Salas E Holladay CL Overcoming challenges to teamwork in healthcare: a team effectiveness framework and evidence-based guidance Front Commun 2021 6 606445 10.3389/fcomm.2021.606445 120 van der Velde M van der Leeden M Geleijn E Veenhof C Valkenet K What moves patients to participate in prehabilitation before major surgery? A mixed methods systematic review Int J Behav Nutr Phys Act 2023 20 75 10.1186/s12966-023-01474-6 37344902 PMC10286498 121 Kim SH Preferences for autonomy in end-of-life decision making in modern Korean society Nurs Ethics 2015 22 228 36 10.1177/0969733014523168 24714047 122 Dove ES Kelly SE Lucivero F Machirori M Dheensa S Prainsack B Beyond individualism: is there a place for relational autonomy in clinical practice and research? Clin Ethics 2017 12 150 65 10.1177/1477750917704156 28989327 PMC5603969 123 Khan CM Stephens MA Franks MM Rook KS Salem JK Influences of spousal support and control on diabetes management through physical activity Health Psychol 2013 32 739 47 10.1037/a0028609 22708518 124 Lee MK Park SY Choi GS Association of support from family and friends with self-leadership for making long-term lifestyle changes in patients with colorectal cancer Eur J Cancer Care (Engl) 2018 27 e12846. Erratum in: Eur J Cancer Care (Engl) 2021; 30: e13521 10.1111/ecc.12846 29635763 Fig. 1. Multimodal prehabilitation improves preoperative functional capacity and enhances postoperative outcomes by addressing modifiable surgical risk factors, such as low cardiopulmonary reserve, reduced physical activities, malnutrition, sarcopenia, frailty, and low psychological reserve. Fig. 2. Targeted patient care in multimodal prehabilitation programs: one size does not fit all. A severely malnourished patient should primarily receive nutritional support, supplemented with an exercise regimen as tolerated. Conversely, a patient with severely impaired physical function but adequate nutrition should focus on exercise training while maintaining their current diet with basic nutritional education. If a patient is sarcopenic, both nutritional and resistance exercise interventions should be prioritized. Fig. 3. Multimodal prehabilitation program at Montreal General Hospital. Patients identified as high-risk during screening undergo assessment, intervention, and follow-up in the prehabilitation clinic while simultaneously following the ERAS pathway in the preoperative clinic, resulting in optimized preoperative status. DASI: Duke Activity Status Index, CNST: Canadian Nutritional Screening Tool, FFMI: Fat-Free Mass Index, HADS: Hospital Anxiety and Depression Scale, CPET: Cardiopulmonary Exercise Test, PG-SGA: Patient-Generated Subjective Global Assessment, ERAS: Enhanced Recovery After Surgery. Fig. 4. A multi-stakeholder perspective on implementing multimodal prehabilitation in South Korea. The figure illustrates a stepwise strategy for identifying and overcoming barriers at the government, hospital, healthcare professional, and patient/family levels, based on South Korea’s unique healthcare system and socio-cultural context. VBHC: Value-Based Health Care, EBM: evidence-based medicine. ",
  "metadata": {
    "Title of this paper": "Association of support from family and friends with self-leadership for making long-term lifestyle changes in patients with colorectal cancer",
    "Journal it was published in:": "Korean Journal of Anesthesiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489586/"
  }
}