{
  "title": "Paper_590",
  "abstract": "pmc BMC Palliat Care BMC Palliat Care 54 bmcpalc BMC Palliative Care 1472-684X BMC PMC12482500 PMC12482500.1 12482500 12482500 41024046 10.1186/s12904-025-01882-4 1882 1 Research Healthcare needs of patients with metastatic cancer and impacts of social vulnerability: a multicentric cross-sectional study in France http://orcid.org/0009-0005-5873-4722 Sahut d’Izarn Marine msahutdizarn@ght78sud.fr 1 2 10 Vinant Pascale 3 Bouleuc Carole 4 Joffin Ingrid 5 Vincent Bruno 6 Barth Claire 3 Serresse Laure 7 8 Codogno Aurore 9 Behal Florence 3 Ya-de Rauglaudre Lucie 10 Jacota Madalina 11 Gassama Malamine 11 de Stampa Matthieu 2 12 1 https://ror.org/03j6rvb05 grid.413756.2 0000 0000 9982 5352 APHP, Ambroise Paré Hospital, Palliative care team, 2 https://ror.org/01ed4t417 grid.463845.8 0000 0004 0638 6872 Université Paris Saclay, UVSQ, Inserm, CESP, 3 https://ror.org/05f82e368 grid.508487.6 0000 0004 7885 7602 APHP, Cochin-HEGP Hospital, Paris-Cité University, Palliative care team, 4 https://ror.org/04t0gwh46 grid.418596.7 0000 0004 0639 6384 Institut Curie, Paris-Cité University, Palliative care team, 5 https://ror.org/01zwdgr60 grid.490149.1 0000 0000 9356 5641 Groupe Hospitalier Diaconesses croix saint Simon, Palliative care team, 6 https://ror.org/03jyzk483 grid.411599.1 0000 0000 8595 4540 APHP, Beaujon Hospital, Palliative care team, 7 https://ror.org/02mh9a093 grid.411439.a 0000 0001 2150 9058 APHP, La Pitié Salpétrière Hospital, Palliative care team, 8 https://ror.org/02en5vm52 grid.462844.8 0000 0001 2308 1657 UMRS 1158 Neurophysiologie respiratoire expérimentale et clinique, Santé-Sorbonne University, 9 10 11 https://ror.org/03j6rvb05 grid.413756.2 0000 0000 9982 5352 AP-HP, Ambroise Paré Hospital, Paris Saclay Ouest Clinical Research Unit, 12 29 9 2025 2025 24 478637 233 23 5 2025 28 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Context Understanding the healthcare needs of patients with metastatic cancer is necessary for reducing symptom burden and optimizing supportive care interventions. Little is known about the impact of social vulnerability on unmet patient needs and healthcare resources utilization in a healthcare system with universal health coverage. Objectives This study aimed to describe the healthcare needs and resource utilization of patients with metastatic cancer in France, while also examining how social vulnerability influences these factors. Methods We conducted an observational, multicentric, cross sectional study concerning inpatients and outpatients with incurable metastatic cancer. We assessed quality of life (EORTC-QLQC30), supportive care needs (SCNS-SF34), social vulnerability (EPICES score), and healthcare utilization. Results 361 patients were included; 67.9% had a good performance status (0 or 1), and 59.4% were undergoing their 1st or 2nd line of systemic treatment. They had numerous moderate to severe symptoms including fatigue (75.9%), sleep disorders (61.2%), dyspnea (56.4%), and pain (54.4%). The most important unmet needs were psychological needs (51.4% of moderate/severe needs). 26.8% of patients had visited the emergency room and 38.5% had been admitted to the hospital in the past three months for a cancer complication. 40.3% of patients were socially vulnerable. In multivariate analysis, patients with high social vulnerability had significantly higher cachexia, less surgical treatment in the past and less recent systemic treatment, and more frequent hospitalization at home. Conclusion Even when fit, patients with metastatic cancer had numerous health issues and unmet needs. Despite universal healthcare coverage, socially precarious patients seem to have a later diagnosis and less systemic treatment. Nevertheless they have the same unmet needs and strenghted medical and social care at home. A systematic monitoring of healthcare needs could help to trigger supportive care interventions. Trial registration This trial was registered in ClinicalTrial.gov PRS with the ID NCT05339945 Keywords Metastatic cancer Healthcare needs Early integrated palliative care Social vulnerability https://doi.org/10.13039/501100004431 Fondation de France 00113084 00113084 00113084 00113084 00113084 00113084 00113084 00113084 00113084 00113084 00113084 00113084 00113084 Sahut d’Izarn Marine Vinant Pascale Bouleuc Carole Joffin Ingrid Vincent Bruno Barth Claire Serresse Laure Codogno Aurore Behal Florence Ya-de Rauglaudre Lucie Jacota Madalina Gassama Malamine de Stampa Matthieu https://doi.org/10.13039/501100017007 Agence Régionale de Santé Île-de-France pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Cancer is a major global public health issue, which affects millions of people around the world every year [ 1 2 3 4 Social vulnerability has several definitions, depending on the field studied. Applied in medicine, it can be viewed as “the non-health dimensions that keeps individuals incapacitated longer than expected (e.g., in hospital and unable to return home) because of social circumstances close to the individual (e.g., marital status) but also because of social support systems that fail to respond or even perpetuate vulnerability (e.g., lack of affordable housing for people with disabilities)” [ 5 6 7 French residents benefit from universal medical coverage. Once diagnosed, cancer patients benefit from equitable and cost-free access to state-of-the-art care, as well as a wide range of supportive care services, free of charge, whether at home or in hospital. The impact of social vulnerability on healthcare needs and resource utilization among patients with metastatic cancer has yet to be assessed in this type of healthcare system. We conducted an observational, multicentric, cross sectional study with inpatients and outpatients who were followed up in hospital-based oncology wards in France. The primary objective of this study was to obtain a comprehensive assessment of the supportive and palliative care needs and healthcare resource utilization of patients with metastatic cancer. The secondary objective was to explore the association of supportive care needs and healthcare resource utilization with social vulnerability. We aimed to better identify patients’ needs to facilitate targeted supportive and palliative care interventions in a healthcare system characterized by universal coverage. Methods Trial design and study population We conducted an observational, cross-sectioned, multicentric study in eight hospitals in the Ile-de-France region. This trial was registered in ClinicalTrial.gov PRS with the ID APHP210724. The investigators were members of the palliative care team of each hospital and aimed to include 40 patients per center. The patients were included from consultation, oncology day hospitals, and hospitalization sectors of the oncology ward of each center. The study was held from June 2022 to May 2023. In each study center, patients were screened during a few days in each sector until the completions of the inclusions, spread over a maximum period of three months. On the days dedicated to the study in consultation or day hospital sectors, the investigator screened and informed the patients in order of arrival until saturation of its’ possibilities. On the days dedicated to study in hospitalization sector, he screened and informed all hospitalized patients. All patients over 18 years old with metastatic cancer treated in the investigating center were eligible. The exclusion criteria were the lack of affiliation to a social security system, visual/hearing impairment or aphasia, no understanding of French, inability to give informed non-opposition as judged by the investigators (cognitive impairment due to a preexisting condition or cancer), or a diagnosis of testicular cancer or ovarian choriocarcinoma (curable cancers). Clinical data and patients related outcome measures Sociodemographic data were collected with a self or hetero-administered (if patients were unable to read or write) questionnaire: age, place of residence, marital status, existence of a main informal caregiver, level of education according to the International Standard Classification of Education, and EPICES score (a social vulnerability evaluation score validated in French). The EPICES score is a self or hetero-administered questionnaire that explores sociodemographic data, financial outcomes, opportunities for support from relatives, and access to leisure activities. The score is very sensitive, making it possible to detect relative and significant social precariousness [ 8 9 10 Characteristics of the disease and clinical data were extracted from the medical records regarding primary tumour, time of diagnosis and time of the first metastasis, cancer treatments, performance status, Body Mass Index and cachexia (> 5% weight loss in past 3 months) [ 11 The healthcare needs of patients were explored with the EORTC-QLQ C30 questionnaire [ 12 13 14 Finally, we evaluated healthcare service use based on hospital admissions for cancer-related complications, the interventions of professionals either at home or in the hospital, extracted from medical records and a self or hetero-administered questionnaire. Statistics This study was essentially descriptive and exploratory. Considering the diversity and the prevalence of healthcare needs described in previous studies [ 4 Descriptive variables are labelled by their number and percentage for categorical variables, and by their mean and standard deviation for continuous variables. For each variable, the number of missing data was specified, and the percentages were calculated on the number of available data. The responses to the EORTC QLQ-C30 were converted into 0–100 scales according to the scoring manual, and mean scores were calculated [ 15 16 The SCNS-SF34 data were treated in the same way. The patients with social vulnerability (assessed using the EPICES score cut-off) were compared to those without one in terms of socio-demographic and clinical features, using a Chi2 or Fisher test for categorical parameters and a Student’s or a Wilcoxon test for continuous parameters. Social vulnerability was analyzed using multivariate analysis with a logistic regression model. The model included all variables with a p-value < 0.1 in the univariate analysis. Multiple imputations combined with a stepwise model based on the Wald statistic were applied. The number of imputed datasets was set to 50. For each imputed dataset, social vulnerability was analyzed, and a set of variables was retained. The final model included all variables selected in at least 50% of cases [ 17 Compliance with Ethical Standards None of the investigators had conflicts of interest to disclose. The study was conducted in accordance with the Declaration of Helsinki. According to French law regarding non-interventional studies, each patient and caregiver received oral and written information and their non-opposition was recorded by the investigator. This study was approved by the French National Commission for Data Protection and Freedom (Northwest 1 People Protection Committee). This trial was registered in ClinicalTrial.gov PRS with the ID APHP210724. Results Sample characteristics 696 patients were identified; 279 were not included due to the saturation of the investigators' inclusion possibilities, and 56 refused to participate. A total of 361 patients were included (26.6% were from consultation, 47.6% from day hospitals, and 25.8% from hospitalizations). The average age was 66 years and 53.2% were women. Most patients lived as a couple (64.9%). 71.4% patients declared having a main caregiver, usually a spouse or a partner (74.4%) (table 1 Table 1 Sociodemographic data, according to social vulnerability Total Patients with known social vulnerability status No social vulnerability Social vulnerability p Place of inclusion, N(%) 361 303 181 122 0.468 Consultation 96 (26.6) 85 (28.1) 51 (28.2) 34 (27.9) Day Hospital 172 (47.6) 149 (49.2) 93 (51.4) 56 (45.9) Hospitalization 93 (25.8) 69 (22.8) 37 (20.4) 32 (26.2) Age mean(std) 65.8 (12.5) 65.4(12.9) 66.2(12.8) 64.2(12.9) 0.192 med[IQ] 68.0 [58.0; 75.0] 67.0[57.0;74.5] 68.0[58.0;75.0] 66.5[56.0;73.0] min-max 24.0–93.0 24.0–93.0 28.0–93.0 24.0–88.0 Sex, N(%) 0.047 Women 192 (53.2) 159 (52.5) 86 (47.5) 73 (59.8) Men 169 (46.8) 144 (47.5) 95 (52.5) 49 (40.2) Marital Status, N(%) < 0.0001 Married 198 (58.9) 175 (58.3) 132 (73.3) 43 (35.8) Divorce or separated 57 (17.0) 51 (17.0) 19 (10.6) 32 (26.7) Never married 54 (16.1) 49 (16.3) 19 (10.6) 30 (25.0) Widower 27 (8.0) 25 (8.3) 10 (5.6) 15 (12.5) Missing 25 3 1 2 Living conditions, N(%) < 0.0001 Live with a spouse or partner 216 (64.9) 191 (64.1) 140 (77.8) 51 (43.2) Live with another person 35 (10.5) 34 (11.4) 11 (6.1) 23 (19.5) Live alone 82 (24.6) 73 (24.5) 29 (16.1) 44 (37.3) Missing 28 5 1 4 Presence of a caregiver, N(%) 0.003 Yes 242 (71.4) 214 (71.1) 140 (77.8) 74 (61.2) No 97 (28.6) 87 (28.9) 40 (22.2) 47 (38.8) Missing 22 2 1 1 If caregiver, live with the patient, N(%) 0.001 Yes 38 (18.2) 158 (83.2) 111 (90.2) 47 (70.1) No 171 (81.8) 32 (16.8) 12 (9.8) 20 (29.9) Missing 33 24 17 7 Connection to the patient, N(%) < 0.0001 Spouse or partner 163 (74.4) 150 (75.8) 113 (86.9) 37 (54.4) Child 30 (13.7) 27 (13.6) 12 (9.2) 15 (22.1) Other family member 21 (9.6) 16 (8.1) 3 (2.3) 13 (19.1) Friend/neighbor 5 (2.3) 5 (2.5) 2 (1.5) 3 (4.4) Missing 23 16 10 6 Educational level, N(%) < 0.0001 Level 1-2-3 121 (37.3) 43 (14.5) 27 (15.0) 16 (13.7) Level 4 45 (13.9) 112 (37.7) 52 (28.9) 60 (51.3) Level 5–6 81 (25.0) 73 (24.6) 47 (26.1) 26 (22.2) Level 7–8 77 (23.8) 69 (23.2) 54 (30.0) 15 (12.8) Missing 37 6 1 5 Social vulnerability (Score EPICES > 30) Yes 122 (40.3) No 181 (59.7) Missing 58 For each item, the number of missing data is indicated. Percentages and tests are calculated based on the number of data available. The “total” column present the results for the overall study population. The “patients with known social vulnerability status” column present the results for the population of patients for whom the social status is known (with or without social vulnerability). The statistical tests compare patients with or without social vulnerability The educational level is defined according to the International Standard Classification of Education: level 1-2-3 correspond to primary/lower secondary/upper secondary education, level 4 correspond to post-secondary non tertiary education, level 5–6 to short-cycle tertiary education and bachelor’s or equivalent, level 7–8 correspond to master’s and doctorate or equivalent Patients presented a good performance status with 27.5% of patients PS 0 and 40.4% of patients PS 1. The cancers were from various origins, mainly lungs, digestive system, pancreas, and skin. The median time between diagnosis and the first metastasis was 0.6 months. The median time from the first metastasis to the day of inclusion in the study was 13.5 months. Most patients (88.4%) patients had received systemic treatment in the last 30 days (56.2% chemotherapy, 33.8% immunotherapy, 7.5% targeted therapy, 5.8% hormonotherapy). 59.4% were undergoing their first or second line of systemic treatments. 28.3% of patients presented cachexia and 17.2% used strong opioids (table 2 Table 2 History of cancer and treatment, according to social vulnerability Total Patients with known social vulnerability status No social vulnerability Social vulnerability p Performance Status, N (%) 0.019 PS 0 90 (27.5) 83 (29.9) 62 (36.5) 21 (19.4) PS1 132 (40.4) 110 (39.6) 64 (37.6) 46 (42.6) PS2 81 (24.8) 66 (23.7) 33 (19.4) 33 (30.6) PS3 20 (6.1) 17 (6.1) 10 (5.9) 7 (6.5) PS4 4 (1.2) 2 (0.7) 1 (0.6) 1 (0.9) Missing 34 25 11 14 Type of cancer, N (%) 350 303 181 122 0.419 Gynecological 26 (7.2) 24 (7.9) 15 (8.3) 9 (7.4) Liver/biliary tracts 3 (0.8) 2 (0.7) 2 (1.1) 0 (0.0) ENT 7 (1.9) 6 (2.0) 1 (0.6) 5 (4.1) Pancreas 46 (12.7) 29 (9.6) 16 (8.8) 13 (10.7) Skin 42 (11.6) 41 (13.5) 26 (14.4) 15 (12.3) Lung 65 (18) 60 (19.8) 37 (20.4) 23 (18.9) Prostate 19 (5.3) 17 (5.6) 7 (3.9) 10 (8.2) Kidney 8 (2.2) 7 (2.3) 5 (2.8) 2 (1.6) Breast 39 (10.8) 32 (10.6) 17 (9.4) 15 (12.3) Digestive tract 65 (18) 50 (16.5) 32 (17.7) 18 (14.8) Other 41 (11.4) 35 (11.6) 23 (12.7) 12 (9.8) Time between diagnosis and the 1 st metastasis (months) Mean (std) 14.5 (34.6) 15.8 (36) 17.5 (32.3) 13.6 (40.4) 0.074 Med [IQ] 0.6 [0.0;14.2] 0.8 [0.0;16.1] 1.7 [0.0;18.5] 0.4 [0.0;10.9] min-max 0.0-345.4 0.0-345.4 0.0-170.7 0.0-345.4 Missing 104 86 58 28 Time between 1 st metastasis and day of inclusion (months) Mean (std) 24.6 (30.4) 24.6 (30.6) 25.7 (34.3) 23.2 (24.9) 0.854 Med[IQ] 13.5 [4.4;34.3] 13.5 [4.6;35.1] 16.0 [4.6;34.2] 12.4 [4.6;39.5] min-max 0.0-262.6 0.0-262.6 0.0-262.6 0.2-111.1 Missing 74 64 46 18 Treatment received in the past, N (%) Surgery 201 (55.7) 172 (56.8) 112 (61.9) 60 (49.2) 0.038 Radiotherapy 160 (44.3) 134 (44.2) 82 (45.3) 52 (42.6) 0.732 Systemic treatment 350 (97.0) 294 (97.0) 177 (97.8) 117 (95.9) 0.492 Simple monitoring 6 (1.7) 5 (1.7) 2 (1.1) 3 (2.5) 0.395 Palliative care only 1 (0.3) 1 (0.3) 1 (0.6) 0 (0.0) > 0.99 Systemic treatment in the last 30 days, N (%) 319 (88.4) 267 (88.1) 165 (91.2) 102 (83.6) 0.07 Number of previous treatment lines, N (%) 0.973 0 or 1 208 (59.4) 172 (58.5) 105 (59.3) 67 (57.3) 2 Lines 66 (18.9) 59 (20.1) 35 (19.8) 24 (20.5) 3 Lines 37 (10.6) 30 (10.2) 17 (9.6) 13 (11.1) More of 4 Lines 39 (11.1) 33 (11.2) 20 (11.3) 13 (11.1) Missing 11 9 4 5 Type of systemic treatment (in the last 30 days), N (%) 319 267 Chemotherapy 151 (47.3) 123 (46.1) 80 (44.2) 43 (35.2) 0.151 Immunotherapy 73 (22.9) 65 (24.3) 38 (21.0) 27 (22.1) 0.925 Targeted therapy 23 (7.2) 21 (7.9) 14 (7.7) 7 (5.7) 0.659 Hormonotherapy 18 (5.6) 12 (4.5) 6 (3.3) 6 (4.9) 0.554 Combined systemic therapy 54 (16.9) 46 (17.2) 27 (14.9) 19 (15.6) > 0.99 Cachexia (> 5% weight loss in past 3 months), N (%) 0.079 Cachexia 89 (28.3) 73 (27.4) 38 (23.3) 35 (34.0) Missing 47 37 18 19 Need for strong opioids, N (%) 62 (17.2) 52 (17.2) 27 (14.9) 25 (20.5) 0.268 For each item, the number of missing data is indicated. Percentages and tests are calculated based on the number of data available. The “total” column present the results for the overall study population. The “patients with known social vulnerability status” column present the results for the population of patients for whom the social status is known (with or without social vulnerability). The statistical tests compare patients with or without social vulnerability Supportive and palliative care needs of patients Among the functional and symptom scales of the EORTC-QLQC30, the most frequent symptoms were fatigue (51.8%moderate and 24.1% severe), insomnia (48.5% moderate and 12.7% severe), dyspnea (49.1% being moderate and 7.3% severe), and pain (44.7% moderate and 9.7% severe). The global health status showed that 11.9% of patients scored low on quality of life, while 61.1% scored moderately (table 3 1 Table 3 Healthcare needs: results of the EORTC-QLQ C30, according to social vulnerability Domain Total Patients with known social vulnerability status No social vulnerability Social vulnerability p Physical functioning No or minor problem (%) 188 (56.8) 177 (58.4) 115 (63.5) 62 (50.8) 0.085 Moderate problem (%) 103 (31.1) 91 (30.0) 47 (26.0) 44 (36.1) Severe problem (%) 40 (12.1) 35 (11.6) 19 (10.5) 16 (13.1) Missing 30 0 0 0 Role functioning No or minor problem (%) 186 (56.2) 171 (56.4) 111 (61.3) 60 (49.2) 0.096 Moderate problem (%) 88 (26.6) 82 (27.1) 45 (24.9) 37 (30.3) Severe problem (%) 57 (17.2) 50 (16.5) 25 (13.8) 25 (20.5) Missing 30 0 0 0 Emotional functioning No or minor problem (%) 199 (60.3) 185 (61.5) 119 (66.1) 66 (54.5) 0.061 Moderate problem (%) 102 (30.9) 92 (30.6) 51 (28.3) 41 (33.9) Severe problem (%) 29 (8.8) 24 (8.0) 10 (5.6) 14 (11.6) Missing 31 2 1 1 Cognitive functioning No or minor problem (%) 221 (66.8) 205 (67.9) 127 (70.6) 78 (63.9) 0.478 Moderate problem (%) 99 (29.9) 89 (29.5) 49 (27.2) 40 (32.8) Severe problem (%) 11 (3.3) 8 (2.6) 4 (2.2) 4 (3.3) Missing 30 1 1 0 Social functioning No or minor problem (%) 148 (44.7) 140 (46.4) 92 (51.1) 48 (39.3) 0.063 Moderate problem (%) 135 (40.8) 122 (40.4) 63 (35.0) 59 (48.4) Severe problem (%) 48 (14.5) 40 (13.2) 25 (13.9) 15 (12.3) Missing 30 1 1 0 Fatigue No or minor problem (%) 80 (24.1) 75 (24.8) 52 (28.7) 23 (18.9) 0.148 Moderate problem (%) 172 (51.8) 159 (52.5) 90 (49.7) 69 (56.6) Severe problem (%) 80 (24.1) 69 (22.8) 39 (21.5) 30 (24.6) Missing 29 0 0 0 Nausea and vomiting No or minor problem (%) 269 (81.3) 249 (82.5) 157 (86.7) 92 (76.0) 0.056 Moderate problem (%) 50 (15.1) 45 (14.9) 20 (11.0) 25 (20.7) Severe problem (%) 12 (3.6) 8 (2.6) 4 (2.2) 4 (3.3) Missing 30 1 0 1 Pain No or minor problem (%) 151 (45.6) 138 (45.7) 89 (49.4) 49 (40.2) 0.177 Moderate problem (%) 148 (44.7) 134 (44.4) 72 (40.0) 62 (50.8) Severe problem (%) 32 (9.7) 30 (9.9) 19 (10.6) 11 (9.0) Missing 30 1 1 0 Dyspnea No or minor problem (%) 143 (43.6) 126 (41.9) 85 (47.2) 41 (33.9) 0.029 Moderate problem (%) 161 (49.1) 151 (50.2) 79 (43.9) 72 (59.5) Severe problem (%) 24 (7.3) 24 (8.0) 16 (8.9) 8 (6.6) Missing 33 2 1 1 Insomnia No or minor problem (%) 128 (38.8) 119 (39.5) 73 (40.6) 46 (38.0) 0.823 Moderate problem (%) 160 (48.5) 146 (48.5) 87 (48.3) 59 (48.8) Severe problem (%) 42 (12.7) 36 (12.0) 20 (11.1) 16 (13.2) Missing 31 2 1 1 Appetite loss No or minor problem (%) 152 (46.5) 142 (47.5) 95 (53.4) 47 (38.8) 0.043 Moderate problem (%) 122 (37.3) 113 (37.8) 61 (34.3) 52 (43.0) Severe problem (%) 53 (16.2) 44 (14.7) 22 (12.4) 22 (18.2) Missing 34 4 3 1 Constipation No or minor problem (%) 198 (60.0) 179 (59.5) 112 (62.2) 67 (55.4) 0.138 Moderate problem (%) 99 (30.0) 92 (30.6) 55 (30.6) 37 (30.6) Severe problem (%) 33 (10.0) 30 (10.0) 13 (7.2) 17 (14.0) Missing 31 2 1 1 Diarrhoea No or minor problem (%) 214 (64.7) 197 (65.2) 119 (66.1) 78 (63.9) 0.532 Moderate problem (%) 97 (29.3) 86 (28.5) 52 (28.9) 34 (27.9) Severe problem (%) 20 (6.0) 19 (6.3) 9 (5.0) 10 (8.2) Missing 30 1 1 0 Financial difficulties No or minor problem (%) 259 (79.0) 239 (79.7) 155 (86.1) 84 (70.0) < 0.0001 Moderate problem (%) 56 (17.1) 50 (16.7) 24 (13.3) 26 (21.7) Severe problem (%) 13 (4.0) 11 (3.7) 1 (0.6) 10 (8.3) Missing 33 3 1 2 Global health status/QoL Low QoL (%) 39 (11.9) 32 (10.7) 20 (11.2) 12 (9.9) 0.074 Moderate QoL (%) 201 (61.1) 186 (62.0) 102 (57.0) 84 (69.4) High QoL (%) 89 (27.1) 82 (27.3) 57 (31.8) 25 (20.7) Missing 32 3 2 1 EORTC-QLQ-C30 Low level (%) 14 (4.4) 12 (4.1) 7 (4.0) 5 (4.2) 0.058 Moderate level (%) 107 (33.5) 97 (33.0) 48 (27.6) 49 (40.8) High level (%) 198 (62.1) 185 (62.9) 119 (68.4) 66 (55.0) Missing 42 9 7 2 Percentages and tests are calculated based on the number of data available. We defined that a patient had “no or a minor symptom/problem” if the scale score was < 33.3 for the symptom scales or ≥ 66.7 for the function scales, a “moderate symptom/problem” if the scale score was between 33.3 and 66.7 for the symptom scales or the function scales, and a “severe symptom/problem” if the score was at least ≥ 66.7 for the symptom scales or < 33.3 for the function scales. The “total” column present the results for the overall study population. The “patients with known social vulnerability status” column present the results for the population of patients for whom the social status is known (with or without social vulnerability). The statistical tests compare patients with or without social vulnerability  Fig. 1 Prevalence of the number of moderate or severe symptoms/problems per patient, out of the 14 scales of the EORTC-QLQ C30 self-questionnaire (5 functional scales and 9 symptom scales) The abscissa represents the number of moderate or severe symptoms/problems on the EORTC questionnaire, and the ordinate the percentage of patients The most important unmet needs assessed by the SCNS-SF34 were psychological needs (34.9% moderate and 16.5% severe needs), and then physical and daily living needs, health system and information needs, sexuality needs, and finally patient care and support needs. A total of 82.1% of patients reported at least 1 unmet need (table 4 Table 4 Unmet needs: SCNS-SF34, according to social vulnerability Domain Total Patients with known social vulnerability status No social vulnerability Social vulnerability p Psychological needs No or minor needs (%) 159 (48.6) 151 (50.0) 97 (53.6) 54 (44.6) 0.202 Moderate needs (%) 114 (34.9) 105 (34.8) 61 (33.7) 44 (36.4) Severe needs (%) 54 (16.5) 46 (15.2) 23 (12.7) 23 (19.0) Missing 34 1 0 1 Health system and information needs No or minor needs (%) 205 (63.9) 194 (64.9) 122 (68.2) 72 (60.0) 0.322 Moderate needs (%) 86 (26.8) 79 (26.4) 42 (23.5) 37 (30.8) Severe needs (%) 30 (9.3) 26 (8.7) 15 (8.4) 11 (9.2) Missing 40 4 2 2 Physical and daily living needs No or minor needs (%) 184 (56.4) 176 (58.7) 121 (66.9) 55 (46.2) 0.001 Moderate needs (%) 95 (29.1) 84 (28.0) 39 (21.5) 45 (37.8) Severe needs (%) 47 (14.4) 40 (13.3) 21 (11.6) 19 (16.0) Missing 35 3 0 3 Patient care and support needs No or minor needs (%) 248 (77.0) 232 (77.1) 141 (78.3) 91 (75.2) 0.657 Moderate needs (%) 59 (18.3) 55 (18.3) 30 (16.7) 25 (20.7) Severe needs (%) 15 (4.7) 14 (4.7) 9 (5.0) 5 (4.1) Missing 39 2 1 1 Sexuality needs No or minor needs (%) 202 (65.2) 194 (66.7) 111 (63.4) 83 (71.6) 0.13 Moderate needs (%) 75 (24.2) 68 (23.4) 48 (27.4) 20 (17.2) Severe needs (%) 33 (10.6) 29 (10.0) 16 (9.1) 13 (11.2) Missing 51 12 6 6 Total No Need- not applicable or satisfied for all items (%) 59 (17.9) At least 1 non satisfied need (%) 271 (82.1) Missing 31 For each item, the number of missing data is indicated. Percentages and tests are calculated based on the number of data available. We defined that a patient had “no or minor needs” if the score was < 33.3, “moderate needs” if the score was between 33.3 and 66.7, “severe needs” if the score was at least ≥ 66.7. The “total” column present the results for the overall study population. The “patients with known social vulnerability status” column present the results for the population of patients for whom the social status is known (with or without social vulnerability). The statistical tests compare patients with or without social vulnerability Healthcare services use 28.6% of patients had met a coordinating hospital nurse. 19.1% were followed by a psychologist in a hospital and 7.6% were in home-based care. 32.2% met a dietitian in a hospital and 6.1% at home. Physiotherapists were involved in the care of 16.2% of patients in a hospital and 20.1% in home-based-care. General practitioners were involved in the care of 47% of the patients. 26.8% of patients had visited the emergency room and 38.5% had been admitted to the hospital in the last three months for a cancer complication (table 5 Table 5 Healthcare use, according to social vulnerability Total Patients with known social vulnerability status No social vulnerability Social vulnerability p Hospital care in the last 3 months Consultant Yes (%) 137 (41.6) 127 (42.5) 83 (46.1) 44 (37.0) 0.148 Missing 32 4 1 3 Coordinating nurse Yes (%) 94 (28.6) 87 (29.1) 53 (29.4) 34 (28.6) 0.974 Missing 32 4 1 3 Physiotherapist Yes (%) 53 (16.2) 49 (16.4) 27 (15.1) 22 (18.5) 0.537 Missing 33 5 2 3 Psychologist Yes (%) 63 (19.1) 58 (19.4) 30 (16.7) 28 (23.5) 0.187 Missing 32 4 1 3 Dietitian Yes (%) 106 (32.2) 97 (32.4) 57 (31.7) 40 (33.6) 0.821 Missing 32 4 1 3 Social worker Yes (%) 34 (10.3) 31 (10.4) 11 (6.1) 20 (16.8) 0.006 Missing 32 4 1 3 Toilet help Yes (%) 37 (11.2) 33 (11.0) 22 (12.2) 11 (9.2) 0.538 Missing 32 4 1 3 Home-based care in the last 3 months General practitioner Yes (%) 155 (47.0) 143 (47.7) 88 (48.9) 55 (45.8) 0.688 Missing 31 3 1 2 Consultant Yes (%) 72 (21.9) 67 (22.4) 43 (24.0) 24 (20.0) 0.499 Missing 32 4 2 2 Hospital-at-home Yes (%) 17 (5.2) 15 (5.0) 3 (1.7) 12 (10.0) 0.003 Missing 32 4 2 2 Liberal nurse Yes (%) 146 (44.2) 134 (44.7) 85 (47.2) 49 (40.8) 0.331 Missing 31 3 1 2 Physiotherapist Yes (%) 66 (20.1) 63 (21.1) 34 (19.0) 29 (24.2) 0.352 Missing 32 4 2 2 Psychologist Yes (%) 25 (7.6) 24 (8.0) 13 (7.3) 11 (9.2) 0.706 Missing 32 4 2 2 Dietitian Yes (%) 20 (6.1) 19 (6.4) 9 (5.0) 10 (8.3) 0.365 Missing 32 4 2 2 Social worker Yes (%) 9 (2.7) 9 (3.0) 2 (1.1) 7 (5.8) 0.033 Missing 32 4 2 2 Toilet help Yes (%) 5 (1.5) 5 (1.7) 2 (1.1) 3 (2.5) 0.394 Missing 32 4 2 2 Life auxiliary Yes (%) 6 (1.8) 6 (2.0) 2 (1.1) 4 (3.3) 0.223 Missing 32 4 2 2 Meal delivery Yes (%) 3 (0.9) 3 (1.0) 3 (1.7) 0 (0.0) > 0.99 Missing 31 3 1 2 Housekeeper Yes (%) 28 (8.5) 27 (9.0) 16 (8.9) 11 (9.2) > 0.99 Missing 31 3 1 2 Unscheduled care Emergency department consultation in the last 3 months Yes (%) 87 (26.8) 78 (25.8) 46 (25.4) 32 (26.4) 0.947 Missing 36 1 0 1 Hospitalization due to cancer in the last 3 months Yes (%) 125 (38.5) 113 (37.5) 61 (33.7) 52 (43.3) 0.117 Missing 36 2 0 2 For each item, the number of missing data is indicated. Percentages and tests are calculated based on the number of data available. The “total” column present the results for the overall study population. The “patients with known social vulnerability status” column present the results for the population of patients for whom the social status is known (with or without social vulnerability). The statistical tests compare patients with or without social vulnerability Social vulnerability Social vulnerability (EPICES>30) was present in 40.3% of patients (table 1 1 2 2 2 3 3 4 In multivariate analysis, high social vulnerability was significantly associated with cachexia (OR 2.43, IC 1.16-5.09), being divorced/separated (OR 5.22, IC 2.29-11.87), never married (OR 5.92, IC 2.47-14.18) or widowed (OR 4.27, IC 1.54-11.81), having a low educational level, especially for the lowest educational level (OR between 2.60 and 5.33, p<0.05). They more often benefited from hospitalization at home (OR 4.37, IC 1.04-18.31). Patients with high social vulnerability had received less surgery in the past (OR 0.46, IC 0.25-0.83, p=0.010) and less systemic treatment in the last 30 days (OR 0.34, IC 0.14-0.81, p=0.015) (table 6 Table 6 Factors associated with social vulnerability: multivariate analysis Characteristics OR (IC 95%, p Nutritional status : cachexia (> 5% weight loss in past 3 months) 2.43 (1.16–5.09, p Sex Men 0.63 (0.35–1.15, p Hospital care in the last 3 months : Social worker 2.16 (0.87–5.37, p Home-based care in the last 3 months : Hospital-at-home 4.37 (1.04–18.31, p Systemic treatment in the last 30 days 0.34 (0.14–0.81, p Surgical treatment received in the past 0.46 (0.25–0.83, p Presence of a caregiver 0.61 (0.31–1.20, p Level of study Level 1-2-3 5.33 (2.28–12.47, p Level 4 3.27 (1.16–9.22, p Level 5–6 2.60 (1.03–6.54, p Level 7–8 - Marital Status Divorce or separated 5.22 (2.29–11.87, p Never married 5.92 (2.47–14.18, p Widower 4.27 (1.54–11.81, p Married - Financial difficulties No or minor problem 0.09 (0.01–0.75, p Moderate problem 0.13 (0.01–1.18, p Severe problem - Dyspnea No or minor problem 0.80 (0.27–2.37, p Moderate problem 1.74 (0.60–5.01, p Severe problem - Multivariate analysis with a logistic regression model with stepwise selection on imputed data, adjusted for all variables with a p-value < 0.1 in univariate analysis. Significant results are marked with * Discussion With this cross-sectional study, we found that patients with metastatic cancer, especially those with good performance status, have many concomitant health issues and unmet needs with a high level of hospital-based care. These patients also frequently expressed their need for help in dealing with daily activities and psychological health. Patients with social vulnerability seemed to have more severe conditions at diagnosis but similar unmet needs during follow-up. Most often, their care pathways included less systemic treatment and more frequent home hospitalization. The study population was mainly represented by fit patients, as demonstrated by their performance status. The large recruitment from the ambulatory sector, where patients tend to be in better health condition, could explain this result. Nevertheless, those selected had many interrelated healthcare problems represented mainly by physical symptoms like fatigue and psychological frailty. Fatigue is one of the most common and distressing side effects of cancer and its treatment, sometimes leading to treatment discontinuation [ 18 19 20 21 22 Our results showed that patients with metastatic cancer reported significant unmet needs, represented mainly by psychological needs, as it has been shown in precedent studies [ 4 23 23 24 25 Considering the complex and interrelated nature of “hidden” healthcare needs, these patients should be systematically screened using a validated and comprehensive self-assessment tool to provide a good quality level of information. Web-based symptom monitoring showed benefits on the quality of life and survival rates of patients with advanced cancer. It is a promising way to improve clinical practice [ 26 27 . 11 The healthcare services mobilized were mainly hospital-based, with frequent emergency department (ED) visits and hospitalizations due to cancer in the three previous months. In the literature, the percentage of cancer patients with ED visits depended on the origin and stage of the cancer and the time from diagnosis [ 28 29 30 29 31 32 33 34 35 36 40 The large proportion of socially vulnerable patients in our study could be explained by their recruitment in public hospitals where all healthcare costs are covered by health insurance. We cannot rule out the possibility that the EPICES score, developed for the general population, may be too sensitive for a population of cancer patients. Some questions may not be suitable for patients whose access to leisure activities or holidays, for example, might be limited by health condition and not actual social precariousness. Nevertheless, in multivariate analysis, social vulnerability was independently associated with cachexia, living alone, having a lower education level, and not with poor physical condition, suggesting the EPICES score tended to detect true social precariousness and not only less favorable health conditions. In fact, the risk of cachexia can be increased by living alone, without caregiver intervention to stimulate food intake. Moreover, vulnerable patients seemed to have more severe conditions at diagnosis. The time between diagnosis and the first metastasis tended to be shorter in univariate analysis. In the multivariate analysis the care interventions differ with less history of surgical treatment, less recent systemic treatment and more frequent Hospital-at-home (HaH). These results suggest that the patients could have a late diagnosis, already presenting locally advanced or metastatic cancer. In 2013, a review reported that patients with social disadvantages had more difficulties accessing primary and secondary care and received less aggressive care for their cancer [ 41 Our study presents several limitations. First the design of the study did not allow the completely random recruitment of patients. Most patients were recruited in ambulatory settings (day hospitals and consultation) resulting in our study population being mostly made up of patients with good functional status. This result could be explained by asthenia in hospitalized patients, who were not fit enough to fill out a long self-questionnaire. This recruitment bias may have caused an underestimation of patient needs, particularly for those at an advanced phase of cancer. This should be kept in mind when considering which health organizations to involve. Furthermore, in the embedded clinics involved, the choice of the service where the study was carried out was left to the discretion of the investigators. The investigators may have chosen to carry out the study in departments they were accustomed to work with, where patient needs could be better addressed. In addition, the median time between diagnosis of first metastasis and inclusion was 13.5 months, which seems long considering the prognosis of certain primary cancers like metastatic lung and pancreatic cancer. We observe a probable survival bias and may have included more indolent cancers requiring less healthcare needs. Finally, considering the number of missing data for certain variables, our study may sometimes have lacked statistical power. Despite these limitations, this is one of the first studies to analyze the overall health status of metastatic cancer patients with good functional status, and in relation to social vulnerability. These results can help us better identify the supportive care needs of patients with metastatic cancer, as well as the healthcare interventions required to meet them. Conclusion Our study highlights the frequent and complex entanglement of healthcare needs with a high rate of hospitalisation for patients with metastatic cancer, even with good performance status. Despite universal healthcare coverage, socially precarious patients seem to have a later diagnosis and less systemic treatment. Additionally, they have the same unmet needs but receive more intense medical and social care at home. The early systematic self-screening of complex needs using a comprehensive tool appears necessary for metastatic cancer patients to identify the appropriate health resources required. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We thank the Fondation de France and the Ile-de-France regional health agency which financed the study, the staff of the Clinical Research Unit AP-HP Paris Saclay Ouest, Gabriela Lopes who provided English proofreading and the Assistance Publique – Hôpitaux de Paris (Délégation à la Recherche Clinique et à l’Innovation) who was the promoter. Key message This observational, multicentric, cross-sectional study showed that patients with metastatic cancer, even with good performance status, had numerous healthcare needs. Despite universal health insurance, socially vulnerable patients seemed to have late diagnosis and less systemic treatment. A systematic screening of supportive care needs would allow targeted care interventions. Authors’ contributions All authors contributed to the study conception and design. Material preparation, data collection, and analysis were performed by Marine Sahut d’Izarn, Pascale Vinant, Carole Bouleuc, Ingrid Joffin, Bruno Vincent, Laure Seresse, Aurore Codogno, Florence Behal, Madalina Jacota and Malamine Gassama. The first draft of the manuscript was written by Marine Sahut d’Izarn and Matthieu de Stampa and all authors commented on previous versions of the manuscript. Lucie Ya de Rauglaudre provided English proofreading. All authors read and approved the final manuscript. Funding The sponsor was Assistance Publique – Hôpitaux de Paris (Délégation à la Recherche Clinique et à l’Innovation). The study was funded by the Fondation de France and the Ile-de-France regional health agency. Data availability all data supporting the findings of this study are available within the paper. Detailed data are available upon reasonable request. The procedures carried out with the French data privacy authority (CNIL, Commission nationale de l’informatique et des libertés) and the european regulation (GDPR) do not provide for the transmission of the database, nor do the information and consent documents signed by the patients. Consultation by the editorial board or interested researchers of individual participant data that underlie the results reported in the article after deidentification may nevertheless be considered, subject to prior determination of the terms and conditions of such consultation and in respect for compliance with the applicable regulations. Declarations Ethics approval and consent to participate The study was conducted in accordance with the Declaration of Helsinki. This study was approved by a French ethics committee (Northwest 1 People Protection Committee). Non opposition was obtained from all individual participants included in the study, in accordance with the French law on non-interventional studies. Consent for publication Not applicable. Competing interests The authors have no competing interests to declare that are relevant to the contents of this article. References 1. Données globales d’épidémiologie des cancers - Epidémiologie. des cancers Available from: https://www.e-cancer.fr/Professionnels-de-sante/Les-chiffres-du-cancer-en-France/Epidemiologie-des-cancers/Donnees-globales 2. Mollica MA Smith AW Tonorezos E Survivorship for individuals living with advanced and metastatic cancers: national cancer Institute meeting report J Natl Cancer Inst 2021 114 489 95 10.1093/jnci/djab223 PMC9002286 34878107 Mollica MA, Smith AW, Tonorezos E, et al. Survivorship for individuals living with advanced and metastatic cancers: national cancer Institute meeting report. J Natl Cancer Inst. 2021;114:489–95. 10.1093/jnci/djab223 PMC9002286 34878107 3. Moghaddam N Coxon H Nabarro S Unmet care needs in people living with advanced cancer: a systematic review Support Care Cancer 2016 24 3609 22 27137214 10.1007/s00520-016-3221-3 Moghaddam N, Coxon H, Nabarro S, et al. Unmet care needs in people living with advanced cancer: a systematic review. Support Care Cancer. 2016;24:3609–22. 27137214 10.1007/s00520-016-3221-3 4. Wang T Molassiotis A Chung BPM Unmet care needs of advanced cancer patients and their informal caregivers: a systematic review BMC Palliat Care 2018 17 96 30037346 10.1186/s12904-018-0346-9 PMC6057056 Wang T, Molassiotis A, Chung BPM, et al. Unmet care needs of advanced cancer patients and their informal caregivers: a systematic review. BMC Palliat Care. 2018;17:96. 30037346 10.1186/s12904-018-0346-9 PMC6057056 5. Mah JC Penwarden JL Pott H Social vulnerability indices: a scoping review BMC Public Health 2023 23 1253 37380956 10.1186/s12889-023-16097-6 PMC10304642 Mah JC, Penwarden JL, Pott H, et al. Social vulnerability indices: a scoping review. BMC Public Health. 2023;23:1253. 37380956 10.1186/s12889-023-16097-6 PMC10304642 6. Hart NH Crawford-Williams F Crichton M Unmet supportive care needs of people with advanced cancer and their caregivers: a systematic scoping review Crit Rev Oncol Hematol 2022 176 103728 35662585 10.1016/j.critrevonc.2022.103728 Hart NH, Crawford-Williams F, Crichton M, et al. Unmet supportive care needs of people with advanced cancer and their caregivers: a systematic scoping review. Crit Rev Oncol Hematol. 2022;176:103728. 35662585 10.1016/j.critrevonc.2022.103728 7. Hall A D’Este C Tzelepis F Factors associated with haematological cancer survivors experiencing a high level of unmet need across multiple items of supportive care: a cross-sectional survey study Support Care Cancer 2014 22 2899 909 24828759 10.1007/s00520-014-2264-6 Hall A, D’Este C, Tzelepis F, et al. Factors associated with haematological cancer survivors experiencing a high level of unmet need across multiple items of supportive care: a cross-sectional survey study. Support Care Cancer. 2014;22:2899–909. 24828759 10.1007/s00520-014-2264-6 8. Sass C, Dupré C, Giordanella JP et al. Le score epices: Un score individuel de précarité. Construction du score et mesure des relations avec des Données de santé, Dans Une population de 197 389 personnes. Bulletin Epidemiologique Hebdomadaire, Institut de Veille Sanitaire 2006;14. 9. Sass C Guéguen R Moulin J-J Comparaison du score individuel de précarité des centres d’examens de santé, EPICES, à La définition socio-administrative de La précarité Santé Publique 2006 18 513 22 17294755 10.3917/spub.064.0513 Sass C, Guéguen R, Moulin J-J, et al. Comparaison du score individuel de précarité des centres d’examens de santé, EPICES, à La définition socio-administrative de La précarité. Santé Publique. 2006;18:513–22. 17294755 10.3917/spub.064.0513 10. Abrantes P, Sabatier S, Guenot C. Centre technique d’appui et de formation des Centres d’examens de sante. 2005 11. Hui D Mori M Watanabe SM Referral criteria for outpatient specialty palliative cancer care: an international consensus Lancet Oncol 2016 17 e552 9 27924753 10.1016/S1470-2045(16)30577-0 Hui D, Mori M, Watanabe SM, et al. Referral criteria for outpatient specialty palliative cancer care: an international consensus. Lancet Oncol. 2016;17:e552–9. 27924753 10.1016/S1470-2045(16)30577-0 12. Aaronson NK Ahmedzai S Bergman B The European organization for research and treatment of cancer QLQ-C30: a quality-of-life instrument for use in international clinical trials in oncology J Natl Cancer Inst 1993 85 365 76 8433390 10.1093/jnci/85.5.365 Aaronson NK, Ahmedzai S, Bergman B, et al. The European organization for research and treatment of cancer QLQ-C30: a quality-of-life instrument for use in international clinical trials in oncology. J Natl Cancer Inst. 1993;85:365–76. 8433390 10.1093/jnci/85.5.365 13. Kaasa S Bjordal K Aaronson N The EORTC core quality of life questionnaire (QLQ-C30): validity and reliability when analysed with patients treated with palliative radiotherapy Eur J Cancer 1995 31A 2260 3 8652253 10.1016/0959-8049(95)00296-0 Kaasa S, Bjordal K, Aaronson N, et al. The EORTC core quality of life questionnaire (QLQ-C30): validity and reliability when analysed with patients treated with palliative radiotherapy. Eur J Cancer. 1995;31A:2260–3. 8652253 10.1016/0959-8049(95)00296-0 14. Brédart A Kop J-L Griesser A-C Validation of the 34-item supportive care needs survey and 8-item breast module French versions (SCNS-SF34-Fr and SCNS-BR8-Fr) in breast cancer patients: validation of the SCNS-SF34 and BR8 French version in breast cancer patients Eur J Cancer Care 2012 21 450 9 10.1111/j.1365-2354.2012.01356.x 22571471 Brédart A, Kop J-L, Griesser A-C, et al. Validation of the 34-item supportive care needs survey and 8-item breast module French versions (SCNS-SF34-Fr and SCNS-BR8-Fr) in breast cancer patients: validation of the SCNS-SF34 and BR8 French version in breast cancer patients. Eur J Cancer Care. 2012;21:450–9. 10.1111/j.1365-2354.2012.01356.x 22571471 15. Fayers P, Aaronson N, Bjordal K et al. EORTC QLQ-C30 Scoring Manual. Third Edition, 2001. 16. Johnsen A Petersen M Pedersen L Symptoms and problems in a nationally representative sample of advanced cancer patients Palliat Med 2009 23 491 501 19443525 10.1177/0269216309105400 Johnsen A, Petersen M, Pedersen L, et al. Symptoms and problems in a nationally representative sample of advanced cancer patients. Palliat Med. 2009;23:491–501. 19443525 10.1177/0269216309105400 17. Wood AM White IR Royston P How should variable selection be performed with multiply imputed data? Stat Med 2008 27 3227 46 18203127 10.1002/sim.3177 Wood AM, White IR, Royston P. How should variable selection be performed with multiply imputed data? Stat Med. 2008;27:3227–46. 18203127 10.1002/sim.3177 18. Lawrence DP, Kupelnick B, Miller K et al. Evidence report on the occurrence, assessment, and treatment of fatigue in cancer patients. J Natl Cancer Inst Monogr. 2004;32:40–50. 10.1093/jncimonographs/lgh027 15263040 19. Tavio M Milan I Tirelli U Cancer-related fatigue (review) Int J Oncol 2002 21 1093 9 12370760 Tavio M, Milan I, Tirelli U. Cancer-related fatigue (review). Int J Oncol. 2002;21:1093–9. 12370760 20. Janah A Bouhnik A-D Touzani R Underprescription of step III opioids in French cancer survivors with chronic pain: a call for integrated early palliative care in oncology J Pain Symptom Manage 2020 59 836 47 31707070 10.1016/j.jpainsymman.2019.10.027 Janah A, Bouhnik A-D, Touzani R, et al. Underprescription of step III opioids in French cancer survivors with chronic pain: a call for integrated early palliative care in oncology. J Pain Symptom Manage. 2020;59:836–47. 31707070 10.1016/j.jpainsymman.2019.10.027 21. Chang VT Hwang SS Feuerman M Symptom and quality of life survey of medical oncology patients at a veterans affairs medical center: a role for symptom assessment Cancer 2000 88 1175 83 10699909 10.1002/(sici)1097-0142(20000301)88:5<1175::aid-cncr30>3.0.co;2-n Chang VT, Hwang SS, Feuerman M, et al. Symptom and quality of life survey of medical oncology patients at a veterans affairs medical center: a role for symptom assessment. Cancer. 2000;88:1175–83. 10699909 10.1002/(sici)1097-0142(20000301)88:5<1175::aid-cncr30>3.0.co;2-n 22. Portenoy RK Thaler HT Kornblith AB Symptom prevalence, characteristics and distress in a cancer population Qual Life Res 1994 3 183 9 7920492 10.1007/BF00435383 Portenoy RK, Thaler HT, Kornblith AB, et al. Symptom prevalence, characteristics and distress in a cancer population. Qual Life Res. 1994;3:183–9. 7920492 10.1007/BF00435383 23. Bağçivan G Seven M Paşalak Şİ Palliative care needs of the cancer patients receiving active therapy Support Care Cancer 2022 30 749 56 34370103 10.1007/s00520-021-06485-2 Bağçivan G, Seven M, Paşalak Şİ, et al. Palliative care needs of the cancer patients receiving active therapy. Support Care Cancer. 2022;30:749–56. 34370103 10.1007/s00520-021-06485-2 24. Wang K Ariello K Choi M Sexual healthcare for cancer patients receiving palliative care: a narrative review Ann Palliat Med 2018 7 256 64 29156921 10.21037/apm.2017.10.05 Wang K, Ariello K, Choi M, et al. Sexual healthcare for cancer patients receiving palliative care: a narrative review. Ann Palliat Med. 2018;7:256–64. 29156921 10.21037/apm.2017.10.05 25. Kelemen A Van Gerven C Mullins K Sexuality and intimacy needs within a hospitalized palliative care population: results from a qualitative study Am J Hosp Palliat Care 2022 39 433 7 34372687 10.1177/10499091211036928 Kelemen A, Van Gerven C, Mullins K, et al. Sexuality and intimacy needs within a hospitalized palliative care population: results from a qualitative study. Am J Hosp Palliat Care. 2022;39:433–7. 34372687 10.1177/10499091211036928 26. Basch E Deal AM Kris MG Symptom monitoring with patient-reported outcomes during routine cancer treatment: a randomized controlled trial J Clin Oncol 2016 34 557 65 26644527 10.1200/JCO.2015.63.0830 PMC4872028 Basch E, Deal AM, Kris MG, et al. Symptom monitoring with patient-reported outcomes during routine cancer treatment: a randomized controlled trial. J Clin Oncol. 2016;34:557–65. 26644527 10.1200/JCO.2015.63.0830 PMC4872028 27. Basch E Deal AM Dueck AC Overall survival results of a trial assessing patient-reported outcomes for symptom monitoring during routine cancer treatment JAMA 2017 318 197 8 28586821 10.1001/jama.2017.7156 PMC5817466 Basch E, Deal AM, Dueck AC, et al. Overall survival results of a trial assessing patient-reported outcomes for symptom monitoring during routine cancer treatment. JAMA. 2017;318:197–8. 28586821 10.1001/jama.2017.7156 PMC5817466 28. Lash RS Bell JF Reed SC A systematic review of emergency department use among cancer patients Cancer Nurs 2017 40 135 44 26925998 10.1097/NCC.0000000000000360 PMC5001935 Lash RS, Bell JF, Reed SC, et al. A systematic review of emergency department use among cancer patients. Cancer Nurs. 2017;40:135–44. 26925998 10.1097/NCC.0000000000000360 PMC5001935 29. Rivera DR Gallicchio L Brown J Trends in adult cancer-related emergency department utilization: an analysis of data from the nationwide emergency department sample JAMA Oncol 2017 3 e172450 28859189 10.1001/jamaoncol.2017.2450 PMC5824316 Rivera DR, Gallicchio L, Brown J, et al. Trends in adult cancer-related emergency department utilization: an analysis of data from the nationwide emergency department sample. JAMA Oncol. 2017;3:e172450. 28859189 10.1001/jamaoncol.2017.2450 PMC5824316 30. Hsu J Donnelly JP Moore JX National characteristics of emergency department visits by patients with cancer in the united States Am J Emerg Med 2018 36 2038 43 29573899 10.1016/j.ajem.2018.03.025 PMC6988579 Hsu J, Donnelly JP, Moore JX, et al. National characteristics of emergency department visits by patients with cancer in the united States. Am J Emerg Med. 2018;36:2038–43. 29573899 10.1016/j.ajem.2018.03.025 PMC6988579 31. Weidner TK Kidwell JT Etzioni DA Factors associated with emergency department utilization and admission in patients with colorectal cancer J Gastrointest Surg 2018 22 913 20 29435901 10.1007/s11605-018-3707-z Weidner TK, Kidwell JT, Etzioni DA, et al. Factors associated with emergency department utilization and admission in patients with colorectal cancer. J Gastrointest Surg. 2018;22:913–20. 29435901 10.1007/s11605-018-3707-z 32. Lash RS Bell JF Bold RJ Emergency department use by recently diagnosed cancer patients in California J Community Support Oncol 2017 15 95 102 33215043 10.12788/jcso.0334 PMC7673305 Lash RS, Bell JF, Bold RJ, et al. Emergency department use by recently diagnosed cancer patients in California. J Community Support Oncol. 2017;15:95–102. 33215043 10.12788/jcso.0334 PMC7673305 33. Hui D Hannon BL Zimmermann C Improving patient and caregiver outcomes in oncology: team-based, timely, and targeted palliative care CA Cancer J Clin 2018 68 356 76 30277572 10.3322/caac.21490 PMC6179926 Hui D, Hannon BL, Zimmermann C, et al. Improving patient and caregiver outcomes in oncology: team-based, timely, and targeted palliative care. CA Cancer J Clin. 2018;68:356–76. 30277572 10.3322/caac.21490 PMC6179926 34. Powell AE Davies HTO The struggle to improve patient care in the face of professional boundaries Soc Sci Med 2012 75 807 14 22633159 10.1016/j.socscimed.2012.03.049 Powell AE, Davies HTO. The struggle to improve patient care in the face of professional boundaries. Soc Sci Med. 2012;75:807–14. 22633159 10.1016/j.socscimed.2012.03.049 35. Meiklejohn JA Mimery A Martin JH The role of the GP in follow-up cancer care: a systematic literature review J Cancer Surviv 2016 10 990 1011 27138994 10.1007/s11764-016-0545-4 Meiklejohn JA, Mimery A, Martin JH, et al. The role of the GP in follow-up cancer care: a systematic literature review. J Cancer Surviv. 2016;10:990–1011. 27138994 10.1007/s11764-016-0545-4 36. Bulsara C Ward AM Joske D Patient perceptions of the GP role in cancer management Aust Fam Physician 2005 34 299 300 15861760 Bulsara C, Ward AM, Joske D. Patient perceptions of the GP role in cancer management. Aust Fam Physician. 2005;34:299–300. 15861760 37. Urquhart R Folkes A Babineau J Views of breast and colorectal cancer survivors on their routine follow-up care Curr Oncol 2012 19 294 301 23300354 10.3747/co.19.1051 PMC3503661 Urquhart R, Folkes A, Babineau J, et al. Views of breast and colorectal cancer survivors on their routine follow-up care. Curr Oncol. 2012;19:294–301. 23300354 10.3747/co.19.1051 PMC3503661 38. Suija K Kordemets T Annuk K The role of general practitioners in cancer care: a mixed method design J Cancer Educ 2016 31 1 136 41 25876172 10.1007/s13187-015-0834-z Suija K, Kordemets T, Annuk K, et al. The role of general practitioners in cancer care: a mixed method design. J Cancer Educ. 2016;31(1):136–41. 25876172 10.1007/s13187-015-0834-z 39. Hudson SV Miller SM Hemler J Adult cancer survivors discuss follow-up in primary care: not what I want, but maybe what I need Ann Fam Med 2012 10 418 27 22966105 10.1370/afm.1379 PMC3438209 Hudson SV, Miller SM, Hemler J, et al. Adult cancer survivors discuss follow-up in primary care: not what I want, but maybe what I need. Ann Fam Med. 2012;10:418–27. 22966105 10.1370/afm.1379 PMC3438209 40. Ben-Ami E Merom H Sikron F Involvement of the family physician in the care of chemotherapy-treated patients with cancer: patients’ perspectives J Oncol Pract 2014 10 298 305 24781366 10.1200/JOP.2013.001182 Ben-Ami E, Merom H, Sikron F, et al. Involvement of the family physician in the care of chemotherapy-treated patients with cancer: patients’ perspectives. J Oncol Pract. 2014;10:298–305. 24781366 10.1200/JOP.2013.001182 41. Grabovschi C Loignon C Fortin M Mapping the concept of vulnerability related to health care disparities: a scoping review BMC Health Serv Res 2013 13 94 23496838 10.1186/1472-6963-13-94 PMC3626765 Grabovschi C, Loignon C, Fortin M. Mapping the concept of vulnerability related to health care disparities: a scoping review. BMC Health Serv Res. 2013;13:94. 23496838 10.1186/1472-6963-13-94 PMC3626765 ",
  "metadata": {
    "Title of this paper": "Mapping the concept of vulnerability related to health care disparities: a scoping review",
    "Journal it was published in:": "BMC Palliative Care",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482500/"
  }
}