{
  "title": "Paper_1117",
  "abstract": "pmc Vaccines (Basel) Vaccines (Basel) 2764 vaccines vaccines Vaccines 2076-393X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474151 PMC12474151.1 12474151 12474151 41012124 10.3390/vaccines13090921 vaccines-13-00921 1 Article ImmuniT Platform for Improved Neoantigen Prediction in Lung Cancer https://orcid.org/0000-0002-0314-3459 Hachey Stephanie J. Conceptualization Methodology Software Validation Formal analysis Investigation Resources Data curation Writing – original draft Writing – review & editing Visualization Project administration Funding acquisition 1 * https://orcid.org/0000-0002-5185-0705 Forsythe Alexander G. Methodology Software Validation Formal analysis Investigation Data curation Writing – review & editing Visualization 2 https://orcid.org/0000-0002-9506-2719 Keshava Hari B. Investigation Resources Data curation Writing – review & editing Supervision Project administration Funding acquisition 3 https://orcid.org/0000-0002-3223-830X Hughes Christopher C. W. 1 Tripp Ralph A. Academic Editor 1 cchughes@uci.edu 2 3 keshavah@hs.uci.edu * shachey@uci.edu 29 8 2025 9 2025 13 9 497676 921 27 5 2025 28 7 2025 30 7 2025 29 08 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ ImmuniT Platform for Improved Neoantigen Prediction in Lung Cancer 18 3 2025 2025.03.17.643783 bioRxiv PMC11957062 40167215 Background: Lung cancer remains the leading cause of cancer-related mortality, with many patients responding poorly to immunotherapy due to limited tumor recognition. Neoantigen-based strategies offer a promising solution, but current discovery methods often miss key targets, particularly those with low or heterogeneous expression. To address this, we developed ImmuniT, a three-phase platform for enhanced neoantigen discovery and validation. Methods: Under an IRB-approved protocol, patients with lung cancer consented to tumor collection for ex vivo processing to modulate antigen expression. Autologous T cells from matched blood were co-cultured with treated cancer cells to expand tumor-reactive populations. The nextneopi pipeline integrated mutational, transcriptomic, and HLA data to predict candidate neoantigens, which were validated using MHCepitope tetramer staining. Results: In five patient samples, ImmuniT identified a broader spectrum of neoantigens and induced stronger T cell activation in vitro compared to conventional approaches. Notably, in one case, two neoantigens missed by standard methods were confirmed to elicit tumor-specific T cell responses in both the tumor-infiltrating and peripheral compartments. Conclusions: These findings highlight ImmuniT’s potential to expand the repertoire of actionable tumor antigens and improve personalized immunotherapy strategies, particularly for patients with limited response to existing treatments. lung carcinoma neoantigen immunotherapy personalized therapy Department of Defense U54 CA217378 National Institutes of Health 75N91022C00004 National Cancer Institute W81XWH2110393 National Center for Advancing Translational Sciences TL1 TR001415 This work was supported by the Department of Defense, National Institutes of Health, National Cancer Institute, and National Center for Advancing Translational Sciences through the following grants: U54 CA217378 (CCWH) and 75N91022C00004, W81XWH2110393, and TL1 TR001415 (S.J.H.). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Lung cancer remains the leading cause of cancer-related deaths in the US and globally, with 85% of patients presenting with advanced, treatment-resistant disease [ 1 2 3 4 Neoantigens, which arise from tumor-specific somatic mutations, play a critical role in anti-cancer immune responses by eliciting tumor-reactive T cell activity [ 5 6 7 8 9 10 11 12 Despite advances in sequencing, bioinformatics, and mass spectrometry, the identification of tumor-specific neoantigens remains challenging [ 13 14 4 2. Materials and Methods 2.1. Tissue and Blood Collection Surgically resected NSCLC tissue and matched blood samples were collected from 20 patients under an IRB-approved protocol at the University of California, Irvine. All experimental procedures were conducted in accordance with institutional guidelines and regulations, with informed consent obtained from all participants or their legal guardians. Adjacent normal lung tissue, resected beyond tumor margins to ensure complete disease removal, was also included in the study. Blood samples were collected in 7.5 mL CPT Mononuclear Cell Preparation tubes containing sodium heparin and Ficoll. Surgical resections were collected in a conical tube containing transport media and transported on ice within 2 h of collection. The transport media consists of DMEM (4.5 g/L glucose, sodium pyruvate, and L-glutamine; Cat# 10-013-CV, Corning, NY, USA), serum-free with 1% penicillin–streptomycin (Pen/Strep) solution (ATCC, Cat# 30-2300, Manassas, VA, USA) for a final concentration of 100 U/mL penicillin and 100 ug/mL streptomycin, 1% antimitotic/antimycotic (anti-anti 100x, A5955, Millipore, Millipore Sigma, Burlington, MA, USA), and 10 µM ROCK inhibitor (Y-27632, StemCell Technologies, Cat# 72302, Vancouver, BC, Canada). 2.2. Tissue Processing and Dissociation NSCLC and normal lung tissues were subjected to mechanical dissociation using scalpels to finely mince the samples. As the pieces become smaller, gentle pipetting with a P1000 facilitates the liberation of cell clusters suitable for direct plating. These liberated cells should be collected, centrifuged, and plated. These liberated cells were centrifuged at 300× g g 2.3. Cell Culture and Co-Culture Assays We first isolated cancer cells by sorting dissociated tissue for EpCAM+ cells via flow cytometry and expanding NSCLC cell numbers for no more than a week in specialized cancer-initiating cell medium ([ 15 16 2.4. Whole-Exome and Bulk mRNA Sequencing DNA and RNA were extracted from freshly collected primary tumor and matched adjacent normal tissues using the QIAGEN Quick-DNA and Quick-RNA Microprep Kits, respectively. Whole-exome sequencing (WES) was performed on tumor and matched normal DNA using the Agilent SureSelect Human All Exon V7 kit for library preparation, followed by 150 bp paired-end sequencing on the Illumina NovaSeq 6000 platform. Raw reads were aligned to the human reference genome (GRCh38) using BWA-MEM, and somatic variants were identified using GATK Mutect2. Bulk RNA sequencing (RNA-seq) was conducted on tumor tissue using the Clontech SMARTer Stranded Total RNA-Seq Pico Input Mammalian v3 Kit and sequenced on the same platform. RNA-seq reads were aligned to GRCh38 using STAR, and gene expression levels were quantified with featureCounts. Expression data were used to filter for expressed somatic mutations prior to downstream neoantigen prediction. 2.5. Neoantigen Prediction Pipeline To identify neoantigen candidates, we utilized the nextNEOpi pipeline to process raw DNA and RNA sequencing data from paired tumor-normal samples, including those subjected to ImmuniT priming [ 14 13 2.6. Neoantigen Expression Assays Lentiviral vectors encoding full-length peptide sequences of predicted neoantigens were designed and constructed by VectorBuilder. To generate lentiviruses, HEK293T cells were transfected with the lentivector and packaging plasmids using Lipofectamine 2000, following the manufacturer’s protocol (Thermo Fisher Scientific, Waltham, MA, USA). Viral supernatants were collected at 24 and 48 h post-transfection and concentrated by incubating with a 50% PEG solution in sterile PBS for 24 h. The resulting viral precipitate was pelleted by centrifugation at 2500 rpm for 20 min, after which the supernatant was discarded, and the viral pellet was resuspended in PBS. Viral titers were determined using a P24 ELISA kit. For transduction, primary patient-derived lung fibroblasts at 50% confluence were exposed to the concentrated lentivirus at a multiplicity of infection (MOI) of 1 in the presence of 8 µg/mL polybrene. 2.7. Tetramer Staining and Flow Cytometry Custom MHC–peptide tetramers were designed and produced by BioLegend to detect antigen-specific T cells in non-small cell lung cancer (NSCLC) patient samples. The tetramers used in this study included HLA-A*24:02, MED23 (TYSRLLVCM-PE) and HLA-A*03:01, SNTB2 (ATSTAGCSK-PE). Peripheral blood mononuclear cells (PBMCs) or tumor-infiltrating lymphocytes (TILs) were first enriched for T cells using CD3 MicroBeads (Miltenyi Biotec) and magnetic-activated cell sorting (MACS) to isolate CD3 + 1 × 10 6 2.8. In Silico Neoantigen Benchmarking Known tumor-associated antigens (TAAs), including NY-ESO-1 and CEA (CAP1-6D analog), were selected based on prior studies demonstrating expression in NSCLC and immunogenicity. Peptides with reported HLA-restriction and immunogenicity were prioritized. Peptide-HLA binding affinities were evaluated using NetMHCpan 4.1 and IEDB’s MHC I Binding Prediction Tool (accessed May–July 2025). Binding affinities were expressed in terms of IC50 values (nM) and percentile ranks, with strong binders defined as IC50 < 50 nM and/or percentile rank < 0.5%. Comparisons were made with native and analog peptides (e.g., NY-ESO-1 SLLMWITQA vs. SLLMWITQC). Each peptide was cross-validated with the Immune Epitope Database (IEDB) to confirm documented immunogenicity and use in T cell assays or clinical trials. PubMed and ClinicalTrials.gov were queried to assess relevance to NSCLC or other carcinomas. Only peptides with experimental support for MHC presentation and T cell activation were included. 2.9. Statistical Analysis Each experimental group consisted of three independent biological replicates, with each experiment performed in technical triplicates. Statistical analyses were conducted using GraphPad Prism v10. For all comparisons involving four groups (ImmuniT, standard, unstim, and CD3/CD28), one-way ANOVA was performed followed by Tukey’s Honest Significant Difference (HSD) post hoc test to control for multiple comparisons. Normality and homogeneity of variances were assessed using the Shapiro–Wilk and Levene’s tests, respectively. Effect sizes and 95% confidence intervals were calculated where applicable. A p 3. Results 3.1. Patient Characteristics and Tumor Stage To demonstrate the applicability of the ImmuniT platform for personalized neoantigen discovery and validation, we processed tumor and matched blood samples from five lung cancer patients with varying histological subtypes, clinical features, and tumor mutational burdens ( Figure 1 Figure 1 Figure 1 β Figure 1 HLA genotyping reveals distinct allele combinations for HLA-A, HLA-B, and HLA-C across patients, which can influence antigen presentation and immune recognition. Additionally, expression levels of EpCAM and HLA-ABC highlight notable molecular differences. EpCAM positivity ranges from 78.07% to 96.78%, while HLA-ABC expression is highly variable, with patients P05 and P04 exhibiting only 12.35% and 15.51% positivity, respectively, in contrast to the high expression observed in patients P01 (99.72%), P02 (97.78%), and P03 (91.54%) ( Figure 1 17 Figure 1 18 19 Figure 1 Figure 1 Figure 1 20 21 3.2. T Cell Activation and Neoantigen Prediction with the ImmuniT Platform To evaluate the ability of the ImmuniT platform to improve T cell priming and activation compared to standard methods, we assessed effects of tumor cell pre-treatment on the activation of patient-derived T cells from individuals with high MHC class I expression on the tumor (HLA-ABC, assessed via flow cytometry). For patient P01, tumor pre-treatment with the ImmuniT platform (Phase 1) significantly enhanced subsequent T cell proliferation and activation (Phase 3), surpassing the response observed in non-treated (standard) tumor-primed T cells ( Figure 2 p −6 p γ To determine whether the ImmuniT platform improves neoantigen detection (Phase 2), we integrated next-generation sequencing (NGS) and a bioinformatics pipeline to analyze primary NSCLC tumors from patients P01, P03, P04, and P05. For patient P01, standard approaches to tumor cell handling and neoantigen prediction yielded a limited set of three gene fusion–derived neoantigens (MUC3A-MUC3A epitopes, presented by various HLA types with differing stability and affinity) ( Figure 2 Figure 2 Figure 2 A similar increase in T cell activation was observed in patient P02, where ImmuniT pre-treatment led to a significant increase in T cell proliferation compared to standard priming ( Figure 2 p −5 p p γ Figure 2 p −7 p 22 23 Figure 2 Using the ImmuniT platform, 70 fusion-derived neoantigens were identified in patient P04, including GSK3B–NECTIN3-AS1, MUC3A–MUC3A, and ASAH1–ASAH1, compared to only 10 detected using standard methods. Furthermore, IGFBP2-IGFBP2 emerged as a unique ImmuniT-identified target ( Figure 2 24 Figure 2 Supplemental Tables 25 3.3. Functional Validation of Novel Neoantigens To validate the functional avidity of T cells from patient P03, who had a high mutational burden and high expression of HLA-ABC, against the predicted neoantigens, we employed a cloning and expression system to investigate T cell receptor (TCR) specificity in TILs from patient P03 ( Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 To contextualize the predicted immunogenicity of the two patient-specific neoantigens, MED23 (Y573C) and SNTB2 (G322C), we performed a comparative benchmarking analysis against a curated panel of well-characterized antigens relevant to NSCLC. This reference panel included shared cancer/testis antigens (MAGE-A1 [ 26 27 28 27 29 30 31 32 33 31 31 34 35 34 Table 1 4. Discussion Our study reveals that conventional neoantigen identification methods may miss functionally relevant targets, potentially limiting the efficacy of personalized cancer vaccines and adoptive T cell therapies. Using the ImmuniT platform, we achieved enhanced T cell activation and proliferation, improved neoantigen detection, and functional validation of neoantigen-specific T cells, uncovering the differential distribution of neoantigen-specific T cells between peripheral blood-circulating lymphocyte populations and tumor resident compartments. In our functional analysis of patient P03, flow cytometry and pMHC tetramer assays demonstrated that while tumor-infiltrating lymphocytes (TILs) contained MED23-specific T cells, no SNTB2-specific T cells were detectable within the tumor microenvironment. In contrast, MED23- and SNTB2-reactive T cells were both present in peripheral blood lymphocytes (PBLs). This observed compartmental bias suggests that peripheral blood may represent a more accessible reservoir of neoantigen-specific T cells, potentially reflecting immune exclusion mechanisms within the tumor microenvironment. However, it also raises the possibility that technical artifacts introduced during T-cell isolation, in vitro culture, or expansion protocols may influence the apparent distribution. These findings have significant implications for both vaccine-based and cell-based immunotherapies. For cell-based therapies, selecting the optimal starting population is crucial for approaches such as TIL therapy or the adoptive transfer of neoantigen-specific T cells [ 8 11 36 37 38 39 9 40 The functional relevance of predicted neoantigens remains a key challenge in immunotherapy development. In the absence of a tetramer-based positive control, we benchmarked our novel antigens against a panel of established tumor antigens associated with NSCLC. This comparative analysis revealed that MED23 (Y573C) and SNTB2 (G322C) possess MHC binding and immunogenicity scores consistent with several validated and clinically explored antigens, including MAGE-A1, NY-ESO-1, and TP53 K132N. Importantly, while immunogenicity prediction scores can underpredict the functional potential of rare or unconventional epitopes such as those derived from tumor-specific mutations and alone do not fully capture antigen processing, presentation, or T cell repertoire constraints, they offer a useful comparative framework when placed alongside widely studied NSCLC antigens. Our findings support the notion that MED23 and SNTB2 are viable candidates for further experimental validation and reinforce the importance of incorporating shared neoantigen comparisons in early-stage validation efforts. While this study serves as a proof of concept, a key limitation is the small sample size (n = 5 patients), which restricts the generalizability of the findings and precludes robust subgroup analyses. Furthermore, the patient cohort was heterogeneous with respect to factors known to influence immune responses, including tumor type, disease stage, smoking history, and HLA genotype. Although such diversity mirrors real-world clinical complexity, it complicates interpretation and underscores the need for validation in larger, stratified cohorts. Future studies should investigate whether the ImmuniT platform can be broadly applied across clinical subtypes or whether tailored approaches are required. Despite these limitations, the consistent enhancement of neoantigen-specific T cell responses in all five patients supports the translational promise of this platform. By integrating next-generation sequencing with functional validation assays, our study demonstrates that the ImmuniT platform can identify rare but immunologically significant neoantigens, even in NSCLC tumors with low tumor mutational burden. The platform improves both the sensitivity and breadth of neoantigen detection, uncovering epitopes that are overlooked by conventional approaches. Another key strength of the platform is its HLA-agnostic approach, which enables the identification and validation of neoantigens without being constrained by HLA restrictions. Moving forward, efforts should prioritize refining neoantigen-specific T cell expansion protocols and optimizing therapy designs to address compartmental biases and functional constraints. By enhancing T cell activation, improving neoantigen detection, and circumventing the challenges associated with low TMB, the ImmuniT platform establishes a powerful foundation for developing highly personalized and broadly accessible immunotherapies. 5. Conclusions Our findings underscore the limitations of conventional neoantigen discovery pipelines and highlight the value of integrating functional validation into neoantigen identification workflows. The ImmuniT platform offers a robust, HLA-agnostic solution to uncovering immunologically meaningful neoantigens, even in tumors with low mutational burden. By revealing compartment-specific biases in neoantigen-specific T cell distribution and demonstrating enhanced T cell activation and expansion using the ImmuniT platform, this study emphasizes the need to reassess both the sources and functional states of T cells used in immunotherapy. These findings, while based on a small and heterogeneous patient cohort, demonstrate the feasibility of using an integrated in vitro and in silico strategy for neoantigen discovery. Future studies in larger, stratified cohorts will be critical to assess the broader applicability of the ImmuniT platform across diverse clinical profiles. Ultimately, the ImmuniT platform may advance the precision of both vaccine-based and cell-based strategies, paving the way for more effective personalized cancer immunotherapies that overcome current limitations in neoantigen targeting. Acknowledgments We thank Delia Tifrea, Robert Edwards, Jeffrey Kim, and Christopher Rodriguez from the UCI Pathology Core for their help with tissue processing and assessment. We thank Melanie Oakes and the staff at the UCI Genomics Research and Technology Hub for their assistance with RNA/DNA sequencing for this study. Biorender was used to generate Figure 1 Figure 3 Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/vaccines13090921/s1 Author Contributions Conceptualization, S.J.H.; methodology, S.J.H.; software, S.J.H. and A.G.F.; validation, S.J.H.; formal analysis, S.J.H. and A.G.F.; investigation, S.J.H., H.B.K., and C.C.W.H.; resources, S.J.H., H.B.K., and C.C.W.H.; data curation, S.J.H. and A.G.F.; writing—original draft preparation, S.J.H.; writing—review and editing, S.J.H., A.G.F., H.B.K., and C.C.W.H.; visualization, S.J.H.; supervision, H.B.K., and C.C.W.H.; project administration, S.J.H., H.B.K., and C.C.W.H.; funding acquisition, S.J.H., H.B.K., and C.C.W.H. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki, and approved by the Institutional Review Board of the University of California, Irvine (protocol code 20206253, approved 1 April 2021). Informed Consent Statement All patients enrolled in this IRB-approved study provided informed consent, and all research procedures adhere to ethical guidelines and regulatory standards. Data Availability Statement The original data presented in the study are openly available in Gene Expression Omnibus (GEO) at [ GSE306693 Conflicts of Interest S.J.H. and A.G.F. have an equity interest in ImmunoTarget Therapeutics, Inc., which is commercializing some of the technology described in this paper. The terms of this arrangement have been reviewed and approved by the University of California, Irvine, in accordance with its conflict of interest policies. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. References 1. Siegel R.L. Miller K.D. Wagle N.S. Jemal A. Cancer statistics, 2023 CA Cancer J. Clin. 2023 73 17 48 10.3322/caac.21763 36633525 2. Reck M. Rabe K.F. Precision Diagnosis and Treatment for Advanced Non–Small-Cell Lung Cancer N. Engl. J. Med. 2017 377 849 861 10.1056/NEJMra1703413 28854088 3. Riley R.S. June C.H. Langer R. Mitchell M.J. Delivery technologies for cancer immunotherapy Nat. Rev. Drug Discov. 2019 18 175 196 10.1038/s41573-018-0006-z 30622344 PMC6410566 4. Chalmers Z.R. Connelly C.F. Fabrizio D. Gay L. Ali S.M. Ennis R. Schrock A. Campbell B. Shlien A. Chmielecki J. Analysis of 100,000 human cancer genomes reveals the landscape of tumor mutational burden Genome Med. 2017 9 34 10.1186/s13073-017-0424-2 28420421 PMC5395719 5. Spranger S. Gajewski T.F. Impact of oncogenic pathways on evasion of antitumour immune responses Nat. Rev. Cancer 2018 18 139 147 10.1038/nrc.2017.117 29326431 PMC6685071 6. Hu Z. Ott P.A. Wu C.J. Towards personalized, tumour-specific, therapeutic vaccines for cancer Nat. Rev. Immunol. 2018 18 168 182 10.1038/nri.2017.131 29226910 PMC6508552 7. Peng S. Zaretsky J.M. Ng A.H. Chour W. Bethune M.T. Choi J. Hsu A. Holman E. Ding X. Guo K. Sensitive Detection and Analysis of Neoantigen-Specific T Cell Populations from Tumors and Blood Cell Rep. 2019 28 2728 2738.e7 10.1016/j.celrep.2019.07.106 31484081 PMC6774618 8. Ott P.A. Hu-Lieskovan S. Chmielowski B. Govindan R. Naing A. Bhardwaj N. Margolin K. Awad M.M. Hellmann M.D. Lin J.J. A Phase Ib Trial of Personalized Neoantigen Therapy Plus Anti-PD-1 in Patients with Advanced Melanoma, Non-small Cell Lung Cancer, or Bladder Cancer Cell 2020 183 347 362.e24 10.1016/j.cell.2020.08.053 33064988 9. Ingels J. De Cock L. Stevens D. Mayer R.L. Théry F. Sanchez G.S. Vermijlen D. Weening K. De Smet S. Lootens N. Neoantigen-targeted dendritic cell vaccination in lung cancer patients induces long-lived T cells exhibiting the full differentiation spectrum Cell Rep. Med. 2024 5 101516 10.1016/j.xcrm.2024.101516 38626769 PMC11148567 10. Yarchoan M. Johnson B.A. Lutz E.R. Laheru D.A. Jaffee E.M. Targeting neoantigens to augment antitumour immunity Nat. Rev. Cancer 2017 17 209 222 10.1038/nrc.2016.154 28233802 PMC5575801 11. Rosenthal R. Cadieux E.L. Salgado R. Bakir M.A. Moore D.A. Hiley C.T. Lund T. Tanić M. Reading J.L. Joshi K. Neoantigen-directed immune escape in lung cancer evolution Nature 2019 567 479 485 10.1038/s41586-019-1032-7 30894752 PMC6954100 12. Müller M. Huber F. Arnaud M. Kraemer A.I. Altimiras E.R. Michaux J. Taillandier-Coindard M. Chiffelle J. Murgues B. Gehret T. Machine learning methods and harmonized datasets improve immunogenic neoantigen prediction Immunity 2023 56 2650 2663.e6 10.1016/j.immuni.2023.09.002 37816353 13. Wells D.K. van Buuren M.M. Dang K.K. Hubbard-Lucey V.M. Sheehan K.C. Campbell K.M. Lamb A. Ward J.P. Sidney J. Blazquez A.B. Key Parameters of Tumor Epitope Immunogenicity Revealed Through a Consortium Approach Improve Neoantigen Prediction Cell 2020 183 818 834.e13 10.1016/j.cell.2020.09.015 33038342 PMC7652061 14. Rieder D. Fotakis G. Ausserhofer M. René G. Paster W. Trajanoski Z. Finotello F. nextNEOpi: A comprehensive pipeline for computational neoantigen prediction Bioinformatics 2022 38 1131 1132 10.1093/bioinformatics/btab759 34788790 PMC8796378 15. Chen H.J. Sun J. Huang Z. Hou H. Arcilla M. Rakhilin N. Joe D.J. Choi J. Gadamsetty P. Milsom J. Comprehensive models of human primary and metastatic colorectal tumors in immunodeficient and immunocompetent mice by chemokine targeting Nat. Biotechnol. 2015 33 656 660 10.1038/nbt.3239 26006007 PMC4532544 16. Kim M. Mun H. Sung C.O. Cho E.J. Jeon H.J. Chun S.M. Jung D.J. Shin T.H. Jeong G.S. Kim D.K. Patient-derived lung cancer organoids as in vitro cancer models for therapeutic screening Nat. Commun. 2019 10 3991 10.1038/s41467-019-11867-6 31488816 PMC6728380 17. Perea F. Bernal M. Sánchez-Palencia A. Carretero J. Torres C. Bayarri C. Gómez-Morales M. Garrido F. Ruiz-Cabello F. The absence of HLA class I expression in non-small cell lung cancer correlates with the tumor tissue structure and the pattern of T cell infiltration Int. J. Cancer 2017 140 888 899 10.1002/ijc.30489 27785783 18. Zhang P. Chen P.L. Li Z.H. Zhang A. Zhang X.R. Zhang Y.J. Liu D. Mao C. Association of smoking and polygenic risk with the incidence of lung cancer: A prospective cohort study Br. J. Cancer 2022 126 1637 1646 10.1038/s41416-022-01736-3 35194190 PMC9130319 19. Ye L. Creaney J. Redwood A. Robinson B. The Current Lung Cancer Neoantigen Landscape and Implications for Therapy J. Thorac. Oncol. 2021 16 922 932 10.1016/j.jtho.2021.01.1624 33581342 20. Pao W. Girard N. New driver mutations in non-small-cell lung cancer Lancet Oncol. 2011 12 175 180 10.1016/S1470-2045(10)70087-5 21277552 21. Frankell A.M. Dietzen M. Al Bakir M. Lim E.L. Karasaki T. Ward S. Veeriah S. Colliver E. Huebner A. Bunkum A. The evolution of lung cancer and impact of subclonal selection in TRACERx Nature 2023 616 525 533 10.1038/s41586-023-05783-5 37046096 PMC10115649 22. Fu X. Liu S. Cao D. Li C. Ji H. Wang G. Med23 deficiency reprograms the tumor microenvironment to promote lung tumorigenesis Br. J. Cancer 2024 130 716 727 10.1038/s41416-023-02556-9 38195889 PMC10912217 23. Im C.N. Kim B.M. Moon E.Y. Hong D.W. Park J.W. Hong S.H. Characterization of H460R, a Radioresistant Human Lung Cancer Cell Line, and Involvement of Syntrophin Beta 2 (SNTB2) in Radioresistance Genom. Inform. 2013 11 245 10.5808/GI.2013.11.4.245 24465237 PMC3897853 24. Guo C. Lu H. Gao W. Wang L. Lu K. Wu S. Pataer A. Huang M. El-Zein R. Lin T. Insulin-Like Growth Factor Binding Protein-2 Level Is Increased in Blood of Lung Cancer Patients and Associated with Poor Survival PLoS ONE 2013 8 e74973 10.1371/journal.pone.0074973 24069370 PMC3775736 25. Lai M. Realini N. La Ferla M. Passalacqua I. Matteoli G. Ganesan A. Pistello M. Mazzanti C.M. Piomelli D. Complete Acid Ceramidase ablation prevents cancer-initiating cell formation in melanoma cells Sci. Rep. 2017 7 7411 10.1038/s41598-017-07606-w 28785021 PMC5547127 26. Wermke M. Holderried T.A.W. Luke J.J. Morris V.K. Alsdorf W.H. Wetzko K. Andersson B.S. Wistuba I.I. Parra E.R. Hossain M.B. First-in-human dose escalation trial to evaluate the clinical safety and efficacy of an anti-MAGEA1 autologous TCR-transgenic T cell therapy in relapsed and refractory solid tumors J. Immunother. Cancer 2024 12 e008668 10.1136/jitc-2023-008668 39038917 PMC11268062 27. Neek M. Tucker J.A. Kim T.I. Molino N.M. Nelson E.L. Wang S.W. Co-delivery of human cancer-testis antigens with adjuvant in protein nanoparticles induces higher cell-mediated immune responses Biomaterials 2018 156 194 203 10.1016/j.biomaterials.2017.11.022 29202325 PMC5783197 28. Vansteenkiste J.F. Cho B.C. Vanakesa T. De Pas T. Zielinski M. Kim M.S. Jassem J. Yoshimura M. Dahabreh J. Nakayama H. Efficacy of the MAGE-A3 cancer immunotherapeutic as adjuvant therapy in patients with resected MAGE-A3-positive non-small-cell lung cancer (MAGRIT): A randomised, double-blind, placebo-controlled, phase 3 trial Lancet Oncol. 2016 17 822 835 10.1016/S1470-2045(16)00099-1 27132212 29. Altan M. Lopes G. Hiltermann T.J.N. Govindan R. Villaruz L.C. Calvo E. Edelman M.J. Furqan M. Neal J. Felip E. Safety and Tolerability of Letetresgene Autoleucel (GSK3377794): Pilot Studies in Patients with Advanced Non–Small Cell Lung Cancer Clin. Cancer Res. 2025 31 529 542 10.1158/1078-0432.CCR-24-1591 39576208 PMC11788651 30. Alves P.M.S. Viatte S. Fagerberg T. Michielin O. Bricard G. Bouzourene H. Vuilleumier H. Kruger T. Givel J.C. Lévy F. Immunogenicity of the carcinoembryonic antigen derived peptide 694 in HLA-A2 healthy donors and colorectal carcinoma patients Cancer Immunol. Immunother. 2007 56 1795 1805 10.1007/s00262-007-0323-2 17447064 PMC11030050 31. Mehrotra S. Britten C.D. Chin S. Garrett-Mayer E. Cloud C.A. Li M. Scurti G. Salem M.L. Nelson M.H. Thomas M.B. Vaccination with poly(IC:LC) and peptide-pulsed autologous dendritic cells in patients with pancreatic cancer J. Hematol. Oncol. 2017 10 82 10.1186/s13045-017-0459-2 28388966 PMC5384142 32. Ramlau R. Quoix E. Rolski J. Pless M. Lena H. Lévy E. Krzakowski M. Hess D. Tartour E. Chenard M.P. A Phase II Study of Tg4010 (Mva-Muc1-Il2) in Association with Chemotherapy in Patients with Stage III/IV Non-small Cell Lung Cancer J. Thorac. Oncol. 2008 3 735 744 10.1097/JTO.0b013e31817c6b4f 18594319 33. Roulois D. Grégoire M. Fonteneau J.F. MUC1-Specific Cytotoxic T Lymphocytes in Cancer Therapy: Induction and Challenge BioMed Res. Int. 2013 2013 871936 10.1155/2013/871936 23509794 PMC3591236 34. Rappaport A.R. Kyi C. Lane M. Hart M.G. Johnson M.L. Henick B.S. Liao C.Y. Mahipal A. Shergill A. Spira A.I. A shared neoantigen vaccine combined with immune checkpoint blockade for advanced metastatic solid tumors: Phase 1 trial interim results Nat. Med. 2024 30 1013 1022 10.1038/s41591-024-02851-9 38538867 35. Lu D. Chen Y. Jiang M. Wang J. Li Y. Ma K. Sun W. Zheng X. Qi J. Jin W. KRAS G12V neoantigen specific T cell receptor for adoptive T cell therapy against tumors Nat. Commun. 2023 14 6389 10.1038/s41467-023-42010-1 37828002 PMC10570350 36. Ghorani E. Reading J.L. Henry J.Y. de Massy M.R. Rosenthal R. Turati V. Joshi K. Furness A.J.S. Ben Aissa A. Saini S.K. The T cell differentiation landscape is shaped by tumour mutations in lung cancer Nat. Cancer 2020 1 546 561 10.1038/s43018-020-0066-y 32803172 PMC7115931 37. Caushi J.X. Zhang J. Ji Z. Vaghasia A. Zhang B. Hsiue E.H.C. Mog B.J. Hou W. Justesen S. Blosser R. Transcriptional programs of neoantigen-specific TIL in anti-PD-1-treated lung cancers Nature 2021 596 126 132 10.1038/s41586-021-03752-4 34290408 PMC8338555 38. Klebanoff C.A. Gattinoni L. Restifo N.P. Sorting Through Subsets: Which T-Cell Populations Mediate Highly Effective Adoptive Immunotherapy? J. Immunother. 2012 35 651 660 10.1097/CJI.0b013e31827806e6 23090074 PMC3501135 39. Tran E. Robbins P.F. Lu Y.C. Prickett T.D. Gartner J.J. Jia L. Pasetto A. Zheng Z. Ray S. Groh E.M. T-Cell Transfer Therapy Targeting Mutant KRAS in Cancer N. Engl. J. Med. 2016 375 2255 2262 10.1056/NEJMoa1609279 27959684 PMC5178827 40. Ding Z. Li Q. Zhang R. Xie L. Shu Y. Gao S. Wang P. Su X. Qin Y. Wang Y. Personalized neoantigen pulsed dendritic cell vaccine for advanced lung cancer Signal Transduct. Target. Ther. 2021 6 26 10.1038/s41392-020-00448-5 33473101 PMC7817684 Figure 1 Overview of the ImmuniT platform and patient characteristics. ( A B C D E Figure 2 ImmuniT platform shows improved T cell activation and neoantigen detection compared to standard methods. ( A γ p −6 p B C D p −5 p E γ p −7 γ p F G H p p p p Figure 3 The ImmuniT platform enhances the identification of neoantigens for patient P03, as shown by the expansion of neoantigen-specific tumor-infiltrating lymphocytes detected through peptide:MHC tetramers. ( A B C D E F G vaccines-13-00921-t001_Table 1 Table 1 Benchmarking of MED23 and SNTB2 neoantigens against validated tumor-associated and recurrent neoantigens. Binding ranks and affinities were predicted using NetMHCpan 4.1. Immunogenicity scores were determined using the IEDB immunogenicity prediction tool. Antigen Name Peptide Sequence IEDB ID HLA Allele Affinity Rank Affinity Score Immunogenicity Affinity (nM) Binding Level CEA YLSGANLNL 74915 A*02:01 0.105 0.7986 −0.00073 8.84 Strong KRAS (G12C) VVGACGVGK – A*11:01 0.427 0.6035 0.08441 72.99 Weak KRAS (G12D) VVGADGVGK – A*03:01 0.286 0.6045 0.24736 72.17 Strong KRAS (G12V) VVGAVGVGK – A*11:01 0.384 0.6140 0.17711 65.10 Strong MAGE-A1 KVLEYVIKV 34095 A*02:01 0.054 0.8371 0.11873 5.83 Strong MAGE-A3 FLWGPRALV 16970 A*02:01 0.083 0.8120 0.17046 7.65 Strong MED23 (Y573C) TYSRLLVCM – A*24:02 0.426 0.0002 −0.01952 332.17 Strong MUC1 LLLLTVLTV 37528 A*02:01 0.289 0.7231 0.07520 20.01 Strong NY-ESO-1 SLLMWITQC 59278 A*02:01 2.553 0.4413 0.12576 422.15 Weak SNTB2 (G322C) ATSTAGCSK – A*03:01 0.599 0.5183 −0.08680 183.51 Strong Survivin LTLGEFLKL 237188 A*02:01 4.719 4.7190 0.10284 1344.98 Weak hTERT YLFFYRKSV 2255432 A*02:01 0.180 0.7606 −0.07774 13.34 Strong TP53 (K132N) TYSPALNNM – C*07:02 0.066 0.5441 −0.04644 138.82 Strong ",
  "metadata": {
    "Title of this paper": "Personalized neoantigen pulsed dendritic cell vaccine for advanced lung cancer",
    "Journal it was published in:": "Vaccines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474151/"
  }
}