{
  "title": "Paper_359",
  "abstract": "pmc J Ovarian Res J Ovarian Res 786 jovares Journal of Ovarian Research 1757-2215 BMC PMC12487330 PMC12487330.1 12487330 12487330 41035050 10.1186/s13048-025-01793-1 1793 1 Review The mechanism and protective strategies of follicle injury after ovarian tissue cryopreservation and thawed transplantation: a review Chu Yifan 1 2 3 4 Yifan Chu obtained his master’s degree from the Second Clinical College (Tongji Hospital), Tongji Medical College, Huazhong University of Science and Technology of China in 2024. He is currently a M. D. student under the supervision of Prof. Jing Yue. His research is centered on development of ovarian tissue cryopreservation and assisted reproductive technology. Zhang Jialiang 5 Wang Luyao 1 2 3 4 Xie Jiaxin 1 2 3 4 Chen Jiayun 1 2 3 4 Hu Xinyao 1 2 Zhou Juepu 1 2 Mao Ruolin 1 2 Yan Miao 2 6 Yue Jing jingyue8@hotmail.com 1 2 3 4 Prof. Jing Yue is currently a chief physician and the vice director at Reproductive Medicine and Genetics Centre, Tongji Hospital, Tongji Medical College, Huazhong University of Science and Technology, specializing in assisted reproductive technology, fertility preservation and gynecological endocrinology. She received her Ph.D. in reproductive medicine from Huazhong University of Science and Technology in 2008. Her research focuses on fertility preservation, endometrial receptivity and endometrial flora. 1 https://ror.org/00p991c53 grid.33199.31 0000 0004 0368 7223 Reproductive Medicine and Genetics Center, Tongji Hospital, Tongji Medical College, Huazhong University of Science and Technology, 2 https://ror.org/00p991c53 grid.33199.31 0000 0004 0368 7223 Department of Obstetrics and Gynecology, Tongji Hospital, Tongji Medical College, Huazhong University of Science and Technology, 3 4 https://ror.org/01dr2b756 grid.443573.2 0000 0004 1799 2448 Shiyan Key Laboratory of Reproduction and Genetics (Renmin Hospital, Hubei University of Medicine), 5 https://ror.org/00p991c53 grid.33199.31 0000 0004 0368 7223 School of Mechanical Science and Engineering, Huazhong University of Science and Technology, 6 https://ror.org/00p991c53 grid.33199.31 0000 0004 0368 7223 National Clinical Research Center for Obstetrics and Gynecology, Cancer Biology Research Center (Key Laboratory of the Ministry of Education), Tongji Hospital, Tongji Medical College, Huazhong University of Science and Technology, 1 10 2025 2025 18 478377 217 17 4 2025 21 8 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ The incidence of early-onset malignancies in reproductive-aged women is rising, necessitating effective fertility preservation strategies. Ovarian tissue cryopreservation (OTC) remains the sole option for prepubertal girls and patients requiring urgent oncologic treatment. However, post-transplant follicular attrition—driven by ischemia-reperfusion injury, oxidative stress, and aberrant primordial follicle activation—remains a major barrier. This comprehensive review elucidates the multiscale mechanisms of cryopreservation-induced follicular damage and evaluates cutting-edge strategies, including antifreeze protein-engineered cryoprotectants, angiogenesis-modulating scaffolds, and mTOR pathway inhibition. By integrating recent advances in biomaterial science and cryobiology, this study provides actionable insights to enhance OTC clinical efficacy and advance reproductive medicine. National Key Research and Development Program of China 2022YFC2702503 Yue Jing Peking University Third Hospital Open Subject of the Department of Obstetrics and Gynecology BYSYSZKF2022008 Yue Jing Open Project of Hubei Clinical Research Center for Reproductive Medicine 2025RMOF005 Yue Jing pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background In recent years, the rising incidence of malignant tumors with increasingly younger onset poses a significant public health threat; while advances in treatment have improved long-term survival rates [ 1 2 3 4 5 6 OTC involves surgically obtaining the ovarian cortex, sectioning it into slices (∼1 mm thick × 5–10 mm long/wide), vitrifying or slow-freezing the tissue, and storing it in liquid nitrogen; when needed, thawed tissue is transplanted back [ 7 8 10 11 Beyond restoring fertility, transplantation also recovers endocrine function [ 9 12 13 3 7 14 16 9 17 18 19 20 9 20 21 This review analyzes mechanisms underlying ischemia/hypoxia-induced injury and aberrant primordial follicle activation post-transplant, while evaluating strategies to enhance OTC efficacy via antioxidants, cytokines, stem cells and novel biomaterials—offering novel insights into follicular injury and advancing OTC treatment. Mechanism of follicle injury in OTC and thawed ovarian tissue transplantation Cryodamage in OTC Slow freezing remains the conventional cryopreservation technique in clinical practice, accounting for the majority of reported live births following ovarian tissue transplantation. This method involves specimen immersion in low-concentration cryoprotectants, followed by controlled cooling via computerized programmable freezers. Tissues are progressively frozen at defined rates (− 35 °C to − 130 °C) prior to long-term storage in liquid nitrogen [ 22 23 24 25 In contrast, vitrification employs ultra-rapid cooling of tissues in high-concentration cryoprotectants to achieve a glassy, ice crystal-free state [ 22 26 Comparative studies on vitrification and slow freezing methods for OTC have become the focus of recent research. Wang et al. demonstrated that although both slow freezing and vitrification downregulated the mRNA levels of ZP3 and CYP11A, vitrification had a more pronounced negative impact on the development and morphological normality of human primordial follicles, as well as on the mRNA expression of anti-Müllerian hormone (AMH), compared to slow freezing [ 27 25 28 25 29 31 32 33 36 Hypoxia, ischemia-reperfusion injury (IRI) and cell death During the early post-transplantation phase, hypoxic-ischemic injury and IRI constitute major contributors to follicular depletion in thawed ovarian grafts [ 20 37 38 19 20 39 41 9 42 Revascularization timelines differ across species, requiring 7 days in murine models versus 10 days in humans for functional vessel formation and oxygen partial pressure stabilization [ 39 43 44 45 46 Autophagy, a critical homeostatic process for primordial follicle maintenance under physiological conditions, is dysregulated following transplantation: while genetic ablation of autophagy-related genes accelerates primordial follicle loss [ 47 20 48 Aberrant activation of primordial follicles Primordial follicles residing in the ovarian cortex are maintained in a quiescent state by the unique biophysical microenvironment—characterized by high collagen density, compact tissue architecture, and limited vascularization—which shields follicles from mechanical stimuli that could induce premature activation, thereby constituting a critical determinant of ovarian reserve [ 39 49 50 51 52 53 54 53 55 Ovarian fibrosis Ovarian fibrosis—characterized by aberrant fibroblast proliferation and excessive extracellular matrix (ECM) deposition—constitutes a pivotal pathological driver of diminished ovarian reserve [ 56 57 56 58 59 60 61 Strategies to enhance the efficiency of OTC To prolong graft longevity and enhance the efficiency of OTC, various strategies have been employed to mitigate follicular loss, including antioxidants, pro-angiogenic agents, primordial follicle activation inhibitors, and novel cryoprotectants. New biomaterials, including hydrogels and decellularized scaffolds, are also gradually attracting researchers’ interest (Table 1  Table 1 Damage mechanisms and protective strategies in OTC​ and thawed transplantation Damage Type​​ ​​Specific Mechanisms​​ ​​Protective Strategies​ ​​Cryodamage​ • Mechanical ice crystal injury (slow freezing) • Cryoprotectant toxicity (vitrification) • Follicle integrity decline • Stromal cell viability < 65% • ​​ Novel cryoprotectants​​ - AFPs: Suppress ice growth - GO: Matches ice prism plane O-O spacing - Zwitterionic polymers: Mitigate osmotic stress via charge shielding • ​​ Biomaterial carriers - Alginate hydrogels: Mimic ECM microenvironment ​Ischemia-Reperfusion Injury (IRI)​ • Hypoxia (> 5 days) inducing mitochondrial dysfunction • ROS burst triggering apoptosis • Pyroptosis-related protein upregulation (caspase-1, NLRP3) • ​​ Antioxidants​​ - Melatonin: Activates Nrf2/ARE pathway, increase SOD/GSH activity - NAC: Inhibits TNF-α/caspase-3, increase follicle survival rate - EPO: Promotes neovascularization and reduces oxidative DNA damage - Vitamin C/E/Trolox: Inhibit lipid peroxidation cascade - Allopurinol: Blocking superoxide anion production - Resveratrol: Activates SIRT1, decrease apoptosis • ​​ Pro-angiogenic agents​​ - bFGF/VEGF with or without hydrogels: increase microvascular density - MSCs: Secrete VEGF/Ang-1 - Ang2: Mediates angiogenesis and vascular remodeling - FSH/hMG: Stimulate angiogenesis and reduce granulosa and stromal cell apoptosis Aberrant Primordial Follicle Activation • mTOR/p-S6K signaling activation • Hippo pathway dysregulation • Insufficient AMH secretion • ​​ mTOR inhibitors​​ - Rapamycin: Inhibits p-S6K, inhibit aberrant primordial follicle activation • ​​ AMH replacement​​ - Recombinant AMH: Preserves primordial follicle pool - AMH-overexpressing endothelial cells: Decrease follicular atresia ​​Ovarian Fibrosis​ • TGF-β-mediated ECM overdeposition • Abnormal integrin-cytoskeleton signaling • ​​ Anti-fibrotic biomaterials​​ - Decellularized scaffolds: Preserve ECM structure, decrease collagen fragments - Melatonin + endothelial cell hydrogels: Inhibit fibrosis via NO pathway - Ang2 + VEGF: suppression of TGF-β/Smad signaling pathway Abbreviation: AFPs: antifreeze proteins; GO, graphene oxide; ECM, extracellular matrix; SOD: superoxide dismutase; GSH: glutathione; NAC: N-acetylcysteine; EPO: erythropoietin; IRI: ischemia-reperfusion injury; ROS: reactive oxygen species; bFGF: basic fibroblast growth factor; VEGF: vascular endothelial growth factor; MSCs: mesenchymal stem cells; Ang2: angiopoietin-2; FSH: follicle-stimulating hormone; hMG: human menopausal gonadotropin; AMH: anti-Müllerian hormone Antioxidants Melatonin Melatonin exerts potent direct free radical scavenging capacity and indirectly enhances endogenous antioxidant defenses through receptor-mediated pathways, thereby conferring comprehensive antioxidative, anti-apoptotic, and anti-inflammatory protection during ovarian tissue cryopreservation and transplantation [ 62 63 64 65 66 Beyond cryoprotection, melatonin enhances transplant efficacy: in murine autotransplantation models, intraperitoneal administration accelerates estrous cycle recovery, elevates progesterone and estradiol levels, increases ovarian volume, and preserves multi-stage follicle counts by suppressing ROS burst and inflammatory cytokine release [ 67 68 144 69 N-acetylcysteine (NAC) NAC functions as a metabolic precursor for intracellular cysteine and GSH biosynthesis, conferring potent antioxidant activity through direct free radical scavenging and indirect enhancement of endogenous redox defenses [ 39 70 71 72 73 Others Beyond melatonin and NAC, diverse antioxidants have been investigated for OTC and transplantation. Erythropoietin​​ (EPO) promotes neovascularization via vascular endothelial growth factor (VEGF) upregulation and reduces oxidative DNA damage in rodent/canine models, preserving stromal integrity and restoring follicular function [ 74 79 80 81 82 40 Angiogenesis and anti-fibrosis Basic fibroblast growth factor (bFGF) and VEGF bFGF and VEGF are widely utilized in cryopreserved ovarian tissue transplantation, either as monotherapies or in combinatorial strategies, to mitigate ischemic injury and enhance graft functionality. To address the rapid enzymatic degradation of free bFGF in vivo, studies have employed fibrin hydrogel scaffolds for its sustained local delivery during co-transplantation with fresh ovarian tissue. ​​Notably​​, bFGF encapsulation significantly improved primordial follicle survival rates, stimulated neoangiogenesis (evidenced by increased microvessel density), and enhanced stromal cell proliferation in murine allografts [ 83 84 85 86 87 Mesenchymal stem cells (MSCs) MSCs, as multipotent adult stem cells, are isolatable from diverse tissues including bone marrow, umbilical cord, menstrual blood, endometrium, and adipose tissue [ 88 47 89 90 89 91 92 47 91 55 Other MSC types—including bone marrow-derived MSCs (BM-MSCs), visceral peritoneal MSCs, and human umbilical cord MSCs (HucMSCs)—also exert protective effects in ovarian transplantation. Encapsulation of cryopreserved-thawed human ovarian tissue with BM-MSCs in Matrigel upregulates pro-angiogenic factors (VEGF, FGF2, angiogenin), enhancing revascularization while reducing primordial follicle apoptosis and structural damage [ 93 94 95 Significantly, MSC-derived extracellular vesicles (MSC-EVs)—comprising exosomes (50–150 nm), microvesicles (100–1000 nm), and apoptotic bodies (500–5000 nm)—retain therapeutic functionalities akin to parental cells while exhibiting superior stability and reduced immunogenicity [ 88 96 98 Biomaterials Hydrogels—soft biocompatible biomaterials with three-dimensional hydrophilic crosslinked networks—effectively confine ice crystal propagation within their matrices by creating a constrained aqueous microenvironment during cryopreservation [ 99 100 101 102 104 69 105 109 110 111 112 108 Decellularized scaffolds—generated via physical/chemical/enzymatic removal of cellular components—preserve tissue-specific ECM components, structural integrity, and biomechanical cues while eliminating immunogenicity [ 113 114 115 116 117 Others Angiopoietin-2 (Ang2) directly mediates angiogenesis and vascular remodeling, exhibiting prominent expression at sites of active neovascularization. Under ischemic/hypoxic conditions, Ang2 initiates neovessel formation by destabilizing existing vasculature to facilitate endothelial sprouting. In murine models of vitrified-warmed ovarian autotransplantation, Ang2 supplementation increased the proportion of morphologically intact follicles to 73.1% (vs. 48.7% in controls) by enhancing graft neovascularization [ 118 119 Follicle-stimulating hormone (FSH) confers cytoprotection in vitrified-warmed ovarian transplantation models through dual mechanisms: (1) upregulating gap junction proteins [connexin 43 (Gja1) and connexin 37 (Gja4)] to enhance cell-cell communication within follicular units, and (2) activating VEGF/VEGFR2 signaling to stimulate angiogenesis. These actions collectively reduce granulosa and stromal cell apoptosis and preserve follicular integrity [ 120 121 122 Suppression of primordial follicle activation AMH AMH acts as a potent suppressor of primordial follicle recruitment. Recent murine studies demonstrate that recombinant AMH administration significantly reduces primordial follicle depletion in vitrified-warmed ovarian autotransplantation models by modulating key regulators within grafts—including tuberous sclerosis complex 1 (TSC1), growth differentiation factor 9 (GDF9), and p-S6K—thereby preserving > 40% of the primordial follicle pool compared to untreated controls [ 123 124 125 mTOR inhibitor Rapamycin, a potent mTOR inhibitor acting downstream of the PI3K/AKT signaling pathway, effectively suppresses aberrant primordial follicle activation during OTC. Pretreatment of murine ovaries with rapamycin prior to vitrification significantly inhibits post-transplantation follicular hyperactivation while preserving normal developmental competence, indicating a transient but critical regulatory role in maintaining follicular quiescence [ 126 127 51 128 Antifreeze proteins and engineered cryoprotectants Antifreeze proteins (AFPs) Natural organisms have evolved specialized adaptations to produce antifreeze proteins (AFPs), enabling survival in subzero environments by mitigating cryoinjury. AFPs employ dual cryoprotective mechanisms—thermal hysteresis and ice recrystallization inhibition—to precisely regulate ice crystal dynamics. These mechanisms constrain ice crystal growth to an average diameter ≤ 20 μm (below the threshold for organelle damage), remodel ice morphology into low-stress hexagonal prisms, and disperse ice crystals uniformly within extracellular spaces, thereby preventing localized compression on follicles while circumventing the cytotoxicity associated with conventional cryoprotectants [ 129 130 131 133 134 136 Despite their potential​​, natural AFPs face scalability limitations due to complex purification processes. ​​To address this​​, Qi et al. designed a 20-residue de novo antifreeze peptide (AVD) wherein Thr⁶-Asn⁸ spacing precisely matches the oxygen lattice spacing on ice prism planes, achieving ice crystal area suppression comparable to natural AFPs. At -80 °C, AVD exhibits bifunctional activity: (1) suppressing ice crystal growth via surface adsorption, and (2) stabilizing voltage-dependent calcium channels to prevent membrane destabilization. Experimental validation demonstrated 95.7% recovery in cryopreserved lung cancer cells (3.1-fold higher than controls) and 34.9% recovery in immune cells (14.5-fold increase), with preserved mitochondrial ultrastructure and proliferative capacity equivalent to fresh cells [ 137 Novel cryoprotectants Recent advances in AFPs research have catalyzed the development of novel cryoprotectants, with graphene oxide (GO) emerging as a promising nanomaterial for ice-crystal regulation. GO’s hexagonal carbon lattice—functionalized with hydroxyl, epoxy, and carboxyl groups—enables structural mimicry of natural AFPs by aligning its oxygen atoms with ice crystal planes, thereby adsorbing to ice surfaces and restricting crystal growth via hydrogen-bond restructuring [ 138 139 140 Polymer-based cryoprotectants, distinguished by high molecular weight, low cytotoxicity, and enhanced biocompatibility, represent promising alternatives to conventional agents such as dimethyl sulfoxide (DMSO). Capitalizing on mechanistic insights from AFPs, researchers have engineered diverse macromolecular architectures—including synthetic polymers, low-molecular-weight carbohydrates, and zwitterionic polyampholytes—for gamete and embryo cryopreservation. Pioneering work by Eniade et al. first identified ice recrystallization inhibition activity in small-molecule carbohydrates, demonstrating their capacity to suppress pathological ice growth through hydrogen-bond disruption at ice crystal interfaces [ 141 142 143 145 146 147 148 149 Conclusion OTC has become the only fertility protection option for girls and women before puberty who need immediate treatment for gonadal toxicity. Although it has been adopted in clinical practice, follicular depletion after transplantation remains a major obstacle, mainly driven by two mechanisms: hypoxia, IRI accompanied by oxidative stress and cell death, and excessive activation of primordial follicles, leading to a reduction in ovarian reserve. Current research strategies aim to mitigate these losses through pharmacological interventions, including antioxidants, pro-angiogenic agents, primordial follicle activation inhibitors, and novel cryoprotectants. New biomaterials, including hydrogels and decellularized scaffolds, are also gradually attracting researchers’ interest. Notably​​, while most agents exhibit monofunctional efficacy, recent evidence underscores the superior potential of combinatorial approaches: coupling antioxidants (e.g., melatonin) with mTOR inhibitors (e.g., rapamycin) synergistically reduces oxidative damage while suppressing follicular hyperactivation, and stem cell-derived paracrine factors (e.g., exosomal miRNAs) concurrently attenuate inflammation and enhance angiogenesis. Critically​​, current evidence is predominantly derived from animal models and human xenograft studies due to the scarcity of human ovarian tissue samples and ethical constraints surrounding experimental manipulation, thereby precluding robust clinical translation. ​​Consequently​​, there is an urgent need for translational clinical trials to optimize cryoprotectant formulations, validate primordial follicle activation suppression strategies (e.g., AMH/rapamycin delivery systems), and standardize metrics for post-transplantation outcomes. Future efforts should prioritize ​​three pillars​​: (1) enhancing graft survival through multi-target interventions (e.g., combining vascularization promoters with anti-fibrotic agents), (2) restoring endocrine function via steroidogenic cell preservation, and (3) maximizing live birth rates through coordinated fertility restoration protocols, ultimately addressing the reproductive autonomy and psychosocial well-being of cancer survivors. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Author contributions This study was designed by JY and YC. YC, JZ (Jialiang Zhang), LW, JX and JC collected and analyzed the literatures. The draft was written and corrected by YC, JZ (Jialiang Zhang), LW, JX and JC and was critically reviewed by JY, MY, RM, JZ (Juepu Zhou) and XH. JY agree to be accountable for all aspects of the work in ensuring that questions related to the accuracy or integrity of any part of the work are appropriately investigated and resolved. All authors read and approved the final manuscript. Funding This work was supported by the National Key Research & Development Program of China (grant number 2022YFC2702503), the Open Project of Hubei Clinical Research Center for Reproductive Medicine (grant number 2025RMOF005) and the Peking University Third Hospital Open Subject of the Department of Obstetrics and Gynecology (grant number BYSYSZKF2022008). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Siegel RL Kratzer TB Giaquinto AN Sung H Jemal A Cancer statistics, 2025 CA Cancer J Clin 2025 75 10 45 39817679 10.3322/caac.21871 PMC11745215 Siegel RL, Kratzer TB, Giaquinto AN, Sung H, Jemal A. Cancer statistics, 2025. CA Cancer J Clin. 2025;75:10–45. 39817679 10.3322/caac.21871 PMC11745215 2. Dolmans MM von Wolff M Poirot C Diaz-Garcia C Cacciottola L Boissel N Transplantation of cryopreserved ovarian tissue in a series of 285 women: a review of five leading European centers Fertil Steril 2021 115 1102 15 10.1016/j.fertnstert.2021.03.008 33933173 Dolmans MM, von Wolff M, Poirot C, Diaz-Garcia C, Cacciottola L, Boissel N, et al. Transplantation of cryopreserved ovarian tissue in a series of 285 women: a review of five leading European centers. Fertil Steril. 2021;115:1102–15. 33933173 10.1016/j.fertnstert.2021.03.008 3. Moragon S Di Liello R Bermejo B Hernando C Olcina E Chirivella I Fertility and breast cancer: A literature review of counseling, preservation options and outcomes Crit Rev Oncol Hematol 2021 166 103461 10.1016/j.critrevonc.2021.103461 34461268 Moragon S, Di Liello R, Bermejo B, Hernando C, Olcina E, Chirivella I, et al. Fertility and breast cancer: A literature review of counseling, preservation options and outcomes. Crit Rev Oncol Hematol. 2021;166:103461. 34461268 10.1016/j.critrevonc.2021.103461 4. Su HI, Lacchetti C, Letourneau J, Partridge AH, Qamar R, Quinn GP et al. Fertility preservation in people with cancer: ASCO guideline update. J Clin Oncol. 2025: JCO2402782. 10.1200/JCO-24-02782 40106739 5. Nadesapillai S van der Velden J van der Coelen S Schleedoorn M Sedney A Spath M TurnerFertility trial: fertility preservation in young girls with Turner syndrome by freezing ovarian cortex tissue-a prospective intervention study Fertil Steril 2023 120 1048 60 10.1016/j.fertnstert.2023.08.004 37549836 Nadesapillai S, van der Velden J, van der Coelen S, Schleedoorn M, Sedney A, Spath M, et al. TurnerFertility trial: fertility preservation in young girls with Turner syndrome by freezing ovarian cortex tissue-a prospective intervention study. Fertil Steril. 2023;120:1048–60. 37549836 10.1016/j.fertnstert.2023.08.004 6. van der Coelen S Nadesapillai S Peek R Braat D Bocca G Finken M Puberty progression in girls with Turner syndrome after ovarian tissue cryopreservation Fertil Steril 2025 123 583 92 10.1016/j.fertnstert.2024.10.025 39433199 van der Coelen S, Nadesapillai S, Peek R, Braat D, Bocca G, Finken M, et al. Puberty progression in girls with Turner syndrome after ovarian tissue cryopreservation. Fertil Steril. 2025;123:583–92. 39433199 10.1016/j.fertnstert.2024.10.025 7. Cariati F Carbone L Iorio GG Conforti A Capasso A Bagnulo F Cryopreservation of ovarian tissue: the biggest challenge of oncofertility Minerva Obstet Gynecol 2023 75 371 8 10.23736/S2724-606X.22.05066-7 35420290 Cariati F, Carbone L, Iorio GG, Conforti A, Capasso A, Bagnulo F, et al. Cryopreservation of ovarian tissue: the biggest challenge of oncofertility. Minerva Obstet Gynecol. 2023;75:371–8. 35420290 10.23736/S2724-606X.22.05066-7 8. Donnez J Dolmans MM Demylle D Jadoul P Pirard C Squifflet J Livebirth after orthotopic transplantation of cryopreserved ovarian tissue Lancet 2004 364 1405 10 10.1016/S0140-6736(04)17222-X 15488215 Donnez J, Dolmans MM, Demylle D, Jadoul P, Pirard C, Squifflet J, et al. Livebirth after orthotopic transplantation of cryopreserved ovarian tissue. Lancet. 2004;364:1405–10. 15488215 10.1016/S0140-6736(04)17222-X 9. Han C Zeng Q He L Luan Z Liu R Zhang G Advances in the mechanisms related to follicle loss after frozen-thawed ovarian tissue transplantation Transpl Immunol 2023 81 101935 10.1016/j.trim.2023.101935 37739235 Han C, Zeng Q, He L, Luan Z, Liu R, Zhang G, et al. Advances in the mechanisms related to follicle loss after frozen-thawed ovarian tissue transplantation. Transpl Immunol. 2023;81:101935. 37739235 10.1016/j.trim.2023.101935 10. Dueholm Hjorth IM Kristensen SG Dueholm M Humaidan P Reproductive outcomes after in vitro fertilization treatment in a cohort of Danish women transplanted with cryopreserved ovarian tissue Fertil Steril 2020 114 379 87 10.1016/j.fertnstert.2020.03.035 32624219 Dueholm Hjorth IM, Kristensen SG, Dueholm M, Humaidan P. Reproductive outcomes after in vitro fertilization treatment in a cohort of Danish women transplanted with cryopreserved ovarian tissue. Fertil Steril. 2020;114:379–87. 32624219 10.1016/j.fertnstert.2020.03.035 11. Practice Committee of the American Society for Reproductive Medicine Electronic address aao. Fertility preservation in patients undergoing gonadotoxic therapy or gonadectomy: a committee opinion Fertil Steril 2019 112 1022 33 10.1016/j.fertnstert.2019.09.013 31843073 Practice Committee of the American Society for Reproductive Medicine. Electronic address aao. Fertility preservation in patients undergoing gonadotoxic therapy or gonadectomy: a committee opinion. Fertil Steril. 2019;112:1022–33. 31843073 10.1016/j.fertnstert.2019.09.013 12. Donnez J Dolmans MM Fertility preservation in women N Engl J Med 2017 377 1657 65 10.1056/NEJMra1614676 29069558 Donnez J, Dolmans MM. Fertility preservation in women. N Engl J Med. 2017;377:1657–65. 29069558 10.1056/NEJMra1614676 13. Mahmood S Drakeley A Homburg R Bambang K Fertility preservation in female patients with cancer Clin Oncol (R Coll Radiol) 2022 34 508 13 10.1016/j.clon.2022.03.021 35491364 Mahmood S, Drakeley A, Homburg R, Bambang K. Fertility preservation in female patients with cancer. Clin Oncol (R Coll Radiol). 2022;34:508–13. 35491364 10.1016/j.clon.2022.03.021 14. Henry L Berek JS Diaz I Feldberg D Mocanu E Niederberger CC FIGO statement: fertility preservation Int J Gynaecol Obstet 2023 163 790 4 10.1002/ijgo.15187 37807831 Henry L, Berek JS, Diaz I, Feldberg D, Mocanu E, Niederberger CC, et al. FIGO statement: fertility preservation. Int J Gynaecol Obstet. 2023;163:790–4. 37807831 10.1002/ijgo.15187 15. Dolmans MM Donnez J Fertility preservation in women for medical and social reasons: oocytes vs ovarian tissue Best Pract Res Clin Obstet Gynaecol 2021 70 63 80 10.1016/j.bpobgyn.2020.06.011 32800711 Dolmans MM, Donnez J. Fertility preservation in women for medical and social reasons: oocytes vs ovarian tissue. Best Pract Res Clin Obstet Gynaecol. 2021;70:63–80. 32800711 10.1016/j.bpobgyn.2020.06.011 16. Pampanini V Hassan J Oliver E Stukenborg JB Damdimopoulou P Jahnukainen K Fertility preservation for prepubertal patients at risk of infertility: present status and future perspectives Horm Res Paediatr 2020 93 599 608 10.1159/000516087 33887724 Pampanini V, Hassan J, Oliver E, Stukenborg JB, Damdimopoulou P, Jahnukainen K. Fertility preservation for prepubertal patients at risk of infertility: present status and future perspectives. Horm Res Paediatr. 2020;93:599–608. 33887724 10.1159/000516087 17. Diaz AA Kubo H Handa N Hanna M Laronda MM A systematic review of ovarian tissue transplantation outcomes by ovarian tissue processing size for cryopreservation Front Endocrinol (Lausanne) 2022 13 918899 10.3389/fendo.2022.918899 35774145 PMC9239173 Diaz AA, Kubo H, Handa N, Hanna M, Laronda MM. A systematic review of ovarian tissue transplantation outcomes by ovarian tissue processing size for cryopreservation. Front Endocrinol (Lausanne). 2022;13:918899. 35774145 10.3389/fendo.2022.918899 PMC9239173 18. Najafi A Asadi E Benson JD Ovarian tissue cryopreservation and transplantation: a review on reactive oxygen species generation and antioxidant therapy Cell Tissue Res 2023 393 401 23 10.1007/s00441-023-03794-2 37328708 Najafi A, Asadi E, Benson JD. Ovarian tissue cryopreservation and transplantation: a review on reactive oxygen species generation and antioxidant therapy. Cell Tissue Res. 2023;393:401–23. 37328708 10.1007/s00441-023-03794-2 19. Roness H Meirow D FERTILITY PRESERVATION: follicle reserve loss in ovarian tissue transplantation Reproduction 2019 158 F35 44 10.1530/REP-19-0097 31394506 Roness H, Meirow D. Fertility preservation: follicle reserve loss in ovarian tissue transplantation. Reproduction. 2019;158:F35–44. 31394506 10.1530/REP-19-0097 20. Xu Z Autophagy phenomenon in mice ovaries following transplantation Theriogenology 2023 195 40 5 10.1016/j.theriogenology.2022.10.018 36283225 Xu Z. Autophagy phenomenon in mice ovaries following transplantation. Theriogenology. 2023;195:40–5. 36283225 10.1016/j.theriogenology.2022.10.018 21. Baird DT Webb R Campbell BK Harkness LM Gosden RG Long-term ovarian function in sheep after ovariectomy and transplantation of autografts stored at -196 C Endocrinology 1999 140 462 71 10.1210/endo.140.1.6453 9886858 Baird DT, Webb R, Campbell BK, Harkness LM, Gosden RG. Long-term ovarian function in sheep after ovariectomy and transplantation of autografts stored at -196 C. Endocrinology. 1999;140:462–71. 9886858 10.1210/endo.140.1.6453 22. Arav A Patrizio P Techniques of cryopreservation for ovarian tissue and whole ovary Clin Med Insights Reprod Health 2019 13 1179558119884945 10.1177/1179558119884945 31839716 PMC6893924 Arav A, Patrizio P. Techniques of cryopreservation for ovarian tissue and whole ovary. Clin Med Insights Reprod Health. 2019;13:1179558119884945. 31839716 10.1177/1179558119884945 PMC6893924 23. Hossay C, Donnez J, Dolmans MM. Whole ovary cryopreservation and transplantation: A systematic review of challenges and research developments in animal experiments and humans. J Clin Med. 2020; 9. 10.3390/jcm9103196 PMC7601276 33023111 24. Hajati F Kashi AM Totonchi M Valojerdi MR Post-thawing and culture comparison of three routine slow freezing methods for human ovarian tissue cryopreservation: histological, molecular, and hormonal aspects Cryobiology 2022 104 32 41 10.1016/j.cryobiol.2021.11.174 34808110 Hajati F, Kashi AM, Totonchi M, Valojerdi MR. Post-thawing and culture comparison of three routine slow freezing methods for human ovarian tissue cryopreservation: histological, molecular, and hormonal aspects. Cryobiology. 2022;104:32–41. 34808110 10.1016/j.cryobiol.2021.11.174 25. Shi Q Xie Y Wang Y Li S Vitrification versus slow freezing for human ovarian tissue cryopreservation: a systematic review and meta-anlaysis Sci Rep 2017 7 8538 10.1038/s41598-017-09005-7 28819292 PMC5561141 Shi Q, Xie Y, Wang Y, Li S. Vitrification versus slow freezing for human ovarian tissue cryopreservation: a systematic review and meta-anlaysis. Sci Rep. 2017;7:8538. 28819292 10.1038/s41598-017-09005-7 PMC5561141 26. Liebermann J Nawroth F Isachenko V Isachenko E Rahimi G Tucker MJ Potential importance of vitrification in reproductive medicine Biol Reprod 2002 67 1671 80 10.1095/biolreprod.102.006833 12444040 Liebermann J, Nawroth F, Isachenko V, Isachenko E, Rahimi G, Tucker MJ. Potential importance of vitrification in reproductive medicine. Biol Reprod. 2002;67:1671–80. 12444040 10.1095/biolreprod.102.006833 27. Wang TR Yan J Lu CL Xia X Yin TL Zhi X Human single follicle growth in vitro from cryopreserved ovarian tissue after slow freezing or vitrification Hum Reprod 2016 31 763 73 10.1093/humrep/dew005 26851603 Wang TR, Yan J, Lu CL, Xia X, Yin TL, Zhi X, et al. Human single follicle growth in vitro from cryopreserved ovarian tissue after slow freezing or vitrification. Hum Reprod. 2016;31:763–73. 26851603 10.1093/humrep/dew005 28. Chang HJ Moon JH Lee JR Jee BC Suh CS Kim SH Optimal condition of vitrification method for cryopreservation of human ovarian cortical tissues J Obstet Gynaecol Res 2011 37 1092 101 10.1111/j.1447-0756.2010.01496.x 21501331 Chang HJ, Moon JH, Lee JR, Jee BC, Suh CS, Kim SH. Optimal condition of vitrification method for cryopreservation of human ovarian cortical tissues. J Obstet Gynaecol Res. 2011;37:1092–101. 21501331 10.1111/j.1447-0756.2010.01496.x 29. Klocke S Bundgen N Koster F Eichenlaub-Ritter U Griesinger G Slow-freezing versus vitrification for human ovarian tissue cryopreservation Arch Gynecol Obstet 2015 291 419 26 10.1007/s00404-014-3390-6 25115279 Klocke S, Bundgen N, Koster F, Eichenlaub-Ritter U, Griesinger G. Slow-freezing versus vitrification for human ovarian tissue cryopreservation. Arch Gynecol Obstet. 2015;291:419–26. 25115279 10.1007/s00404-014-3390-6 30. Kong Q Pei C Rahimi G Mallmann P Isachenko V Comparison of the quality of ovarian tissue cryopreservation by conventional slow cryopreservation and vitrification-a systematic review and meta-analysis J Ovarian Res 2025 18 62 10.1186/s13048-024-01561-7 40140886 PMC11948982 Kong Q, Pei C, Rahimi G, Mallmann P, Isachenko V. Comparison of the quality of ovarian tissue cryopreservation by conventional slow cryopreservation and vitrification-a systematic review and meta-analysis. J Ovarian Res. 2025;18:62. 40140886 10.1186/s13048-024-01561-7 PMC11948982 31. Kometas M Christman GM Kramer J Rhoton-Vlasak A Methods of ovarian tissue cryopreservation: is vitrification superior to slow freezing?-Ovarian tissue freezing methods Reprod Sci 2021 28 3291 302 10.1007/s43032-021-00591-6 33939167 Kometas M, Christman GM, Kramer J, Rhoton-Vlasak A. Methods of ovarian tissue cryopreservation: is vitrification superior to slow freezing?-Ovarian tissue freezing methods. Reprod Sci. 2021;28:3291–302. 33939167 10.1007/s43032-021-00591-6 32. Chung JPW Chan DYL Song Y Ng EYL Law TSM Ng K Implementation of ovarian tissue cryopreservation in Hong Kong Hong Kong Med J 2023 29 121 31 36822598 10.12809/hkmj2210220 Chung JPW, Chan DYL, Song Y, Ng EYL, Law TSM, Ng K, et al. Implementation of ovarian tissue cryopreservation in Hong Kong. Hong Kong Med J. 2023;29:121–31. 36822598 10.12809/hkmj2210220 33. Kawamura K Cheng Y Suzuki N Deguchi M Sato Y Takae S Hippo signaling disruption and Akt stimulation of ovarian follicles for infertility treatment Proc Natl Acad Sci U S A 2013 110 17474 9 10.1073/pnas.1312830110 24082083 PMC3808580 Kawamura K, Cheng Y, Suzuki N, Deguchi M, Sato Y, Takae S, et al. Hippo signaling disruption and Akt stimulation of ovarian follicles for infertility treatment. Proc Natl Acad Sci U S A. 2013;110:17474–9. 24082083 10.1073/pnas.1312830110 PMC3808580 34. Suzuki N Yoshioka N Takae S Sugishita Y Tamura M Hashimoto S Successful fertility preservation following ovarian tissue vitrification in patients with primary ovarian insufficiency Hum Reprod 2015 30 608 15 10.1093/humrep/deu353 25567618 Suzuki N, Yoshioka N, Takae S, Sugishita Y, Tamura M, Hashimoto S, et al. Successful fertility preservation following ovarian tissue vitrification in patients with primary ovarian insufficiency. Hum Reprod. 2015;30:608–15. 25567618 10.1093/humrep/deu353 35. Ruan X Du J Lu D Duan W Jin F Kong W First live birth in China after cryopreserved ovarian tissue transplantation to prevent premature ovarian insufficiency Climacteric 2022 25 421 4 10.1080/13697137.2022.2064215 35504301 Ruan X, Du J, Lu D, Duan W, Jin F, Kong W, et al. First live birth in China after cryopreserved ovarian tissue transplantation to prevent premature ovarian insufficiency. Climacteric. 2022;25:421–4. 35504301 10.1080/13697137.2022.2064215 36. Ruan X Du J Jin F Gu M Cheng J Li Y Second pregnancy in China 5 years after ovarian tissue transplantation to prevent iatrogenic POI Climacteric 2025 28 212 6 10.1080/13697137.2025.2471062 40063149 Ruan X, Du J, Jin F, Gu M, Cheng J, Li Y, et al. Second pregnancy in China 5 years after ovarian tissue transplantation to prevent iatrogenic POI. Climacteric. 2025;28:212–6. 40063149 10.1080/13697137.2025.2471062 37. Mamsen LS Olesen HO Pors SE Hu X Bjerring P Christiansen K Effects of er:yag laser treatment on re-vascularization and follicle survival in frozen/thawed human ovarian cortex transplanted to immunodeficient mice J Assist Reprod Genet 2021 38 2745 56 10.1007/s10815-021-02292-0 34453231 PMC8581115 Mamsen LS, Olesen HO, Pors SE, Hu X, Bjerring P, Christiansen K, et al. Effects of er:yag laser treatment on re-vascularization and follicle survival in frozen/thawed human ovarian cortex transplanted to immunodeficient mice. J Assist Reprod Genet. 2021;38:2745–56. 34453231 10.1007/s10815-021-02292-0 PMC8581115 38. Donnez J Manavella DD Dolmans MM Techniques for ovarian tissue transplantation and results Minerva Ginecol 2018 70 424 31 29644328 10.23736/S0026-4784.18.04228-4 Donnez J, Manavella DD, Dolmans MM. Techniques for ovarian tissue transplantation and results. Minerva Ginecol. 2018;70:424–31. 29644328 10.23736/S0026-4784.18.04228-4 39. Cacciottola L Donnez J Dolmans MM Ovarian tissue damage after grafting: systematic review of strategies to improve follicle outcomes Reprod Biomed Online 2021 43 351 69 10.1016/j.rbmo.2021.06.019 34384692 Cacciottola L, Donnez J, Dolmans MM. Ovarian tissue damage after grafting: systematic review of strategies to improve follicle outcomes. Reprod Biomed Online. 2021;43:351–69. 34384692 10.1016/j.rbmo.2021.06.019 40. Wang D Geng M Gan D Han G Gao G Xing A Effect of Resveratrol on mouse ovarian vitrification and transplantation Reprod Biol Endocrinol 2021 19 54 10.1186/s12958-021-00735-y 33836793 PMC8033708 Wang D, Geng M, Gan D, Han G, Gao G, Xing A, et al. Effect of Resveratrol on mouse ovarian vitrification and transplantation. Reprod Biol Endocrinol. 2021;19:54. 33836793 10.1186/s12958-021-00735-y PMC8033708 41. Einenkel R, Schallmoser A, Sanger N. Metabolic and secretory recovery of slow frozen-thawed human ovarian tissue in vitro. Mol Hum Reprod. 2022; 28. 10.1093/molehr/gaac037 36342218 42. Liu J Van der Elst J Van den Broecke R Dhont M Early massive follicle loss and apoptosis in heterotopically grafted newborn mouse ovaries Hum Reprod 2002 17 605 11 10.1093/humrep/17.3.605 11870111 Liu J, Van der Elst J, Van den Broecke R, Dhont M. Early massive follicle loss and apoptosis in heterotopically grafted newborn mouse ovaries. Hum Reprod. 2002;17:605–11. 11870111 10.1093/humrep/17.3.605 43. Van Eyck AS Jordan BF Gallez B Heilier JF Van Langendonckt A Donnez J Electron paramagnetic resonance as a tool to evaluate human ovarian tissue reoxygenation after xenografting Fertil Steril 2009 92 374 81 10.1016/j.fertnstert.2008.05.012 18692811 Van Eyck AS, Jordan BF, Gallez B, Heilier JF, Van Langendonckt A, Donnez J. Electron paramagnetic resonance as a tool to evaluate human ovarian tissue reoxygenation after xenografting. Fertil Steril. 2009;92:374–81. 18692811 10.1016/j.fertnstert.2008.05.012 44. Damous LL, Silva SM, Carbonel AP, Simoes RS, Simoes MJ, Montero EF. Effect of remote ischemic preconditioning on rat estradiol serum levels and follicular development after ovarian transplantation. Transpl Proc. 2009;41:830–3. 10.1016/j.transproceed.2009.01.070 19376364 45. Kalogeris T Baines CP Krenz M Korthuis RJ Cell biology of ischemia/reperfusion injury Int Rev Cell Mol Biol 2012 298 229 317 10.1016/B978-0-12-394309-5.00006-7 22878108 PMC3904795 Kalogeris T, Baines CP, Krenz M, Korthuis RJ. Cell biology of ischemia/reperfusion injury. Int Rev Cell Mol Biol. 2012;298:229–317. 22878108 10.1016/B978-0-12-394309-5.00006-7 PMC3904795 46. Wang HX Lu XL Huang WJ Zhang JM Pyroptosis is involved in cryopreservation and auto-transplantation of mouse ovarian tissues and pyroptosis Inhibition improves ovarian graft function Res Vet Sci 2019 124 52 6 10.1016/j.rvsc.2019.02.004 30849614 Wang HX, Lu XL, Huang WJ, Zhang JM. Pyroptosis is involved in cryopreservation and auto-transplantation of mouse ovarian tissues and pyroptosis Inhibition improves ovarian graft function. Res Vet Sci. 2019;124:52–6. 30849614 10.1016/j.rvsc.2019.02.004 47. Cacciottola L Courtoy GE Nguyen TYT Hossay C Donnez J Dolmans MM Adipose tissue-derived stem cells protect the primordial follicle pool from both direct follicle death and abnormal activation after ovarian tissue transplantation J Assist Reprod Genet 2021 38 151 61 10.1007/s10815-020-02005-z 33184773 PMC7823002 Cacciottola L, Courtoy GE, Nguyen TYT, Hossay C, Donnez J, Dolmans MM. Adipose tissue-derived stem cells protect the primordial follicle pool from both direct follicle death and abnormal activation after ovarian tissue transplantation. J Assist Reprod Genet. 2021;38:151–61. 33184773 10.1007/s10815-020-02005-z PMC7823002 48. Yang Y Cheung HH Law WN Zhang C Chan WY Pei X New insights into the role of autophagy in ovarian cryopreservation by vitrification Biol Reprod 2016 94 137 10.1095/biolreprod.115.136374 26911431 Yang Y, Cheung HH, Law WN, Zhang C, Chan WY, Pei X, et al. New insights into the role of autophagy in ovarian cryopreservation by vitrification. Biol Reprod. 2016;94:137. 26911431 10.1095/biolreprod.115.136374 49. Terren C Munaut C Molecular basis associated with the control of primordial follicle activation during transplantation of cryopreserved ovarian tissue Reprod Sci 2021 28 1257 66 10.1007/s43032-020-00318-z 32989631 Terren C, Munaut C. Molecular basis associated with the control of primordial follicle activation during transplantation of cryopreserved ovarian tissue. Reprod Sci. 2021;28:1257–66. 32989631 10.1007/s43032-020-00318-z 50. Celik S Ozkavukcu S Celik-Ozenci C Altered expression of activator proteins that control follicle reserve after ovarian tissue cryopreservation/transplantation and primordial follicle loss prevention by Rapamycin J Assist Reprod Genet 2020 37 2119 36 10.1007/s10815-020-01875-7 32651677 PMC7492284 Celik S, Ozkavukcu S, Celik-Ozenci C. Altered expression of activator proteins that control follicle reserve after ovarian tissue cryopreservation/transplantation and primordial follicle loss prevention by Rapamycin. J Assist Reprod Genet. 2020;37:2119–36. 32651677 10.1007/s10815-020-01875-7 PMC7492284 51. Terren C Nisolle M Munaut C Pharmacological Inhibition of the PI3K/PTEN/Akt and mTOR signalling pathways limits follicle activation induced by ovarian cryopreservation and in vitro culture J Ovarian Res 2021 14 95 10.1186/s13048-021-00846-5 34275490 PMC8287691 Terren C, Nisolle M, Munaut C. Pharmacological Inhibition of the PI3K/PTEN/Akt and mTOR signalling pathways limits follicle activation induced by ovarian cryopreservation and in vitro culture. J Ovarian Res. 2021;14:95. 34275490 10.1186/s13048-021-00846-5 PMC8287691 52. Liu HM, Cheng MY, Xun MH, Zhao ZW, Zhang Y, Tang W et al. Possible mechanisms of oxidative Stress-Induced skin cellular senescence, inflammation, and cancer and the therapeutic potential of plant polyphenols. Int J Mol Sci. 2023; 24. 10.3390/ijms24043755 PMC9962998 36835162 53. Grosbois J Demeestere I Dynamics of PI3K and Hippo signaling pathways during in vitro human follicle activation Hum Reprod 2018 33 1705 14 10.1093/humrep/dey250 30032281 Grosbois J, Demeestere I. Dynamics of PI3K and Hippo signaling pathways during in vitro human follicle activation. Hum Reprod. 2018;33:1705–14. 30032281 10.1093/humrep/dey250 54. Masciangelo R Hossay C Chiti MC Manavella DD Amorim CA Donnez J Role of the PI3K and Hippo pathways in follicle activation after grafting of human ovarian tissue J Assist Reprod Genet 2020 37 101 8 10.1007/s10815-019-01628-1 31732846 PMC7000614 Masciangelo R, Hossay C, Chiti MC, Manavella DD, Amorim CA, Donnez J, et al. Role of the PI3K and Hippo pathways in follicle activation after grafting of human ovarian tissue. J Assist Reprod Genet. 2020;37:101–8. 31732846 10.1007/s10815-019-01628-1 PMC7000614 55. Cacciottola L, Nguyen TYT, Chiti MC, Camboni A, Amorim CA, Donnez J et al. Long-Term advantages of ovarian reserve maintenance and follicle development using adipose tissue-Derived stem cells in ovarian tissue transplantation. J Clin Med. 2020; 9. 10.3390/jcm9092980 PMC7564479 32942743 56. Zhou F Shi LB Zhang SY Ovarian fibrosis: A phenomenon of concern Chin Med J (Engl) 2017 130 365 71 10.4103/0366-6999.198931 28139522 PMC5308021 Zhou F, Shi LB, Zhang SY. Ovarian fibrosis: A phenomenon of concern. Chin Med J (Engl). 2017;130:365–71. 28139522 10.4103/0366-6999.198931 PMC5308021 57. McCloskey CW Cook DP Kelly BS Azzi F Allen CH Forsyth A Metformin abrogates Age-Associated ovarian fibrosis Clin Cancer Res 2020 26 632 42 10.1158/1078-0432.CCR-19-0603 31597663 McCloskey CW, Cook DP, Kelly BS, Azzi F, Allen CH, Forsyth A, et al. Metformin abrogates Age-Associated ovarian fibrosis. Clin Cancer Res. 2020;26:632–42. 31597663 10.1158/1078-0432.CCR-19-0603 58. Mara JN Zhou LT Larmore M Johnson B Ayiku R Amargant F Ovulation and ovarian wound healing are impaired with advanced reproductive age Aging 2020 12 9686 713 10.18632/aging.103237 32407290 PMC7288922 Mara JN, Zhou LT, Larmore M, Johnson B, Ayiku R, Amargant F, et al. Ovulation and ovarian wound healing are impaired with advanced reproductive age. Aging. 2020;12:9686–713. 32407290 10.18632/aging.103237 PMC7288922 59. Briley SM Jasti S McCracken JM Hornick JE Fegley B Pritchard MT Reproductive age-associated fibrosis in the stroma of the mammalian ovary Reproduction 2016 152 245 60 10.1530/REP-16-0129 27491879 PMC4979755 Briley SM, Jasti S, McCracken JM, Hornick JE, Fegley B, Pritchard MT, et al. Reproductive age-associated fibrosis in the stroma of the mammalian ovary. Reproduction. 2016;152:245–60. 27491879 10.1530/REP-16-0129 PMC4979755 60. Kitajima M Murakami N Kitajima Y Kajimura I Matsumura A Matsumoto K Accumulation of fibrosis and altered perifollicular stromal differentiation in vitrified-thawed human ovarian tissue xenografted to nude mice Reprod Med Biol 2022 21 e12451 10.1002/rmb2.12451 35386365 PMC8967281 Kitajima M, Murakami N, Kitajima Y, Kajimura I, Matsumura A, Matsumoto K, et al. Accumulation of fibrosis and altered perifollicular stromal differentiation in vitrified-thawed human ovarian tissue xenografted to nude mice. Reprod Med Biol. 2022;21:e12451. 35386365 10.1002/rmb2.12451 PMC8967281 61. Mammoto A Mammoto T Ingber DE Mechanosensitive mechanisms in transcriptional regulation J Cell Sci 2012 125 3061 73 22797927 10.1242/jcs.093005 PMC3434847 Mammoto A, Mammoto T, Ingber DE. Mechanosensitive mechanisms in transcriptional regulation. J Cell Sci. 2012;125:3061–73. 22797927 10.1242/jcs.093005 PMC3434847 62. Marcantonini G, Bartolini D, Zatini L, Costa S, Passerini M, Rende M et al. Natural cryoprotective and cytoprotective agents in cryopreservation: A focus on melatonin. Molecules. 2022; 27. 10.3390/molecules27103254 PMC9145333 35630729 63. Shiroma ME Botelho NM Damous LL Baracat EC Soares JM Jr. Melatonin influence in ovary transplantation: systematic review J Ovarian Res 2016 9 33 10.1186/s13048-016-0245-8 27287621 PMC4902985 Shiroma ME, Botelho NM, Damous LL, Baracat EC, Soares JM. Jr. Melatonin influence in ovary transplantation: systematic review. J Ovarian Res. 2016;9:33. 27287621 10.1186/s13048-016-0245-8 PMC4902985 64. Sun TC Liu XC Yang SH Song LL Zhou SJ Deng SL Melatonin inhibits oxidative stress and apoptosis in cryopreserved ovarian tissues via Nrf2/HO-1 signaling pathway Front Mol Biosci 2020 7 163 10.3389/fmolb.2020.00163 32850957 PMC7403229 Sun TC, Liu XC, Yang SH, Song LL, Zhou SJ, Deng SL, et al. Melatonin inhibits oxidative stress and apoptosis in cryopreserved ovarian tissues via Nrf2/HO-1 signaling pathway. Front Mol Biosci. 2020;7:163. 32850957 10.3389/fmolb.2020.00163 PMC7403229 65. Cheng LY Sun TC Liu XC Yu H Zhou SJ Tian L Melatonin induction of HSP90 expression exerts cryoprotective effect on ovarian tissue Cryobiology 2021 98 134 8 10.1016/j.cryobiol.2020.12.002 33279510 Cheng LY, Sun TC, Liu XC, Yu H, Zhou SJ, Tian L, et al. Melatonin induction of HSP90 expression exerts cryoprotective effect on ovarian tissue. Cryobiology. 2021;98:134–8. 33279510 10.1016/j.cryobiol.2020.12.002 66. Liu XC Sun TC Li HY Si LN Wei M Chen ZH Antioxidative effect of melatonin on cryopreserved ovarian tissue in mice Cryobiology 2020 96 99 105 10.1016/j.cryobiol.2020.07.010 32738264 Liu XC, Sun TC, Li HY, Si LN, Wei M, Chen ZH, et al. Antioxidative effect of melatonin on cryopreserved ovarian tissue in mice. Cryobiology. 2020;96:99–105. 32738264 10.1016/j.cryobiol.2020.07.010 67. Noori Hassanvand M Soleimani Mehranjani M Shojafar E Melatonin improves the structure and function of autografted mice ovaries through reducing inflammation: A Stereological and biochemical analysis Int Immunopharmacol 2019 74 105679 10.1016/j.intimp.2019.105679 31202180 Noori Hassanvand M, Soleimani Mehranjani M, Shojafar E. Melatonin improves the structure and function of autografted mice ovaries through reducing inflammation: A Stereological and biochemical analysis. Int Immunopharmacol. 2019;74:105679. 31202180 10.1016/j.intimp.2019.105679 68. Hemadi M Abolhassani F Akbari M Sobhani A Pasbakhsh P Ahrlund-Richter L Melatonin promotes the cumulus-oocyte complexes quality of vitrified-thawed murine ovaries; with increased mean number of follicles survival and ovary size following heterotopic transplantation Eur J Pharmacol 2009 618 84 90 10.1016/j.ejphar.2009.07.018 19622351 Hemadi M, Abolhassani F, Akbari M, Sobhani A, Pasbakhsh P, Ahrlund-Richter L, et al. Melatonin promotes the cumulus-oocyte complexes quality of vitrified-thawed murine ovaries; with increased mean number of follicles survival and ovary size following heterotopic transplantation. Eur J Pharmacol. 2009;618:84–90. 19622351 10.1016/j.ejphar.2009.07.018 69. Izadpanah M Del Bakhshayesh AR Bahroudi Z Seghinsara AM Beheshti R Mahdipour M Melatonin and endothelial cell-loaded alginate-fibrin hydrogel promoted angiogenesis in rat cryopreserved/thawed ovaries transplanted to the heterotopic sites J Biol Eng 2023 17 23 10.1186/s13036-023-00343-x 36978096 PMC10053723 Izadpanah M, Del Bakhshayesh AR, Bahroudi Z, Seghinsara AM, Beheshti R, Mahdipour M, et al. Melatonin and endothelial cell-loaded alginate-fibrin hydrogel promoted angiogenesis in rat cryopreserved/thawed ovaries transplanted to the heterotopic sites. J Biol Eng. 2023;17:23. 36978096 10.1186/s13036-023-00343-x PMC10053723 70. Rasaeifar K Zavareh S Hajighasem-Kashani M Nasiri M Effects of pulsed electromagnetic fields and N-acetylcysteine on transplantation of vitrified mouse ovarian tissue Electromagn Biol Med 2023 42 67 80 10.1080/15368378.2023.2246503 37573526 Rasaeifar K, Zavareh S, Hajighasem-Kashani M, Nasiri M. Effects of pulsed electromagnetic fields and N-acetylcysteine on transplantation of vitrified mouse ovarian tissue. Electromagn Biol Med. 2023;42:67–80. 37573526 10.1080/15368378.2023.2246503 71. Mahmoodi M Soleimani Mehranjani M Shariatzadeh SM Eimani H Shahverdi A N-acetylcysteine improves function and follicular survival in mice ovarian grafts through Inhibition of oxidative stress Reprod Biomed Online 2015 30 101 10 10.1016/j.rbmo.2014.09.013 25458850 Mahmoodi M, Soleimani Mehranjani M, Shariatzadeh SM, Eimani H, Shahverdi A. N-acetylcysteine improves function and follicular survival in mice ovarian grafts through Inhibition of oxidative stress. Reprod Biomed Online. 2015;30:101–10. 25458850 10.1016/j.rbmo.2014.09.013 72. Ebrahimi F Zavareh S Nasiri M The combination of estradiol and N-Acetylcysteine reduces Ischemia-Reperfusion injuries of mice autografted ovarian tissue Biopreserv Biobank 2024 22 29 37 10.1089/bio.2022.0184 36827384 Ebrahimi F, Zavareh S, Nasiri M. The combination of estradiol and N-Acetylcysteine reduces Ischemia-Reperfusion injuries of mice autografted ovarian tissue. Biopreserv Biobank. 2024;22:29–37. 36827384 10.1089/bio.2022.0184 73. Olesen HO Pors SE Jensen LB Gronning AP Lemser CE Nguyen Heimburger MTH N-acetylcysteine protects ovarian follicles from ischemia-reperfusion injury in xenotransplanted human ovarian tissue Hum Reprod 2021 36 429 43 10.1093/humrep/deaa291 33246336 Olesen HO, Pors SE, Jensen LB, Gronning AP, Lemser CE, Nguyen Heimburger MTH, et al. N-acetylcysteine protects ovarian follicles from ischemia-reperfusion injury in xenotransplanted human ovarian tissue. Hum Reprod. 2021;36:429–43. 33246336 10.1093/humrep/deaa291 74. Suzuki H Ishijima T Maruyama S Yanagimoto Ueta Y Abe Y Saitoh H Beneficial effect of desialylated erythropoietin administration on the frozen-thawed canine ovarian xenotransplantation J Assist Reprod Genet 2008 25 571 5 10.1007/s10815-008-9271-9 18972200 PMC2593764 Suzuki H, Ishijima T, Maruyama S, Yanagimoto Ueta Y, Abe Y, Saitoh H. Beneficial effect of desialylated erythropoietin administration on the frozen-thawed canine ovarian xenotransplantation. J Assist Reprod Genet. 2008;25:571–5. 18972200 10.1007/s10815-008-9271-9 PMC2593764 75. Commin L Buff S Rosset E Galet C Allard A Bruyere P Follicle development in cryopreserved bitch ovarian tissue grafted to immunodeficient mouse Reprod Fertil Dev 2012 24 461 71 10.1071/RD11166 22401278 Commin L, Buff S, Rosset E, Galet C, Allard A, Bruyere P, et al. Follicle development in cryopreserved bitch ovarian tissue grafted to immunodeficient mouse. Reprod Fertil Dev. 2012;24:461–71. 22401278 10.1071/RD11166 76. Wakasa I Hayashi M Abe Y Suzuki H Distribution of follicles in canine ovarian tissues and xenotransplantation of cryopreserved ovarian tissues with even distribution of follicles Reprod Domest Anim 2017 52 Suppl 2 219 23 10.1111/rda.12857 27892637 Wakasa I, Hayashi M, Abe Y, Suzuki H. Distribution of follicles in canine ovarian tissues and xenotransplantation of cryopreserved ovarian tissues with even distribution of follicles. Reprod Domest Anim. 2017;52(Suppl 2):219–23. 27892637 10.1111/rda.12857 77. Kolusari A Okyay AG Kockaya EA The effect of erythropoietin in preventing Ischemia-Reperfusion injury in ovarian tissue transplantation Reprod Sci 2018 25 406 13 10.1177/1933719117715127 28655290 Kolusari A, Okyay AG, Kockaya EA. The effect of erythropoietin in preventing Ischemia-Reperfusion injury in ovarian tissue transplantation. Reprod Sci. 2018;25:406–13. 28655290 10.1177/1933719117715127 78. Mahmoodi M Soleimani Mehranjani M Shariatzadeh SM Eimani H Shahverdi A Effects of erythropoietin on ischemia, follicular survival, and ovarian function in ovarian grafts Reproduction 2014 147 733 41 10.1530/REP-13-0379 24492857 Mahmoodi M, Soleimani Mehranjani M, Shariatzadeh SM, Eimani H, Shahverdi A. Effects of erythropoietin on ischemia, follicular survival, and ovarian function in ovarian grafts. Reproduction. 2014;147:733–41. 24492857 10.1530/REP-13-0379 79. Rodrigues AQ Silva IM Goulart JT Araujo LO Ribeiro RB Aguiar BA Effects of erythropoietin on ischaemia-reperfusion when administered before and after ovarian tissue transplantation in mice Reprod Biomed Online 2023 47 103234 10.1016/j.rbmo.2023.05.006 37524029 Rodrigues AQ, Silva IM, Goulart JT, Araujo LO, Ribeiro RB, Aguiar BA, et al. Effects of erythropoietin on ischaemia-reperfusion when administered before and after ovarian tissue transplantation in mice. Reprod Biomed Online. 2023;47:103234. 37524029 10.1016/j.rbmo.2023.05.006 80. Sapmaz T Kale E Pence ME Sevgin K Tekayev M Topkaraoglu S Treatment strategies with vitamin E and C in autologous intraperitoneal ovarian transplantation and its impact on ovarian surface epithelium and follicle reserve Biochem Biophys Res Commun 2023 677 81 7 10.1016/j.bbrc.2023.08.002 37556954 Sapmaz T, Kale E, Pence ME, Sevgin K, Tekayev M, Topkaraoglu S, et al. Treatment strategies with vitamin E and C in autologous intraperitoneal ovarian transplantation and its impact on ovarian surface epithelium and follicle reserve. Biochem Biophys Res Commun. 2023;677:81–7. 37556954 10.1016/j.bbrc.2023.08.002 81. Brito DC Brito AB Scalercio SR Percario S Miranda MS Rocha RM Vitamin E-analog trolox prevents Endoplasmic reticulum stress in frozen-thawed ovarian tissue of capuchin monkey (Sapajus apella) Cell Tissue Res 2014 355 471 80 10.1007/s00441-013-1764-x 24362491 Brito DC, Brito AB, Scalercio SR, Percario S, Miranda MS, Rocha RM, et al. Vitamin E-analog trolox prevents Endoplasmic reticulum stress in frozen-thawed ovarian tissue of capuchin monkey (Sapajus apella). Cell Tissue Res. 2014;355:471–80. 24362491 10.1007/s00441-013-1764-x 82. Abedi R Eimani H Pashaee Rad S Eftekhari Yazdi P Shahverdi AH Mokhber Maleki E Evaluation effects of allopurinol and FSH on reduction of ischemia-reperfusion injury and on preservation of follicle after heterotopic auto-transplantation of ovarian tissue in mouse Reprod Med Biol 2014 13 29 35 10.1007/s12522-013-0160-2 29662369 PMC5892983 Abedi R, Eimani H, Pashaee Rad S, Eftekhari Yazdi P, Shahverdi AH, Mokhber Maleki E. Evaluation effects of allopurinol and FSH on reduction of ischemia-reperfusion injury and on preservation of follicle after heterotopic auto-transplantation of ovarian tissue in mouse. Reprod Med Biol. 2014;13:29–35. 29662369 10.1007/s12522-013-0160-2 PMC5892983 83. Gao JM Yan J Li R Li M Yan LY Wang TR Improvement in the quality of heterotopic allotransplanted mouse ovarian tissues with basic fibroblast growth factor and fibrin hydrogel Hum Reprod 2013 28 2784 93 10.1093/humrep/det296 23892320 Gao JM, Yan J, Li R, Li M, Yan LY, Wang TR, et al. Improvement in the quality of heterotopic allotransplanted mouse ovarian tissues with basic fibroblast growth factor and fibrin hydrogel. Hum Reprod. 2013;28:2784–93. 23892320 10.1093/humrep/det296 84. Gao J Huang Y Li M Zhao H Zhao Y Li R Effect of local basic fibroblast growth factor and vascular endothelial growth factor on subcutaneously allotransplanted ovarian tissue in ovariectomized mice PLoS ONE 2015 10 e0134035 10.1371/journal.pone.0134035 26208097 PMC4514621 Gao J, Huang Y, Li M, Zhao H, Zhao Y, Li R, et al. Effect of local basic fibroblast growth factor and vascular endothelial growth factor on subcutaneously allotransplanted ovarian tissue in ovariectomized mice. PLoS ONE. 2015;10:e0134035. 26208097 10.1371/journal.pone.0134035 PMC4514621 85. Kang BJ Wang Y Zhang L Xiao Z Li SW bFGF and VEGF improve the quality of vitrified-thawed human ovarian tissues after xenotransplantation to SCID mice J Assist Reprod Genet 2016 33 281 9 10.1007/s10815-015-0628-6 26712576 PMC4759012 Kang BJ, Wang Y, Zhang L, Xiao Z, Li SW. bFGF and VEGF improve the quality of vitrified-thawed human ovarian tissues after xenotransplantation to SCID mice. J Assist Reprod Genet. 2016;33:281–9. 26712576 10.1007/s10815-015-0628-6 PMC4759012 86. Kang BJ Wang Y Zhang L Li SW Basic fibroblast growth factor improved angiogenesis of vitrified human ovarian tissues after in vitro culture and xenotransplantation Cryo Lett 2017 38 194 201 28767742 Kang BJ, Wang Y, Zhang L, Li SW. Basic fibroblast growth factor improved angiogenesis of vitrified human ovarian tissues after in vitro culture and xenotransplantation. Cryo Lett. 2017;38:194–201. 28767742 87. Wang L Ying YF Ouyang YL Wang JF Xu J VEGF and bFGF increase survival of xenografted human ovarian tissue in an experimental rabbit model J Assist Reprod Genet 2013 30 1301 11 10.1007/s10815-013-0043-9 24062194 PMC3824857 Wang L, Ying YF, Ouyang YL, Wang JF, Xu J. VEGF and bFGF increase survival of xenografted human ovarian tissue in an experimental rabbit model. J Assist Reprod Genet. 2013;30:1301–11. 24062194 10.1007/s10815-013-0043-9 PMC3824857 88. Liao Z Liu C Wang L Sui C Zhang H Therapeutic role of mesenchymal stem Cell-Derived extracellular vesicles in female reproductive diseases Front Endocrinol (Lausanne) 2021 12 665645 10.3389/fendo.2021.665645 34248842 PMC8261239 Liao Z, Liu C, Wang L, Sui C, Zhang H. Therapeutic role of mesenchymal stem Cell-Derived extracellular vesicles in female reproductive diseases. Front Endocrinol (Lausanne). 2021;12:665645. 34248842 10.3389/fendo.2021.665645 PMC8261239 89. Manavella DD Cacciottola L Payen VL Amorim CA Donnez J Dolmans MM Adipose tissue-derived stem cells boost vascularization in grafted ovarian tissue by growth factor secretion and differentiation into endothelial cell lineages Mol Hum Reprod 2019 25 184 93 10.1093/molehr/gaz008 30824937 Manavella DD, Cacciottola L, Payen VL, Amorim CA, Donnez J, Dolmans MM. Adipose tissue-derived stem cells boost vascularization in grafted ovarian tissue by growth factor secretion and differentiation into endothelial cell lineages. Mol Hum Reprod. 2019;25:184–93. 30824937 10.1093/molehr/gaz008 90. Dolmans MM Cacciottola L Amorim CA Manavella D Translational research aiming to improve survival of ovarian tissue transplants using adipose tissue-derived stem cells Acta Obstet Gynecol Scand 2019 98 665 71 10.1111/aogs.13610 30891730 Dolmans MM, Cacciottola L, Amorim CA, Manavella D. Translational research aiming to improve survival of ovarian tissue transplants using adipose tissue-derived stem cells. Acta Obstet Gynecol Scand. 2019;98:665–71. 30891730 10.1111/aogs.13610 91. Manavella DD Cacciottola L Pomme S Desmet CM Jordan BF Donnez J Two-step transplantation with adipose tissue-derived stem cells increases follicle survival by enhancing vascularization in xenografted frozen-thawed human ovarian tissue Hum Reprod 2018 33 1107 16 10.1093/humrep/dey080 29635371 Manavella DD, Cacciottola L, Pomme S, Desmet CM, Jordan BF, Donnez J, et al. Two-step transplantation with adipose tissue-derived stem cells increases follicle survival by enhancing vascularization in xenografted frozen-thawed human ovarian tissue. Hum Reprod. 2018;33:1107–16. 29635371 10.1093/humrep/dey080 92. Manavella DD Cacciottola L Desmet CM Jordan BF Donnez J Amorim CA Adipose tissue-derived stem cells in a fibrin implant enhance neovascularization in a peritoneal grafting site: a potential way to improve ovarian tissue transplantation Hum Reprod 2018 33 270 9 10.1093/humrep/dex374 29304240 Manavella DD, Cacciottola L, Desmet CM, Jordan BF, Donnez J, Amorim CA, et al. Adipose tissue-derived stem cells in a fibrin implant enhance neovascularization in a peritoneal grafting site: a potential way to improve ovarian tissue transplantation. Hum Reprod. 2018;33:270–9. 29304240 10.1093/humrep/dex374 93. Xia X Yin T Yan J Yan L Jin C Lu C Mesenchymal stem cells enhance angiogenesis and follicle survival in human cryopreserved ovarian cortex transplantation Cell Transpl 2015 24 1999 2010 10.3727/096368914X685267 25353724 Xia X, Yin T, Yan J, Yan L, Jin C, Lu C, et al. Mesenchymal stem cells enhance angiogenesis and follicle survival in human cryopreserved ovarian cortex transplantation. Cell Transpl. 2015;24:1999–2010. 10.3727/096368914X685267 25353724 94. Mehdinia Z Ashrafi M Fathi R Taheri P Valojerdi MR Restoration of estrous cycles by co-transplantation of mouse ovarian tissue with MSCs Cell Tissue Res 2020 381 509 25 10.1007/s00441-020-03204-x 32424509 Mehdinia Z, Ashrafi M, Fathi R, Taheri P, Valojerdi MR. Restoration of estrous cycles by co-transplantation of mouse ovarian tissue with MSCs. Cell Tissue Res. 2020;381:509–25. 32424509 10.1007/s00441-020-03204-x 95. Cheng J Ruan X Li Y Du J Jin F Gu M Effects of hypoxia-preconditioned HucMSCs on neovascularization and follicle survival in frozen/thawed human ovarian cortex transplanted to immunodeficient mice Stem Cell Res Ther 2022 13 474 10.1186/s13287-022-03167-6 36104746 PMC9476266 Cheng J, Ruan X, Li Y, Du J, Jin F, Gu M, et al. Effects of hypoxia-preconditioned HucMSCs on neovascularization and follicle survival in frozen/thawed human ovarian cortex transplanted to immunodeficient mice. Stem Cell Res Ther. 2022;13:474. 36104746 10.1186/s13287-022-03167-6 PMC9476266 96. Zhang S Huang B Su P Chang Q Li P Song A Concentrated exosomes from menstrual blood-derived stromal cells improves ovarian activity in a rat model of premature ovarian insufficiency Stem Cell Res Ther 2021 12 178 10.1186/s13287-021-02255-3 33712079 PMC7953711 Zhang S, Huang B, Su P, Chang Q, Li P, Song A, et al. Concentrated exosomes from menstrual blood-derived stromal cells improves ovarian activity in a rat model of premature ovarian insufficiency. Stem Cell Res Ther. 2021;12:178. 33712079 10.1186/s13287-021-02255-3 PMC7953711 97. Geng Z Chen H Zou G Yuan L Liu P Li B Human amniotic fluid mesenchymal stem cell-Derived exosomes inhibit apoptosis in ovarian granulosa cell via miR-369-3p/YAF2/PDCD5/p53 pathway Oxid Med Cell Longev 2022 2022 3695848 10.1155/2022/3695848 35936223 PMC9346541 Geng Z, Chen H, Zou G, Yuan L, Liu P, Li B, et al. Human amniotic fluid mesenchymal stem cell-Derived exosomes inhibit apoptosis in ovarian granulosa cell via miR-369-3p/YAF2/PDCD5/p53 pathway. Oxid Med Cell Longev. 2022;2022:3695848. 35936223 10.1155/2022/3695848 PMC9346541 98. Li Z Zhang M Zheng J Tian Y Zhang H Tan Y Human umbilical cord mesenchymal stem Cell-Derived exosomes improve ovarian function and proliferation of premature ovarian insufficiency by regulating the Hippo signaling pathway Front Endocrinol (Lausanne) 2021 12 711902 10.3389/fendo.2021.711902 34456868 PMC8397419 Li Z, Zhang M, Zheng J, Tian Y, Zhang H, Tan Y, et al. Human umbilical cord mesenchymal stem Cell-Derived exosomes improve ovarian function and proliferation of premature ovarian insufficiency by regulating the Hippo signaling pathway. Front Endocrinol (Lausanne). 2021;12:711902. 34456868 10.3389/fendo.2021.711902 PMC8397419 99. Zhang C, Zhou Y, Zhang L, Wu L, Chen Y, Xie D et al. Hydrogel cryopreservation system: an effective method for cell storage. Int J Mol Sci. 2018; 19. 10.3390/ijms19113330 PMC6274795 30366453 100. Yao J Shen L Chen Z Zhang B Zhao G Hydrogel microencapsulation enhances cryopreservation of red blood cells with Trehalose ACS Biomater Sci Eng 2022 8 2066 75 10.1021/acsbiomaterials.2c00051 35394755 Yao J, Shen L, Chen Z, Zhang B, Zhao G. Hydrogel microencapsulation enhances cryopreservation of red blood cells with Trehalose. ACS Biomater Sci Eng. 2022;8:2066–75. 35394755 10.1021/acsbiomaterials.2c00051 101. Ortiz Silva NA Denis S Vergnaud J Hillaireau H Controlled hydrogel-based encapsulation of macrophages determines cell survival and functionality upon cryopreservation Int J Pharm 2024 650 123491 10.1016/j.ijpharm.2023.123491 37806508 Ortiz Silva NA, Denis S, Vergnaud J, Hillaireau H. Controlled hydrogel-based encapsulation of macrophages determines cell survival and functionality upon cryopreservation. Int J Pharm. 2024;650:123491. 37806508 10.1016/j.ijpharm.2023.123491 102. Rodrigues de Freitas T Giannotti Galuppo A Santos Marques L Batista Rodrigues R Perez Atehortua M Souza Franca T Hydrogel encapsulation as a handling and vitrification tool for zebrafish ovarian tissue Theriogenology 2023 198 153 63 10.1016/j.theriogenology.2022.12.019 36586353 Rodrigues de Freitas T, Giannotti Galuppo A, Santos Marques L, Batista Rodrigues R, Perez Atehortua M, Souza Franca T, et al. Hydrogel encapsulation as a handling and vitrification tool for zebrafish ovarian tissue. Theriogenology. 2023;198:153–63. 36586353 10.1016/j.theriogenology.2022.12.019 103. Yi Y Song J Zhou P Shu Y Liang P Liang H An ultrasound-triggered injectable sodium alginate scaffold loaded with electrospun microspheres for on-demand drug delivery to accelerate bone defect regeneration Carbohydr Polym 2024 334 122039 10.1016/j.carbpol.2024.122039 38553236 Yi Y, Song J, Zhou P, Shu Y, Liang P, Liang H, et al. An ultrasound-triggered injectable sodium alginate scaffold loaded with electrospun microspheres for on-demand drug delivery to accelerate bone defect regeneration. Carbohydr Polym. 2024;334:122039. 38553236 10.1016/j.carbpol.2024.122039 104. Yin T Zhang X Shao S Xiang T Zhou S Covalently crosslinked sodium alginate/poly(sodium p-styrenesulfonate) cryogels for selective removal of methylene blue Carbohydr Polym 2023 301 120356 10.1016/j.carbpol.2022.120356 36446513 Yin T, Zhang X, Shao S, Xiang T, Zhou S. Covalently crosslinked sodium alginate/poly(sodium p-styrenesulfonate) cryogels for selective removal of methylene blue. Carbohydr Polym. 2023;301:120356. 36446513 10.1016/j.carbpol.2022.120356 105. Kim D, Kim YH, Lee G, Lee EC, Bhang SH, Lee K. Multidimensional nanofibrous hydrogels integrated triculture system for advanced myocardial regeneration. Biofabrication. 2025; 17. 10.1088/1758-5090/ad9cc3 39657319 106. Tavana S Valojerdi MR Azarnia M Shahverdi A Restoration of ovarian tissue function and estrous cycle in rat after autotransplantation using hyaluronic acid hydrogel scaffold containing VEGF and bFGF Growth Factors 2016 34 97 106 10.1080/08977194.2016.1194835 27362476 Tavana S, Valojerdi MR, Azarnia M, Shahverdi A. Restoration of ovarian tissue function and estrous cycle in rat after autotransplantation using hyaluronic acid hydrogel scaffold containing VEGF and bFGF. Growth Factors. 2016;34:97–106. 27362476 10.1080/08977194.2016.1194835 107. Hassani F Ebrahimi B Moini A Ghiaseddin A Bazrafkan M Hassanzadeh GH Chitosan hydrogel supports integrity of ovarian follicles during in vitro culture: A preliminary of A novel biomaterial for three dimensional culture of ovarian follicles Cell J 2020 21 479 93 31376330 10.22074/cellj.2020.6393 PMC6722450 Hassani F, Ebrahimi B, Moini A, Ghiaseddin A, Bazrafkan M, Hassanzadeh GH, et al. Chitosan hydrogel supports integrity of ovarian follicles during in vitro culture: A preliminary of A novel biomaterial for three dimensional culture of ovarian follicles. Cell J. 2020;21:479–93. 31376330 10.22074/cellj.2020.6393 PMC6722450 108. Feng Q Wang J Yi D Li S Cheng Y Chen Z Epigallocatechin gallate cooperated with hydrogel encapsulation enables high-performance cryopreservation of mouse ovaries Mater Today Bio 2025 32 101883 10.1016/j.mtbio.2025.101883 40496727 PMC12150184 Feng Q, Wang J, Yi D, Li S, Cheng Y, Chen Z, et al. Epigallocatechin gallate cooperated with hydrogel encapsulation enables high-performance cryopreservation of mouse ovaries. Mater Today Bio. 2025;32:101883. 40496727 10.1016/j.mtbio.2025.101883 PMC12150184 109. Jamalzaei P Rezazadeh Valojerdi M Montazeri L Baharvand H Applicability of hyaluronic Acid-Alginate hydrogel and ovarian cells for in vitro development of mouse preantral follicles Cell J 2020 22 49 60 32779433 10.22074/cellj.2020.6925 PMC7481901 Jamalzaei P, Rezazadeh Valojerdi M, Montazeri L, Baharvand H. Applicability of hyaluronic Acid-Alginate hydrogel and ovarian cells for in vitro development of mouse preantral follicles. Cell J. 2020;22:49–60. 32779433 10.22074/cellj.2020.6925 PMC7481901 110. Henry L Labied S Fransolet M Kirschvink N Blacher S Noel A Isoform 165 of vascular endothelial growth factor in collagen matrix improves ovine cryopreserved ovarian tissue revascularisation after xenotransplantation in mice Reprod Biol Endocrinol 2015 13 12 10.1186/s12958-015-0015-2 25888918 PMC4369824 Henry L, Labied S, Fransolet M, Kirschvink N, Blacher S, Noel A, et al. Isoform 165 of vascular endothelial growth factor in collagen matrix improves ovine cryopreserved ovarian tissue revascularisation after xenotransplantation in mice. Reprod Biol Endocrinol. 2015;13:12. 25888918 10.1186/s12958-015-0015-2 PMC4369824 111. Shikanov A Zhang Z Xu M Smith RM Rajan A Woodruff TK Fibrin encapsulation and vascular endothelial growth factor delivery promotes ovarian graft survival in mice Tissue Eng Part A 2011 17 3095 104 10.1089/ten.tea.2011.0204 21740332 PMC3226061 Shikanov A, Zhang Z, Xu M, Smith RM, Rajan A, Woodruff TK, et al. Fibrin encapsulation and vascular endothelial growth factor delivery promotes ovarian graft survival in mice. Tissue Eng Part A. 2011;17:3095–104. 21740332 10.1089/ten.tea.2011.0204 PMC3226061 112. Chung N Yang C Yang H Shin J Song CY Min H Local delivery of platelet-derived factors mitigates ischemia and preserves ovarian function through angiogenic modulation: A personalized regenerative strategy for fertility preservation Biomaterials 2025 313 122768 10.1016/j.biomaterials.2024.122768 39232332 Chung N, Yang C, Yang H, Shin J, Song CY, Min H, et al. Local delivery of platelet-derived factors mitigates ischemia and preserves ovarian function through angiogenic modulation: A personalized regenerative strategy for fertility preservation. Biomaterials. 2025;313:122768. 39232332 10.1016/j.biomaterials.2024.122768 113. Alizadeh M Rezakhani L Khodaei M Soleimannejad M Alizadeh A Evaluating the effects of vacuum on the microstructure and biocompatibility of bovine decellularized pericardium J Tissue Eng Regen Med 2021 15 116 28 10.1002/term.3150 33175476 Alizadeh M, Rezakhani L, Khodaei M, Soleimannejad M, Alizadeh A. Evaluating the effects of vacuum on the microstructure and biocompatibility of bovine decellularized pericardium. J Tissue Eng Regen Med. 2021;15:116–28. 33175476 10.1002/term.3150 114. Zhang R Deng SL Lian ZX Yu K Immunosuppression in uterine transplantation Transpl Immunol 2020 63 101335 10.1016/j.trim.2020.101335 32927095 Zhang R, Deng SL, Lian ZX, Yu K. Immunosuppression in uterine transplantation. Transpl Immunol. 2020;63:101335. 32927095 10.1016/j.trim.2020.101335 115. Eivazkhani F Abtahi NS Tavana S Mirzaeian L Abedi F Ebrahimi B Evaluating two ovarian decellularization methods in three species Mater Sci Eng C Mater Biol Appl 2019 102 670 82 10.1016/j.msec.2019.04.092 31147040 Eivazkhani F, Abtahi NS, Tavana S, Mirzaeian L, Abedi F, Ebrahimi B, et al. Evaluating two ovarian decellularization methods in three species. Mater Sci Eng C Mater Biol Appl. 2019;102:670–82. 31147040 10.1016/j.msec.2019.04.092 116. Oktay K Bedoschi G Pacheco F Turan V Emirdar V First pregnancies, live birth, and in vitro fertilization outcomes after transplantation of frozen-banked ovarian tissue with a human extracellular matrix scaffold using robot-assisted minimally invasive surgery Am J Obstet Gynecol 2016 214 e941 9 10.1016/j.ajog.2015.10.001 PMC4707043 26601616 Oktay K, Bedoschi G, Pacheco F, Turan V, Emirdar V. First pregnancies, live birth, and in vitro fertilization outcomes after transplantation of frozen-banked ovarian tissue with a human extracellular matrix scaffold using robot-assisted minimally invasive surgery. Am J Obstet Gynecol. 2016;214:e941–9. 10.1016/j.ajog.2015.10.001 PMC4707043 26601616 117. Wu T Gao YY Su J Tang XN Chen Q Ma LW Three-dimensional Bioprinting of artificial ovaries by an extrusion-based method using gelatin-methacryloyl Bioink Climacteric 2022 25 170 8 10.1080/13697137.2021.1921726 33993814 Wu T, Gao YY, Su J, Tang XN, Chen Q, Ma LW, et al. Three-dimensional Bioprinting of artificial ovaries by an extrusion-based method using gelatin-methacryloyl Bioink. Climacteric. 2022;25:170–8. 33993814 10.1080/13697137.2021.1921726 118. Youm HW Lee J Kim EJ Kong HS Lee JR Suh CS Effects of Angiopoietin-2 on transplanted mouse ovarian tissue PLoS ONE 2016 11 e0166782 10.1371/journal.pone.0166782 27870915 PMC5117712 Youm HW, Lee J, Kim EJ, Kong HS, Lee JR, Suh CS, et al. Effects of Angiopoietin-2 on transplanted mouse ovarian tissue. PLoS ONE. 2016;11:e0166782. 27870915 10.1371/journal.pone.0166782 PMC5117712 119. Kong HS Lee J Youm HW Kim SK Lee JR Suh CS Effect of treatment with angiopoietin-2 and vascular endothelial growth factor on the quality of xenografted bovine ovarian tissue in mice PLoS ONE 2017 12 e0184546 10.1371/journal.pone.0184546 28915249 PMC5600380 Kong HS, Lee J, Youm HW, Kim SK, Lee JR, Suh CS, et al. Effect of treatment with angiopoietin-2 and vascular endothelial growth factor on the quality of xenografted bovine ovarian tissue in mice. PLoS ONE. 2017;12:e0184546. 28915249 10.1371/journal.pone.0184546 PMC5600380 120. Yang Y, Chen J, Wu H, Pei X, Chang Q, Ma W et al. The Increased Expression of Connexin and VEGF in Mouse Ovarian Tissue Vitrification by Follicle Stimulating Hormone. Biomed Res Int. 2015;2015:397264. 10.1155/2015/397264 PMC4620037 26539488 121. Ma WZ Zheng XM Hei CC Zhao CJ Xie SS Chang Q Optimal FSH usage in revascularization of allotransplanted ovarian tissue in mice J Ovarian Res 2017 10 5 10.1186/s13048-016-0299-7 28095884 PMC5240196 Ma WZ, Zheng XM, Hei CC, Zhao CJ, Xie SS, Chang Q, et al. Optimal FSH usage in revascularization of allotransplanted ovarian tissue in mice. J Ovarian Res. 2017;10:5. 28095884 10.1186/s13048-016-0299-7 PMC5240196 122. Wang Y Chang Q Sun J Dang L Ma W Hei C Effects of HMG on revascularization and follicular survival in heterotopic autotransplants of mouse ovarian tissue Reprod Biomed Online 2012 24 646 53 10.1016/j.rbmo.2012.02.025 22503947 Wang Y, Chang Q, Sun J, Dang L, Ma W, Hei C, et al. Effects of HMG on revascularization and follicular survival in heterotopic autotransplants of mouse ovarian tissue. Reprod Biomed Online. 2012;24:646–53. 22503947 10.1016/j.rbmo.2012.02.025 123. Celik S Ozkavukcu S Celik-Ozenci C Recombinant anti-Mullerian hormone treatment attenuates primordial follicle loss after ovarian cryopreservation and transplantation J Assist Reprod Genet 2023 40 1117 34 10.1007/s10815-023-02754-7 36856968 PMC10239422 Celik S, Ozkavukcu S, Celik-Ozenci C. Recombinant anti-Mullerian hormone treatment attenuates primordial follicle loss after ovarian cryopreservation and transplantation. J Assist Reprod Genet. 2023;40:1117–34. 36856968 10.1007/s10815-023-02754-7 PMC10239422 124. Detti L Fletcher NM Saed GM Sweatman TW Uhlmann RA Pappo A Xenotransplantation of pre-pubertal ovarian cortex and prevention of follicle depletion with anti-Mullerian hormone (AMH) J Assist Reprod Genet 2018 35 1831 41 10.1007/s10815-018-1260-z 30043336 PMC6150887 Detti L, Fletcher NM, Saed GM, Sweatman TW, Uhlmann RA, Pappo A, et al. Xenotransplantation of pre-pubertal ovarian cortex and prevention of follicle depletion with anti-Mullerian hormone (AMH). J Assist Reprod Genet. 2018;35:1831–41. 30043336 10.1007/s10815-018-1260-z PMC6150887 125. Man L Park L Bodine R Ginsberg M Zaninovic N Man OA Engineered endothelium provides angiogenic and paracrine stimulus to grafted human ovarian tissue Sci Rep 2017 7 8203 10.1038/s41598-017-08491-z 28811567 PMC5557862 Man L, Park L, Bodine R, Ginsberg M, Zaninovic N, Man OA, et al. Engineered endothelium provides angiogenic and paracrine stimulus to grafted human ovarian tissue. Sci Rep. 2017;7:8203. 28811567 10.1038/s41598-017-08491-z PMC5557862 126. Liu W Zhang J Wang L Liang S Xu B Ying X The protective effects of Rapamycin pretreatment on ovarian damage during ovarian tissue cryopreservation and transplantation Biochem Biophys Res Commun 2021 534 780 6 10.1016/j.bbrc.2020.10.110 33162031 Liu W, Zhang J, Wang L, Liang S, Xu B, Ying X, et al. The protective effects of Rapamycin pretreatment on ovarian damage during ovarian tissue cryopreservation and transplantation. Biochem Biophys Res Commun. 2021;534:780–6. 33162031 10.1016/j.bbrc.2020.10.110 127. Bindels J, Squatrito M, Bernet L, Nisolle M, Henry L, Munaut C. The mTOR inhibitor Rapamycin counteracts follicle activation induced by ovarian cryopreservation in murine transplantation models. Med (Kaunas). 2023; 59. 10.3390/medicina59081474 PMC10456585 37629764 128. Yorino S Kawamura K Rapamycin treatment maintains developmental potential of oocytes in mice and follicle reserve in human cortical fragments grafted into immune-deficient mice Mol Cell Endocrinol 2020 504 110694 10.1016/j.mce.2019.110694 31887337 Yorino S, Kawamura K. Rapamycin treatment maintains developmental potential of oocytes in mice and follicle reserve in human cortical fragments grafted into immune-deficient mice. Mol Cell Endocrinol. 2020;504:110694. 31887337 10.1016/j.mce.2019.110694 129. Yu SO Brown A Middleton AJ Tomczak MM Walker VK Davies PL Ice restructuring Inhibition activities in antifreeze proteins with distinct differences in thermal hysteresis Cryobiology 2010 61 327 34 10.1016/j.cryobiol.2010.10.158 20977900 Yu SO, Brown A, Middleton AJ, Tomczak MM, Walker VK, Davies PL. Ice restructuring Inhibition activities in antifreeze proteins with distinct differences in thermal hysteresis. Cryobiology. 2010;61:327–34. 20977900 10.1016/j.cryobiol.2010.10.158 130. Liu K Wang C Ma J Shi G Yao X Fang H Janus effect of antifreeze proteins on ice nucleation Proc Natl Acad Sci U S A 2016 113 14739 44 10.1073/pnas.1614379114 27930318 PMC5187720 Liu K, Wang C, Ma J, Shi G, Yao X, Fang H, et al. Janus effect of antifreeze proteins on ice nucleation. Proc Natl Acad Sci U S A. 2016;113:14739–44. 27930318 10.1073/pnas.1614379114 PMC5187720 131. Masuda Y Kheawkanha T Nagahama A Kawasaki K Konno T Yamanaka K Antifreeze protein type III addition to freezing extender comprehensively improves post-thaw sperm properties in Okinawan native Agu pig Anim Reprod Sci 2023 252 107232 10.1016/j.anireprosci.2023.107232 37075564 Masuda Y, Kheawkanha T, Nagahama A, Kawasaki K, Konno T, Yamanaka K, et al. Antifreeze protein type III addition to freezing extender comprehensively improves post-thaw sperm properties in Okinawan native Agu pig. Anim Reprod Sci. 2023;252:107232. 37075564 10.1016/j.anireprosci.2023.107232 132. Jo JW Jee BC Lee JR Suh CS Effect of antifreeze protein supplementation in vitrification medium on mouse oocyte developmental competence Fertil Steril 2011 96 1239 45 10.1016/j.fertnstert.2011.08.023 21917250 Jo JW, Jee BC, Lee JR, Suh CS. Effect of antifreeze protein supplementation in vitrification medium on mouse oocyte developmental competence. Fertil Steril. 2011;96:1239–45. 21917250 10.1016/j.fertnstert.2011.08.023 133. Nishijima K Tanaka M Sakai Y Koshimoto C Morimoto M Watanabe T Effects of type III antifreeze protein on sperm and embryo cryopreservation in rabbit Cryobiology 2014 69 22 5 10.1016/j.cryobiol.2014.04.014 24809634 Nishijima K, Tanaka M, Sakai Y, Koshimoto C, Morimoto M, Watanabe T, et al. Effects of type III antifreeze protein on sperm and embryo cryopreservation in rabbit. Cryobiology. 2014;69:22–5. 24809634 10.1016/j.cryobiol.2014.04.014 134. Lee JR Youm HW Lee HJ Jee BC Suh CS Kim SH Effect of antifreeze protein on mouse ovarian tissue cryopreservation and transplantation Yonsei Med J 2015 56 778 84 10.3349/ymj.2015.56.3.778 25837185 PMC4397449 Lee JR, Youm HW, Lee HJ, Jee BC, Suh CS, Kim SH. Effect of antifreeze protein on mouse ovarian tissue cryopreservation and transplantation. Yonsei Med J. 2015;56:778–84. 25837185 10.3349/ymj.2015.56.3.778 PMC4397449 135. Kong HS Kim EJ Youm HW Kim SK Lee JR Suh CS Improvement in ovarian tissue quality with supplementation of antifreeze protein during warming of vitrified mouse ovarian tissue Yonsei Med J 2018 59 331 6 10.3349/ymj.2018.59.2.331 29436204 PMC5823838 Kong HS, Kim EJ, Youm HW, Kim SK, Lee JR, Suh CS, et al. Improvement in ovarian tissue quality with supplementation of antifreeze protein during warming of vitrified mouse ovarian tissue. Yonsei Med J. 2018;59:331–6. 29436204 10.3349/ymj.2018.59.2.331 PMC5823838 136. Lee J Kim SK Youm HW Kim HJ Lee JR Suh CS Effects of three different types of antifreeze proteins on mouse ovarian tissue cryopreservation and transplantation PLoS ONE 2015 10 e0126252 10.1371/journal.pone.0126252 25938445 PMC4418816 Lee J, Kim SK, Youm HW, Kim HJ, Lee JR, Suh CS, et al. Effects of three different types of antifreeze proteins on mouse ovarian tissue cryopreservation and transplantation. PLoS ONE. 2015;10:e0126252. 25938445 10.1371/journal.pone.0126252 PMC4418816 137. Qi HS Gao YH Zhang L Cui ZX Sui XJ Ma JF Rational design of and mechanism insight into an efficient antifreeze peptide for cryopreservation Engineering-Prc 2024 34 164 73 Qi HS, Gao YH, Zhang L, Cui ZX, Sui XJ, Ma JF, et al. Rational design of and mechanism insight into an efficient antifreeze peptide for cryopreservation. Engineering-Prc. 2024;34:164–73. 138. Zhang S Han J Luo X Wang Z Gu X Li N Investigations of structural and dynamical mechanisms of ice formation regulated by graphene oxide nanosheets Struct Dyn 2021 8 054901 10.1063/4.0000111 34549075 PMC8443304 Zhang S, Han J, Luo X, Wang Z, Gu X, Li N, et al. Investigations of structural and dynamical mechanisms of ice formation regulated by graphene oxide nanosheets. Struct Dyn. 2021;8:054901. 34549075 10.1063/4.0000111 PMC8443304 139. Bai G Gao D Liu Z Zhou X Wang J Probing the critical nucleus size for ice formation with graphene oxide nanosheets Nature 2019 576 437 41 10.1038/s41586-019-1827-6 31853083 Bai G, Gao D, Liu Z, Zhou X, Wang J. Probing the critical nucleus size for ice formation with graphene oxide nanosheets. Nature. 2019;576:437–41. 31853083 10.1038/s41586-019-1827-6 140. Yan L Wang L Wu J Wu Y Zhu X Mei Q Multi-biofunctional graphene oxide-enhanced poly-L-lactic acid composite nanofiber scaffolds for ovarian function recovery of transplanted-tissue NPJ Regen Med 2022 7 52 10.1038/s41536-022-00236-5 36114211 PMC9481528 Yan L, Wang L, Wu J, Wu Y, Zhu X, Mei Q, et al. Multi-biofunctional graphene oxide-enhanced poly-L-lactic acid composite nanofiber scaffolds for ovarian function recovery of transplanted-tissue. NPJ Regen Med. 2022;7:52. 36114211 10.1038/s41536-022-00236-5 PMC9481528 141. Eniade A Purushotham M Ben RN Wang JB Horwath K A serendipitous discovery of antifreeze protein-specific activity in C-linked antifreeze glycoprotein analogs Cell Biochem Biophys 2003 38 115 24 10.1385/CBB:38:2:115 12777711 Eniade A, Purushotham M, Ben RN, Wang JB, Horwath K. A serendipitous discovery of antifreeze protein-specific activity in C-linked antifreeze glycoprotein analogs. Cell Biochem Biophys. 2003;38:115–24. 12777711 10.1385/CBB:38:2:115 142. Petrushko M Yurchuk T Todorov P Hristova E Piniaiev V Isachenko E New method for cryoprotectant-free freezing of human Oligoasthenoteratozoospremic spermatozoa with high-molecular polymer Cryobiology 2021 103 39 44 10.1016/j.cryobiol.2021.09.013 34606824 Petrushko M, Yurchuk T, Todorov P, Hristova E, Piniaiev V, Isachenko E, et al. New method for cryoprotectant-free freezing of human Oligoasthenoteratozoospremic spermatozoa with high-molecular polymer. Cryobiology. 2021;103:39–44. 34606824 10.1016/j.cryobiol.2021.09.013 143. Kim CG Yong H Lee G Cho J Effect of the Polyvinylpyrrolidone concentration of cryoprotectant on mouse embryo development and production of pups: 7.5% of PVP is beneficial for in vitro and in vivo development of frozen-thawed mouse embryos J Reprod Dev 2008 54 250 3 10.1262/jrd.19185 18490859 Kim CG, Yong H, Lee G, Cho J. Effect of the Polyvinylpyrrolidone concentration of cryoprotectant on mouse embryo development and production of pups: 7.5% of PVP is beneficial for in vitro and in vivo development of frozen-thawed mouse embryos. J Reprod Dev. 2008;54:250–3. 18490859 10.1262/jrd.19185 144. Wang Y Okitsu O Zhao XM Sun Y Di W Chian RC The effect of minimal concentration of ethylene glycol (EG) combined with Polyvinylpyrrolidone (PVP) on mouse oocyte survival and subsequent embryonic development following vitrification J Assist Reprod Genet 2014 31 55 63 10.1007/s10815-013-0136-5 24258349 PMC3909135 Wang Y, Okitsu O, Zhao XM, Sun Y, Di W, Chian RC. The effect of minimal concentration of ethylene glycol (EG) combined with Polyvinylpyrrolidone (PVP) on mouse oocyte survival and subsequent embryonic development following vitrification. J Assist Reprod Genet. 2014;31:55–63. 24258349 10.1007/s10815-013-0136-5 PMC3909135 145. Wu G Lv C Memon S Liang J Zhao X Ouyang Y The presence of synthetic polymers in the maturation medium affects the cryotolerance and developmental capacity after parthenogenic activation of vitrified goat oocytes Cryobiology 2020 93 84 90 10.1016/j.cryobiol.2020.02.004 32044324 Wu G, Lv C, Memon S, Liang J, Zhao X, Ouyang Y, et al. The presence of synthetic polymers in the maturation medium affects the cryotolerance and developmental capacity after parthenogenic activation of vitrified goat oocytes. Cryobiology. 2020;93:84–90. 32044324 10.1016/j.cryobiol.2020.02.004 146. Qin Q Zhao L Liu Z Liu T Qu J Zhang X Bioinspired l-Proline oligomers for the cryopreservation of oocytes via controlling ice growth ACS Appl Mater Interfaces 2020 12 18352 62 10.1021/acsami.0c02719 32227894 Qin Q, Zhao L, Liu Z, Liu T, Qu J, Zhang X, et al. Bioinspired l-Proline oligomers for the cryopreservation of oocytes via controlling ice growth. ACS Appl Mater Interfaces. 2020;12:18352–62. 32227894 10.1021/acsami.0c02719 147. Graham B Bailey TL Healey JRJ Marcellini M Deville S Gibson MI Polyproline as a minimal antifreeze protein mimic that enhances the cryopreservation of cell monolayers Angew Chem Int Ed Engl 2017 56 15941 4 10.1002/anie.201706703 29044869 PMC5722203 Graham B, Bailey TL, Healey JRJ, Marcellini M, Deville S, Gibson MI. Polyproline as a minimal antifreeze protein mimic that enhances the cryopreservation of cell monolayers. Angew Chem Int Ed Engl. 2017;56:15941–4. 29044869 10.1002/anie.201706703 PMC5722203 148. Mitchell DE Cameron NR Gibson MI Rational, yet simple, design and synthesis of an antifreeze-protein inspired polymer for cellular cryopreservation Chem Commun (Camb) 2015 51 12977 80 10.1039/C5CC04647E 26176027 PMC4672748 Mitchell DE, Cameron NR, Gibson MI. Rational, yet simple, design and synthesis of an antifreeze-protein inspired polymer for cellular cryopreservation. Chem Commun (Camb). 2015;51:12977–80. 26176027 10.1039/c5cc04647e PMC4672748 149. Bailey TL Stubbs C Murray K Tomas RMF Otten L Gibson MI Synthetically scalable Poly(ampholyte) which dramatically enhances cellular cryopreservation Biomacromolecules 2019 20 3104 14 10.1021/acs.biomac.9b00681 31268698 PMC6692820 Bailey TL, Stubbs C, Murray K, Tomas RMF, Otten L, Gibson MI. Synthetically scalable Poly(ampholyte) which dramatically enhances cellular cryopreservation. Biomacromolecules. 2019;20:3104–14. 31268698 10.1021/acs.biomac.9b00681 PMC6692820 ",
  "metadata": {
    "Title of this paper": "Synthetically scalable Poly(ampholyte) which dramatically enhances cellular cryopreservation",
    "Journal it was published in:": "Journal of Ovarian Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487330/"
  }
}