{
  "title": "Paper_503",
  "abstract": "pmc Front Cardiovasc Med Front Cardiovasc Med 2863 fcvm Front. Cardiovasc. Med. Frontiers in Cardiovascular Medicine 2297-055X Frontiers Media SA PMC12484168 PMC12484168.1 12484168 12484168 41040075 10.3389/fcvm.2025.1658016 1 Cardiovascular Medicine Original Research Integrative transcriptomic analysis reveals diagnostic biomarkers for comorbidity of coronary artery disease and obstructive sleep apnea Liu Qingquan  1  † Chen Xiaoyu  2  † Chen Shuhan  1 Gao Hongzhi  3 He Meiting  1 Shi Yingting  1 Zhao Mingzhu  1 Yu Liying  3  4 * Lin Huili  1 * 1 Cardiovascular Medicine, The Second Affiliated Hospital of Fujian Medical University Quanzhou China 2 Department of Endocrinology, The Second Affiliated Hospital of Fujian Medical University Quanzhou China 3 Central Laboratory, Fujian Key Laboratory of Lung Stem Cells, The Second Affiliated Hospital of Fujian Medical University Quanzhou China 4 Department of Bioinformatics, School of Medical Technology and Engineering, Fujian Medical University Fuzhou, Fujian China Edited by: Yuanhui Liu Reviewed by: Yuefeng Chen Xiaofeng Zhuang * Correspondence: yly@fjmu.edu.cn 1627974150@qq.com  † These authors have contributed equally to this work 17 9 2025 2025 12 480653 1658016 02 7 2025 02 9 2025 17 09 2025 02 10 2025 03 10 2025 © 2025 Liu, Chen, Chen, Gao, He, Shi, Zhao, Yu and Lin. 2025 Liu, Chen, Chen, Gao, He, Shi, Zhao, Yu and Lin https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) Background The co-occurrence of coronary artery disease (CAD) and obstructive sleep apnea (OSA), termed CADOSA, leads to worse clinical outcomes than either condition alone, yet its molecular mechanisms remain unclear, necessitating biomarker discovery for improved diagnosis and personalized management. Methods This study enrolled 96 age-matched participants (24 healthy controls, 25 CAD, 23 OSA, and 24 CADOSA) for clinical assessment and PBMC transcriptomic profiling. Integrated bioinformatics analyses included differential gene expression (edgeR/DESeq2), pathway enrichment, protein-protein interaction networks and topological analysis, machine learning-based biomarker selection, and immune cell infiltration evaluation. Results CADOSA patients had more severe cardiac dysfunction (enlarged left ventricle), respiratory impairment (higher apnea-hypopnea index), and metabolic disturbances (elevated triglycerides/creatinine) compared to single-disease condition of CAD or OSA. Transcriptomics identified 832 CAD-specific, 166 OSA-specific, and 376 CADOSA-specific DEGs compared to the healthy control. The CADOSA exhibited both shared (impaired efferocytosis, neutrophil extracellular traps, and cytoskeletal abnormalities) and unique enriched pathways (NOD-like receptor/PPAR signaling pathway), predominantly associated with immune or metabolic dysregulation. Enhanced expression of S100A12 and MMP9 genes (AUC = 0.83 and 0.78, respectively) was identified as potential biomarkers for CADOSA, and their upregulation was further confirmed by qRT-PCR. Notably, S100A12 expression was correlated with increased monocyte infiltration, highlighting its role in inflammatory pathogenesis of CADOSA. Conclusions These findings reveal immune-metabolic dysregulation underlying CADOSA and provide potential diagnostic biomarkers and targeted therapeutic targets (S100A12 and MMP9) for CADOSA patients. coronary artery disease obstructive sleep apnea syndrome RNA sequencing biomarker immune Joint funds for the innovation of science and technology, Fujian province 2023Y9261 Quanzhou High-level Talent Introduction Program 2023CT014 Natural Science Foundation of Fujian Province 2024J01680 Quanzhou Science and Technology Plan Project 2023C0044YR The author(s) declare that financial support was received for the research and/or publication of this article. This work was supported by the Joint funds for the innovation of science and technology, Fujian province (Grant number: 2023Y9261), Quanzhou High-level Talent Introduction Program (2023CT014), Natural Science Foundation of Fujian Province (2024J01680), and Quanzhou Science and Technology Plan Project (2023C004YR). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Cardiovascular Genetics and Systems Medicine 1 Introduction Coronary artery disease (CAD) and obstructive sleep apnea syndrome (OSA) are two widespread diseases that present considerable worldwide health challenges. CAD is among the most prevalent and severe cardiovascular diseases globally, remaining the leading cause of mortality worldwide. It accounts for approximately 17.9 million deaths annually, primarily due to atherosclerosis-driven complications such as myocardial infarction and heart failure ( 1 2 3 4 6 7 The pathogenesis of both disease conditions converges on chronic inflammation, endothelial dysfunction, and oxidative stress ( 8 9 10 11 12 13 14 Transcriptomic profiling, particularly RNA sequencing (RNA-seq), has become as an effective method for elucidating the molecular foundations of complex diseases. Transcriptomic analyses have revealed the molecular processes of CAD and OSA independently. In CAD, transcriptomic studies have identified differentially expressed genes (DEGs) associated with inflammation, lipid metabolism, and vascular remodeling ( 15 17 18 19 In this study, we performed extensive RNA-seq of PBMCs from four cohorts: healthy controls, CAD-only (CAD), OSA-only (OSA), and CADOSA (CADOSA) patients. Through the integration of differential expression analysis, functional enrichment, protein-protein interaction, machine learning, and immune cell infiltration analyses, we aimed to identify critical molecular pathways and molecules associated with the OSA, CAD and their comorbidity. Our findings will provide novel insights into the common and unique molecular pathways of CAD and OSA, facilitating the development of diagnostic and targeted therapeutic strategies. 2 Materials and methods 2.1 Description of the study cohort and sample collection The study cohort comprised participants diagnosed with OSA and/or CAD, and healthy controls. We consecutively screened and recruited patients admitted for coronary angiography and polysomnography (PSG) based on clinical indications. Participants diagnosed with CAD were selected based on evaluations by two cardiovascular specialists through CT coronary angiography or conventional coronary angiography. Exclusions included for those with severe infectious diseases, other cardiac conditions inducing angina (such as hypertrophic cardiomyopathy, myocarditis, or severe valvular heart disease), active malignancies or chemotherapy treatment, severe cardiac dysfunction, pacemaker implantation, frequent ectopic beats exceeding >10% of total heartbeats, prior revascularization procedures (coronary angioplasty or bypass grafting), major surgeries conducted within the past six months, or prior continuous positive airway pressure therapy. Patients with OSA were included if diagnosed via polysomnography (PSG) with an apnea-hypopnea index (AHI) ≥5. While excluding those who had been hospitalized for heart failure or respiratory disease in the past six weeks, were unable to undergo PSG, required oxygen therapy, had airflow-limiting conditions, or presented with renal insufficiency or long-term medication usage. Healthy volunteers without relevant diseases were recruited as controls. All subjects granted written informed consent, and the study was approved by the Institutional Review Board of the Second Affiliated Hospital of Fujian Medical University [NO. 597(2023), Quanzhou, Fujian, China]. Totally, 23 OSA, 25 CAD, and 24 CADOSA patients were enrolled, with health controls ( n Clinical characteristics, including age, gender, body mass index (BMI), and relevant medical history, were documented as comprehensively as possible for each participant ( Supplementary Table S1 2.2 Preprocessing of RNA sequencing data Total RNA was extracted utilizing the TRIzol Reagent (ThermoScientific, cat. #15596026) following the manufacturer's protocol. Subsequently, genomic DNA was removed by subjecting the samples to DNase I to eliminate DNA contamination. RNA quality and quantity were evaluated using the Agilent 2,100 Bioanalyzer and the NanoDrop™ OneC spectrophotometer, respectively. Samples with an RNA Integrity Number (RIN) >7.0 and a 260/280 ratio between 1.8 and 2.1 were preserved for subsequent analysis. RNA sequencing libraries were constructed and sequenced on the DNBSEQ-T7 platform (MGI), producing 150 bp paired-end reads. The raw sequencing data were processed through the following steps: (1) Adapter sequences and low-quality bases were trimmed using fastp (v0.23.2) with the following parameters: –dont_eval_duplication –qualified_quality_phred 20 –unqualified_percent_limit 8. (2) Clean reads were aligned to the human reference genome (GRCh38) using STAR (v2.7.6a, parameters: outFilterMatchNminOverLread 0.66 –outSAMmapqUnique 60 –chimOutJunctionFormat 1 –chimSegmentMin 10 –chimOutType SeparateSAMol). (3) Gene-level counts were quantified utilizing featureCounts (v1.5.1) with parameters of -d 30 -D 1,000 -C -s 0 -t exon -g fcid –primary -O. 2.3 Identification of differentially expressed genes (DEGs) Principal component analysis (PCA) was performed on Fragments Per Kilobase of exon model per Million mapped fragments (FPKM)- normalized gene expression data to reduce dimensionality and visualize sample clustering patterns based on overall transcriptomic variation. DEGs between each disease (OSA, CAD, CADOSA) group and the control group based on raw count data were identified using the edgeR and DESeq2 R package (v3.40.2). Initial quality filtering excluded genes detected in fewer than 25% of samples. Genes with an adjusted P P P 2.4 Gene expression clustering and core gene selection The Mfuzz (v2.58.0) R package was used to examine temporal gene expression patterns across disease progression during “HC→CAD/OSA→CADOSA” development based on FPKM- normalized gene expression values. The cluster number of Mfuzz were set as 6. Genes with statistically significant clusters ( P 2.5 Protein network analysis and hub gene identification To elucidate key molecular interactions, we established protein-protein interaction (PPI) networks for disease-specific DEGs or CADOSA-core DEGs using the STRING database. The resulting interaction data were imported into Cytoscape for topological analysis. Gene centrality was systematically evaluated through five distinct algorithms implemented in the CytoHubba plugin: Maximal Clique Centrality (MCC), Edge Percolated Component (EPC), Closeness, Degree, and Betweenness. Hub genes were rigorously defined as those consistently ranked among the top 10 most central nodes across all five-network metrics, ensuring the identification of biologically relevant and highly connected molecular regulators. 2.6 Machine learning-based biomarkers selection To identify optimal diagnostic biomarkers, we implemented a comprehensive machine learning pipeline. First, candidate genes were obtained from the intersection of core and hub genes. To develop predictive model of each disease, transcriptomic data was individually and randomly divided into training (70%) and validation (30%) sets. We then applied three distinct machine learning algorithms to prioritize robust biomarkers: (1) Elastic Net regression (with optimal regularization parameter λ 2.7 Estimation of immune infiltration The abundances of immune cells in four group samples were assessed individually using CIBERSORT algorithms. The difference in cell proportion was statistically evaluated. The associations between cells and biomarker genes were calculated and visualized using “ggcor” R package. 2.8 Quantitative PCR for gene quantification Gene expression of CADOSA biomarkers were verified using cDNA samples from 12 CADOSA and 12 HC cohorts. Quantitative PCR was performed in 10 μl reactions containing TB Green Premix Ex Taq II, gene-specific primers (MMP9, S100A12), and cDNA template, using the following cycling conditions: 95 °C for 30 s, then 40 cycles of 95°C for 5 s and 60 °C for 30 s Gene expression was calculated by the 2^(-ΔΔCt) method using β-actin as the endogenous control. The primers were synthesized by Sangon Biotech (Shanghai, China), and their sequences are: S100A12-forward primer 5′-GGGGCATTTTGACACCCTCT-3′ and S100A12-reverse primer 5′-CGCAATGGCTACCAGGGATA-3′; GLUD2-forward primer 5′-CAGCATCGTGGAGGACAAGT-3′ and GLUD2-reverse primer 5′-CGGTAGCCTTCGATGACCTC-3′; β-actin-forward primer 5′-GAGAAAATCTGGCACCACACC-3′, β-actin-reverse primer 5′-GGATAGCACAGCCTGGATAGCAA-3′. 2.9 Statistical analysis of clinical factors Statistical analyses of clinical variables were performed to compare the demographic and clinical characteristics among the control, OSA, CAD, and CADOSA groups. All statistical analyses in this study were conducted using SPSS 27.0 software. The normality and homogeneity of variance for all factors were evaluated using the Kolmogorov–Smirnov test. Categorical variables, such as gender, were presented as frequencies (%) and analyzed using the Chi-square test. Continuous variables that follow a normal distribution are represented as mean ± standard deviation (SD), while non-normally distributed continuous variables are shown as median (interquartile range, IQR). One-way ANOVA was employed for intergroup comparisons of normally distributed continuous variables with homogeneous variance. Upon detecting significant differences were detected ( P post-hoc H P 3 Results 3.1 Cohort characteristics We compared demographic and clinical variables across four cohort groups ( Table 1 n n n n P P P P P P Table 1 Demographic and clinical characteristics of the participants at baseline. Characteristic HC ( n OSA ( n CAD ( n CADOSA ( n P Comparison # Demographic characteristics Age, years 57 (48.0,70.0) 59 (48.0,70.0) 69 (60.0,74.0) 64.5 (55,71.75) 0.116 Gender * 0.002 Male, n 10 (41.7%) 16 (69.6%) 19 (76.0%) 22 (91.7%) Female, n 14 (58.3%) 7 (30.4%) 6 (24.0%) 2 (8.3%) BMI, kg/m 2 24.27 ± 3.48 25.65 ± 4.53 23.17 ± 4.08 25.57 ± 3.68 0.11 Underweight (<18.5), n 1 (4.1%) 2 (8.7%) 3 (12.0%) 1 (4.1%) Normal weight (18.5–23.9), n 7 (29.2%) 6 (26.1%) 11 (44.0%) 6 (25.0%) Overweight (24–27.9), n 7 (29.2%) 8 (34.8%) 7 (28.0%) 10 (41.7%) Obesity (>28), n 4 (16.7%) 7 (30.4%) 3 (12.0%) 7 (29.2%) No data, n 5 (20.8%) / 1 (4.0%) / HR * 75.55 ± 5.60 83.61 ± 11.61 77.24 ± 16.39 80.42 ± 12.41 0.029 1 < 2 Blood Pressure SBP, mmHg 125.5 (120.8,148.8) 133 (124.0,150.0) 128 (121.0,141.0) 131 (123.0,140.0) 0.672 DBP, mmHg 78.20 ± 7.82 86.78 ± 14.85 81.96 ± 11.26 80.25 ± 10.14 0.122 Blood routine test NEU, 10 −9 3.80 (3.00,4.52) 4.20 (3.33,5.66) 4.50 (3.36,6.42) 4.32 (3.18,4.91) 0.221 RBC,10 −12 4.69 ± 0.58 4.75 ± 0.58 4.50 ± 0.52 4.40 ± 0.72 0.173 HGB, g/L 135.46 ± 19.12 145.39 ± 17.99 138.32 ± 14.90 135.46 ± 22.63 0.235 Blood biochemistry AST, U/L 23.6 (19.9,33.95) 23.1 (18.7,30.0) 20.7 (17.8,50.85) 22.2 (17.18,29.28) 0.967 ALT, U/L 20.8 (13.58,40.45) 22.3 (14.4,31.8) 19.7 (13.05,36.3) 21.3 (14.88,37.9) 0.988 TC, mmol/L 4.84 ± 0.91 4.47 ± 0.32 4.58 ± 1.07 4.57 ± 1.21 0.634 TG * 1.81 (1.18,2.43) 1.7 (0.9,2.01) 1.11 (0.89,1.8) 1.88 (1.38,2.71) 0.024 3 < 4 HDL, mmol/L 1.25 ± 0.38 1.19 ± 0.32 1.23 ± 0.37 1.04 ± 0.20 0.120 LDL, mmol/L 3.08 ± 0.89 2.79 ± 0.86 2.90 ± 0.98 2.89 ± 1.17 0.789 CR * 63.5 (51.5,73.5) 70 (61.0,90.0) 69 (61.5,74.5) 75.5 (63.75,101) 0.043 1 < 4 UA, mmol/L 330.71 ± 82.92 364.91 ± 108.56 348.72 ± 99.42 368.71 ± 83.36 0.490 Glucose, mmol/L 5.06 (4.84,5.91) 5.38 (5.06,6.2) 5.64 (5.19,7.04) 5.57 (5.05,6.29) 0.149 HbA1C, % 5.7 (5.4,6.7) 5.6 (5.48,6.7) 6.15 (5.68,7.1) 6.2 (5.75,6.8) 0.289 Indicators of myocardial injury CK-MB, U/L 12.15 (11.1,14.93) 13.8 (11.1,15.5) 15.4 (12.25,23.25) 14.05 (12.23,16.58) 0.103 D-dimer * 0.29 (0.17,0.46) 0.2 (0.12,0.33) 0.55 (0.27,1.61) 0.29 (0.19,1.08) 0.007 2 < 3 NT-proBNP * 62.79 (24.23,335.05) 57.38 (26.98,131.28) 263.98 (104.8,1013.2) 115.67 (31.46,311.2) 0.01 2 < 3 Hs-TnT * 7.89 (5.3,12.27) 9.0 (5.65,12.11) 12.75 (9.23,106.1) 9.31 (7.24,19.75) 0.026 1 < 3 Carotid artery ultrasound Carotid plaque 0.237 Yes, n 3 (12.5%) 3 (13.0%) 5 (20.0%) 8 (33.3%) No, n 21 (87.5%) 20 (87.0%) 20 (80.0%) 16 (66.7%) Echocardiography LVEF, % 64.5 (61.0,68.0) 67 (64.0,70.0) 66.5 (56.5,68) 66 (59.0,68.0) 0.154 LVD * 45.56 ± 3.38 46.43 ± 4.50 48.82 ± 5.99 49.43 ± 3.69 0.019 1 < 3, 4; 2 < 4 LVS * 29 (28,31) 29 (27,32) 30 (28.75,37) 32 (30,35) 0.008 1, 2 < 4 IVS, mm 10.61 ± 2.28 10.83 ± 1.85 11.00 ± 1.69 11.17 ± 1.34 0.776 LVPW, mm 10 (9,10.25) 10 (9,11) 10 (9,11) 10 (10,12) 0.244 Valvular regurgitation 0.261 Yes, n 14 (58.3%) 16 (69.6%) 19 (76.0%) 20 (83.3%) No, n 10 (41.7%) 7 (30.4%) 6 (24.0%) 4 (16.7%) Left ventricular hypertrophy 0.143 Yes, n 3 (12.5%) 7 (30.4%) 6 (24.0%) 10 (41.7%) No, n 21 (87.5%) 16 (69.6%) 19 (76.0%) 14 (58.3%) Sleep evaluation AHI * 2.2 (1.15,3.95) 15.2 (11.8,25.5) 3.5 (1.0,4.3) 18.1 (9.2,31.9) <0.001 1 < 2, 4; 3 < 2, 4 SpO 2 * 89 (88.5,90.5) 83 (80,85) 89 (88,92) 84 (81,88) <0.001 2 < 1, 3; 4 < 3 * Marks a significant difference in the clinical factor among the HC, OSA, CAD, and CADOSA groups ( P  # LSD (Least Significant Difference) method or T2 method or Bonferroni method was used for pairwise comparison within groups, 1 = HC, 2 = OSA, 3 = CAD, 4 = CADOSA. Values are mean ± SD, n N, number of patients; BMI, body mass index; HR, heart rate; SBP, systolic blood pressure; DBP, diastolic blood pressure; NEU, neutrophils; RBC, red blood cells; HGB, hemoglobin; TBIL, total bilirubin; AST, aspartate aminotransferase; ALT, alanine aminotransferase; TC, total cholesterol; TG, triglycerides; HDL, high density lipoprotein; LDL, low density lipoprotein; CR, creatinine; UA, uric acid; HbA1C, glycated hemoglobin A1C; CK-MB, creatine kinase, MB Form; NT-proBNP, N-terminal pro-B-type natriuretic peptide; LVEF, left ventricular ejection fraction; LVD, left ventricular end-diastolic diameter; LVS, left ventricular end-systolic diameter; IVS, interventricular septal thickness; LVPW, left ventricular posterior wall thickness; AHI, apnea hypopnea index; SpO 2 3.2 Transcriptomic profiles of CAD The RNA-seq yielded sequencing data size ranging from 5.44 Gbp to 7.05 Gbp for each sample across four groups, resulting in 673.74 Gbp data in total ( Supplementary Table S2 Figure 1 Figure 1 Workflow of this study. Flowchart illustrating a study comparing healthy controls (n = 25), obstructive sleep apnea (OSA, n = 24), coronary artery disease (CAD, n = 24), and comorbidity of CAD and OSA (CADOSA, n = 23). It details the sample collection, PBMC transcriptome analysis, clinical evaluation, and statistical analysis. The chart shows processes like DEG identification, immune infiltration, function enrichment, correlation analysis, and machine learning for identifying core and hub DEGs, concluding with biomarkers for conditions OSA, CAD, and CADOSA. Principal component analysis based on transcriptomic gene expression showed that CAD and HC samples were apparently distinguished, indicating an intrinsic difference in gene regulation between the two groups ( Figure 2A Supplementary Table S3 Figures 2B,C Figure 2D Figure 2 Analysis of differentially expressed genes (DEGs) in coronary artery disease (CAD) compared to the healthy control (HC). (A) (B) (C) (D) P A series of scientific visualizations detailing differential gene expression and KEGG pathway enrichment between CAD and HC. (A) PCA plot with two groups: CAD and HC, showing clustering. (B) Venn diagrams comparing up-regulated and downregulated differentially expressed genes (DEGs) identified using edgeR and limma methods. (C) Heatmap illustrating gene expression patterns across samples, with hierarchical clustering on the side. (D) Bar graph displaying KEGG pathway enrichment with significant pathways highlighted, categorized into KEGG levels 1 and 2. 3.3 Transcriptomic shifts in OSA Samples from the OSA and HC groups exhibited clear separation by PCA analysis, confirming distinct transcriptomic profiles ( Figure 3A Figures 3B,C Supplementary Table S4 Figure 2D Figure 3 Analysis of differentially expressed genes (DEGs) in obstructive sleep apnea (OSA) compared to the healthy control (HC). (A) (B) (C) (D) P Multifaceted analysis visualizes gene expression and pathway enrichment between OSA and HC. (A) PCA plot differentiates OSA and HC groups. (B) Venn diagrams show overlap in differentially expressed genes (DEGs) identified by limma and edgeR. (C) Heatmap displays gene expression patterns. (D) KEGG pathway enrichment bar chart highlights significant pathways, categorized by biological processes with levels 1 and 2 categories. 3.4 Gene regulation in CADOSA comorbidity Similarly, the CADOSA samples were clustered and separated from HC samples ( Figure 4A Figures 4B,C Supplementary Table S5 Figure 4 Analysis of differentially expressed genes (DEGs) in coronary artery disease (CAD) complicated with OSA (CADOSA) compared to the healthy control. (A) (B) (C) (D) P Differential gene expression and KEGG pathway enrichment between CADOSA and HC. (A) A scatter plot with two clusters representing CADOSA and HC groups based on Dim1 and Dim2. (B) Venn diagrams of up-regulated and downregulated DEGs identified using limma and edgeR methods. (C) Heatmap with hierarchical clustering indicates differential expression patterns across samples. (D) Bar chart of KEGG enrichment analysis. 3.5 Comparative analysis of KEGG pathways and hub genes relevels divergent molecular regulations among OSA, CAD, and their comorbidity To investigate the distinct molecular profiles among CAD, OSA, and CADOSA, we identified unique and shared DEGs across the three comparisons. The Venn diagram revealed 555 CAD-specific DEGs and 44 OSA-specific DEGs, and 73 CADOSA-core DEGs which were commonly shared in three comparisons (CAD vs. HC, OSA vs. HC, and CADOSA vs. HC) ( Figure 5A Figure 5B Figure 5 Differentially expressed genes (DEGs) and functional enrichment comparisons and hub genes in CAD, OSA, and their comorbidity. (A) (B) (C–H) Differentially expressed genes (DEGs) and functional enrichment comparisons and hub genes in CAD, OSA, and their comorbidity. (A) Venn diagrams shows overlapping DEGs among CAD, CADOSA, and OSA. (B) Dot plot of DEG pathways comparisons among CAD, OSA and CADOSA. (C-H) Venn diagram and Protein-protein interaction (PPI) MCC-network of the top 10 hub genes of CAD (C,D), OSA(E,F), and CADOSA(G,H) identified by five network centrality algorithms: Maximal Clique Centrality (MCC), Edge Percolated Component (EPC), Closeness, Degree, and Betweenness. Overlapping genes represent consensus hub candidates. (Node color intensity reflects centrality ranking (dark red = highest, light yellow = lowest). Bold labels indicate genes consistently prioritized by all five algorithms. To further elucidate the molecular interactions, we constructed protein-protein interaction (PPI) networks using STRING and identified hub genes for each disease group. Hub gene selection was performed using five topological algorithms (MCC, EPC, Closeness, Degree, and Betweenness) implemented in the CytoHubba plugin for Cytoscape, and defined as with the intersection of top-ranked 10 genes across all five methods. Analysis results revealed distinct network characteristics of three diseases. The 555 CAD-specific DEGs formed the most extensive and complex PPI network, with three key hub genes identified, including CD68, ICAM1, and IL10 ( Figures 5C,D Figures 5E,F Figures 5G,H 3.6 Potential biomarkers of OSA, CAD, and their comorbidity Through time-series analysis of DEGs, we characterized dynamic gene expression patterns during disease progression from healthy controls (HC) to CAD/OSA and subsequently to CADOSA comorbidity. In the “HC→CAD→CADOSA” transition, we identified four expression clusters ( Supplementary Figure S1 Supplementary Figure S2 Through integration of core genes with hub genes, we identified candidate biomarkers including three CAD-associated (CD68, ICAM1, IL10), two OSA-associated (GLUD2, PKP2), and two CADOSA-associated (MMP9, S100A12) genes. Following rigorous evaluation using three machine learning approaches, we established the final biomarker panels and developed diagnostic models for each condition. The composite diagnostic model demonstrated excellent discriminatory capacity across all conditions. For CAD, the elasticNet-based model achieved an AUC of 0.92, while individual biomarkers CD68, ICAM1, and IL10 showed robust standalone performance with AUCs of 0.94, 0.84, and 0.75, respectively ( Figure 6A Figure 6B Figure 6C Figure 6D Figure 6 Evaluation of diagnostic models and biomarker performance. (A) (B) (C) (D) Evaluation of diagnostic models and biomarker performance for CAD, OSA, and CADOSA. (A) ROC curves for CAD models and individual biomarker genes with high AUC values(left), as well as expression (right) .(B) ROC curves/expression hist for OSA models and biomarkers. (C) ROC curves/expression hist for CADOSA models and biomarkers. (D) Expression of MMP9 and S100A12 between CADOSA and health control quantified using qRT-PCR. 3.7 Immune landscape and their correlation with biomarker genes Functional enrichment analysis of DEGs highlighted the involvement of immune dysfunctionin the pathogenesis of CAD, OSA, and CADOSA. To further characterize immune dysregulation, we performed immune cell infiltration analysis in PBMCs across the three disease groups. We identified 22 distinct immune cell subtypes, with monocytes being the most abundant, followed by CD4+ memory resting T cells, NK resting cells, and CD8+ T cells, collectively accounting for nearly 80% of PBMCs ( Figure 7A Figure 7B Figure 7 Immune cell profiling and biomarker correlations in healthy controls (HC), CAD, OSA, and CADOSA groups. (A) (B) (C) (D) (E) Immune cell frequency and correlation analyses in healthy controls (HC), CAD, OSA, and CADOSA groups. (A) Stacked bar chart of cell frequency percentages across four groups: HC, CAD, OSA, and CADOSA. (B) Box plots comparing different cell types with statistical significance noted. (D) The correlation between the proportion of immune cells and the expression of biomarker genes GLUD2 in OSA samples. (E) The correlation between the proportion of immune cells and the expression of biomarker genes MMP9 and S100A12 in CADOSA samples. To assess immune cell interactions, we conducted correlation analyses in CAD samples. CD4+ memory resting T cells showed a negative association with regulatory T cells and resting mast cells, while NK resting cells were inversely correlated with macrophages M0 ( Figure 7C In OSA patients, CD4+ memory resting T cells were inversely associated with activated CD4+ memory T cells and macrophages M0. NK resting cells showed a negative correlation with macrophages M0 and monocytes, while CD8+ T cells were positively linked to activated CD4+ memory T cells and macrophages M0 but negatively correlated with monocytes. However, no significant relationship was observed between the OSA biomarker GLUD2 and immune cell proportions ( Figure 7D For the CADOSA cohort, we found that CD8+ T cell proportions were negatively associated with CD4+ memory resting T cells, and monocytes exhibited an inverse correlation with NK resting cells ( Figure 7E Figure 7C Figure 7E 4 Discussion It is common for OSA and CAD to coexist, especially CAD patients frequently present with comorbid OSA, which raises the severity of disease and rates of mortality ( 20 22 23 24 Clinically, the progressive increase in carotid plaque burden, left ventricular hypertrophy, valvular regurgitation, and left ventricular dysfunction (LVD/LVS) from healthy controls (HC) to OSA, CAD, and ultimately CADOSA highlights the escalating cardiovascular dysfunction in comorbid conditions ( 25 At the molecular level, dysfunctional efferocytosis, which is a critical process mediated by phagocytes for clearing apoptotic cells and resolving inflammation, has been implicated in atherosclerosis ( 26 27 Except the shared pathways, distinct cellular processes were characterized for each disease condition. In CAD, immune activation is evident through the enrichment of hematopoietic cell lineage, complement and coagulation cascades, and B-cell receptor signaling pathways. Lipid metabolism dysregulation, particularly in ether lipid and arachidonic acid metabolism, further supports the well-documented metabolic imbalance in CAD ( 28 30 31 32 33 34 34 35 37 This study systematically identified potential biomarkers for CAD-OSA comorbidity through an integrative bioinformatics approach. However, the relatively small sample size may limit statistical power, and validation in an independent cohort is needed in future studies. To enhance reliability and mitigate overfitting, we employed multiple strategies, including rigorous bioinformatic dimensionality reduction, 10-fold cross-validation, and experimental validation by qPCR. By combining stepwise DEG analysis, expression pattern-based core gene selection, PPI network-derived hub gene classification, and machine learning validation, we established a robust framework for biomarker discovery. The core hub gene-based predictive models demonstrated strong diagnostic performance across disease conditions, with ElasticNet, Random Forest, and SVM algorithms each showing optimal efficacy for specific disease states. Notably, single biomarkers exhibited high predictive value (as evidenced by AUC metrics), though their combined use only marginally improved diagnostic accuracy, supporting their utility as independent indicators. Among the identified biomarkers, CD68 emerged as a particularly promising candidate for CAD, showing both the highest AUC and expression levels. Its strong correlation with monocyte infiltration aligns with its established role as a macrophage/monocyte marker in inflammatory processes ( 38 39 41 41 42 43 44 45 46 47 48 Our study delineates both shared and distinct molecular pathways underlying OSA, CAD, and their comorbidity, while proposing new therapeutic targets. The discovered biomarkers could potentially be developed into a clinical assay to aid in risk stratification and management. Furthermore, these biomarkers could serve as objective endpoints in clinical trials, testing the efficacy of therapies aimed at mitigating the shared pathophysiology of this comorbidity. Although future validation is needed, our study provides a crucial foundation for personalized management in this comorbid population. Nevertheless, certain limitations must be acknowledged. Firstly, our PBMC-based profiling offers valuable insights, it may not fully reflect tissue-specific responses, particularly within vascular endothelium or atherosclerotic plaques, which is warrant further investigation. Secondly, the mechanistic contributions of identified biomarkers to CADOSA pathogenesis requires further mechanic investigation through in vivo in vitro 5 Conclusion Patients with CADOSA comorbidity demonstrate significantly exacerbated clinical manifestations compared to isolated CAD or OSA, including more severe cardiovascular dysfunction, pronounced sleep-disordered breathing, and aggravated metabolic disturbances. Our study elucidates the molecular mechanisms underlying this high-risk multimorbidity, revealing both shared pathological pathways (including impaired efferocytosis, neutrophil extracellular trap activation, and cytoskeletal abnormalities) and distinct molecular signatures (particularly NOD-like receptor and PPAR signaling pathways). We identified GLUD2, S100A12, and MMP9 as robust diagnostic biomarkers, with GLUD2 reflecting glutamate metabolism-related neural dysfunction in OSA and S100A12/MMP9 indicating cross-condition inflammatory processes in CADOSA. These findings not only provide a comprehensive molecular framework explaining the heightened severity of CADOSA but also offer clinically valuable biomarkers for early detection and targeted therapeutic intervention, advancing toward precision medicine approaches for this complex comorbidity. Data availability statement The datasets presented in this study can be found in online repositories. The names of the repository/repositories and accession number(s) can be found below: https://www.ncbi.nlm.nih.gov/ Ethics statement The studies involving humans were approved by Institutional Review Board of the Second Affiliated Hospital of Fujian Medical University. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Author contributions LY: Methodology, Conceptualization, Writing – original draft, Funding acquisition, Writing – review & editing, Supervision. QL: Conceptualization, Methodology, Writing – original draft, Resources. XC: Methodology, Investigation, Writing – original draft, Conceptualization, Resources. SC: Investigation, Validation, Writing – original draft. HG: Conceptualization, Writing – original draft, Resources. MH: Writing – original draft, Investigation, Validation. YS: Investigation, Writing – original draft, Validation. MZ: Investigation, Writing – review & editing, Writing – original draft, Validation. HL: Conceptualization, Investigation, Supervision, Writing – review & editing, Writing – original draft, Project administration, Funding acquisition. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fcvm.2025.1658016/full#supplementary-material References 1. World-Health-Organization. cardiovascular diseases (CVDs) World Health Organization (WHO) 2021) Available online at http://www.who.int/mediacentre/factsheets/fs317/en/ (Accessed February 02, 2025) 2. Mensah George A Fuster V Murray Christopher JL Roth Gregory A Global burden of cardiovascular diseases and risks, 1990–2022 JACC 2023 82 2350 473 10.1016/j.jacc.2023.11.007 38092509 PMC7615984 3. Abbasi A Gupta SS Sabharwal N Meghrajani V Sharma S Kamholz S A comprehensive review of obstructive sleep apnea Sleep Sci 2021 14 142 10.5935/1984-0063.20200056 34381578 PMC8340897 4. Yeghiazarians Y Jneid H Tietjens JR Redline S Brown DL El-Sherif N Obstructive sleep apnea and cardiovascular disease: a scientific statement from the American Heart Association Circulation 2021 144 e56 67 10.1161/CIR.0000000000000988 34148375 5. Lee C-H Sethi R Li R Ho H-H Hein T Jim M-H Obstructive sleep apnea and cardiovascular events after percutaneous coronary intervention Circulation 2016 133 2008 17 10.1161/CIRCULATIONAHA.115.019392 27178625 6. Floras JS Sleep apnea and cardiovascular risk J Cardiol 2014 63 3 8 10.1016/j.jjcc.2013.08.009 24084492 7. Shah AJ Quek E Alqahtani JS Hurst JR Mandal S Cardiovascular outcomes in patients with COPD-OSA overlap syndrome: a systematic review and meta-analysis Sleep Med Rev 2022 63 101627 10.1016/j.smrv.2022.101627 35413500 8. Jiang L Wei W Kang S Li X-L Luo Y Insights into lipid metabolism and immune-inflammatory responses in the pathogenesis of coronary artery ectasia Front Physiol 2023 14 1096991 10.3389/fphys.2023.1096991 36760522 PMC9905697 9. Mohammad-Rezaei M Ahmadi R Rafiei A Khaledifar A Fattahi S Samiei-Sefat A Serum levels of IL-32 in patients with coronary artery disease and its relationship with the serum levels of IL-6 and TNF-α Mol Biol Rep 2021 48 4263 71 10.1007/s11033-021-06441-7 34086163 10. Luc G Arveiler D Evans A Amouyel P Ferrieres J Bard J-M Circulating soluble adhesion molecules ICAM-1 and VCAM-1 and incident coronary heart disease: the PRIME study Atherosclerosis 2003 170 169 76 10.1016/S0021-9150(03)00280-6 12957696 11. Wu N Liu G Huang Y Liao Q Han L Ye H Study of the association of 17 lipid-related gene polymorphisms with coronary heart disease Anatol J Cardiol 2018 19 360 10.14744/AnatolJCardiol.2018.23682 29848931 PMC5998860 12. Ryan S McNicholas WT Intermittent hypoxia and activation of inflammatory molecular pathways in OSAS Arch Physiol Biochem 2008 114 261 6 10.1080/13813450802307337 18946786 13. Lavie L Lavie P Molecular mechanisms of cardiovascular disease in OSAHS: the oxidative stress link Eur Respir J 2009 33 1467 84 10.1183/09031936.00086608 19483049 14. Mochol J Gawrys J Gajecki D Szahidewicz-Krupska E Martynowicz H Doroszko A Cardiovascular disorders triggered by obstructive sleep apnea—a focus on endothelium and blood components Int J Mol Sci 2021 22 5139 10.3390/ijms22105139 34066288 PMC8152030 15. Miao L Yin R-X Huang F Yang S Chen W-X Wu J-Z Integrated analysis of gene expression changes associated with coronary artery disease Lipids Health Dis 2019 18 92 10.1186/s12944-019-1032-5 30961613 PMC6454774 16. Li P Yan X Xu G Pang Z Weng J Yin J A novel plasma lncRNA ENST00000416361 is upregulated in coronary artery disease and is related to inflammation and lipid metabolism Mol Med Rep 2020 21 2375 84 10.3892/mmr.2020.11067 32323776 PMC7185291 17. Koplev S Seldin M Sukhavasi K Ermel R Pang S Zeng L A mechanistic framework for cardiometabolic and coronary artery diseases Nat Cardiovasc Res 2022 1 85 100 10.1038/s44161-021-00009-1 36276926 PMC9583458 18. Zhou E-H Zhou T-J Wang X-T Zhang J-Y Guan J Yin S-K Identifying and validating immunological biomarkers in obstructive sleep apnea through bioinformatics analysis Sci Rep 2025 15 9746 10.1038/s41598-025-93915-4 40118992 PMC11928569 19. Wu X Pan Z Liu W Zha S Song Y Zhang Q The discovery, validation, and function of hypoxia-related gene biomarkers for obstructive sleep apnea Front Med 2022 9 813459 10.3389/fmed.2022.813459 PMC8970318 35372438 20. Ooi EL Rajendran S Obstructive sleep apnea in coronary artery disease Curr Probl Cardiol 2023 48 101178 10.1016/j.cpcardiol.2022.101178 35341799 21. Hein T Loo G Lee C-H Obstructive sleep apnea, coronary artery disease and continuous positive airway pressure therapy Interv Cardiol 2012 4 595 10.2217/ica.12.44 22. Zhang J Song Y Ji Y Song Y Cai S Yu Y Correlation between coronary artery disease and obstructive sleep apnea syndrome and analysis of risk factors Exp Ther Med 2018 15 4771 6 10.3892/etm.2018.6070 29805494 PMC5958735 23. Chen B Dong L Zhang J Hao Y Chi W Song D Exploring shared pathways and the shared biomarker ERRFI1 in obstructive sleep apnoea and atherosclerosis using integrated bioinformatics analysis Sci Rep 2023 13 15103 10.1038/s41598-023-42184-0 37699925 PMC10497545 24. Feng K Yang J Liu K Shared genetic associations and aetiology between obstructive sleep apnoea and cardiovascular diseases: a genome-wide cross-trait analysis and bidirectional Mendelian randomization analysis Eur J Prev Cardiol 2024 5 zwae347 10.1093/eurjpc/zwae347 39499187 25. Haug N Deischinger C Gyimesi M Kautzky-Willer A Thurner S Klimek P High-risk multimorbidity patterns on the road to cardiovascular mortality BMC Med 2020 18 44 10.1186/s12916-020-1508-1 32151252 PMC7063814 26. Adkar SS Leeper NJ Efferocytosis in atherosclerosis Nat Rev Cardiol 2024 21 762 79 10.1038/s41569-024-01037-7 38750215 27. Shah F Franklin KA Holmlund T Levring Jäghagen E Berggren D Forsgren S Desmin and dystrophin abnormalities in upper airway muscles of snorers and patients with sleep apnea Respir Res 2019 20 31 10.1186/s12931-019-0999-9 30764835 PMC6376723 28. Gould RG Lipid metabolism and atherosclerosis Am J Med 1951 11 209 27 10.1016/0002-9343(51)90107-6 14856990 29. Paapstel K Kals J Eha J Tootsi K Ottas A Piir A Metabolomic profiles of lipid metabolism, arterial stiffness and hemodynamics in male coronary artery disease patients IJC Metab Endocr 2016 11 13 8 10.1016/j.ijcme.2016.05.001 30. Borodzicz S Czarzasta K Kuch M Cudnoch-Jedrzejewska A Sphingolipids in cardiovascular diseases and metabolic disorders Lipids Health Dis 2015 14 55 10.1186/s12944-015-0053-y 26076974 PMC4470334 31. Mangge H Stelzer I Reininghaus E Weghuber D Postolache TT Fuchs D Disturbed tryptophan metabolism in cardiovascular disease. Curr Med Chem 2014 21 1931 7 10.2174/0929867321666140304105526 24606499 PMC4922792 32. Clejan S Japa S Clemetson C Hasabnis SS David O Talano JV Blood histamine is associated with coronary artery disease, cardiac events and severity of inflammation and atherosclerosis J Cell Mol Med 2002 6 583 92 10.1111/j.1582-4934.2002.tb00456.x 12611642 PMC6741342 33. Xu Y Hu T Ding H Yuan Y Chen R miR-485-5p alleviates obstructive sleep apnea syndrome with hypertension by inhibiting PI3K/AKT signaling pathway via downregulating HIF3A expression Sleep Breath 2023 27 109 19 10.1007/s11325-022-02580-8 35132534 34. Castillo-Peinado LS Calderón-Santiago M Jurado-Gámez B Priego-Capote F Changes in human sweat metabolome conditioned by severity of obstructive sleep apnea and intermittent hypoxemia J Sleep Res 2024 33 e14075 10.1111/jsr.14075 37877569 35. Zhong Y Kinio A Saleh M Functions of NOD-like receptors in human diseases Front Immunol 2013 4 333 10.3389/fimmu.2013.00333 24137163 PMC3797414 36. Zhang X Young HA PPAR And immune system—what do we know? Int Immunopharmacol 2002 2 1029 44 10.1016/S1567-5769(02)00057-7 12349941 PMC2543934 37. Wahli W Michalik L PPARs at the crossroads of lipid signaling and inflammation Trends Endocrinol Metab 2012 23 351 63 10.1016/j.tem.2012.05.001 22704720 38. Chistiakov DA Killingsworth MC Myasoedova VA Orekhov AN Bobryshev YV CD68/macrosialin: not just a histochemical marker Lab Invest 2017 97 4 13 10.1038/labinvest.2016.116 27869795 39. Kaur R Singh V Kumari P Singh R Chopra H Emran TB Novel insights on the role of VCAM-1 and ICAM-1: potential biomarkers for cardiovascular diseases Ann Med Surg 2022 84 104802 10.1016/j.amsu.2022.104802 PMC9672401 36408439 40. Troncoso MF Ortiz-Quintero J Garrido-Moreno V Sanhueza-Olivares F Guerrero-Moncayo A Chiong M VCAM-1 as a predictor biomarker in cardiovascular disease Biochim Biophys Acta Mol Basis Dis 2021 1867 166170 10.1016/j.bbadis.2021.166170 34000374 41. Zakynthinos E Pappa N Inflammatory biomarkers in coronary artery disease J Cardiol 2009 53 317 33 10.1016/j.jjcc.2008.12.007 19477372 42. Gozal D Obstructive sleep apnea in children: implications for the developing central nervous system Semin Pediatr Neurol 2008 15 100 6 10.1016/j.spen.2008.03.006 18555196 PMC2490595 43. Arnold KA Blair JE Paul JD Shah AP Nathan S Alenghat FJ Monocyte and macrophage subtypes as paired cell biomarkers for coronary artery disease Exp Physiol 2019 104 1343 52 10.1113/EP087827 31264265 PMC6717038 44. Saito T Hojo Y Ogoyama Y Hirose M Ikemoto T Katsuki T S100a12 as a marker to predict cardiovascular events in patients with chronic coronary artery disease Circ J 2012 76 2647 52 10.1253/circj.CJ-12-0093 22786469 45. Shi Y-K Chen J-X Huang Y Li A-Y Serum S100A12 levels are associated with the presence and severity of obstructive sleep apnea syndrome in male patients Sleep Breath 2014 18 269 74 10.1007/s11325-013-0876-6 23868710 46. Lubrano V Balzan S Status of biomarkers for the identification of stable or vulnerable plaques in atherosclerosis Clin Sci 2021 135 1981 97 10.1042/CS20210417 34414413 47. Özkan E Celik Y Yucel-Lindberg T Peker Y Current smoking determines the levels of circulating MPO and MMP-9 in adults with coronary artery disease and obstructive sleep apnea J Clin Med 2023 12 4053 10.3390/jcm12124053.48 37373746 PMC10299467 48. Kim SY Yoon H Choi SH Cho J Serum matrix metalloproteinase-9 as a potential biomarker for obstructive sleep apnea severity Sleep Breath 2025 29 134 10.1007/s11325-025-03287-2 40117070 PMC11928356 ",
  "metadata": {
    "Title of this paper": "Serum matrix metalloproteinase-9 as a potential biomarker for obstructive sleep apnea severity",
    "Journal it was published in:": "Frontiers in Cardiovascular Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484168/"
  }
}