{
  "title": "Paper_819",
  "abstract": "Cancer Discov Cancer Discov 319 nihpa Cancer discovery 2159-8274 2159-8290 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12479099 PMC12479099.1 12479099 12479099 NIHMS2106719 40986428 10.1158/2159-8290.CD-24-1417 NIHMS2106719 NIHPA2106719 1 Article EML4-ALK variant-specific genetic interactions shape lung tumorigenesis Diaz-Jimenez Alberto 1 2 # Shuldiner Emily G. 3 # Somogyi Kalman 1 Shih Karen 3 Gonzalez-Velasco Oscar 4 Najajreh Mulham 1 2 Kim Stewart 5 Akkas Filiz 1 Murray Christopher W. 5 Andrejka Laura 6 Tsai Min K. 5 6 Brors Benedikt 4 7 8 Hofmann Ilse 9 Sivakumar Smruthy 10 Sisoudiya Saumya D. 10 Sokol Ethan S. 10 Cai Hongchen 6 11 Petrov Dmitri A. 3 5 Winslow Monte M. 5 6 12 Sotillo Rocio 1 7 13 1 2 3 4 5 6 7 8 9 10 11 12 13 # Contributed equally. Author contributions Conceptualization and design of the study: A.D.J., E.G.S., M.M.W., R.S. Designed and constructed DNA vectors: A.D.J., K.S. with contributions from C.W.M. Conducted autochthonous lung modeling: A.D.J., M.K.T. Performed histology stains: A.D.J., F.A., R.S. Western Blot and ALK Antibody generation: K.S., I.H. Drug analysis in 3D cultures: M.N., R.S. Prepared Tuba-seq libraries from mouse lung: A.D.J., L.A. Designed the computational pipeline, methodology, and formal analysis: E.G.S., K.S. D.A.P. Analysis of human tumor sequencing data: S.S., S.D.S, E.G.S, E.S.S. RNA-seq/ATAC-seq generation and analysis: A.D.J., S.K., H.C., O.G., B.B. Wrote the manuscript: A.D.J., E.G.S., M.M.W., R.S. Resources: M.M.W., R.S. Correspondence should be addressed to: Rocio Sotillo: r.sotillo@dkfz-heidelberg.de mwinslow@stanford.edu Competing interest statement M.M.W. and D.A.P. are co-founders of, and hold equity in, Guide Oncology, Inc. S.S, S.D.S, and E.S.S., are employees at Foundation Medicine, Inc., with an equity interest in Roche. 23 9 2025 497744 10.1158/2159-8290.CD-24-1417 23 08 2025 29 09 2025 30 09 2025 01 10 2025 Oncogenic fusions of EML4 and ALK occur in ~5% of lung adenocarcinomas. EML4-ALK variants have distinct breakpoints within EML4 in vivo pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf yes pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "EML4-ALK variant-specific genetic interactions shape lung tumorigenesis",
    "Journal it was published in:": "Cancer discovery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479099/"
  }
}