{
  "title": "Paper_855",
  "abstract": "medRxiv 3854 medrxiv MEDRXIV medRxiv Cold Spring Harbor Laboratory Preprints PMC12478338 PMC12478338.1 12478338 12478338 41030932 10.1101/2024.06.11.24308696 1 preprint 1 Article Predicting the Tumor Microenvironment Composition and Immunotherapy Response in Non-Small Cell Lung Cancer from Digital Histopathology Images Patkar Sushant http://orcid.org/0000-0002-5877-0599 Chen Alex http://orcid.org/0009-0003-5900-1892 Basnet Alina Bixby Amber Rajendran Rahul Chernet Rachel Faso Susan Kumar Prashant A. Desai Devashish El-Zammar Ola Curtiss Christopher Carello Saverio J. Nasr Michel Choyke Peter Harmon Stephanie Turkbey Baris Jamaspishvili Tamara 12 6 2024 497786 2024.06.11.24308696 29 09 2025 30 09 2025 01 10 2025 http://medrxiv.org/lookup/doi/10.1101/2024.06.11.24308696 nihpp-2024.06.11.24308696.pdf Abstract Immune checkpoint inhibitors (ICI) have become integral to treatment of non-small cell lung cancer (NSCLC). However, reliable biomarkers predictive of immunotherapy efficacy are limited. Here, we introduce HistoTME, a novel weakly supervised deep learning approach to infer the tumor microenvironment (TME) composition directly from histopathology images of NSCLC patients. We show that HistoTME accurately predicts the expression of 30 distinct cell type-specific molecular signatures directly from whole slide images, achieving an average Pearson correlation of 0.5 with the ground truth on independent tumor cohorts. Furthermore, we find that HistoTME-predicted microenvironment signatures and their underlying interactions improve prognostication of lung cancer patients receiving immunotherapy, achieving an AUROC of 0.75[95% CI: 0.61-0.88] for predicting treatment responses following first-line ICI treatment, utilizing an external clinical cohort of 652 patients. Collectively, HistoTME presents an effective approach for interrogating the TME and predicting ICI response, complementing PD-L1 expression, and bringing us closer to personalized immuno-oncology. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version yes pmc-prop-is-scanned-article no pmc-prop-preprint yes pmc-prop-in-epmc no ",
  "metadata": {
    "Title of this paper": "\nPredicting the Tumor Microenvironment Composition and Immunotherapy Response in Non-Small Cell Lung Cancer from Digital Histopathology Images\n",
    "Journal it was published in:": "medRxiv",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478338/"
  }
}