{
  "title": "Paper_1045",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12475226 PMC12475226.1 12475226 12475226 41006285 10.1038/s41598-025-02671-y 2671 1 Article Individualized prediction tool for patients with metastatic gastric signet cell carcinoma Huang Daoxu 1 Li Xuan 2 Huang Yiling 1 Chen Xiang 1 Zheng Zengpai zhengzengpai@126.com 3 1 2 3 26 9 2025 2025 15 478255 33163 25 1 2025 15 5 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Gastric signet cell carcinoma (GSRC) is a special type of gastric cancer. Due to its high metastatic rate patients usually have a poor prognosis. Accurately predicting the survival time of these patients and selecting the best treatment strategy are urgent clinical questions. All patients included in the study were extracted from the Surveillance, Epidemiology, and End Results (SEER) database. The demographic and clinical information of these patients was subjected to Cox regression analysis using SPSS software. The risk factors that were subsequently screened were used to construct and validate the nomogram through R software. A total of 1003 patients were included in this study. After Cox regression analysis, six variables (T stage, surgery status, chemotherapy, metastases status of bone, liver and lung) were identified as risk factors that independently influenced the patients’ prognosis. These variables were used to construct a nomogram, which was shown to have good predictive power by receiver operating characteristic curves and calibration curves. The AUC values for 3-, 6-, and 12-month OS prediction were 0.845, 0.793, and 0.751 in the training cohort, and 0.800, 0.735, and 0.693 in the validation cohort and decision curve analysis indicating that this nomogram could result in a good clinical benefit for the patient. We have successfully developed and validated a nomogram that accurately predicts 3-, 6- and 12-month overall survival in patients with metastatic GSRC. This can provide a theoretical basis for clinical practice and help clinicians to choose the best treatment strategy for their patients. Keywords GSRC Metastasis OS SEER Nomogram Subject terms Cancer prevention Cancer therapy Gastrointestinal cancer Metastasis Oncology Risk factors pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Gastric cancer is the fifth most prevalent cancer in the world, and according to the International Agency for Research on Cancer (IARC), more than one million people are diagnosed with it each year, and about 800,000 die from the disease 1 2 3 Since gastric signet ring cell carcinoma (GSRC) often has no obvious symptoms in the early stage and is highly aggressive, it is often detected at an advanced stage. This leads to the poor prognosis of gastric impression cell carcinoma. Generally speaking, patients with early diagnosis and treatment of GSRC have a better prognosis, with a five-year survival rate of more than 50% 4 In terms of treatment, the therapeutic strategy for GSRC usually needs to be determined based on the clinical stage of the tumor and the overall condition of the patient. For early-diagnosed GSRC, surgical resection is the treatment of choice, and surgical procedures such as local excision or total gastrectomy can be chosen according to the location and size of the tumor. For advanced or metastatic GSRC, chemotherapy and radiotherapy are usually used in combination with surgery to prolong patients’ survival time and improve their quality of life 5 Nomogram is a graphical tool for predictive modelling and clinical decision making 6 7 There is a lack of short-term survival prediction tools for metastatic GSRC, and existing models mostly focus on long-term prognosis. This study assessed the risk of early death in patients with metastatic GSRC by predicting the probability of survival at 3-, 6- and 12- months. It aims to provide a reliable reference for clinicians to select more appropriate treatment strategies for patients with metastatic GSRC. Methods Data collection All patient demographic and clinical information in this study was extracted from the Surveillance, Epidemiology, and End Results (SEER) database (version 8.4.0.1). The study was ethically exempted as no private patient information was involved. Inclusion criteria were as follows: (1) Diagnosed with gastric signet ring cell carcinoma (ICD-O-3 code: 8490/3) between 2000 and 2015 (2) AJCC (AJCC 7th edition) M stage of M1 Exclusion criteria were as follows: (1) survival time and survival status unknown (2) AJCC T-stage of T0 (3) other clinical information (e.g., age, sex, surgical status, etc.) unknown. A total of 1003 patients were included in the study. Statistical analysis The total cohort was randomly divided into a training set and a validation set in a 7:3 ratio. Cox proportional hazards regression was used for multivariate analysis to identify independent prognostic factors in thyroid cancer patients who did not undergo surgery. The COX risk regression model is a semiparametric survival analysis method for assessing the effect of multiple covariates on the risk of an event occurring. In the training set, univariate and multivariate Cox regression analyses were conducted to identify risk factors affecting postoperative overall survival (OS). Using R software, A nomogram to predict 3, 6, and 12-month OS was developed based on the multivariate Cox regression results. Receiver operating characteristic (ROC) curves were generated, and the area under the curve (AUC) was calculated to assess the model’s discrimination ability. Calibration curves and decision curve analysis (DCA) was performed for 3, 6, and 12 months to evaluate predictive accuracy and clinical utility. X-tile software was used to determine the optimal cutoff point for the nomogram score, categorizing patients into three risk groups. Kaplan-Meier survival curves were plotted based on these risk groups. All statistical analyses and charting were conducted using SPSS (version 25.0) and R software (version 4.3.1). A two-tailed P-value of less than 0.05 was considered statistically significant. Results Demographic and clinical information characteristics of patients After screening, a total of 1003 patients were included in the study (Fig. 1 1  Fig. 1 Patients Screening.  Table 1 Characteristics of GSRC patients with metastasis. Characters Group P 2 Overall, N 1 Training cohort, N 1 Validation cohort, N 1 Age 0.27 ≤ 60 518 (51.65%) 371 (52.77%) 147 (49.00%) > 60 485 (48.35%) 332 (47.23%) 153 (51.00%) Sex 0.60 Male 509 (50.75%) 353 (50.21%) 156 (52.00%) Female 494 (49.25%) 350 (49.79%) 144 (48.00%) Race > 0.99 White 747 (74.48%) 524 (74.54%) 223 (74.33%) Black 109 (10.87%) 76 (10.81%) 33 (11.00%) Other 147 (14.66%) 103 (14.65%) 44 (14.67%) T stage 0.21 T1 222 (22.13%) 145 (20.63%) 77 (25.67%) T2 109 (10.87%) 80 (11.38%) 29 (9.67%) T3 250 (24.93%) 184 (26.17%) 66 (22.00%) T4 422 (42.07%) 294 (41.82%) 128 (42.67%) N.stage 0.85 N0 433 (43.17%) 302 (42.96%) 131 (43.67%) N1 332 (33.10%) 237 (33.71%) 95 (31.67%) N2 87 (8.67%) 62 (8.82%) 25 (8.33%) N3 151 (15.05%) 102 (14.51%) 49 (16.33%) Grade 0.34 Grade I 1 (0.10%) 0 (0.00%) 1 (0.33%) Grade II 26 (2.59%) 17 (2.42%) 9 (3.00%) Grade III 958 (95.51%) 675 (96.02%) 283 (94.33%) Grade IV 18 (1.79%) 11 (1.56%) 7 (2.33%) Surgery 0.55 No 758 (75.57%) 535 (76.10%) 223 (74.33%) Yes 245 (24.43%) 168 (23.90%) 77 (25.67%) Radiotherapy 0.85 No 869 (86.64%) 610 (86.77%) 259 (86.33%) Yes 134 (13.36%) 93 (13.23%) 41 (13.67%) Chemotherapy 0.36 No 327 (32.60%) 223 (31.72%) 104 (34.67%) Yes 676 (67.40%) 480 (68.28%) 196 (65.33%) Bone metastasis 0.33 No 877 (87.44%) 610 (86.77%) 267 (89.00%) Yes 126 (12.56%) 93 (13.23%) 33 (11.00%) Brain metastasis 0.52 No 992 (98.90%) 694 (98.72%) 298 (99.33%) Yes 11 (1.10%) 9 (1.28%) 2 (0.67%) Liver metastasis 0.98 No 863 (86.04%) 605 (86.06%) 258 (86.00%) Yes 140 (13.96%) 98 (13.94%) 42 (14.00%) Lung metastasis 0.28 No 905 (90.23%) 639 (90.90%) 266 (88.67%) Yes 98 (9.77%) 64 (9.10%) 34 (11.33%) 1 2 Univariate and multivariate cox survival regression analyses After univariate Cox regression analysis, some of the variables were screened as independent influences that may affect 3-, 6-, and 12-month OS in GSRC patients with metastasis. All the variables were shown in Table 1 2 P P P P P P P 2  Table 2 Analysis of univariate and multivariate Cox regression in GSRC patients with metastasis. Characteristics Univariate analysis Multivariate analysis HR (95% CI) P HR (95% CI) P Age ≤ 60 Reference Reference > 60 0.806 (0.692–0.938) 0.005 0.985 (0.842–1.153) 0.853 Sex Male Reference Reference Female 1.197 (1.028–1.394) 0.021 1.114 (0.954–1.302) 0.173 Race White Reference Black 1.100 (0.883–1.371) 0.394 Other 1.208 (0.892–1.635) 0.221 T stage T1 Reference Reference T2 1.026 (0.835–1.260) 0.807 0.763 (0.609–0.956) 0.019 T3 1.009 (0.783–1.299) 0.946 0.950 (0.732–1.233) 0.698 T4 0.784 (0.648–0.948) 0.012 0.822 (0.676–0.998) 0.048 N stage N0 Reference Reference N1 1.311 (1.040–1.653) 0.022 0.921 (0.695–1.220) 0.564 N2 1.339 (1.054–1.702) 0.017 0.944 (0.707–1.260) 0.694 N3 1.055 (0.764–1.457) 0.745 1.069 (0.759–1.506) 0.703 Grade Grade II Reference Grade III 1.409 (0.628–3.161) 0.406 Grade IV 1.232 (0.638–2.379) 0.535 Surgery No Reference Reference Yes 1.780 (1.481–2.138) < 0.001 2.152 (1.699–2.726) < 0.001 Radiotherapy No Reference Yes 1.195 (0.959–1.490) 0.113 Chemotherapy No Reference Reference Yes 2.760 (2.336–3.261) < 0.001 3.199 (2.675–3.825) < 0.001 Bone metastasis No Reference Reference Yes 0.702 (0.561–0.878) 0.002 0.750 (0.590–0.952) 0.018 Brain metastasis No Reference Yes 1.170 (0.605–2.262) 0.640 Liver metastasis No Reference Reference Yes 0.735 (0.590–0.914) 0.006 0.775 (0.617–0.973) 0.028 Lung metastasis No Reference Reference Yes 0.608 (0.467–0.793) < 0.001 0.727 (0.552–0.957) 0.023 Construction and validation of nomogram predicting OS of patients with GSRC Six independent risk factors (T stage, chemotherapy, surgery status, metastasis of bone, liver and lung) demonstrated by univariate and multivariate Cox regression analyses were used to construct a 3-, 6-, and 12-month prediction model for OS of GSRC patients with metastasis (Fig. 2 3 4 5  Fig. 2 Nomogram for predicting 3-month, 6-month, and 12-month overall survival of GSRC patients with metastasis.  Fig. 3 Receiver operating characteristic curves for postoperative overall survival prediction of GSRC patients with metastasis. ( A B  Fig. 4 Calibration of the nomogram model in the training cohort ( A C D F  Fig. 5 Decision curve analysis of the nomogram model in the training cohort ( A C D F Hazard stratification Based on the patients’ nomogram scores, we classified the patients into three risk strata: low (< 419), middle (419–475) and high (> 475). The stratification criteria were determined by X-tile software, and the Kaplan-Meier curves indicated a significant difference in the prognosis of patients in different risk groups (Fig. 6  Fig. 6 Kaplan–Meier survival analyses for comparing postoperative overall survival in the low risk, middle risk, and high risk subgroups of all patients in the training cohort ( A B Discussion Gastric cancer is the fifth most prevalent cancer and the third most deadly cancer in the world 8 9 10 It has been noted that overall survival time in patients with gastric signet ring cell carcinoma is not statistically different between gender, which is consistent with our findings 9 11 12 13 The principles of radiotherapy and chemotherapy for GSRC patients remain highly controversial. Some investigators have pointed out the important role of hyperthermic intraperitoneal chemotherapy (HIPEC) in the treatment of GSRC patients, especially when surgery is performed after continued multimodal chemotherapy until cytology is negative, which is effective in prolonging the overall survival of the patients 14 15 16 17 19 20 Liver metastases are very common in patients with advanced gastric cancer, with statistical data showing that approximately 14% of gastric cancer patients develop liver metastases 21 22 23 16 24 1 25 In addition to the above mentioned influencing factors, the prognosis of patients with signet ring cell carcinoma is also affected by some other factors, such as tumor size and lymph node metastasis. Some studies have shown that patients with larger tumors and lymph node metastasis have poorer prognosis. In response to the poor prognosis of patients with gastric signet ring cell carcinoma, some studies have been devoted to finding new therapeutic strategies and targeted drugs to improve the prognosis of patients. For example, studies targeting the tumor microenvironment and immune escape mechanisms are expected to bring new breakthroughs in the treatment of gastric signet ring cell carcinoma. Some targeted therapeutic agents are beginning to be applied to the treatment of SRCC, for example, targeted agents against HER2 have shown some efficacy in some HER2-positive SRCC patients. In addition, some molecular biological indicators such as mutation or deletion of TP53, APC, CDH1, Notch-1 and other genes in tumor tissues are associated with poor prognosis 26 27 This study introduces the first validated nomogram predicting 3-, 6-, and 12-month survival in metastatic gastric signet ring cell carcinoma (GSRC), addressing a critical gap in prognostic tools focused on long-term outcomes or generalized cohorts. By integrating tumor stage, metastasis patterns (bone, liver, lung), and treatment responses, the model provides dynamic risk stratification for this high-risk population. Its visualization enables rapid clinical application without specialized software, while robust validation (AUC > 0.70) supports reliability despite SEER limitations. Future integration of molecular biomarkers (e.g., HER2) and external validation could refine precision, guiding personalized therapies and bridging prognostic gaps. However, we must recognize that our study has some limitations. First, bias is unavoidable due to the insufficient sample size of the population, the nature of retrospective studies and the lack of external validation. We will further expand the clinical data content to include patient samples from more hospitals in subsequent study programs. Second, skin and breast metastases of gastric signet ring cell carcinoma are equally important, but we did not conduct a relevant study due to the lack of relevant data. Despite these shortcomings, it is undeniable that this predictive model still has a high clinical value, which can help clinicians to choose the best treatment strategy for patients as well as provide a theoretical basis for researchers. Conclusion We have successfully developed and well validated a nomogram that accurately predicts 3-, 6-, and 12-month OS in patients with metastatic GSRC. The nomogram has been shown to have high predictive performance and to provide excellent clinical benefits to patients, helping clinicians to choose the best clinical strategy for their patients. Abbreviations GSRC gastric signet ring cell carcinoma OS overall survival SEER Surveillance, epidemiology, and end results ROC receiver operating characteristic curves AUC area under the curve DCA decision curve analysis Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions DX H and ZP Z conceived and designed the study. DX H and X L performed the literature search. DX H and YL H generated the figures and tables. DX H and X C analyzed the data. DX H wrote the manuscript and ZP Z critically reviewed the manuscript. DX H and ZP Z supervised the research. All authors have read and approved the manuscript. Data availability The dataset from the SEER database that was generated and/or analyzed during the current study is available in the SEER dataset repository (https://seer.cancer.gov/). The datasets generated during and/or analyzed during the current study are available from the corresponding author on reasonable request. Declarations Competing interests The authors declare no competing interests. Ethics approval and consent to participate All methods were carried out by relevant guidelines and regulations. Data extraction and usage have been approved by the SEER Program. All the data can be found in the SEER dataset: https://seer.cancer.gov/seerstat/ References 1. Ilic M Ilic I Epidemiology of stomach cancer World J. Gastroenterol. 2022 28 12 1187 1203 10.3748/wjg.v28.i12.1187 35431510 PMC8968487 Ilic, M. & Ilic, I. Epidemiology of stomach cancer. World J. Gastroenterol. 28 35431510 10.3748/wjg.v28.i12.1187 PMC8968487 2. Zhao W Single-cell analysis of gastric signet ring cell carcinoma reveals cytological and immune microenvironment features Nat. Commun. 2023 14 1 2985 10.1038/s41467-023-38426-4 37225691 PMC10209160 Zhao, W. et al. Single-cell analysis of gastric signet ring cell carcinoma reveals cytological and immune microenvironment features. Nat. Commun. 14 37225691 10.1038/s41467-023-38426-4 PMC10209160 3. Arai T Where does signet-ring cell carcinoma come from and where does it go? Gastric cancer: official J. Int. Gastric Cancer Association Japanese Gastric Cancer Association 2019 22 4 651 652 10.1007/s10120-019-00960-w 30963318 Arai, T. Where does signet-ring cell carcinoma come from and where does it go? Gastric cancer: official. J. Int. Gastric Cancer Association Japanese Gastric Cancer Association 22 10.1007/s10120-019-00960-w 30963318 4. Bramati C Early diagnosis of oral squamous cell carcinoma May ensure better prognosis: A case series Clin. Case Rep. 2021 9 10 e05004 10.1002/ccr3.5004 34721865 PMC8543051 Bramati, C. et al. Early diagnosis of oral squamous cell carcinoma May ensure better prognosis: A case series. Clin. Case Rep. 9 34721865 10.1002/ccr3.5004 PMC8543051 5. Mengardo V Treppiedi E Bencivenga M Dal Cero M Giacopuzzi S Tailored treatment for signet ring cell gastric cancer Updates Surg. 2018 70 2 167 171 10.1007/s13304-018-0550-4 29948660 Mengardo, V., Treppiedi, E., Bencivenga, M., Dal Cero, M. & Giacopuzzi, S. Tailored treatment for signet ring cell gastric cancer. Updates Surg. 70 29948660 10.1007/s13304-018-0550-4 6. Wu J A nomogram for predicting overall survival in patients with low-grade endometrial stromal sarcoma: A population-based analysis Cancer Commun. (London England) 2020 40 7 301 312 10.1002/cac2.12067 PMC7365459 32558385 Wu, J. et al. A nomogram for predicting overall survival in patients with low-grade endometrial stromal sarcoma: A population-based analysis. Cancer Commun. (London England) 40 10.1002/cac2.12067 PMC7365459 32558385 7. Jin C A nomogram for predicting the risk of invasive pulmonary adenocarcinoma for patients with solitary peripheral subsolid nodules J. Thorac. Cardiovasc. Surg. 2017 153 2 462 469e461 10.1016/j.jtcvs.2016.10.019 27838008 Jin, C. et al. A nomogram for predicting the risk of invasive pulmonary adenocarcinoma for patients with solitary peripheral subsolid nodules. J. Thorac. Cardiovasc. Surg. 153 27838008 10.1016/j.jtcvs.2016.10.019 8. Ferlay J Cancer incidence and mortality worldwide: sources, methods and major patterns in GLOBOCAN 2012 Int. J. Cancer 2015 136 5 E359 386 10.1002/ijc.29210 25220842 Ferlay, J. et al. Cancer incidence and mortality worldwide: sources, methods and major patterns in GLOBOCAN 2012. Int. J. Cancer 136 25220842 10.1002/ijc.29210 9. Yu JM Clinical characteristics and prognostic analysis of patients with signet ring cell gastric carcinoma Technol. Cancer Res. Treat. 2020 19 1533033820983812 10.1177/1533033820983812 33371800 PMC7780316 Yu, J. M. et al. Clinical characteristics and prognostic analysis of patients with signet ring cell gastric carcinoma. Technol. Cancer Res. Treat. 19 33371800 10.1177/1533033820983812 PMC7780316 10. Yokota T Signet ring cell carcinoma of the stomach: a clinicopathological comparison with the other histological types Tohoku J. Exp. Med. 1998 186 2 121 130 10.1620/tjem.186.121 10223615 Yokota, T. et al. Signet ring cell carcinoma of the stomach: a clinicopathological comparison with the other histological types. Tohoku J. Exp. Med. 186 10223615 10.1620/tjem.186.121 11. Ur Rahman MS Cao J Estrogen receptors in gastric cancer: advances and perspectives World J. Gastroenterol. 2016 22 8 2475 2482 10.3748/wjg.v22.i8.2475 26937135 PMC4768193 Ur Rahman, M. S. & Cao, J. Estrogen receptors in gastric cancer: advances and perspectives. World J. Gastroenterol. 22 26937135 10.3748/wjg.v22.i8.2475 PMC4768193 12. Ren J Effect of age on prognosis of gastric Signet-Ring cell carcinoma: A SEER database analysis Med. Sci. Monitor: Int. Med. J. Experimental Clin. Res. 2018 24 8524 8532 10.12659/MSM.911766 PMC6278247 30473583 Ren, J. et al. Effect of age on prognosis of gastric Signet-Ring cell carcinoma: A SEER database analysis. Med. Sci. Monitor: Int. Med. J. Experimental Clin. Res. 24 10.12659/MSM.911766 PMC6278247 30473583 13. Pernot S Signet-ring cell carcinoma of the stomach: impact on prognosis and specific therapeutic challenge World J. Gastroenterol. 2015 21 40 11428 11438 10.3748/wjg.v21.i40.11428 26523107 PMC4616218 Pernot, S. et al. Signet-ring cell carcinoma of the stomach: impact on prognosis and specific therapeutic challenge. World J. Gastroenterol. 21 26523107 10.3748/wjg.v21.i40.11428 PMC4616218 14. Badgwell B Phase II trial of laparoscopic hyperthermic intraperitoneal chemoperfusion for peritoneal carcinomatosis or positive peritoneal cytology in patients with gastric adenocarcinoma Ann. Surg. Oncol. 2017 24 11 3338 3344 10.1245/s10434-017-6047-4 28799004 Badgwell, B. et al. Phase II trial of laparoscopic hyperthermic intraperitoneal chemoperfusion for peritoneal carcinomatosis or positive peritoneal cytology in patients with gastric adenocarcinoma. Ann. Surg. Oncol. 24 28799004 10.1245/s10434-017-6047-4 15. Cunningham D Perioperative chemotherapy versus surgery alone for resectable gastroesophageal cancer N. Engl. J. Med. 2006 355 1 11 20 10.1056/NEJMoa055531 16822992 Cunningham, D. et al. Perioperative chemotherapy versus surgery alone for resectable gastroesophageal cancer. N. Engl. J. Med. 355 16822992 10.1056/NEJMoa055531 16. Messager M The impact of perioperative chemotherapy on survival in patients with gastric signet ring cell adenocarcinoma: a multicenter comparative study Ann. Surg. 2011 254 5 684 693 10.1097/SLA.0b013e3182352647 22005144 Messager, M. et al. The impact of perioperative chemotherapy on survival in patients with gastric signet ring cell adenocarcinoma: a multicenter comparative study. Ann. Surg. 254 22005144 10.1097/SLA.0b013e3182352647 17. Wei F Lyu H Wang S Chu Y Chen F Postoperative radiotherapy improves survival in gastric Signet-Ring cell carcinoma: a SEER database analysis J. Gastric Cancer 2019 19 4 393 407 10.5230/jgc.2019.19.e36 31897342 PMC6928086 Wei, F., Lyu, H., Wang, S., Chu, Y. & Chen, F. Postoperative radiotherapy improves survival in gastric Signet-Ring cell carcinoma: a SEER database analysis. J. Gastric Cancer 19 31897342 10.5230/jgc.2019.19.e36 PMC6928086 18. Gong H Chu Y Hu Q Song Q Preoperative radiotherapy is associated with significant survival benefits for patients with gastric signet ring cell carcinoma: A SEER-Based approach Technol. Cancer Res. Treat. 2020 19 1533033820960746 10.1177/1533033820960746 32945232 PMC7506782 Gong, H., Chu, Y., Hu, Q. & Song, Q. Preoperative radiotherapy is associated with significant survival benefits for patients with gastric signet ring cell carcinoma: A SEER-Based approach. Technol. Cancer Res. Treat. 19 32945232 10.1177/1533033820960746 PMC7506782 19. Tian HK Clinicopathological characteristics and prognosis of gastric signet ring cell carcinoma World J. Clin. Cases 2022 10 29 10451 10466 10.12998/wjcc.v10.i29.10451 36312481 PMC9602248 Tian, H. K. et al. Clinicopathological characteristics and prognosis of gastric signet ring cell carcinoma. World J. Clin. Cases 10 36312481 10.12998/wjcc.v10.i29.10451 PMC9602248 20. Ling CR Wang R Wang MJ Ping J Zhuang W Prognosis and value of preoperative radiotherapy in locally advanced rectal signet-ring cell carcinoma Sci. Rep. 2017 7 45334 10.1038/srep45334 28345614 PMC5366911 Ling, C. R., Wang, R., Wang, M. J., Ping, J. & Zhuang, W. Prognosis and value of preoperative radiotherapy in locally advanced rectal signet-ring cell carcinoma. Sci. Rep. 7 28345614 10.1038/srep45334 PMC5366911 21. Roh HR Outcome of hepatic resection for metastatic gastric cancer Am. Surg. 2005 71 2 95 99 10.1177/000313480507100201 16022005 Roh, H. R. et al. Outcome of hepatic resection for metastatic gastric cancer. Am. Surg. 71 16022005 22. Cui JK Liu M Shang XK Hepatectomy for liver metastasis of gastric cancer: A Meta-Analysis Surg. Innov. 2019 26 6 692 697 10.1177/1553350619856491 31267829 Cui, J. K., Liu, M. & Shang, X. K. Hepatectomy for liver metastasis of gastric cancer: A Meta-Analysis. Surg. Innov. 26 31267829 10.1177/1553350619856491 23. Riihimäki M Hemminki A Sundquist K Sundquist J Hemminki K Metastatic spread in patients with gastric cancer Oncotarget 2016 7 32 52307 52316 10.18632/oncotarget.10740 27447571 PMC5239553 Riihimäki, M., Hemminki, A., Sundquist, K., Sundquist, J. & Hemminki, K. Metastatic spread in patients with gastric cancer. Oncotarget 7 27447571 10.18632/oncotarget.10740 PMC5239553 24. Park JM Bone recurrence after curative resection of gastric cancer Gastric Cancer: Official J. Int. Gastric Cancer Association Japanese Gastric Cancer Association 2013 16 3 362 369 10.1007/s10120-012-0193-y 22961057 Park, J. M. et al. Bone recurrence after curative resection of gastric cancer. Gastric Cancer: Official J. Int. Gastric Cancer Association Japanese Gastric Cancer Association 16 10.1007/s10120-012-0193-y 22961057 25. Lai MY The relationship between brain metastasis and HER2 expression status in gastric cancer Clin. Translational Oncology: Official Publication Federation Span. Oncol. Soc. Natl. Cancer Inst. Mexico 2024 26 3 765 773 10.1007/s12094-023-03306-2 37620706 Lai, M. Y. et al. The relationship between brain metastasis and HER2 expression status in gastric cancer. Clin. Translational Oncology: Official Publication Federation Span. Oncol. Soc. Natl. Cancer Inst. Mexico 26 10.1007/s12094-023-03306-2 37620706 26. Puccini A Molecular profiling of signet-ring-cell carcinoma (SRCC) from the stomach and colon reveals potential new therapeutic targets Oncogene 2022 41 26 3455 3460 10.1038/s41388-022-02350-6 35618879 PMC9457205 Puccini, A. et al. Molecular profiling of signet-ring-cell carcinoma (SRCC) from the stomach and colon reveals potential new therapeutic targets. Oncogene 41 35618879 10.1038/s41388-022-02350-6 PMC9457205 27. Yan C miR-935 suppresses gastric signet ring cell carcinoma tumorigenesis by targeting Notch1 expression Biochem. Biophys. Res. Commun. 2016 470 1 68 74 10.1016/j.bbrc.2015.12.116 26742429 Yan, C. et al. miR-935 suppresses gastric signet ring cell carcinoma tumorigenesis by targeting Notch1 expression. Biochem. Biophys. Res. Commun. 470 26742429 10.1016/j.bbrc.2015.12.116 ",
  "metadata": {
    "Title of this paper": "miR-935 suppresses gastric signet ring cell carcinoma tumorigenesis by targeting Notch1 expression",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475226/"
  }
}