{
  "title": "Paper_139",
  "abstract": "pmc Front Cardiovasc Med Front Cardiovasc Med 2863 fcvm Front. Cardiovasc. Med. Frontiers in Cardiovascular Medicine 2297-055X Frontiers Media SA PMC12488558 PMC12488558.1 12488558 12488558 10.3389/fcvm.2025.1643805 1 Cardiovascular Medicine Case Report A case report of hepatocarcinoma-originated pericardial malignancy Wu Bin *  † Wang Zhixiao *  † Lin Weizhe  † Xiong Jian  † He Chaoyong  † Department of Cardiology, Taihe Hospital, Hubei University of Medicine Shiyan China Edited by: Reto Asmis Reviewed by: Hongrui Jin Runsang Pan * Correspondence: kadaiwu@163.com 443482793@qq.com  † ORCID Bin Wu orcid.org/0000-0002-5131-3424 orcid.org/0000-0002-3855-1209 orcid.org/00000-0002-0754-4524 orcid.org/0009-0009-1265-4099 orcid.org/0009-0009-4334-0084 18 9 2025 2025 12 480653 1643805 09 6 2025 01 9 2025 18 09 2025 03 10 2025 03 10 2025 © 2025 Wu, Wang, Lin, Xiong and He. 2025 Wu, Wang, Lin, Xiong and He https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) Cardiac tumors constitute an exceptionally rare neoplastic entity posing significant diagnostic challenges. We report a 55-year-old female patient without prior oncologic history who presented with acute-onset bilateral lower extremity edema progressing over 72 h. Transthoracic echocardiography demonstrated a pericardial mass with concomitant hemorrhagic pericardial effusion. Subsequent magnetic resonance imaging and systemic positron emission tomography localized the lesion to the right bottom of the heart. Surgical exploration suggested a cardiac occupancy as an irregular, fish-flesh-like soft tissue mass, pathology biopsy was performed suggesting a malignant tumour of epithelial origin, and immunohistochemistry was suggestive of hepatic origin. The patient received combination therapy comprising programmed death-1 inhibitor camrelizumab (200 mg via intravenous infusion every 21 days) and oral lenvatinib (8 mg once daily). Serial contrast-enhanced computed tomography of the thorax and abdomen demonstrated progressive metastatic dissemination with malignant pleural and peritoneal effusion formation. Despite therapeutic intervention, the patient ultimately experienced disease progression culminating in mortality. hepatocellular carcinoma cardiac metastases diagnostic imaging—methods lenvatinib camrelizumab The author(s) declare that financial support was received for the research and/or publication of this article. This study was supported by Hubei Provincial Natural Science Foundation of China (Grant/Award Number: 2024AFB928). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Cardio-Oncology Introduction While malignant neoplasms theoretically possess metastatic potential to all organ systems, including the heart, cardiac metastases remain uncommon in clinical practice. The most frequent primary malignancies associated with cardiac metastasis include cutaneous melanoma, pulmonary carcinoma ( 1 2 3 Case description A 55-year-old female patient with a 2-week history of bilateral lower extremity edema was admitted to our department (July 4, 2024), who had a history of left liver lobectomy for intrahepatic bile duct stones. Laboratory tests on admission showed that the alpha-fetoprotein (AFP) value was 225 times higher than the upper limit of the normal reference range (0–15 ug/L), and the carbohydrate antigen (CA125) value was 9 times higher than the upper limit of the normal reference range (0–20 U/mL). Large amounts of pericardial effusion were seen on cardiac ultrasonography. Following the evacuation of the effusion, a faint echogenic mass of approximately 4.4 × 2.5 cm was observed in the pericardial cavity near the bottom of the right heart. ( Figure 1a Figure 1b Figure 2 Figure 3 Figure 4 Supplementary Data Figure S1 Figure 1 (a) (b) Split image showing two medical scans. On the left (a), an ultrasound image shows highlighted areas within a heart region marked as \\“RA\\” with yellow arrows. On the right (b), a CT scan illustrates a cross-section of the heart, with a highlighted area on the right atrium marked by a yellow arrow. Figure 2 Patients fasted for over 6 h prior to intravenous injection of the radiotracer (¹⁸F-FDG). After resting quietly for 60 min, whole-body PET and CT tomographic imaging were performed. PET images underwent attenuation correction and iterative reconstruction. Both PET and CT images were displayed in multi-planar and multi-frame formats, demonstrating clear image quality. (a) (b) (c) Three PET scan images labeled a, b, and c show transverse sections of a thoracic region. Each image features a yellow arrowhead pointing to areas of increased radiotracer uptake, indicating metabolic activity. The scans highlight different sections of internal structures, including the spine and surrounding tissues. Figure 3 Following intravenous administration of gadoxetate disodium, magnetic resonance imaging of the liver revealed a well-defined roundish abnormal signal near the diaphragmatic surface of the left hepatic lobe. The lesion demonstrated mixed iso-to-hyperintensity on T1-weighted imaging, with signal drop-out on opposed-phase sequences, and iso-to-hyperintense signal on T2-weighted imaging. The longest diameter measured approximately 1.2 cm. (a) (b) MRI images showing two views of the abdomen. Image (a) is a sagittal view with a yellow arrowhead indicating an area near the liver. Image (b) is an axial view highlighting the same area with a yellow arrowhead, suggesting a point of interest or abnormality. Figure 4 Excision specimen showing cardiac tumor: (a) (b) Two-panel image. Panel a shows several irregular, brown tissue samples on a green grid with measurements. Panel b is a microscopic view of tissue stained pink and purple, indicating cellular structure detail. Discussion The open thoracic biopsy specimen demonstrated characteristic nest-like architecture consistent with histologic features of epithelial-derived neoplasia. Microscopic examination revealed moderate to severe cytologic atypia, including an elevated nuclear-to-cytoplasmic ratio and brisk mitotic activity (15 mitoses per 10 high-power fields at ×200 magnification) in hotspot areas, accompanied by geographic necrosis, meeting the diagnostic criteria for proliferatively active malignant tumors. Immunophenotypic analysis demonstrated positivity for AFP, pan-cytokeratin (CK-pan), and cytokeratin 8/18. Special staining revealed a bile canaliculus-like distribution pattern of carcinoembryonic antigen (CEA), collectively indicative of hepatocellular carcinoma (HCC). Although HepPar-1 and Glypican-3 were negative, the immunoprofile, when interpreted in the context of tumor differentiation, aligns more closely with poorly differentiated hepatocellular carcinoma. Proliferative activity assessment showed a Ki-67 labeling index of 10%. In conjunction with the mitotic count and extent of necrosis, these features indicate a tumor with significant aggressive potential. Among other negative indicators, the expression patterns of cytokeratin 7 and calretinin effectively excluded the two most important differential diagnoses—cholangiocarcinoma and mesothelioma. Sal-like protein 4 (SALL4) may help temporarily exclude germ cell tumors, while other myogenic markers can aid in ruling out various types of sarcomas. By integrating the biopsy specimen, immunohistochemical results, and imaging localization, we identified the primary focus in the liver. Cardiac tumors presentation of cardiac masses varies depending on the size, location of the mass, blocking possibility and relationship to the heart's anatomy. Treatment of cardiac tumors differs based on the pathological type of the tumor and whether there are metastases. The common site of cardiac metastasis is the pericardium followed by the epicardium and myocardium, and the most common origins of metastatic tumors, in descending order, are pleural mesothelioma, melanoma, adenocarcinoma of the lungs, undifferentiated carcinoma, lung carcinoma, breast carcinoma, ovarian carcinoma, lymphoproliferative neoplasms, fine bronchial alveolar cancer, stomach cancer, kidney cancer and pancreatic cancer4. Primary benign/non-metastatic malignant cardiac tumors (excluding rhabdomyomas) require en bloc 4 HCC ranks as the sixth most prevalent cancer worldwide and the fourth leading cause of cancer-related mortality. Cirrhosis from any etiology constitutes the strongest risk factor for HCC, including chronic alcohol abuse, diabetes, hepatitis associated with metabolic liver diseases, and viral hepatitis infections ( 5 6 7 8 Thorough review of the patient's medical history revealed no established HCC risk factors, including chronic alcohol abuse, metabolic disorders (diabetes mellitus/dyslipidemia), or prior HCC diagnosis. Extended virologic workup excluded hepatitis B/C infection. This clinical profile distinctly differs from documented cardiac metastasis cases of HCC, which typically present with established HCC histories and distinct hepatic space-occupying lesions ( 2 3 Hepatic carcinoma predominantly metastasizes via hematogenous spread, followed by lymphatic dissemination. In this case with pericardial involvement, the cardiac anatomical milieu characterized by high-velocity blood flow, dynamic myocardial contractions, and dedicated coronary circulation concurrently maintains a suboptimal microenvironment for tumor cell survival (marked by elevated oxygen tension and deficient pro-growth factors). These combined barriers render hematogenous cardiac metastasis exceptionally challenging. Consequently, lymphatic dissemination or direct extension emerges as more plausible metastatic pathways, despite the cardiac lymphatic system being comparatively underdeveloped ( 6 Based on the current clinical and imaging data, the patient was diagnosed with metastatic HCC to the pericardium. The disease was classified as BCLC stage C, and curative surgical intervention was no longer feasible. Management focused on palliative measures, including systemic therapy, localized radiotherapy, symptomatic control of the pericardial mass, and drainage of pericardial effusion. Following pericardiocentesis and partial resection of the pericardial lesion, the patient began treatment with lenvatinib in combination with camrelizumab. However, subsequent outpatient monitoring revealed a consistent monthly increase in AFP levels. The patient later developed progressive symptoms including dyspnea, abdominal distension, decreased appetite, and peripheral edema. These complications significantly diminished both the patient's and family's confidence in the treatment regimen. The patient succumbed to the disease six months after initial diagnosis. Pericardial metastasis from hepatocellular carcinoma is exceptionally rare. This case not only contributes to the limited data available on such presentations but also documents survival outcomes under standard advanced HCC management involving lenvatinib and camrelizumab. A comparative review with existing literature has been included, offering valuable real-world evidence regarding the clinical course and treatment response in this uncommon metastatic setting. In summary, we report an uncommon case of pericardial metastasis originating from occult hepatocellular carcinoma, which was only detected at the disseminated disease stage. Although surgical intervention offered temporary palliation of symptoms, the disease progressed rapidly, with a timeline from diagnosis to mortality of approximately six months. This is consistent with the poor prognosis typically associated with cardiac metastases from advanced malignancies, as demonstrated in previous cohort studies ( 4 Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Ethics statement Ethical approval was not required for the studies involving humans because Institutional Review Board approval is not required for single-patient cases at the Hubei University of Medicine. Consent was obtained from the patient's next of kin for this report. The studies were conducted in accordance with the local legislation and institutional requirements. The human samples used in this study were acquired from gifted from another research group. Written informed consent to participate in this study was not required from the participants or the participants' legal guardians/next of kin in accordance with the national legislation and the institutional requirements. Written informed consent was obtained from the individual(s) for the publication of any potentially identifiable images or data included in this article. Author contributions BW: Writing – original draft, Writing – review & editing. ZW: Writing – original draft, Writing – review & editing. WL: Writing – original draft. JX: Writing – original draft. CH: Writing – original draft. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fcvm.2025.1643805/full#supplementary-material References 1. Orlandi A Ferlosio A Roselli M Chiariello L Spagnoli LG Cardiac sarcomas: an update J Thorac Oncol 2010 5 9 1483 9 10.1097/JTO.0b013e3181e59a91 20651614 2. Kim SB Shin YC Kwon SU Isolated metastasis of hepatocellular carcinoma in the right ventricle: a case report Medicine 2016 95 51 e5544 10.1097/MD.0000000000005544 28002330 PMC5181814 3. Tamura Y Kawaoka T Aikata H Namba M Fujii Y Morio K Isolated cardiac metastases of hepatocellular carcinoma after resection: a case report Clin J Gastroenterol 2020 13 3 421 7 10.1007/s12328-019-01075-6 31782114 4. Lestuzzi C De Paoli A Baresic T Miolo G Buonadonna A Malignant cardiac tumors: diagnosis and treatment Future Cardiol 2015 11 4 485 500 10.2217/fca.15.10 26235817 5. Brown ZJ Tsilimigras DI Ruff SM Mohseni A Kamel IR Cloyd JM Management of hepatocellular carcinoma: a review JAMA Surg 2023 158 4 410 10.1001/jamasurg.2022.7989 36790767 6. Bussani R De-Giorgio F Abbate A Silvestri F Cardiac metastases J Clin Pathol 2006 60 1 27 34 10.1136/jcp.2005.035105 17098886 PMC1860601 7. Hong SS Kim TK Sung KB Kim PN Ha HK Kim AY Extrahepatic spread of hepatocellular carcinoma: a pictorial review Eur Radio 2003 13 4 874 82 10.1007/s00330-002-1519-7 12664129 8. Llovet JM Kelley RK Villanueva A Singal AG Pikarsky E Roayaie S Hepatocellular carcinoma Nat Rev Dis Primers 2021 7 1 6 10.1038/s41572-020-00240-3 33479224 ",
  "metadata": {
    "Title of this paper": "Hepatocellular carcinoma",
    "Journal it was published in:": "Frontiers in Cardiovascular Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488558/"
  }
}