{
  "title": "Paper_1239",
  "abstract": "pmc Life (Basel) Life (Basel) 2582 life life Life 2075-1729 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471892 PMC12471892.1 12471892 12471892 41010343 10.3390/life15091401 life-15-01401 1 Article Effects of Exercise Snack Program on Quality of Life, Cardiorespiratory Fitness, and Metabolic Flexibility in Elderly Cancer Survivors: A Preliminary Study Zhou Peng Methodology Formal analysis Investigation Writing – original draft 1 Hu Zimei Software Visualization 1 Kim Taesung Methodology Software 2 https://orcid.org/0000-0002-1327-8998 Kim Yonghwan Conceptualization Formal analysis Writing – original draft Visualization Supervision 2 Leng Zhengqing Conceptualization Investigation Writing – original draft Writing – review & editing Supervision 1 * https://orcid.org/0000-0002-1381-1166 Choi Moonyoung Conceptualization Writing – original draft Writing – review & editing Visualization Supervision 3 * Drenjančević Ines Academic Editor 1 20251019@ksu.edu.cn huzimei19891203@ksu.edu.cn 2 tsk1223@gwnu.ac.kr yhkim@gwnu.ac.kr 3 * 19980017@ksu.edu.cn my.choi@daegu.ac.kr 04 9 2025 9 2025 15 9 497651 1401 29 6 2025 18 8 2025 01 9 2025 04 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Cancer has a high mortality rate and leaves physical and mental difficulties even after treatment. When it afflicts frail elderly people, it poses a greater burden to them and society. Regular exercise helps to restore the deteriorated health of cancer survivors. The purpose of this study was to compare the effects of a short-term, high-repetition, home-based “exercise snack” program with those of a traditional, continuous, moderate-intensity exercise format on key health outcomes in elderly cancer survivors, including quality of life, cardiorespiratory fitness, and metabolic flexibility. Methods: A short-duration, high-repetition exercise snack group (ESG, n = 17) and a traditional exercise group (TEG, n = 17) were compared after 12 weeks of training. The effects of exercise on quality of life, cardiorespiratory fitness, metabolic flexibility, and blood lipids were measured. Results: Quality-of-life vitality, social functioning, cardiorespiratory fitness VO 2 p 2 p fitness frail elderly metabolic flexibility training post-cancer This research did not receive any funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cancer is one of the leading causes of death worldwide [ 1 2 3 2 3 In recent decades, age-standardized cancer mortality rates have declined in many high-income and upper-middle-income countries, largely due to improved screening programs, earlier detection, and advances in treatment [ 4 5 6 7 According to a study by Zamani et al., 19.1% of cancer survivors reported symptoms of anxiety, and 31.0% reported symptoms of depression, underscoring the importance of post-treatment psychosocial care [ 8 5 9 10 Experts emphasize the importance of maintaining and restoring physical capacity and functionality after treatment, to improve QoL and mitigate long-term side effects. This necessitates multidisciplinary rehabilitation approaches that involve medical professionals, dietitians, and exercise specialists [ 11 12 13 However, frail elderly people often face additional barriers to engaging in structured exercise programs, including comorbidities, environmental restrictions, and lack of accessibility [ 14 15 16 Recently, various exercise modalities have been proposed to overcome these accessibility issues. Among them, the “exercise snack” model—short bouts of physical activity performed multiple times throughout the day—has gained attention as a time-efficient and scalable approach. This model has been shown to improve cardiorespiratory fitness, muscular function, and metabolic flexibility in diverse populations, including older adults and clinical groups [ 17 18 19 Therefore, this study aimed to compare the effects of an exercise snack program and traditional exercise participation in frail older adults after cancer treatment. QoL, blood lipid profiles, and cardiorespiratory fitness were selected as key indicators, as they reflect both subjective well-being and objective physiological recovery. In particular, cardiorespiratory fitness is a representative marker of physical fitness and a well-established predictor of healthy lifespan, especially in cancer survivors [ 20 21 22 23 The main objective of this study was to compare the effects of a short-term, high-repetition, home-based “exercise snack” program and a traditional, continuous, moderate-intensity exercise format in frail older adults after cancer treatment. The primary outcomes were QoL, cardiorespiratory fitness, and metabolic flexibility, which together reflect both subjective well-being and objective physiological recovery. The subsequent objective was to assess changes in substrate efficiency, defined as the capacity to effectively utilize lipids and carbohydrates during exercise and recovery [ 24 25 26 27 28 2. Materials and Methods 2.1. Participants This study was conducted with elderly men aged 65 years or older who were using a senior welfare facility and met the eligibility criteria relevant to the study objectives. Participants were eligible if they had previously been diagnosed with cancer and were capable of walking and engaging in daily activities independently but demonstrated signs of general frailty. Frailty was assessed based on clinical observation and inclusion criteria, rather than through the use of formal frailty indices. Participants were considered frail if they reported cancer-related fatigue, demonstrated reduced mobility, or had limitations in daily activities. These characteristics are consistent with key domains of widely accepted frailty models, including low physical activity, weakness, and unintentional weight loss [ 29 To ensure that study outcomes could be attributed primarily to exercise interventions rather than to underlying medical conditions or pharmacological influences, rigorous exclusion criteria were applied during recruitment [ 30 31 Sample size was estimated using G*Power software (version 3.1.9.4, University of Düsseldorf, Dusseldorf, Germany). With an effect size of f = 0.25, a power of 0.80, and an alpha level of 0.05, a total of 34 participants were allocated to either the exercise snack group (ESG) or the traditional exercise group (TEG) [ 32 2.2. Quality of Life Assessment QoL was assessed using the 36-Item Short Form Health Survey (SF-36), a widely validated and reliable instrument for measuring health-related QoL in clinical and research settings [ 33 2.3. Cardiorespiratory Fitness and Metabolic Flexibility Cardiorespiratory fitness and metabolic flexibility were assessed using a graded exercise test (GXT), conducted according to the American College of Sports Medicine (ACSM) guidelines with a modified Bruce protocol [ 34 2 2 2 2 35 2.4. Blood Lipid–Cardiovascular Disease Risk Factors To evaluate changes in cardiovascular disease risk, a panel of metabolic biomarkers—total cholesterol (TC), low-density lipoprotein cholesterol (LDL-C), high-density lipoprotein cholesterol (HDL-C), triglycerides (TG), and fasting blood glucose—was assessed at baseline and after the 12-week intervention [ 36 2.5. Exercise Interventions 2.5.1. Exercise Snack Program Participants assigned to the exercise snack group (ESG) performed a time-efficient, distributed physical activity regimen designed to elicit cardiovascular and metabolic benefits while accommodating the functional limitations common among older adults and cancer survivors. The selected protocol aligns with the operational definition of an “exercise snack,” which refers to short bouts of moderate-to-vigorous-intensity activity performed multiple times per day, allowing for accumulated physiological benefits without requiring long continuous sessions. This approach has been proposed as an effective and feasible strategy for improving health outcomes in populations with low exercise tolerance or limited time availability [ 17 Figure 1 37 38 39 2.5.2. Traditional Exercise Program Participants assigned to the traditional exercise group (TEG) engaged in a structured aerobic training program designed to reflect the American College of Sports Medicine’s recommendations for cancer survivors and older adults [ 39 2.5.3. Comparison of Exercise Protocols Although both exercise protocols were developed in accordance with the ACSM guidelines for cancer survivors and older adults [ 34 2.6. Data Analysis Statistical analysis was performed using SPSS version 25.0 (IBM Corp., Armonk, NY, USA). A Shapiro-Wilk test was used to test for normality, and this study followed the parametric method. To compare TEG and ESG, continuous variables were tested using an independent t p 3. Results 3.1. General Characteristics General characteristics were compared between groups ( Table 1 3.2. Quality of Life Change Following the 12-week intervention, both ESG and TEG demonstrated significant improvements across multiple domains of the SF-36 ( Figure 2 p p p 3.3. Cardiorespiratory Fitness Following the 12-week intervention, both ESG and TEG exhibited significant improvements in VO 2 p Figure 3 2 p p 3.4. Metabolic Flexibility Figure 4 2 p p 3.5. Cardiovascular Disease Risk Factors Following the 12-week intervention, both ESG and TEG demonstrated significant within-group reductions in TG and fasting glucose levels ( p Table 2 p p p 4. Discussion This study compared the effects of two distinct aerobic training modalities, a distributed “exercise snack” protocol and a traditional continuous format, both applied in frail older adults following cancer treatment. These interventions were designed to differ in structure and delivery setting, allowing an examination of how variations in frequency, intensity, and session duration influence outcomes related to quality of life, aerobic capacity, and metabolic function. While both programs led to positive changes, the observed improvements varied across outcome domains. These differences likely reflect the specific physiological and behavioral demands of each intervention. The exercise snack protocol, characterized by brief, high-frequency sessions performed at home, appeared to be more effective in enhancing perceived vitality and mental well-being. In contrast, the traditional format, which involved longer supervised sessions, resulted in greater gains in cardiorespiratory fitness. These findings are consistent with previous research suggesting that the structure and accessibility of exercise programs are important determinants of health outcomes in older populations with functional limitations [ 19 Building on these general findings, the observed changes in cardiovascular disease risk markers warrant closer examination. Both groups exhibited significant reductions in fasting triglyceride and glucose levels following the 12-week intervention; however, the pattern and magnitude of these changes differed depending on the exercise modality. Participants in TEG demonstrated a significantly greater reduction in triglyceride levels compared to those in ESG. This finding aligns with prior evidence suggesting that continuous, moderate-intensity aerobic exercise enhances skeletal muscle lipoprotein lipase (LPL) activity, thereby facilitating triglyceride clearance via increased fatty acid uptake and oxidation [ 40 41 42 Both groups also demonstrated significant reductions in fasting glucose levels, though no between-group differences were detected. This suggests that total aerobic workload, rather than the specific distribution of sessions, may be the predominant driver of glycemic improvement. Aerobic exercise enhances glucose uptake in skeletal muscle through insulin-independent mechanisms, particularly via AMP-activated protein kinase (AMPK) activation and GLUT4 translocation [ 43 44 Changes in health-related QoL following the intervention revealed significant and broad-based improvements across both physical and mental health domains. In line with prior findings that link regular aerobic activity to enhanced functional status and symptom management in cancer survivors [ 45 46 47 48 49 50 The behavioral science literature suggests that repeated exposure to self-paced, achievable tasks can reinforce intrinsic motivation and emotional engagement, aligning with the core tenets of Self-Determination Theory, particularly autonomy and competence support [ 49 50 Changes in cardiovascular fitness following the 12-week intervention revealed notable improvements in aerobic capacity across both exercise groups. Significant increases in VO 2 2 51 52 2 53 54 2 53 2 54 Exercise duration during testing also increased significantly in both groups, indicating enhanced endurance performance. However, no between-group differences were observed, suggesting that improvements in time to exhaustion may be attributable to the overall cumulative aerobic stimulus rather than the specific structure or intensity distribution of the sessions. Although ESG and TEG differed in training format, the total weekly time spent performing purposeful aerobic exercise was of a similar order of magnitude, potentially providing a sufficient cumulative stimulus to produce comparable endurance gains in both groups. In contrast, no significant changes were observed in AT values in either group. This finding is consistent with previous evidence indicating that moderate-intensity aerobic training, particularly when performed at or below the AT, induces minimal adaptations in submaximal metabolic thresholds [ 55 55 2 The 1 min heart rate recovery measures the heart’s recovery rate, and a rapid return to resting after exercise is interpreted positively [ 56 57 RER represents the ratio of carbohydrate to fat burned according to exercise intensity. Typically, RER ranges from 0.7 to 1.0. The low-intensity range, where fat is burned most, is 0.7, while the high-intensity range, where carbohydrates are burned most, is 1.0. A positive change in RER as a result of training is a decrease in RER during exercise of the same intensity, indicating an increase in the ratio of fat burned to carbohydrates [ 26 From this perspective, changes in substrate oxidation patterns observed during graded exercise testing provide evidence of favorable adaptations in skeletal muscle metabolic flexibility following the 12-week intervention. Both ESG and TEG exhibited increased fat oxidation and reduced carbohydrate reliance during low-to-moderate-intensity exercise (20% and 40% VO 2 35 58 Between-group comparisons revealed that TEG elicited significantly greater absolute fat oxidation at 40–60% VO 2 2 59 60 61 Although this study was conducted on elderly cancer survivors, it has the following limitations. Although nutrition and habitual physical activity are important factors influencing the health outcomes of older adults and cancer survivors, these variables were not systematically measured in the present study. This omission was primarily due to resource limitations and the need to minimize participant burden in a frail population. While general dietary guidance was provided as part of routine care, individualized nutritional intake and daily physical activity outside of the intervention could not be quantified, which may have introduced residual confounding. Future research should incorporate comprehensive dietary assessment and objective physical activity monitoring to improve the accuracy of interpreting exercise intervention effects. The disease history and health status of the elderly are very diverse, and since measurements took place at a single institution, the results of this study may not be consistent with those in other environments and conditions; moreover, the researchers’ bias may be involved due to the convenience sampling method, and the representativeness of the data is limited. In addition, there was a significant difference between groups in the mean years since completion of cancer treatment. While this factor could potentially influence recovery trajectories in cancer survivors, all participants met the same eligibility criteria for functional status and readiness for exercise at baseline, which may have limited its impact on the observed outcomes. Nonetheless, future studies should consider stratifying participants or statistically adjusting for this variable to ensure more precise interpretation of intervention effects. Furthermore, although the SF-36 includes domains related to social functioning, this study did not incorporate direct measures of social context or interpersonal connectedness. Given the home-based nature of the intervention, the lack of formal assessment in this area limits our ability to fully interpret improvements in psychosocial outcomes. Future studies should consider integrating validated tools to capture social interaction and support networks more precisely. As only elderly men were included, future research on elderly women, a group that is likely to be excluded from health services, will be necessary. 5. Conclusions This study compared the effects of an exercise snack protocol and a traditional continuous aerobic training model on cardiorespiratory fitness, metabolic flexibility, and health-related QoL in older adults following digestive cancer treatment. Both interventions produced meaningful improvements in aerobic capacity, substrate oxidation efficiency, and QoL outcomes, indicating that structured aerobic exercise can serve as a beneficial component of survivorship care in this population. Importantly, the exercise snack protocol elicited greater improvements in VO 2 Disclaimer/Publisher’s Note: Author Contributions This study was conducted by three researchers: conceptualization, M.C. and Z.L.; methodology, P.Z., T.K. and Y.K.; formal analysis, P.Z. and Y.K.; visualization, Z.H., Y.K. and M.C.; software, Z.H., Y.K. and Z.L.; investigation, P.Z. and Z.L.; writing—original draft preparation, P.Z., M.C. and Z.L.; writing—review and editing, Y.K., M.C. and Z.L.; supervision, Y.K., M.C. and Z.L. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was approved by the Institutional Ethics Committee of Gangneung-Wonju National University (approval number: R202506, approval date: 25 February 2025). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The data presented in this study are available on reasonable request from the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References 1. Huang J. Ngai C.H. Deng Y. Tin M.S. Lok V. Zhang L. Yuan J. Xu W. Zheng Z.-J. Wong M.C. Cancer incidence and mortality in Asian countries: A trend analysis Cancer Control 2022 29 10732748221095955 10.1177/10732748221095955 35770775 PMC9252010 2. Bray F. Laversanne M. Sung H. Ferlay J. Siegel R.L. Soerjomataram I. Jemal A. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 3. Cao W. Qin K. Li F. Chen W. Comparative study of cancer profiles between 2020 and 2022 using global cancer statistics (GLOBOCAN) J. Natl. Cancer Cent. 2024 4 128 134 10.1016/j.jncc.2024.05.001 39282581 PMC11390618 4. Lortet-Tieulent J. Georges D. Bray F. Vaccarella S. Profiling global cancer incidence and mortality by socioeconomic development Int. J. Cancer 2020 147 3029 3036 10.1002/ijc.33114 32449164 5. Tran T.X.M. Jung S.-Y. Lee E.-G. Cho H. Kim N.Y. Shim S. Kim H.Y. Kang D. Cho J. Lee E. Fear of cancer recurrence and its negative impact on health-related quality of life in long-term breast cancer survivors Cancer Res. Treat. Off. J. Korean Cancer Assoc. 2022 54 1065 1073 10.4143/crt.2021.835 PMC9582487 34883553 6. Wang F.H. Zhang X.T. Li Y.F. Tang L. Qu X.J. Ying J.E. Zhang J. Sun L.Y. Lin R.B. Qiu H. The Chinese Society of Clinical Oncology (CSCO): Clinical guidelines for the diagnosis and treatment of gastric cancer, 2021 Cancer Commun. 2021 41 747 795 10.1002/cac2.12193 PMC8360643 34197702 7. Choi J. Kim S. Choi M. Hyung W.J. Factors affecting the quality of life of gastric cancer survivors Support. Care Cancer 2022 30 3215 3224 10.1007/s00520-021-06683-y 34973098 PMC8857153 8. Zamani M. Alizadeh-Tabari S. Anxiety and depression prevalence in digestive cancers: A systematic review and meta-analysis BMJ Support. Palliat. Care 2023 13 e235 e243 10.1136/bmjspcare-2021-003275 34417285 9. Juez L.D. Priego P. Bajawi M. Cuadrado M. Blázquez L.A. Sánchez-Picot S. Galindo J. Blázquez J. Fernández-Cebrián J.M. Botella-Carretero J.I. Impact of sarcopenic obesity on long-term cancer outcomes and postoperative complications after gastrectomy for gastric cancer J. Gastrointest. Surg. 2023 27 35 46 10.1007/s11605-022-05492-w 36324039 10. Zalina A. Lee V. Kandiah M. Relationship between nutritional status, physical activity and quality of life among gastrointestinal cancer survivors Malays. J. Nutr. 2012 18 255 264 24575671 11. Komori K. Abiko F. Ichikawa T. Ando K. Shigeeda R. Yamaguchi T. Kurusu K. Arai M. Misawa K. Ando S. Impact of Perioperative Rehabilitation on Postoperative Length of Hospital Stay for Patients with Gastric Cancer Anticancer Res. 2025 45 817 822 10.21873/anticanres.17470 39890179 12. Bausys A. Luksta M. Anglickiene G. Maneikiene V.V. Kryzauskas M. Rybakovas A. Dulskas A. Kuliavas J. Stratilatovas E. Macijauskiene L. Effect of home-based prehabilitation on postoperative complications after surgery for gastric cancer: Randomized clinical trial Br. J. Surg. 2023 110 1800 1807 10.1093/bjs/znad312 37750588 13. Kim I. Lim J.Y. Kim J.K. Lee J.H. Sohn T.S. Park S. Kang S.H. Lee J.Y. Hwang J.H. Effectiveness of a personalized digital exercise and nutrition-based rehab program for patients with gastric cancer after surgery: Study protocol for a randomized controlled trial Digit. Health 2023 9 20552076231187602 10.1177/20552076231187602 37485329 PMC10357057 14. Lee L. Heckman G. Molnar F.J. Frailty: Identifying elderly patients at high risk of poor outcomes Can. Fam. Physician 2015 61 227 231 25767167 PMC4369632 15. Shaikh A.A. Dandekar S.P. Perceived benefits and barriers to exercise among physically active and non-active elderly people Disabil. CBR Incl. Dev. 2019 30 73 83 10.5463/dcid.v30i2.839 16. Ascondo J. Martín-López A. Iturricastillo A. Granados C. Garate I. Romaratezabala E. Martínez-Aldama I. Romero S. Yanci J. Analysis of the barriers and motives for practicing physical activity and sport for people with a disability: Differences according to gender and type of disability Int. J. Environ. Res. Public Health 2023 20 1320 10.3390/ijerph20021320 36674077 PMC9858731 17. Islam H. Gibala M.J. Little J.P. Exercise snacks: A novel strategy to improve cardiometabolic health Exerc. Sport Sci. Rev. 2022 50 31 37 10.1249/JES.0000000000000275 34669625 18. Weston K.L. Little J.P. Weston M. McCreary S. Kitchin V. Gill A. Niven A. McNarry M.A. Mackintosh K.A. Application of exercise snacks across youth, adult and clinical populations: A scoping review Sports Med. Open 2025 11 27 45 10.1186/s40798-025-00829-6 40102333 PMC11920532 19. Fyfe J.J. Dalla Via J. Jansons P. Scott D. Daly R.M. Feasibility and acceptability of a remotely delivered, home-based, pragmatic resistance ‘exercise snacking’intervention in community-dwelling older adults: A pilot randomised controlled trial BMC Geriatr. 2022 22 521 10.1186/s12877-022-03207-z 35751032 PMC9233333 20. Fardman A. Banschick G.D. Rabia R. Percik R. Fourey D. Segev S. Klempfner R. Grossman E. Maor E. Cardiorespiratory fitness and survival following cancer diagnosis Eur. J. Prev. Cardiol. 2021 28 1242 1249 10.1177/2047487320930873 34551084 21. Ezzatvar Y. Ramírez-Vélez R. Saez de Asteasu M.L. Martínez-Velilla N. Zambom-Ferraresi F. Lobelo F. Izquierdo M. García-Hermoso A. Cardiorespiratory fitness and all-cause mortality in adults diagnosed with cancer systematic review and meta-analysis Scand. J. Med. Sci. Sports 2021 31 1745 1752 10.1111/sms.13980 33909308 22. Kim D.Y. Kim J.H. Park S.W. Aerobic capacity correlates with health-related quality of life after breast cancer surgery Eur. J. Cancer Care 2019 28 e13050 e13061 10.1111/ecc.13050 30993802 23. Mambrini S. Grillo A. Colosimo S. Zarpellon F. Pozzi G. Furlan D. Amodeo G. Bertoli S. Diet and physical exercise as key players to tackle MASLD through improvement of insulin resistance and metabolic flexibility Front Nutr. 2024 11 1426551 10.3389/fnut.2024.1426551 39229589 PMC11370663 24. Muscella A. Stefàno E. Lunetti P. Capobianco L. Marsigliante S. The regulation of fat metabolism during aerobic exercise Biomolecules 2020 10 1699 10.3390/biom10121699 33371437 PMC7767423 25. Curtis A.R. Livingstone K.M. Daly R.M. Brayner B. Abbott G. Kiss N. Dietary patterns, malnutrition, muscle loss and sarcopenia in cancer survivors: Findings from the UK Biobank J. Cancer Surviv. 2024 18 1889 1902 10.1007/s11764-023-01428-8 37468793 PMC11502595 26. Ribas G.S. Vargas C.R. Evidence that oxidative disbalance and mitochondrial dysfunction are involved in the pathophysiology of fatty acid oxidation disorders Cell. Mol. Neurobiol. 2022 42 521 532 10.1007/s10571-020-00955-7 32876899 PMC11441193 27. Shoemaker M.E. Gillen Z.M. Fukuda D.H. Cramer J.T. Metabolic flexibility and inflexibility: Pathology underlying metabolism dysfunction J. Clin. Med. 2023 12 4453 10.3390/jcm12134453 37445488 PMC10342527 28. Lundby C. Jacobs R.A. Adaptations of skeletal muscle mitochondria to exercise training Exp. Physiol. 2016 101 17 22 10.1113/EP085319 26440213 29. Handforth C. Clegg A. Young C. Simpkins S. Seymour M. Selby P. Young J. The prevalence and outcomes of frailty in older cancer patients: A systematic review Ann. Oncol. 2015 26 1091 1101 10.1093/annonc/mdu540 25403592 30. Canzone A. Roggio F. Patti A. Giustino V. Mannucci C. Di Mauro D. Musumeci G. Bianco A. Trimarchi F. Classification of physical activity programs based on the Kellgren & Lawrence Scale for knee osteoarthritis: A systematic review Musculoskelet. Care 2024 22 e70019 e70031 10.1002/msc.70019 39592397 PMC11598803 31. Franklin B.A. Thompson P.D. Al-Zaiti S.S. Albert C.M. Hivert M.-F. Levine B.D. Lobelo F. Madan K. Sharrief A.Z. Eijsvogels T.M. Exercise-related acute cardiovascular events and potential deleterious adaptations following long-term exercise training: Placing the risks into perspective–an update: A scientific statement from the American Heart Association Circulation 2020 141 e705 e736 10.1161/CIR.0000000000000749 32100573 32. Kang H. Sample size determination for repeated measures design using G Power software Anesth. Pain Med. 2015 10 6 15 10.17085/apm.2015.10.1.6 33. Kim S.H. Jo M.-W. Lee S.-I. Psychometric properties of the Korean short form-36 health survey version 2 for assessing the general population Asian Nurs. Res. 2013 7 61 66 10.1016/j.anr.2013.03.001 25029923 34. Bayles M.P. ACSM’s Exercise Testing and Prescription Lippincott Williams & Wilkins Philadelphia, PA, USA 2023 35. Yang W.-H. Park J.-H. Park S.-Y. Park Y. Energetic contributions including gender differences and metabolic flexibility in the general population and athletes Metabolites 2022 12 965 10.3390/metabo12100965 36295868 PMC9612238 36. Sacks D.B. Arnold M. Bakris G.L. Bruns D.E. Horvath A.R. Lernmark Å. Metzger B.E. Nathan D.M. Kirkman M.S. Guidelines and recommendations for laboratory analysis in the diagnosis and management of diabetes mellitus Clin. Chem. 2023 69 808 868 10.1093/clinchem/hvad080 37473453 PMC12376302 37. Hurst C. Weston K.L. Weston M. The effect of 12 weeks of combined upper-and lower-body high-intensity interval training on muscular and cardiorespiratory fitness in older adults Aging Clin. Exp. Res. 2019 31 661 671 10.1007/s40520-018-1015-9 30051418 PMC6491660 38. Aguiar E.J. Mora-Gonzalez J. Ducharme S.W. Moore C.C. Gould Z.R. Chase C.J. Amalbert-Birriel M.A. Chipkin S.R. Staudenmayer J. Zheng P. Cadence-based classification of moderate-intensity overground walking in 41- to 85-year-old adults Scand. J. Med. Sci. Sports 2023 33 433 443 10.1111/sms.14274 36403207 39. Liguori G. ACSM’s Guidelines for Exercise Testing and Prescription Lippincott Williams & Wilkins Philadelphia, PA, USA 2020 40. Liu X. Zhang Y. Han B. Li L. Li Y. Ma Y. Kang S. Li Q. Kong L. Huang K. Postprandial exercise regulates tissue-specific triglyceride uptake through angiopoietin-like proteins JCI Insight 2024 9 e181553 e181567 10.1172/jci.insight.181553 39171527 PMC11343597 41. Brouwers B. Hesselink M.K. Schrauwen P. Schrauwen-Hinderling V.B. Effects of exercise training on intrahepatic lipid content in humans Diabetologia 2016 59 2068 2079 10.1007/s00125-016-4037-x 27393135 PMC5016557 42. Franczyk B. Gluba-Brzózka A. Ciałkowska-Rysz A. Ławiński J. Rysz J. The impact of aerobic exercise on HDL quantity and quality: A narrative review Int. J. Mol. Sci. 2023 24 4653 10.3390/ijms24054653 36902082 PMC10003711 43. Sylow L. Kleinert M. Richter E.A. Jensen T.E. Exercise-stimulated glucose uptake—Regulation and implications for glycaemic control Nat. Rev. Endocrinol. 2017 13 133 148 10.1038/nrendo.2016.162 27739515 44. Smart N.A. Downes D. Van Der Touw T. Hada S. Dieberg G. Pearson M.J. Wolden M. King N. Goodman S.P. The effect of exercise training on blood lipids: A systematic review and meta-analysis Sports Med. 2024 55 1 12 10.1007/s40279-024-02115-z 39331324 PMC11787149 45. Chen X. Li J. Chen C. Zhang Y. Zhang S. Zhang Y. Zhou L. Hu X. Effects of exercise interventions on cancer-related fatigue and quality of life among cancer patients: A meta-analysis BMC Nurs. 2023 22 200 10.1186/s12912-023-01363-0 37312185 PMC10261838 46. Martínez-Vizcaíno V. Cavero-Redondo I. Reina-Gutiérrez S. Gracia-Marco L. Gil-Cosano J.J. Bizzozero-Peroni B. Rodriguez-Artalejo F. Ubago-Guisado E. Comparative effects of different types of exercise on health-related quality of life during and after active cancer treatment: A systematic review and network meta-analysis J. Sport Health Sci. 2023 12 726 738 10.1016/j.jshs.2023.01.002 36736726 PMC10658325 47. Basso J.C. Suzuki W.A. The effects of acute exercise on mood, cognition, neurophysiology, and neurochemical pathways: A review Brain Plast. 2016 2 127 152 10.3233/BPL-160040 PMC5928534 29765853 48. Yao L. Fang H. Leng W. Li J. Chang J. Effect of aerobic exercise on mental health in older adults: A meta-analysis of randomized controlled trials Front. Psychiatry 2021 12 748257 748266 10.3389/fpsyt.2021.748257 34867538 PMC8634786 49. Ryan R.M. Deci E.L. Self-Determination Theory: Basic Psychological Needs in Motivation, Development, and Wellness Guilford Publications New York, NY, USA 2017 50. Beauchamp M.R. Crawford K.L. Jackson B. Social cognitive theory and physical activity: Mechanisms of behavior change, critique, and legacy Psychol. Sport Exerc. 2019 42 110 117 10.1016/j.psychsport.2018.11.009 51. Grabenbauer A. Grabenbauer A.J. Lengenfelder R. Grabenbauer G.G. Distel L.V. Feasibility of a 12-month-exercise intervention during and after radiation and chemotherapy in cancer patients: Impact on quality of life, peak oxygen consumption, and body composition Radiat. Oncol. 2016 11 42 10.1186/s13014-016-0619-5 26984513 PMC4793737 52. Squires R.W. Shultz A.M. Herrmann J. Exercise training and cardiovascular health in cancer patients Curr. Oncol. Rep. 2018 20 27 10.1007/s11912-018-0681-2 29525828 53. Jenkins E.M. Nairn L.N. Skelly L.E. Little J.P. Gibala M.J. Do stair climbing exercise “snacks” improve cardiorespiratory fitness? Appl. Physiol. Nutr. Metab. 2019 44 681 684 10.1139/apnm-2018-0675 30649897 54. Yin M. Deng S. Chen Z. Zhang B. Zheng H. Bai M. Li H. Zhang X. Deng J. Liu Q. Exercise snacks are a time-efficient alternative to moderate-intensity continuous training for improving cardiorespiratory fitness but not maximal fat oxidation in inactive adults: A randomized controlled trial Appl. Physiol. Nutr. Metab. 2024 49 920 932 10.1139/apnm-2023-0593 38569204 55. Goncalves C. Raimundo A. Abreu A. Bravo J. Exercise intensity in patients with cardiovascular diseases: Systematic review with meta-analysis Int. J. Environ. Res. Public Health 2021 18 3574 10.3390/ijerph18073574 33808248 PMC8037098 56. Giallauria F. Lorenzo A.D. Pilerci F. Manakos A. Lucci R. Psaroudaki M. D’Agostino M. Forno D.D. Vigorito C. Long-term effects of cardiac rehabilitation on end-exercise heart rate recovery after myocardial infarction Eur. J. Cardiovasc. Prev. Rehabil. 2006 13 544 550 10.1097/01.hjr.0000216547.07432.fb 16874143 57. Zeng C.-M. Zhao Y.-M. Li Y.-Y. Gan R.-R. Ling Z. Li P. The effects of rate pressure product at admission on cardiopulmonary function during hospitalization in patients with acute myocardial infarction Postgrad. Med. 2023 135 803 808 10.1080/00325481.2023.2274306 37864567 58. San-Millán I. Brooks G.A. Assessment of metabolic flexibility by means of measuring blood lactate, fat, and carbohydrate oxidation responses to exercise in professional endurance athletes and less-fit individuals Sports Med. 2018 48 467 479 10.1007/s40279-017-0751-x 28623613 59. Purdom T. Kravitz L. Dokladny K. Mermier C. Understanding the factors that effect maximal fat oxidation J. Int. Soc. Sports Nutr. 2018 15 3 13 10.1186/s12970-018-0207-1 29344008 PMC5766985 60. Spriet L.L. New insights into the interaction of carbohydrate and fat metabolism during exercise Sports Med. 2014 44 87 96 10.1007/s40279-014-0154-1 24791920 PMC4008806 61. Warren A. Howden E.J. Williams A.D. Fell J.W. Johnson N.A. Postexercise fat oxidation: Effect of exercise duration, intensity, and modality Int. J. Sport Nutr. Exerc. Metab. 2009 19 607 623 10.1123/ijsnem.19.6.607 20175430 Figure 1 Structure and schedule of the exercise snack protocol. Figure 2 Comparison of changes in quality of life based on exercise groups (TEG, n = 17; ESG, n = 17). p A-1 A-2 A-3 A-4 B-1 B-2 B-3 B-4 Figure 3 Comparison of changes in graded exercise test results based on exercise (TEG, n = 17; ESG, n = 17). p 1 2 3 4 5 6 Figure 4 Fat and carbohydrate metabolism based on VO 2 p 1 2 life-15-01401-t001_Table 1 Table 1 Sociodemographic characteristics of participants (TEG, n = 17; ESG, n = 17). Variables TEG ESG t 2 Effect Size p Age, years 69.3 ± 3.2 68.5 ± 3.1 0.762 0.253 0.452 Height, cm 165.6 ± 6.7 165.0 ± 6.1 0.275 0.009 0.785 Weight, kg 69.2 ± 8.1 67.6 ± 6.9 0.611 0.212 0.545 Body mass index, kg/m 2 25.2 ± 2.2 24.8 ± 2.8 0.269 0.595 0.267 Resting systolic BP, mmHg 121.3 ± 4.1 122.1 ± 4.3 1.324 0.285 0.687 Resting diastolic BP, mmHg 80.6 ± 5.0 81.3 ± 3.2 −0.278 0.166 0.781 Resting heart rate, beat 64.7 ± 3.9 66.9 ± 3.7 −0.496 0.578 0.620 Post-cancer, year 4.5 ± 2.5 6.8 ± 3.9 −2.120 0.726 0.042 Exercise adherence, % 94.1 ± 3.2 92.6 ± 3.0 0.348 0.483 0.385 Recurrence or metastasis, n      No 13 (76.5%) 15 (88.2%) 0.810 0.154 0.656 Yes 4 (23.5%) 2 (11.8%) Education, n      to middle 11 (64.7%) 12 (70.6%) 0.186 0.074 0.911 to high 4 (23.5%) 3 (17.6%) above college 2 (11.8%) 2 (11.8%) Occupation, n      No 11 (64.7%) 13 (76.5%) 0.567 0.452 0.708 Yes 6 (35.3%) 4 (23.5%) p life-15-01401-t002_Table 2 Table 2 Lipid risk factor of cardiovascular disease (TEG, n = 17; ESG, n = 17). Variables Group Pre Post Df Pre-Post p p TC, mg/dL TEG 169.2 ± 10.3 153.9 ± 18.8 −9.0 0.332 G: 0.303, T: 0.067 ESG 157.9 ± 18.8 152.4 ± 17.7 −3.5 0.425 HDLC, mg/dL TEG 42.6 ± 9.7 44.6 ± 8.4 4.7 0.213 G: 0.011, T: 0.006 ESG 43.1 ± 4.7 49.9 ± 5.9 15.8 <0.001 LDLC, mg/dL TEG 133.6 ± 29.1 125.6 ± 27.3 −6.1 0.180 G: 0.653, T: 0.201 ESG 130.9 ± 21.1 123.1 ± 64.8 −6.0 0.241 TG, mg/dL TEG 168.6 ± 19.6 136.6 ± 16.7 −19.0 0.003 G: 0.05, T: <0.001 ESG 164.4 ± 13.5 147.3 ± 10.6 −10.4 0.018 Glucose, mg/dL TEG 121.9 ± 18.8 110.3 ± 16.6 −9.5 <0.001 G: 0.621, T: 0.013 ESG 125.6± 16.2 109.1 ± 11.1 −13.1 0.004 p ",
  "metadata": {
    "Title of this paper": "Postexercise fat oxidation: Effect of exercise duration, intensity, and modality",
    "Journal it was published in:": "Life",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471892/"
  }
}