{
  "title": "Paper_348",
  "abstract": "pmc J Biol Eng J Biol Eng 565 jbioleng Journal of Biological Engineering 1754-1611 BMC PMC12487495 PMC12487495.1 12487495 12487495 41029699 10.1186/s13036-025-00554-4 554 1 Research Systemic versus local delivery of mesenchymal stem cells to improve the early stages of fracture healing in a polytrauma model https://orcid.org/0000-0002-1955-8667 Saiz Augustine Mark amsaiz@health.ucdavis.edu 1 Rahmati Maryam 1 2 Johnson Soren David 1 Bhat Aneesh Satish 1 Baldini Tony Daniel 1 Øvrebø Øystein 2 Nogueira Liebert Parreiras 2 3 Khassawna Thaqif El 4 5 Stötzel Sabine 4 Fierro Fernando A. 6 7 Lee Mark A. 1 Leach J. Kent 1 Haugen Håvard Jostein 2 1 https://ror.org/05q8kyc69 grid.416958.7 0000 0004 0413 7653 Department of Orthopaedic Surgery, UC Davis Health, 2 https://ror.org/01xtthb56 grid.5510.1 0000 0004 1936 8921 Department of Biomaterials, Institute of Clinical Dentistry, University of Oslo, 3 https://ror.org/01xtthb56 grid.5510.1 0000 0004 1936 8921 Oral Research Laboratory, Institute of Clinical Dentistry, University of Oslo, 4 https://ror.org/033eqas34 grid.8664.c 0000 0001 2165 8627 Experimental Trauma Surgery, Justus-Liebig University Giessen, 5 https://ror.org/05k89ew48 grid.9670.8 0000 0001 2174 4509 Faculty of Pharmacy, University of Jordan, 6 https://ror.org/05rrcem69 grid.27860.3b 0000 0004 1936 9684 Institute for Regenerative Cures, University of California Davis, 7 https://ror.org/05rrcem69 grid.27860.3b 0000 0004 1936 9684 Department of Cell Biology and Human Anatomy, University of California Davis, 30 9 2025 2025 19 478384 82 18 6 2025 27 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Fracture healing complications, including nonunion, are common in polytrauma patients partly due to systemic inflammatory dysregulation. Although mesenchymal stem cells (MSCs) have been widely explored for their regenerative properties, their therapeutic potential in polytrauma patients remains uncertain. Given the clinical interest in both systemic and localized stem cell therapies, understanding how delivery route influences MSCs biodistribution, inflammatory modulation, and therapeutic efficacy is critical for optimizing treatment strategies in polytrauma. Hence, we compared systemic versus local MSCs delivery in a polytrauma model. We evaluated inflammatory responses and bone formation in a C57BL/6J murine model across four groups: (1) isolated fracture, (2) polytrauma (femur fracture + chest trauma), (3) polytrauma + systemic MSC delivery, and (4) polytrauma + local MSC delivery in hyaluronic acid-based hydrogels at the fracture site. Polytrauma induced a prolonged inflammatory response characterized by elevated interleukin 1 alpha and beta (IL-1α & β), tumor necrosis factor-alpha (TNF-α), interferon-gamma (IFN-γ), and monocyte chemoattractant protein-1 and − 5 (MCP-1 & MCP-5). Both delivery methods significantly reduced inflammation and proinflammatory cytokines, though local delivery yielded more consistent effects. IVIS imaging confirmed MSC retention at the fracture site in the local delivery group, while systemic administration of MSCs resulted in pulmonary entrapment. Although systemic MSCs failed to enhance fracture healing significantly, local MSC delivery promoted bone formation evidenced by CT and histological characterizations. These findings demonstrate that local MSC delivery in a hydrogel scaffold represents a superior strategy for improving fracture healing in polytrauma patients compared to systemic delivery. Supplementary Information The online version contains supplementary material available at 10.1186/s13036-025-00554-4. Keywords Inflammation Polytrauma Bone fracture Mesenchymal stem cell Hydrogel AO Trauma North America Department of Orthopaedic Surgery, UC Davis National Institute of Arthritis And Musculoskeletal And Skin Diseases of the National Institutes of Health K08AR084594 Saiz Augustine Mark https://doi.org/10.13039/100013769 Orthopaedic Trauma Association 4122 Saiz Augustine Mark https://doi.org/10.13039/501100005416 Norges Forskningsråd 331752 331752 Øvrebø Øystein Haugen Håvard Jostein National Institutes of Health R01 AR079211 Leach J. Kent pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Effective fracture healing is essential for restoring skeletal integrity and function [ 1 2 1 2 3 4 2 4 2 4 2 2 2 Despite surgical advancements, few therapies effectively manage fracture healing in polytrauma patients. While current biologic materials, such as bone morphogenetic proteins (BMPs) on collagen sponges or demineralized-based matrix (DBM)-based products, are primarily utilized in nonunion repair, these strategies are not designed to address the systemic immune dysregulation observed in polytrauma. This limitation reduces their effectiveness in acute multisystem injury settings, where a prolonged inflammatory response can impede bone healing. For instance, studies have indicated that BMP-2 delivered via collagen sponges may correlate with systemic immune dysregulation, highlighting the need for systems that can modulate inflammatory responses and promote osteogenesis [ 15 Mesenchymal stem cells (MSCs) have emerged as a promising therapeutic approach for modulating inflammation and promoting tissue regeneration [ 5 6 5 6 7 8 8 9 10 11 12 13 In this study, we employed a polytrauma model involving femur fracture and chest trauma to (1) compare the inflammatory response in polytrauma versus isolated fracture, and (2) evaluate the effects of local versus systemic MSC delivery on fracture healing, particularly using HA-based hydrogels to enhance local retention and therapeutic impact. We hypothesized that the direct implantation of MSCs encapsulated in an HA-based hydrogel at the fracture gap circumvents pulmonary sequestration and restores callus formation, mineralization, and mechanical strength to levels achieved in isolated-fracture controls. By elucidating the inflammatory mechanisms underlying polytrauma-induced fracture healing impairment and assessing the efficacy of different MSC delivery methods, this study aims to inform therapeutic strategies for improving outcomes in patients with complex injuries. Materials and methods In vitro assays Cell culture Mouse bone marrow-derived MSCs (AcceGen, Fairfield, NJ) were expanded on tissue culture plastic in growth media (GM) composed of alpha-MEM supplemented with 10% fetal bovine serum (GenClone, Genesee Scientific, San Diego, CA) and 1% penicillin-streptomycin (Gemini Bio Products, West Sacramento, CA), under standard conditions. For osteogenic differentiation, GM was supplemented with 0.01 µM dexamethasone, 50 µg/mL L-ascorbic acid 2-phosphate, and 10 mM sodium β-glycerophosphate. Osteogenic medium was refreshed every 48 h. MSCs were used at passage 5 and seeded at 25,000 cells per well in 24-well plates ( N Hydrogel synthesis HA hydrogels were synthesized using pharmaceutical-grade 3 MDa hyaluronic acid (H.T.L. SAS Javené, France), crosslinked with 1.6% v/v 1.4-butanediol diglycidyl ether (BDDE, Merck KGaA, Darmstadt, Germany) along with anhydrous sodium hydroxide and sodium chloride (Merck KGaA, Darmstadt, Germany). A 10 w/v% hyaluronic acid (HA) solution was prepared in 0.3 M NaOH under manual stirring. Subsequently, 1.6 v/v% BDDE, and the mixture was maintained at 40 °C for 4 h in a closed vessel. The resulting gel was placed in a cellulose membrane (molecular weight cutoff = 14 kDa) and dialyzed against water for injection (B.Braun, Melsungen AG, Melsungen, Germany) for 18 h. The gel was granulated by passing it through a 130 μm mesh after dialysis. Water for injection and 10 wt% sodium hyaluronate were added until a final HA concentration of 22 mg/mL was achieved. For detailed results regarding material characterization please refer to Øvrebø et al. [ 14 Determination of cytokine profiling To study inflammatory secretome responses of MSCs to isolated fracture versus polytrauma injuries in a controlled in vitro environment. After 24 h of culture, MSCs were treated for 48 h with GM supplemented with 10% pooled mouse serum (C57BL/6J; N Labeling mesenchymal stem cells with GFP and luciferase GFP and luciferase-expressing MSCs were transduced as described previously in [ 15 16 Animal surgery We performed animal surgeries in the Department of Orthopaedic Surgery, University of California, Davis in compliance with the ARRIVE guidelines under an approved protocol from the UC Davis Institutional Animal Care and Use Committee (IACUC# 23193). We acquired a total of 96 10-week-old male C57BL/6J mice (Jackson Laboratories, Bar Harbor, ME). Mice were randomly housed in groups of four and were acclimated to the housing vivarium for two weeks prior to any procedures. Water and pellet diet were provided ad libitum 2 17 18 After fracture and while still under anesthesia, we induced blunt thoracic trauma by dropping a hollow aluminum cylindrical weight (~ 30 g) from a height of 55 cm through a vertical stainless-steel tube onto a Lexon platform resting on the animal’s chest [ 2 19 MSCs were then delivered systemically or locally. Systemic delivery: 1 × 10⁶ GFP-luciferase-labeled MSCs in GM were injected into the lateral tail vein using a 27G needle. Local delivery: MSCs were encapsulated in 80 µL HA hydrogel and injected directly at the fracture site. Mice were allowed to recover from anesthesia in a well-ventilated area and kept warm using a heat pad underneath half of the cage with a surgical towel to minimize risk of contact thermal injury. Animal were observed for 10 d after surgery. Mice were injected with buprenorphine (0.1 mg/kg) twice daily after surgery (approximately 12 h apart) for 48 h. Mice were also weighed to ensure that no more than 20% of weight was lost from baseline weight. The surgical site was examined daily until the sutures were removed or the animals were euthanized. The animals were full weight-bearing and unrestricted activity was permitted postoperatively. Mice were euthanized by exsanguination via 2 Analysis of cytokines within serum Whole blood collected via N N In vivo imaging system (IVIS) imaging IVIS-imaging was conducted on days 3, 7 and 21, post-delivery of labeled MSCs. Mice were injected intraperitoneally with D-luciferin (150 mg/kg, GoldBio, St. Louis, MO) 10–15 min before imaging. Bioluminescence was captured in 2–4% isoflurane-anesthetized mice using an IVIS Spectrum System (PerkinElmer, Waltham, MA) with a 1-minute exposure and 8 × 8 binning. Images were analyzed using Aura Living Image Software (PerkinElmer). 3D micro-computed tomography analysis We imaged femur samples (fixed in 4% paraformaldehyde, 6 mice per treatment group, totaling 12 mice) using a microCT specimen scanner (Bruker microCT2242, Kontich, Belgium). Scan parameters were 55 kVp, 145 µA, 300 millisecond exposure time, average of 3 exposures per projection, 0.5 mm aluminum filter, 500 projections per 180 degrees and a 10 μm nominal voxel size. The raw images were calibrated using a hydroxyapatite (HA) phantom of varying HA concentrations. Noise in the images was reduced using a low-pass Gaussian filter. A 1 mm region of interest (ROI) extending from the defect edge was analyzed to capture bone outgrowth and account for anatomical variation between mice. Bone volume fraction (BV/TV) was determined by dividing the number of voxels denser than the low threshold representing mineralized tissue (BV: bone volume) by the total number of pixels in the region (TV: total volume). Several other parameters, including bone surface density (BS/TV), trabecular thickness (Tb.Th), trabecular separation (Tb.Sp), fractal dimension and degree of anisotropy were also measured. Histological and immunohistochemical analysis After microCT imaging, we performed decalcified histology on the samples (6 mice per group, a total of 12 mice). As described in our previous papers, Movat Pentachrome was used to evaluate the balance between bone mineralization and non-mineralization over time. Movat Pentachrome stain was used to image different constituents of the connective tissue: mineralized bone appears bright yellow, cartilage appears as blue-green, and non-mineralized bone appears bright red [ 20 21 20 21 20 21 Quantitative histomorphometrical analysis Sections were imaged at 10 × (3.09 pixels/µm) magnification using a Leica microscopy system (Leica DM5500 photomicroscope equipped with a DFC7000 camera and operated by LASX software version 3.0, Leica Microsystems Ltd, Wetzlar, Germany). Fiji ImageJ was used for histomorphometry. Fiji ImageJ (version 1.51r; NIH, Maryland, USA) was used as a platform to run the program. The Trainable Weka Segmentation (TWS) was used as the basis for creating an optimized script to analyze tissue formation parameters, including mineralization, new bone (non-mineralized bone), and cartilage formation. The histomorphometry measurements were done as previously reported by Malhan et al. [ 22 Statistical analysis Statistical analysis was performed using Prism 9.5.1 (GraphPad, San Diego, CA). Data normality was assessed using the Kolmogorov-Smirnov test. Normally distributed data are presented as mean ± standard deviation (SD), while non-normally distributed data are reported as median with interquartile range (IQR). When data failed the normality test, non-parametric analysis was performed using the Kruskal-Wallis test or one- /two-way ANOVA, depending on the experiment. For normally distributed datasets, multi-factor regression analysis was performed. Significant differences were denoted as * P P P P Results Polytrauma serum enhances Proinflammatory cytokine and chemokine secretion from MSCs compared to fracture serum at day 3 To investigate how MSCs respond differently to fracture versus polytrauma environments, we performed secretome profiling targeting a broad range of cytokines and chemokines at days 3 and 7 post-culture. The results revealed distinct inflammatory and regenerative profiles between the two conditions, underscoring the immunological challenges posed by polytrauma. As shown in Fig. 1 1 Additionally, MSCs exposed to polytrauma serum secreted higher levels of chemokines, including monocyte chemoattractant proteins (MCP-1 and MCP-5), and macrophage inflammatory proteins (MIP-1α, MIP-1γ, MIP-2, MIP-3α, and MIP-3β). In contrast, fracture serum elicited a more balanced inflammatory response, with lower levels of these pro-inflammatory factors. Instead, it was associated with higher expression of vascular and regenerative mediators including vascular cell adhesion molecule-1 (VCAM-1), and vascular endothelial growth factor receptor 1 (VEGF-R1) reflecting a more pro-angiogenic and tissue -repair–oriented secretome. .  Fig. 1 Polytrauma serum induces higher proinflammatory responses in mesenchymal stem cells (MSCs). Secretome profiling of mesenchymal stem cells (MSCs) pre-exposed to isolated fracture versus polytrauma serum after 3 days of culturing in osteogenic media. Cytokine levels were quantified, highlighting differential inflammatory responses between the two conditions. N Polytrauma serum sustains a highly inflammatory MSC secretome at day 7 By day 7 of osteogenic culture, MSCs exposed to polytrauma serum continued to secrete elevated levels of pro-inflammatory cytokines compared to those cultured with fracture serum (Fig. 2 2 The chemokine profile remained similarly pro-inflammatory. MSCs exposed to polytrauma serum showed increased secretion of MCP-1, MCP-3, MCP-5, and MIP-1α, MIP-1γ, and MIP-3β. Notably, CXCL15 (Lungkine), a lung-associated chemokine, was upregulated, further distinguishing the polytrauma response. Conversely, fracture serum-exposed MSCs showed increased expression of anti-inflammatory cytokines such as IL-10 and angiogenesis-promoting factors like VCAM-1, AND VEGF-R1. Together, these findings demonstrate that MSCs exposed to polytrauma serum sustain a pro-inflammatory secretome. In contrast, fracture serum has a higher likelihood of promoting an anti-inflammatory environment.  Fig. 2 Polytrauma serum induces higher proinflammatory responses in mesenchymal stem cells (MSCs). Secretome profiling of MSCs pre-exposed to isolated fracture versus polytrauma serum after 7 days of culturing in osteogenic media. Cytokine levels were quantified, highlighting differential inflammatory responses between the two conditions. N Polytrauma triggers sustained systemic inflammation, which is attenuated by MSC therapy Polytrauma provoked a markedly heightened systemic inflammatory response compared to isolated fracture, as reflected by elevated serum levels of key cytokines including IL-23 at both 1- and 3-weeks post-injury, and IL-1β at 3 weeks (Fig. 3 Importantly, both systemic and local MSC delivery significantly mitigated these inflammatory responses. Local MSC therapy led to a greater reduction in IL-23 levels at both time points. Although differences in TNF-α level did not reach statistical significance, a downward trend was evident, particularly in the locally treated group. Notably, MSC treatment, especially via These findings emphasize that MSC therapy can help temper the hyperinflammatory state induced by polytrauma, with local delivery offering potentially more consistent modulation of systemic cytokine responses.  Fig. 3 Mesenchymal stem cells (MSCs) attenuate inflammatory response in polytrauma environments. Cytokine expression of polytrauma mice treated with systemic or local delivery of MSC. Levels of inflammatory cytokines (interleukin 23, IL-23, interleukin 1 beta, IL-1β, tumor necrosis factor alpha, TNF-α, and interleukin 1 alpha, IL-1α) were measured from serum samples, revealing differences in systemic inflammatory responses between treatment groups. N P P P P MSC delivery suppresses type I interferons and IL-12p70, with local delivery providing yielding a uniform Immunomodulation Polytrauma induced elevated serum levels of IFN-γ, IFN-β, and IL-12p70 after 1- and 3-weeks post injury compared to the isolated fracture group, reflecting an intensified and prolonged systemic inflammatory response (Fig. 4 Both systemic and local MSC delivery mitigated the elevated cytokine and chemokine levels in polytrauma mice sera. Significant differences between untreated and treated polytrauma groups were observed in IFN-γ, IFN-β, and IL-12p70 after 3 weeks of healing. While local MSC delivery showed a more robust reduction in IL-12p70, which plays a central role in sustaining inflammation [ 23 24  Fig. 4 Mesenchymal stem cells (MSCs) attenuate inflammatory response in polytrauma environments. Cytokine expression of polytrauma mice treated with systemic or local delivery of MSC. Levels of inflammatory cytokines (interferon gamma, IFN-Y, interferon beta, IFN-β, monocyte chemoattractant protein 1, MCP-1, and interleukin 12P70, IL-12P70) were measured from serum samples, revealing differences in systemic inflammatory responses between treatment groups. N P P P Local and systemic MSC delivery suppress chronic inflammatory cytokines, but only local delivery normalizes GM-CSF and IL-27 Key pro-inflammatory cytokines, including GM-CSF and IL-17 A, were increased in the polytrauma group after 3 weeks. These cytokines are associated with chronic inflammation and delayed tissue repair [ 25 26 Both systemic and local MSC delivery significantly reduced the inflammatory response in polytrauma mice by decreasing IL-17 A and GM-CSF after 3 weeks of healing. Systemic delivery of MSCs also significantly reduced the level of IL-27. Notably, the level of GM-CSF for the local delivery group was significantly lower than the isolated fracture group after 3 weeks. This trend was also seen for IL-27 after systemic delivery of MSCs. The expression of IL-6 was increased significantly in both local and systemic delivery of MSCs over time (Fig 5  Fig. 5 Mesenchymal stem cells (MSCs) attenuate inflammatory response in polytrauma environments. Cytokine expression of polytrauma mice treated with systemic or local delivery of MSC. Levels of inflammatory cytokines (interleukin 6, IL-6, interleukin 10, IL-10, interleukin 17-A, IL-17 A, interleukin 27, IL-27, and granulocyte-macrophage colony-stimulating factor, GM-CSF) were measured from serum samples, revealing differences in systemic inflammatory responses between treatment groups. N P P P Systemic MSCs are trapped in the pulmonary region, while locally delivered MSCs remain at the fracture site As shown in Fig. 6 In the systemic delivery group, bioluminescent signals were predominantly observed in the pulmonary region, indicating that MSCs traveled to the lungs but did not reach the fracture site. The absence of detectable signals at the fracture site in the systemic group underscores that the majority of the MSCs were sequestered in the lungs and did not reach the site of injury.  Fig. 6 Mesenchymal stem cells (MSCs) delivered systemically in polytrauma mice are trapped in the lungs and did not travel to the fracture site. Representative in vivo imaging system (IVIS) images show luciferase activity from MSCs at the fracture site over time Local MSC delivery enhances bone formation and improves trabecular architecture compared to systemic MSC delivery At three weeks post-injury, microCT analysis revealed architectural differences in bone repair between systemic and local MSC-treated groups (Fig. 7 7 p  Fig. 7 Locally injected mesenchymal stem cells (MSCs) enhance fracture healing in polytrauma after three weeks of healing. Top left panel) Representative reconstructed microCT images of the femur in the two groups of systemic MSCs (Sys MSCs) and Local MSCs delivered in hydrogels after three weeks of healing. Quantitative microCT analysis of bone volume and surface characteristics including bone volume fraction (BV/TV), bone surface/volume ratio (BS/BV), bone surface density (BS/TV), and degree of anisotropy (DA) as well as analysis of trabecular architecture and bone remodeling parameters including trabecular number (Tb.N), trabecular separation (Tb.Sp), trabecular thickness (Tb.Th), and fractal dimension (FD). N P P P Histological analysis reveals greater mineralization and less cartilage in fracture callus with local MSC delivery In addition, the histological analysis demonstrated that while systemic MSCs had a higher average of cartilage formation in the fracture callus, the mineralized bone tissue was more prevalent and homogeneous in the locally delivered MSCs fracture callus (Fig. 8  Fig. 8 Locally injected mesenchymal stem cells (MSCs) enhance fracture healing in polytrauma after three weeks of healing. ( A B) N Local MSC delivery enhances vascularization, osteogenic activity, and bone remodeling balance Immunohistochemical analysis at 3 weeks post-injury revealed significant differences between systemic and local MSC delivery groups in markers related to angiogenesis, osteogenesis, and bone remodeling. Factor VIII staining, a marker of endothelial cells and neovascularization, showed increased vascular density in the HA + MSC local group compared to the systemic group (Fig. 9 p Alkaline phosphatase (ALP) staining, indicative of early osteogenic activity, was more prominently expressed in the local MSC group, with stronger and more widespread staining in the developing callus. Quantification confirmed significantly elevated ALP-positive areas in the local group (** p 9 Bone remodeling markers demonstrated a favorable osteogenic balance in the local MSC delivery group. Osteoprotegerin (OPG), a decoy receptor that inhibits osteoclastogenesis, was significantly higher in the local group (*** p p 9  Fig. 9 Local MSC delivery enhances angiogenesis, osteogenesis, and bone remodeling signaling at 3 weeks post-injury. Representative immunohistochemical images (form local MSCs group at the fracture site) and quantification of Factor VIII (vascular marker), ALP (osteoblast activity), OPG, and RANKL (bone remodeling regulators) in fracture callus tissues from polytrauma rats treated with either systemic (Sys MSCs) or local (Local MSCs) MSC delivery. Local MSC treatment significantly increased vascular density (Factor VIII) and osteogenic activity (ALP); and shifted the bone remodeling balance toward formation with increased OPG and decreased RANKL expression. Arrows indicate positive staining. Scale bars = 50 μm. Quantification shows percentage of positively stained area per callus section. N P P P Discussion Our study highlights the distinct inflammatory profiles associated with isolated fractures versus polytrauma. In vitro secretome analysis revealed that MSCs exposed to polytrauma serum produced significantly elevated levels of pro-inflammatory cytokines, including IL-6, IL-1α, IL-1β, TNF-α, IFN-γ, and GM-CSF, relative to fracture serum. These cytokines, alongside chemokines such as MCP-1, MCP-5, MIP-1α, and RANTES/CCL5, are key mediators of sustained immune activation and cell recruitment to sites of injury. This pattern is consistent with previously described damage-associated molecular patterns (DAMPs), which trigger systemic inflammatory responses following trauma [ 27 29 By day 7, the inflammatory signature in the polytrauma group remained elevated, particularly IL-12p70 and IL-17, both associated with chronic inflammation and impaired healing [ 23 24 26 30 Our in vivo data further confirmed that polytrauma induces a sustained systemic inflammatory response. Serum cytokine levels of IL-23, IL-1β, TNF-α, and IFN-γ remained significantly elevated at weeks 1 and 3 post-injury, reinforcing the notion that polytrauma disrupts the normal progression from inflammation to repair. These observations align with our previous findings that thoracic trauma prolongs the inflammatory phase of fracture healing [ 2 4 Both systemic and local MSC therapies significantly reduced these inflammatory markers, but local delivery showed greater suppression, particularly of IL-23 and TNF-α. Moreover, local MSC treatment more effectively reduced IL-12p70, implicated in persistent Th1-mediated inflammation and fracture nonunion [ 31 7 8 We observed that local MSC delivery reduced variability in inflammatory responses within the polytrauma group. This effect is likely due to the higher retention and site-specific activity of MSCs at the fracture site, minimizing systemic dilution and providing more consistent immunomodulation. This is particularly relevant in polytrauma, where systemic inflammation can impair both MSC survival and homing. These inflammatory cytokines, particularly IL-6, TNF-α, IL-17 A, and IL-23, are not only markers of systemic inflammation but active participants in impairing fracture healing through their influence on bone remodeling pathways. They interact with key signaling axes such as NF-κB, RANKL/OPG, and JAK/STAT. For instance, TNF-α and IL-6 have been shown to activate NF-κB and STAT3 signaling, promoting osteoclastogenesis by upregulating RANKL expression while simultaneously inhibiting osteoblast function [ 32 35 36 38 39 IVIS imaging confirmed the pulmonary entrapment of systemically administered MSCs, with no detectable migration to the fracture site. This phenomenon, attributed to the MSCs’ size and adhesion profile, has been documented previously [ 7 8 MicroCT data showed that local MSC therapy was associated with improved trabecular architecture. While no statistical significance was observed for BV/TV, the differences in remodeling metrics (e.g., anisotropy and surface density) suggested a more organized bone architecture in the local MSC group. These observations should be interpreted cautiously, given the relatively short 3-week healing window. Our histological findings showed increased mineralized bone and reduced cartilage in the local MSC group, indicating a more advanced state of endochondral ossification. This was consistent with our immunohistochemical analysis that demonstrated enhanced angiogenesis and osteogenic signaling in the local MSC group. Specifically, increased Factor VIII and ALP expression indicate improved vascularization and osteogenic activity, respectively. Additionally, the favorable shift in the OPG/RANKL axis toward bone formation suggests that local MSC delivery promoted a remodeling environment conducive to fracture repair. These localized effects reinforce the therapeutic potential of direct MSC administration in polytrauma settings, where rapid tissue regeneration and remodeling are essential. The apparent discrepancy between the in vitro and in vivo effects of MSCs can be explained by the absence of immune cell interactions in vitro. In vivo, local MSC delivery allows for direct engagement with host immune cells, particularly macrophages, in the fracture microenvironment. This interaction plays a critical role in modulating inflammation and promoting bone repair. MSCs are known to drive the phenotypic shift from pro-inflammatory M1 to anti-inflammatory M2 macrophages, a process essential for progression from inflammation to tissue regeneration [ 40 40 41 42 40 40 Several limitations should be acknowledged. First, our ability to track MSCs was restricted to a 1-week timepoint due to limited luciferase signal at day 3 and week 3. This limitation may reflect the known transient viability of MSCs post-transplantation. Previous work by Pang et al. [ 43 44 Looking ahead, given that excessive inflammation hinders healing, co-delivery of MSCs with anti-inflammatory agents could further improve outcomes in polytrauma-associated fractures. Additionally, future work should explore the role of sex, aging, and long-term healing timelines in evaluating MSC-based therapies. Our HA-based hydrogel system played a role in facilitating this localized therapeutic effect. HA provided a supportive, biocompatible matrix for MSC retention and delivery. However, despite promising trends, neither systemic nor local MSC delivery resulted in complete fracture healing within three weeks. To further improve osteogenesis, we plan to augment our HA-MSC platform with osteoinductive factors such as disordered peptides, aiming to accelerate healing and restore bone integrity more rapidly. Conclusions This study demonstrated that polytrauma, modeled by combined chest injury and femur fracture, induces a pathologically heightened and prolonged inflammatory response that impairs fracture healing. This was evidenced by sustained elevations of pro-inflammatory cytokines and chemokines in serum, which were associated with delayed tissue repair and increased variability in healing outcomes. We also showed that systemic mesenchymal stromal cell (MSC) delivery is limited by pulmonary entrapment, significantly reducing MSC availability at the fracture site and diminishing therapeutic efficacy. In contrast, local MSC delivery effectively modulated local inflammation, suppressed systemic cytokine levels, and promoted more consistent and enhanced fracture healing and angiogenesis. IVIS imaging confirmed that systemically administered MSCs accumulated in the lungs, while locally delivered MSCs remained at the fracture site, supporting the superiority of localized therapy in polytrauma settings. Our findings provide support for using biomaterial-encapsulated local MSC delivery to improve angiogenesis and early osteogenesis outcomes in complex injury models. Future research should focus on optimizing the immunomodulatory properties of MSC-laden hydrogels through the incorporation of osteogenic cues and tailoring biomaterial properties. Additionally, exploring the influence of aging and sex differences on MSC function will be crucial for developing more personalized regenerative therapies. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Mrs. Annette Stengel at the Experimental Trauma Surgery, Justus-Liebig University Giessen, Giessen, Germany is acknowledged for her assistance during the experiments. Mr. Torben Hildebrand is acknowledged for his assistance and training on microCT. Ms. Bridget McLaughlin and Mr. Jonathan Van Dyke from the University of California Davis Flow Cytometry Shared Resource Laboratory are acknowledged technical assistance. All the acknowledged individuals have provided permission for being mentioned in this section. Author contributions AMS (amsaiz@health.ucdavis.edu): Conceptualization, Funding acquisition, Investigation, Methodology, Project administration, Resources, Supervision, Validation, Writing – original draft, Writing – review & editing. MR (rahmati@health.ucdavis.edu): Conceptualization, Investigation, Methodology, Supervision, Validation, Writing – original draft, Writing – review & editing. Soren David Johnson (sorendjohnson7@gmail.com): Investigation, Data analysis, Writing – review & editing. Aneesh Satish Bhat (asbbhat@ucdavis.edu): Investigation, Data analysis, Writing – review & editing. TDB (tdbaldini@health.ucdavis.edu): Investigation, Data analysis, Writing – review & editing. ØØ (oeystein.oevreboe@gmail.com): Biomaterial design, Investigation, Methodology, Writing – review & editing. MAL (marlee@health.ucdavis.edu): Funding acquisition, Project administration, Resources, Supervision, Writing – review & editing. TEKH (thaqif.elkhassawna@chiru.med.uni-giessen.de): Conceptualization, Investigation, Methodology, Methodology, Supervision, Resources, Validation, Writing – review & editing. SS: Histological characterization, Writing – review & editing. FAF (ffierro@health.ucdavis.edu): Resources, Writing – review & editing. JKL (jkleach@health.ucdavis.edu): Conceptualization, Methodology, Resources, Supervision, Writing – review & editing. HJH (h.j.haugen@odont.uio.no): Conceptualization, Funding acquisition, Methodology, Project administration, Biomaterial Design, Resources, Supervision, Validation, Writing – review & editing. All authors have read and approved the final submitted manuscript. Funding This project was supported by the University of California Davis Flow Cytometry Shared Resource Laboratory with funding from the NCI P30 CA093373 (Comprehensive Cancer Center), and S10 OD018223 Data availability The datasets used and/or analyzed during the current study are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate The usage of luciferase-GFP labeled MSCs was done under an approved protocol from the UC Davis Biological Use Authorization (BUA, protocol # R3319). In addition, we performed animal surgeries in the Department of Orthopaedic Surgery, University of California, Davis in compliance with the ARRIVE guidelines under an approved protocol from the UC Davis Institutional Animal Care and Use Committee (IACUC# 23193). No other ethical approval was applicable to this study. Consent for publication Not applicable. Disclosures AMS – serves on committees for AO, OTA, AAOS, and ORS. MR serves on committees for ISFR ORS. The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this study, except for ØØ who is the inventor of the hydrogel used. The intellectual property rights and commercial rights to the material are owned by Nupep AS, where ØØ is the main shareholder. Research reported in this publication was supported by the National Institute Of Arthritis And Musculoskeletal And Skin Diseases of the National Institutes of Health under Award Number K08AR084594. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health. Competing interests The authors declare no competing interests. Abbreviations MSCs Mesenchymal stem cells IL-1 β Interleukin 1 beta TNF-α Tumor necrosis factor-alpha IFN-γ Interferon-gamma MCP Monocyte chemoattractant protein BMPs Bone morphogenetic proteins DBM Demineralized-based matrix HA Hyaluronic acid ECM Extracellular matrix ROI Region of interest BV Bone volume TV Total volume BS/TV Bone surface density Tb.Th Trabecular thickness Tb.Sp Trabecular separation VCAM-1 Vascular cell adhesion molecule-1 VEGF-R1 Vascular endothelial growth factor receptor 1 sTNF-R TNF-α soluble receptors References 1. Rahmati M Stötzel S El Khassawna T Mao C Ali A Vaughan JC Intrinsically disordered peptides enhance regenerative capacities of bone composite xenografts Mater Today 2022 52 63 79 10.1016/j.mattod.2021.12.001 Rahmati M, Stötzel S, El Khassawna T, Mao C, Ali A, Vaughan JC, et al. Intrinsically disordered peptides enhance regenerative capacities of bone composite xenografts. Mater Today. 2022;52:63–79. 2. Saiz AM, Rahmati M, Gresham RCH, Baldini TD, Burgan J, Lee MA, et al. Polytrauma impairs fracture healing accompanied by increased persistence of innate inflammatory stimuli and reduced adaptive response. J Orthop Research ® 10.1002/jor.26015 PMC11806648 39550711 3. Bowers KM Anderson DE Delayed union and nonunion: current concepts, prevention, and correction: A review Bioengineering 2024 11 6 525 10.3390/bioengineering11060525 38927761 PMC11201148 Bowers KM, Anderson DE. Delayed union and nonunion: current concepts, prevention, and correction: A review. Bioengineering. 2024;11(6):525. 38927761 10.3390/bioengineering11060525 PMC11201148 4. Mangum LH Avila JJ Hurtgen BJ Lofgren AL Wenke JC Burn and thoracic trauma alters fracture healing, systemic inflammation, and leukocyte kinetics in a rat model of polytrauma J Orthop Surg Res 2019 14 1 15 10.1186/s13018-019-1082-4 30782193 PMC6381742 Mangum LH, Avila JJ, Hurtgen BJ, Lofgren AL, Wenke JC. Burn and thoracic trauma alters fracture healing, systemic inflammation, and leukocyte kinetics in a rat model of polytrauma. J Orthop Surg Res. 2019;14:1–15. 30782193 10.1186/s13018-019-1082-4 PMC6381742 5. Liu H Li D Zhang Y Li M Inflammation, mesenchymal stem cells and bone regeneration Histochem Cell Biol 2018 149 393 404 10.1007/s00418-018-1643-3 29435765 Liu H, Li D, Zhang Y, Li M. Inflammation, mesenchymal stem cells and bone regeneration. Histochem Cell Biol. 2018;149:393–404. 29435765 10.1007/s00418-018-1643-3 6. Jiang W Xu J Immune modulation by mesenchymal stem cells Cell Prolif 2020 53 1 e12712 10.1111/cpr.12712 31730279 PMC6985662 Jiang W, Xu J. Immune modulation by mesenchymal stem cells. Cell Prolif. 2020;53(1):e12712. 31730279 10.1111/cpr.12712 PMC6985662 7. Wang S Guo L Ge J Yu L Cai T Tian R Excess integrins cause lung entrapment of mesenchymal stem cells Stem Cells 2015 33 11 3315 26 10.1002/stem.2087 26148841 Wang S, Guo L, Ge J, Yu L, Cai T, Tian R, et al. Excess integrins cause lung entrapment of mesenchymal stem cells. Stem Cells. 2015;33(11):3315–26. 26148841 10.1002/stem.2087 8. Eggenhofer E Benseler V Kroemer A Popp F Geissler E Schlitt H Mesenchymal stem cells are short-lived and do not migrate beyond the lungs after intravenous infusion Front Immunol 2012 3 297 10.3389/fimmu.2012.00297 23056000 PMC3458305 Eggenhofer E, Benseler V, Kroemer A, Popp F, Geissler E, Schlitt H, et al. Mesenchymal stem cells are short-lived and do not migrate beyond the lungs after intravenous infusion. Front Immunol. 2012;3:297. 23056000 10.3389/fimmu.2012.00297 PMC3458305 9. Tan F Xu M Li X Wang Z Li J Shahzad KA Biomaterial-Facilitated local delivery of stem Cell‐Derived small extracellular vesicles: perspectives in surgical therapy Adv Ther 2024 7 4 2300387 10.1002/adtp.202300387 Tan F, Xu M, Li X, Wang Z, Li J, Shahzad KA. Biomaterial-Facilitated local delivery of stem Cell‐Derived small extracellular vesicles: perspectives in surgical therapy. Adv Ther. 2024;7(4):2300387. 10. Wang X Rivera-Bolanos N Jiang B Ameer GA Advanced functional biomaterials for stem cell delivery in regenerative engineering and medicine Adv Funct Mater 2019 29 23 1809009 10.1002/adfm.201809009 Wang X, Rivera-Bolanos N, Jiang B, Ameer GA. Advanced functional biomaterials for stem cell delivery in regenerative engineering and medicine. Adv Funct Mater. 2019;29(23):1809009. 11. Rao NV. Hyaluronic acid–based hydrogels for tissue engineering. Biomaterials for Organ and Tissue Regeneration: Elsevier; 2020;551 – 65. 12. Deng H Wang J An R Hyaluronic acid-based hydrogels: as an exosome delivery system in bone regeneration Front Pharmacol 2023 14 1131001 10.3389/fphar.2023.1131001 37007032 PMC10063825 Deng H, Wang J, An R. Hyaluronic acid-based hydrogels: as an exosome delivery system in bone regeneration. Front Pharmacol. 2023;14:1131001. 37007032 10.3389/fphar.2023.1131001 PMC10063825 13. Shi Q Zhao L Xu C Zhang L Zhao H High molecular weight hyaluronan suppresses macrophage M1 polarization and enhances IL-10 production in PM2. 5-induced lung inflammation Molecules 2019 24 9 1766 10.3390/molecules24091766 31067702 PMC6539614 Shi Q, Zhao L, Xu C, Zhang L, Zhao H. High molecular weight hyaluronan suppresses macrophage M1 polarization and enhances IL-10 production in PM2. 5-induced lung inflammation. Molecules. 2019;24(9):1766. 31067702 10.3390/molecules24091766 PMC6539614 14. Ovreb O, Giorgi Z, De Lauretis A, Vanoli V, Castiglione F, Briatico-Vangosa F, et al. Characterisation and biocompatibility of crosslinked hyaluronic acid with BDDE and PEGDE for clinical applications. React Funct Polym. 2024;200. 15. Beegle J Lakatos K Kalomoiris S Stewart H Isseroff RR Nolta JA Hypoxic preconditioning of mesenchymal stromal cells induces metabolic changes, enhances survival, and promotes cell retention in vivo Stem Cells 2015 33 6 1818 28 10.1002/stem.1976 25702874 PMC10757456 Beegle J, Lakatos K, Kalomoiris S, Stewart H, Isseroff RR, Nolta JA, et al. Hypoxic preconditioning of mesenchymal stromal cells induces metabolic changes, enhances survival, and promotes cell retention in vivo. Stem Cells. 2015;33(6):1818–28. 25702874 10.1002/stem.1976 PMC10757456 16. Beegle JR, Magner NL, Kalomoiris S, Harding A, Zhou P, Nacey C, et al. Preclinical evaluation of mesenchymal stem cells overexpressing VEGF to treat critical limb ischemia. Mol Ther Methods Clin Dev. 2016;3. 10.1038/mtm.2016.53 PMC5003097 27610394 17. Marturano JE Cleveland BC Byrne MA O’Connell SL Wixted JJ Billiar KL An improved murine femur fracture device for bone healing studies J Biomech 2008 41 6 1222 8 10.1016/j.jbiomech.2008.01.029 18384794 Marturano JE, Cleveland BC, Byrne MA, O’Connell SL, Wixted JJ, Billiar KL. An improved murine femur fracture device for bone healing studies. J Biomech. 2008;41(6):1222–8. 18384794 10.1016/j.jbiomech.2008.01.029 18. Bonnarens F Einhorn TA Production of a standard closed fracture in laboratory animal bone J Orthop Res 1984 2 1 97 101 10.1002/jor.1100020115 6491805 Bonnarens F, Einhorn TA. Production of a standard closed fracture in laboratory animal bone. J Orthop Res. 1984;2(1):97–101. 6491805 10.1002/jor.1100020115 19. Fitschen-Oestern S Lippross S Klueter T Weuster M Varoga D Tohidnezhad M A new multiple trauma model of the mouse BMC Musculoskelet Disord 2017 18 1 12 10.1186/s12891-017-1813-9 29157219 PMC5697084 Fitschen-Oestern S, Lippross S, Klueter T, Weuster M, Varoga D, Tohidnezhad M, et al. A new multiple trauma model of the mouse. BMC Musculoskelet Disord. 2017;18:1–12. 29157219 10.1186/s12891-017-1813-9 PMC5697084 20. Movat HZ Demonstration of all connective tissue elements in a single section; pentachrome stains AMA Archives Pathol 1955 60 3 289 95 13248341 Movat HZ. Demonstration of all connective tissue elements in a single section; pentachrome stains. AMA Archives Pathol. 1955;60(3):289–95. 13248341 21. Rahmati M Stötzel S Khassawna TE Iskhahova K Florian Wieland D Zeller Plumhoff B Early osteoimmunomodulatory effects of magnesium–calcium–zinc alloys J Tissue Eng 2021 12 20417314211047100 10.1177/20417314211047100 34589198 PMC8474317 Rahmati M, Stötzel S, Khassawna TE, Iskhahova K, Florian Wieland D, Zeller Plumhoff B, et al. Early osteoimmunomodulatory effects of magnesium–calcium–zinc alloys. J Tissue Eng. 2021;12:20417314211047100. 34589198 10.1177/20417314211047100 PMC8474317 22. Malhan D Muelke M Rosch S Schaefer AB Merboth F Weisweiler D An optimized approach to perform bone histomorphometry Front Endocrinol 2018 9 404664 10.3389/fendo.2018.00666 PMC6259258 30519215 Malhan D, Muelke M, Rosch S, Schaefer AB, Merboth F, Weisweiler D, et al. An optimized approach to perform bone histomorphometry. Front Endocrinol. 2018;9:404664. 10.3389/fendo.2018.00666 PMC6259258 30519215 23. Ullrich KA Schulze LL Paap E-M Müller TM Neurath MF Zundler S Immunology of IL-12: an update on functional activities and implications for disease EXCLI J 2020 19 1563 33408595 10.17179/excli2020-3104 PMC7783470 Ullrich KA, Schulze LL, Paap E-M, Müller TM, Neurath MF, Zundler S. Immunology of IL-12: an update on functional activities and implications for disease. EXCLI J. 2020;19:1563. 33408595 10.17179/excli2020-3104 PMC7783470 24. Verma ND Hall BM Plain KM Robinson CM Boyd R Tran GT Interleukin-12 (IL-12p70) promotes induction of highly potent Th1-like CD4 + CD25 + T regulatory cells that inhibit allograft rejection in unmodified recipients Front Immunol 2014 5 190 10.3389/fimmu.2014.00190 24847323 PMC4023029 Verma ND, Hall BM, Plain KM, Robinson CM, Boyd R, Tran GT, et al. Interleukin-12 (IL-12p70) promotes induction of highly potent Th1-like CD4 + CD25 + T regulatory cells that inhibit allograft rejection in unmodified recipients. Front Immunol. 2014;5:190. 24847323 10.3389/fimmu.2014.00190 PMC4023029 25. Hamilton JA GM-CSF in inflammation J Exp Med 2019 217 1 e20190945 10.1084/jem.20190945 PMC7037240 31611249 Hamilton JA. GM-CSF in inflammation. J Exp Med. 2019;217(1):e20190945. 10.1084/jem.20190945 PMC7037240 31611249 26. Xiao T Yan Z Xiao S Xia Y Proinflammatory cytokines regulate epidermal stem cells in wound epithelialization Stem Cell Res Ther 2020 11 1 232 10.1186/s13287-020-01755-y 32527289 PMC7291661 Xiao T, Yan Z, Xiao S, Xia Y. Proinflammatory cytokines regulate epidermal stem cells in wound epithelialization. Stem Cell Res Ther. 2020;11(1):232. 32527289 10.1186/s13287-020-01755-y PMC7291661 27. Amann EM Groß A Rojewski MT Kestler HA Kalbitz M Brenner RE Inflammatory response of mesenchymal stromal cells after in vivo exposure with selected trauma-related factors and polytrauma serum PLoS ONE 2019 14 5 e0216862 10.1371/journal.pone.0216862 31086407 PMC6516676 Amann EM, Groß A, Rojewski MT, Kestler HA, Kalbitz M, Brenner RE, et al. Inflammatory response of mesenchymal stromal cells after in vivo exposure with selected trauma-related factors and polytrauma serum. PLoS ONE. 2019;14(5):e0216862. 31086407 10.1371/journal.pone.0216862 PMC6516676 28. Prokazyuk A Tlemissov A Zhanaspayev M Aubakirova S Mussabekov A Development and validation of a machine learning-based model to assess probability of systemic inflammatory response syndrome in patients with severe multiple traumas BMC Med Inf Decis Mak 2024 24 1 235 10.1186/s12911-024-02640-x PMC11351256 39192291 Prokazyuk A, Tlemissov A, Zhanaspayev M, Aubakirova S, Mussabekov A. Development and validation of a machine learning-based model to assess probability of systemic inflammatory response syndrome in patients with severe multiple traumas. BMC Med Inf Decis Mak. 2024;24(1):235. 10.1186/s12911-024-02640-x PMC11351256 39192291 29. Trancă SD Petrişor CL Hagău N Biomarkers in polytrauma induced systemic inflammatory response syndrome and sepsis–a narrative review Romanian J Anaesth Intensive Care 2014 21 2 118 PMC5505349 28913443 Trancă SD, Petrişor CL, Hagău N. Biomarkers in polytrauma induced systemic inflammatory response syndrome and sepsis–a narrative review. Romanian J Anaesth Intensive Care. 2014;21(2):118. PMC5505349 28913443 30. Schmitz JM McCracken VJ Dimmitt RA Lorenz RG Expression of CXCL15 (Lungkine) in murine gastrointestinal, urogenital, and endocrine organs J Histochem Cytochemistry 2007 55 5 515 24 10.1369/jhc.6A7121.2007 17242461 Schmitz JM, McCracken VJ, Dimmitt RA, Lorenz RG. Expression of CXCL15 (Lungkine) in murine gastrointestinal, urogenital, and endocrine organs. J Histochem Cytochemistry. 2007;55(5):515–24. 10.1369/jhc.6A7121.2007 17242461 31. Schmidt-Bleek K Kwee BJ Mooney DJ Duda GN Boon and Bane of inflammation in bone tissue regeneration and its link with angiogenesis Tissue Eng Part B: Reviews 2015 21 4 354 64 10.1089/ten.teb.2014.0677 PMC4533093 25742724 Schmidt-Bleek K, Kwee BJ, Mooney DJ, Duda GN. Boon and Bane of inflammation in bone tissue regeneration and its link with angiogenesis. Tissue Eng Part B: Reviews. 2015;21(4):354–64. 10.1089/ten.teb.2014.0677 PMC4533093 25742724 32. Zhao Z Hou X Yin X Li Y Duan R Boyce BF TNF induction of NF-κB RelB enhances RANKL-induced osteoclastogenesis by promoting inflammatory macrophage differentiation but also limits it through suppression of NFATc1 expression PLoS ONE 2015 10 8 e0135728 10.1371/journal.pone.0135728 26287732 PMC4545392 Zhao Z, Hou X, Yin X, Li Y, Duan R, Boyce BF, et al. TNF induction of NF-κB RelB enhances RANKL-induced osteoclastogenesis by promoting inflammatory macrophage differentiation but also limits it through suppression of NFATc1 expression. PLoS ONE. 2015;10(8):e0135728. 26287732 10.1371/journal.pone.0135728 PMC4545392 33. Xie X Hu L Mi B Panayi AC Xue H Hu Y SHIP1 activator AQX-1125 regulates osteogenesis and osteoclastogenesis through PI3K/Akt and NF-κb signaling Front Cell Dev Biology 2022 10 826023 10.3389/fcell.2022.826023 PMC9014098 35445030 Xie X, Hu L, Mi B, Panayi AC, Xue H, Hu Y, et al. SHIP1 activator AQX-1125 regulates osteogenesis and osteoclastogenesis through PI3K/Akt and NF-κb signaling. Front Cell Dev Biology. 2022;10:826023. 10.3389/fcell.2022.826023 PMC9014098 35445030 34. Jimi E Takakura N Hiura F Nakamura I Hirata-Tsuchiya S The role of NF-κB in physiological bone development and inflammatory bone diseases: is NF-κB Inhibition killing two birds with one stone?? Cells 2019 8 12 1636 10.3390/cells8121636 31847314 PMC6952937 Jimi E, Takakura N, Hiura F, Nakamura I, Hirata-Tsuchiya S. The role of NF-κB in physiological bone development and inflammatory bone diseases: is NF-κB Inhibition killing two birds with one stone? Cells. 2019;8(12):1636. 31847314 10.3390/cells8121636 PMC6952937 35. Kim S-H Kim K-J Kang HJ Son Y-J Choi S-W Lee M-J The dual role of oat Bran water extract in bone homeostasis through the regulation of osteoclastogenesis and osteoblast differentiation Molecules 2018 23 12 3119 10.3390/molecules23123119 30487443 PMC6320902 Kim S-H, Kim K-J, Kang HJ, Son Y-J, Choi S-W, Lee M-J. The dual role of oat Bran water extract in bone homeostasis through the regulation of osteoclastogenesis and osteoblast differentiation. Molecules. 2018;23(12):3119. 30487443 10.3390/molecules23123119 PMC6320902 36. Yang X Liang J Wang Z Su Y Zhan Y Wu Z Sesamolin protects mice from ovariectomized bone loss by inhibiting osteoclastogenesis and RANKL-mediated NF-κB and MAPK signaling pathways Front Pharmacol 2021 12 664697 10.3389/fphar.2021.664697 34194327 PMC8237092 Yang X, Liang J, Wang Z, Su Y, Zhan Y, Wu Z, et al. Sesamolin protects mice from ovariectomized bone loss by inhibiting osteoclastogenesis and RANKL-mediated NF-κB and MAPK signaling pathways. Front Pharmacol. 2021;12:664697. 34194327 10.3389/fphar.2021.664697 PMC8237092 37. Ihn HJ Kim JA Lim S Nam S-H Hwang SH Lim J Fermented oyster extract prevents ovariectomy-induced bone loss and suppresses osteoclastogenesis Nutrients 2019 11 6 1392 10.3390/nu11061392 31234292 PMC6627411 Ihn HJ, Kim JA, Lim S, Nam S-H, Hwang SH, Lim J, et al. Fermented oyster extract prevents ovariectomy-induced bone loss and suppresses osteoclastogenesis. Nutrients. 2019;11(6):1392. 31234292 10.3390/nu11061392 PMC6627411 38. Mi B Chen L Xiong Y Yang Y Panayi AC Xue H Osteoblast/osteoclast and immune cocktail therapy of an exosome/drug delivery multifunctional hydrogel accelerates fracture repair ACS Nano 2022 16 1 771 82 10.1021/acsnano.1c08284 34979087 Mi B, Chen L, Xiong Y, Yang Y, Panayi AC, Xue H, et al. Osteoblast/osteoclast and immune cocktail therapy of an exosome/drug delivery multifunctional hydrogel accelerates fracture repair. ACS Nano. 2022;16(1):771–82. 34979087 10.1021/acsnano.1c08284 39. Liu L-N Hu P Liu Y Sun Y Li Z-M Xu J-Z Tetrahedral framework nucleic acids promote senile osteoporotic fracture repair by enhancing osteogenesis and angiogenesis of callus ACS Appl Mater Interfaces 2023 15 21 25403 16 10.1021/acsami.3c03569 37202852 Liu L-N, Hu P, Liu Y, Sun Y, Li Z-M, Xu J-Z, et al. Tetrahedral framework nucleic acids promote senile osteoporotic fracture repair by enhancing osteogenesis and angiogenesis of callus. ACS Appl Mater Interfaces. 2023;15(21):25403–16. 37202852 10.1021/acsami.3c03569 40. Burgan J, Rahmati M, Lee M, Saiz AM. Innate immune response to bone fracture healing. Bone. 2024:117327. 10.1016/j.bone.2024.117327 39522707 41. Lu LY Loi F Nathan K Lin T Pajarinen J Gibon E Pro-inflammatory M1 macrophages promote osteogenesis by mesenchymal stem cells via the COX‐2‐prostaglandin E2 pathway J Orthop Res 2017 35 11 2378 85 10.1002/jor.23553 28248001 PMC5581298 Lu LY, Loi F, Nathan K, Lin T, Pajarinen J, Gibon E, et al. Pro-inflammatory M1 macrophages promote osteogenesis by mesenchymal stem cells via the COX‐2‐prostaglandin E2 pathway. J Orthop Res. 2017;35(11):2378–85. 28248001 10.1002/jor.23553 PMC5581298 42. Zhang Y Böse T Unger RE Jansen JA Kirkpatrick CJ van den Beucken JJ Macrophage type modulates osteogenic differentiation of adipose tissue MSCs Cell Tissue Res 2017 369 2 273 86 10.1007/s00441-017-2598-8 28361303 PMC5552848 Zhang Y, Böse T, Unger RE, Jansen JA, Kirkpatrick CJ, van den Beucken JJ. Macrophage type modulates osteogenic differentiation of adipose tissue MSCs. Cell Tissue Res. 2017;369(2):273–86. 28361303 10.1007/s00441-017-2598-8 PMC5552848 43. Pang SHM D’Rozario J Mendonca S Bhuvan T Payne NL Zheng D Mesenchymal stromal cell apoptosis is required for their therapeutic function Nat Commun 2021 12 1 6495 10.1038/s41467-021-26834-3 34764248 PMC8586224 Pang SHM, D’Rozario J, Mendonca S, Bhuvan T, Payne NL, Zheng D, et al. Mesenchymal stromal cell apoptosis is required for their therapeutic function. Nat Commun. 2021;12(1):6495. 34764248 10.1038/s41467-021-26834-3 PMC8586224 44. Huang S Xu L Sun Y Zhang Y Li G The fate of systemically administrated allogeneic mesenchymal stem cells in mouse femoral fracture healing Stem Cell Res Ther 2015 6 1 13 10.1186/s13287-015-0198-7 26503505 PMC4621860 Huang S, Xu L, Sun Y, Zhang Y, Li G. The fate of systemically administrated allogeneic mesenchymal stem cells in mouse femoral fracture healing. Stem Cell Res Ther. 2015;6:1–13. 26503505 10.1186/s13287-015-0198-7 PMC4621860 ",
  "metadata": {
    "Title of this paper": "The fate of systemically administrated allogeneic mesenchymal stem cells in mouse femoral fracture healing",
    "Journal it was published in:": "Journal of Biological Engineering",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487495/"
  }
}