{
  "title": "Paper_542",
  "abstract": "ChemMedChem ChemMedChem 319 nihpa ChemMedChem 1860-7179 1860-7187 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12483626 PMC12483626.1 12483626 12483626 NIHMS2104412 38830117 10.1002/cmdc.202400391 NIHMS2104412 NIHPA2104412 1 Article Self-Assembling Peptide-Based High-Relaxivity Targeted MRI Contrast Agents O’Brien Andrew M. [a] Pileski Griffin C. [a] Henry Matthew P. [a] Soika Dana Q.M. [a] Deutsch Alex W. [a] Hornak Joseph P. [a] [b] Schmitthenner Hans F. * [a] [a] [b] * hfssch@rit.edu 16 9 2024 19 7 2024 19 18 497820 e202400391 e202400391 12 08 2025 30 09 2025 01 10 2025 01 10 2025 Concentration-dependent increases in relaxivity (r1) were found to be induced by self-assembly when Fmoc is adjacent to tryptophan in peptide-based MRI contrast agents featuring Gd-DOTA. A series of di- and tri-peptides were synthesized to test the effect of ionic strength, N-terminal substituent, peptide length, net charge, and relative location of Fmoc and tryptophan on r1 and critical aggregation concentration (CAC) at 1.0 Tesla. Compared to nominal r1 values of 3.5-7.4 mM-1s-1 per Gd(III), r1 values increased dramatically to 13.2-16.9 mM-1s-1 per Gd(III) upon self-assembly, with CACs between 0.22 and 2.59 mM when tested in H2O or PBS. When tested in fetal bovine serum (FBS), the compounds maintained high r1 values of 11.2-13.0 mM-1s-1, but had dramatically lower CAC values below 25 μM. These findings guided the synthesis of two targeted, high-relaxivity MRI contrast agents that contained PSMA-binding ligand, DCL. Their r1 values in H2O or PBS increased from 5.9-7.4 mM-1s-1 to 13.5-14.8 mM-1s-1 with CAC values of 1.65-2.70 mM. In FBS, their r1 values were found to be 11.2-.9 mM-1s-1, with CAC values below 25 μM. By the conjugation of targeting agents in the last step of synthesis, a broadly applicable route to targeted, high-relaxivity MRI contrast agents is offered. Graphical Abstract  Peptide based MRI contrast agents containing Fmoc-protected tryptophan were found to self-assemble above a critical aggregation concentration, raising their r 1 −1 −1 −1 −1 1 −1 −1 MRI peptide self-assembly cancer targeting pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Self-Assembling Peptide-Based High-Relaxivity Targeted MRI Contrast Agents",
    "Journal it was published in:": "ChemMedChem",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483626/"
  }
}