{
  "title": "Paper_600",
  "abstract": "pmc BMC Geriatr BMC Geriatr 33 bmcgeri BMC Geriatrics 1471-2318 BMC PMC12482252 PMC12482252.1 12482252 12482252 41023928 10.1186/s12877-025-06405-7 6405 1 Research A Delphi consensus-based frailty screening scale for community-dwelling older adults in China Wang Qin 1 Zhang Yuhui 1 Li Li 1 Zhao Chongyang 1 Song Jia 1 Zhang Xin 3 Wu Hongmei 4 Kang Deying deyingkang@126.com 1 2 1 https://ror.org/011ashp19 grid.13291.38 0000 0001 0807 1581 Department of Evidence-based Medicine and Clinical Epidemiology, West China Hospital, Sichuan University, 2 https://ror.org/011ashp19 grid.13291.38 0000 0001 0807 1581 Center of Biostatistics, Design, Measurement and Evaluation (CBDME), Department of Clinical Research Management, West China Hospital, Sichuan University, 3 https://ror.org/011ashp19 grid.13291.38 0000 0001 0807 1581 Division of Internal Medicine, Institute of Integrated Traditional Chinese and Western Medicine, West China Hospital, Sichuan University, 4 https://ror.org/011ashp19 grid.13291.38 0000 0001 0807 1581 Center for Geriatrics, West China Hospital, Sichuan University, 29 9 2025 2025 25 478199 743 27 5 2025 22 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Frailty is a multidimensional condition with increasing relevance in aging populations. However, most existing screening tools used in China are either translated from Western instruments or designed for clinical settings, limiting their cultural and practical applicability for community-based screening. This study aims to develop a multifaceted frailty screening scale tailored to the needs of community-dwelling older adults in China. Methods A systematic review and meta-analysis were conducted to identify high-frequency and high-relevance frailty-related items. Based on these findings, a two-round Delphi survey involving 16 experts in geriatrics, public health, and clinical epidemiology was undertaken to refine, evaluate, and finalize the item pool. Results Based on systematic review and Delphi expert consensus, a 22-item screening tool was developed covering physical, psychological, functional, nutritional, medication-related, and social domains. Conclusions The Frailty Screening Scale (FSS) demonstrates good content basis and contextual adaptability as a brief frailty screening tool for community-dwelling older adults in China.It may serve as a complementary tool alongside existing frailty assessment instruments. Supplementary Information The online version contains supplementary material available at 10.1186/s12877-025-06405-7. Keywords Frailty Community-dwelling older adults Screening tool development Delphi method 1.3.5 project for disciplines of excellence-Clinical Research Fund, West China Hospital, Sichuan University 2023HXFH045 Zhang Xin 1.3.5 project for disciplines of excellence, West China Hospital, Sichuan University ZYGD23002 Kang Deying pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Frailty is a multidimensional syndrome linked to increased risks of many adverse outcomes, such as disability, hospitalization, and mortality, posing a growing challenge in aging China [ 1 3 4 5 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:\\ge\\:\\:$$\\end{document} 6 7 8 9 12 Over the years, various tools have been developed to screen or evaluate frailty, yet none has become a universal standard. The Fried frailty phenotype (FP) relies on objective measures like grip strength, making it impractical for large-scale population studies or busy clinical environments [ 13 15 16 18 19 21 22 23 In China, the challenge is compounded by the use of frailty tools translated from foreign languages, which often fail to reflect local cultural contexts [ 24 25 26 28 29 30 31 32 33 Currently, China lacks a locally developed, multi-dimensional, and brief frailty screening tool suited for community use [ 24 25 32 33 Methods This study utilized a multi-round Delphi consensus method for the development of a frailty screening scale. Establishment of a study group There were eight members in the study group, including one professor of evidence-based medicine, two professors of geriatrics, and five graduate students. All members were involved in geriatrics, clinical research methodology, or evidence-based medicine. Their responsibilities included literature search, preliminary item construction, expert recruitment, questionnaire development and administration, as well as data analysis and finalization of the scale. Prepare a questionnaire Build the pool of items The questionnaire was designed to develop a culturally appropriate frailty screening scale for community-dwelling older adults in China. We began by conducting a systematic review and meta-analysis (PROSPERO registration number: CRD42023415074) to identify existing frailty assessment tools and extract high-frequency, high-relevance items associated with multiple frailty domains, including physical, psychological, cognitive, nutritional, and social aspects. This literature-informed item pool served as the foundation for further refinement through expert consensus. This preliminary pool was then reviewed by selected experts for relevance evaluation using the Delphi method.To ensure contextual relevance, we sought input from experienced geriatricians, public health specialists, clinical epidemiologists, and community healthcare professionals. These experts were invited to evaluate and provide feedback on the appropriateness of each item in the context of Chinese older adults living in community settings. The initial pool of potential items included both observable indicators such as gait speed, weight loss and subjective reports such as fatigue, emotional well-being, reflecting the multidimensional aspects of frailty. Each item was rated using a 5-point Likert scale based on its perceived importance for screening frailty in community settings. Experts were encouraged to comment on the clarity, feasibility, and cultural applicability of each item. In Round 1, all items were retained regardless of their score to collect qualitative feedback. Based on expert comments, some items were revised and resubmitted in Round 2 for further evaluation. Screening of correspondence experts The Delphi method obtains expert feedback through repeated rounds of questionnaires to reach a structured, representative consensus. Experts were selected through purposive sampling based on their experience in frailty research and relevance to community healthcare in China. The inclusion criteria for experts were as follows: (1) holding a bachelor’s degree or higher; (2) possessing a senior or middle-level professional title; (3) having at least 10 years of experience in geriatrics, public health, community care, or evidence-based medicine; (4) willingness to participate voluntarily; and (5) representing a variety of disciplinary backgrounds and geographic regions. Experts were excluded if they: (1) completed the questionnaires perfunctorily or with missing key information; (2) failed to respond within the required time frame; or (3) showed limited engagement across Delphi rounds. Design expert inquiry form The expert inquiry form consisted of three main components: (1) a general description of the study purpose and the background of frailty screening in community-dwelling older adults in China; (2) the core content of the scale items, including item descriptions, importance rating criteria, and scoring instructions; and (3) collection of expert demographic and professional background information. Each item was rated on a 5-point Likert scale (1 = not important, 5 = very important). Experts were encouraged to provide qualitative feedback in the comment section, including suggestions for modification, addition, or removal of items, along with their rationale. Expert characteristics collected included gender, educational level, professional title, years of experience, and their degree of familiarity with frailty concepts. The authority of experts was represented by the authority coefficient (Cr), which comprises two factors: the familiarity degree (Cs) and the judgment basis (Ca). The familiarity degree (Cs) was self-reported by experts on a 5-point scale: very familiar (1.0), moderately familiar (0.75), generally familiar (0.5), somewhat familiar (0.25), and unfamiliar (0). The judgment basis (Ca) was determined based on four aspects: practical experience (0.8), theoretical analysis (0.6), knowledge of domestic and international peers (0.4), and intuitive judgment (0.2). The combined authority coefficient (Cr) was calculated using the formula: Cr = (Cs + Ca)/2. A Cr value above 0.70 was considered acceptable, indicating a reliable level of expert authority. The inquiry process The expert questionnaire was distributed via e-mail, and experts were requested to return their responses within two weeks. In the first round, experts were provided with an initial item pool ( n In the second round, the revised list of items, along with a summary of the previous round’s ratings and expert comments, was sent back to the same panel. Based on expert recommendations from Round 1, two new items pertaining to Physical Function and one new item related to Other Function were added to the questionnaire. Consequently, a total of 30 items were included in the Round 2 questionnaire for further consultation. The complete item pool for Delphi Round 2 evaluation is presented in Supplementary Table S2. Experts were asked to re-rate the updated items and to indicate their agreement with the overall item set. Items were screened using the boundary value method, evaluating each based on its mean importance score, full-score frequency, and coefficient of variation (CV). The threshold for retention was set at the mean score or full-score frequency exceeding the boundary value, calculated as the mean minus one standard deviation. Items meeting these criteria were retained for the final frailty screening scale(see Table S4 for details). For the coefficient of variation, the threshold was set as “mean plus standard deviation,” and items with CV values below this threshold were considered acceptable. Experts were also invited to provide final suggestions on the structure and applicability of the scale. Two rounds of expert consultation were conducted in total, with an interval of over 20 days to minimize recall bias and ensure independent judgment across rounds. The final 22-item frailty screening scale is presented in Supplementary Table S3. Data analysis All collected data were double-entered and verified by two independent researchers (Qin Wang and Yuhui Zhang), and analyzed using Microsoft Excel 2016 and SPSS 22.0 software. The descriptive statistics of expert characteristics were presented as frequencies and percentages (%).The Cr, CS, and Ca values were calculated as previously described. Item scores were summarized using means and CVs. The degree of agreement among experts was measured by Kendall’s coefficient of concordance (W), which ranges from 0 to 1, with higher values indicating better consistency in expert opinions. A non-parametric test of Kendall’s W was performed at a significance level of α = 0.05. Results Basic information of experts A total of 16 experts were invited to participate in this study, and all 16 completed both rounds, with a response rate of 100% for each round. Table 1 1 Table 1 Basic information of experts ( N Working group characteristics Value Specialists. n Geriatric specialists 6(37.50%) Cardiology specialist 1(6.25%) Evidence-based medicine specialist 1(6.25%) General medical practitioner 2(12.50%) Family medicine doctor 6(37.50%) Healthcare setting. n Academic hospital 8(50.00%) General hospital 2(12.50%) Community health service centers 6(37.50%) Years of clinical experience. n < 10 2(12.50%) 10 ~ 15 2(12.50%) 16 ~ 20 1(6.25%) 21–25 4(25.00%) 26–30 4(25.00%) > 30 3(18.75%) Years of clinical experience, mean ± SD 22.56 ± 8.69 Degree. n Doctoral degree 7(43.75%) Master’s degree 2(12.50%) Bachelor’s degree 7(43.75%) Degree of expert authority All 16 invited experts completed both rounds of consultation, resulting in a 100% response rate for each round, indicating a high degree of expert engagement. Following the first round, two experts provided three additional recommendations, leading to a refined set of items. After the second round, no further recommendations were made, signifying the convergence of expert opinions. The mean familiarity degree (Cs) was 0.77 and 0.75 for the two rounds, respectively. The mean judgment basis (Ca) was 0.86 in the first round and 0.87 in the second, while the combined authority coefficient (Cr) was 0.82 and 0.81, respectively. Degree of concentration of expert opinions In this study, the importance scores from the two rounds of expert consultation ranged from 3.53 to 4.69 and 3.29 to 4.75, respectively. The coefficient of variation (CV) was calculated only for the second round of the Delphi survey. In the physical function subscale, the item with the highest CV was item P6, while the lowest was item P3. In the psychological function subscale, item M2 had the highest CV and item M3 the lowest. For the social function subscale, item S1 showed the highest CV, and item S3 the lowest. In the other domains, the highest CV was observed for item E7, and the lowest for item E8.(see Table 2 Table 2 The results of expert opinion coordination coefficient First-round Second-round The number of items 27 30 Coordination coefficient 0.22 0.40 χ 2 89.27 185.76 P < 0.001 < 0.001 Kendall’s W values of two rounds of expert correspondence were 0.22 and 0.40, respectively, with statistical significance ( P Changes of frailty screening scale for community-dwelling older adults in China Items were screened using the boundary value method. As a result, three items (P3, P4, and P6) were removed from the physical function subscale; one item (M2) was removed from the psychological function subscale; two items (S1 and S2) were removed from the social function subscale; and two items (E2 and E7) were removed from the other domains. A total of 22 items across four dimensions were retained to form the final version of the frailty screening scale, as shown in Table 3 Table 3 Final items of the frailty screening scale for community-dwelling older adults Category Items Physiological performance 1. Conduct a 4-meter walking test at usual walking speed. The cut-off value is determined based on the weakening phenotype standard: (1) Male: height ≤ 173 cm − 7 s; height > 173 cm − 6 s (2) Female: height ≤ 159 cm − 7 s; height > 159 cm − 6 s 2. Perform a grip strength test on the dominant hand using a grip device for three trials and record the maximum value. The cut-off value is determined based on the weakening phenotype standard: (1) Male: BMI ≤ 24–29 kg; BMI 24.1–26–30 kg; BMI 26.1–28–31 kg; BMI > 28–32 kg (2) Female: BMI ≤ 23–17 kg; BMI 23.1–26–17.3 kg; BMI 26.1–29–18 kg; BMI > 29–21 kg 5. Which physical activities do you engage in weekly, such as walking, jogging, swimming, cycling, etc.? How many hours per week do you spend on each activity? Calculate the daily energy expenditure based on the answers. The cut-off value is determined based on the debilitating phenotype standard: (1) Male − 380 kcal; Female − 270 kcal 7. Have you experienced a reduction in food intake in the past three months due to poor appetite, digestive problems, chewing difficulties, or swallowing difficulties? 8. Which of the following tasks can you complete independently without assistance from others? The use of assistive resources, such as crutches or walking aids, is considered independent: (1) Putting on or taking off clothes (2) Using the bathroom (3) Performing heavy physical work, such as cleaning windows and mopping the floor (4) Climbing two flights of stairs (5) Walking 1000 m 9. Are there any physical conditions that limit your ability to leave your home? 10. Have you been diagnosed with more than five diseases by a medical professional, including but not limited to: (1) Hypertension (2) Diabetes (3) Cancer (excluding skin cancer) (4) Chronic lung disease (5) Heart failure (6) Angina pectoris (7) Asthma (8) Arthritis (9) Stroke (10) Nephrosis 11. Have you experienced fatigue in the past month? Have you been unable to complete tasks that you were previously able to accomplish? 12. Have you experienced difficulty in recovering your strength fully after fatigue in the past month? Mental health 1. In the previous month, have you experienced a loss of self-confidence and felt incapable of achieving anything? 3. Have you experienced feelings of nervousness or anxiety in the previous month? 4. In the previous month, have you engaged in any activities that used to bring you joy, but no longer do? Social vulnerability 3. Do you live alone? If so, do you miss the presence of family and friends? 4. Do you have someone in your life whom you trust completely? 5. Are you satisfied with your community and living environment? 6. Do you frequently experience feelings of rejection from others? 2. Do you manage your own bank account? 3. Have you experienced a fall in the past year? Other function 4. Do you have concerns about falling while walking? 6.How many types of medication are you currently taking? 7. Do you frequently forget to take your prescribed medication? 8. Are you able to prepare your own meals three times a day? Discussion Frailty is a multidimensional syndrome increasingly recognized in geriatric care, yet current screening tools vary widely in structure, diagnostic performance, and contextual suitability [ 2 34 35 36 37 38 39 40 33 1 Fig. 1 Flowchart of the Delphi Process for Developing Frailty Screening Scale for Community-Dwelling Older Adults in China Based on the findings of the systematic review, we extracted high-frequency and high-relevance items from existing tools to develop the initial list for the Delphi process. The Delphi panel consisted of 16 experts with diverse backgrounds, including geriatricians, clinical epidemiologists, public health researchers, and community healthcare practitioners. Most participants were senior academics with over 10 years of experience in their respective fields, contributing to the credibility and representativeness of the consensus process. After two rounds of expert consultation, a total of 22 items were retained. These items broadly covered major frailty domains, including physical function, nutrition, psychological well-being, functional status, fall risk, multimorbidity, polypharmacy, medication adherence, and social vulnerability. Most of the retained items also appeared frequently in the reviewed tools, indicating good consistency between literature-based evidence and expert clinical judgment. In the setting of community screening, it may be argued that a high degree of specificity is important because those who have been screened positive will be referred for more detailed assessment, and a low false positive value is important in avoiding waste of resources [ 41 The FRAIL scale is widely used due to a high degree of specificity, yet primarily focus on physical deficits and comorbidity, with limited coverage of psychological and social domains [ 42 43 44 33 41 The Groningen Frailty Indicator (GFI), though broader in dimensional coverage, is relatively lengthy and relies heavily on subjective responses, reducing feasibility in fast-paced community workflows [ 45 46 48 More recently, the Chinese Frailty Screening Scale (CFSS-10) was developed based on the ICOPE framework and tested among community-dwelling older adults in Shanghai [ 24 24 49 In contrast, the FSS was specifically designed for Chinese community screening through a two-phase process: evidence-based item selection via meta-analysis and local contextual refinement through a Delphi expert panel. It integrates physical, psychological, nutritional, functional, and social domains within a concise 22-item format, balancing multidimensional assessment with ease of administration. The item was simplified and tested for clarity among older adults, ensuring linguistic accessibility. Owing to this comprehensive, culturally-informed item generation and evidence-based development, the FSS is theoretically designed to possess superior overall structural validity compared to some existing scales [ 24 25 32 40 This study has several notable strengths. To our knowledge, it is the first to systematically incorporate findings from diagnostic accuracy meta-analyses into the item selection process for frailty tool development. This evidence-based approach ensured that the resulting item pool was grounded in empirical performance rather than only expert opinion. In addition, the Delphi panel included experts from geriatrics, clinical epidemiology, public health, and community care, providing a multidisciplinary perspective. The response rate across both Delphi rounds was 100%, enhancing the credibility and consistency of the consensus process. Nonetheless, several limitations should be acknowledged. Firstly, while our Delphi consensus process was rigorous, it did not directly incorporate insights from frontline community health workers or the older adults themselves. These stakeholders’ perspectives could enhance the understanding of real-world feasibility and acceptability. Secondly, despite its evidence-based development, the FSS has not yet undergone comprehensive real-world validation. Validation studies, including direct comparisons with established frailty scales, are necessary to confirm its effectiveness and utility. Finally, the FSS was developed based on data from specific regions or populations, which may not fully reflect the socioeconomic, cultural, and regional diversity across China, such as differences between rural and urban communities or among ethnic minority groups. This constraint may hinder the scale’s generalizability and nationwide applicability. Further studies are needed to assess its performance across varied Chinese populations to enhance its broader relevance. Conclusions This study developed a frailty screening scale tailored for community-dwelling older adults in China, using a two-phase approach that integrated diagnostic accuracy evidence and expert consensus. While preliminary findings suggest its potential as an effective screening tool, further validation is needed to confirm its reliability, predictive validity, and applicability across diverse Chinese populations. Therefore, we encourage this promising tool to be used for further verification and generalization. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2  Supplementary Material 3  Supplementary Material 4 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We would like to express our sincere gratitude to all experts who participated in the Delphi process for their valuable time and insights. Additionally, we would like to express our appreciation to the staff of the China National Geriatric Disease Clinical Research Center for their invaluable support throughout the study. Author contributions Yuhui Zhang and Deying Kang designed the study; Qin Wang and Yuhui Zhang collected the data; Yuhui Zhang analyzed the data; Qin Wang, Yuhui Zhang, Li Li, Chongyang Zhao, Jia Song, Xin Zhang, Hongmei Wu, and Deying Kang interpreted the results; and all authors (Qin Wang, Yuhui Zhang, Li Li, Chongyang Zhao, Jia Song, Xin Zhang, Hongmei Wu, Deying Kang) contributed to the writing and review of the paper. Funding This study was supported by 1.3.5 project for disciplines of excellence, West China Hospital, Sichuan University (ZYGD23002) and National Clinical Research Center for Geriatrics, West China Hospital, Sichuan University (Z20192005). Data availability The datasets generated and analyzed during the current study are available from the corresponding author with reasonable request. Declarations Ethics approval and consent to participate This study was approved by the Ethics Committee of West China Hospital, Sichuan University (IRB number: 2019-9-26) and have been executed consistent with ethical standards laid down in the 1964 Declaration of Helsinki and its later amendments. All experts provided informed consent, and their responses were anonymized to maintain confidentiality throughout the Delphi process. Consent for publication Not applicable. Competing interests The authors declare no competing interests. Abbreviations Ca Judgment basis CFS Clinical Frailty Scale CFSS-10 Chinese Frailty Screening Scale CGA Comprehensive Geriatric Assessment Cr Authority coefficient Cs Familiarity degree CV Coefficient of variation CVSFS Social Frailty Scale for Chinese Older Adults EFS Edmonton Frail Scale FP Fried frailty phenotype FI Frailty Index FSS Frailty Screening Scale FRAIL Scale Fatigue, Resistance, Ambulation, Illnesses, and Loss of Weight Scale GFI Groningen Frailty Indicator JFS Japan Frailty Scale JFS-C the Chinese version of the Japan Frailty Scale PRISMA-7 Program of Research to Integrate Services for the Maintenance of Autonomy 7 PROSPERO International Prospective Register of Systematic Reviews TFI Tilburg frailty indictor W Kendall’s Coefficient of Concordance References 1. Rockwood K Song X MacKnight C Bergman H Hogan DB McDowell I A global clinical measure of fitness and frailty in elderly people CMAJ 2005 173 489 95 10.1503/cmaj.050051 16129869 PMC1188185 Rockwood K, Song X, MacKnight C, Bergman H, Hogan DB, McDowell I, et al. A global clinical measure of fitness and frailty in elderly people. CMAJ. 2005;173:489–95. 16129869 10.1503/cmaj.050051 PMC1188185 2. Fried LP Tangen CM Walston J Newman AB Hirsch C Gottdiener J Frailty in older adults: evidence for a phenotype J Gerontol Biol Sci Med Sci 2001 56 M146 56 10.1093/gerona/56.3.M146 11253156 Fried LP, Tangen CM, Walston J, Newman AB, Hirsch C, Gottdiener J, et al. Frailty in older adults: evidence for a phenotype. J Gerontol Biol Sci Med Sci. 2001;56:M146–56. 10.1093/gerona/56.3.m146 11253156 3. Clegg A Young J Iliffe S Rikkert MO Rockwood K Frailty in elderly people Lancet 2013 381 752 62 10.1016/S0140-6736(12)62167-9 23395245 PMC4098658 Clegg A, Young J, Iliffe S, Rikkert MO, Rockwood K. Frailty in elderly people. Lancet. 2013;381:752–62. 23395245 10.1016/S0140-6736(12)62167-9 PMC4098658 4. Lin H-S Watts JN Peel NM Hubbard RE Frailty and post-operative outcomes in older surgical patients: a systematic review BMC Geriatr 2016 16 157 10.1186/s12877-016-0329-8 27580947 PMC5007853 Lin H-S, Watts JN, Peel NM, Hubbard RE. Frailty and post-operative outcomes in older surgical patients: a systematic review. BMC Geriatr. 2016;16:157. 27580947 10.1186/s12877-016-0329-8 PMC5007853 5. Zhang J Qiu Y Zhang H Fan Y Impact of frailty on adverse outcomes in patients with abdominal aortic aneurysm undergoing surgery: a systematic review and meta-analysis J Nutr Health Aging 2024 28 100213 10.1016/j.jnha.2024.100213 38489993 Zhang J, Qiu Y, Zhang H, Fan Y. Impact of frailty on adverse outcomes in patients with abdominal aortic aneurysm undergoing surgery: a systematic review and meta-analysis. J Nutr Health Aging. 2024;28:100213. 38489993 10.1016/j.jnha.2024.100213 6. Feng Z Glinskaya E Chen H Gong S Qiu Y Xu J Long-term care system for older adults in China: policy landscape, challenges, and future prospects Lancet 2020 396 1362 72 10.1016/S0140-6736(20)32136-X 34338215 Feng Z, Glinskaya E, Chen H, Gong S, Qiu Y, Xu J, et al. Long-term care system for older adults in China: policy landscape, challenges, and future prospects. Lancet. 2020;396:1362–72. 34338215 10.1016/S0140-6736(20)32136-X 7. Lobanov-Rostovsky S He Q Chen Y Liu Y Wu Y Liu Y Growing old in China in socioeconomic and epidemiological context: systematic review of social care policy for older people BMC Public Health 2023 23 1272 10.1186/s12889-023-15583-1 37391766 PMC10311713 Lobanov-Rostovsky S, He Q, Chen Y, Liu Y, Wu Y, Liu Y, et al. Growing old in China in socioeconomic and epidemiological context: systematic review of social care policy for older people. BMC Public Health. 2023;23:1272. 37391766 10.1186/s12889-023-15583-1 PMC10311713 8. van Dam CS Hoogendijk EO Mooijaart SP Smulders YM de Vet RCW Lucke JA A narrative review of frailty assessment in older patients at the emergency department Eur J Emerg Med 2021 28 266 76 10.1097/MEJ.0000000000000811 33883392 van Dam CS, Hoogendijk EO, Mooijaart SP, Smulders YM, de Vet RCW, Lucke JA, et al. A narrative review of frailty assessment in older patients at the emergency department. Eur J Emerg Med. 2021;28:266–76. 33883392 10.1097/MEJ.0000000000000811 9. Taniguchi Y Kitamura A Hata T Fujita K Abe T Nofuji Y Frailty trajectories and its associated factors in Japanese older adults J Frailty Aging 2024 13 233 9 10.14283/jfa.2024.51 39082767 Taniguchi Y, Kitamura A, Hata T, Fujita K, Abe T, Nofuji Y, et al. Frailty trajectories and its associated factors in Japanese older adults. J Frailty Aging. 2024;13:233–9. 39082767 10.14283/jfa.2024.51 10. Nerobkova N Park YS Park E-C Shin J Frailty transition and depression among community-dwelling older adults: the Korean longitudinal study of aging (2006–2020) BMC Geriatr 2023 23 148 10.1186/s12877-022-03570-x 36932383 PMC10024357 Nerobkova N, Park YS, Park E-C, Shin J. Frailty transition and depression among community-dwelling older adults: the Korean longitudinal study of aging (2006–2020). BMC Geriatr. 2023;23:148. 36932383 10.1186/s12877-022-03570-x PMC10024357 11. Kojima G Taniguchi Y Iliffe S Jivraj S Walters K Transitions between frailty States among community-dwelling older people: A systematic review and meta-analysis Ageing Res Rev 2019 50 81 8 10.1016/j.arr.2019.01.010 30659942 Kojima G, Taniguchi Y, Iliffe S, Jivraj S, Walters K. Transitions between frailty States among community-dwelling older people: A systematic review and meta-analysis. Ageing Res Rev. 2019;50:81–8. 30659942 10.1016/j.arr.2019.01.010 12. Zhao X Zhu R Chen Q He J Effect of frailty status on mortality risk among Chinese community-dwelling older adults: a prospective cohort study BMC Geriatr 2023 23 150 10.1186/s12877-023-03759-8 36934220 PMC10024402 Zhao X, Zhu R, Chen Q, He J. Effect of frailty status on mortality risk among Chinese community-dwelling older adults: a prospective cohort study. BMC Geriatr. 2023;23:150. 36934220 10.1186/s12877-023-03759-8 PMC10024402 13. Hiltunen K Saarela RKT Kautiainen H Roitto H-M Pitkälä KH Mäntylä P Relationship between fried’s frailty phenotype and oral frailty in long-term care residents Age Ageing 2021 50 2133 9 10.1093/ageing/afab177 34473831 PMC8581380 Hiltunen K, Saarela RKT, Kautiainen H, Roitto H-M, Pitkälä KH, Mäntylä P. Relationship between fried’s frailty phenotype and oral frailty in long-term care residents. Age Ageing. 2021;50:2133–9. 34473831 10.1093/ageing/afab177 PMC8581380 14. Luo Y Chen Y Wang K De Fries CM Huang Z Xu H Associations between multimorbidity and frailty transitions among older Americans J Cachexia Sarcopenia Muscle 2023 14 1075 82 10.1002/jcsm.13197 36852679 PMC10067509 Luo Y, Chen Y, Wang K, De Fries CM, Huang Z, Xu H, et al. Associations between multimorbidity and frailty transitions among older Americans. J Cachexia Sarcopenia Muscle. 2023;14:1075–82. 36852679 10.1002/jcsm.13197 PMC10067509 15. Matsue Y Kamiya K Saito H Saito K Ogasahara Y Maekawa E Prevalence and prognostic impact of the coexistence of multiple frailty domains in elderly patients with heart failure: the FRAGILE-HF cohort study Eur J Heart Fail 2020 22 2112 9 10.1002/ejhf.1926 32500539 Matsue Y, Kamiya K, Saito H, Saito K, Ogasahara Y, Maekawa E, et al. Prevalence and prognostic impact of the coexistence of multiple frailty domains in elderly patients with heart failure: the FRAGILE-HF cohort study. Eur J Heart Fail. 2020;22:2112–9. 32500539 10.1002/ejhf.1926 16. Kojima G Iliffe S Walters K Frailty index as a predictor of mortality: a systematic review and meta-analysis Age Ageing 2018 47 193 200 10.1093/ageing/afx162 29040347 Kojima G, Iliffe S, Walters K. Frailty index as a predictor of mortality: a systematic review and meta-analysis. Age Ageing. 2018;47:193–200. 29040347 10.1093/ageing/afx162 17. Shi SM Olivieri-Mui B McCarthy EP Kim DH Changes in a frailty index and association with mortality J Am Geriatr Soc 2021 69 1057 62 10.1111/jgs.17002 33377190 PMC8071066 Shi SM, Olivieri-Mui B, McCarthy EP, Kim DH. Changes in a frailty index and association with mortality. J Am Geriatr Soc. 2021;69:1057–62. 33377190 10.1111/jgs.17002 PMC8071066 18. Palliyaguru DL Moats JM Di Germanio C Bernier M de Cabo R Frailty index as a biomarker of lifespan and healthspan: focus on pharmacological interventions Mech Ageing Dev 2019 180 42 8 10.1016/j.mad.2019.03.005 30926563 PMC7307802 Palliyaguru DL, Moats JM, Di Germanio C, Bernier M, de Cabo R. Frailty index as a biomarker of lifespan and healthspan: focus on pharmacological interventions. Mech Ageing Dev. 2019;180:42–8. 30926563 10.1016/j.mad.2019.03.005 PMC7307802 19. Parker SG McCue P Phelps K McCleod A Arora S Nockels K What is comprehensive geriatric assessment (CGA)? An umbrella review Age Ageing 2018 47 149 55 10.1093/ageing/afx166 29206906 Parker SG, McCue P, Phelps K, McCleod A, Arora S, Nockels K, et al. What is comprehensive geriatric assessment (CGA)? An umbrella review. Age Ageing. 2018;47:149–55. 29206906 10.1093/ageing/afx166 20. Hernandez Torres C Hsu T Comprehensive geriatric assessment in the older adult with cancer: a review Eur Urol Focus 2017 3 330 9 10.1016/j.euf.2017.10.010 29331624 Hernandez Torres C, Hsu T. Comprehensive geriatric assessment in the older adult with cancer: a review. Eur Urol Focus. 2017;3:330–9. 29331624 10.1016/j.euf.2017.10.010 21. Palmer K Onder G Comprehensive geriatric assessment: benefits and limitations Eur J Intern Med 2018 54 e8 9 10.1016/j.ejim.2018.02.016 29472049 Palmer K, Onder G. Comprehensive geriatric assessment: benefits and limitations. Eur J Intern Med. 2018;54:e8–9. 29472049 10.1016/j.ejim.2018.02.016 22. Rolfson DB Majumdar SR Tsuyuki RT Tahir A Rockwood K Validity and reliability of the Edmonton frail scale Age Ageing 2006 35 5 526 9 10.1093/ageing/afl041 16757522 PMC5955195 Rolfson DB, Majumdar SR, Tsuyuki RT, Tahir A, Rockwood K. Validity and reliability of the Edmonton frail scale. Age Ageing. 2006;35(5):526–9. 16757522 10.1093/ageing/afl041 PMC5955195 23. Nishijima TF Esaki T Morita M Toh Y Preoperative frailty assessment with the Robinson frailty score, Edmonton frail scale, and G8 and adverse postoperative outcomes in older surgical patients with cancer Eur J Surg Oncol: J Eur Soc Surg Oncol Br Assoc Surg Oncol 2021 47 896 901 10.1016/j.ejso.2020.09.031 33036830 Nishijima TF, Esaki T, Morita M, Toh Y. Preoperative frailty assessment with the Robinson frailty score, Edmonton frail scale, and G8 and adverse postoperative outcomes in older surgical patients with cancer. Eur J Surg Oncol: J Eur Soc Surg Oncol Br Assoc Surg Oncol. 2021;47:896–901. 10.1016/j.ejso.2020.09.031 33036830 24. Ye B Wang Y Chen H Chen Y Yan H Fu H Development and validation of the Chinese frailty screening scale: A study among community-dwelling older adults in Shanghai IJERPH 2022 19 11811 10.3390/ijerph191811811 36142085 PMC9517433 Ye B, Wang Y, Chen H, Chen Y, Yan H, Fu H, et al. Development and validation of the Chinese frailty screening scale: A study among community-dwelling older adults in Shanghai. IJERPH. 2022;19:11811. 36142085 10.3390/ijerph191811811 PMC9517433 25. Qiao X Wang C Tian X Dong L Liu N Jin Y Cross-cultural adaptation and validation of the comprehensive frailty assessment instrument in Chinese community‐dwelling older adults Geriatr Gerontol Int 2018 18 301 7 10.1111/ggi.13183 29052953 Qiao X, Wang C, Tian X, Dong L, Liu N, Jin Y, et al. Cross-cultural adaptation and validation of the comprehensive frailty assessment instrument in Chinese community‐dwelling older adults. Geriatr Gerontol Int. 2018;18:301–7. 29052953 10.1111/ggi.13183 26. Ning N Fan X Zhang Y Wang Y Liu Y Li Y Joint association of cardiovascular health and frailty with all-cause and cause-specific mortality: a prospective study Age Ageing 2024 53 afae156 10.1093/ageing/afae156 39041735 Ning N, Fan X, Zhang Y, Wang Y, Liu Y, Li Y, et al. Joint association of cardiovascular health and frailty with all-cause and cause-specific mortality: a prospective study. Age Ageing. 2024;53:afae156. 39041735 10.1093/ageing/afae156 27. Zhang X-H Yang Y Zhang C-M Luo R-Z Liu Y-H Development of a frailty scale for elderly people in China Chin Nurs Res 2017 4 64 70 10.1016/j.cnre.2017.06.003 Zhang X-H, Yang Y, Zhang C-M, Luo R-Z, Liu Y-H. Development of a frailty scale for elderly people in China. Chin Nurs Res. 2017;4:64–70. 28. Fan J Yu C Guo Y Bian Z Sun Z Yang L Frailty index and all-cause and cause-specific mortality in Chinese adults: a prospective cohort study Lancet Public Health 2020 5 e650 60 10.1016/S2468-2667(20)30113-4 33271078 PMC7708389 Fan J, Yu C, Guo Y, Bian Z, Sun Z, Yang L, et al. Frailty index and all-cause and cause-specific mortality in Chinese adults: a prospective cohort study. Lancet Public Health. 2020;5:e650–60. 33271078 10.1016/S2468-2667(20)30113-4 PMC7708389 29. Woo J Yu R Wong M Yeung F Wong M Lum C Frailty screening in the community using the FRAIL scale J Am Med Dir Assoc 2015 16 412 9 10.1016/j.jamda.2015.01.087 25732832 Woo J, Yu R, Wong M, Yeung F, Wong M, Lum C. Frailty screening in the community using the FRAIL scale. J Am Med Dir Assoc. 2015;16:412–9. 25732832 10.1016/j.jamda.2015.01.087 30. Vo NT, Tu YK, Lin KC, Chiu HY, Huang HC. Diagnostic Accuracy of the FRAIL Scale, Groningen Frailty Indicator, Tilburg Frailty Indicator, and PRISMA-7 for Frailty Screening Among Older Adults in Community Settings: A Systematic Review and Network Meta-Analysis. Gerontologist. 2024;64(6):gnae008. 10.1093/geront/gnae008 38332716 31. Dong L Liu N Tian X Qiao X Gobbens RJJ Kane RL Reliability and validity of the Tilburg frailty indicator (TFI) among Chinese community-dwelling older people Arch Gerontol Geriatr 2017 73 21 8 10.1016/j.archger.2017.07.001 28734173 Dong L, Liu N, Tian X, Qiao X, Gobbens RJJ, Kane RL, et al. Reliability and validity of the Tilburg frailty indicator (TFI) among Chinese community-dwelling older people. Arch Gerontol Geriatr. 2017;73:21–8. 28734173 10.1016/j.archger.2017.07.001 32. Tian X Qiao X Dong L Liu N Si H Jin Y Cross-cultural adaptation and psychometric properties of the Groningen frailty indicator (GFI) among Chinese community-dwelling older adults Geriatr Nurs 2020 41 236 41 10.1016/j.gerinurse.2019.10.002 31668460 Tian X, Qiao X, Dong L, Liu N, Si H, Jin Y, et al. Cross-cultural adaptation and psychometric properties of the Groningen frailty indicator (GFI) among Chinese community-dwelling older adults. Geriatr Nurs. 2020;41:236–41. 31668460 10.1016/j.gerinurse.2019.10.002 33. Si H Jin Y Qiao X Tian X Liu X Wang C Comparison of 6 frailty screening tools in diagnostic properties among Chinese community-dwelling older people Geriatr Nurs 2021 42 276 82 10.1016/j.gerinurse.2020.08.017 32948340 Si H, Jin Y, Qiao X, Tian X, Liu X, Wang C. Comparison of 6 frailty screening tools in diagnostic properties among Chinese community-dwelling older people. Geriatr Nurs. 2021;42:276–82. 32948340 10.1016/j.gerinurse.2020.08.017 34. Church S Rogers E Rockwood K Theou O A scoping review of the clinical frailty scale BMC Geriatr 2020 20 393 10.1186/s12877-020-01801-7 33028215 PMC7540438 Church S, Rogers E, Rockwood K, Theou O. A scoping review of the clinical frailty scale. BMC Geriatr. 2020;20:393. 33028215 10.1186/s12877-020-01801-7 PMC7540438 35. Parker G Gladstone G Chee KT Depression in the planet’s largest ethnic group: the Chinese Am J Psychiatry 2001 158 857 64 10.1176/appi.ajp.158.6.857 11384889 Parker G, Gladstone G, Chee KT. Depression in the planet’s largest ethnic group: the Chinese. Am J Psychiatry. 2001;158:857–64. 11384889 10.1176/appi.ajp.158.6.857 36. Zhao M Mou H Zhu S Li M Wang K Cross-cultural adaptation and validation of the FRAIL-NH scale for Chinese nursing home residents: a methodological and cross-sectional study Int J Nurs Stud 2020 105 103556 10.1016/j.ijnurstu.2020.103556 32199149 Zhao M, Mou H, Zhu S, Li M, Wang K. Cross-cultural adaptation and validation of the FRAIL-NH scale for Chinese nursing home residents: a methodological and cross-sectional study. Int J Nurs Stud. 2020;105:103556. 32199149 10.1016/j.ijnurstu.2020.103556 37. He H Pan L Wang D Liu F Du J Pa L Normative values of hand grip strength in a large unselected Chinese population: evidence from the China National health survey J Cachexia Sarcopenia Muscle 2023 14 1312 21 10.1002/jcsm.13223 36999522 PMC10235885 He H, Pan L, Wang D, Liu F, Du J, Pa L, et al. Normative values of hand grip strength in a large unselected Chinese population: evidence from the China National health survey. J Cachexia Sarcopenia Muscle. 2023;14:1312–21. 36999522 10.1002/jcsm.13223 PMC10235885 38. Ge S Du Q Feng X Liu Y Wang H Hai S Optimal cutoffs for the diagnosis of sarcopenia in older Chinese adults Front Nutr 2022 9 853323 10.3389/fnut.2022.853323 35866082 PMC9294727 Ge S, Du Q, Feng X, Liu Y, Wang H, Hai S, et al. Optimal cutoffs for the diagnosis of sarcopenia in older Chinese adults. Front Nutr. 2022;9:853323. 35866082 10.3389/fnut.2022.853323 PMC9294727 39. Lee DTS Kleinman J Kleinman A Rethinking depression: an ethnographic study of the experiences of depression among Chinese Harv Rev Psychiatry 2007 15 1 8 10.1080/10673220601183915 17364968 Lee DTS, Kleinman J, Kleinman A. Rethinking depression: an ethnographic study of the experiences of depression among Chinese. Harv Rev Psychiatry. 2007;15:1–8. 17364968 10.1080/10673220601183915 40. Uchmanowicz I Jankowska-Polańska B Łoboz-Rudnicka M Manulik S Łoboz-Grudzień K Gobbens RJJ Cross-cultural adaptation and reliability testing of the Tilburg frailty indicator for optimizing care of Polish patients with frailty syndrome Clin Interv Aging 2014 9 997 1001 10.2147/CIA.S64853 25028543 PMC4077386 Uchmanowicz I, Jankowska-Polańska B, Łoboz-Rudnicka M, Manulik S, Łoboz-Grudzień K, Gobbens RJJ. Cross-cultural adaptation and reliability testing of the Tilburg frailty indicator for optimizing care of Polish patients with frailty syndrome. Clin Interv Aging. 2014;9:997–1001. 25028543 10.2147/CIA.S64853 PMC4077386 41. Zeng L Kong L-N Fang Q Wang W-X Fan J-L Zhang X-Q-Y Diagnostic accuracy of the FRAIL scale for frailty screening in community-dwelling older adults with diabetes: a cross-sectional study Geriatr Nurs 2023 52 115 20 10.1016/j.gerinurse.2023.05.011 37290216 Zeng L, Kong L-N, Fang Q, Wang W-X, Fan J-L, Zhang X-Q-Y, et al. Diagnostic accuracy of the FRAIL scale for frailty screening in community-dwelling older adults with diabetes: a cross-sectional study. Geriatr Nurs. 2023;52:115–20. 37290216 10.1016/j.gerinurse.2023.05.011 42. Vo NT Tu Y-K Lin K-C Chiu H-Y Huang H-C Diagnostic accuracy of the FRAIL scale, Groningen frailty indicator, Tilburg frailty indicator, and PRISMA-7 for frailty screening among older adults in community settings: a systematic review and network meta-analysis Gerontologist 2024 64 gnae008 10.1093/geront/gnae008 38332716 Vo NT, Tu Y-K, Lin K-C, Chiu H-Y, Huang H-C. Diagnostic accuracy of the FRAIL scale, Groningen frailty indicator, Tilburg frailty indicator, and PRISMA-7 for frailty screening among older adults in community settings: a systematic review and network meta-analysis. Gerontologist. 2024;64:gnae008. 38332716 10.1093/geront/gnae008 43. Yeung MT Gan Y Teo SQ Lim KQ Leow HX Jbabdi M The Chinese translation and cross-cultural adaptation of PRISMA-7 questionnaire: an observational study to establish the accuracy, reliability and validity BMC Geriatr 2024 24 204 10.1186/s12877-024-04825-5 38418958 PMC10900580 Yeung MT, Gan Y, Teo SQ, Lim KQ, Leow HX, Jbabdi M, et al. The Chinese translation and cross-cultural adaptation of PRISMA-7 questionnaire: an observational study to establish the accuracy, reliability and validity. BMC Geriatr. 2024;24:204. 38418958 10.1186/s12877-024-04825-5 PMC10900580 44. Sukkriang N Punsawad C Comparison of geriatric assessment tools for frailty among community elderly Heliyon 2020 6 e04797 10.1016/j.heliyon.2020.e04797 32964152 PMC7490815 Sukkriang N, Punsawad C. Comparison of geriatric assessment tools for frailty among community elderly. Heliyon. 2020;6:e04797. 32964152 10.1016/j.heliyon.2020.e04797 PMC7490815 45. Mascarella MA Vendra V Sultanem K Tsien C Shenouda G Sridharan S Predicting short-term treatment toxicity in head and neck cancer through a systematic review and meta-analysis J Geriatr Oncol 2024 15 102064 10.1016/j.jgo.2024.102064 39271411 Mascarella MA, Vendra V, Sultanem K, Tsien C, Shenouda G, Sridharan S, et al. Predicting short-term treatment toxicity in head and neck cancer through a systematic review and meta-analysis. J Geriatr Oncol. 2024;15:102064. 39271411 10.1016/j.jgo.2024.102064 46. Chou Y-C Tsou H-H Chan D-CD Wen C-J Lu F-P Lin K-P Validation of clinical frailty scale in Chinese translation BMC Geriatr 2022 22 604 10.1186/s12877-022-03287-x 35858829 PMC9298166 Chou Y-C, Tsou H-H, Chan D-CD, Wen C-J, Lu F-P, Lin K-P, et al. Validation of clinical frailty scale in Chinese translation. BMC Geriatr. 2022;22:604. 35858829 10.1186/s12877-022-03287-x PMC9298166 47. Moloney E O’Donovan MR Sezgin D Flanagan E McGrath K Timmons S Diagnostic accuracy of frailty screening instruments validated for use among older adults attending emergency departments: a systematic review and meta-analysis IJERPH 2023 20 6280 10.3390/ijerph20136280 37444127 PMC10341387 Moloney E, O’Donovan MR, Sezgin D, Flanagan E, McGrath K, Timmons S, et al. Diagnostic accuracy of frailty screening instruments validated for use among older adults attending emergency departments: a systematic review and meta-analysis. IJERPH. 2023;20:6280. 37444127 10.3390/ijerph20136280 PMC10341387 48. Wan D Wang R Wei J Zan Q Shang L Ma J Translation and validation of the Chinese version of the Japan frailty scale Front Med 2023 10 1257223 10.3389/fmed.2023.1257223 PMC10569688 37841012 Wan D, Wang R, Wei J, Zan Q, Shang L, Ma J, et al. Translation and validation of the Chinese version of the Japan frailty scale. Front Med. 2023;10:1257223. 10.3389/fmed.2023.1257223 PMC10569688 37841012 49. Hou C Gong X Bai D Ji W Chen H Lu X Development and validation of the social frailty scale for the older adult in China Front Public Health 2025 13 1562211 10.3389/fpubh.2025.1562211 40265073 PMC12013530 Hou C, Gong X, Bai D, Ji W, Chen H, Lu X, et al. Development and validation of the social frailty scale for the older adult in China. Front Public Health. 2025;13:1562211. 40265073 10.3389/fpubh.2025.1562211 PMC12013530 ",
  "metadata": {
    "Title of this paper": "Development and validation of the social frailty scale for the older adult in China",
    "Journal it was published in:": "BMC Geriatrics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482252/"
  }
}