{
  "title": "Paper_678",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12480846 PMC12480846.1 12480846 12480846 41023031 10.1038/s41598-025-17653-3 17653 1 Article Adaptive immune responses associated with the progression of premalignant lesions to colorectal cancer Chen Zhishan 1 Kim Dongwoo 2 Wang Jifeng 1 Huang Qiongyi 3 Gao Yaohui 3 Zheng Jiayi 3 Lyu Linshuoshuo 1 Li Yinying 3 Lu Ling 3 Xie Ruting 3 Kim Jung Sun 4 Lim Ah-Reum 4 Lee Se Ryeon 4 Park Jinny 4 Sung Hwa Jung 4 Han Dongyan han_dongyan@163.com 3 http://orcid.org/0000-0001-5269-1294 Guo Xingyi xingyi.guo@vumc.org 1 5 http://orcid.org/0000-0001-9534-0400 Choi Jungyoon choijy1905@gmail.com 4 1 https://ror.org/05dq2gs74 grid.412807.8 0000 0004 1936 9916 Division of Epidemiology, Department of Medicine, Vanderbilt Epidemiology Center, Vanderbilt-Ingram Cancer Center, Vanderbilt University Medical Center, 2 https://ror.org/05yp5js06 0000 0004 1798 3859 Division of Gastroenterology and Hepatology, Department of Internal Medicine, Korea University Ansan Hospital, Korea University College of Medicine, 3 https://ror.org/03vjkf643 grid.412538.9 0000 0004 0527 0050 Department of Pathology, Shanghai Tenth People’s Hospital Affiliated to Tongji University, 4 https://ror.org/05yp5js06 0000 0004 1798 3859 Division of Oncology/Hematology, Department of Internal Medicine, Korea University Ansan Hospital, Korea University College of Medicine, 5 https://ror.org/05dq2gs74 grid.412807.8 0000 0004 1936 9916 Department of Biomedical Informatics, Vanderbilt University Medical Center, 29 9 2025 2025 15 478255 33369 24 2 2025 26 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Immune response during the progression of premalignant lesions and their molecular subtype to colorectal cancer (CRC) remains unclear. Using gene expression data from 135 normal (NLs), 176 conventional adenomas (AD), 42 serrated polyps (SER), and 2760 CRC samples, we estimated overall immune activity (ImmuneScore) and tumor-infiltrating lymphocyte (TIL) abundance using the xCell tool. We evaluated association of the ImmuneScore and TILs with CRC progression using adjusted multivariable regression models. Immunohistochemistry (IHC) staining for five immunological markers was conducted on NL, early- and late-stage AD, and carcinoma tissues from 75 study participants. The consensus molecular subtypes (CMS) of adenomas and carcinomas were classified using random forest methods, and the association of immune activity with CRC progression was assessed. Immune activity consistently decreased from NLs through premalignant lesions to adenocarcinoma, more prominently in AD than SER (AD vs. NL: odds ratio = 0.86, 95% CI = 0.84‒0.88; SER vs. NL: 0.89, 0.85‒0.93). Similar patterns were observed in B cells, CD4 + effector memory T cells, CD8 + naïve T cells, and CD8 + cytotoxic T cells. IHC staining of these immunological markers verified their roles in CRC progression. Our analysis revealed that CMS3 is a major subtype of AD. Consistently, higher immune activity was observed in premalignant lesions than in CRCs of the CMS3 subtype. This study provides additional insights into alterations in immune response and their important role in CRC premalignant lesion progression and subtypes. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-17653-3. Keywords Adaptive immune response Premalignant lesions Conventional adenoma Serrated polyps Colorectal cancer Subject terms Cancer microenvironment Adaptive immunity National Cancer Institute R37CA227130 Guo Xingyi National Research Foundation of Korea RS-2023-00210034 Choi Jungyoon pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Colorectal cancer (CRC) is the third most commonly diagnosed cancer and the second leading cause of cancer-related deaths worldwide, accounting for over 1.9 million new cases and approximately 935,000 deaths in 2020 alone, according to GLOBOCAN estimates 1 2 5 6 9 APC 3 10 12 KRAS TP53 BRAF APC 13 14 The immune system, particularly tumor-infiltrating lymphocytes (TILs), promotes or suppresses cancer progression by exerting tumor-promoting or -suppressing effects. Bindea et al. demonstrated intratumoral immune cell spatiotemporal dynamics and their association with CRC tumor stage and recurrence 15 16 17 18 20 21 22 8 9 The present study characterized the immune response using large, comprehensive population-based gene expression data from colorectal 135 normal mucosa (NLs), 176 ADs, 42 SERs, and 2760 CRC samples. We evaluated the associations of overall immune activity (ImmuneScore) and TILs with CRC progression using adjusted multivariable linear regression models. We verified five immunological protein markers associated with CRC progression using immunohistochemistry (IHC) staining of NL, early- and late-stage AD, and carcinoma tissues from 75 study participants. We used the random forest method to classify adenoma and carcinoma CMS and examined how the ImmuneScore affected subtype progression to CRC. Our study provides insights into immune response alterations in the tumor microenvironment and biological mechanisms that advance premalignant lesions and their subtypes in CRC. Methods Data collection and processing Supplementary Fig. 1 23 25 http://www.synapse.org 26 Estimating abundance of TILs and evaluating their associations with CRC progression We evaluated abundance of TILs using a gene signature-based xCell approach on the normalized expression matrix 27 To investigate the associations between alterations in abundance of immune cells (as a continuous variable) and CRC progression group (NL, AD, SER, and CRC), we used multivariable linear regression models adjusted for age, sex, and platform. Odds ratios (ORs) and 95% confidence intervals (CIs) were derived from the comparisons of AD vs. NL, SER vs. NL, and CRC vs. NL. P P Similarly, to investigate the association between the abundance of immune cell type-specific genes (as a continuous variable) and CRC progression group, we used multivariable linear regression models adjusted for the covariates mentioned above. ORs and 95% CIs were derived from the same group comparisons as mentioned above. Bonferroni correction established P Experimental verification of TIL levels in NLs, ADs, and CRC using IHC staining We evaluated the expression of CD3+, CD8+, CD20+, CD56+, and programmed death-ligand 1 (PD-L1) in samples representing different stages of NL early-stage and late-stage AD-CRC sequences by IHC using different datasets from the Tenth People’s Hospital affiliated with Tongji University School of Medicine, Shanghai, China. We retrieved the records of 75 patients who underwent endoscopic resection or colorectal surgery at our hospital between January 2018 and March 2019. This study was approved by the Committee of Tenth People’s Hospital, affiliated with Tongji University. All methods were carried out in accordance with relevant guidelines and regulations. Informed consent was obtained from all subjects and/or their legal guardians. Formalin-fixed and paraffin-embedded tissue blocks were collected from the pathological department’s archives at the hospital and categorized as follows: (1) polypoid hyperplasia, (2) low-grade adenoma (early-stage AD), (3) high-grade adenoma (late-stage AD), and (4) adenocarcinoma. All tissue specimens (paraffin-embedded blocks or 5-micron thick slides for IHC analyses) were collected from the archives of the referral pathology departments. Tissue microarray (TMA) blocks were prepared from 75 formalin-fixed paraffin-embedded tissue samples (polypoid hyperplasia, n n n n 28 P 29 CMS classification for colorectal adenoma and CRC A subset of the expression matrices for adenomas and carcinomas was extracted from the normalized expression matrix. The genes were re-mapped to Entrez IDs using the “biomaRt” package in R. The random forest method of the CMS classifier 23 Differentially expression analysis and gene set enrichment analysis Differentially expressed gene (DEG) analyses comparing AD vs. NL, SER vs. NL, CRC vs. NL, CRC vs. AD, CRC vs. SER, and SER vs. AD were conducted using the “limma” package in R, with tissue types and evaluated batches from the “SVA” package for matrix design and linear model fitting. DEGs were significant by a > 1.5-fold change in expression and a false discovery rate (FDR) < 0.05. For pathway enrichment analyses, gene set enrichment analysis (GSEA) was performed on these DEGs using 50 hallmark gene sets, with significant gene sets determined by the Benjamini–Hochberg adjusted P Results Alterations of the immune response in CRC progression We estimated ImmuneScore, StromaScore, MicroenvironmentScore, and TIL abundances for 64 immune cell types using gene expression data from 3,113 samples (135 NLs, 176 ADs, 42 SERs, and 2760 CRCs; Supplementary Table 2). Among these 3 overall scores and 64 immune cell types in the tumor microenvironment, we observed that ImmuneScore, and MicroenvironmentScore, and 27 TILs demonstrated a significant decrease, whereas StromaScore and 20 TILs related to stroma showed a significant increase in correlation with CRC progression in NL-AD-CRC and/or NL-SER-CRC sequences, at a Bonferroni-corrected level (Fig. 1 P 1  Fig. 1 Alterations of the immune response during the progression of premalignant lesions to colorectal cancer ( a P b P Alterations of the immune cell-type-specific genes in CRC progression Trend analyses revealed that 28 out of 40 immune cell type-specific genes significantly decreased, whereas two significantly increased in correlation with CRC progression in NL-AD-CRC and/or NL-SER-CRC sequences, at a Bonferroni-corrected level (Fig. 1 Consistent with the predicted reduction in B cells, a significant decrease in B cell-specific genes ( BLK MS4A1 CD19 HLA-DOB CD8A PRF1 CD2 CD247 CD28 CD3G CD6 IL2RB ZAP70 GZMK GZMH KLRF1 1 CTLA4 BTLA CD244 CD160 PDCD1 Verification of immunological markers in CRC progression using IHC staining A panel of immunoregulatory cell subpopulations, including T (CD3 and CD8) and B (CD20) lymphocytes, NK cells (CD56), and the immune checkpoint molecule PD-L1 was analyzed using IHC staining of tissue samples from 75 study participants (Supplementary Table 5). The percentage of CD3 + cells in the epithelium was significantly lower in high-grade than in low-grade adenomas (Fig. 2 2 P 2 P P P P  Fig. 2 Alteration of immune markers in colorectal cancer progression in samples collected from the Tenth People’s Hospital ( a b Heterogeneity in immune response in different colorectal adenoma subtypes Next, we investigated whether colorectal adenomas elicited a heterogeneous immune response. Based on the aggregated expression data from colorectal adenomas and carcinomas, we first classified colorectal adenomas and carcinomas using random forest from the CMS classifier 23 3 23 3 30 3 3  Fig. 3 The different immune responses observed in different colorectal adenoma subtypes ( a b Biological characterization of the progression of premalignant lesions to CRC A total of 3814 DEGs, including 2051 between NL and AD (3363 between NL and SER) and 462 between AD and CRC (448 between SER and CRC), were identified using a threshold fold change > 1.5 and an FDR < 0.05 (Fig. 4 4  Fig. 4 Comparisons of differentially expressed genes identified among normal colorectal mucosa, adenoma, and carcinoma and their enriched pathways ( a b We identified 26 unique significantly enriched gene sets: five between NL and AD, one between AD and CRC, 11 between NL and SER, one between SER and CRC, and eight between NL and CRC (Fig. 4 Discussion The present study characterized the immune response during the progression of premalignant lesions to CRC by evaluating TIL abundance and comparing immune cell-specific gene expression. To the best of our knowledge, this is the first study to comprehensively compare the immune responses between premalignant lesions and cancers, specifically characterizing adenomas as ADs and SERs, and our study made two major findings. We observed a decreased immune response during the progression of premalignant lesions to CRC; however, this decrease was more prominent in the AD pathway than in the SER pathway. We validated these results for the AD pathway by pathological verification. Second, most premalignant lesions were classified as CMS3 subtypes, with a higher ImmuneScore observed in premalignant lesions than in CRCs within CMS3. Additional differential gene expression analysis suggested that several cancer-related signaling pathways may play a role in the immune response during CRC progression. The transition from immunosurveillance to immunosuppression is crucial for the progression from premalignant to cancerous ones 31 33 34 35 36 A recent study by Chen et al. using single-cell resolution demonstrated different immune microenvironmental features in conventional and serrated polyps 37 Additionally, the upregulation of CTLA-4 expression from NL to adenoma stages suggests an early establishment of immune checkpoint activation. This finding may have clinical implications, as it indicates that immune evasion mechanisms are already initiated during the premalignant phase. CTLA-4 could serve as a potential early biomarker or therapeutic target for immune modulation in high-risk adenomas, warranting further investigation. Similar immune patterns were observed among CMS subtypes of adenoma and carcinoma CMS subtypes. This study classified adenomas (ADs and SERs) following CMS, with most adenoma subtypes classified as CMS3. These proportions of adenoma CMS subtypes were consistent with a previous study by Komor et al. 8 9 38 39 40 41 In addition to CMS classification, some well-known oncogenic and tumor suppressor pathways exhibit significant alterations during the colorectal oncogenic transition. Similarly, a previous study by Elsayed et al. showed that perturbations in the cell cycle and p53 pathways appeared to be notable characteristics of conventional adenoma development in the preadenomatous colon 42 4 4 This study has several limitations. The retrospective nature of the public datasets used may introduce selection bias, and the lack of matched normal–adenoma–tumor pairs from the same individual restricts the interpretation of inter-individual variability. Furthermore, the absence of functional validation limits causal inference. Future studies integrating spatial transcriptomics and prospective clinical validation are warranted to build on these findings. Lastly, although the statistical significance remained robust after applying Bonferroni correction with the current group sample sizes, the marked imbalance in group sizes (e.g., 2,760 CRCs vs. 135 NLs, 176 ADs, and 42 SERs) may have inflated associations related to CRC. Future studies using balanced cohorts and well-annotated mutation profiles and clinical data—including tumor location and stage—will be essential for more nuanced interpretation. In summary, our findings provide novel insights into the alterations in immune responses and related biological mechanisms during the progression of premalignant lesions and their subtypes in CRC. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Zhishan Chen, Dongwoo Kim and Jifeng Wang contributed equally to this work. Acknowledgements Data processing and statistical analysis were conducted at the Advanced Computing Center for Research and Education (ACCRE) at Vanderbilt University. Author contributions Authors’ contributionsZhishan Chen: Conceptualization (lead); Data curation (lead); Formal analysis (lead); Investigation (lead); Writing – original draft (lead); Writing – review and editing (equal).Dongwoo Kim: Conceptualization (lead); Data curation (lead); Formal analysis (lead); Investigation (lead); Writing – review and editing (equal).Jifeng Wang: Conceptualization (lead); Data curation (lead); Formal analysis (lead); Investigation (lead); Writing – original draft (lead); Writing – review and editing (equal).Qiongyi Huang: Data curation (equal); Investigation (equal); Writing – review and editing (equal).Yaohui Gao: Data curation (equal); Investigation (equal); Writing – review and editing (equal).Jiayi Zheng: Data curation (equal); Investigation (equal); Writing – review and editing (equal).Linshuoshuo Lyu: Data curation (equal); Investigation (equal); Writing – review and editing (equal).Yinying Li: Data curation (equal); Investigation (equal); Writing – review and editing (equal).Ling Lu: Data curation (equal); Investigation (equal); Writing – review and editing (equal).Ruting Xie: Data curation (equal); Investigation (equal); Writing – review and editing (equal).Jung Sun Kim: Data curation (equal); Investigation (equal); Writing – review and editing (equal).Ah-Reum Lim: Data curation (equal); Investigation (equal); Writing – review and editing (equal).Se Ryeon Lee: Investigation (equal); Writing – review and editing (equal).Jinny Park: Investigation (equal); Writing – review and editing (equal).Hwa Jung Sung: Data curation (equal); Investigation (equal); Writing – review and editing (equal).Dongyan Han: Conceptualization (equal); Data curation (lead); Investigation (equal); Writing – review and editing (equal).Xingyi Guo: Conceptualization (lead); Data curation (lead); Supervision (lead); Formal analysis (lead); Investigation (lead); Writing – original draft (lead); Writing – review and editing (lead).Jungyoon Choi: Conceptualization (equal); Data curation (equal); Formal analysis (lead); Investigation (lead); Writing: original draft (lead); Writing: review and editing (lead). Funding X. G. received support from the National Cancer Institute (R37CA227130). J. C. received support from the National Research Foundation of Korea (NRF) grant funded by the Korean government (MSIT) (RS-2023-00210034). Data availability Aggregate and anonymized data supporting the findings of this study are available in the article and Supplementary Material. The data supporting the findings of this study are available from the corresponding author (Xingyi Guo). Declarations Competing interests The authors declare no conflicts of interest. The funders had no role in the design of the study; collection, analysis, and interpretation of the data; writing of the manuscript; or the decision to submit the manuscript for publication. All authors had access to the study data. The corresponding author is responsible for the decision to submit this manuscript for publication. References 1. Sung H Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2021 71 209 249 33538338 10.3322/caac.21660 Sung, H. et al. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J. Clin. 71 33538338 10.3322/caac.21660 2. Fearon ER Molecular genetics of colorectal cancer Annu. Rev. Pathol. 2011 6 479 507 10.1146/annurev-pathol-011110-130235 21090969 Fearon, E. R. Molecular genetics of colorectal cancer. Annu. Rev. Pathol. 6 21090969 10.1146/annurev-pathol-011110-130235 3. Fearon ER Vogelstein B A genetic model for colorectal tumorigenesis Cell 1990 61 759 767 10.1016/0092-8674(90)90186-I 2188735 Fearon, E. R. & Vogelstein, B. A genetic model for colorectal tumorigenesis. Cell 61 2188735 10.1016/0092-8674(90)90186-i 4. Markowitz SD Bertagnolli MM Molecular origins of cancer: molecular basis of colorectal cancer N Engl. J. Med. 2009 361 2449 2460 10.1056/NEJMra0804588 20018966 PMC2843693 Markowitz, S. D. & Bertagnolli, M. M. Molecular origins of cancer: molecular basis of colorectal cancer. N Engl. J. Med. 361 20018966 10.1056/NEJMra0804588 PMC2843693 5. Punt CJA Koopman M Vermeulen L From tumour heterogeneity to advances in precision treatment of colorectal cancer Nat. Rev. Clin. Oncol. 2017 14 235 246 10.1038/nrclinonc.2016.171 27922044 Punt, C. J. A., Koopman, M. & Vermeulen, L. From tumour heterogeneity to advances in precision treatment of colorectal cancer. Nat. Rev. Clin. Oncol. 14 27922044 10.1038/nrclinonc.2016.171 6. Borras E Genomic landscape of colorectal mucosa and adenomas Cancer Prev. Res. (Phila) 2016 9 417 427 10.1158/1940-6207.CAPR-16-0081 27221540 PMC4941624 Borras, E. et al. Genomic landscape of colorectal mucosa and adenomas. Cancer Prev. Res. (Phila) 9 27221540 10.1158/1940-6207.CAPR-16-0081 PMC4941624 7. Nikolaev SI A single-nucleotide substitution mutator phenotype revealed by exome sequencing of human colon adenomas Cancer Res. 2012 72 6279 6289 10.1158/0008-5472.CAN-12-3869 23204322 Nikolaev, S. I. et al. A single-nucleotide substitution mutator phenotype revealed by exome sequencing of human colon adenomas. Cancer Res. 72 23204322 10.1158/0008-5472.CAN-12-3869 8. Komor MA Consensus molecular subtype classification of colorectal adenomas J. Pathol. 2018 246 266 276 10.1002/path.5129 29968252 PMC6221003 Komor, M. A. et al. Consensus molecular subtype classification of colorectal adenomas. J. Pathol. 246 29968252 10.1002/path.5129 PMC6221003 9. Chang K Colorectal premalignancy is associated with consensus molecular subtypes 1 and 2 Ann. Oncol. 2018 29 2061 2067 10.1093/annonc/mdy337 30412224 PMC6225810 Chang, K. et al. Colorectal premalignancy is associated with consensus molecular subtypes 1 and 2. Ann. Oncol. 29 30412224 10.1093/annonc/mdy337 PMC6225810 10. Cottrell S Bicknell D Kaklamanis L Bodmer WF Molecular analysis of APC mutations in Familial adenomatous polyposis and sporadic colon carcinomas Lancet 1992 340 626 630 10.1016/0140-6736(92)92169-G 1355210 Cottrell, S., Bicknell, D., Kaklamanis, L. & Bodmer, W. F. Molecular analysis of APC mutations in Familial adenomatous polyposis and sporadic colon carcinomas. Lancet 340 1355210 10.1016/0140-6736(92)92169-g 11. Fearnhead NS Britton MP Bodmer WF The ABC of APC Hum. Mol. Genet. 2001 10 721 733 10.1093/hmg/10.7.721 11257105 Fearnhead, N. S., Britton, M. P. & Bodmer, W. F. The ABC of APC. Hum. Mol. Genet. 10 11257105 10.1093/hmg/10.7.721 12. Rowan AJ APC mutations in sporadic colorectal tumors: A mutational ‘hotspot’ and interdependence of the ‘two hits’ Proc. Natl. Acad. Sci. U S A 2000 97 3352 3357 10.1073/pnas.97.7.3352 10737795 PMC16243 Rowan, A. J. et al. APC mutations in sporadic colorectal tumors: A mutational ‘hotspot’ and interdependence of the ‘two hits’. Proc. Natl. Acad. Sci. U S A 97 10737795 10.1073/pnas.97.7.3352 PMC16243 13. Thorstensen L Genetic and epigenetic changes of components affecting the WNT pathway in colorectal carcinomas stratified by microsatellite instability Neoplasia 2005 7 99 108 10.1593/neo.04448 15802015 PMC1501125 Thorstensen, L. et al. Genetic and epigenetic changes of components affecting the WNT pathway in colorectal carcinomas stratified by microsatellite instability. Neoplasia 7 15802015 10.1593/neo.04448 PMC1501125 14. Crockett SD Nagtegaal ID Terminology Molecular features, epidemiology, and management of serrated colorectal neoplasia Gastroenterology 2019 157 949 966e4 10.1053/j.gastro.2019.06.041 31323292 Crockett, S. D., Nagtegaal, I. D. & Terminology Molecular features, epidemiology, and management of serrated colorectal neoplasia. Gastroenterology 157 31323292 10.1053/j.gastro.2019.06.041 15. Bindea G Spatiotemporal dynamics of intratumoral immune cells reveal the immune landscape in human cancer Immunity 2013 39 782 795 10.1016/j.immuni.2013.10.003 24138885 Bindea, G. et al. Spatiotemporal dynamics of intratumoral immune cells reveal the immune landscape in human cancer. Immunity 39 24138885 10.1016/j.immuni.2013.10.003 16. Beatty PL Immunobiology and immunosurveillance in patients with intraductal papillary mucinous neoplasms (IPMNs), premalignant precursors of pancreatic adenocarcinomas Cancer Immunol. Immunother 2016 65 771 778 10.1007/s00262-016-1838-1 27106024 PMC11028509 Beatty, P. L. et al. Immunobiology and immunosurveillance in patients with intraductal papillary mucinous neoplasms (IPMNs), premalignant precursors of pancreatic adenocarcinomas. Cancer Immunol. Immunother 65 27106024 10.1007/s00262-016-1838-1 PMC11028509 17. Foy JP Immunological and classical subtypes of oral premalignant lesions Oncoimmunology 2018 7 e1496880 10.1080/2162402X.2018.1496880 30524889 PMC6279331 Foy, J. P. et al. Immunological and classical subtypes of oral premalignant lesions. Oncoimmunology 7 30524889 10.1080/2162402X.2018.1496880 PMC6279331 18. Beane JE Molecular subtyping reveals immune alterations associated with progression of bronchial premalignant lesions Nat. Commun. 2019 10 1856 10.1038/s41467-019-09834-2 31015447 PMC6478943 Beane, J. E. et al. Molecular subtyping reveals immune alterations associated with progression of bronchial premalignant lesions. Nat. Commun. 10 31015447 10.1038/s41467-019-09834-2 PMC6478943 19. Teixeira VH Deciphering the genomic, epigenomic, and transcriptomic landscapes of pre-invasive lung cancer lesions Nat. Med. 2019 25 517 525 10.1038/s41591-018-0323-0 30664780 PMC7614970 Teixeira, V. H. et al. Deciphering the genomic, epigenomic, and transcriptomic landscapes of pre-invasive lung cancer lesions. Nat. Med. 25 30664780 10.1038/s41591-018-0323-0 PMC7614970 20. Krysan K The immune contexture associates with the genomic landscape in lung adenomatous premalignancy Cancer Res. 2019 79 5022 5033 10.1158/0008-5472.CAN-19-0153 31142513 PMC6774823 Krysan, K. et al. The immune contexture associates with the genomic landscape in lung adenomatous premalignancy. Cancer Res. 79 31142513 10.1158/0008-5472.CAN-19-0153 PMC6774823 21. Degnim AC Alterations in the immune cell composition in premalignant breast tissue that precede breast cancer development Clin. Cancer Res. 2017 23 3945 3952 10.1158/1078-0432.CCR-16-2026 28126725 Degnim, A. C. et al. Alterations in the immune cell composition in premalignant breast tissue that precede breast cancer development. Clin. Cancer Res. 23 28126725 10.1158/1078-0432.CCR-16-2026 22. Chang K Immune profiling of premalignant lesions in patients with Lynch syndrome JAMA Oncol. 2018 4 1085 1092 10.1001/jamaoncol.2018.1482 29710228 PMC6087485 Chang, K. et al. Immune profiling of premalignant lesions in patients with Lynch syndrome. JAMA Oncol. 4 29710228 10.1001/jamaoncol.2018.1482 PMC6087485 23. Guinney J The consensus molecular subtypes of colorectal cancer Nat. Med. 2015 21 1350 1356 10.1038/nm.3967 26457759 PMC4636487 Guinney, J. et al. The consensus molecular subtypes of colorectal cancer. Nat. Med. 21 26457759 10.1038/nm.3967 PMC4636487 24. Roepman P Colorectal cancer intrinsic subtypes predict chemotherapy benefit, deficient mismatch repair and epithelial-to-mesenchymal transition Int. J. Cancer 2014 134 552 562 10.1002/ijc.28387 23852808 PMC4234005 Roepman, P. et al. Colorectal cancer intrinsic subtypes predict chemotherapy benefit, deficient mismatch repair and epithelial-to-mesenchymal transition. Int. J. Cancer 134 23852808 10.1002/ijc.28387 PMC4234005 25. Van Cutsem E Randomized phase III trial comparing biweekly infusional fluorouracil/leucovorin alone or with Irinotecan in the adjuvant treatment of stage III colon cancer: PETACC-3 J. Clin. Oncol. 2009 27 3117 3125 10.1200/JCO.2008.21.6663 19451425 Van Cutsem, E. et al. Randomized phase III trial comparing biweekly infusional fluorouracil/leucovorin alone or with Irinotecan in the adjuvant treatment of stage III colon cancer: PETACC-3. J. Clin. Oncol. 27 19451425 10.1200/JCO.2008.21.6663 26. info@sagebase.org, S. B. Synapse | Sage Bionetworks. https://www.synapse.org 27. Aran D Hu Z Butte AJ xCell: digitally portraying the tissue cellular heterogeneity landscape Genome Biol. 2017 18 220 10.1186/s13059-017-1349-1 29141660 PMC5688663 Aran, D., Hu, Z. & Butte, A. J. xCell: digitally portraying the tissue cellular heterogeneity landscape. Genome Biol. 18 29141660 10.1186/s13059-017-1349-1 PMC5688663 28. Zhang S Loss of Yes-associated protein represents an aggressive subtype of colorectal cancer J. Cancer 2019 10 689 696 10.7150/jca.28333 30719167 PMC6360423 Zhang, S. et al. Loss of Yes-associated protein represents an aggressive subtype of colorectal cancer. J. Cancer 10 30719167 10.7150/jca.28333 PMC6360423 29. Varghese F Bukhari AB Malhotra R De A IHC profiler: an open source plugin for the quantitative evaluation and automated scoring of immunohistochemistry images of human tissue samples PLoS One 2014 9 e96801 10.1371/journal.pone.0096801 24802416 PMC4011881 Varghese, F., Bukhari, A. B., Malhotra, R. & De, A. IHC profiler: an open source plugin for the quantitative evaluation and automated scoring of immunohistochemistry images of human tissue samples. PLoS One 9 24802416 10.1371/journal.pone.0096801 PMC4011881 30. Dienstmann R Consensus molecular subtypes and the evolution of precision medicine in colorectal cancer Nat. Rev. Cancer 2017 17 79 92 10.1038/nrc.2016.126 28050011 Dienstmann, R. et al. Consensus molecular subtypes and the evolution of precision medicine in colorectal cancer. Nat. Rev. Cancer 17 28050011 10.1038/nrc.2016.126 31. Cui G Immune battle at the premalignant stage of colorectal cancer: focus on immune cell compositions, functions and cytokine products Am. J. Cancer Res. 2020 10 1308 1320 32509381 PMC7269793 Cui, G. Immune battle at the premalignant stage of colorectal cancer: focus on immune cell compositions, functions and cytokine products. Am. J. Cancer Res. 10 32509381 PMC7269793 32. Dunn GP Old LJ Schreiber RD The three Es of cancer immunoediting Annu. Rev. Immunol. 2004 22 329 360 10.1146/annurev.immunol.22.012703.104803 15032581 Dunn, G. P., Old, L. J. & Schreiber, R. D. The three Es of cancer immunoediting. Annu. Rev. Immunol. 22 15032581 10.1146/annurev.immunol.22.012703.104803 33. Karlsson M Evidence for immunosurveillance in intestinal premalignant lesions Scand. J. Immunol. 2010 71 362 368 10.1111/j.1365-3083.2010.02377.x 20500687 Karlsson, M. et al. Evidence for immunosurveillance in intestinal premalignant lesions. Scand. J. Immunol. 71 20500687 10.1111/j.1365-3083.2010.02377.x 34. Liu F TNFα cooperates with IFN-γ to repress Bcl-xL expression to sensitize metastatic colon carcinoma cells to TRAIL-mediated apoptosis PLOS ONE 2011 6 e16241 10.1371/journal.pone.0016241 21264227 PMC3022032 Liu, F. et al. TNFα cooperates with IFN-γ to repress Bcl-xL expression to sensitize metastatic colon carcinoma cells to TRAIL-mediated apoptosis. PLOS ONE 6 21264227 10.1371/journal.pone.0016241 PMC3022032 35. Vicari AP Caux C Trinchieri G Tumour escape from immune surveillance through dendritic cell inactivation Semin Cancer Biol. 2002 12 33 42 10.1006/scbi.2001.0400 11926410 Vicari, A. P., Caux, C. & Trinchieri, G. Tumour escape from immune surveillance through dendritic cell inactivation. Semin Cancer Biol. 12 11926410 10.1006/scbi.2001.0400 36. Levy, E. M., Roberti, M. P. & Mordoh, J. Natural killer cells in human cancer: from biological functions to clinical applications. J Biomed Biotechnol 10.1155/2011/676198 PMC3085499 21541191 37. Chen B Differential pre-malignant programs and microenvironment chart distinct paths to malignancy in human colorectal polyps Cell 2021 184 6262 6280e26 10.1016/j.cell.2021.11.031 34910928 PMC8941949 Chen, B. et al. Differential pre-malignant programs and microenvironment chart distinct paths to malignancy in human colorectal polyps. Cell 184 34910928 10.1016/j.cell.2021.11.031 PMC8941949 38. Fessler E TGFβ signaling directs serrated adenomas to the mesenchymal colorectal cancer subtype EMBO Mol. Med. 2016 8 745 760 10.15252/emmm.201606184 27221051 PMC4931289 Fessler, E. et al. TGFβ signaling directs serrated adenomas to the mesenchymal colorectal cancer subtype. EMBO Mol. Med. 8 27221051 10.15252/emmm.201606184 PMC4931289 39. Waldner MJ Neurath MF TGFβ and the tumor microenvironment in colorectal cancer Cells 2023 12 1139 10.3390/cells12081139 37190048 PMC10137236 Waldner, M. J. & Neurath, M. F. TGFβ and the tumor microenvironment in colorectal cancer. Cells 12 37190048 10.3390/cells12081139 PMC10137236 40. Fessler E Medema JP Colorectal cancer subtypes: developmental origin and microenvironmental regulation Trends Cancer 2016 2 505 518 10.1016/j.trecan.2016.07.008 28741479 Fessler, E. & Medema, J. P. Colorectal cancer subtypes: developmental origin and microenvironmental regulation. Trends Cancer 2 28741479 10.1016/j.trecan.2016.07.008 41. Rejali L Principles of molecular utility for CMS classification in colorectal cancer management Cancers (Basel) 2023 15 2746 10.3390/cancers15102746 37345083 PMC10216373 Rejali, L. et al. Principles of molecular utility for CMS classification in colorectal cancer management. Cancers (Basel) 15 37345083 10.3390/cancers15102746 PMC10216373 42. Elsayed I Adenoma to carcinoma: A portrait of molecular and immunological profiles of colorectal sporadic tumors Int. Immunopharmacol. 2021 100 108168 10.1016/j.intimp.2021.108168 34562842 Elsayed, I. et al. Adenoma to carcinoma: A portrait of molecular and immunological profiles of colorectal sporadic tumors. Int. Immunopharmacol. 100 34562842 10.1016/j.intimp.2021.108168 ",
  "metadata": {
    "Title of this paper": "Adenoma to carcinoma: A portrait of molecular and immunological profiles of colorectal sporadic tumors",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480846/"
  }
}