{
  "title": "Paper_134",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12488599 PMC12488599.1 12488599 12488599 10.3389/fimmu.2025.1658028 1 Immunology Original Research Single-cell profiling uncovers PTPRG-driven stemness in malignant plasma cells and signatures of treatment failure in multiple myeloma Tan Jiewen  † Zhong Jinman  † He Yueping Xu Yunman Chen Chang Xiong Dan  *  Department of Hematology, The Eighth Affiliated Hospital, Southern Medical University (The First People’s Hospital of Shunde, Foshan) Foshan China Edited by: Sonam Mittal Reviewed by: Sudhir Kumar  Trudy-Ann Grant *Correspondence: Dan Xiong, xiongdancn@i.smu.edu.cn †These authors have contributed equally to this work 18 9 2025 2025 16 480569 1658028 04 7 2025 03 9 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Tan, Zhong, He, Xu, Chen and Xiong. 2025 Tan, Zhong, He, Xu, Chen and Xiong https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Multiple myeloma (MM) is characterized by extensive intratumoral heterogeneity and complex interactions within the bone marrow microenvironment, yet the cellular and molecular drivers of treatment resistance remain poorly defined. Protein tyrosine phosphatase receptor gamma (PTPRG) has emerged as a candidate tumor suppressor in various malignancies by antagonizing proliferative and survival signaling, but its functional and prognostic relevance in MM has not been established. Methods We analyzed 103,171 single‐cell transcriptomes from 18 MM samples (10 optimal responders [OR] and 8 suboptimal responders [SOR] to bortezomib–melphalan–prednisone) to investigate cell‐type composition, malignant plasma cell subclusters, and tumor–microenvironment crosstalk. InferCNV was used to distinguish malignant plasma cells, which were further reclustered and correlated with bulk prognostic phenotypes. Differential expression, pathway enrichment, transcription‐factor activity, pseudotime trajectory, and ligand–receptor interaction analyses were performed. Finally, bulk datasets ( GSE9782 GSE2658 in vitro Results Eleven major cell types were annotated, with plasma cells, T/NK cells, and CD14 + + Conclusions This single‐cell multi‐omic dissection implicates a proliferative, stem‐like MalPlasma3 subcluster and identified PTPRG as a key mediator of drug resistance and poor outcome in MM, offering novel prognostic biomarkers and therapeutic targets. multiple myeloma single-cell RNA sequencing cancer stemness PTPRG immunotherapy resistance The author(s) declare financial support was received for the research and/or publication of this article. This work was supported by grants from Guangdong Basic and Applied Basic Research Foundation (grant no.2022A1515140022), the Medical Scientific Research Foundation of Guangdong Province (grant no. A2024577, A2025173), the Scientific Research Start Plan of Shunde Hospital, Southern Medical University (grant no. SRSP2021038, SRSP2023013, SRSP2023019, SRSP2024034 and SRSP2024038). Foshan Self-Funded Science and Technology Innovation Projects for the Year 2024, Grant Number: 2420001003676, provided by Foshan Municipal Bureau of Science and Technology. This grant supported the research related to “Exploration of the Impact of Lactate Metabolism on the Prognosis and Tumor Microenvironment of Multiple Myeloma Patients. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Cancer Immunity and Immunotherapy 1 Introduction Multiple Myeloma (MM) is a hematological malignancy characterized by the clonal proliferation of aberrant plasma cells within the bone marrow, leading to osteolytic lesions, renal insufficiency, anemia, and hypercalcemia ( 1 2 3 4 5 The interplay between malignant plasma cells and various cellular components of the TME, such as immune cells and stromal cells, is increasingly recognized as a critical determinant of disease progression, treatment response, and the emergence of resistance ( 6 7 8 9 10 11 Among the molecular regulators that may contribute to drug resistance in MM, the role of protein tyrosine phosphatases has gained attention ( 12 13 12 13 PTPRG 12 In this study, we utilized single-cell RNA sequencing (scRNA-seq) to comprehensively profile the bone marrow microenvironment of MM patients stratified by their response to treatment. Our primary objectives were to: (i) delineate the cellular heterogeneity of malignant plasma cells and identify subclones associated with poor prognosis and treatment resistance; (ii) characterize the functional states and pathway activities within these aggressive plasma cell populations; (iii) investigate alterations in the immune cell landscape, particularly T/NK cell subsets, between OR and SOR groups; and (iv) elucidate the cell-cell communication networks that may contribute to suboptimal treatment outcomes. By integrating these single-cell insights with bulk transcriptomic data and performing in vitro 2 Materials and methods 2.1 Single cell data We retrieved the single cell RNA sequencing (scRNA-seq) data from Gene Expression Omnibus via the access number GSE189460 8 2.2 Bulk transcriptomics data We also retrieved bulk mRNA-seq data from three studies, including two from GEO and one from MMRF database. Specifically, mRNA-seq data, together with complete survival records, were retrieved from a study of 113 responders (R) and 126 non-responders (NR) who were enrolled in bortezomib (PS-341) clinical trial for MM treatment ( 8 GPL96 GPL97 GSE2658 14 https://research.themmrf.org 2.3 Single-cell quality control and annotation Single-cell preprocessing was performed in Seurat v4.1.1. Cells exceeding 10% mitochondrial gene content or 5% hemoglobin gene expression, or expressing fewer than 200 or more than 5,000 genes, were filtered out in line with previous studies ( 15 17 18 2.4 Functional enrichment Differentially expressed genes (DEGs) for each cluster were identified using Seurat’s FindMarkers function. In our study, we focused on upregulated genes in downstream analyses. The potential biological pathways of these genes were identified via Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) enrichment analyses using clusterProfiler v4.8.2 ( 19 2.5 Identification of malignancy status of plasma cell We applied Infercnvpy with default parameters to distinguish malignant from non-malignant plasma cells. Normal cells from the tumor microenvironment (TME), specifically T/NK cells, were used as the reference population. 2.6 Prognosis-associated subcluster detection We utilized the “Scissor” (v 2.0.0) ( 20 2.7 Transcription factor regulatory network analysis SCENIC analysis was performed using the pySCENIC v0.12.1 pipeline ( 21 2.8 Pseudotime trajectory inference Monocle v2.28.0 ( 22 2.9 Cell–cell communication analysis The CellChat v1.6.1 algorithm ( 23 2.10 Functional scoring with AUCell We scored malignant plasma cells for “cancer stemness” and T cells for\n“cytotoxicity” using AUCell. Gene sets were sourced from the Molecular Signatures\nDatabase (MsigDB v2023.1; https://www.gsea-msigdb.org/gsea/index.jsp  Supplementary Table S1 2.11 Survival analysis We dichotomized samples into PTPRG-high and PTPRG-low groups based on the determined cut-offs (via surv_cutpoint in survminer package). The survival rate of these two groups and comparisons were visualized using Kaplan–Meier curves. 2.12 Cell culture and siRNA transfection The multiple myeloma cell lines U266 and NCI-H929 were cultured in RPMI-1640 medium supplemented\nwith 10% fetal bovine serum (Gibco), 100 U/mL penicillin G, and 100 μg/mL streptomycin at\n37°C in a humidified incubator containing 5% CO 2 5  Supplementary Table S2 2.13 RNA extraction and qRT-PCR Total RNA was extracted from MM cells using TRIzol reagent (Thermo Fisher Scientific) and\nreverse-transcribed using PrimeScript™ RT (Takara). Quantitative reverse transcription PCR\n(qRT-PCR) was performed using HiScript II Q RT SuperMix (TRANS, AU341) to assess the expression of target genes, with β-actin used as the internal control. Each experiment included three biological replicates, each with technical triplicates. Primer sequences used in this study are listed in  Supplementary Table S3 2.14 CCK-8 proliferation assay We used the CCK8 assay to detect the viability of cells in accordance with the manufacturer’s protocol. U266 and NCI-H929 cells transfected with siNC, siPTPRG-1, and siPTPRG-2 were seeded into 96-well plates at a density of 5,000 cells per well. At 0, 24, 48, 72, and 96 hours, 10 μL of CCK-8 solution (Biosharp, Shanghai, China) was added to each well, followed by incubation for 1 hour at 37°C. Absorbance was then measured at 450 nm using a microplate reader (BD Biosciences, USA). The data were analyzed and visualized using GraphPad Prism software. 2.15 Apoptosis assay Apoptosis was assessed using an Annexin V-FITC/PI apoptosis detection kit (BD Biosciences, Franklin Lakes, NJ, USA). U266 and NCI-H929 cells were harvested 24 hours after siRNA treatment and resuspended in 1× binding buffer. A total of 100 μL of the cell suspension was incubated with 5 μL Annexin V-FITC and 2.5 μL propidium iodide (PI) for 30 minutes at 37°C in the dark. Samples were then analyzed using a BD FACSCanto II flow cytometer (BD Biosciences). Cells positive for Annexin V but negative for PI were considered early apoptotic, while double-positive cells were considered late apoptotic or necrotic. Flow cytometry data were analyzed using FlowJo software (BD Biosciences). 2.16 Western blotting In order to analyze the effect of PTRPG on downstream pathway proteins, cells and tissues were lysed with RIPA lysis buffer containing 1% PMSF. The lysates were then centrifuged, and the supernatant was collected. The quantified protein supernatant was supplemented with 4× protein loading buffer proportionally, boiled for 10 min to denature the protein, and stored at −80°C. Proteins were then separated by 10% SDS-PAGE and electrophoretically transferred onto polyvinylidene fluoride membranes where they were blocked with 5% skim milk and incubated with β-actin (Proteintech, 20536-1-AP, 1:10,000), anti-PTRPG (Abclonal, A14253, 1:1000), caspase-3 (CST, 24232, 1:800), and cleaved caspase-3 (Proteintech, 68773-1, 1:3,000). overnight at 4°C. Next, the membranes were incubated with horseradish peroxidase-conjugated anti-rabbit IgG. Antigen–antibody complexes were then detected with enhanced chemiluminescence reagent. The resulting Images were processed and analyzed using ImageJ software. 2.17 Statistical analysis We performed a minimum of three independent biological replicates for all experiments. Continuous variables were compared using the Mann–Whitney U test (two groups) or Kruskal–Wallis test (more than two groups); categorical variables were assessed by χ² test. All analyses were conducted in R v4.0.5. Two-tailed p < 0.05 was considered statistically significant otherwise stated. 3 Results 3.1 Cell-type classification and annotation A total of 18 samples with single-cell data were obtained from the GSE189460  Figure 1  Figure 2A  Figure 2B  Supplementary Table S4  Supplementary Figure S1A  Figure 2C, D  Figure 2C  Supplementary Figure S1B  Supplementary Figure S1C  Figure 2E  Supplementary Figure S1D  Supplementary Figure S1E  Figure 2F  Supplementary Figure S1F Figure 1 Overview of the study design. Participants and grouping information includes 18 participants receiving bortezomib-melphalan-prednisone therapy. Step II shows ScRNA-seq data revealing drug resistance mechanisms and mapping of malignant plasma cells. Step III combines ScRNA-seq with bulk-seq to identify key drug resistance genes in multiple myeloma (MM). Step IV validates MM resistance gene functions in vitro. Conclusions suggest a proliferative, stem-like malignant subcluster and a mediator of drug resistance affecting outcomes. Chart types include dimensional reduction plots, Venn diagrams, and survival analyses. Figure 2 UMAP visualization technology was used for unsupervised clustering analysis of cells, where each dot represents a single cell. (A) (B) (C) (D) (E) (F) Panel A to C shows UMAP plots of different cell types and responses. Panel D is a dot plot showing gene expression levels across cell types. Panel E presents a stacked bar chart of cell type proportions for optimal and suboptimal responders. Panel F is a heatmap illustrating genomic alterations in chromosomes for plasma and T/NK cells. 3.2 Reclustering of malignant plasma cells We then focused on malignant plasma cells to explore the potential heterogeneity. By conducting clustering analyses, the identified malignant plasma cells were reclassified into 5 cell subclusters (  Figure 3A  Figure 3B, D  Figure 3C, E  Figure 3F  Figure 3G, H Figure 3 Reclustering analysis of malignant plasma cells. (A) (B) (C) (D) (E) (F) (G) (H) A series of graphs analyzing plasma cell subsets in distinct groups. Panels A-C display UMAP plots differentiating various MalPlasma clusters by color. Panel D shows a bar chart of cell counts across categories: Background, good survival, and worse survival. Panel E is a box plot comparing proportions of MalPlasma groups between Optimal and Suboptimal Responders. Panel F illustrates the relative proportion of cells in MalPlasma subsets. Panel G and H depict the percentage distribution of cells by Optimal and Suboptimal Responders and survival categories, respectively. 3.3 Functional analysis of malignant plasma cell subclusters We then conducted differential gene expression analysis to identify genes differing across malignant plasma cell subclusters (  Figure 4A  Figure 4E  Figure 4B, C, F, G  Figure 4D  Figure 4H  Figure 4H Figure 4 Functional analysis of malignant plasma cell subclusters. (A) (B) (C) (D) (E) (F) (G) (H) Clustered heatmaps and bar charts display gene expression data. Panel A shows a heatmap of top marker genes. Panels B and F illustrate gene set enrichment bar plots with numbers of genes and p-values. Panel C is a pathway analysis of gene targets. Panel D plots regulon specificity scores. Panel E shows a heatmap of top markers related to survival. Panel G is another pathway analysis. Panel H features a UMAP visualization of gene clusters and a boxplot contrasting cancer stemness metrics against survival data. 3.4 Pseudotime analysis of malignant plasma cells We then investigated the dynamic evolution process of malignant plasma cells through psuedotime analysis. As shown in Fig4, malignant plasma cells exhibit 5 different states: cells in state 1 were considered potential starting points, followed by a bifurcation at branch point 1, where cells in state 2 developed towards the left of the trajectory, and cells in state 5 developed towards the right (  Figure 5A, B  Figure 5C, D  Figure 5E  Figure 5F  Figure 5G Figure 5 Trajectory analysis of malignant plasma cell subtypes. (A) (B) (C) (D) (E) (F) (G) Panel A shows a scatter plot depicting cell states along two components. Panel B presents pseudotime colored plot of the same components. Panel C scatters data into clusters: “others” and “worse survival”. Panel D categorizes data into responder types. Panel E illustrates density plots for worse survival versus others over a numeric range. Panel F is a heatmap of gene expression for different cell types, clusters, and phases. Panel G is a bar chart showing numbers of genes linked to various biological checkpoints and responses with significance in different colors. 3.5 Subcluster characterization of T/NK Cells To further investigate the potential role of tumor microenvironment (TME) in MM, we further reclustered T/NK cells using unsupervised dimensionality reduction and clustering analysis. We found that T/NK cells were grouped into 12 cell clusters (  Supplementary Figure S2A  Figure 6A, C  Supplementary Figure S2B, D-E  Supplementary Figure S2C  Figure 6B, D  Supplementary Figure S2F  Figure 6E Figure 6 Reclustering of T/NK cells. (A) (B) (C) (D) (E) The Image panel contains various visualizations of cell data analysis. Panel A: UMAP plot showing cell clusters labeled as Teffect, NK, Helper, Naive, Memory, Treg, and IFN. Distinct colors represent each cluster. Panel B: UMAP plot comparing Optimal and Suboptimal Responders. Red and blue dots denote different responder types. Panel C: Dot plot illustrating average gene expression and percentage expressed across different cell types. Panel D: Bar chart showing the relative proportion of cell types in Optimal and Suboptimal Responders. Panel E: UMAP plot displaying cytotoxicity levels across cell types, with a box plot comparing AUC scores between groups. 3.6 Cell-cell communication To better interpret the communication between cellular components in TME, we constructed cell interaction networks of potential receptor-ligand pairs for the OR and SOR groups, respectively (  Figure 7A, B  Figure 7C, D  Figure 7E  Figure 7F Figure 7 Cell interactions in the MM microenvironment. (A, B) (A) (B) (C, D) (C) (D) (E) (F) A series of data visualizations displays cell interaction patterns and probabilities. Panels A and B are heatmaps showing interactions for optimal and suboptimal responders, respectively, with intensity indicated by color. Panels C and D show network diagrams of cell interactions for optimal and suboptimal responders. Panels E and F present dot plots illustrating communication probabilities and significance, with color gradients and dot sizes indicating probability and p-values, respectively. 3.7 PTPRG affects prognosis and drug resistance We further leveraged bulk transcriptomics data from GSE9782 GPL96 GPL97 GPL96 GPL97  Figure 8A GSE9782  Figure 8B  Figure 8D GSE9782 GSE9782 GPL96  Figure 8C  Figure 8E GSE9782 GSE2658  Figure 8F  Supplementary Figure S3 Figure 8 PTPRG affects prognosis and drug resistance. (A) GSE9782 GPL96 GPL97 (B) (C) GSE9782 GPL96 (D) (E) (F) Panel A features two volcano plots displaying gene expression changes, highlighting up- and down-regulated genes. Panel B shows a Venn diagram comparing different cancer stemness gene sets. Panel C presents a violin plot of PTPRG expression between two groups with a p-value from the Wilcoxon test. Panel D depicts violin plots of PTPRG expression across various sample groups. Panel E shows a violin plot comparing PTPRG expression in groups with different survival outcomes. Panel F features three Kaplan-Meier plots illustrating survival rates based on PTPRG expression levels across different datasets. 3.8 PTPRG affects tumor cell function To better reveal potential functional role of PTPRG in MM, we performed in vitro  Figure 9A, B  Figure 9C, D  Figure 9E–H Figure 9 Functional validation of PTPRG. (A, B) (A) (B) (C-D) (C) (D) (E-F) (E) (F) (G-H) (G) (H) Graphs and plots illustrate the effect of siRNA on PTPRG mRNA levels, cell viability, apoptosis, and protein expression in U266 and NCI-H929 cells. Bar graphs in panels A and B show relative PTPRG mRNA levels. Line graphs in panels C and D depict cell viability over time. Scatter plots in panels E and F display apoptosis rates. Western blot Images in panels G and H show protein expression for β-actin, caspase-3, cleaved caspase-3, and PTPRG, along with corresponding bar graphs showing quantification of protein expression changes. 4 Discussions MM remains a formidable hematologic malignancy, characterized by significant inter- and intra-tumoral heterogeneity that profoundly influences therapeutic response and patient outcomes. Our scRNA-seq analysis provides a comprehensive view of the cellular and molecular dynamics in MM, shedding light on the roles of malignant plasma cell heterogeneity and the TME in shaping treatment response and prognosis. By combining single-cell insights with bulk transcriptomics and functional assays, we identified critical cellular subclusters (e.g., a stem‐like plasma‐cell subcluster) and highlighted PTPRG The diversity of malignant plasma cells in MM is a well-recognized driver of disease complexity and therapeutic challenges. A central finding of our investigation is the delineation of distinct malignant plasma cell subclusters, with the MalPlasma3 subcluster notably enriched in patients exhibiting SOR and strongly associated with a poor prognosis. This aligns with previous work showing that clonal heterogeneity in MM contributes to aggressive disease behavior and resistance to therapies like proteasome inhibitors ( 24 25 26 27 28 29 The immune microenvironment is increasingly recognized as a determinant of MM treatment success. Our analysis revealed distinct T-cell subcluster profiles between OR and SOR, with higher proportions of naïve and helper T cells in the OR group. This suggests that a more active immune response may enhance treatment efficacy, consistent with studies linking effective anti-tumor immunity to improved MM ( 30 31 32 33 Interactions within the TME further shape MM progression and response to treatment. Our findings point to enhanced communication between malignant plasma cells and HSPCs in the OR group, mediated by pathways like IGF1-IGF1R. The enrichment of this interaction in the OR group, specifically involving the “poor-prognosis” MalPlasma3 cells, is complex. However, this interaction may foster a supportive bone marrow niche, aiding immune reconstitution and treatment sensitivity ( 34 35 36 One of our main findings is the identification of PTPRG as a key mediator of the MalPlasma3 phenotype and an independent predictor of poor outcome. PTPRG has been characterized as a receptor‐type phosphatase with tumor‐suppressive functions in solid and hematologic malignancies, where its deletion, methylation, or downregulation unleashes oncogenic kinases such as ABL1 ( 12 37 38 39 34 35 40 41 42 43 44 12 37 PTPRG Our study possesses several notable strengths. The application of scRNA-seq provides a high-resolution, unbiased view of cellular heterogeneity and transcriptional states within both the malignant plasma cell compartment and the TME, offering insights often obscured by bulk analytical methods. The identification and functional annotation of the MalPlasma3 subcluster, its association with poor prognosis, and the detailed pathway analyses contribute significantly to understanding MM biology. A key strength is the identification of PTPRG as a gene linked to this aggressive phenotype and poor outcomes, further supported by in vitro Nevertheless, our study is not without limitations. The small sample size of 18 patients, while informative for scRNA-seq, may limit the statistical power for certain sub-analyses and the broader generalizability of some findings to the diverse MM patient population. While our data integration methods appeared robust, scRNA-seq studies can be susceptible to batch effects and technical variability. The findings are based on patients treated with a specific regimen (bortezomib-melphalan-prednisone), and the identified resistance mechanisms or TME alterations might differ with other therapeutic modalities. The intriguing association of high PTPRG expression with poor prognosis alongside its in vitro in vivo In conclusion, our study provides a detailed single-cell transcriptomic atlas of the MM bone marrow microenvironment in the context of differential treatment responses. We have identified a prognostically significant malignant plasma cell subcluster, MalPlasma3, characterized by activated stemness and proliferation pathways. Our findings highlighted PTPRG as a gene whose high expression is linked to this aggressive phenotype and poor clinical outcomes in MM, yet intriguingly, its knockdown in vitro Acknowledgments The authors would like to express their sincere gratitude to the Colleague of the Department of Hematology at the Eighth Affiliated Hospital, Southern Medical University for their invaluable support and assistance throughout the study. Data availability statement The original contributions presented in the study are included in the article/  Supplementary Material Author contributions JT: Writing – review & editing, Writing – original draft, Methodology, Conceptualization, Formal Analysis, Supervision. JZ: Writing – review & editing, Formal Analysis, Methodology, Writing – original draft, Supervision, Conceptualization. YH: Writing – review & editing, Investigation. YX: Writing – review & editing, Investigation. CC: Writing – review & editing, Investigation. DX: Conceptualization, Writing – review & editing, Supervision. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be constructed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fimmu.2025.1658028/full#supplementary-material Supplementary Figure 1 UMAP visualization technology was used for unsupervised clustering analysis of cells, where each dot represents a single cell. A B C D E F Supplementary Figure 2 Details of T/NK cell reclustering. A B C D E F Supplementary Figure 3 The univariate Cox results of the PTPRG gene in three datasets. Supplementary Table 1 The gene set related to the “cancer stemness” and “Cytotoxicity” function of T cells. Supplementary Table 2 The target sites of siRNA for PTPRG. Supplementary Table 3 The primers of β-ACTIN and PTPRG. Supplementary Table 4 Description of patients and single cell data included in this study. References 1 Rajkumar SV Multiple myeloma: 2020 update on diagnosis, risk-stratification and management Am J Hematol 2020 95 548–67 10.1002/ajh.25791 32212178 2 Pinto V Bergantim R Caires HR Seca H Guimarães JE Vasconcelos MH Multiple myeloma: available therapies and causes of drug resistance Cancers (Basel) 2020 12 10.3390/cancers12020407 32050631 PMC7072128 3 Kumar SK Dimopoulos MA Kastritis E Terpos E Nahi H Goldschmidt H Natural history of relapsed myeloma, refractory to immunomodulatory drugs and proteasome inhibitors: a multicenter IMWG study Leukemia 2017 31 2443–8 10.1038/leu.2017.138 28620163 4 Ledergor G Weiner A Zada M Wang SY Cohen YC Gatt ME Single cell dissection of plasma cell heterogeneity in symptomatic and asymptomatic myeloma Nat Med 2018 24 1867–76 10.1038/s41591-018-0269-2 30523328 5 Walker BA Mavrommatis K Wardell CP Ashby TC Bauer M Davies F A high-risk, Double-Hit, group of newly diagnosed myeloma identified by genomic analysis Leukemia 2019 33 159–70 10.1038/s41375-018-0196-8 29967379 PMC6326953 6 Hideshima T Mitsiades C Tonon G Richardson PG Anderson KC Understanding multiple myeloma pathogenesis in the bone marrow to identify new therapeutic targets Nat Rev Cancer 2007 7 585–98 10.1038/nrc2189 17646864 7 García-Ortiz A Rodríguez-García Y Encinas J Maroto-Martín E Castellano E Teixidó J The role of tumor microenvironment in multiple myeloma development and progression Cancers (Basel) 2021 13 10.3390/cancers13020217 33435306 PMC7827690 8 Jung SH Park SS Lim JY Sohn SY Kim NY Kim D Single-cell analysis of multiple myelomas refines the molecular features of bortezomib treatment responsiveness Exp Mol Med 2022 54 1967–78 10.1038/s12276-022-00884-z 36380017 PMC9723182 9 Xiang Y Sun G Tian L Xiang P Xie C Single-cell sequencing reveals the mechanisms of multiple myeloma progression: clarity or confusion Ann Hematol 2025 104 895 912 10.1007/s00277-025-06241-0 39918600 PMC11971202 10 Papalexi E Satija R Single-cell RNA sequencing to explore immune cell heterogeneity Nat Rev Immunol 2018 18 35 45 10.1038/nri.2017.76 28787399 11 Xu J Li P Wang Y Li J Xu B Zhao J The role of proliferating stem-like plasma cells in relapsed or refractory multiple myeloma: Insights from single-cell RNA sequencing and proteomic analysis Br J Haematol 2024 205 1031–43 10.1111/bjh.19486 38671576 12 Ismail MA Vezzalini M Morsi H Abujaber A Al Sayab A Siveen K Predictive value of tyrosine phosphatase receptor gamma for the response to treatment tyrosine kinase inhibitors in chronic myeloid leukemia patients Sci Rep 2021 11 8833 10.1038/s41598-021-86875-y 33893334 PMC8065106 13 Abdollahi P Köhn M Børset M Protein tyrosine phosphatases in multiple myeloma Cancer Lett 2021 501 105–13 10.1016/j.canlet.2020.11.042 33290866 14 Zhan F Hardin J Kordsmeier B Bumm K Zheng M Tian E Global gene expression profiling of multiple myeloma, monoclonal gammopathy of undetermined significance, and normal bone marrow plasma cells Blood 2002 99 1745–57 10.1182/blood.V99.5.1745 11861292 15 Caushi JX Zhang J Ji Z Vaghasia A Zhang B Hsiue EH Author Correction: Transcriptional programs of neoantigen-specific TIL in anti-PD-1-treated lung cancers Nature 2021 598 E1 10.1038/s41586-021-03893-6 34608287 PMC8528690 16 Zhang Y Chen H Mo H Zhao N Sun X Liu B Distinct cellular mechanisms underlie chemotherapies and PD-L1 blockade combinations in triple-negative breast cancer Cancer Cell 2025 43 446 463.e7 10.1016/j.ccell.2025.01.007 39919737 17 Gao Y Li J Cheng W Diao T Liu H Bo Y Cross-tissue human fibroblast atlas reveals myofibroblast subtypes with distinct roles in immune modulation Cancer Cell 2024 42 1764 1783.e10 10.1016/j.ccell.2024.08.020 39303725 18 Korsunsky I Millard N Fan J Slowikowski K Zhang F Wei K Fast, sensitive and accurate integration of single-cell data with Harmony Nat Methods 2019 16 1289–96 10.1038/s41592-019-0619-0 31740819 PMC6884693 19 Yu G Wang LG Han Y He QY clusterProfiler: an R package for comparing biological themes among gene clusters Omics 2012 16 284–7 10.1089/omi.2011.0118 22455463 PMC3339379 20 Sun D Guan X Moran AE Wu LY Qian DZ Schedin P Identifying phenotype-associated subpopulations by integrating bulk and single-cell sequencing data Nat Biotechnol 2022 40 527–38 10.1038/s41587-021-01091-3 34764492 PMC9010342 21 Van De Sande B Flerin C Davie K De Waegeneer M Hulselmans G Aibar S A scalable SCENIC workflow for single-cell gene regulatory network analysis Nat Protoc 2020 15 2247–76 10.1038/s41596-020-0336-2 32561888 22 Qiu X Mao Q Tang Y Wang L Chawla R Pliner HA Reversed graph embedding resolves complex single-cell trajectories Nat Methods 2017 14 979–82 10.1038/nmeth.4402 28825705 PMC5764547 23 Jin S Guerrero-Juarez CF Zhang L Chang I Ramos R Kuan CH Inference and analysis of cell-cell communication using CellChat Nat Commun 2021 12 1088 10.1038/s41467-021-21246-9 33597522 PMC7889871 24 Rasche L Chavan SS Stephens OW Patel PH Tytarenko R Ashby C Spatial genomic heterogeneity in multiple myeloma revealed by multi-region sequencing Nat Commun 2017 8 268 10.1038/s41467-017-00296-y 28814763 PMC5559527 25 Manier S Salem KZ Park J Landau DA Getz G Ghobrial IM Genomic complexity of multiple myeloma and its clinical implications Nat Rev Clin Oncol 2017 14 100–13 10.1038/nrclinonc.2016.122 27531699 26 Bergsagel PL Kuehl WM Molecular pathogenesis and a consequent classification of multiple myeloma J Clin Oncol 2005 23 6333–8 10.1200/JCO.2005.05.021 16155016 27 Gao M Kong Y Yang G Gao L Shi J Multiple myeloma cancer stem cells Oncotarget 2016 7 35466–77 10.18632/oncotarget.8154 27007154 PMC5085244 28 Mazziotta F Biavati L Rimando J Rutella S Borcherding N Parbhoo S CD8+ T-cell differentiation and dysfunction inform treatment response in acute myeloid leukemia Blood 2024 144 1168–82 10.1182/blood.2023021680 38776511 PMC11419782 29 Furukawa Y Kikuchi J Molecular basis of clonal evolution in multiple myeloma Int J Hematol 2020 111 496 511 10.1007/s12185-020-02829-6 32026210 30 Davies FE Raje N Hideshima T Lentzsch S Young G Tai YT Thalidomide and immunomodulatory derivatives augment natural killer cell cytotoxicity in multiple myeloma Blood 2001 98 210–6 10.1182/blood.V98.1.210 11418482 31 Zelle-Rieser C Thangavadivel S Biedermann R Brunner A Stoitzner P Willenbacher E T cells in multiple myeloma display features of exhaustion and senescence at the tumor site J Hematol Oncol 2016 9 116 10.1186/s13045-016-0345-3 27809856 PMC5093947 32 Gattinoni L Klebanoff CA Restifo NP Paths to stemness: building the ultimate antitumour T cell Nat Rev Cancer 2012 12 671–84 10.1038/nrc3322 22996603 PMC6352980 33 Klebanoff CA Gattinoni L Restifo NP CD8+ T-cell memory in tumor immunology and immunotherapy Immunol Rev 2006 211 214–24 10.1111/j.0105-2896.2006.00391.x 16824130 PMC1501075 34 Pollak M Insulin and insulin-like growth factor signalling in neoplasia Nat Rev Cancer 2008 8 915–28 10.1038/nrc2536 19029956 35 Kang BP Urbonas A Baddoo A Baskin S Malhotra A Meggs LG IGF-1 inhibits the mitochondrial apoptosis program in mesangial cells exposed to high glucose Am J Physiol Renal Physiol 2003 285 F1013–24 10.1152/ajprenal.00209.2003 12876069 36 Nakamura K Smyth MJ Martinet L Cancer immunoediting and immune dysregulation in multiple myeloma Blood 2020 136 2731–40 10.1182/blood.2020006540 32645135 37 Vezzalini M Mafficini A Tomasello L Lorenzetto E Moratti E Fiorini Z A new monoclonal antibody detects downregulation of protein tyrosine phosphatase receptor type γ in chronic myeloid leukemia patients J Hematol Oncol 2017 10 129 10.1186/s13045-017-0494-z 28637510 PMC5479035 38 Ismail MA Nasrallah GK Monne M Alsayab A Yassin MA Varadharaj G Description of PTPRG genetic variants identified in a cohort of Chronic Myeloid Leukemia patients and their ability to influence response to Tyrosine kinase Inhibitors Gene 2022 813 146101 10.1016/j.gene.2021.146101 34906644 39 Julien SG Dubé N Hardy S Tremblay ML Inside the human cancer tyrosine phosphatome Nat Rev Cancer 2011 11 35 49 10.1038/nrc2980 21179176 40 Kostas M Haugsten EM Zhen Y Sørensen V Szybowska P Fiorito E Protein tyrosine phosphatase receptor type G (PTPRG) controls fibroblast growth factor receptor (FGFR) 1 activity and influences sensitivity to FGFR kinase inhibitors Mol Cell Proteomics 2018 17 850–70 10.1074/mcp.RA117.000538 29371290 PMC5930401 41 Mirenda M Toffali L Montresor A Scardoni G Sorio C Laudanna C Protein tyrosine phosphatase receptor type γ is a JAK phosphatase and negatively regulates leukocyte integrin activation J Immunol 2015 194 2168–79 10.4049/jimmunol.1401841 25624455 42 Liu J Hamrouni A Wolowiec D Coiteux V Kuliczkowski K Hetuin D Plasma cells from multiple myeloma patients express B7-H1 (PD-L1) and increase expression after stimulation with IFN-{gamma} and TLR ligands via a MyD88-, TRAF6-, and MEK-dependent pathway Blood 2007 110 296 304 10.1182/blood-2006-10-051482 17363736 43 Iwasa M Harada T Oda A Bat-Erdene A Teramachi J Tenshin H PD-L1 upregulation in myeloma cells by panobinostat in combination with interferon-γ Oncotarget 2019 10 1903–17 10.18632/oncotarget.26726 30956773 PMC6443002 44 Fujikawa A Sugawara H Tanaka T Matsumoto M Kuboyama K Suzuki R Targeting PTPRZ inhibits stem cell-like properties and tumorigenicity in glioblastoma cells Sci Rep 2017 7 5609 10.1038/s41598-017-05931-8 28717188 PMC5514153 ",
  "metadata": {
    "Title of this paper": "Targeting PTPRZ inhibits stem cell-like properties and tumorigenicity in glioblastoma cells",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488599/"
  }
}