{
  "title": "Paper_593",
  "abstract": "pmc Nutr J Nutr J 128 nutrj Nutrition Journal 1475-2891 BMC PMC12482389 PMC12482389.1 12482389 12482389 41023680 10.1186/s12937-025-01216-3 1216 1 Research Association between the geriatric nutritional risk index and all-cause mortality in older critically ill patients with community-acquired pneumonia Zhang Lei 1 Li Minye 2 Liu Jianfei jianfei_liu@126.com 1 Ma Hui mahui-28@163.com 2 1 https://ror.org/04gw3ra78 grid.414252.4 0000 0004 1761 8894 Central Laboratory, The Sixth Medical Center of Chinese PLA General Hospital, 2 https://ror.org/04gw3ra78 grid.414252.4 0000 0004 1761 8894 The Nursing Department of Chinese PLA General Hospital, 29 9 2025 2025 24 478367 149 10 7 2025 30 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Aim This study aimed to explore the association between the geriatric nutritional risk index (GNRI) and the risk of mortality in critically ill older patients with community-acquired pneumonia (CAP). Methods This retrospective study included 1924 critically ill patients with CAP from the Medical Information Mart for Intensive Care-IV3.1 (MIMIC-IV3.1) database. The participants were grouped into four groups based on GNRI levels. The clinical outcome was 30-day, 90-day, 180-day, and 1-year mortality. Cox proportional hazards regression analysis and restricted cubic spline regression were used to evaluate the association between the GNRI and clinical outcomes in critically ill older patients with CAP. Results A total of 1924 patients (56.9% male) were included in the study. The 30-day, 90-day, 180-day, and 1-year mortality were 37.7%, 47.7%, 54.0% and 59.1%, respectively. Multivariate Cox proportional hazards analysis showed that the GNRI was independently associated with all-cause mortality. After adjusting for confounders, GNRI remained significantly associated with both short- and long-term mortality. Restricted cubic splines revealed a linear association between GNRI and all-cause mortality in CAP patients. Conclusion Our study indicates that the GNRI has a significant association with all-cause mortality in critically ill older patients with CAP. However, further confirmation of these findings requires larger prospective studies. Supplementary Information The online version contains supplementary material available at 10.1186/s12937-025-01216-3. Keywords Geriatric nutritional risk index All-cause mortality Community-acquired pneumonia Older patients pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction As a severe disease with high morbidity and mortality, Community-acquired pneumonia (CAP) is an infectious inflammation of the lung parenchyma that occurs outside the hospital. It also includes cases that arise after hospital admission but originate from infections contracted prior to hospitalization [ 1 2 3 4 5 Due to weakened immunity, malnutrition, multiple comorbidities, and increased bacterial resistance, older adults are more susceptible to CAP and often experience more severe disease progression [ 6 7 8 9 10 The GNRI (geriatric nutritional risk index) is an important nutritional screening tool for evaluating various clinical outcomes. It was first proposed by Bouillanne et al. in 2005 as a simple and reliable method to assess nutritional risk in hospitalized elderly patients [ 11 12 14 15 Materials and methods Study population This retrospective observational study utilized data from the publicly available Medical Information Mart for Intensive Care IV3.1 (MIMIC-IV3.1) database, specifically the records of ICU patients at the Beth Israel Deaconess Medical Center, United States. To comply with relevant regulations, the author, Lei Zhang obtained a Collaborative Institutional Training Initiative (CITI) license (Record ID 64101469) and the necessary permissions to utilize the MIMIC-IV3.1 database. This study adhered to the Declaration of Helsinki, and ethical approval was not required due to the database’s standardized data and anonymized patient records. The cohort consisted of patients admitted to the ICU due to CAP, with the CAP definition based on the ATS/IDSA guidelines [ 16 S1 1 Fig. 1 Inclusion/exclusion criteria. MIMIC: Medical Information Mart for Intensive Care Variable extraction The software PostgreSQL (version 16.1.0) and Navicat Premium (version 17.1.9) were used to extract data from the MIMIC-IV3.1 database using Structured Query Language (SQL). Patient data from the first 24 h of ICU admission were extracted, including demographics, vital signs, severity at admission (measured by Simplified Acute Physiological Score II (SAPS II), Glasgow Coma Scale (GCS), Acute Physiology Score III (APS III), Oxford Acute Severity of Illness Score (OASIS) and Sequential Organ Failure Assessment (SOFA)), laboratory test results, clinical outcomes, and comorbidities. All laboratory parameters were measured at the first available time point after ICU admission. Follow-up began on the date of admission and ended on the date of death. GNRI at admission was calculated using the following formula: GNRI = 14.89 × serum albumin level (g/dL) + 41.7 × (actual body weight (kg)/ideal body weight (kg)), for males: ideal body weight = height (cm) − 100 − (height (cm) − 150)/4, for females: ideal body weight = height (cm) − 100 − (height (cm) − 150)/2.5 [ 11 To avoid possible bias, variables with more than 20% missing values were excluded from the analysis. Variables with missing data less than 20% were processed by multiple imputation using a random forest algorithm (trained by other non-missing variables). This imputation process was conducted using the “mice” package in R (Additional file 2: Table S2). Clinical outcomes The outcomes of the present study were mortality within 30 days, 90 days, 180 days, and 1 year. These time points were chosen to capture short-, mid-, and long-term prognosis, which are clinically meaningful intervals in pneumonia and critical illness research. Patient mortality information for discharged patients was accessed from the U.S. Social Security Death Index. Statistical analysis As in previous studies, GNRI was categorized into four groups, Q1 (high risk): GNRI < 82, Q2 (moderate risk): 82 ≤ GNRI < 92, Q3 (low risk): 92 ≤ GNRI ≤ 98, and Q4 (normal): GNRI > 98 [ 17 Kaplan–Meier survival analysis was employed to assess the incidence rate of endpoints across GNRI groups, and their differences were assessed through log-rank tests. Cox proportional hazard models were used to calculate the hazard ratio (HR) and 95% confidence interval (CI) between the GNRI and endpoints, and also adjusted for some models. And clinically relevant and prognosis-associated variables were also enrolled in the multivariate model: model 1: unadjusted; model 2: adjusted for Age, Gender, Race; model 3 adjusted for Age, Gender, Race, Temperature, SBP, DBP, MBP, Heart Rate, Respiratory Rate, Heart Failure, Hypertension, APSIII, SAPSII, OASIS, SOFA, Hematocrit, Hemoglobin, WBC, Anion gap, Bicarbonate, Chloride, Glucose, Sodium, Basophil, Alp, Inr, Ptt, Pt, Calcium, Eosinophil, Bun, Lymphocyte, Monocyte, Neutrophil. Further, the linear associations between baseline GNRI and mortality at 30 days, 90 days, 180 days, and 1 year were explored using restricted cubic spline regression models. GNRI was analyzed both as a continuous variable and as an ordinal variable, with the high-risk (Q1) group serving as the reference. Trend analysis across GNRI quartiles was performed. Subgroup analyses were conducted to evaluate potential differences across various patient subgroups. The stratification variables, including age (65–75 and ≥ 75 years), gender, and comorbidities including diabetes, hypertension, atrial fibrillation, heart failure, myocardial infarction, renal failure, and chronic obstructive pulmonary disease (COPD), were selected because they are well-established factors influencing pneumonia prognosis and overall mortality. These variables may modify the association between GNRI and outcomes, and therefore were included to provide a more comprehensive assessment of GNRI’s prognostic value. Interactions between GNRI and stratification variables were examined using likelihood ratio tests. All statistical analyses were performed using R software (version 4.4.2), with statistical significance set at P Results Baseline characteristics A total of 1924 patients were included in the final data analysis. The median age of the cohort was 75.60 years (IQR: 69.93–82.97) years, and 1094 (56.9%) were male. The 30-day, 90-day, 180-day, and 1-year mortality were 37.7%, 47.7%, 54.0%, and 59.1%, respectively. Patients were categorized into four groups as follows: Q1: high risk (GNRI < 82; n n n n 1 Table 1 Baseline clinical characteristics of older patients with CAP Variable Overall ( N Q1 ( N Q2 ( N Q3 ( N Q4 ( N p Age (years) 75.60(69.93,82.97) 75.36(69.98,82.64) 75.90(70.39,83.56) 75.82(69.59,83.46) 75.37(69.91,81.89) 0.698 Man n(%) 1094(56.9) 314(54.8) 368(57.1) 221(55.9) 191(61.4) 0.288 Race n(%) 0.002 White 1200(62.4) 351(61.3) 424(65.7) 258(65.3) 167(53.7) Black 223(11.6) 68(11.9) 66(10.2) 35(8.9) 54(17.4) Asian 69(3.6) 23(4.0) 22(3.4) 18(4.6) 6(1.9) Hispanic 56(2.9) 14(2.4) 13(2.0) 14(3.5) 15(4.8) Others 376(19.5) 117(20.4) 120(18.6) 70(17.7) 69(22.2) Height (cm) 168.00(160.00,175.00) 168.00(160.00,175.00) 168.00(160.00,175.00) 168.00(160.00,175.00) 168.00(160.00,175.00) 0.357 Weight (kg) 75.85(63.58,91.40) 70.00(57.73,86.46) 76.03(64.80,91.80) 78.20(66.45,93.40) 80.90(68.70,93.70) < 0.001 Temperature (°C) 37.39(37.00,37.90) 37.33(36.94,37.83) 37.39(37.00,37.89) 37.39(37.06,38.00) 37.50(37.11,38.00) 0.002 SBP (mmHg) 146.00(133.00,162.25) 143.00(131.00,158.00) 147.00(133.00,160.00) 149.00(134.00,164.50) 152.00(137.00,171.50) < 0.001 DBP (mmHg) 86.00(75.00,100.00) 83.00(72.00,96.00) 86.00(76.00,99.00) 89.00(76.50,102.50) 89.00(78.00,104.00) < 0.001 MBP (mmHg) 102.00(91.00,116.00) 99.00(88.00,112.00) 101.00(92.00,115.00) 104.00(92.00,117.00) 105.00(94.00,122.00) < 0.001 Heart rate 105.00(91.00,121.00) 108.00(93.00,124.00) 105.00(90.00,122.00) 103.00(89.00,118.00) 103.00(92.00,115.00) 0.005 Respiration rate 29.00(25.38,34.00) 29.00(26.00,34.00) 30.00(26.00,35.00) 29.00(25.00,33.00) 29.00(25.00,33.50) 0.029 Spo2(%) 100.00(99.00,100.00) 100.00(100.00,100.00) 100.00(99.00,100.00) 100.00(99.00,100.00) 100.00(99.00,100.00) 0.316 Atrial Fibrillation n(%) 911(47.3) 265(46.2) 317(49.1) 193(48.9) 136(43.7) 0.375 Diabetes n(%) 287(14.9) 72(12.6) 100(15.5) 70(17.7) 45(14.5) 0.16 Heart Failure n(%) 927(48.2) 232(40.5) 334(51.8) 225(57.0) 136(43.7) < 0.001 Hypertension n(%) 652(33.9) 190(33.2) 205(31.8) 129(32.7) 128(41.2) 0.029 Myocardial Infarction n(%) 286(14.9) 73(12.7) 100(15.5) 63(15.9) 50(16.1) 0.395 Renal Failure n(%) 1168(60.7) 344(60.0) 402(62.3) 243(61.5) 179(57.6) 0.528 COPD n(%) 314(16.3) 89(15.5) 110(17.1) 64(16.2) 51(16.4) 0.914 SAPSII 46.93(14.07) 50.01(14.62) 47.42(13.38) 44.74(14.16) 43.04(12.92) < 0.001 SOFA 7.00(4.00,9.00) 7.00(5.00,10.00) 7.00(4.00,10.00) 6.00(4.00,9.00) 6.00(3.00,9.00) < 0.001 GCS 15.00(13.00,15.00) 15.00(13.00,15.00) 15.00(14.00,15.00) 15.00(13.00,15.00) 15.00(13.00,15.00) 0.464 APSIII 53.50(41.00,69.00) 62.00(47.00,78.00) 53.00(41.00,67.00) 50.00(38.00,63.00) 47.00(35.00,63.00) < 0.001 OASIS 38.00(32.00,44.00) 39.00(34.00,45.00) 38.00(32.00,44.00) 36.00(31.00,43.00) 36.00(31.00,42.00) < 0.001 Hematocrit n(%) 34.75(6.91) 32.54(6.36) 33.98(6.64) 36.27(6.42) 38.52(7.06) < 0.001 Hemoglobin (g/dL) 10.90(9.38,12.70) 10.00(8.70,11.70) 10.60(9.20,12.30) 11.60(10.20,13.00) 12.50(10.85,14.00) < 0.001 Platelets (K/uL) 216.50(152.00,295.00) 225.00(148.00,344.00) 210.00(142.00,289.00) 215.00(163.50,283.00) 217.00(163.00,270.00) 0.077 WBC (K/uL) 13.70(9.60,18.62) 14.70(9.90,20.30) 13.70(9.50,19.30) 12.70(9.10,17.55) 13.50(9.90,17.40) 0.004 Albumin (g/dL) 3.20(2.70,3.60) 2.50(2.20,2.70) 3.10(2.90,3.30) 3.50(3.45,3.60) 4.00(3.90,4.20) < 0.001 Anion gap (mEq/L) 17.00(14.00,20.00) 16.00(13.00,19.00) 17.00(14.00,19.00) 17.00(15.00,20.00) 18.00(15.00,21.00) < 0.001 Bicarbonate (mEq/L) 24.00(21.00,27.00) 24.00(20.00,27.00) 24.00(21.00,28.00) 24.00(22.00,27.50) 25.00(22.00,28.00) < 0.001 Chloride (mEq/L) 105.00(100.00,110.00) 106.00(101.00,112.00) 105.00(100.00,109.00) 104.00(99.00,108.00) 105.00(100.00,108.00) < 0.001 Creatinine(mg/dL) 1.40(1.00,2.30) 1.40(0.90,2.40) 1.50(1.00,2.40) 1.40(1.00,2.20) 1.40(1.00,2.05) 0.373 Glucose(mg/dL) 163.00(127.00,225.00) 156.00(119.00,219.00) 163.00(126.00,215.00) 168.00(130.50,239.50) 171.00(136.50,235.00) 0.002 Sodium(mEq/L) 140.00(137.00,143.00) 141.00(137.00,144.00) 140.00(137.00,143.00) 140.00(137.00,143.00) 141.00(138.00,143.00) 0.029 Potassium (mEq/L) 4.60(4.20,5.30) 4.60(4.20,5.20) 4.60(4.20,5.30) 4.60(4.20,5.30) 4.60(4.20,5.50) 0.307 Basophil (%) 0.02(0.01,0.05) 0.02(0.00,0.04) 0.02(0.01,0.05) 0.03(0.01,0.05) 0.03(0.01,0.05) < 0.001 Total Bilirubin (mg/dL) 0.60(0.40,1.10) 0.60(0.40,1.20) 0.60(0.40,1.10) 0.60(0.40,1.00) 0.60(0.40,1.10) 0.7 Alt (U/L) 26.00(16.00,55.00) 27.00(15.00,59.00) 28.00(16.00,61.00) 25.00(16.00,51.00) 24.00(17.00,41.50) 0.353 Alp (U/L) 92.00(67.00,127.00) 100.00(71.00,144.00) 89.00(65.00,124.00) 87.00(64.50,117.50) 89.00(67.50,118.00) < 0.001 Ptt 34.60(29.20,49.52) 36.70(30.70,51.50) 34.00(28.90,48.80) 34.50(29.20,51.10) 32.40(27.50,43.15) < 0.001 Ast (U/L) 41.00(25.00,85.00) 42.00(25.00,88.00) 42.00(25.00,90.00) 39.00(25.00,77.00) 38.00(26.00,77.50) 0.629 Inr 1.40(1.20,1.90) 1.50(1.30,2.00) 1.40(1.20,1.90) 1.30(1.20,1.90) 1.30(1.10,1.70) < 0.001 Pt 15.10(13.10,20.50) 16.10(13.90,21.50) 15.10(13.00,20.40) 14.60(12.90,20.30) 13.80(12.50,18.45) < 0.001 Calcium (mg/dL) 8.60(8.10,9.10) 8.20(7.80,8.70) 8.50(8.10,9.00) 8.80(8.40,9.20) 9.10(8.60,9.50) < 0.001 Bun (mg/dL) 33.00(21.00,53.00) 36.00(23.00,54.00) 34.00(22.00,56.00) 31.00(21.00,52.00) 27.00(19.00,44.00) < 0.001 Eosinophil (%) 0.02(0.00,0.10) 0.02(0.00,0.09) 0.02(0.00,0.10) 0.02(0.00,0.10) 0.03(0.00,0.11) 0.022 Lymphocyte (K/uL) 0.96(0.59,1.52) 0.87(0.52,1.44) 0.97(0.58,1.51) 0.96(0.64,1.53) 1.10(0.71,1.60) 0.001 Monocyte (K/uL) 0.64(0.38,1.05) 0.60(0.33,0.99) 0.69(0.39,1.08) 0.64(0.42,1.09) 0.64(0.40,1.04) 0.015 Neutrophil (K/uL) 10.15(6.71,14.72) 11.35(7.37,16.38) 10.54(6.64,15.39) 9.56(6.65,13.28) 9.28(6.48,13.47) < 0.001 Mechanical ventilation n(%) 1491(77.5) 435(75.9) 509(78.9) 308(78.0) 239(76.8) 0.639 LOS Hospital day 12.90(7.69,22.01) 13.80(7.42,22.98) 12.88(7.59,21.38) 11.78(7.70,20.21) 12.81(7.91,22.19) 0.428 LOS ICU day 6.16(3.08,11.72) 5.77(3.05,11.69) 6.40(3.08,11.69) 6.15(3.16,11.69) 6.60(3.29,12.09) 0.494 30-day mortality n(%) 725(37.7) 269(46.9) 244(37.8) 130(32.9) 82(26.4) < 0.001 90-day mortality n(%) 917(47.7) 340(59.3) 306(47.4) 163(41.3) 108(34.7) < 0.001 180-day mortality n(%) 1039(54.0) 373(65.1) 348(54.0) 187(47.3) 131(42.1) < 0.001 365-day mortality n(%) 1138(59.1) 396(69.1) 390(60.5) 205(51.9) 147(47.3) < 0.001 Abbreviation: SOFA APSIII SAPSII OASIS GCS WBC SBP DBP MBP Spo2 Alt Alp Ptt Ast Inr Pt Bun Clinical outcomes The Kaplan–Meier survival analysis curves were employed to analyze the incidence of clinical outcomes among groups. The results showed that patients in the lowest GNRI group (Q1) had the poorest survival, with cumulative incidence rates of 30-day, 90-day, 180-day, and 1-year mortality consistently decreasing as GNRI increased (log-rank P all < 0.001, Fig. 2 Fig. 2 Kaplan–Meier survival analysis curves for all-cause mortality according to groups at 30 days ( a b c d Multivariate Cox proportional hazards analysis was used to analyze the association between GNRI and 30-day, 90-day, 180-day, and 1-year mortality. The results demonstrated that GNRI was independently associated with a risk of 30-day mortality in model 1 [HR, 0.973(95% CI 0.968, 0.979) P P P P P 2 p 2 3 4 Table 2 Multivariable Cox regression analysis to assess the association between GNRI and mortality in patients with CAP Outcome Model1 Model2 Model3 HR (95% CI) P HR (95% CI) P HR (95% CI) P 30-day mortality GNRI a 0.973(0.968,0.979) < 0.001 0.972(0.965,0.979) < 0.001 0.973(0.965,0.981) < 0.001 Q1(< 82) 1 (Ref) Q2(82–92) 0.745(0.626,0.886) 0.001 0.753(0.633,0.896) 0.001 0.863(0.717,1.039) 0.120 Q3(92–98) 0.625(0.507,0.770) < 0.001 0.628(0.509,0.775) < 0.001 0.777(0.616,0.981) 0.034 Q4(> 98) 0.487(0.380,0.623) < 0.001 0.477(0.372,0.612) < 0.001 0.617(0.466,0.816) 0.001 P for trend < 0.001 < 0.001 0.001 90-day mortality GNRI a 0.971(0.965,0.977) < 0.001 0.971(0.965,0.977) < 0.001 0.973(0.965,0.980) < 0.001 Q1(< 82) 1 (Ref) Q2(82–92) 0.721(0.618,0.841) < 0.001 0.727(0.623,0.849) < 0.001 0.811(0.688,0.956) 0.013 Q3(92–98) 0.597(0.495,0.720) < 0.001 0.600(0.498,0.724) < 0.001 0.731(0.594,0.899) 0.003 Q4(> 98) 0.480(0.387,0.597) < 0.001 0.472(0.380,0.587) < 0.001 0.620(0.484,0.794) < 0.001 P for trend < 0.001 < 0.001 < 0.001 180-day mortality GNRI a 0.973(0.967,0.979) < 0.001 0.973(0.967,0.979) < 0.001 0.975(0.968,0.982) < 0.001 Q1(< 82) 1 (Ref) Q2(82–92) 0.734(0.634,0.850) < 0.001 0.738(0.638,0.855) < 0.001 0.811(0.694,0.947) 0.008 Q3(92–98) 0.607(0.509,0.724) < 0.001 0.609(0.511,0.727) < 0.001 0.737(0.606,0.895) 0.002 Q4(> 98) 0.512(0.420,0.625) < 0.001 0.505(0.413,0.617) < 0.001 0.659(0.524,0.828) < 0.001 P for trend < 0.001 < 0.001 < 0.001 1-year mortality GNRI a 0.973(0.968,0.979) < 0.001 0.973(0.968,0.979) 0.976(0.969,0.982) Q1(< 82) 1 (Ref) Q2(82–92) 0.766(0.666,0.881) < 0.001 0.769(0.669,0.885) < 0.001 0.835(0.720,0.968) 0.017 Q3(92–98) 0.614(0.518,0.727) < 0.001 0.616(0.520,0.730) < 0.001 0.737(0.611,0.889) 0.001 Q4(> 98) 0.529(0.437,0.639) < 0.001 0.519(0.429,0.628) < 0.001 0.672(0.541,0.836) < 0.001 P for trend < 0.001 < 0.001 < 0.001 Model 1: Unadjusted Model 2: Adjusted Age, Gender, and Race Model 3: Adjusted Age, Gender, Race, Temperature, SBP, DBP, MBP, Heart Rate, Respiratory Rate, Heart Failure, Hypertension, APSIII, SAPSII, OASIS, SOFA, Hematocrit, Hemoglobin, WBC, Anion gap, Bicarbonate, Chloride, Glucose, Sodium, Basophil, Alp, Inr, Ptt, Pt, Calcium, Eosinophil, Bun, Lymphocyte, Monocyte, Neutrophil. GNRI a Fig. 3 The relationship for the levels of GNRI with 30-day, 90-day, 180-day, and 1-year mortality. a d Fig. 4 Underlying the linear relationship between the GNRI and short- and long-term all-cause mortality. a b c d Subgroup analysis This study evaluated the heterogeneity of the relationship between GNRI and mortality at 30 days, 90 days, 180 days, and 1 year time points through stratified analyses (Figs. 5 P Fig. 5 Subgroup analyses of the association between GNRI and mortality at 30 days ( a b c d Discussion Nutritional issues in elderly CAP patients in the ICU are often overlooked, despite being a significant clinical challenge [ 18 CAP poses a significant health threat to the elderly, with severe CAP drawing particular attention due to its high mortality and complication risks [ 19 20 21 Malnutrition and inflammation are well-established drivers of adverse outcomes in chronic and acute illnesses [ 22 23 11 24 The robust association between GNRI and CAP outcomes can be attributed to malnutrition’s dual impact on immune dysfunction and tissue repair. A previous study indicated that malnutrition was characterized by hypoalbuminemia and low body weight [ 25 26 27 28 29 The consistency of GNRI’s predictive power across most subgroups—including age, gender, and comorbidities—underscores its broad clinical applicability in elderly ICU patients. However, the significant interaction with atrial fibrillation merits further investigation. Atrial fibrillation patients exhibited a more pronounced mortality gradient across GNRI, possibly due to the synergistic effects of malnutrition and cardiac dysfunction. Malnutrition exacerbates electrolyte imbalances and endothelial dysfunction, potentiating arrhythmogenicity [ 30 31 Clinically, our findings support routine GNRI assessment in elderly CAP patients upon ICU admission. Early identification of high-risk individuals (GNRI < 82) could prompt targeted interventions, such as protein-calorie supplementation or immunonutrition, which have demonstrated mortality benefits in malnourished critically ill patients [ 32 33 Several limitations of this study should be acknowledged. First, as an observational study, causal relationships between GNRI and CAP prognosis cannot be definitively established. Second, we relied on baseline GNRI measurements without accounting for dynamic changes during follow-up, which may have affected the accuracy of risk assessment. Third, GNRI includes serum albumin, which can decrease in the presence of systemic inflammation independent of actual nutritional status, potentially confounding the assessment of nutritional risk. Despite these Limitations, this study has several notable strengths. It is based on the large, publicly available MIMIC-IV 3.1 database, which contains real-world clinical data from routine patient care, enhancing the generalizability of our findings. We accounted for a wide range of potential confounders through multivariable-adjusted Cox regression, stratified analyses, and interaction testing. In addition, GNRI is a simple yet comprehensive index that can be easily calculated using routinely measured parameters, making it a practical tool for nutritional risk assessment in critically ill elderly patients. Future high-quality prospective studies are warranted to further validate the prognostic value of GNRI in CAP management. In addition, combining GNRI for early screening upon ICU admission with more comprehensive tools such as the Mini Nutritional Assessment (MNA) or MNA-Short Form (MNA-SF) once the patient’s condition stabilizes could help balance timeliness and accuracy in nutritional evaluation. Longitudinal assessments of nutritional status may further enhance risk stratification and guide targeted interventions. Conclusions In conclusion, our results extended the utility of the GNRI to critically ill older patients with CAP, demonstrating its reliability and validity as a prognostic tool for assessing nutritional risk and predicting both short- and long-term mortality in this population. These results highlight the potential of GNRI in enhancing risk assessment and guiding targeted interventions. However, further high-quality studies are required to validate these findings and explore their broader clinical implications. Supplementary Information  Supplementary Material 1. Supplementary Material 2. Supplementary Material 3. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements None. Authors’ contributions Lei Zhang wrote the manuscript. Lei Zhang extracted, collected and analyzed data. Minye Li prepared tables and figures. Jianfei Liu, Hui Ma reviewed the results, interpreted data, and designed the study. All authors have made an intellectual contribution to the manuscript and approved the submission. Funding None. Data availability Data are available from the corresponding author upon reasonable request. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Thomas CP Ryan M Chapman JD Stason WB Tompkins CP Suaya JA Polsky D Mannino DM Shepard DS Incidence and cost of pneumonia in Medicare beneficiaries Chest 2012 142 4 973 981 10.1378/chest.11-1160 22406959 Thomas CP, Ryan M, Chapman JD, Stason WB, Tompkins CP, Suaya JA, et al. Incidence and cost of pneumonia in Medicare beneficiaries. Chest. 2012;142(4):973–81. 22406959 10.1378/chest.11-1160 2. Ewig S Birkner N Strauss R Schaefer E Pauletzki J Bischoff H Schraeder P Welte T Hoeffken G New perspectives on community-acquired pneumonia in 388 406 patients. Results from a nationwide mandatory performance measurement programme in healthcare quality Thorax 2009 64 12 1062 1069 10.1136/thx.2008.109785 19454409 PMC2782114 Ewig S, Birkner N, Strauss R, Schaefer E, Pauletzki J, Bischoff H, et al. New perspectives on community-acquired pneumonia in 388 406 patients. Results from a nationwide mandatory performance measurement programme in healthcare quality. Thorax. 2009;64(12):1062–9. 19454409 10.1136/thx.2008.109785 PMC2782114 3. Confalonieri M Kodric M Santagiuliana M Longo C Biolo M Cifaldi R To use or not to use corticosteroids for pneumonia? A clinician’s perspective Monaldi archives for chest disease = Archivio Monaldi per le malattie del torace 2012 77 2 94 101 23193846 10.4081/monaldi.2012.157 Confalonieri M, Kodric M, Santagiuliana M, Longo C, Biolo M, Cifaldi R, et al. To use or not to use corticosteroids for pneumonia? A clinician’s perspective. Monaldi archives for chest disease = Archivio Monaldi per le malattie del torace. 2012;77(2):94–101. 23193846 10.4081/monaldi.2012.157 4. Zhang S Zhang K Yu Y Tian B Cui W Zhang G A new prediction model for assessing the clinical outcomes of ICU patients with community-acquired pneumonia: a decision tree analysis Ann Med 2019 51 1 41 50 10.1080/07853890.2018.1518580 30160553 PMC7857467 Zhang S, Zhang K, Yu Y, Tian B, Cui W, Zhang G. A new prediction model for assessing the clinical outcomes of ICU patients with community-acquired pneumonia: a decision tree analysis. Ann Med. 2019;51(1):41–50. 30160553 10.1080/07853890.2018.1518580 PMC7857467 5. Chen S Chen P Su M Jiang J Liu X Shen P Integrative Analyses Reveal the Correlation Between the Airway Microbiome and Host Metabolism in Severe Community-acquired Pneumonia Am J Respiratory Cell Mol Biol 2024 10.1165/rcmb.2024-0030OC 39102869 Chen S, Chen P, Su M, Jiang J, Liu X, Shen P, Li X, Rong F, Zhang S, Liu J, et al. Integrative Analyses Reveal the Correlation Between the Airway Microbiome and Host Metabolism in Severe Community-acquired Pneumonia. Am J Respiratory Cell Mol Biol. 2024. 10.1165/rcmb.2024-0030OC 10.1165/rcmb.2024-0030OC 39102869 6. de Benedictis FM Kerem E Chang AB Colin AA Zar HJ Bush A Complicated pneumonia in children Lancet 2020 396 10253 786 98 10.1016/S0140-6736(20)31550-6 32919518 de Benedictis FM, Kerem E, Chang AB, Colin AA, Zar HJ, Bush A. Complicated pneumonia in children. Lancet. 2020;396(10253):786–98. 32919518 10.1016/S0140-6736(20)31550-6 7. Jain S Self WH Wunderink RG Fakhran S Balk R Bramley AM Reed C Grijalva CG Anderson EJ Courtney DM Community-acquired pneumonia requiring hospitalization among U.S. adults N Engl J Med 2015 373 5 415 427 10.1056/NEJMoa1500245 26172429 PMC4728150 Jain S, Self WH, Wunderink RG, Fakhran S, Balk R, Bramley AM, et al. Community-acquired pneumonia requiring hospitalization among U.S. adults. N Engl J Med. 2015;373(5):415–27. 26172429 10.1056/NEJMoa1500245 PMC4728150 8. Theilacker C Sprenger R Leverkus F Walker J Häckl D von Eiff C Population-based incidence and mortality of community-acquired pneumonia in Germany PLoS One 2021 16 6 e0253118 10.1371/journal.pone.0253118 34129632 PMC8205119 Theilacker C, Sprenger R, Leverkus F, Walker J, Häckl D, von Eiff C, et al. Population-based incidence and mortality of community-acquired pneumonia in Germany. PLoS One. 2021;16(6):e0253118. 34129632 10.1371/journal.pone.0253118 PMC8205119 9. Riquelme R Torres A el-Ebiary M Mensa J Estruch R Ruiz M Angrill J Soler N Community-acquired pneumonia in the elderly. Clinical and nutritional aspects Am J Respir Crit Care Med 1997 156 6 1908 1914 10.1164/ajrccm.156.6.9702005 9412574 Riquelme R, Torres A, el-Ebiary M, Mensa J, Estruch R, Ruiz M, et al. Community-acquired pneumonia in the elderly. Clinical and nutritional aspects. Am J Respir Crit Care Med. 1997;156(6):1908–14. 9412574 10.1164/ajrccm.156.6.9702005 10. Wei L Xie H Li J Li R Chen W Huang L The prognostic value of geriatric nutritional risk index in elderly patients with severe community-acquired pneumonia: a retrospective study Medicine (Baltimore) 2020 99 37 e22217 10.1097/MD.0000000000022217 32925799 PMC7489621 Wei L, Xie H, Li J, Li R, Chen W, Huang L, et al. The prognostic value of geriatric nutritional risk index in elderly patients with severe community-acquired pneumonia: a retrospective study. Medicine (Baltimore). 2020;99(37):e22217. 32925799 10.1097/MD.0000000000022217 PMC7489621 11. Bouillanne O Morineau G Dupont C Coulombel I Vincent JP Nicolis I Geriatric nutritional risk index: a new index for evaluating at-risk elderly medical patients Am J Clin Nutr 2005 82 4 777 83 10.1093/ajcn/82.4.777 16210706 Bouillanne O, Morineau G, Dupont C, Coulombel I, Vincent JP, Nicolis I, et al. Geriatric nutritional risk index: a new index for evaluating at-risk elderly medical patients. Am J Clin Nutr. 2005;82(4):777–83. 16210706 10.1093/ajcn/82.4.777 12. Minamisawa M Seidelmann SB Claggett B Hegde SM Shah AM Desai AS Impact of malnutrition using geriatric nutritional risk index in heart failure with preserved ejection fraction JACC Heart Fail 2019 7 8 664 75 10.1016/j.jchf.2019.04.020 31302049 Minamisawa M, Seidelmann SB, Claggett B, Hegde SM, Shah AM, Desai AS, et al. Impact of malnutrition using geriatric nutritional risk index in heart failure with preserved ejection fraction. JACC Heart Fail. 2019;7(8):664–75. 31302049 10.1016/j.jchf.2019.04.020 13. Nakagawa N Maruyama K Hasebe N Utility of geriatric nutritional risk index in patients with chronic kidney disease: a mini-review Nutrients 2021 10.3390/nu13113688 34835944 PMC8624060 Nakagawa N, Maruyama K, Hasebe N. Utility of geriatric nutritional risk index in patients with chronic kidney disease: a mini-review. Nutrients. 2021. 10.3390/nu13113688. 34835944 10.3390/nu13113688 PMC8624060 14. Ruan GT Zhang Q Zhang X Tang M Song MM Zhang XW Li XR Zhang KP Ge YZ Yang M Geriatric nutrition risk index: prognostic factor related to inflammation in elderly patients with cancer cachexia J Cachexia Sarcopenia Muscle 2021 12 6 1969 1982 10.1002/jcsm.12800 34585849 PMC8718015 Ruan GT, Zhang Q, Zhang X, Tang M, Song MM, Zhang XW, et al. Geriatric nutrition risk index: prognostic factor related to inflammation in elderly patients with cancer cachexia. J Cachexia Sarcopenia Muscle. 2021;12(6):1969–82. 34585849 10.1002/jcsm.12800 PMC8718015 15. Cereda E, Pedrolli C. The use of the Geriatric Nutritional Risk Index (GNRI) as a simplified nutritional screening tool. Am J Clin Nutr. 2008; 87(6):1966–1967; author reply 1967. 10.1093/ajcn/87.6.1966 18541595 16. Olson G Davis AM Diagnosis and treatment of adults with community-acquired pneumonia JAMA 2020 323 9 885 886 10.1001/jama.2019.21118 32027358 Olson G, Davis AM. Diagnosis and treatment of adults with community-acquired pneumonia. JAMA. 2020;323(9):885–6. 32027358 10.1001/jama.2019.21118 17. Wang T Wang Y Liu Q Guo W Zhang H Dong L Association between geriatric nutrition risk index and 90-day mortality in older adults with chronic obstructive pulmonary disease: a retrospective cohort study Int J Chron Obstruct Pulmon Dis 2024 19 1197 206 10.2147/COPD.S457422 38831891 PMC11146612 Wang T, Wang Y, Liu Q, Guo W, Zhang H, Dong L, et al. Association between geriatric nutrition risk index and 90-day mortality in older adults with chronic obstructive pulmonary disease: a retrospective cohort study. Int J Chron Obstruct Pulmon Dis. 2024;19:1197–206. 38831891 10.2147/COPD.S457422 PMC11146612 18. Viasus D Pérez-Vergara V Carratalà J Effect of undernutrition and obesity on clinical outcomes in adults with community-acquired pneumonia Nutrients 2022 10.3390/nu14153235 35956411 PMC9370638 Viasus D, Pérez-Vergara V, Carratalà J. Effect of undernutrition and obesity on clinical outcomes in adults with community-acquired pneumonia. Nutrients. 2022. 10.3390/nu14153235. 35956411 10.3390/nu14153235 PMC9370638 19. Mandell LA, Wunderink RG, Anzueto A, Bartlett JG, Campbell GD, Dean NC, Dowell SF, File TM, Jr., Musher DM, Niederman MS, et al. Infectious Diseases Society of America/American Thoracic Society consensus guidelines on the management of community-acquired pneumonia in adults. Clin Infect Dis. 2007; 44(Suppl 2):S27–72. 10.1086/511159 PMC7107997 17278083 20. Felblinger DM Malnutrition, infection, and sepsis in acute and chronic illness Crit Care Nurs Clin North Am 2003 15 1 71 8 10.1016/S0899-5885(02)00040-0 12597042 Felblinger DM. Malnutrition, infection, and sepsis in acute and chronic illness. Crit Care Nurs Clin North Am. 2003;15(1):71–8. 12597042 10.1016/s0899-5885(02)00040-0 21. Wang G Wang N Liu T Ji W Sun J Lv L Yu X Cheng X Li M Hu T Association between prognostic nutritional index and mortality risk in patients with community-acquired pneumonia: a retrospective study BMC Pulm Med 2024 24 1 555 10.1186/s12890-024-03373-3 39501259 PMC11536940 Wang G, Wang N, Liu T, Ji W, Sun J, Lv L, et al. Association between prognostic nutritional index and mortality risk in patients with community-acquired pneumonia: a retrospective study. BMC Pulm Med. 2024;24(1):555. 39501259 10.1186/s12890-024-03373-3 PMC11536940 22. Cederholm T Barazzoni R Austin P Ballmer P Biolo G Bischoff SC Compher C Correia I Higashiguchi T Holst M Espen guidelines on definitions and terminology of clinical nutrition Clin Nutr 2017 36 1 49 64 10.1016/j.clnu.2016.09.004 27642056 Cederholm T, Barazzoni R, Austin P, Ballmer P, Biolo G, Bischoff SC, et al. Espen guidelines on definitions and terminology of clinical nutrition. Clin Nutr. 2017;36(1):49–64. 27642056 10.1016/j.clnu.2016.09.004 23. Jensen GL Cederholm T Ballesteros-Pomar MD Blaauw R Correia M Cuerda C Evans DC Fukushima R Gautier JBO Gonzalez MC Guidance for assessment of the inflammation etiologic criterion for the GLIM diagnosis of malnutrition: a modified Delphi approach JPEN J Parenter Enteral Nutr 2024 48 2 145 154 10.1002/jpen.2590 38221842 Jensen GL, Cederholm T, Ballesteros-Pomar MD, Blaauw R, Correia M, Cuerda C, et al. Guidance for assessment of the inflammation etiologic criterion for the GLIM diagnosis of malnutrition: a modified Delphi approach. JPEN J Parenter Enteral Nutr. 2024;48(2):145–54. 38221842 10.1002/jpen.2590 24. Morisawa D Higuchi Y Iwakura K Okamura A Date M Ohmiya S Predictive factors for successful weaning from percutaneous cardiopulmonary support in patients with cardiogenic shock complicating acute myocardial infarction J Cardiol 2012 60 5 350 4 10.1016/j.jjcc.2012.06.005 22819038 Morisawa D, Higuchi Y, Iwakura K, Okamura A, Date M, Ohmiya S, et al. Predictive factors for successful weaning from percutaneous cardiopulmonary support in patients with cardiogenic shock complicating acute myocardial infarction. J Cardiol. 2012;60(5):350–4. 22819038 10.1016/j.jjcc.2012.06.005 25. Abd-El-Aziz MA Hübner M Demartines N Larson DW Grass F Simple clinical screening underestimates malnutrition in surgical patients with inflammatory bowel disease-an ACS NSQIP analysis Nutrients 2022 10.3390/nu14050932 35267906 PMC8912602 Abd-El-Aziz MA, Hübner M, Demartines N, Larson DW, Grass F. Simple clinical screening underestimates malnutrition in surgical patients with inflammatory bowel disease-an ACS NSQIP analysis. Nutrients. 2022. 10.3390/nu14050932. 35267906 10.3390/nu14050932 PMC8912602 26. Schaible UE Kaufmann SH Malnutrition and infection: complex mechanisms and global impacts PLoS Med 2007 4 5 e115 10.1371/journal.pmed.0040115 17472433 PMC1858706 Schaible UE, Kaufmann SH. Malnutrition and infection: complex mechanisms and global impacts. PLoS Med. 2007;4(5):e115. 17472433 10.1371/journal.pmed.0040115 PMC1858706 27. Cruz-Jentoft AJ Bahat G Bauer J Boirie Y Bruyère O Cederholm T Sarcopenia: revised European consensus on definition and diagnosis Age Ageing 2019 48 4 601 10.1093/ageing/afz046 31081853 PMC6593317 Cruz-Jentoft AJ, Bahat G, Bauer J, Boirie Y, Bruyère O, Cederholm T, et al. Sarcopenia: revised European consensus on definition and diagnosis. Age Ageing. 2019;48(4):601. 31081853 10.1093/ageing/afz046 PMC6593317 28. Altuna-Venegas S Aliaga-Vega R Maguiña JL Parodi JF Runzer-Colmenares FM Risk of community-acquired pneumonia in older adults with sarcopenia of a hospital from Callao, Peru 2010–2015 Arch Gerontol Geriatr 2019 82 100 5 10.1016/j.archger.2019.01.008 30739000 PMC8842506 Altuna-Venegas S, Aliaga-Vega R, Maguiña JL, Parodi JF, Runzer-Colmenares FM. Risk of community-acquired pneumonia in older adults with sarcopenia of a hospital from Callao, Peru 2010–2015. Arch Gerontol Geriatr. 2019;82:100–5. 30739000 10.1016/j.archger.2019.01.008 PMC8842506 29. Adnan M Hashmat N Latif M Ali Z Rahat T Hypoalbuminemia predicts intensive care need among adult inpatients with community acquired pneumonia: a cross sectional study J Infect Dev Ctries 2018 12 8 636 41 10.3855/jidc.9971 31958326 Adnan M, Hashmat N, Latif M, Ali Z, Rahat T. Hypoalbuminemia predicts intensive care need among adult inpatients with community acquired pneumonia: a cross sectional study. J Infect Dev Ctries. 2018;12(8):636–41. 31958326 10.3855/jidc.9971 30. Anaszewicz M Budzyński J Clinical significance of nutritional status in patients with atrial fibrillation: an overview of current evidence J Cardiol 2017 69 5 719 30 10.1016/j.jjcc.2016.06.014 27520756 Anaszewicz M, Budzyński J. Clinical significance of nutritional status in patients with atrial fibrillation: an overview of current evidence. J Cardiol. 2017;69(5):719–30. 27520756 10.1016/j.jjcc.2016.06.014 31. Huang W Liu H Luo Y Xiong S Suo S Zhang Z Shang L Sun H Inflammation and nutritional status mediated the increased of risk of atrial fibrillation recurrence associated with eGFRdiff post-ablation J Inflamm Res 2024 17 9743 9756 10.2147/JIR.S496590 39618937 PMC11606336 Huang W, Liu H, Luo Y, Xiong S, Suo S, Zhang Z, et al. Inflammation and nutritional status mediated the increased of risk of atrial fibrillation recurrence associated with eGFRdiff post-ablation. J Inflamm Res. 2024;17:9743–56. 39618937 10.2147/JIR.S496590 PMC11606336 32. Singer P Blaser AR Berger MM Alhazzani W Calder PC Casaer MP Espen guideline on clinical nutrition in the intensive care unit Clin Nutr 2019 38 1 48 79 10.1016/j.clnu.2018.08.037 30348463 Singer P, Blaser AR, Berger MM, Alhazzani W, Calder PC, Casaer MP, et al. Espen guideline on clinical nutrition in the intensive care unit. Clin Nutr. 2019;38(1):48–79. 30348463 10.1016/j.clnu.2018.08.037 33. Lim WS van der Eerden MM Laing R Boersma WG Karalus N Town GI Lewis SA Macfarlane JT Defining community acquired pneumonia severity on presentation to hospital: an international derivation and validation study Thorax 2003 58 5 377 382 10.1136/thorax.58.5.377 12728155 PMC1746657 Lim WS, van der Eerden MM, Laing R, Boersma WG, Karalus N, Town GI, et al. Defining community acquired pneumonia severity on presentation to hospital: an international derivation and validation study. Thorax. 2003;58(5):377–82. 12728155 10.1136/thorax.58.5.377 PMC1746657 ",
  "metadata": {
    "Title of this paper": "Defining community acquired pneumonia severity on presentation to hospital: an international derivation and validation study",
    "Journal it was published in:": "Nutrition Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482389/"
  }
}