{
  "title": "Paper_380",
  "abstract": "pmc Respir Res Respir Res 80 rr Respiratory Research 1465-9921 1465-993X BMC PMC12486758 PMC12486758.1 12486758 12486758 41029727 10.1186/s12931-025-03338-y 3338 1 Research Sodium butyrate targets VWF to inhibit cigarette smoke extract-induced endothelial cell-macrophage crosstalk in regulating inflammatory response Ma Xiaolong 1 5 Zhou Jiaqi 1 Yang Shuyou 2 Zhang Yingqing 1 Zhu Chaoping 1 Sun Yuejiao 1 Miao Jinli 3 Mo Hongyan 13957376012@163.com 4 1 https://ror.org/00j2a7k55 grid.411870.b 0000 0001 0063 8301 Department of Respiratory, The Affiliated Hospital of Jiaxing University, 2 3 https://ror.org/03cve4549 grid.12527.33 0000 0001 0662 3178 The Yangtze River Delta Biological Medicine Research and Development Center of Zhejiang Province, Yangtze Delta Region Institution of Tsinghua University, 4 https://ror.org/00j2a7k55 grid.411870.b 0000 0001 0063 8301 Operating room, Department of Anesthesiology, The Affiliated Hospital of Jiaxing University, 5 https://ror.org/04epb4p87 grid.268505.c 0000 0000 8744 8924 Zhejiang Chinese Medical University, 30 9 2025 2025 26 478376 278 19 2 2025 2 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Previous studies have shown that cigarette smoke-induced inflammation is a key driver of chronic obstructive pulmonary disease (COPD) progression. Sodium butyrate (NaB), a short-chain fatty acid that can be endogenously produced or exogenously supplemented, has been reported to exhibit anti-inflammatory effects. This study investigated the therapeutic effects and mechanisms of NaB in cigarette smoke extract (CSE)-induced inflammation. Through network pharmacology analysis, von Willebrand factor (VWF) was identified as a potential key target of NaB in the regulation of COPD. qRT-PCR and Western blot analysis showed that CSE significantly upregulated VWF expression in human umbilical vein endothelial cells (HUVECs), while NaB treatment markedly suppressed this upregulation. Using small interfering RNA (si-VWF), we knocked down VWF expression in HUVECs and co-cultured these cells with THP-1 cells in CSE-containing medium. ELISA, qRT-PCR, and Western blot analysis revealed that CSE enhanced the inflammatory response and activation of the PI3K-AKT signaling pathway in the THP-1. However, VWF knockdown reversed these effects of CSE. Furthermore, NaB pre-treatment of HUVECs significantly inhibited the inflammatory response and PI3K-AKT signaling activation in THP-1 cells, whereas VWF overexpression partially reversed the inhibitory effects of NaB. This study elucidated the critical regulatory role of VWF in CSE-induced endothelial cell-macrophage crosstalk and demonstrated that NaB suppresses CSE-induced VWF upregulation in HUVECs, thereby mitigating macrophage inflammation. Our findings reveal a novel mechanism by which NaB inhibits CSE-induced inflammation and highlight the therapeutic potential of NaB in COPD. Supplementary Information The online version contains supplementary material available at 10.1186/s12931-025-03338-y. Keywords Sodium butyrate Cigarette smoke extract VWF Endothelial cells Macrophages National Oncology Clinical Key Speciality 2023-GJZK-001 2023-GJZK-001 Ma Xiaolong Mo Hongyan Jiaxing Key Laboratory of Precision Treatment for Lung Cancer Key Construction Disciplines of Provincial and Municipal Co construction of Zhejiang NO.2023-SSGJ-002 NO.2023-SSGJ-002 Ma Xiaolong Mo Hongyan pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Chronic obstructive pulmonary disease (COPD) is a progressive disease characterized by inflammation and remodeling of the small airways and lung parenchyma caused by the inhalation of harmful particles, such as tobacco smoke and environmental pollutants [ 1 2 3 4 5 An increase in macrophages is a hallmark feature of chronic inflammation in COPD [ 6 7 8 Sodium butyrate (NaB), a short-chain fatty acid, is a metabolic product generated by gut microbiota through the fermentation of dietary fiber and plays a crucial role in maintaining intestinal health [ 9 10 11 12 13 14 15 Early studies established that von Willebrand Factor (VWF) is a marker of endothelial injury and primary role in coagulation, but more recent research has revealed its involvement in inflammatory processes [ 16 17 18 19 20 Materials and methods Prediction of potential targets of sodium butyrate for COPD In this study, the GSE38974 https://www.ncbi.nlm.nih.gov/geo/ GPL4133 2 Drug targets of NaB were retrieved and collected using the Swiss Target Prediction database ( http://swisstargetprediction.ch/ https://www.lilab-ecust.cn/pharmmapper/ Construction of protein-protein interaction (PPI) networks and Random Walk with Restart (RWR) analysis The DEGs and NaB target genes were jointly uploaded to the STRING online platform ( https://cn.string-db.org/ Cell culture Human umbilical vein endothelial cells (HUVECs, iCell Bioscience, China) were cultured in endothelial cell medium (ECM, iCell Bioscience, China) supplemented with 10% fetal bovine serum (FBS, iCell Bioscience, China) and 1% penicillin/streptomycin solution. Cells were maintained in a Humidified incubator at 37 °C with 5% CO 2 THP-1 cells (purchased from iCell Bioscience, China) were cultured in RPMI 1640 medium (iCell Bioscience, China) supplemented with 10% FBS, 1% penicillin/streptomycin solution, and 0.05 mM 2-mercaptoethanol. To induce differentiation into macrophages for subsequent co-culture experiments, THP-1 cells were treated with 100 ng/mL phorbol-12-myristate-13-acetate (PMA) for 24 h in a Humidified incubator at 37 °C with 5% CO 2 CSE Preparation The smoke from one unfiltered Furong cigarette was bubbled through 10 mL of PBS. The resulting suspension was adjusted to pH 7.4 using 1 mmol/L NaOH and then filtered through a 0.22 μm pore filter (Merck, Germany) to remove bacteria and large particles. The absorbance of the solution was measured at 320 nm to define 100% CSE. CSE was diluted with culture medium to the desired concentration and used in experiments within 30 min. Cell transfection Small interfering RNA targeting VWF (si-VWF), small interfering RNA negative control (si-NC), plasmid overexpressing VWF (oe-VWF) and blank plasmid (oe-NC) were constructed and transfected into HuVECs using Lipofectamine™ 3000 Transfection Reagent (Invitrogen, USA). The specific operation is as follows: This study employed the pLVX-EGFP-IRES-Puro plasmid for oe-VWF. The expression cassette is driven by the CMV strong promoter to ensure high-efficiency transcription, with real-time monitoring of transfection efficiency via EGFP fluorescence and puromycin resistance (puro+). Transfection was performed when HuVECs grew to 70–90% confluence. Lipofectamine™ 3000 was diluted with Opti-MEM medium and mixed thoroughly. Then the nucleic acid to be transfected was diluted with Opti-MEM medium and P3000™ was added and mixed. The diluted Lipofectamine™ 3000 was mixed with the diluted nucleic acid in a 1:1 ratio and incubated at room temperature for 5 min. Add the mixture to the culture medium, shake well, and incubate at 37 °C for 3 days. and the transfection efficiency was detected by qRT-PCR and Western blot after 3 days of culture. Transwell co-culture HUVECs were transfected with the corresponding nucleic acids in advance according to the experimental grouping. For NaB pre-treatment, HuVECs were treated with 2 mM NaB (Merck, Germany) for 24 h. HUVECs and THP-1 cells were co-cultured using transwell chambers with 3 μm pore polycarbonate membranes (Merck, Germany). THP-1 cells were seeded in the upper chamber, while HuVECs from different treatment groups were seeded in the lower chamber. After 24 h of co-culture, the culture medium and THP-1 cells were collected for subsequent detection and analysis. Cell viability analysis Cell viability was measured using a Cell Counting Kit-8 (CCK-8) assay (Dojindo Laboratories, Japan). Briefly, HuVECs from different groups were seeded into 96-well plates and treated with 0%, 0.5%, 1%, 2.5%, 5%, and 10% CSE for 24 h. Subsequently, 10 µL of CCK-8 solution was added to each well containing complete medium, and the cells were incubated for 1 h. The absorbance of each well was measured at 450 nm using a microplate reader. Apoptosis detection Cell apoptosis was detected using an Annexin V/FITC apoptosis detection kit (Beijing Sizhengbai Biotechnology, China). Briefly, HuVECs were treated with 2.5% CSE, 2.5% CSE, and 2mM NaB for 24 h, respectively, and then the cells were digested with EDTA-free trypsin, washed twice with PBS, and resuspended in binding buffer to adjust the cell concentration to 1–5 × 10 6 Elisa According to the manufacturer’s instructions, the Human interleukin 1β (IL-1β) detection kit, Human interleukin 6 (IL-6) detection kit, Human interleukin 8 (IL-8) detection kit, human tumor necrosis factor α (TNF-α) detection kit, and human von Willebrand factor (VWF) detection kit (Elabscience, China) were used to measure the levels of IL-1β, IL-6, IL-8, TNF-α, and VWF in the supernatant of the co-culture medium. qRT-PCR Total RNA was extracted from cells using Trizol reagent (Invitrogen USA), and RNA was reversed into cDNA using SuperScript III First-Strand Synthesis System (invitrogen USA), followed by real-time quantification of cDNA using Maxima SYBR Green qPCR mix (invitrogen USA). Finally, gene expression was quantified using the 2 −ΔΔCt 1  Table 1 Primer information required for qRT-PCR Gene Name Primer sequence (5 , , β-Actin F TCCTCCTGAGCGCAAGTACTCC R CATACTCCTGCTTGCTGATCCAC GAPDH F AGGTCGGTGTGAACGGATTTG R GGGGTCGTTGATGGCAACA IL-1β F TTTGAGTCTGCCCAGTTCCC R GTTATATCCTGGCCGCCTT TNF-α F GCTCTTCTGCCTGCTGCACTT R ACATGGGCTACAGGCTTGTCAC IL-6 F CACAGACAGCCACTCACCT R GCCTCTTTGCTGCTTTCACAC IL-8 F CAGAGACAGCAGAGCACACA R CTCCTTGGCAAAACTGCACC F R Western blot The cells were lysed by ultrasonic disruption, and the supernatant of the lysate was collected. The protein concentration was determined using the BCA protein assay kit (Beyotime, China). The protein samples were diluted with protein loading buffer to a final concentration of 5 mg/mL. Then, 10 µL of protein sample was subjected to sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE) (Beyotime, China), and the separated products were transferred onto a polyvinylidene fluoride (PVDF) membrane (Millipore, USA) using a wet transfer method. The PVDF membrane was blocked with 5% skim milk for 1 h. Subsequently, the membrane was incubated overnight at 4 °C with the following primary antibodies: VWF Antibody (1:1000, Affinity, China), VE-Cadherin Antibody (1:500, Abcam, USA), PI3K p85 alpha Antibody (1:500, Affinity, China), Phospho-PI3K p85 alpha (Tyr607) Antibody (1:2000, Affinity, China), pan-AKT1/2/3 Antibody (1:1000, Affinity, China), and Phospho-AKT1/2/3 (Ser473) Antibody (1:1000, Affinity, China). After washing the PVDF membrane with PBST (phosphate-buffered saline containing Tween-20), the samples were incubated with Goat Anti-Mouse IgG H&L (1:5000, Abcam, USA) for 2 h. The membrane was developed using enhanced chemiluminescence (ECL) reagents (Beyotime, China) for 10 min, and images were captured using an infrared laser imaging system (Odyssey, LI-COR Biosciences, USA). The relative expression levels of the target proteins were analyzed using Image-Pro Plus software (Media Cybernetics, USA), with β-Actin or GAPDH specified as the internal reference. Fluorescein isothiocyanate (FITC)-dextran assay HUVECs were seeded into transwell chambers and cultured until confluence. The medium was removed, and cells were washed twice with PBS. Serum-free medium containing FITC-dextran (20 µg/mL, Yeasen Biotechnology, China) was added to the upper chamber, and serum-free medium was added to the lower chamber. After incubating for 1 h, the medium from the lower chamber was collected. Fluorescence intensity was measured using a fluorescent microplate reader (SpectraMax M5, Molecular Devices, USA) with FITC settings (Ex = 495 nm, Em = 525 nm). Permeability coefficient (P) is calculated using the formula: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:P=\\frac{{D}_{L}\\:\\times\\:\\:V}{{D}_{U}\\:\\times\\:\\:A\\:\\times\\:\\:T}$$\\end{document}  D L D U V: volume of the lower chamber (cm 3 A: effective area of the transwell membrane (cm²). T: incubation time (s). Statistical nalysis Statistical analysis was performed using GraphPad Prism 10.0. Data are presented as the mean ± standard deviation from three independent experiments. Statistical comparisons between two groups were conducted using the t-test. P Result VWF is a potential target for sodium butyrate in the treatment of COPD A total of 1764 COPD-related DEGs were identified in this study, including 658 upregulated genes and 1106 downregulated genes (Fig. 1 1 18 We constructed a PPI network using the DEGs and NaB potential targets, then performed RWR analysis using VWF as a seed. The top 50 genes based on affinity scores (Supplementary Table 2) were selected as genes closely related to VWF for functional enrichment analysis. The results indicated that regulation of angiogenesis, cell-substrate junction, cytokine activity, and the PI3K-AKT signaling pathway were closely associated with VWF (Fig 1  Fig. 1 VWF is a potential target for NaB to regulate COPD. A B C D Sodium butyrate alleviates CSE-induced HUVEC apoptosis and VWF expressions Since VWF is primarily produced by vascular endothelial cells [ 21 2 2 2 2  Fig. 2 Sodium butyrate alleviates CSE-induced HUVEC apoptosis and VWF expressions. A B C D E n p CSE-induced high expression of VWF in HUVECs can promote the inflammatory response of macrophages Due to the intercellular communication between vascular endothelial cells and macrophages, we found through literature review that VWF plays a critical role in macrophage activation and inflammatory responses [ 22 3 3 3 3 3 3  Fig. 3 CSE induces VWF produced by HUVEC to promote macrophage inflammatory response. A B C G H L M P n p CSE-induced high expression of VWF in HUVECs can activate the PI3K-AKT signaling pathway in macrophages Based on RWR and functional enrichment analysis, we find the PI3K-AKT signaling pathway as a potential mechanism through which NaB targets VWF to treat COPD. Therefore, we first examined the impact of endothelial VWF knockdown on macrophage PI3K-AKT signaling. Results demonstrated that VWF deficiency in endothelial cells significantly reduced phosphorylation levels of PI3K (p-PI3K) and AKT (p-AKT) in macrophages (Figs. 4 4  Fig. 4 CSE-induced VWF produced by HUVEC activates PI3K-AKT signaling pathway in macrophages. A B C D G n p Sodium butyrate reduces CSE-induced macrophage inflammatory responses and PI3K-AKT signaling pathway activation by inhibiting VWF To further investigate whether VWF is a key target for NaB in regulating endothelial cell–macrophage crosstalk, we performed functional rescue experiments using HUVEC cell lines transfected with oe-VWF (Fig. 5 5 5 6  Fig. 5 Sodium butyrate inhibits VWF to reduce CSE-induced macrophage inflammatory responses. A B C F G I n p  Fig. 6 Sodium butyrate inhibits VWF and reduces CSE-induced activation of PI3K-AKT signaling pathway in macrophages. A B E n p Sodium butyrate reduces CSE-induced endothelial cell injuries by inhibiting VWF To investigate the regulatory role of macrophages in endothelial cell injury, we examined the effects of macrophage presence/absence and NaB on VE-cadherin expression and cellular permeability in CSE-exposed endothelial cells. As shown in Fig. 7 7  Fig. 7 Sodium butyrate reduces CSE-induced endothelial cell injuries by inhibiting VWF. ( A) B) n p Discussion The prevalence and mortality of COPD are continuously rising worldwide, and the inflammatory response of macrophages plays a key role in the progression of COPD. This study found that CSE induces high expression of VWF in endothelial cells, and VWF produced by endothelial cells can activate the inflammatory response of macrophages. Conversely, the macrophage inflammatory response further exacerbates CSE-induced endothelial cell injury. NaB can inhibit VWF, thereby alleviating CSE-induced endothelial cell–macrophage crosstalk. Elevated VWF levels are significantly associated with lung epithelial injury, emphysema, acute exacerbations, and increased mortality risk in COPD patients [ 18 23 24 26 22 27 In our study, we observed that the PI3K/AKT signaling pathway was activated during the process of VWF-induced macrophage activation. Previous research has shown that PI3K-AKT is critical for macrophage activation and the secretion of inflammatory cytokines in COPD [ 28 29 30 31 33 NaB, as an endogenous short-chain fatty acid, has been shown to have inhibitory effects on COPD [ 15 34 35 36 37 38 39 15 The direct regulatory effects of NaB on macrophages have been widely reported [ 40 41 42 However, this study has several limitations that require further investigation. First, the proposed mechanism has only been demonstrated in an in vitro cell model, lacking validation in vivo using animal models. Second, it remains unverified whether VWF-mediated macrophage activation is dependent on the PI3K-AKT pathway. This study also does not clarify whether HUVECs directly secrete VWF to act on macrophages or if VWF regulates other secreted substances that influence macrophage inflammation. These mechanisms require further exploration. Although it has been observed that NaB levels are reduced in COPD patients and supplementation with NaB can reduce inflammation in COPD animal models, whether NaB supplementation offers superior anti-inflammatory effects compared to conventional COPD treatments remains to be further studied. Notably, ensifentrine—a drug recently approved for COPD treatment—has been shown to mitigate MRSA-induced endothelial injury by stabilizing VE-cadherin junctions and suppressing pro-inflammatory signaling [ 43 Conclusion This study demonstrated that VWF expressed by CSE-induced HUVECs can activate macrophage inflammatory responses and the PI3K-AKT signaling pathway. These activated macrophages further exacerbate CSE-induced endothelial injury. NaB can inhibit CSE-induced VWF, thereby suppressing CSE-induced endothelial cell–macrophage crosstalk and alleviating macrophage inflammation and endothelial damage (Fig. 8  Fig. 8 Sodium butyrate targets VWF to inhibit cigarette smoke extract-induced endothelial cell-macrophage crosstalk in regulating inflammatory response Supplementary Information  Supplementary Material 1.  Supplementary Material 2.  Supplementary Material 3. Abbreviations COPD Chronic obstructive pulmonary disease NaB Sodium Butyrate CSE Cigarette smoke extract HUVECs Human umbilical vein endothelial cells VWF Von Willebrand Factor Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Xiaolong Ma, Jiaqi Zhou and Shuyou Yang contributed equally to this work. Authors’ contributions Xiaolong Ma: Conceptualization, Methodology, Data Curation, Validation, Visualization, Writing - Original Draft.Jiaqi Zhou: Conceptualization, Methodology, Data Curation, Validation, Formal Analysis.Shuyou Yang: Methodology, Data Curation, Writing - Original Draft.Yingqing Zhang: Resources, Methodology.Chaoping Zhu: Methodology, Visualization.Yuejiao Sun: Writing - Original Draft.Jinli Miao: Formal Analysis.Hongyan Mo: Supervision, Writing - Review & Editing. Funding This research was supported by National Oncology Clinical Key Speciality (2023-GJZK-001), Jiaxing Key Laboratory of Precision Treatment for Lung Cancer, Key Construction Disciplines of Provincial and Municipal Co construction of Zhejiang (NO.2023-SSGJ-002). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Competing interests The authors declare no competing interests. References 1. Christenson SA Smith BM Bafadhel M Putcha N Chronic obstructive pulmonary disease Lancet 2022 399 10342 2227 42 10.1016/S0140-6736(22)00470-6 35533707 Christenson SA, Smith BM, Bafadhel M, Putcha N. Chronic obstructive pulmonary disease. Lancet. 2022;399(10342):2227–42. 35533707 10.1016/S0140-6736(22)00470-6 2. Kahnert K Jorres RA Behr J Welte T The diagnosis and treatment of COPD and its comorbidities Dtsch Arztebl Int 2023 120 25 434 44 36794439 10.3238/arztebl.m2023.027 PMC10478768 Kahnert K, Jorres RA, Behr J, Welte T. The diagnosis and treatment of COPD and its comorbidities. Dtsch Arztebl Int. 2023;120(25):434–44. 36794439 10.3238/arztebl.m2023.027 PMC10478768 3. Boers E, Barrett M, Su JG, Benjafield AV, Sinha S, Kaye L, et al. Global burden of chronic obstructive pulmonary disease through 2050. JAMA Netw Open. 2023;6(12):e2346598. 10.1001/jamanetworkopen.2023.46598 PMC10704283 38060225 4. Matera MG Cazzola M Page C Prospects for COPD treatment Curr Opin Pharmacol 2021 56 74 84 10.1016/j.coph.2020.11.003 33333428 Matera MG, Cazzola M, Page C. Prospects for COPD treatment. Curr Opin Pharmacol. 2021;56:74–84. 33333428 10.1016/j.coph.2020.11.003 5. Brightling C Greening N Airway inflammation in COPD: progress to precision medicine Eur Respir J 2019 10.1183/13993003.00651-2019 31073084 Brightling C, Greening N. Airway inflammation in COPD: progress to precision medicine. Eur Respir J. 2019. 10.1183/13993003.00651-2019. 31073084 10.1183/13993003.00651-2019 6. Barnes PJ Inflammatory mechanisms in patients with chronic obstructive pulmonary disease J Allergy Clin Immunol 2016 138 1 16 27 10.1016/j.jaci.2016.05.011 27373322 Barnes PJ. Inflammatory mechanisms in patients with chronic obstructive pulmonary disease. J Allergy Clin Immunol. 2016;138(1):16–27. 27373322 10.1016/j.jaci.2016.05.011 7. Xu J Zeng Q Li S Su Q Fan H Inflammation mechanism and research progress of COPD Front Immunol 2024 15 1404615 10.3389/fimmu.2024.1404615 39185405 PMC11341368 Xu J, Zeng Q, Li S, Su Q, Fan H. Inflammation mechanism and research progress of COPD. Front Immunol. 2024;15:1404615. 39185405 10.3389/fimmu.2024.1404615 PMC11341368 8. Barnes PJ Role of HDAC2 in the pathophysiology of COPD Annu Rev Physiol 2009 71 451 64 10.1146/annurev.physiol.010908.163257 18817512 Barnes PJ. Role of HDAC2 in the pathophysiology of COPD. Annu Rev Physiol. 2009;71:451–64. 18817512 10.1146/annurev.physiol.010908.163257 9. Zhou Z Xu N Matei N McBride DW Ding Y Liang H Sodium butyrate attenuated neuronal apoptosis via GPR41/Gbetagamma/PI3K/Akt pathway after MCAO in rats J Cereb Blood Flow Metab 2021 41 2 267 81 10.1177/0271678X20910533 32151222 PMC8370004 Zhou Z, Xu N, Matei N, McBride DW, Ding Y, Liang H, et al. Sodium butyrate attenuated neuronal apoptosis via GPR41/Gbetagamma/PI3K/Akt pathway after MCAO in rats. J Cereb Blood Flow Metab. 2021;41(2):267–81. 32151222 10.1177/0271678X20910533 PMC8370004 10. Weiss SL Zhang D Farooqi S Wallace DC Sodium butyrate reverses lipopolysaccharide-induced mitochondrial dysfunction in lymphoblasts J Cell Mol Med 2022 26 11 3290 3 10.1111/jcmm.17342 35587004 PMC9170810 Weiss SL, Zhang D, Farooqi S, Wallace DC. Sodium butyrate reverses lipopolysaccharide-induced mitochondrial dysfunction in lymphoblasts. J Cell Mol Med. 2022;26(11):3290–3. 35587004 10.1111/jcmm.17342 PMC9170810 11. Chen X Su W Wan T Yu J Zhu W Tang F Sodium butyrate regulates Th17/Treg cell balance to ameliorate uveitis via the Nrf2/HO-1 pathway Biochem Pharmacol 2017 142 111 9 10.1016/j.bcp.2017.06.136 28684304 Chen X, Su W, Wan T, Yu J, Zhu W, Tang F, et al. Sodium butyrate regulates Th17/Treg cell balance to ameliorate uveitis via the Nrf2/HO-1 pathway. Biochem Pharmacol. 2017;142:111–9. 28684304 10.1016/j.bcp.2017.06.136 12. Kazmierczak-Siedlecka K Marano L Merola E Roviello F Polom K Sodium butyrate in both prevention and supportive treatment of colorectal cancer Front Cell Infect Microbiol 2022 12 1023806 10.3389/fcimb.2022.1023806 36389140 PMC9643746 Kazmierczak-Siedlecka K, Marano L, Merola E, Roviello F, Polom K. Sodium butyrate in both prevention and supportive treatment of colorectal cancer. Front Cell Infect Microbiol. 2022;12:1023806. 36389140 10.3389/fcimb.2022.1023806 PMC9643746 13. Zhang N Qin B Research progress of sodium butyrate in metabolic-associated fatty liver disease Zhonghua Gan Zang Bing Za Zhi 2021 29 12 1229 32 35045647 10.3760/cma.j.cn501113-20201113-00614 Zhang N, Qin B. Research progress of sodium butyrate in metabolic-associated fatty liver disease. Zhonghua Gan Zang Bing Za Zhi. 2021;29(12):1229–32. 35045647 10.3760/cma.j.cn501113-20201113-00614 14. Facchin S Vitulo N Calgaro M Buda A Romualdi C Pohl D Microbiota changes induced by microencapsulated sodium butyrate in patients with inflammatory bowel disease Neurogastroenterol Motil 2020 32 10 e13914 10.1111/nmo.13914 32476236 PMC7583468 Facchin S, Vitulo N, Calgaro M, Buda A, Romualdi C, Pohl D, et al. Microbiota changes induced by microencapsulated sodium butyrate in patients with inflammatory bowel disease. Neurogastroenterol Motil. 2020;32(10):e13914. 32476236 10.1111/nmo.13914 PMC7583468 15. Zhao Z Tong Y Kang Y Qiu Z Li Q Xu C Sodium butyrate (SB) ameliorated inflammation of COPD induced by cigarette smoke through activating the GPR43 to inhibit NF-kappaB/MAPKs signaling pathways Mol Immunol 2023 163 224 34 10.1016/j.molimm.2023.10.007 37864932 Zhao Z, Tong Y, Kang Y, Qiu Z, Li Q, Xu C, et al. Sodium butyrate (SB) ameliorated inflammation of COPD induced by cigarette smoke through activating the GPR43 to inhibit NF-kappaB/MAPKs signaling pathways. Mol Immunol. 2023;163:224–34. 37864932 10.1016/j.molimm.2023.10.007 16. Gragnano F Sperlongano S Golia E Natale F Bianchi R Crisci M The role of von Willebrand factor in vascular inflammation: from pathogenesis to targeted therapy Mediators Inflamm 2017 10.1155/2017/5620314 28634421 PMC5467347 Gragnano F, Sperlongano S, Golia E, Natale F, Bianchi R, Crisci M, et al. The role of von Willebrand factor in vascular inflammation: from pathogenesis to targeted therapy. Mediators Inflamm. 2017. 10.1155/2017/5620314. 28634421 10.1155/2017/5620314 PMC5467347 17. Bartholo TP Costa CH Rufino R Evaluation of von Willebrand factor in COPD patients J Bras Pneumol 2014 40 4 373 9 10.1590/S1806-37132014000400004 25210959 PMC4201167 Bartholo TP, Costa CH, Rufino R. Evaluation of von Willebrand factor in COPD patients. J Bras Pneumol. 2014;40(4):373–9. 25210959 10.1590/S1806-37132014000400004 PMC4201167 18. Langholm LL Ronnow SR Sand JMB Leeming DJ Tal-Singer R Miller BE Increased von Willebrand factor processing in COPD, reflecting lung epithelium damage, is associated with emphysema, exacerbations and elevated mortality risk Int J Chron Obstruct Pulmon Dis 2020 15 543 52 10.2147/COPD.S235673 32210548 PMC7069584 Langholm LL, Ronnow SR, Sand JMB, Leeming DJ, Tal-Singer R, Miller BE, et al. Increased von Willebrand factor processing in COPD, reflecting lung epithelium damage, is associated with emphysema, exacerbations and elevated mortality risk. Int J Chron Obstruct Pulmon Dis. 2020;15:543–52. 32210548 10.2147/COPD.S235673 PMC7069584 19. van der Vorm LN Li L Huskens D Hulstein JJJ Roest M de Groot PG Acute exacerbations of COPD are associated with a prothrombotic state through platelet-monocyte complexes, endothelial activation and increased thrombin generation Respir Med 2020 171 106094 10.1016/j.rmed.2020.106094 32758992 van der Vorm LN, Li L, Huskens D, Hulstein JJJ, Roest M, de Groot PG, et al. Acute exacerbations of COPD are associated with a prothrombotic state through platelet-monocyte complexes, endothelial activation and increased thrombin generation. Respir Med. 2020;171:106094. 32758992 10.1016/j.rmed.2020.106094 20. Jin Y Zhu K Wu S He S Cao C Biomarkers of prothrombotic state and risk assessment of exacerbations in patients with chronic obstructive pulmonary disease Int J Chron Obstruct Pulmon Dis 2024 19 2273 83 10.2147/COPD.S466563 39416877 PMC11480642 Jin Y, Zhu K, Wu S, He S, Cao C. Biomarkers of prothrombotic state and risk assessment of exacerbations in patients with chronic obstructive pulmonary disease. Int J Chron Obstruct Pulmon Dis. 2024;19:2273–83. 39416877 10.2147/COPD.S466563 PMC11480642 21. Fliesser E Jandl K Lins T Birnhuber A Valzano F Kolb D Lung fibrosis is linked to increased endothelial cell activation and dysfunctional vascular barrier integrity Am J Respir Cell Mol Biol 2024 71 3 318 31 10.1165/rcmb.2024-0046OC 38843440 Fliesser E, Jandl K, Lins T, Birnhuber A, Valzano F, Kolb D, et al. Lung fibrosis is linked to increased endothelial cell activation and dysfunctional vascular barrier integrity. Am J Respir Cell Mol Biol. 2024;71(3):318–31. 38843440 10.1165/rcmb.2024-0046OC 22. Drakeford C Aguila S Roche F Hokamp K Fazavana J Cervantes MP Von willebrand factor links primary hemostasis to innate immunity Nat Commun 2022 13 1 6320 10.1038/s41467-022-33796-7 36329021 PMC9633696 Drakeford C, Aguila S, Roche F, Hokamp K, Fazavana J, Cervantes MP, et al. Von willebrand factor links primary hemostasis to innate immunity. Nat Commun. 2022;13(1):6320. 36329021 10.1038/s41467-022-33796-7 PMC9633696 23. Zhu L Xu F Kang X Zhou J Yao Q Lin Y The antioxidant N-acetylcysteine promotes immune response and inhibits epithelial-mesenchymal transition to alleviate pulmonary fibrosis in chronic obstructive pulmonary disease by suppressing the VWF/p38 MAPK axis Mol Med 2021 27 1 97 10.1186/s10020-021-00342-y 34479474 PMC8414683 Zhu L, Xu F, Kang X, Zhou J, Yao Q, Lin Y, et al. The antioxidant N-acetylcysteine promotes immune response and inhibits epithelial-mesenchymal transition to alleviate pulmonary fibrosis in chronic obstructive pulmonary disease by suppressing the VWF/p38 MAPK axis. Mol Med. 2021;27(1):97. 34479474 10.1186/s10020-021-00342-y PMC8414683 24. Hillgruber C Steingraber AK Poppelmann B Denis CV Ware J Vestweber D Blocking von Willebrand factor for treatment of cutaneous inflammation J Invest Dermatol 2014 134 1 77 86 10.1038/jid.2013.292 23812299 Hillgruber C, Steingraber AK, Poppelmann B, Denis CV, Ware J, Vestweber D, et al. Blocking von Willebrand factor for treatment of cutaneous inflammation. J Invest Dermatol. 2014;134(1):77–86. 23812299 10.1038/jid.2013.292 25. Petri B Broermann A Li H Khandoga AG Zarbock A Krombach F Von Willebrand factor promotes leukocyte extravasation Blood 2010 116 22 4712 9 10.1182/blood-2010-03-276311 20716766 Petri B, Broermann A, Li H, Khandoga AG, Zarbock A, Krombach F, et al. Von Willebrand factor promotes leukocyte extravasation. Blood. 2010;116(22):4712–9. 20716766 10.1182/blood-2010-03-276311 26. Lerolle N Dunois-Larde C Badirou I Motto DG Hill G Bruneval P Von Willebrand factor is a major determinant of ADAMTS-13 decrease during mouse sepsis induced by cecum ligation and puncture J Thromb Haemost 2009 7 5 843 50 10.1111/j.1538-7836.2009.03313.x 19187073 Lerolle N, Dunois-Larde C, Badirou I, Motto DG, Hill G, Bruneval P, et al. Von Willebrand factor is a major determinant of ADAMTS-13 decrease during mouse sepsis induced by cecum ligation and puncture. J Thromb Haemost. 2009;7(5):843–50. 19187073 10.1111/j.1538-7836.2009.03313.x 27. Donat C Thanei S Trendelenburg M Binding of von Willebrand factor to complement C1q decreases the phagocytosis of cholesterol crystals and subsequent IL-1 secretion in macrophages Front Immunol 2019 10 2712 10.3389/fimmu.2019.02712 31824501 PMC6881245 Donat C, Thanei S, Trendelenburg M. Binding of von Willebrand factor to complement C1q decreases the phagocytosis of cholesterol crystals and subsequent IL-1 secretion in macrophages. Front Immunol. 2019;10:2712. 31824501 10.3389/fimmu.2019.02712 PMC6881245 28. Dong Y Dong Y Zhu C Yang L Wang H Li J Targeting CCL2-CCR2 signaling pathway alleviates macrophage dysfunction in COPD via PI3K-AKT axis Cell Commun Signal 2024 22 1 364 10.1186/s12964-024-01746-z 39014433 PMC11253350 Dong Y, Dong Y, Zhu C, Yang L, Wang H, Li J, et al. Targeting CCL2-CCR2 signaling pathway alleviates macrophage dysfunction in COPD via PI3K-AKT axis. Cell Commun Signal. 2024;22(1):364. 39014433 10.1186/s12964-024-01746-z PMC11253350 29. Polumuri SK Toshchakov VY Vogel SN Role of phosphatidylinositol-3 kinase in transcriptional regulation of TLR-induced IL-12 and IL-10 by Fc gamma receptor ligation in murine macrophages J Immunol 2007 179 1 236 46 10.4049/jimmunol.179.1.236 17579043 Polumuri SK, Toshchakov VY, Vogel SN. Role of phosphatidylinositol-3 kinase in transcriptional regulation of TLR-induced IL-12 and IL-10 by Fc gamma receptor ligation in murine macrophages. J Immunol. 2007;179(1):236–46. 17579043 10.4049/jimmunol.179.1.236 30. Pengal RA Ganesan LP Wei G Fang H Ostrowski MC Tridandapani S Lipopolysaccharide-induced production of interleukin-10 is promoted by the serine/threonine kinase Akt Mol Immunol 2006 43 10 1557 64 10.1016/j.molimm.2005.09.022 16263172 Pengal RA, Ganesan LP, Wei G, Fang H, Ostrowski MC, Tridandapani S. Lipopolysaccharide-induced production of interleukin-10 is promoted by the serine/threonine kinase Akt. Mol Immunol. 2006;43(10):1557–64. 16263172 10.1016/j.molimm.2005.09.022 31. Arranz A Doxaki C Vergadi E Martinez de la Torre Y Vaporidi K Lagoudaki ED Akt1 and Akt2 protein kinases differentially contribute to macrophage polarization Proc Natl Acad Sci U S A 2012 109 24 9517 22 10.1073/pnas.1119038109 22647600 PMC3386059 Arranz A, Doxaki C, Vergadi E, Martinez de la Torre Y, Vaporidi K, Lagoudaki ED, et al. Akt1 and Akt2 protein kinases differentially contribute to macrophage polarization. Proc Natl Acad Sci U S A. 2012;109(24):9517–22. 22647600 10.1073/pnas.1119038109 PMC3386059 32. Vergadi E Vaporidi K Theodorakis EE Doxaki C Lagoudaki E Ieronymaki E Akt2 deficiency protects from acute lung injury via alternative macrophage activation and miR-146a induction in mice J Immunol 2014 192 1 394 406 10.4049/jimmunol.1300959 24277697 Vergadi E, Vaporidi K, Theodorakis EE, Doxaki C, Lagoudaki E, Ieronymaki E, et al. Akt2 deficiency protects from acute lung injury via alternative macrophage activation and miR-146a induction in mice. J Immunol. 2014;192(1):394–406. 24277697 10.4049/jimmunol.1300959 33. Gauna AE Cha S Akt2 deficiency as a therapeutic strategy protects against acute lung injury Immunotherapy 2014 6 4 377 80 10.2217/imt.14.5 24815778 PMC4383239 Gauna AE, Cha S. Akt2 deficiency as a therapeutic strategy protects against acute lung injury. Immunotherapy. 2014;6(4):377–80. 24815778 10.2217/imt.14.5 PMC4383239 34. Wang T Su W Li L Wu H Huang H Li Z Alteration of the gut microbiota in patients with lung cancer accompanied by chronic obstructive pulmonary diseases Heliyon 2024 10 9 e30380 10.1016/j.heliyon.2024.e30380 38737249 PMC11088322 Wang T, Su W, Li L, Wu H, Huang H, Li Z. Alteration of the gut microbiota in patients with lung cancer accompanied by chronic obstructive pulmonary diseases. Heliyon. 2024;10(9): e30380. 38737249 10.1016/j.heliyon.2024.e30380 PMC11088322 35. Wang J Ren C Jin L Batu W Seabuckthorn Wuwei pulvis attenuates chronic obstructive pulmonary disease in rat through gut microbiota-short chain fatty acids axis J Ethnopharmacol 2023 314 116591 10.1016/j.jep.2023.116591 37146846 Wang J, Ren C, Jin L, Batu W. Seabuckthorn Wuwei pulvis attenuates chronic obstructive pulmonary disease in rat through gut microbiota-short chain fatty acids axis. J Ethnopharmacol. 2023;314:116591. 37146846 10.1016/j.jep.2023.116591 36. Mao J Li Y Bian Q Xuan Y Li J Wang Z The bufei Jianpi formula improves mucosal immune function by remodeling gut microbiota through the SCFAs/GPR43/NLRP3 pathway in chronic obstructive pulmonary disease rats Int J Chron Obstruct Pulmon Dis 2022 17 1285 98 10.2147/COPD.S359428 35673595 PMC9167601 Mao J, Li Y, Bian Q, Xuan Y, Li J, Wang Z, et al. The bufei Jianpi formula improves mucosal immune function by remodeling gut microbiota through the SCFAs/GPR43/NLRP3 pathway in chronic obstructive pulmonary disease rats. Int J Chron Obstruct Pulmon Dis. 2022;17:1285–98. 35673595 10.2147/COPD.S359428 PMC9167601 37. Yan M Li X Sun C Tan J Liu Y Li M Sodium butyrate attenuates AGEs-induced oxidative stress and inflammation by inhibiting autophagy and affecting cellular metabolism in THP-1 cells Molecules 2022 10.3390/molecules27248715 36557849 PMC9781837 Yan M, Li X, Sun C, Tan J, Liu Y, Li M, et al. Sodium butyrate attenuates AGEs-induced oxidative stress and inflammation by inhibiting autophagy and affecting cellular metabolism in THP-1 cells. Molecules. 2022. 10.3390/molecules27248715. 36557849 10.3390/molecules27248715 PMC9781837 38. Hu C Zeng D Huang Y Deng Q Liu S Zhou W Sodium butyrate ameliorates atopic Dermatitis-Induced inflammation by inhibiting HDAC3-Mediated STAT1 and NF-kappaB pathway Inflammation 2024 47 3 989 1001 10.1007/s10753-023-01955-7 38159175 Hu C, Zeng D, Huang Y, Deng Q, Liu S, Zhou W, et al. Sodium butyrate ameliorates atopic Dermatitis-Induced inflammation by inhibiting HDAC3-Mediated STAT1 and NF-kappaB pathway. Inflammation. 2024;47(3):989–1001. 38159175 10.1007/s10753-023-01955-7 39. Zhao Y Sun H Chen Y Niu Q Dong Y Li M Butyrate protects against MRSA pneumonia via regulating gut-lung microbiota and alveolar macrophage M2 polarization mBio 2023 14 5 e0198723 10.1128/mbio.01987-23 37754570 PMC10653920 Zhao Y, Sun H, Chen Y, Niu Q, Dong Y, Li M, et al. Butyrate protects against MRSA pneumonia via regulating gut-lung microbiota and alveolar macrophage M2 polarization. mBio. 2023;14(5):e0198723. 37754570 10.1128/mbio.01987-23 PMC10653920 40. Luo QJ Sun MX Guo YW Tan SW Wu XY Abassa KK Sodium butyrate protects against lipopolysaccharide-induced liver injury partially via the GPR43/ beta-arrestin-2/NF-kappaB network Gastroenterol Rep (Oxf) 2021 9 2 154 65 10.1093/gastro/goaa085 34026223 PMC8128024 Luo QJ, Sun MX, Guo YW, Tan SW, Wu XY, Abassa KK, et al. Sodium butyrate protects against lipopolysaccharide-induced liver injury partially via the GPR43/ beta-arrestin-2/NF-kappaB network. Gastroenterol Rep (Oxf). 2021;9(2):154–65. 34026223 10.1093/gastro/goaa085 PMC8128024 41. Pan X Fang X Wang F Li H Niu W Liang W Butyrate ameliorates caerulein-induced acute pancreatitis and associated intestinal injury by tissue-specific mechanisms Br J Pharmacol 2019 176 23 4446 61 10.1111/bph.14806 31347703 PMC6932943 Pan X, Fang X, Wang F, Li H, Niu W, Liang W, et al. Butyrate ameliorates caerulein-induced acute pancreatitis and associated intestinal injury by tissue-specific mechanisms. Br J Pharmacol. 2019;176(23):4446–61. 31347703 10.1111/bph.14806 PMC6932943 42. Hosseinkhani B Kuypers S van den Akker NMS Molin DGM Michiels L Extracellular vesicles work as a functional inflammatory mediator between vascular endothelial cells and immune cells Front Immunol 2018 9 1789 10.3389/fimmu.2018.01789 30131806 PMC6091278 Hosseinkhani B, Kuypers S, van den Akker NMS, Molin DGM, Michiels L. Extracellular vesicles work as a functional inflammatory mediator between vascular endothelial cells and immune cells. Front Immunol. 2018;9:1789. 30131806 10.3389/fimmu.2018.01789 PMC6091278 43. Al Matni MY Meliton L Dudek SM Letsiou E Dual inhibition of phosphodiesterase 3 and 4 enzymes by ensifentrine protects against MRSA-induced lung endothelial and epithelial dysfunction Cells 2024 13 21 1750 10.3390/cells13211750 39513857 PMC11545647 Al Matni MY, Meliton L, Dudek SM, Letsiou E. Dual inhibition of phosphodiesterase 3 and 4 enzymes by ensifentrine protects against MRSA-induced lung endothelial and epithelial dysfunction. Cells. 2024;13(21):1750. 39513857 10.3390/cells13211750 PMC11545647 ",
  "metadata": {
    "Title of this paper": "Dual inhibition of phosphodiesterase 3 and 4 enzymes by ensifentrine protects against MRSA-induced lung endothelial and epithelial dysfunction",
    "Journal it was published in:": "Respiratory Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486758/"
  }
}