{
  "title": "Paper_277",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12488628 PMC12488628.1 12488628 12488628 10.3389/fimmu.2025.1607388 1 Immunology Review Gut microbiota: a promising new target in immune tolerance Almansour Nourah  1 Al-Rashed Fatema  1 Choudhry Khubaib  2 Alqaderi Hend  3 Sindhu Sardar  1  4 Al-Mulla Fahd  5 Ahmad Rasheed  1  *  1 Department of Immunology & Microbiology, Dasman Diabetes Institute Dasman Kuwait  2 Department of Human Biology, University of Toronto Toronto, ON Canada  3 Department of Public Health and Community Service, Tufts University School of Dental Medicine Boston, MA United States  4 Animal & Imaging Core Facilities, Dasman Diabetes Institute Dasman Kuwait  5 Department of Translational Research, Dasman Diabetes Institute Dasman Kuwait Edited by: Karolina Kaźmierczak-Siedlecka, Medical University of Gdansk, Poland Reviewed by: Ata Ur Rehman  Panida Sittipo Jayvadan Jayantilal Vaishnav, Parul University, India *Correspondence: Rasheed Ahmad, rasheed.ahmad@dasmaninstitute.org 18 9 2025 2025 16 480569 1607388 07 4 2025 01 9 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Almansour, Al-Rashed, Choudhry, Alqaderi, Sindhu, Al-Mulla and Ahmad. 2025 Almansour, Al-Rashed, Choudhry, Alqaderi, Sindhu, Al-Mulla and Ahmad https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Gut microbiota research has highlighted its pivotal role in human health and disease. Its composition is shaped by diet, genetics, age, and environmental factors. When the balance of these microbes is disrupted (dysbiosis), it can contribute to health problems like metabolic, inflammatory, and mental disorders. The microbiota supports digestion, fermentation, and vitamin production, which are essential for overall health. The gut microbiota has emerged as a critical modulator of immune function, with increasing evidence highlighting its role in establishing and maintaining immune tolerance. Despite significant advances in understanding the interactions between the gut microbiome and immune system, gaps remain in the literature regarding the specific mechanisms through which microbiota influences immune tolerance. This review aims to address these knowledge gaps by synthesizing current research on the microbiota impact on immune tolerance, emphasizing key factors such as microbial diversity, metabolic byproducts, and the microbiota interaction with immune cells, specifically focusing on the role of microbial tryptophan metabolites in PD-1/PD-L1 tolerance. We also highlight critical areas for future research, including the identification of microbial species or strains that can modulate immune tolerance, the influence of diet and environmental factors on microbiota composition, and the development of microbiota-based therapies. By bridging these gaps, this review seeks to provide a comprehensive understanding of the mechanistic role of microbiota immune tolerance and its potential as a novel therapeutic target for autoimmune and inflammatory diseases. gut microbiota immune tolerance immune modulation Treg probiotics Kuwait Foundation for the Advancement of Sciences 10.13039/501100003286 The author(s) declare financial support was received for the research and/or publication of this article. This work was supported by funds from the Kuwait Foundation for the Advancement of Sciences (KFAS) (Grant number: RA AM-2023-021). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Mucosal Immunity Introduction An overview of gut microbiota and its function The exploration of gut microbiota has undergone remarkable progress over the past few decades. Initially, the presence of microorganisms in the gut was acknowledged in the late 19th and early 20th centuries, but their roles were not largely unraveled ( 1 2 The gut microbiota consists of a diverse community of microorganisms, including bacteria, viruses, fungi, protozoa, and archaea ( 3 4 5 6 7 Functionally, gut microbiota plays a central role in numerous physiological processes. It is instrumental in the digestion and fermentation of complex carbohydrates, leading to the production of short-chain fatty acids (SCFAs) like acetate, propionate, and butyrate ( 8 9 10 11 12 13 14 15 16 Role of gut microbiota in immune modulation This diverse community of microorganisms can impact numerous health and disease-related factors, given the extensive genetic repertoire of genes carried by the various bacterial species present in the gut. The gut microbiota plays a crucial role in immune modulation, influencing both local and systemic immune responses. Studies have revealed that the gut microbiota can affect multiple functions in the human body, including the immune system through factors that affect its modulation (altered responses to maintain immune balance), maturation, and functioning ( 17 18 19 Gut microbiota is critical to shaping the immune system during infancy. It contributes to the training of the immune system, enabling it to identify harmful pathogens while recognizing harmless substances, thus facilitating immune tolerance and preventing excessive immune reactivities to non-threatening antigens ( 20 18 21 22 23 24  Figure 1 25 26 Lactobacillus Bifidobacterium Akkermansia Desulfovibrio Klebsiella  Table 1 37 38 Figure 1 Symbiosis vs dysbiosis in gut microbiota. Schematic illustration demonstrates the immunological consequences of a balanced (symbiotic) versus disrupted (dysbiotic) gut microbiota. In symbiosis, commensal microbes produce SCFAs and other beneficial metabolites that reinforce barrier integrity and promote anti-inflammatory Treg responses via IL-10. In contrast, dysbiosis favors LPS-producing pathobionts, promoting barrier disruption, dendritic cell activation, Th17 skewing, and systemic inflammation through TLR4 signaling. These microbial shifts influence not only local gut immunity but also systemic inflammatory tone, linking gut health to chronic diseases. Illustration showing the relationship between gut microbiota and immune response. On the left, symbiotic microbiota in the gut produce beneficial compounds like IPA and SCFAs, increasing Treg cells and IL-10, while reducing Th17, IL-6, and IL-17. On the right, dysbiosis with harmful bacteria increases IL-6 and IL-17, disrupting immune balance. Dendritic cells interact with T cells, regulating immune responses through cytokines IL-10, IL-35, and TGF-β. The diagram highlights good versus bad microbial balance in the gut. Table 1 Gut bacteria and their products and functions. Bacteria Products Functions Adaptive immune functions Human vs. murine evidence Clinical correlations References  Lactobacillus plantarum Anti-inflammatory cytokines Enhances intestinal barrier repair, modulates immune responses, reduces IL-6 and IL-17 levels, and increases IL-10 levels Reduces inflammation and boosts IL-10. Both; murine restoration of DC function Restores DC tolerogenicity; age-related immune decline ( 27 28  Akkermansia muciniphila Anti-inflammatory mediators Strengthens the intestinal barrier, reduces inflammation, and balances cytokine levels Promotes anti-inflammatory environments. Both; enriched in lean/healthy human subjects Inverse correlation with obesity and inflammation ( 27  Clostridium orogenes Indole-3-propionic acid (IPA), branched-chain fatty acids (BCFAs), short-chain fatty acids (SCFAs) Promotes immune balance by reducing inflammation, suppressing T-helper 17 (Th17) cells, and enhancing Foxp3+ regulatory T cells (Tregs) Produces metabolites like SCFAs and IPA. Primarily murine; colitis protection in mice Protective effect against colitis in models ( 29  Bacteroides fragilis Polysaccharide A Induces Treg development, supporting immune tolerance Produces polysaccharide A, which induces Treg cell development. Both; PSA effects shown in mice and human DCs Reduced in IBD patients; Treg support in trials ( 30  Segmented Filamentous Bacteria (SFB) Pro-inflammatory mediators (e.g., IL-17 stimulators) Modulates Th17 and Treg balance, supports mucosal immunity, regulates cytokine production Promotes the Th17 cells differentiation critical for mucosal immunity. Murine; key for Th17 in mice only Not present in humans; no clinical utility ( 31 33  Faecalibacterium prausnitzii Short-chain fatty acids e.g. butyrate Supports gut barrier integrity, exerts anti-inflammatory effects, and promotes Treg differentiation Produces butyrate, which supports Treg development. Primarily murine; human association limited Reduced in T2D, IBD; correlates with low butyrate ( 34  Eubacterium rectale Butyrate Enhances Treg activity and maintains intestinal health Contributes to immune tolerance and gut homeostasis by maintaining barrier function and Treg differentiation Primarily murine; inferred from SCFA levels Correlates with healthy microbiota in IBD meta-analyses ( 34  Bifidobacterium Acetate and other SCFAs Maintains gut barrier integrity, supports growth of beneficial microbes, modulates immune responses Produces SCFAs like acetate, contributing to immune homeostasis. Human meta-analyses and murine models Higher in infants with better gut health; supports immunity ( 34  Desulfovibrio Hydrogen sulfide Potentially disrupts gut homeostasis; reduction correlates with decreased inflammation High levels are associated with dysbiosis and increased inflammatory responses. Limited human data; murine inflammatory profiles Elevated in IBD patients; potential marker of dysbiosis ( 25  Klebsiella Lipopolysaccharides (LPS) Triggers inflammation: reduction improves immune regulation Overgrowth is linked to gut dysbiosis and pro-inflammatory cytokine release. Both; increased in human dysbiosis and mice Overgrowth seen in metabolic and inflammatory diseases ( 25  Helicobacter Pathogenic antigens Disrupts immune balance, leading to pathogenic Th17 expansion unless regulated In certain contexts, influences Treg development via specific antigen-presenting cells (APCs) like RORγt+ APCs. Murine gut studies; human cancer links weak Linked with gastric cancer and dysbiosis ( 35  Fusobacterium nucleatum ADP-heptose (pro-inflammatory metabolite) Promotes inflammatory cytokines (IL-6, TNF-α), contributes to colorectal cancer progression Produces pro-inflammatory cytokines like IL-6 and TNF-α in specific conditions (e.g. colorectal cancer). Human colorectal cancer tissue; murine mechanistic Associated with CRC, pro-inflammatory gene expression ( 36 There is also evidence that components of gut microbiota can interfere with TLR4 recognition by LPS, dampening the inflammatory immune response. A study showed that total LPS from the human gut microbiome was non-immunogenic and could actively inhibit TLR4-dependent cytokine production ( 27 Bacteroidales 27 Akkermansiamuciniphila 39 in vitro 27 in vivo 40 However, it is also important to caution that high-fiber diets, while generally found to be beneficial, can worsen a functional gastrointestinal (GI) disorder, such as irritable bowel syndrome (IBS), and lead to microbiome-related complications in some individuals due to interactions between fiber and the gut microbiota, immune system, and intestinal environment ( 41 42 It is noteworthy that gut microbiotas have the capacity to stimulate the activation of interleukin 1β (IL-1β) and IL-17 through the action of commensal microorganisms, utilizing the TLR-MyD88 signaling pathway ( 43 44 Akkermansia muciniphila Lactobacillus plantarum  Table 1 45  Figure 2 46 47 48 49  Figure 2 46 35 29 50 Figure 2 Schematic representation of key microbial metabolites (short-chain fatty acids and indole derivatives) produced by commensal gut microbiota (e.g., Bifidobacterium Clostridium orogenes Faecalibacterium prausnitzii Diagram illustrating gut microbiota interactions with the immune system. Sections show different microbes like *Helicobacter* and *C. sporogenes* affecting various immune cells and cytokines. Highlights include RORγT, IL-17A, Th17 cells, and pathways influencing inflammation, tissue homeostasis, and immune regulation. Arrows indicate impacts on inflammation and cytokine production, affecting gut and muscle health. The SCFAs derived from microbiota reduce the inflammatory response of intestinal macrophages while simultaneously boosting their antimicrobial capabilities ( 30 51 52 The gut Role of gut microbiota in immune tolerance microbiota plays a critical role in the establishment and maintenance of immune response by influencing various immune cells and pathways. One of the critical functions it performs is promoting immune tolerance, a process that prevents harmful immune reactions against the body’s own tissues or harmless external antigens. Through interactions with immune cells and modulation of key signaling molecules like cytokines and chemokines, the gut microbiota helps maintain a balance between immune defense and tolerance, ensuring overall immune homeostasis ( 31 Introduction to immune tolerance Immune tolerance refers to the ability of the immune system to distinguish between the body’s own cells and beneficial microbes, avoiding attacks on them while still effectively responding to harmful pathogens. This delicate equilibrium is essential for maintaining immune homeostasis and preventing immune responses from mistakenly targeting self-antigens or non-harmful commensal organisms ( 32 33 The importance of immune tolerance is evident in its ability to avert autoimmune diseases in which the immune system erroneously attacks the body’s own cells. If tolerance mechanisms are ineffective, the autoimmune diseases such as lupus, type 1 diabetes, and rheumatoid arthritis may develop ( 53 32 54 Possible mechanisms underlying gut microbiota-mediated immune tolerance Immune tolerance in the gut is vital for maintaining a balance between accepting beneficial commensal microbes and mounting a defense against the harmful pathogens. This intricate balance is maintained through various regulatory mechanisms that adjust immune responses accordingly. Gut microbiota are the key players in this system, as they help foster immune tolerance and prevent the immune system from mistakenly targeting harmless commensals or self-antigens. Regulation of Tregs Some gut bacteria are instrumental in the differentiation of Tregs which are essential for moderating excessive immune responses and enhancing tolerance to self and dietary antigens. Tregs play a major role in suppressing inflammatory immune responses. The presence of a balanced gut microbiota is instrumental in the activation of Tregs which produce anti-inflammatory cytokines, including IL-10 and TGF-β as well as additional cytokines, thus enhancing the process of immune tolerance. A recent study showed that gut-derived RORγ+ Tregs (depicted in  Figure 3 28 Helicobacter  Table 1  Figure 3 55 56 Clostridium orogenes  Table 1  Figure 1 57 C. orogenes  Figure 3 57 Figure 3 Possible mechanisms underlying gut microbiota-mediated immune regulations. Commensal microbiota influence immune regulation through multiple interconnected pathways. Microbiota-induced RORγt + + + + + Diagram illustrating the interaction between commensal gut microbiota and the immune system. Components include gut bacteria like Bifidobacterium spp., Clostridium sporogenes, and Faecalibacterium prausnitzii, leading to production of metabolites such as butyrate, propionate, acetate, and indole derivatives. These influence immune pathways, recruiting natural killer cells, influencing Th17 cells, regulating cytokines like IL-1β, IL-17, IL-10, and inducing Treg through receptors like GPR43, HDAC, and AHR. Furthermore, specific symbiotic bacterial strains like Bacteroides fragilis  Table 1  Figure 1 58 The gut microbiota plays a significant role in regulating the activity of Th17 cells, which are involved in mucosal immunity and inflammation. Alongside Tregs, the balance between Th17 cells and Tregs is crucial for maintaining a state of immune tolerance and preventing the development of inflammatory diseases. Certain commensal bacteria, such as segmented filamentous bacteria (SFB) (  Table 1  Figures 2  3 59 60 61 Enterobacteriaceae E. coli 36 62 63 64 65 Prevotellacopri 66 67 Lactobacillus L. reuteri L. plantarum 68 69 Clostridia Ruminococcus, Faecalibacterium, Eubacterium Anaerostipes  Figure 2 34 69 Bacteroides fragilis 70 71 Lactobacilli Clostridia 69 72 73 Brockmann et al. found that IL-10-producing commensal-specific SFB-responsive Th17 cells were derived from a TCF1+ progenitor population in the gut and acquired their anti-inflammatory phenotype within the small-intestinal lamina propria. IL-10 production by CD4+ T cells and IL-10 signaling in the intestinal macrophages were essential for maintaining IL-10 expression in Th17 cells. Functional assays further demonstrated that these Th17 cells suppressed effector T cell activity both in vitro in vivo 74 75 75 76 Role of ILC3s in microbiota-mediated immune tolerance Beyond adaptive immune cells like Tregs and Th17, group 3 innate lymphoid cells (ILC3s) have emerged as pivotal regulators of intestinal immune tolerance. ILC3s are enriched in gut-associated lymphoid tissue and play a critical role in maintaining homeostasis at mucosal surfaces. They mediate tolerance to commensal bacteria and dietary antigens through antigen presentation, secretion of IL-22, and promotion of tolerogenic Treg responses ( 77 + 78 Antigen presentation APCs are essential in priming and regulating immune tolerance to gut microbiota through a variety of mechanisms. Recent studies have underscored the importance of specific APC subsets in preventing inflammatory responses within the gut. Dendritic cells (DCs), macrophages, and B-cells all serve as APCs, with DCs being regarded as the most professional and specialized for this function ( 79 80  Figure 1 Lactobacillus 81  Figure 3 Lactobacillus paracasei 82 Dendritic cells type 2 (DC2s) play a significant role in regulating immune tolerance, specifically at mucosal and peripheral tissue interfaces. This subset (also called CD11b+ DCs) is involved in shaping T-cell responses, supporting a balance between tolerance and effector immunity ( 83 84 85 86 87 88 89 90 91 92 93 Microbial influence on the expression of co-stimulatory molecules on APCs Gut microbiota can profoundly influence the expression of co-stimulatory molecules on APCs, including DCs and macrophages – a key mechanism by which microbiota regulate immune tolerance vs. activation. The co-stimulatory molecules expressed on APCs are key signals required for T-cell activation, and their presence or absence determines whether T-cells will become activated effector T cells, remain anergic or non-responsive, or will differentiate into tolerogenic Tregs ( 58 94 95 96 97 98 99 Lactobacilli Bacteroides fragilis Clostridia 100 B fragilis 101 102 103 Enterobacteriaceae Prevotella copri 103 Segmented filamentous bacteria (SFB) 104 The microbiota-APCs interactions involve the following key pathways: (i) TLR2/TLR4 signaling ( 105 106 107 108 Regarding the question of whether the gut microbiota helps restore peripheral tolerance, central tolerance, or both, it is noteworthy that the gut microbiota orchestrates primarily the restoration and maintenance of peripheral tolerance ( 18 102 109 110 111 109 Bacteroides fragilis Lactobacillus Clostridia 21 112 113 114 The interactions between gut microbiota and macrophages significantly impact immune tolerance, resulting in the generation of immune signals and microbial metabolites that influence macrophage functionality. This dynamic interplay is vital for preserving immune homeostasis, as it helps to prevent auto-inflammatory and autoimmune diseases by encouraging a well-regulated immune response ( 115 116 117 118 78 The composition of the gut microbiota has a profound effect on cytokine production, serving as a fundamental mechanism for the maintenance of immune tolerance. Certain bacterial species stimulate the release of anti-inflammatory cytokines (IL-10 and TGF-β) which are critical in preventing overactivation of the immune system. These cytokines are instrumental in promoting Treg differentiation which is essential for achieving the immune homeostasis ( 119 120 Fusobacterium nucleatum  Table 1 121 122 122 123 26 124 125  Figures 2  3 Bacterial metabolites and immune modulation The emerging studies have highlighted several potential mechanisms by which the gut microbiota contributes to immune tolerance - a crucial aspect of maintaining the immune system balance and preventing autoimmune diseases. One primary mechanism involves the modulation of Tregs, which play a vital role in maintaining immune tolerance ( 126 127 107 Firmicutes Bacteroidetes  Table 1  Figure 1 Faecalibacterium prausnitzii Eubacterium rectale Bifidobacterium 128 129 Lee et al. found that the SCFA supplementation in a murine model of colitis significantly reduced the gut inflammation and altered microbiota composition. This study showed that SCFAs might help in modulating immune responses and promoting gut health in inflammatory conditions ( 130 131 + 132 133 134 135 Interestingly, growing evidence supports that SCFAs have both tissue- and disease-specific effects as described below. Tissue-specific effects of SCFAs In the liver, butyrate and propionate are known to promote an anti-inflammatory Kupffer cell phenotype, reduce steatosis and induce Tregs, which protect against non-alcoholic steatohepatitis (NASH). The key mechanisms involve GPR41/GPR43 signaling and the regulation of enzymes of the lipid metabolism pathway. Similarly, in colonic and gut tissues, butyrate, propionate, and acetate promote the differentiation of Foxp3+ Tregs, inhibit the expression of proinflammatory cytokines such as IL-6 and IL-17, reduce Th17 cell expansion, and maintain the integrity of the epithelial barrier. The key mechanisms involve GPR43/GPR109A activation, HDAC inhibition, and HIF-1α stabilization. In the lung tissue, propionate and acetate promote the tolerogenic DCs and modulate Tregs and ILC2 populations, which protect against allergic asthma. The key mechanisms involve GPR41/GPR43 signaling and HDAC inhibition. In the central nervous system (CNS), via the gut-brain barrier, butyrate and propionate influence microglial maturation and activation and regulate neuroinflammation. The key mechanism involves the regulation of CNS-resident immune cells. Regarding systemic effects (blood and spleen), butyrate and propionate support Treg proliferation and suppress the systemic levels of proinflammatory TNF-α and IL-6. There is reduced activation of autoimmune T- and B-cells ( 107  Figure 2 Disease-specific effects of SCFAs Regarding autoimmune diseases, in IBD, butyrate supports the proliferation of gut Tregs, suppresses the IL-17/Th17 axis, and improves the integrity of the gut barrier ( 136  Figure 2 137 138 Regarding infectious diseases, in bacterial gut infections, SCFAs reduce the colonic pH, which inhibits the growth of pathogens. Also, mucosal IgA levels are upregulated, conferring local immunity and antimicrobial peptide induction. These changes lead to reduced gut bacterial colonization and inflammation ( 51 139 140 141 However, it is noteworthy that butyrate treatment during Treg differentiation can result in the induction of transcription factor T-bet, which suppresses Foxp3 expression. This indicates a reduction in Treg-mediated immunosuppression. Also, butyrate has been found to upregulate expression of proinflammatory cytokines, such as IFN-γ, suggesting a proinflammatory Th1 shift and reduction in Treg responses ( 142  Figure 2 While SCFAs are well-studied, several other classes of microbial metabolites are also important for regulating immune tolerance. These metabolites include the following: (i) Trp metabolites ( 143 Lactobacilli Clostridia 144 Clostridia Bacteroides 145 146 Bacteroides fragilis Lactobacillus rhamnosus 147 Bifidobacterium Lactobacilli Bacteroides Eubacterium Mucosal barrier function Another important mechanism is the interaction between gut microbiota and intestinal epithelial cells. The microbiota can affect the integrity and function of the gut epithelial barrier which, in turn, influences immune responses. It was demonstrated that certain gut bacteria could produce factors that strengthened the epithelial barrier, reducing the likelihood of inflammatory responses triggered by the leakage of gut contents into the systemic circulation. This barrier function was crucial for preventing the development of immune-mediated diseases and maintaining overall immune homeostasis ( 44 Another key mechanism by which the gut microbiota helps maintain the mucosal barrier integrity is the regulation of tight junction (TJ) proteins, such as occludin, zonula occludens (ZO)-1, and claudins ( 113 Akkermansiamuciniphila 148 149 Akkermansia 150 Akkermansia Firmicutes 151 Recent findings also suggest that gut microbiota affects immune tolerance through interactions with the GALT. GALT plays a critical role in distinguishing between pathogenic and non-pathogenic antigens, and the microbiota can influence this process by modulating the local immune environment. To this effect, certain bacteria may promote the development of tolerogenic DCs which help in inducing tolerance by presenting antigens in a way that minimizes inflammatory responses ( 109 Role of microbial tryptophan metabolites in programmed death (PD)-1/PD-L1 tolerance Microbial Trp metabolites play a critical role in immune tolerance, including the PD-1/PD-L1 pathway ( 152 154 Trp metabolism and microbiome Trp is an essential amino acid that is metabolized in several pathways as follows. (i) Microbial/Indole pathway: Gut microbes convert Trp into indole and other derivatives, such as indole-3-aldehyde, indole-3-acetic acid, and indole-3-propionic acid; (ii) Kynurenine pathway: Occurs mainly in host cells via indoleamine 2,3-dioxygenase or tryptophan 2,3-dioxygenase, producing immunosuppressive metabolites, such as kynurenine; and (iii) Serotonin pathway: Serotonin and melatonin are produced. Notably, microbial metabolites, particularly indoles, are potent immune modulators. PD-1/PD-L1 pathway The PD-1/PD-L1 pathway is a crucial immune checkpoint mechanism that plays a pivotal role in immune regulation and the maintenance of self-tolerance. PD-1 receptor is expressed on activated T-cells, B-cells, and some myeloid cells. PD-1 acts as an inhibitory receptor to suppress immune responses. Its cognate ligands, PD-L1 and PD-L2, are expressed on APCs and tumor cells. However, PD-L1 is most widely studied in the context of tumor immunology. PD-1/PD-L1 engagement generates an inhibitory signal that leads to T-cell inhibition, tolerance, and immune evasion. The outcome is reduced T-cell proliferation, diminished cytokine expression, and impaired cytotoxic responses. Hence, PD-1/PD-L1 pathway activation limits tissue damage during inflammation and also maintains immune tolerance by preventing autoimmune overactive T-cells. Not surprisingly, PD-1/PD-L1 pathway is a key immune checkpoint that tumors exploit for immune evasion, and targeting this pathway has revolutionized cancer immunotherapy. Effect of microbial Trp metabolites on PD-1/PD-L1 pathway Microbial tryptophan metabolites can induce PD-1/PD-L1-mediated tolerance through the following mechanisms: (i) Microbial metabolites, such as kynurenine, can downmodulate T-cell function as well as promote exhausted T-cell phenotypes with increased PD-1 receptor expression; (ii) Several microbial Trp metabolites, including indole-3-aldehyde, can act as AhR ligands and activate AhR-mediated signaling in immune cells, resulting in increased Treg differentiation, PD-1 receptor induction on T-cells, and enhanced PD-L1 expression on macrophages and DCs. These changes promote an immunosuppressive environment and induce immune tolerance; and (iii) Microbial indoles trigger AhR-mediated signaling, which leads to increased production of anti-inflammatory cytokines, such as TGF-β and IL-10. These anti-inflammatory cytokines further potentiate PD-1/PD-L1-mediated T-cell inhibition and immune tolerance ( 72 It is notable that in the gut, microbial Trp metabolites promote the PD-1/PD-L1 pathways and play a significant role in maintaining tolerance to commensal bacteria. In cancer, on the other hand, these metabolites enhance the PD-L1 expression in the tumor microenvironment, contributing to immune evasion ( 154 Emerging concepts and promising new microbiome-based targets Microbiota-derived extracellular vesicles MEVs are nano-scale membrane-bound particles or vesicles secreted by microorganisms in the human microbiome, in areas such as the gut, skin, and oral cavity. The MEVs deliver a variety of molecular cargo, including nucleic acids, lipids, proteins, and small metabolites, and play critical roles in communication, host physiology, immune function, and disease progression ( 155 156 157 158 Cargo composition The cargo composition of MEVs is highly diverse. The bioactive molecules present mostly comprise nucleic acids (DNA, mRNA, and small RNAs, including miRNA-like molecules and sRNAs), proteins (enzymes, adhesion molecules, and toxins), lipids (LPS, lipoteichoic acid, and phospholipids), and metabolites (SCFAs and signaling molecules) ( 155 Functions of MEVs Overall, MEVs orchestrate the following critical functions: (i) Inter-microbial communication through mechanisms such as horizontal gene transfer, biofilm formation, and anti-bacterial activities via bacteriocins; (ii) Host-microbiota interactions, such as barrier function affecting epithelial permeability and tight junctions, immune modulation by activating or suppressing TLR-mediated immune responses, and neuroimmune signaling by influencing immune and neural pathways in the gut-brain axis; (iii) Pathogenesis through delivering virulence factors to host cells, by suppressing host defenses, and contributing to chronic infections such as IBD and periodontitis; and (iv) Role in host health by maintaining gut membrane integrity or barrier function, stimulation of Tregs, and bolstering mucosal immunity ( 159 161 Roles in disease and health In IBD, proinflammatory MEVs from pathogenic bacteria exacerbate gut inflammation ( 162 163 164 165 166 Regarding the diagnostic and therapeutic potentials of MEVs, their profiling in blood and feces may serve as biomarkers of microbiota and disease states. Interestingly, OMVs are being assessed for vaccination potential, such as Neisseria meningitidis 167 160 168 Bacteriophage-immune crosstalk as underexplored targets Bacteriophages, or phages, are viruses that infect bacteria, and the emerging research shows that the phages also interact directly or indirectly with the host immune system, in a process called phage-immune crosstalk. It is noteworthy that such interactions have largely remained underexplored, despite critical significance for immunomodulation, therapeutic development, and microbiome engineering. The classical view supports that phages indirectly affect human health by shaping the microbiome through regulating bacterial populations. While, the emerging view supports that phages can also act as immune stimuli or immunomodulators by interacting directly with host immune cells and play a role in health and disease ( 168 169 Mechanisms of phage-immune crosstalk In direct interaction mechanisms, phages can be recognized and internalized by host innate immune cells, including monocytes/macrophages and dendritic cells. The pattern recognition receptors (PRRs) present on these cells get selectively activated by various phage components as follows: (i) TLR3/7 recognize dsRNA/ssRNA; (ii) TLR9 recognizes unmethylated CpG DNA; and (iii) the cGAS-STING pathway is activated by cytosolic DNA sensor. Such interactions lead to the induction of various cytokines, type I interferon (IFN-α/β), and modulation of antigen presentation. Phages impact human health by indirectly altering bacterial populations and shaping the microbiome as follows: (i) By releasing LPS, peptidoglycan, or toxins, which modulate immunogenicity; (ii) By altering metabolite profiles, which influence immune responses via Tregs and Th17 cell responses; and (iii) By altering immune accessibility through biofilm structural changes. However, phages from the gut virome may also translocate across the compromised gut barrier during disease conditions, such as IBD and HIV. In the circulation, phages may interact with critical systemic immune components, including the phagocytes, immunoglobulins (IgG/IgA), and the complement system ( 170 171 Emerging evidence from pre-clinical and clinical studies Using in vitro 172 173 174 175 Therapeutic potential Phages have vast potential for diverse uses, summarized as follows: (i) Phages or their components, such as CpG DNA, can act as natural adjuvants to boost immunity or activate DCs in cancer immunotherapy; (ii) Tumor-associated phages may influence tumor immune evasion, modulating T-cell infiltration and responses of tumor-associated macrophages; and (iii) Phages also act as delivery vehicles for immunostimulatory genes. Notably, phages with anti-TNF immunosuppressive potential can be used as a therapeutic tool for inflammatory and autoimmune diseases. Similarly, alterations in the gut virome in colitis and multiple sclerosis reduced inflammation and disease severity ( 176 177 Major challenges and future directions Firstly, phage biodistribution and kinetics in vivo As non-living entities, phage-derived nanoparticles are gaining attention as programmable immune modulators. Synthetically engineered phages are becoming a useful tool to deliver RNAs or immunomodulatory peptides. In precision medicine, virome-targeted microbiome therapies are being used as a tool for gut virome tailoring. Using systems biology approaches, phage-immune networks are being mapped to understand, predict, and model interactions. In conclusion, phage-immune crosstalk represents an emerging frontier in immuno-microbiome research. Although relatively still underexplored, it holds vast potential for developing new immuno-therapeutics and phage-based interventions. Continued research to gain an in-depth understanding of these interactions could pave the way for breakthrough treatments for metabolic, inflammatory, infectious, and neoplastic diseases ( 178 179 Metabolite-immune checkpoint axis: a new conceptual framework As an emerging conceptual framework, MICA links host and microbial metabolites with the regulation of immune checkpoints, specifically in disease conditions such as inflammation, cancer, and immune tolerance. It is now being recognized as a promising interdisciplinary concept in microbiome research, immunometabolism, and immunotherapy. MICA represents the regulatory interactions between metabolites (from host cells, microbiota, or diet) and immune checkpoint pathways (PD-1/PD-L1, LAG-3, CTLA-4, and TIM-3). These regulatory pathways play a critical role in controlling immune activation and preventing autoimmunity. Emerging evidence shows that metabolic signals, especially from microbiota, modulate these checkpoint pathways ( 180 181 182 183 184 72 185 186 As an emerging conceptual framework, MICA interlinks the critical pathways of immune tolerance, metabolism, and microbiota-host co-metabolism under one integrated framework. This approach may lead to novel therapeutic horizons by allowing for dual-target strategies in which metabolic pathway modulators may be combined with immune checkpoint inhibitors to gain a desirable outcome. A few of such innovative therapeutic approaches may involve butyrate + anti-PD1 or IDO inhibitors + CTLA-4 blockade strategies. Moreover, individual metabolomic profiles may guide such dual therapeutic strategies for further refinement of targeted outcomes. Besides, circulating or fecal metabolites may serve as non-invasive biomarkers for immune checkpoint modulation and the therapeutic responses induced. Indeed, mapping metabolite-checkpoint interactions using multi-omics approaches, e.g., metabolomics combined with immunophenotyping, needs to be further focused. Microbiota engineering may yield target metabolites that modulate immune checkpoints to the desired outcome. The AI-based modeling can help predict MICA signatures in various disease contexts. More importantly, clinical trials of metabolite+immune checkpoint regulators-based combined therapies remain a highly desirable direction for future research. In conclusion, as a promising conceptual framework, MICA reframes how we understand immune checkpoints, not as static receptors but as a dynamic framework influenced by the metabolic milieu. Exploring this potential axis may revolutionize immunotherapy and precision medicine as well as our understanding of immune tolerance and dysfunction. Gut microbiota-based therapy Numerous research efforts across the globe have concentrated on the profound influence of gut microbiota on human health and disease. While there is still a considerable amount of fundamental work required, the primal connection between human well-being and gut health has been recognized a long time ago as evidenced by Hippocrates’ assertion in 400 B.C. stating that “Death sits in the bowels” ( 187 The gut microbiota, a complex community made up of trillions of microorganisms residing in the human gastrointestinal (GI) tract, plays a pivotal role in health and disease. The concept of gut microbiota-based therapy has gained significant traction as a promising approach to treat a variety of morbid conditions, ranging from GI tract disorders to metabolic and neurodegenerative diseases. The latest developments in gut microbiota-based therapies, focusing on probiotic interventions ( 188 Probiotics and their therapeutic potential Probiotics are the live microorganisms that confer health benefits when administered in adequate amounts and have been extensively studied for their potential to modulate gut microbiota. Recent randomized controlled trials have demonstrated that specific strains of Lactobacillus Bifidobacterium 189 190 Lactobacillus plantarum Lactobacillus plantarum 81 Fecal microbiota transplantation FMT has traditionally been used to treat recurrent Clostridioidesdifficile 191 192 193 194 Prebiotics and dietary interventions Prebiotics are the non-digestible food components that promote the growth of beneficial gut bacteria and are considered another cornerstone of microbiota-based therapy. Recently, specific prebiotics, such as inulin and fructooligosaccharides (FOS), have been identified as the substances that selectively enhance the growth of beneficial microbial taxa, including Bifidobacteria 195 196 197 198  Table 2 Table 2 Summary of selected clinical trials evaluating gut microbiota-based therapies. Trial identifier Intervention Condition Sample size Primary outcome Key findings Limitations References NCT02254811 FMT (oral capsules vs. colonoscopy) Recurrent Clostridioides difficile 116 Clinical cure at 8 weeks (infection resolution) Capsule-delivered FMT non-inferior to colonoscopy; cure rates ~90% Large-scale CDI not IBD; lacks long-term immunologic/microbiome endpoints ( 199 NCT04089042  Lactobacillus plantarum Parkinson’s Disease 60 Motor symptom improvement Reduced UPDRS scores; gut-brain axis modulation Small sample size; no placebo control ( 200 NCT04388577 Synbiotic ( B. longum Metabolic Syndrome 80 Fasting glucose reduction Improved insulin sensitivity Short duration (12 weeks); no microbiota sequencing ( 201 NCT03699972 FMT (colonoscopy) Autism Spectrum Disorder 18 GI and behavioral symptom improvement Improvements sustained at 8 weeks Open-label; small N ( 202 NCT03819242 SCFA Enemas (Butyrate) Ulcerative Colitis 40 Mucosal healing Increased Tregs; reduced inflammation Local delivery; unclear long-term effect ( 203 On the note, the recent research has highlighted several innovative gut microbiota-based therapies. In this regard, postbiotics, such as SCFAs, have shown the potential therapeutic applications in various inflammatory diseases ( 204 Clostridium difficile 205 206 Current advancements in personalized therapies utilizing the microbiota to regulate immune tolerance Personalized FMT Next-generation FMT, utilizing donor stools matched to the recipient’s immune or microbial profiles ( 207 208 Trials using FMT to enrich Treg-promoting bacteria. Examples: Faecalibacteriumprausnitzii Clostridia 209 210 Defined microbial consortia Synthetic consortia, comprising of well-defined commensal strains, have been designed to address the following uses ( 211 213 To enhance Treg induction. To mitigate Th1/Th17 pro-inflammatory responses. Examples: (i) Clostridia-based consortia for immune tolerance in IBD (VE-202), Vedanta Bioscience ( 214 www.serestherapeutics.com Microbiome metabolite targeting Personalized approaches using host genetics and microbiota composition to design or select optimal metabolite modulators, including therapies that mimic or potentiate tolerogenic microbial metabolites, such as ( 215 216 i. Indole derivatives (Metabolites of Trp metabolism, serving as AhR ligands). ii. Secondary bile acids (oxo-LCA, iso-LCA). iii. Polyamines and vitamin B9. Microbiome profiling targeting immunotherapy responses Using personalized immunotherapies for integrating microbiome signatures to ( 217 Identify microbiota-related immune tolerance defects. Predict responses to immune checkpoint inhibitors (ICIs). Examples: Microbiome modulations using diet, probiotics, and FMT, in combination with immunotherapy to enhance efficacy and immune tolerance. Using pre- and post-biotics Tailored prebiotics, such as specific fibers or polyphenols, are being used to selectively enrich Treg-promoting bacteria. Postbiotics, such as purified bacterial metabolites (e.g., butyrate, from Bacteroides fragilis Examples: (i) IBD; (ii) Neuroimmune disorders; and (iii) food allergies ( 218 219 Conclusions and future perspectives The gut microbiota holds great promise as a modifiable target for enhancing immune tolerance and treating a variety of disease conditions. The gut microbiota-based therapeutic interventions such as probiotics, prebiotics, FMT, bacteriophage therapy, and engineered microbiota have, indeed, shown success in treating diseases and improving human health. However, several challenges still remain to be duly addressed. The microbiome complexity and variability in the individual microbiomes, influenced by other potentially interactive factors such as genetics, diet, age, health status, and environment, complicate the standardization of the therapeutic approaches ( 220 It is also notable that the formulations, doses, and quality control of microbiome-based interventions vary widely, and the established standards are largely non-existent. This may be attributed to variations in the potency and efficacy of probiotic strains, as well as the need for standardized protocols in fecal microbiota transplantation (FMT) procedures. Understandably, the regulatory environment for these therapies is still evolving and there is uncertainty about how to classify and regulate these procedures. FMT approaches also involve critical ethical concerns, such as donor screening and potential risks of transmitting infectious diseases or unintended microbiota. Similarly, other therapies involving engineered microbiota or bacteriophages raise concerns about the likelihood of causing adverse side effects or unintended microbial interactions. Given that the gut microbiota consists of trillions of microorganisms, such interactions may become highly complex, making it challenging to accurately predict the outcome of specific interventions. Thus, identifying the subgroups that will benefit the most from such therapies remains a major concern in the field. Future research should aim to create more successful personalized or individually customized gut microbiota-based therapies. Further technological and high-throughput methodological advances in microbiome sequencing, bioinformatics, and synthetic biology are expected to lead to more effective probiotics and potentially tailored FMTs across diverse human populations. At present, clinicians are challenged with difficulties regarding the translation of microbiome research into personalized treatments due to the inherent complexity of microbiome data. The integration of microbiome profiling with clinical care can be improved by using new tools, further training, and more integrated workflows. Indeed, large-scale clinical trials will be essential to test and validate the efficacy and safety of these gut microbiota-based therapies for diverse population groups. Such advancements in knowledge will allow for a deeper understanding of the therapeutic responses as well as better prediction of the clinical outcome. As a word of caution, the current prohibitive costs involved in using FMT or engineered microbiota may limit their access to many individuals, especially across low-resource settings and, therefore, the future research also needs to identify more cost-effective approaches for large-scale adoption of microbiome-based therapies. Besides, MEVs represent an emerging frontier in microbiome research, offering promising insights into host-microbiota interactions and as potential tools/targets for novel diagnostics/therapeutics. MEV-based interventions have vast potential in precision medicine. Overall, as research progresses, personalized microbiome-based therapies will most likely become a cornerstone of precision medicine, aiming at restoring or potentiating immune tolerance in ways that are safer and more effective. Acknowledgments The figures were created with biorender.com. Author contributions NA: Writing – original draft, Conceptualization. KC: Investigation, Writing – original draft. FA-R: Writing – review & editing, Investigation. HA: Writing – review & editing, Investigation. SS: Writing – original draft, Investigation. FA-M: Writing – review & editing, Resources, Investigation. RA: Resources, Conceptualization, Supervision, Writing – review & editing, Funding acquisition. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. The author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision. Generative AI statement The author(s) declare that Generative AI was used in the creation of this manuscript. During the preparation of this work the author(s) used ChatGPT to improve readability and language. After using ChatGPT, the author(s) reviewed and edited the content as needed and take(s) full responsibility for the content of the publication. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Lewandowska-Pietruszka Z Figlerowicz M Mazur-Melewska K The history of the intestinal microbiota and the gut-brain axis Pathogens 2022 11 10.3390/pathogens11121540 36558874 PMC9786924 2 Turnbaugh PJ Ley RE Hamady M Fraser-Liggett CM Knight R Gordon JI The human microbiome project Nature 2007 449 804–10 10.1038/nature06244 17943116 PMC3709439 3 Mafra D Ribeiro M Fonseca L Regis B Cardozo L Fragoso Dos Santos H Archaea from the gut microbiota of humans: Could be linked to chronic diseases Anaerobe 2022 77 102629 10.1016/j.anaerobe.2022.102629 35985606 4 Matijasic M Mestrovic T Paljetak HC Peric M Baresic A Verbanac D Gut microbiota beyond bacteria-mycobiome, virome, archaeome, and eukaryotic parasites in IBD Int J Mol Sci 2020 21 32290414 10.3390/ijms21082668 PMC7215374 5 Afzaal M Saeed F Shah YA Hussain M Rabail R Socol CT Human gut microbiota in health and disease: Unveiling the relationship Front Microbiol 2022 13 999001 10.3389/fmicb.2022.999001 36225386 PMC9549250 6 Kang GG Trevaskis NL Murphy AJ Febbraio MA Diet-induced gut dysbiosis and inflammation: Key drivers of obesity-driven NASH iScience 2023 26 105905 10.1016/j.isci.2022.105905 36691622 PMC9860397 7 Talapko J Vcev A Mestrovic T Pustijanac E Jukic M Skrlec I Homeostasis and dysbiosis of the intestinal microbiota: comparing hallmarks of a healthy state with changes in inflammatory bowel disease Microorganisms 2022 10 10.3390/microorganisms10122405 36557658 PMC9781915 8 Portincasa P Bonfrate L Vacca M De Angelis M Farella I Lanza E Gut microbiota and short chain fatty acids: implications in glucose homeostasis Int J Mol Sci 2022 23 10.3390/ijms23031105 35163038 PMC8835596 9 Shin Y Han S Kwon J Ju S Choi TG Kang I Roles of short-chain fatty acids in inflammatory bowel disease Nutrients 2023 15 10.3390/nu15204466 37892541 PMC10609902 10 Rudzki L Stone TW Maes M Misiak B Samochowiec J Szulc A Gut microbiota-derived vitamins - underrated powers of a multipotent ally in psychiatric health and disease Prog Neuropsychopharmacol Biol Psychiatry 2021 107 110240 10.1016/j.pnpbp.2020.110240 33428888 11 LeBlanc JG Milani C de Giori GS Sesma F van Sinderen D Ventura M Bacteria as vitamin suppliers to their host: a gut microbiota perspective Curr Opin Biotechnol 2013 24 160–8 10.1016/j.copbio.2012.08.005 22940212 12 Rowland I Gibson G Heinken A Scott K Swann J Thiele I Gut microbiota functions: metabolism of nutrients and other food components Eur J Nutr 2018 57 1 24 10.1007/s00394-017-1445-8 28393285 PMC5847071 13 Dogra SK Kwong Chung C Wang D Sakwinska O Colombo Mottaz S Sprenger N Nurturing the early life gut microbiome and immune maturation for long term health Microorganisms 2021 9 10.3390/microorganisms9102110 34683431 PMC8537230 14 Ignacio A Czyz S McCoy KD Early life microbiome influences on development of the mucosal innate immune system Semin Immunol 2024 73 101885 10.1016/j.smim.2024.101885 38788491 15 Panwar RB Sequeira RP Clarke TB Microbiota-mediated protection against antibiotic-resistant pathogens Genes Immun 2021 22 255–67 10.1038/s41435-021-00129-5 33947987 PMC8497270 16 Singh J Vanlallawmzuali A Singh Biswal S Zomuansangi R Lalbiaktluangi C Microbiota-brain axis: Exploring the role of gut microbiota in psychiatric disorders - A comprehensive review Asian J Psychiatr 2024 97 104068 10.1016/j.ajp.2024.104068 38776563 17 D'Alessandro G Antonangeli F Marrocco F Porzia A Lauro C Santoni A Gut microbiota alterations affect glioma growth and innate immune cells involved in tumor immunosurveillance in mice Eur J Immunol 2020 50 705–11 10.1002/eji.201948354 32034922 PMC7216943 18 Belkaid Y Hand TW Role of the microbiota in immunity and inflammation Cell 2014 157 121–41 10.1016/j.cell.2014.03.011 24679531 PMC4056765 19 Kennedy EA King KY Baldridge MT Mouse microbiota models: comparing germ-free mice and antibiotics treatment as tools for modifying gut bacteria Front Physiol 2018 9 1534 10.3389/fphys.2018.01534 30429801 PMC6220354 20 Mendez CS Bueno SM Kalergis AM Contribution of gut microbiota to immune tolerance in infants J Immunol Res 2021 2021 7823316 10.1155/2021/7823316 34993254 PMC8727111 21 Shim JA Ryu JH Jo Y Hong C The role of gut microbiota in T cell immunity and immune mediated disorders Int J Biol Sci 2023 19 1178–91 10.7150/ijbs.79430 36923929 PMC10008692 22 Barrea L Muscogiuri G Frias-Toral E Laudisio D Pugliese G Castellucci B Nutrition and immune system: from the Mediterranean diet to dietary supplementary through the microbiota Crit Rev Food Sci Nutr 2021 61 3066–90 10.1080/10408398.2020.1792826 32691606 23 Ghosh S Whitley CS Haribabu B Jala VR Regulation of intestinal barrier function by microbial metabolites Cell Mol Gastroenterol Hepatol 2021 11 1463–82 10.1016/j.jcmgh.2021.02.007 33610769 PMC8025057 24 Kaźmierczak-Siedlecka K Skonieczna-Żydecka K Hupp T Duchnowska R Marek-Trzonkowska N Połom K Next-generation probiotics - do they open new therapeutic strategies for cancer patients Gut Microbes 2022 14 2035659 35167406 10.1080/19490976.2022.2035659 PMC8855854 25 Vetrani C Di Nisio A Paschou SA Barrea L Muscogiuri G Graziadio C From gut microbiota through low-grade inflammation to obesity: key players and potential targets Nutrients 2022 14 10.3390/nu14102103 35631244 PMC9145366 26 Lou X Xue J Shao R Yang Y Ning D Mo C Fecal microbiota transplantation and short-chain fatty acids reduce sepsis mortality by remodeling antibiotic-induced gut microbiota disturbances Front Immunol 2022 13 1063543 10.3389/fimmu.2022.1063543 36713461 PMC9874322 27 d'Hennezel E Abubucker S Murphy LO Cullen TW Total lipopolysaccharide from the human gut microbiome silences toll-like receptor signaling mSystems 2017 2 10.1128/mSystems.00046-17 29152585 PMC5686520 28 Hanna BS Wang G Galvan-Pena S Mann AO Ramirez RN Munoz-Rojas AR The gut microbiota promotes distal tissue regeneration via RORgamma(+) regulatory T cell emissaries Immunity 2023 56 829 846 e8 10.1016/j.immuni.2023.01.033 36822206 PMC10101925 29 Deshmukh HS Liu Y Menkiti OR Mei J Dai N O'Leary CE The microbiota regulates neutrophil homeostasis and host resistance to Escherichia coli K1 sepsis in neonatal mice Nat Med 2014 20 524–30 10.1038/nm.3542 24747744 PMC4016187 30 Schulthess J Pandey S Capitani M Rue-Albrecht KC Arnold I Franchini F The short chain fatty acid butyrate imprints an antimicrobial program in macrophages Immunity 2019 50 432 445 e7 10.1016/j.immuni.2018.12.018 30683619 PMC6382411 31 Li Z Xiong W Liang Z Wang J Zeng Z Kolat D Critical role of the gut microbiota in immune responses and cancer immunotherapy J Hematol Oncol 2024 17 33 10.1186/s13045-024-01541-w 38745196 PMC11094969 32 Ahmad HI Jabbar A Mushtaq N Javed Z Hayyat MU Bashir J Immune tolerance vs. Immune resistance: the interaction between host and pathogens in infectious diseases Front Vet Sci 2022 9 827407 10.3389/fvets.2022.827407 35425833 PMC9001959 33 Meng X Layhadi JA Keane ST Cartwright NJK Durham SR Shamji MH Immunological mechanisms of tolerance: Central, peripheral and the role of T and B cells Asia Pac Allergy 2023 13 175–86 10.5415/apallergy.0000000000000128 38094089 PMC10715743 34 van den Munckhof ICL Kurilshikov A Ter Horst R Riksen NP Joosten LAB Zhernakova A Role of gut microbiota in chronic low-grade inflammation as potential driver for atherosclerotic cardiovascular disease: a systematic review of human studies Obes reviews: an Off J Int Assoc Study Obes 2018 19 1719–34 10.1111/obr.v19.12 30144260 35 Kalafati L Kourtzelis I Schulte-Schrepping J Li X Hatzioannou A Grinenko T Innate immune training of granulopoiesis promotes anti-tumor activity Cell 2020 183 771 785.e12 10.1016/j.cell.2020.09.058 33125892 PMC7599076 36 Candelli M Franza L Pignataro G Ojetti V Covino M Piccioni A Interaction between lipopolysaccharide and gut microbiota in inflammatory bowel diseases Int J Mol Sci 2021 22 10.3390/ijms22126242 34200555 PMC8226948 37 Chen L Liu B Ren L Du H Fei C Qian C High-fiber diet ameliorates gut microbiota, serum metabolism and emotional mood in type 2 diabetes patients Front Cell Infect Microbiol 2023 13 1069954 10.3389/fcimb.2023.1069954 36794003 PMC9922700 38 Wastyk HC Fragiadakis GK Perelman D Dahan D Merrill BD Yu FB Gut-microbiota-targeted diets modulate human immune status Cell 2021 184 4137 4153 e14 10.1016/j.cell.2021.06.019 34256014 PMC9020749 39 Garcia-Vello P Tytgat HLP Elzinga J Van Hul M Plovier H Tiemblo-Martin M The lipooligosaccharide of the gut symbiont Akkermansia muciniphila exhibits a remarkable structure and TLR signaling capacity Nat Commun 2024 15 8411 10.1038/s41467-024-52683-x 39333588 PMC11436972 40 Bruse N Jansen A Gerretsen J Rijbroek D Wienholts K Arron M The gut microbiota composition has no predictive value for the endotoxin-induced immune response or development of endotoxin tolerance in humans invivo Microbes infection 2023 25 105174 10.1016/j.micinf.2023.105174 37348752 41 El-Salhy M Ystad SO Mazzawi T Gundersen D Dietary fiber in irritable bowel syndrome (Review) Int J Mol Med 2017 40 607–13 10.3892/ijmm.2017.3072 28731144 PMC5548066 42 Wilson B Whelan K Prebiotic inulin-type fructans and galacto-oligosaccharides: definition, specificity, function, and application in gastrointestinal disorders J Gastroenterol Hepatol 2017 32 Suppl 1 64–8 10.1111/jgh.2017.32.issue-S1 28244671 43 Jandhyala SM Talukdar R Subramanyam C Vuyyuru H Sasikala M Nageshwar Reddy D Role of the normal gut microbiota World J Gastroenterol 2015 21 8787–803 10.3748/wjg.v21.i29.8787 26269668 PMC4528021 44 Wang J Zhu N Su X Gao Y Yang R Gut-microbiota-derived metabolites maintain gut and systemic immune homeostasis Cells 2023 12 10.3390/cells12050793 36899929 PMC10000530 45 Guo M Lu M Chen K Xu R Xia Y Liu X Akkermansia muciniphila and Lactobacillus plantarum ameliorate systemic lupus erythematosus by possibly regulating immune response and remodeling gut microbiota mSphere 2023 8 e0007023 10.1128/msphere.00070-23 37366641 PMC10449527 46 Vinolo MA Ferguson GJ Kulkarni S Damoulakis G Anderson K Bohlooly YM SCFAs induce mouse neutrophil chemotaxis through the GPR43 receptor PloS One 2011 6 e21205 10.1371/journal.pone.0021205 21698257 PMC3115979 47 Vinolo MA Rodrigues HG Hatanaka E Hebeda CB Farsky SH Curi R Short-chain fatty acids stimulate the migration of neutrophils to inflammatory sites Clin Sci (Lond) 2009 117 331–8 10.1042/CS20080642 19335337 48 Vinolo MA Hatanaka E Lambertucci RH Newsholme P Curi R Effects of short chain fatty acids on effector mechanisms of neutrophils Cell Biochem Funct 2009 27 48 55 10.1002/cbf.v27:1 19107872 49 Hernández-Chirlaque C Aranda CJ Ocón B Capitán-Cañadas F Ortega-González M Carrero JJ Germ-free and antibiotic-treated mice are highly susceptible to epithelial injury in DSS colitis J Crohn's colitis 2016 10 1324–35 10.1093/ecco-jcc/jjw096 27117829 50 Karmarkar D Rock KL Microbiota signalling through MyD88 is necessary for a systemic neutrophilic inflammatory response Immunology 2013 140 483–92 10.1111/imm.2013.140.issue-4 23909393 PMC3839652 51 Ney LM Wipplinger M Grossmann M Engert N Wegner VD Mosig AS Short chain fatty acids: key regulators of the local and systemic immune response in inflammatory diseases and infections Open Biol 2023 13 230014 10.1098/rsob.230014 36977462 PMC10049789 52 Ullah H Arbab S Tian Y Liu CQ Chen Y Qijie L The gut microbiota-brain axis in neurological disorder Front Neurosci 2023 17 1225875 10.3389/fnins.2023.1225875 37600019 PMC10436500 53 Shirafkan F Hensel L Rattay K Immune tolerance and the prevention of autoimmune diseases essentially depend on thymic tissue homeostasis Front Immunol 2024 15 1339714 10.3389/fimmu.2024.1339714 38571951 PMC10987875 54 Li Q Lan P Activation of immune signals during organ transplantation Signal Transduct Target Ther 2023 8 110 10.1038/s41392-023-01377-9 36906586 PMC10008588 55 Kedmi R Najar TA Mesa KR Grayson A Kroehling L Hao Y A RORgammat(+) cell instructs gut microbiota-specific T(reg) cell differentiation Nature 2022 610 737–43 10.1038/s41586-022-05089-y 36071167 PMC9908423 56 Fiyouzi T Pelaez-Prestel HF Reyes-Manzanas R Lafuente EM Reche PA Enhancing regulatory T cells to treat inflammatory and autoimmune diseases Int J Mol Sci 2023 24 10.3390/ijms24097797 37175505 PMC10177847 57 Krause FF Mangold KI Ruppert AL Leister H Hellhund-Zingel A Lopez Krol A Clostridium sporogenes-derived metabolites protect mice against colonic inflammation Gut Microbes 2024 16 2412669 10.1080/19490976.2024.2412669 39397690 PMC11485882 58 Zheng D Liwinski T Elinav E Interaction between microbiota and immunity in health and disease Cell Res 2020 30 492 506 10.1038/s41422-020-0332-7 32433595 PMC7264227 59 Ticinesi A Lauretani F Tana C Nouvenne A Ridolo E Meschi T Exercise and immune system as modulators of intestinal microbiome: implications for the gut-muscle axis hypothesis Exerc Immunol Rev 2019 25 84 95 30753131 60 Sun CY Yang N Zheng ZL Liu D Xu QL T helper 17 (Th17) cell responses to the gut microbiota in human diseases BioMed Pharmacother 2023 161 114483 10.1016/j.biopha.2023.114483 36906976 61 Chen P Tang X Gut microbiota as regulators of th17/treg balance in patients with myasthenia gravis Front Immunol 2021 12 803101 10.3389/fimmu.2021.803101 35003133 PMC8732367 62 Paroni M Leccese G Ranzani V Moschetti G Chiara M Perillo F An intestinal th17 subset is associated with inflammation in crohn’s disease and activated by adherent-invasive escherichia coli J Crohn's Colitis 2023 17 1988 2001 10.1093/ecco-jcc/jjad119 37462681 PMC10798865 63 Alexander M Ang QY Nayak RR Bustion AE Sandy M Zhang B Human gut bacterial metabolism drives Th17 activation and colitis Cell Host Microbe 2022 30 17 30.e9 10.1016/j.chom.2021.11.001 34822777 PMC8785648 64 Ivanov II Atarashi K Manel N Brodie EL Shima T Karaoz U Induction of intestinal Th17 cells by segmented filamentous bacteria Cell 2009 139 485–98 10.1016/j.cell.2009.09.033 19836068 PMC2796826 65 Chen L Ruan G Cheng Y Yi A Chen D Wei Y The role of Th17 cells in inflammatory bowel disease and the research progress Front Immunol 2022 13 1055914 10.3389/fimmu.2022.1055914 36700221 PMC9870314 66 Huang Y Tang J Cai Z Zhou K Chang L Bai Y Prevotella induces the production of th17 cells in the colon of mice J Immunol Res 2020 2020 9607328 10.1155/2020/9607328 33204736 PMC7657696 67 Scher JU Sczesnak A Longman RS Segata N Ubeda C Bielski C Expansion of intestinal Prevotella copri correlates with enhanced susceptibility to arthritis eLife 2013 2 e01202 10.7554/eLife.01202 24192039 PMC3816614 68 Zhao C Hu X Bao L Wu K Feng L Qiu M Aryl hydrocarbon receptor activation by Lactobacillus reuteri tryptophan metabolism alleviates Escherichia coli-induced mastitis in mice PloS Pathog 2021 17 e1009774 10.1371/journal.ppat.1009774 34297785 PMC8336809 69 Huang Z Xie L Huang L Regulation of host immune responses by Lactobacillus through aryl hydrocarbon receptors Med Microecology 2023 16 100081 10.1016/j.medmic.2023.100081 70 Kayama H Takeda K Polysaccharide A of bacteroides fragilis: actions on dendritic cells and T cells Mol Cell 2014 54 206–7 10.1016/j.molcel.2014.04.002 24766882 71 Cohen-Poradosu R McLoughlin RM Lee JC Kasper DL Bacteroides fragilis–stimulated interleukin-10 contains expanding disease J Infect Dis 2011 204 363–71 10.1093/infdis/jir277 21742834 72 Bahman F Choudhry K Al-Rashed F Al-Mulla F Sindhu S Ahmad R Aryl hydrocarbon receptor: current perspectives on key signaling partners and immunoregulatory role in inflammatory diseases Front Immunol 2024 15 1421346 10.3389/fimmu.2024.1421346 39211042 PMC11358079 73 Mo X Rao DP Kaur K Hassan R Abdel-Samea AS Farhan SM Indole derivatives: A versatile scaffold in modern drug discovery-an updated review on their multifaceted therapeutic applications (2020-2024) Molecules (Basel Switzerland) 2024 29 10.3390/molecules29194770 39407697 PMC11477627 74 Brockmann L Tran A Huang Y Edwards M Ronda C Wang HH Intestinal microbiota-specific Th17 cells possess regulatory properties and suppress effector T cells via c-MAF and IL-10 Immunity 2023 56 2719 2735 e7 10.1016/j.immuni.2023.11.003 38039966 PMC10964950 75 Beneke V Grieger KM Hartwig C Muller J Sohn K Blaudszun AR Homeostatic T helper 17 cell responses triggered by complex microbiota are maintained in ex vivo intestinal tissue slices Eur J Immunol 2024 54 e2350946 10.1002/eji.202350946 38763899 76 Marques de Souza PR Wallace LE Habibyan YB Davoli-Ferreira M Ohland C Vicentini FA T cells regulate intestinal motility and shape enteric neuronal responses to intestinal microbiota GUT MICROBES 2024 17 2442528 10.1080/19490976.2024.2442528 39704079 77 Li M Wang Z Jiang W Lu Y Zhang J The role of group 3 innate lymphoid cell in intestinal disease Front Immunol 2023 14 1171826 10.3389/fimmu.2023.1171826 37122757 PMC10140532 78 Lyu M Suzuki H Kang L Gaspal F Zhou W Goc J ILC3s select microbiota-specific regulatory T cells to establish tolerance in the gut Nature 2022 610 744–51 10.1038/s41586-022-05141-x 36071169 PMC9613541 79 Gaudino SJ Kumar P Cross-talk between antigen presenting cells and T cells impacts intestinal homeostasis, bacterial infections, and tumorigenesis Front Immunol 2019 10 360 10.3389/fimmu.2019.00360 30894857 PMC6414782 80 Ness S Lin S Gordon JR Regulatory dendritic cells, T cell tolerance, and dendritic cell therapy for immunologic disease Front Immunol 2021 12 633436 10.3389/fimmu.2021.633436 33777019 PMC7988082 81 Bashir H Singh S Singh RP Agrewala JN Kumar R Age-mediated gut microbiota dysbiosis promotes the loss of dendritic cells tolerance Aging Cell 2023 22 e13838 10.1111/acel.13838 37161603 PMC10265174 82 Penna G RM The immune system in the control of microbiota homeostasis Ital J Pediatr 2015 10.1186/1824-7288-41-S1-A29 83 Hasegawa H Matsumoto T Mechanisms of tolerance induction by dendritic cells in vivo Front Immunol 2018 9 350 10.3389/fimmu.2018.00350 29535726 PMC5834484 84 Fukaya T Takagi H Taya H Sato K DCs in immune tolerance in steady-state conditions Methods Mol Biol 2011 677 113–26 20941606 10.1007/978-1-60761-869-0_8 85 Hongo D Zheng P Dutt S Pawar RD Meyer E Engleman EG Identification of two subsets of murine DC1 dendritic cells that differ by surface phenotype, gene expression, and function Front Immunol 2021 12 746469 10.3389/fimmu.2021.746469 34777358 PMC8589020 86 Levings MK Bacchetta R Schulz U Roncarolo MG The role of IL-10 and TGF-beta in the differentiation and effector function of T regulatory cells Int Arch Allergy Immunol 2002 129 263–76 10.1159/000067596 12483031 87 Domogalla MP Rostan PV Raker VK Steinbrink K Tolerance through education: how tolerogenic dendritic cells shape immunity Front Immunol 2017 8 1764 10.3389/fimmu.2017.01764 29375543 PMC5770648 88 Jankovic D Kugler DG Sher A IL-10 production by CD4+ effector T cells: a mechanism for self-regulation Mucosal Immunol 2010 3 239–46 10.1038/mi.2010.8 20200511 PMC4105209 89 Emanuel E Arifuzzaman M Artis D Epithelial-neuronal-immune cell interactions: Implications for immunity, inflammation, and tissue homeostasis at mucosal sites J Allergy Clin Immunol 2024 153 1169–80 10.1016/j.jaci.2024.02.004 38369030 PMC11070312 90 Coates M Lee MJ Norton D MacLeod AS The skin and intestinal microbiota and their specific innate immune systems Front Immunol 2019 10 2950 10.3389/fimmu.2019.02950 31921196 PMC6928192 91 Ronchese F Webb GR Ochiai S Lamiable O Brewerton M How type-2 dendritic cells induce Th2 differentiation: Instruction, repression, or fostering T cell-T cell communication Allergy 2025 80 395 407 10.1111/all.16337 39324367 PMC11804308 92 Manicassamy S Pulendran B Dendritic cell control of tolerogenic responses Immunol Rev 2011 241 206–27 10.1111/j.1600-065X.2011.01015.x 21488899 PMC3094730 93 Ngoi S Yang Y Iwanowycz S Gutierrez J Li Y Williams C Migrating type 2 dendritic cells prime mucosal th17 cells specific to small intestinal commensal bacteria J Immunol 2022 209 1200–11 10.4049/jimmunol.2200204 35995508 PMC9492644 94 Xu H Zhao H Fan D Liu M Cao J Xia Y Interactions between gut microbiota and immunomodulatory cells in rheumatoid arthritis Mediators Inflammation 2020 2020 1430605 10.1155/2020/1430605 32963490 PMC7499318 95 Park JS Gazzaniga FS Kasper DL Sharpe AH Microbiota-dependent regulation of costimulatory and coinhibitory pathways via innate immune sensors and implications for immunotherapy Exp Mol Med 2023 55 1913–21 10.1038/s12276-023-01075-0 37696895 PMC10545783 96 Bourque J Hawiger D Immunomodulatory bonds of the partnership between dendritic cells and T cells Crit Rev Immunol 2018 38 379 401 10.1615/CritRevImmunol.2018026790 30792568 PMC6380512 97 Keir ME Butte MJ Freeman GJ Sharpe AH PD-1 and its ligands in tolerance and immunity Annu Rev Immunol 2008 26 677 704 10.1146/annurev.immunol.26.021607.090331 18173375 PMC10637733 98 Wikenheiser DJ Stumhofer JS ICOS co-stimulation: friend or foe Front Immunol 2016 7 304 27559335 10.3389/fimmu.2016.00304 PMC4979228 99 Arimoto-Miyamoto K Kadowaki N Kitawaki T Iwata S Morimoto C Uchiyama T Optimal stimulation for CD70 induction on human monocyte-derived dendritic cells and the importance of CD70 in naive CD4(+) T-cell differentiation Immunology 2010 130 137–49 20201989 10.1111/j.1365-2567.2010.03220.x PMC2855801 100 Yousefi Y Baines KJ Maleki Vareki S Microbiome bacterial influencers of host immunity and response to immunotherapy Cell Rep Med 2024 5 101487 10.1016/j.xcrm.2024.101487 38547865 PMC11031383 101 Ramakrishna C Kujawski M Chu H Li L Mazmanian SK Cantin EM Bacteroides fragilis polysaccharide A induces IL-10 secreting B and T cells that prevent viral encephalitis Nat Commun 2019 10 2153 10.1038/s41467-019-09884-6 31089128 PMC6517419 102 He Y Mohapatra G Asokan S Nobs SP Elinav E Microbiome modulation of antigen presentation in tolerance and inflammation Curr Opin Immunol 2024 91 102471 10.1016/j.coi.2024.102471 39277909 103 Mousa WK Chehadeh F Husband S Microbial dysbiosis in the gut drives systemic autoimmune diseases Front Immunol 2022 13 906258 10.3389/fimmu.2022.906258 36341463 PMC9632986 104 Farkas AM Panea C Goto Y Nakato G Galan-Diez M Narushima S Induction of Th17 cells by segmented filamentous bacteria in the murine intestine J Immunol Methods 2015 421 104–11 10.1016/j.jim.2015.03.020 25858227 PMC4764030 105 Chen L Zhang L Hua H Liu L Mao Y Wang R Interactions between toll-like receptors signaling pathway and gut microbiota in host homeostasis Immun Inflammation Dis 2024 12 e1356 10.1002/iid3.v12.7 39073297 PMC11284964 106 Dong F Perdew GH The aryl hydrocarbon receptor as a mediator of host-microbiota interplay Gut Microbes 2020 12 1859812 10.1080/19490976.2020.1859812 33382356 PMC7781536 107 Kim CH Complex regulatory effects of gut microbial short-chain fatty acids on immune tolerance and autoimmunity Cell Mol Immunol 2023 20 341–50 10.1038/s41423-023-00987-1 36854801 PMC10066346 108 de Zoete MR Flavell RA Interactions between nod-like receptors and intestinal bacteria Front Immunol 2013 4 462 10.3389/fimmu.2013.00462 24381573 PMC3865441 109 Yoo JY Groer M Dutra SVO Sarkar A McSkimming DI Gut microbiota and immune system interactions Microorganisms 2020 8 10.3390/microorganisms8101587 33076307 PMC7602490 110 Berni Canani R Paparo L Nocerino R Di Scala C Della Gatta G Maddalena Y Gut microbiome as target for innovative strategies against food allergy Front Immunol 2019 10 191 10.3389/fimmu.2019.00191 30828329 PMC6384262 111 Ning X Rui B Li Y Li M Gut microbiota promotes immune tolerance by regulating RORγt+ Treg cells in food allergy Advanced Gut Microbiome Res 2022 10.1155/2022/8529578 112 Fu Y Lyu J Wang S The role of intestinal microbes on intestinal barrier function and host immunity from a metabolite perspective Front Immunol 2023 14 1277102 10.3389/fimmu.2023.1277102 37876938 PMC10591221 113 Allam-Ndoul B Castonguay-Paradis S Veilleux A Gut microbiota and intestinal trans-epithelial permeability Int J Mol Sci 2020 21 10.3390/ijms21176402 32899147 PMC7503654 114 Shao T Hsu R Rafizadeh DL Wang L Bowlus CL Kumar N The gut ecosystem and immune tolerance J Autoimmun 2023 141 103114 10.1016/j.jaut.2023.103114 37748979 115 Zhang H Wang X Zhang J He Y Yang X Nie Y Crosstalk between gut microbiota and gut resident macrophages in inflammatory bowel disease J Transl Int Med 2023 11 382–92 10.2478/jtim-2023-0123 38130639 PMC10732497 116 Viola A Munari F Sanchez-Rodriguez R Scolaro T Castegna A The metabolic signature of macrophage responses Front Immunol 2019 10 1462 10.3389/fimmu.2019.01462 31333642 PMC6618143 117 Eom JA Jeong JJ Han SH Kwon GH Lee KJ Gupta H Gut-microbiota prompt activation of natural killer cell on alcoholic liver disease Gut Microbes 2023 15 2281014 10.1080/19490976.2023.2281014 37988132 PMC10730232 118 Zhou J Tian Z Peng H Tissue-resident NK cells and other innate lymphoid cells Adv Immunol 2020 145 37 53 10.1016/bs.ai.2019.11.002 32081199 119 Kasarello K Cudnoch-Jedrzejewska A Czarzasta K Communication of gut microbiota and brain via immune and neuroendocrine signaling Front Microbiol 2023 14 1118529 10.3389/fmicb.2023.1118529 36760508 PMC9907780 120 Manshouri S Seif F Kamali M Bahar MA Mashayekh A Molatefi R The interaction of inflammasomes and gut microbiota: novel therapeutic insights Cell Commun Signal 2024 22 209 10.1186/s12964-024-01504-1 38566180 PMC10986108 121 Martin-Gallausiaux C Salesse L Garcia-Weber D Marinelli L Beguet-Crespel F Brochard V Fusobacterium nucleatum promotes inflammatory and anti-apoptotic responses in colorectal cancer cells via ADP-heptose release and ALPK1/TIFA axis activation Gut Microbes 2024 16 2295384 10.1080/19490976.2023.2295384 38126163 PMC10761154 122 Ni H Liu M Cao M Zhang L Zhao Y Yi L Sinomenine regulates the cholinergic anti-inflammatory pathway to inhibit TLR4/NF-kappaB pathway and protect the homeostasis in brain and gut in scopolamine-induced Alzheimer's disease mice BioMed Pharmacother 2024 171 116190 10.1016/j.biopha.2024.116190 38278026 123 Liu N Yan X Lv B Wu Y Hu X Zheng C A study on the association between gut microbiota, inflammation, and type 2 diabetes Appl Microbiol Biotechnol 2024 108 213 10.1007/s00253-024-13041-5 38358546 PMC10869376 124 Ding G Yang X Li Y Wang Y Du Y Wang M Gut microbiota regulates gut homeostasis, mucosal immunity and influences immune-related diseases Mol Cell Biochem 2024 10.1007/s11010-024-05077-y 39060829 125 Gu Y Bartolome-Casado R Xu C Bertocchi A Janney A Heuberger C Immune microniches shape intestinal T(reg) function Nature 2024 628 854–62 10.1038/s41586-024-07251-0 38570678 PMC11041794 126 Alzaid F Fagherazzi G Riveline JP Bahman F Al-Rashed F Al-Mulla F Immune cell-adipose tissue crosstalk in metabolic diseases with a focus on type 1 diabetes Diabetologia 2025 68 1616–31 10.1007/s00125-025-06437-z 40553147 PMC12246022 127 Zhao M Chu J Feng S Guo C Xue B He K Immunological mechanisms of inflammatory diseases caused by gut microbiota dysbiosis: A review BioMed Pharmacother 2023 164 114985 10.1016/j.biopha.2023.114985 37311282 128 Karim MR Iqbal S Mohammad S Morshed MN Haque MA Mathiyalagan R Butyrate's (a short-chain fatty acid) microbial synthesis, absorption, and preventive roles against colorectal and lung cancer Arch Microbiol 2024 206 137 10.1007/s00203-024-03834-7 38436734 129 Liu XF Shao JH Liao YT Wang LN Jia Y Dong PJ Regulation of short-chain fatty acids in the immune system Front Immunol 2023 14 1186892 10.3389/fimmu.2023.1186892 37215145 PMC10196242 130 Lee JG Lee J Lee AR Jo SV Park CH Han DS Impact of short-chain fatty acid supplementation on gut inflammation and microbiota composition in a murine colitis model J Nutr Biochem 2022 101 108926 10.1016/j.jnutbio.2021.108926 34848335 131 Kurniawan H Soriano-Baguet L Brenner D Regulatory T cell metabolism at the intersection between autoimmune diseases and cancer Eur J Immunol 2020 50 1626–42 10.1002/eji.201948470 33067808 PMC7756807 132 McBride DA Dorn NC Yao M Johnson WT Wang W Bottini N Short-chain fatty acid-mediated epigenetic modulation of inflammatory T cells in vitro Drug Delivery Transl Res 2023 13 1912–24 10.1007/s13346-022-01284-6 36566262 PMC10695156 133 Huang J Zhou X Dong B Tan H Li Q Zhang J Obesity-related asthma and its relationship with microbiota Front Cell Infect Microbiol 2023 13 1303899 10.3389/fcimb.2023.1303899 38292857 PMC10825962 134 Sun J Xie Q Sun M Zhang W Wang H Liu N Curcumin protects mice with myasthenia gravis by regulating the gut microbiota, short-chain fatty acids, and the Th17/Treg balance Heliyon 2024 10 e26030 10.1016/j.heliyon.2024.e26030 38420408 PMC10900935 135 Zhao H Wang Q Zhao J Wang D Liu H Gao P Ento-A alleviates DSS-induced experimental colitis in mice by remolding intestinal microbiota to regulate SCFAs metabolism and the Th17 signaling pathway BioMed Pharmacother 2024 170 115985 10.1016/j.biopha.2023.115985 38064970 136 Zhang M Zhou Q Dorfman RG Huang X Fan T Zhang H Butyrate inhibits interleukin-17 and generates Tregs to ameliorate colorectal colitis in rats BMC Gastroenterol 2016 16 84 10.1186/s12876-016-0500-x 27473867 PMC4967301 137 Majumdar S Lin Y Bettini ML Host-microbiota interactions shaping T-cell response and tolerance in type 1 diabetes Front Immunol 2022 13 974178 10.3389/fimmu.2022.974178 36059452 PMC9434376 138 Mohsen E Haffez H Ahmed S Hamed S El-Mahdy TS Multiple sclerosis: A story of the interaction between gut microbiome and components of the immune system Mol Neurobiol 2025 62 7762–75 10.1007/s12035-025-04728-5 39934561 PMC12078361 139 Sereti I Verburgh ML Gifford J Lo A Boyd A Verheij E Impaired gut microbiota-mediated short-chain fatty acid production precedes morbidity and mortality in people with HIV Cell Rep 2023 42 113336 10.1016/j.celrep.2023.113336 37918403 PMC10872975 140 Huang MT Chiu CJ Tsai CY Lee YR Liu WL Chuang HL Short-chain fatty acids ameliorate allergic airway inflammation via sequential induction of PMN-MDSCs and Treg cells J Allergy Clin Immunol Glob 2023 2 100163 10.1016/j.jacig.2023.100163 37781663 PMC10509984 141 Zhang L Shi X Qiu H Liu S Yang T Li X Protein modification by short-chain fatty acid metabolites in sepsis: a comprehensive review Front Immunol 2023 14 1171834 10.3389/fimmu.2023.1171834 37869005 PMC10587562 142 Chen L Sun M Wu W Yang W Huang X Xiao Y Microbiota metabolite butyrate differentially regulates th1 and th17 cells' Differentiation and function in induction of colitis Inflammation Bowel Dis 2019 25 1450–61 10.1093/ibd/izz046 30918945 PMC6701512 143 Seo SK Kwon B Immune regulation through tryptophan metabolism Exp Mol Med 2023 55 1371–9 10.1038/s12276-023-01028-7 37394584 PMC10394086 144 Antonini Cencicchio M Montini F Palmieri V Massimino L Lo Conte M Finardi A Microbiota-produced immune regulatory bile acid metabolites control central nervous system autoimmunity Cell Rep Med 2025 6 102028 10.1016/j.xcrm.2025.102028 40101713 PMC12047456 145 Lian J Liang Y Zhang H Lan M Ye Z Lin B The role of polyamine metabolism in remodeling immune responses and blocking therapy within the tumor immune microenvironment Front Immunol 2022 13 912279 10.3389/fimmu.2022.912279 36119047 PMC9479087 146 Zhao T Wang C Liu Y Li B Shao M Zhao W The role of polysaccharides in immune regulation through gut microbiota: mechanisms and implications Front Immunol 2025 16 1555414 10.3389/fimmu.2025.1555414 40230839 PMC11994737 147 Gholami H Chmiel JA Burton JP Maleki Vareki S The role of microbiota-derived vitamins in immune homeostasis and enhancing cancer immunotherapy Cancers (Basel) 2023 15 10.3390/cancers15041300 36831641 PMC9954268 148 Bian X Wu W Yang L Lv L Wang Q Li Y Administration of akkermansia muciniphila ameliorates dextran sulfate sodium-induced ulcerative colitis in mice Front Microbiol 2019 10 2259 10.3389/fmicb.2019.02259 31632373 PMC6779789 149 Earley H Lennon G Balfe A Coffey JC Winter DC O'Connell PR The abundance of Akkermansia muciniphila and its relationship with sulphated colonic mucins in health and ulcerative colitis Sci Rep 2019 9 15683 10.1038/s41598-019-51878-3 31666581 PMC6821857 150 Dmytriv TR Storey KB Lushchak VI Intestinal barrier permeability: the influence of gut microbiota, nutrition, and exercise Front Physiol 2024 15 1380713 10.3389/fphys.2024.1380713 39040079 PMC11260943 151 Rodrigues VF Elias-Oliveira J Pereira IS Pereira JA Barbosa SC MaChado MSG Akkermansia muciniphila and gut immune system: A good friendship that attenuates inflammatory bowel disease, obesity, and diabetes Front Immunol 2022 13 934695 10.3389/fimmu.2022.934695 35874661 PMC9300896 152 Hezaveh K Shinde RS Klotgen A Halaby MJ Lamorte S Ciudad MT Tryptophan-derived microbial metabolites activate the aryl hydrocarbon receptor in tumor-associated macrophages to suppress anti-tumor immunity Immunity 2022 55 324 340 e8 10.1016/j.immuni.2022.01.006 35139353 PMC8888129 153 Su X Gao Y Yang R Gut microbiota-derived tryptophan metabolites maintain gut and systemic homeostasis Cells 2022 11 10.3390/cells11152296 35892593 PMC9330295 154 Rachdi L Zhou Z Berthault C Lourenco C Fouque A Domet T Tryptophan metabolism promotes immune evasion in human pancreatic beta cells EBioMedicine 2023 95 104740 10.1016/j.ebiom.2023.104740 37536063 PMC10412781 155 Kaisanlahti A Turunen J Hekkala J Mishra S Karikka S Amatya SB Gut microbiota-derived extracellular vesicles form a distinct entity from gut microbiota mSystems 2025 10 e0031125 10.1128/msystems.00311-25 40298395 PMC12090791 156 Schwechheimer C Kuehn MJ Outer-membrane vesicles from Gram-negative bacteria: biogenesis and functions Nat Rev Microbiol 2015 13 605–19 10.1038/nrmicro3525 26373371 PMC5308417 157 Bose S Aggarwal S Singh DV Acharya N Extracellular vesicles: An emerging platform in gram-positive bacteria Microb Cell 2020 7 312–22 10.15698/mic2020.12.737 33335921 PMC7713254 158 Freitas MS Bonato VLD Pessoni AM Rodrigues ML Casadevall A Almeida F Fungal extracellular vesicles as potential targets for immune interventions mSphere 2019 4 10.1128/mSphere.00747-19 31694899 PMC6835212 159 Liang X Dai N Sheng K Lu H Wang J Chen L Gut bacterial extracellular vesicles: important players in regulating intestinal microenvironment Gut Microbes 2022 14 2134689 10.1080/19490976.2022.2134689 36242585 PMC9578468 160 Jalalifar S Morovati Khamsi H Hosseini-Fard SR Karampoor S Bajelan B Irajian G Emerging role of microbiota derived outer membrane vesicles to preventive, therapeutic and diagnostic proposes Infect Agent Cancer 2023 18 3 10.1186/s13027-023-00480-4 36658631 PMC9850788 161 Sultan S Mottawea W Yeo J Hammami R Gut microbiota extracellular vesicles as signaling molecules mediating host-microbiota communications Int J Mol Sci 2021 22 10.3390/ijms222313166 34884969 PMC8658398 162 Kim SH Keum B Kwak S Byun J Shin JM Kim TH Therapeutic applications of extracellular vesicles in inflammatory bowel disease Int J Mol Sci 2024 25 10.3390/ijms25020745 38255819 PMC10815267 163 Li Y Zhou C Liu H Cai T Fan H Emerging roles of extracelluar vesicles derived from bacteria, mammalian or plant cells in the pathogenesis and clinical application of neurodegenerative diseases Biomolecules 2024 14 10.3390/biom14030312 38540732 PMC10968246 164 Kalluri R McAndrews KM The role of extracellular vesicles in cancer Cell 2023 186 1610–26 10.1016/j.cell.2023.03.010 37059067 PMC10484374 165 Effah CY Ding X Drokow EK Li X Tong R Sun T Bacteria-derived extracellular vesicles: endogenous roles, therapeutic potentials and their biomimetics for the treatment and prevention of sepsis Front Immunol 2024 15 1296061 10.3389/fimmu.2024.1296061 38420121 PMC10899385 166 Diez-Sainz E Milagro FI Riezu-Boj JI Lorente-Cebrian S Effects of gut microbiota-derived extracellular vesicles on obesity and diabetes and their potential modulation through diet J Physiol Biochem 2022 78 485–99 34472032 10.1007/s13105-021-00837-6 PMC8410452 167 Petousis-Harris H Impact of meningococcal group B OMV vaccines, beyond their brief Hum Vaccin Immunother 2018 14 1058–63 10.1080/21645515.2017.1381810 29048985 PMC5989908 168 Zhang X Wang Y Naveed M Wang X Liu Y Li M The biological activity and potential of probiotics-derived extracellular vesicles as postbiotics in modulating microbiota-host communication J Nanobiotechnology 2025 23 349 10.1186/s12951-025-03435-6 40380331 PMC12082936 169 Lusiak-Szelachowska M Weber-Dabrowska B Zaczek M Borysowski J Gorski A The presence of bacteriophages in the human body: good, bad or neutral Microorganisms 2020 8 10.3390/microorganisms8122012 33339331 PMC7767151 170 Cianci R Caldarelli M Brani P Bosi A Ponti A Giaroni C Cytokines meet phages: A revolutionary pathway to modulating immunity and microbial balance Biomedicines 2025 13 10.3390/biomedicines13051202 40427029 PMC12109214 171 Sinha A Maurice CF Bacteriophages: uncharacterized and dynamic regulators of the immune system Mediators Inflammation 2019 2019 3730519 10.1155/2019/3730519 31582898 PMC6754933 172 Hou X Ding H Wang H Wang J Liu H Hu H Gut bacteriophages induce specific-reprogramming of macrophages to generate a protective innate immunity response to lipopolysaccharide exposure Gut Microbes 2025 17 2524540 10.1080/19490976.2025.2524540 40574460 PMC12218588 173 Gomes-Santos AC Moreira TG Castro-Junior AB Horta BC Lemos L Cruz DN New insights into the immunological changes in IL-10-deficient mice during the course of spontaneous inflammation in the gut mucosa Clin Dev Immunol 2012 2012 560817 10.1155/2012/560817 22400037 PMC3287045 174 Borin JM Liu R Wang Y Wu TC Chopyk J Huang L Fecal virome transplantation is sufficient to alter fecal microbiota and drive lean and obese body phenotypes in mice Gut Microbes 2023 15 2236750 10.1080/19490976.2023.2236750 37475473 PMC10364654 175 Li J Yang F Xiao M Li A Advances and challenges in cataloging the human gut virome Cell Host Microbe 2022 30 908–16 10.1016/j.chom.2022.06.003 35834962 176 Lin DM Koskella B Lin HC Phage therapy: An alternative to antibiotics in the age of multi-drug resistance World J Gastrointest Pharmacol Ther 2017 8 162–73 10.4292/wjgpt.v8.i3.162 28828194 PMC5547374 177 Strathdee SA Hatfull GF Mutalik VK Schooley RT Phage therapy: From biological mechanisms to future directions Cell 2023 186 17 31 10.1016/j.cell.2022.11.017 36608652 PMC9827498 178 Cui L Kiga K Kondabagil K Wegrzyn A Current and future directions in bacteriophage research for developing therapeutic innovations Sci Rep 2024 14 24404 10.1038/s41598-024-76427-5 39420115 PMC11487266 179 Zalewska-Piatek B Phage therapy-challenges, opportunities and future prospects Pharm (Basel) 2023 16 38139765 10.3390/ph16121638 PMC10747886 180 Almonte AA Thomas S Zitvogel L Microbiota-centered interventions to boost immune checkpoint blockade therapies J Exp Med 2025 222 10.1084/jem.20250378 40261296 PMC12013646 181 He L Zhong Z Wen S Li P Jiang Q Liu F Gut microbiota-derived butyrate restores impaired regulatory T cells in patients with AChR myasthenia gravis via mTOR-mediated autophagy Cell Commun Signal 2024 22 215 10.1186/s12964-024-01588-9 38570836 PMC10988943 182 Xu B Liu Y Li N Geng Q Lactate and lactylation in macrophage metabolic reprogramming: current progress and outstanding issues Front Immunol 2024 15 1395786 10.3389/fimmu.2024.1395786 38835758 PMC11148263 183 Gao Y Fan S Sun X Li J Dai Y Li H Oncometabolite fumarate facilitates PD-L1 expression and immune evasion in clear cell renal cell carcinoma Cell Death Dis 2025 16 432 10.1038/s41419-025-07752-4 40461489 PMC12134299 184 Routy JP Routy B Graziani GM Mehraj V The kynurenine pathway is a double-edged sword in immune-privileged sites and in cancer: implications for immunotherapy Int J Tryptophan Res 2016 9 67 77 10.4137/IJTR.S38355 27773992 PMC5063567 185 Seldin MM Meng Y Qi H Zhu W Wang Z Hazen SL Trimethylamine N-oxide promotes vascular inflammation through signaling of mitogen-activated protein kinase and nuclear factor-kappaB J Am Heart Assoc 2016 5 10.1161/JAHA.115.002767 26903003 PMC4802459 186 Kim IS Jo EK Inosine: A bioactive metabolite with multimodal actions in human diseases Front Pharmacol 2022 13 1043970 10.3389/fphar.2022.1043970 36467085 PMC9708727 187 Saxami G Kerezoudi EN Eliopoulos C Arapoglou D Kyriacou A The gut-organ axis within the human body: gut dysbiosis and the role of prebiotics Life (Basel) 2023 13 10.3390/life13102023 37895405 PMC10608660 188 Sobocki BK Kaźmierczak-Siedlecka K Folwarski M Hawryłkowicz V Makarewicz W Stachowska E Pancreatic cancer and gut microbiome-related aspects: A comprehensive review and dietary recommendations Nutrients 2021 13 10.3390/nu13124425 34959977 PMC8709322 189 Ni Y Zhang Y Zheng L Rong N Yang Y Gong P Bifidobacterium and Lactobacillus improve inflammatory bowel disease in zebrafish of different ages by regulating the intestinal mucosal barrier and microbiota Life Sci 2023 324 121699 10.1016/j.lfs.2023.121699 37061125 190 Veiga P Suez J Derrien M Elinav E Moving from probiotics to precision probiotics Nat Microbiol 2020 5 878–80 10.1038/s41564-020-0721-1 32393856 191 Mullish BH Merrick B Quraishi MN Bak A Green CA Moore DJ The use of faecal microbiota transplant as treatment for recurrent or refractory Clostridioides difficile infection and other potential indications: second edition of joint British Society of Gastroenterology (BSG) and Healthcare Infection Society (HIS) guidelines J Hosp Infect 2024 148 189 219 10.1016/j.jhin.2024.03.001 38609760 192 Biazzo M Allegra M Deidda G Clostridioides difficile and neurological disorders: New perspectives Front Neurosci 2022 16 946601 10.3389/fnins.2022.946601 36203814 PMC9530032 193 Tian Y Zhou Y Huang S Li J Zhao K Li X Fecal microbiota transplantation for ulcerative colitis: a prospective clinical study BMC Gastroenterol 2019 19 116 10.1186/s12876-019-1010-4 31272391 PMC6610864 194 Xiang W Xiang H Wang J Jiang Y Pan C Ji B Fecal microbiota transplantation: a novel strategy for treating Alzheimer's disease Front Microbiol 2023 14 1281233 10.3389/fmicb.2023.1281233 38033557 PMC10687436 195 Dou Y Yu X Luo Y Chen B Ma D Zhu J Effect of fructooligosaccharides supplementation on the gut microbiota in human: A systematic review and meta-analysis Nutrients 2022 14 10.3390/nu14163298 36014803 PMC9413759 196 Wang Y Wen L Tang H Qu J Rao B Probiotics and prebiotics as dietary supplements for the adjunctive treatment of type 2 diabetes Pol J Microbiol 2023 72 3 9 10.33073/pjm-2023-013 36929892 PMC10280329 197 Aziz T Hussain N Hameed Z Lin L Elucidating the role of diet in maintaining gut health to reduce the risk of obesity, cardiovascular and other age-related inflammatory diseases: recent challenges and future recommendations Gut Microbes 2024 16 2297864 10.1080/19490976.2023.2297864 38174551 PMC10773664 198 Gomez Quintero DF Kok CR Hutkins R The future of synbiotics: rational formulation and design Front Microbiol 2022 13 919725 10.3389/fmicb.2022.919725 35935226 PMC9354465 199 Kao D Roach B Silva M Beck P Rioux K Kaplan GG Effect of Oral Capsule- vs Colonoscopy-Delivered Fecal Microbiota Transplantation on Recurrent Clostridium difficile Infection: A Randomized Clinical Trial JAMA 2017 318 1985–93 10.1001/jama.2017.17077 29183074 PMC5820695 200 Liao JF Cheng YF You ST Kuo WC Huang CW Chiou JJ Lactobacillus plantarum PS128 alleviates neurodegenerative progression in 1-methyl-4-phenyl-1,2,3,6-tetrahydropyridine-induced mouse models of Parkinson's disease Brain Behav Immun 2020 90 26 46 10.1016/j.bbi.2020.07.036 32739365 201 Furrie E Macfarlane S Kennedy A Cummings JH Walsh SV O'Neil D A Synbiotic therapy (Bifidobacterium longum/Synergy 1) initiates resolution of inflammation in patients with active ulcerative colitis: a randomised controlled pilot trial Gut 2005 54 242–9 10.1136/gut.2004.044834 15647189 PMC1774839 202 Li N Chen H Cheng Y Xu F Ruan G Ying S Fecal microbiota transplantation relieves gastrointestinal and autism symptoms by improving the gut microbiota in an open-label study Front Cell Infect Microbiol 2021 11 759435 10.3389/fcimb.2021.759435 34737978 PMC8560686 203 Jamka M Kokot M Kaczmarek N Bermagambetova S Nowak JK Walkowiak J The effect of sodium butyrate enemas compared with placebo on disease activity, endoscopic scores, and histological and inflammatory parameters in inflammatory bowel diseases: A systematic review of randomised controlled trials Complement Med Res 2021 28 344–56 10.1159/000512952 33352566 204 Kavita Om H Chand U Kushawaha PK Postbiotics: An alternative and innovative intervention for the therapy of inflammatory bowel disease Microbiol Res 2024 279 127550 10.1016/j.micres.2023.127550 38016379 205 Venhorst J van der Vossen J Agamennone V Battling Enteropathogenic Clostridia: Phage Therapy for Clostridioides difficile and Clostridium perfringens Front Microbiol 2022 13 891790 10.3389/fmicb.2022.891790 35770172 PMC9234517 206 Arnold J Glazier J Mimee M Genetic engineering of resident bacteria in the gut microbiome J Bacteriol 2023 205 e0012723 10.1128/jb.00127-23 37382533 PMC10367592 207 Yu Y Wang W Zhang F The next generation fecal microbiota transplantation: to transplant bacteria or virome Adv Sci (Weinh) 2023 10 e2301097 10.1002/advs.202301097 37914662 PMC10724401 208 Sahle Z Engidaye G Shenkute Gebreyes D Adenew B Abebe TA Fecal microbiota transplantation and next-generation therapies: A review on targeting dysbiosis in metabolic disorders and beyond SAGE Open Med 2024 12 20503121241257486 10.1177/20503121241257486 38826830 PMC11143861 209 Vatanen T de Beaufort C Marcovecchio ML Overbergh L Brunak S Peakman M Gut microbiome shifts in people with type 1 diabetes are associated with glycaemic control: an INNODIA study Diabetologia 2024 67 1930–42 10.1007/s00125-024-06192-7 38832971 PMC11410864 210 Varela E Manichanh C Gallart M Torrejon A Borruel N Casellas F Colonisation by Faecalibacterium prausnitzii and maintenance of clinical remission in patients with ulcerative colitis Aliment Pharmacol Ther 2013 38 151–61 10.1111/apt.2013.38.issue-2 23725320 211 Deter HS Lu T Engineering microbial consortia with rationally designed cellular interactions Curr Opin Biotechnol 2022 76 102730 10.1016/j.copbio.2022.102730 35609504 PMC10129393 212 Chen X Gao M Wang L Qiang G Wu Y Huang H A synthetic microbial consortium protects against obesity by regulating vitamin B6 metabolism Gut Microbes 2024 16 2304901 10.1080/19490976.2024.2304901 38269591 PMC10813659 213 Duncker KE Holmes ZA You L Engineered microbial consortia: strategies and applications Microb Cell Fact 2021 20 211 10.1186/s12934-021-01699-9 34784924 PMC8597270 214 Honig G Larkin PB Heller C Hurtado-Lorenzo A Research-based product innovation to address critical unmet needs of patients with inflammatory bowel diseases Inflammation Bowel Dis 2021 27 S1 S16 10.1093/ibd/izab230 34791292 PMC8922161 215 Urbani G Rondini E Distrutti E Marchiano S Biagioli M Fiorucci S Phenotyping the chemical communications of the intestinal microbiota and the host: secondary bile acids as postbiotics Cells 2025 14 10.3390/cells14080595 40277921 PMC12025480 216 Wang G Huang S Wang Y Cai S Yu H Liu H Bridging intestinal immunity and gut microbiota by metabolites Cell Mol Life Sci 2019 76 3917–37 10.1007/s00018-019-03190-6 31250035 PMC6785585 217 Zhang M Liu J Xia Q Role of gut microbiome in cancer immunotherapy: from predictive biomarker to therapeutic target Exp Hematol Oncol 2023 12 84 10.1186/s40164-023-00442-x 37770953 PMC10537950 218 Zhou P Chen C Patil S Dong S Unveiling the therapeutic symphony of probiotics, prebiotics, and postbiotics in gut-immune harmony Front Nutr 2024 11 1355542 10.3389/fnut.2024.1355542 38389798 PMC10881654 219 Auger C Kajimura S Adipose tissue remodeling in pathophysiology Annu Rev Pathol 2023 18 71 93 10.1146/annurev-pathol-042220-023633 36070562 PMC9877135 220 Fonseca DC Marques Gomes da Rocha I Depieri Balmant B Callado L Aguiar Prudencio AP Tepedino Martins Alves J Evaluation of gut microbiota predictive potential associated with phenotypic characteristics to identify multifactorial diseases Gut Microbes 2024 16 2297815 10.1080/19490976.2023.2297815 38235595 PMC10798365 ",
  "metadata": {
    "Title of this paper": "Evaluation of gut microbiota predictive potential associated with phenotypic characteristics to identify multifactorial diseases",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488628/"
  }
}