{
  "title": "Paper_214",
  "abstract": "pmc Front Cell Infect Microbiol Front Cell Infect Microbiol 1860 fcimb Front. Cell. Infect. Microbiol. Frontiers in Cellular and Infection Microbiology 2235-2988 Frontiers Media SA PMC12489942 PMC12489942.1 12489942 12489942 10.3389/fcimb.2025.1611391 1 Cellular and Infection Microbiology Original Research Combined multiplex polymerase chain reaction-based targeted next−generation sequencing and serum 1, 3-β-D-glucan for differential diagnosis of Pneumocystis and Pneumocystis Wang Hansheng  1 Chen Xiao  2 Wu Xiaofeng  1 Cao Qizhen  3 Wu Yi  1 Wang Fang  1 Wang Yunyun  4 Zhou Yanhui  1 Tang Yijun  1 Ren Tao  1  * Wang Meifang  1  *  1 Department of Pulmonary and Critical Care Medicine, Shiyan Key Laboratory of Major Chronic Respiratory Disease, Hubei Provincial Clinical Research Center for Umbilical Cord Blood Hematopoietic Stem Cells, Taihe Hospital, Hubei University of Medicine Shiyan, Hubei China  2 Department of Laboratory, Shiyan Maternal and Child Health Hospital, Hubei University of Medicine Shiyan, Hubei China  3 Department of Radiology, Taihe Hospital, Hubei University of Medicine Shiyan, Hubei China  4 Department of Cardiothoracic surgery, Taihe Hospital, Hubei University of Medicine Shiyan, Hubei China Edited by: Meng Qin Reviewed by: Leland Shapiro  Nina Stoyanova Yancheva-Petrova *Correspondence: Meifang Wang, wmfpps02@163.com doctorrentao@sina.com 18 9 2025 2025 15 481321 1611391 14 4 2025 28 8 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Wang, Chen, Wu, Cao, Wu, Wang, Wang, Zhou, Tang, Ren and Wang. 2025 Wang, Chen, Wu, Cao, Wu, Wang, Wang, Zhou, Tang, Ren and Wang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background and Objective  Pneumocystis jirovecii Pneumocystis jirovecii P. jirovecii P. jirovecii P. jirovecii Methods A total of 73 patients were enrolled and the final diagnosis was used as a reference criterion, and patients were divided into the PjP group and PjC group. The clinical data and detection performance of mp-tNGS/serum BDG were analyzed. Results The median fungal reads (normalized sequence counts) detected by mp-tNGS were 1522.00 (interquartile range [IQR], 581.5, 4898.0) in the PjP group versus 117.00 (IQR, 79.00, 257.00) in the PjC group ( p < p < Conclusion BALF mp-tNGS and serum BDG serve as valuable adjunct diagnostic tools, providing reliable differentiation between P. jirovecii Pneumocystis jirovecii multiplex PCR-based targeted next generation sequencing (mp-tNGS) bronchoalveolar lavage fluid (BALF) 1 3-β-D-glucan (BDG) colonization The author(s) declare financial support was received for the research and/or publication of this article. This work was supported by Joint Fund Project for Innovative Development of Natural Science Foundation of Hubei Province (2025AFD181). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Clinical Infectious Diseases 1 Introduction  Pneumocystis jirovecii pneumocystis jirovecii Grønseth et al., 2021 Thomas and Limper, 2004 P. jirovecii Crothers et al., 2011 Salzer et al., 2018 Bienvenu et al., 2016 Dunbar et al., 2020 Kanj et al., 2021 Morris and Norris, 2012 Stern et al., 2014 Kotani et al., 2017 Traditionally, in the presence of clinical suspicion, PjP is diagnosed by the microscopic presence of pneumocysts Calderón et al., 2010 BDG, a highly conserved polysaccharide component of fungal cell walls, is synthesized during the biogenesis of the fungal cell wall in numerous pathogenic species. This immunogenic molecule has been established as a reliable biomarker for fungal infections, particularly pulmonary aspergillosis and invasive candidiasis ( Obayashi et al., 1995 Pneumocystis jirovecii Tasaka et al., 2007 Watanabe et al., 2009 Matsumura et al., 2012 Onishi et al., 2012 Pneumocystis jirovecii Tasaka et al., 2007 Matsumura et al., 2012 Del Corpo et al., 2020 With the rapid advancements in molecular biology, techniques such as metagenomic next-generation sequencing (mNGS) and multiplex PCR-based targeted next-generation sequencing (mp-tNGS) are now widely employed to directly detect target organisms in respiratory samples ( Sun et al., 2024 Yin et al., 2024 Hsu et al., 2025 Li et al., 2023 Yin et al., 2024 pneumocystis jirovecii in Miller et al., 2019 Damiani et al., 2013 However, the diagnostic performance of combining serum BDG assay and BALF mp-tNGS for differentiating between colonization and infection of pneumocystis jirovecii P. jirovecii 2 Patients and methods 2.1 Participants and study design Between January 2022 and December 2024, patients presenting with pulmonary infiltrates of undetermined etiology or clinical suspicion of PjP who received BALF mp-tNGS testing during the study period were enrolled at Taihe Hospital. Patients were excluded if the following criteria were met: (1) administered empiric treatment (therapeutic doses) for PjP prior to the mp-tNGS tests, (2) serum BDG assay were performed more than 7 days after mp-tNGS, (3) other pulmonary fungal infections are present, and (4) incomplete medical record. A complete medical records encompassing demographic characteristics, clinical parameters, radiologic and laboratory findings was collected before the end of the study for all enrolled patients, as follows: (1) underlying diseases (solid organ malignancy, hematologic malignancies, HIV/AIDS status, prolonged use of corticosteroids/immunosuppressants and autoimmune disease); (2) radiographic findings (chest X-ray and high-resolution computed tomography); (3) laboratory results (absolute count of leukocytes/lymphocyte, HIV viral load, hypersensitive-C-reactive protein [hs-CRP], erythrocyte sedimentation rate (ESR), interleukin-6 [IL-6], procalcitonin [PCT] and lactate dehydrogenase [LDH]); and (4) clinical outcomes. Two independent senior clinicians who reviewed and evaluated the patients’ immune status, clinical manifestations, laboratory results, radiologic findings, the mp-tNGS report, and the response to anti- P. jirovecii 2.2 Definitions PjP classification followed modified EORTC/MSG consensus guidelines for invasive fungal diseases ( Donnelly et al., 2020  Proven/probable PjP P. jirovecii 2  Possible PjP: P. jirovecii  Non-PjP:  Figure 1 Figure 1 Flowchart for the enrolled and diagnosis of the study population. Flowchart depicting patient inclusion criteria for a study on unexplained lung infiltrates. From 693 patients, 620 were excluded for reasons such as delayed serum BDG assay, incomplete records, or confirmed non-PjP diagnosis. The remaining 73 patients were categorized as follows: 27 possible PjP, 3 proven PjP, and 43 probable PjP. The possible group included patients with positive BALF mp-NGS, some positive serum BDG, and negative chest CT and host factors. The proven group involved detection of P. jirovecii in BALF by GMS staining. The probable group had positive BALF mp-NGS, most positive serum BDG, chest CT, and host factors. 2.3 Serum BDG tests The (1–3)-β-D-glucan detection kit (Dynamiker Biotechnology Co., Ltd., Tianjin, China) was used to assess the levels of serum BDG following the manufacturer’s instructions with a chromogenic method ( Yu et al., 2020 2.5 mp-tNGS procedures and bioinformatics analysis 2.5.1 mp-tNGS workflow construction Mp-tNGS workflow construction, including database integration and primer design, refer to the study of Zhang P et al ( Zhang et al., 2024 Yin et al., 2024  Supplementary Table S1 m Mycobacterium tuberculosis complex 2.5.2 mp-tNGS nucleic acid extraction DTT liquefaction reagent (0.1 M) in the same volume as the BALF sample was added to the sampling tube, which was subsequently vortexed, shaken, mixed well, and left for 3–5 min until the sample liquefied. A total of 1.3 mL of liquefied sample was added, 13 μL of exogenous endogenous reagent was added, the mixture was mixed well, the mixture was centrifuged at 12000 rpm for 5min, the supernatant was discarded, 500 μL of the sample was removed, the sample was mixed with a pipette, 500 μL of the sample was added to the bead mill tube of the extraction kit, 50 μL of SDS was added, and the mixture was placed into the sonicator (4700 rpm, oscillated for 45 s, with an intermittent pause of 20 s, and 2 intervals, with a total of 3 oscillations of 135 s) for sonication. The total time of 3 oscillations was 135 s for the wall-breaking treatment. After wall-breaking treatment, the mixture was centrifuged at 12000 rpm for 5min, and 400 μL (manual extraction) or 250 μL (automated extraction) of the supernatant was collected for nucleic acid extraction via the MetaPure DNA & RNA Extraction Kit (KingCreate, Guangzhou, China) and extracted according to the instructions of the kit. 2.5.3 mp-tNGS library construction The target species covered by the mp-tNGS panel are listed in  Supplementary Table S1 2.5.4 Bioinformatics analysis The sequencing data generated were analysed via a bioinformatic workflow. The raw sequencing read data were subjected to a quality control procedure. fastp v0.20.1 ( Chen et al., 2018 Langmead and Salzberg, 2012 2.6 Statistical analysis SPSS software version 26.0 was used for the statistical analysis. The Shapiro-Wilk test was used to assess whether continuous variables followed a normal or non-normal distribution. The continuous variables with normal distribution were expressed as the means ± standard deviations (means ± SDs), and a t test was used for comparison between two groups; non-normally distributed continuous variables were expressed as the median and interquartile range (25th–75th percentiles), and the Mann–Whitney U test was used for comparison between two groups. Receiver operating characteristic (ROC) curves were designed to assess the sensitivity, specificity, PPV (positive predictive value) () and NPV (negative predictive value) for the serum BDG and mp-tNGS. Categorical variables were expressed as n (%) and compared using the chi-square test. Probability values <5% ( p 3 Results 3.1 Demographic and clinical characteristics During the 35-month study period, A total of 693 patients who underwent bronchoalveolar lavage for BALF sample collection and subsequent mp-tNGS testing were included in the study. Among them, seventy-eight patients with positive P. jirovecii  Figure 1 As detailed in  Table 1 vs p p p p vs p vs p p > vs p vs p  Supplementary Figure A–D p  Figures 2A–D  Table 1  Figures 2E–G  Table 1 p  Figure 3A p <  Figure 3B Table 1 Demographics and clinical characteristics of Pneumocystis jirovecii Pneumocystis jirovecii Characteristics Total (n= 73) PjP (n= 46) PjC (n= 27) χ 2  p- Age (years). mean ± SD 62.5 ± 10.8 61.5 ± 10.9 64.2 ± 10.3 -8.05 0.000 Gender (Male/Female), n 61/12 42/4 19/8 5.43 0.02 Smoking history (≥ 5 years), n (%) 45(61.6) 30(65.2) 15(55.6) 0.67 0.41 Drinking history (≥ 3 years), n (%) 31(42.5) 21(45.7) 10(37.0) 0.52 0.47 Main clinical symptoms, n (%) Fever 33(45.2) 25(54.3) 8(29.6) 4.20 0.04 Cough 56(76.7) 37(80.4) 19(70.4) 0.97 0.33 Dyspnea 44(60.3) 29(63.0) 15(55.6) 0.40 0.53 Hypoxemia 25(34.2) 20(43.5) 5(18.5) 4.71 0.03 Underline diseases, n (%) AIDS/HIV advanced stage 3(4.1) 3(6.5) 0 1.84 0.18 Diabetes 10(13.7) 3(6.5) 7(25.9) 5.4 0.02 Chronic liver disease 10(13.7) 7(15.2) 3(11.1) 0.24 0.62 Chronic kidney diseases 3(4.1) 2(4.3) 1(3.7) 0.02 0.89 Solid organ malignancy 15(20.5) 11(23.9) ▴ 4(14.8) ▴▴ 0.86 0.35 Hematologic tumor 2(2.7) 2(4.3) # 0 1.21 0.27 Autoimmune disease 5(6.8) 3(6.5) * 2(7.4) ** 0.02 0.89 Corticosteroid use 4(5.5) 2(4.3) 2(7.4) 0.31 0.58 Chemotherapy 9(12.3) 6(13.0) 3(11.1) 0.06 0.81 Chronic pulmonary disease 18(24.7) 13(28.3) △ 5(18.5) △△ 0.87 0.35 Radiologic abnormalities, n (%) Bilateral ground glass opacities 26(35.6) 23(50.0) 3(11.1) 11.22 0.001 Consolidations 26(35.6) 15(32.6) 11(40.7) 0.49 0.48 Infiltrates 33(45.2) 19(41.3) 14(51.9) 0.76 0.38 Cystic lesions 2(2.7) 2(4.3) 0 1.21 0.27 Pleural effusions 3(4.1) 2(4.3) 1(3.7) 0.02 0.89 Laboratory tests, n (%) WBC (×10 9 8.26(5.92,10.62) 8.72 (6.45,10.79) 6.37(4.70,9.40) -5.75 0.000 Lymphocyte (×10 9 1.44(1.00,1.97) 1.37(0.99,2.22) 1.60(1.00,1.88) -3.23 0.747 Hemoglobin (g/L; NR:115-175) 131.70 ± 22.79 130.29 ± 23.93 134.01 ± 20.60 -7.66 0.000 Albumin (g/L; NR:40-55) 35.71 ± 6.00 34.60 ± 5.50 37.45 ± 6.35 -11.98 0.000 ESR (mm/h; NR:0-20) 61.00(28.00,87.0) 61.00(37.00,86.00) 87.00(26.00,103.00) -0.45 0.653 IL-6 (pg/ml; NR:0-6.6) 420.00(82.49,1965.0) 578.60(100.90,1965.0) 155.80(34.91,352.40) -25.04 0.000 Hs-CRP (mg/L; NR:0-10) 86.95(55.83,177.30) 93.97(63.81,217.92) 55.46(35.13,100.77) -17.51 0.000 LDH (U/L; NR:100-240) 261.80(211.90,417.10) 260.50(204.90,440.10) 280.50(216.40,342.00) -5.06 0.613 PCT (ng/ml; NR: 0-0.5) 2.71(0.49,4.80) 2.82(1.18,3.81) 2.49(0.35,5.03) -1.77 0.077 In  Table 1 t Z AIDS, acquired immune deficiency syndrome; HIV, human immunodeficiency virus; WBC, white blood cell; IL-6, Interleukin-6; ESR, erythrocyte sedimentation rate; Hs-CRP, hypersensitive-c-reactive-protein; LDH, lactate dehydrogenase; PCT, procalcitonin; NR, normal range.  ▴ ▴▴  #  * **  △ △△ Figure 2 Blood analysis of leukocyte and lymphocyte counts, erythrocyte sedimentation rate (ESR), lactate dehydrogenase (LDH), hypersensitive C-reactive protein (hs-CRP), procalcitonin (PCT), and interleukin-6 (IL-6) levels in Pneumocystis jirovecii Pneumocystis jirovecii (A) (B) (C) (D) (E) (F) (G) Bar charts compare various biomarkers between two groups, PjP and PjC. (A) Lymphocyte counts show no significant difference (p = 0.747). (B) ESR levels also show no significant difference (p = 0.653). (C) LDH levels are not significantly different (p = 0.613). (D) PCT levels have a borderline p-value of 0.08. (E) Leukocyte counts are significantly different (p < 0.01). (F) IL-6 levels differ significantly (p < 0.01). (G) hs-CRP levels show significant differences (p < 0.01). Data values are indicated by dots and triangles, with error bars for variability. Figure 3 Number of multiplex PCR-based targeted next−generation sequencing (mp-tNGS) reads and levels of serum 1,3-β-D-glucan (BDG) between the Pneumocystis jirovecii Pneumocystis jirovecii (A) (B) Two bar graphs comparing mp-tNGS reads and serum BDG levels between PjC and PjP groups. Graph A shows higher mp-tNGS reads for PjP with a p-value less than 0.01. Graph B shows higher serum BDG levels for PjP, also with a p-value less than 0.01. Red markers indicate data spread and error bars. 3.2 Diagnostic efficacy of mp-tNGS and serum BDG for PjP The AUROC of BALF mp-tNGS for discriminating PjP from colonization was 0.935 (95% CI: 0.88–0.99), whereas for serum BDG, it was 0.822 (95% CI: 0.72–0.93). The optimal cut-off values for distinguishing P. jirovecii  Figure 4A  Figure 4B Figure 4 Receiver operating characteristic (ROC) curves were generated to evaluate the diagnostic performance of multiplex PCR-based targeted next−generation sequencing (mp-tNGS) and serum 1,3-β-D-glucan (BDG) assay in differentiating Pneumocystis jirovecii Pneumocystis jirovecii (A) (A) (B) (B) Two receiver operating characteristic (ROC) curves comparing test performance. Graph A shows the ROC curve for mp-tNGS with an AUC of 0.935. Graph B displays the ROC curve for BDG with an AUC of 0.822. Both graphs plot sensitivity versus 100% minus specificity, with diagonal red lines representing no-discrimination models. 3.3 The optimal threshold values for differentiating P. jirovecii When mp-tNGS read counts were categorized into low (≤300), medium (300–1000), and high (≥1000) ranges, the proportions of patients diagnosed with PjP were 8.7% (4/46), 30.4% (14/46), and 60.9% (28/46), respectively (χ² =28.44, p  Figure 5A p  Figure 5B p  Figure 5C p  Figure 5D p  Figure 6 Figure 5 Proportion of Pneumocystis jirovecii Pneumocystis jirovecii (A) (B) (C) (D) p p Four bar charts comparing the number of patients with different levels of mp-NGS reads and serum BDG levels in two groups. Charts A and B show mp-NGS reads divided into three categories: less than or equal to 300, between 300 and 1,000, and 1,000 or more. Charts C and D show serum BDG levels in similar categories: less than 80, between 80 and 200, and 200 or more. Significant differences, indicated by asterisks, are observed between PjP (or PjC) and non-PjP (or non-PjC) groups. Figure 6 Scatterplot analysis of the correlation between multiplex PCR-based targeted next−generation sequencing (mp-tNGS) read counts and serum 1,3-β-D-glucan (BDG) levels in mp-tNGS-positive patients. Scatter plot showing the relationship between Serum BDG (pg/mL) on the x-axis and mp-tNGS reads on the y-axis. Data points are scattered with a slight upward trend indicated by a fitted line. The R-squared value is 0.232 with a p-value of 0.06. We evaluated a dual-tests approach for diagnosing PjP using combined thresholds: serum BDG ≥84.5 pg/mL AND mp-tNGS ≥355 reads. This strategy demonstrated 84.2% sensitivity (95% CI: 68.8%-93.9%), correctly identifying PjP cases, and 80.0% specificity (95% CI: 28.4%-99.5%), correctly identifying non-PjP cases. Positive results indicated 97.0% probability of true PjP (PPV; 95% CI: 84.6%-99.5%), while negative results excluded PjP in only 40.0% of cases (NPV; 95% CI: 22.1%-66.1%). Overall diagnostic accuracy ((true positives) + (true negatives))/((true positives + false positives + true negatives + false negatives)) was 83.7% (95% CI: 69.3%-93.2%;  Table 2  Table 3 Table 2 Performance of combined serum BDG and BALF mp-tNGS in all PjP patients (n=46). Parameters PjP mp-tNGS ≥355 reads PjP mp-tNGS <355 reads BDG (≥84.5 pg/ml) 32 1 BDG (<84.5 pg/ml) 6 4 Total 38 5 Sensitivity 84.2% 95% CI (68.8%-93.9%) Specificity 80.0% 95% CI (28.4%-99.5%) PPV 97.0% 95% CI (84.6%-99.5%) NPV 40.0% 95% CI (22.1%-66.1%) Diagnostic accuracy 83.7% 95% CI (69.3%-93.2%) BDG, (1,3)-β-D-glucan; mp-tNGS, multiplex polymerase chain reaction (PCR)-based targeted next-generation sequencing; PjC, Pneumocystis jirovecii Table 3 Performance of combined serum BDG and BALF mp-tNGS in all PjC patients (n=27). Parameters PjC mp-tNGS <355 reads PjC mp-tNGS ≥355 reads BDG (<84.5 pg/ml) 20 3 BDG (≥84.5 pg/ml) 3 1 Total 23 4 Sensitivity 86.9% 95% CI (66.4%-97.2%) Specificity 25.0% 95% CI (0.6%-80.6%) PPV 86.9% 95% CI (78.7%-92.3%) NPV 25.0% 95% CI (4.3%-71.1%) Diagnostic accuracy 77.8% 95% CI (57.7%-91.4%) BDG, (1,3)-β-D-glucan; mp-tNGS, multiplex polymerase chain reaction (PCR)-based targeted next-generation sequencing; PjC, Pneumocystis jirovecii The clinical and radiological outcomes of patients with PjP showed varying degrees of improvement following treatment with trimethoprim-sulfamethoxazole (TMP-SMX) alone or in combination with other drugs, representative chest CT findings are shown in  Supplementary Figure E–H 4 Discussion  Pneumocystis jirovecii Thomas and Limper, 2004 Grønseth et al., 2021 Pneumocystis Damiani et al., 2013 Pneumocystis jirovecii Pneumocystis jirovecii Liu et al., 2024 Yin et al., 2024 In our study, 36.9% (n=27) of Pneumocystis jirovecii Jiang et al., 2025 Tasaka et al., 2014 Matsumura et al., 2012 Pneumocystis jirovecii Morris and Norris, 2012 Various studies have investigated serum BDG as a noninvasive adjunct biomarker for diagnosing PjP in both PLWHand non-HIV-infected individuals, consistently demonstrating an elevated serum BDG levels in individuals with PjP ( Tasaka et al., 2007 Cuétara et al., 2008 Pisculli and Sax, 2008 Watanabe et al., 2009 Held et al., 2011 Pneumocystis jirovecii P. jirovecii Matsumura et al., 2012 Damiani et al., 2013 Tasaka et al., 2014 Liu et al., 2021 Tasaka et al., 2014 Pneumocystis jirovecii Onishi et al., 2012 Karageorgopoulos et al., 2013 Del Corpo et al., 2020 Alanio et al., 2016 Zhang et al., 2025 To date, only two studies have analyzed the use of mp-tNGS for detecting pathogens in pulmonary infections, highlighting its superior performance in identifying Pneumocystis jiroveci Liu et al., 2024 Yin et al., 2024 Yin et al., 2024 Rhizobium budding Aspergillus Niger etc. P. jirovecii P. jirovecii Miller et al., 2019 Pneumocystis jirovecii P. jirovecii Limper et al., 1989 Fauchier et al., 2016 Limper et al., 1989 Azoulay et al., 2009 Previous studies have suggested that serum BDG levels can be used to evaluate fungal load. However, Held et al ( Held et al., 2011 Pneumocystis jirovecii P. jirovecii Sun et al., 2022 p P jirovecii As previously reported, patients with PjP showed a high prevalence of mixed pulmonary infections ( Jiang et al., 2021 Yin et al., 2024 Streptococcus mitis P jirovecii The application of tNGS encounters several substantial challenges, particularly in resource-limited settings. One of the primary barriers is the high upfront investment required for tNGS platforms, reagents, and bioinformatics infrastructure, which can be prohibitively expensive for many laboratories. Additionally, the tNGS workflow is inherently complex, involving multiple steps such as nucleic acid extraction, library preparation, sequencing, and data analysis ( Yin et al., 2024 In conclusion, the combination of BALF mp-tNGS results and serum BDG levels can effectively differentiate between P jirovecii. Acknowledgments We would like to acknowledge all members of the Clinical Molecular Diagnosis Center, Taihe Hospital, Hubei University of Medicine (Xiaofeng Wu, Yunyun Wang and Yanhui Zhou). Data availability statement The original contributions presented in the study are included in the article/  Supplementary Material Ethics statement This study has been approved by the ethics committee of the Taihe hospital, and performed in accordance with the principles of Good Clinical Practice following the Tri-Council guidelines. Written informed consent was obtained from the patient for anonymized information to be published in this article. Author contributions HW: Conceptualization, Data curation, Methodology, Writing – original draft, Writing – review & editing. XC: Data curation, Methodology, Writing – review & editing. XW: Data curation, Methodology, Writing – review & editing. QC: Formal Analysis, Investigation, Resources, Software, Writing – review & editing. YWu: Data curation, Formal Analysis, Resources, Visualization, Writing – original draft. FW: Data curation, Methodology, Resources, Visualization, Writing – review & editing. YWa: Data curation, Methodology, Resources, Visualization, Writing – review & editing. YZ: Data curation, Formal Analysis, Resources, Visualization, Writing – original draft. YT: Funding acquisition, Project administration, Resources, Validation, Visualization, Writing – original draft. TR: Data curation, Formal Analysis, Investigation, Software, Writing – original draft. MW: Conceptualization, Funding acquisition, Project administration, Resources, Supervision, Validation, Writing – original draft. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fcimb.2025.1611391/full#supplementary-material Supplementary Figure Representative radiological characteristics of the chest in patients with PjP. Case 1: (A) (E) (B) (F) (C) (G) (D) (H) References Alanio A. Hauser P. M. Lagrou K. Melchers W. J. Helweg-Larsen J. Matos O. 2016 ECIL guidelines for the diagnosis of Pneumocystis jirovecii pneumonia in patients with haematological Malignancies and stem cell transplant recipients J. Antimicrob. Chemother. 71 2386 2396 10.1093/jac/dkw156 27550991 Azoulay É. Bergeron A. Chevret S. Bele N. Schlemmer B. Menotti J. 2009 Polymerase chain reaction for diagnosing pneumocystis pneumonia in non-HIV immunocompromised patients with pulmonary infiltrates Chest 135 655 661 10.1378/chest.08-1309 19265086 Bienvenu A. L. Traore K. Plekhanova I. Bouchrik M. Bossard C. Picot S. 2016 Pneumocystis pneumonia suspected cases in 604 non-HIV and HIV patients Int. J. Infect. Dis. 46 11 17 10.1016/j.ijid.2016.03.018 27021532 Calderón E. J. Gutiérrez-Rivero S. Durand-Joly I. Dei-Cas E. 2010 Pneumocystis infection in humans: diagnosis and treatment Expert Rev. Anti Infect. Ther. 8 683 701 10.1586/eri.10.42 20521896 Chen S. Zhou Y. Chen Y. Gu J. 2018 fastp: an ultra-fast all-in-one FASTQ preprocessor Bioinformatics 34 i884 i890 10.1093/bioinformatics/bty560 30423086 PMC6129281 Crothers K. Huang L. Goulet J. L. Goetz M. B. Brown S. T. Rodriguez-Barradas M. C. 2011 HIV infection and risk for incident pulmonary diseases in the combination antiretroviral therapy era Am. J. Respir. Crit. Care Med. 183 388 395 10.1164/rccm.201006-0836OC 20851926 PMC3266024 Cuétara M. S. Alhambra A. Chaves F. Moragues M. D. Pontón J. del Palacio A. 2008 Use of a serum (1–>3)-beta-D-glucan assay for diagnosis and follow-up of Pneumocystis jiroveci pneumonia Clin. Infect. Dis. 47 1364 1366 10.1086/592753 18922079 Damiani C. Le Gal S. Da Costa C. Virmaux M. Nevez G. Totet A. 2013 Combined quantification of pulmonary Pneumocystis jirovecii DNA and serum (1->3)-β-D-glucan for differential diagnosis of pneumocystis pneumonia and Pneumocystis colonization J. Clin. Microbiol. 51 3380 3388 10.1128/JCM.01554-13 23903553 PMC3811637 Del Corpo O. Butler-Laporte G. Sheppard D. C. Cheng M. P. McDonald E. G. Lee T. C. 2020 Diagnostic accuracy of serum (1-3)-β-D-glucan for Pneumocystis jirovecii pneumonia: a systematic review and meta-analysis Clin. Microbiol. Infect. 26 1137 1143 10.1016/j.cmi.2020.05.024 32479781 Donnelly J. P. Chen S. C. Kauffman C. A. Steinbach W. J. Baddley J. W. Verweij P. E. 2020 Revision and update of the consensus definitions of invasive fungal disease from the european organization for research and treatment of cancer and the mycoses study group education and research consortium Clin. Infect. Dis. 71 1367 1376 10.1093/cid/ciz1008 31802125 PMC7486838 Dunbar A. Schauwvlieghe A. Algoe S. van Hellemond J. J. Reynders M. Vandecasteele S. 2020 Epidemiology of pneumocystis jirovecii pneumonia and (Non-)use of prophylaxis Front. Cell Infect. Microbiol. 10 224 10.3389/fcimb.2020.00224 32500040 PMC7243458 Fauchier T. Hasseine L. Gari-Toussaint M. Casanova V. Marty P. M. Pomares C. 2016 Detection of pneumocystis jirovecii by quantitative PCR to differentiate colonization and pneumonia in immunocompromised HIV-positive and HIV-negative patients J. Clin. Microbiol. 54 1487 1495 10.1128/JCM.03174-15 27008872 PMC4879311 Grønseth S. Rogne T. Hannula R. Åsvold B. O. Afset J. E. Damås J. K. 2021 Epidemiological and clinical characteristics of immunocompromised patients infected with Pneumocystis jirovecii in a twelve-year retrospective study from Norway BMC Infect. Dis. 21 659 10.1186/s12879-021-06144-1 34233631 PMC8262122 Held J. Koch M. S. Reischl U. Danner T. Serr A. 2011 Serum (1 → 3)-β-D-glucan measurement as an early indicator of Pneumocystis jirovecii pneumonia and evaluation of its prognostic value Clin. Microbiol. Infect. 17 595 602 10.1111/j.1469-0691.2010.03318.x 20673271 Hsu W. Y. Kao T. W. Cho H. C. Ruan S. Y. Lee T. F. Huang Y. T. 2025 Performance of a hybrid capture-based target enrichment next-generation sequencing for the identification of respiratory pathogens and resistance-associated genes in patients with severe pneumonia Microbiol. Spectr. 13 e0213024 10.1128/spectrum.02130-24 39560386 PMC11705961 Jiang J. Bai L. Yang W. Peng W. An J. Wu Y. 2021 Metagenomic next-generation sequencing for the diagnosis of pneumocystis jirovecii pneumonia in non-HIV-infected patients: A retrospective study Infect. Dis. Ther. 10 1733 1745 10.1007/s40121-021-00482-y 34244957 PMC8322252 Jiang Y. Huang X. Zhou H. Wang M. Wang S. Ren X. 2025 Clinical characteristics and prognosis of patients with severe pneumonia with pneumocystis jirovecii colonization: A multicenter, retrospective study Chest 167 54 66 10.1016/j.chest.2024.07.140 39053646 Kanj A. Samhouri B. Abdallah N. Chehab O. Baqir M. 2021 Host factors and outcomes in hospitalizations for pneumocystis jirovecii pneumonia in the United States Mayo Clin. Proc. 96 400 407 10.1016/j.mayocp.2020.07.029 33549258 Karageorgopoulos D. E. Qu J. M. Korbila I. P. Zhu Y. G. Vasileiou V. A. Falagas M. E. 2013 Accuracy of β-D-glucan for the diagnosis of Pneumocystis jirovecii pneumonia: a meta-analysis Clin. Microbiol. Infect. 19 39 49 10.1111/j.1469-0691.2011.03760.x 22329494 Kotani T. Katayama S. Miyazaki Y. Fukuda S. Sato Y. Ohsugi K. 2017 Risk factors for the mortality of pneumocystis jirovecii pneumonia in non-HIV patients who required mechanical ventilation: A retrospective case series study BioMed. Res. Int. 2017 7452604 10.1155/2017/7452604 28567422 PMC5439059 Langmead B. Salzberg S. L. 2012 Fast gapped-read alignment with Bowtie 2 Nat. Methods 9 357 359 10.1038/nmeth.1923 22388286 PMC3322381 Li X. Li Z. Ye J. Ye W. 2023 Diagnostic performance of metagenomic next-generation sequencing for Pneumocystis jirovecii pneumonia BMC Infect. Dis. 23 455 10.1186/s12879-023-08440-4 37430211 PMC10331973 Limper A. H. Offord K. P. Smith T. F. Martin W. J. 2. 1989 Pneumocystis carinii pneumonia. Differences in lung parasite number and inflammation in patients with and without AIDS Am. Rev. Respir. Dis 140 1204 1209 10.1164/ajrccm/140.5.1204 2817582 Liu Y. Wu W. Xiao Y. Zou H. Hao S. Jiang Y. 2024 Application of metagenomic next-generation sequencing and targeted metagenomic next-generation sequencing in diagnosing pulmonary infections in immunocompetent and immunocompromised patients Front. Cell Infect. Microbiol. 14 1439472 10.3389/fcimb.2024.1439472 39165919 PMC11333343 Liu L. Yuan M. Shi Y. Su X. 2021 Clinical Performance of BAL Metagenomic Next-Generation Sequence and Serum (1,3)-β-D-Glucan for Differential Diagnosis of Pneumocystis jirovecii Pneumonia and Pneumocystis jirovecii Colonisation Front. Cell Infect. Microbiol. 11 784236 10.3389/fcimb.2021.784236 35004353 PMC8727434 Matsumura Y. Ito Y. Iinuma Y. Yasuma K. Yamamoto M. Matsushima A. 2012 Quantitative real-time PCR and the (1→3)-β-D-glucan assay for differentiation between Pneumocystis jirovecii pneumonia and colonization Clin. Microbiol. Infect. 18 591 597 10.1111/j.1469-0691.2011.03605.x 21973089 Miller S. Naccache S. N. Samayoa E. Messacar K. Arevalo S. Federman S. 2019 Laboratory validation of a clinical metagenomic sequencing assay for pathogen detection in cerebrospinal fluid Genome Res. 29 831 842 10.1101/gr.238170.118 30992304 PMC6499319 Morris A. Norris K. A. 2012 Colonization by Pneumocystis jirovecii and its role in disease Clin. Microbiol. Rev. 25 297 317 10.1128/CMR.00013-12 22491773 PMC3346301 Obayashi T. Yoshida M. Mori T. Goto H. Yasuoka A. Iwasaki H. 1995 Plasma (1–>3)-beta-D-glucan measurement in diagnosis of invasive deep mycosis and fungal febrile episodes Lancet 345 17 20 10.1016/S0140-6736(95)91152-9 7799700 Onishi A. Sugiyama D. Kogata Y. Saegusa J. Sugimoto T. Kawano S. 2012 Diagnostic accuracy of serum 1,3-β-D-glucan for pneumocystis jiroveci pneumonia, invasive candidiasis, and invasive aspergillosis: systematic review and meta-analysis J. Clin. Microbiol. 50 7 15 10.1128/JCM.05267-11 22075593 PMC3256688 Pisculli M. L. Sax P. E. 2008 Use of a serum beta-glucan assay for diagnosis of HIV-related Pneumocystis jiroveci pneumonia in patients with negative microscopic examination results Clin. Infect. Dis. 46 1928 1930 10.1086/588564 18540807 Salzer H. J. F. Schäfer G. Hoenigl M. Günther G. Hoffmann C. Kalsdorf B. 2018 Clinical, diagnostic, and treatment disparities between HIV-infected and non-HIV-infected immunocompromised patients with pneumocystis jirovecii pneumonia Respiration 96 52 65 10.1159/000487713 29635251 Stern A. Green H. Paul M. Vidal L. Leibovici L. 2014 Prophylaxis for Pneumocystis pneumonia (PCP) in non-HIV immunocompromised patients Cochrane Database Syst. Rev. 2014 Cd005590 10.1002/14651858.CD005590.pub3 17636808 Sun H. Wang F. Zhang M. Xu X. Li M. Gao W. 2022 Diagnostic value of bronchoalveolar lavage fluid metagenomic next-generation sequencing in pneumocystis jirovecii pneumonia in non-HIV immunosuppressed patients Front. Cell Infect. Microbiol. 12 872813 10.3389/fcimb.2022.872813 35463643 PMC9024294 Sun L. Zhang K. Liu Y. Che L. Zhang P. Wang B. 2024 Metagenomic next-generation sequencing targeted and metagenomic next-generation sequencing for pulmonary infection in HIV-infected and non-HIV-infected individuals Front. Cell Infect. Microbiol. 14 1438982 10.3389/fcimb.2024.1438982 39224706 PMC11366708 Tasaka S. Hasegawa N. Kobayashi S. Yamada W. Nishimura T. Takeuchi T. 2007 Serum indicators for the diagnosis of pneumocystis pneumonia Chest 131 1173 1180 10.1378/chest.06-1467 17426225 Tasaka S. Kobayashi S. Yagi K. Asami T. Namkoong H. Yamasawa W. 2014 Serum (1 → 3) β-D-glucan assay for discrimination between Pneumocystis jirovecii pneumonia and colonization J. Infect. Chemother. 20 678 681 10.1016/j.jiac.2014.07.001 25066434 Thomas C. F. Jr Limper A. H. 2004 Pneumocystis pneumonia N Engl. J. Med. 350 2487 2498 10.1056/NEJMra032588 15190141 Watanabe T. Yasuoka A. Tanuma J. Yazaki H. Honda H. Tsukada K. 2009 Serum (1–>3) beta-D-glucan as a noninvasive adjunct marker for the diagnosis of Pneumocystis pneumonia in patients with AIDS Clin. Infect. Dis. 49 1128 1131 10.1086/605579 19725788 Yin Y. Zhu P. Guo Y. Li Y. Chen H. Liu J. 2024 Enhancing lower respiratory tract infection diagnosis: implementation and clinical assessment of multiplex PCR-based and hybrid capture-based targeted next-generation sequencing EBioMedicine 107 105307 10.1016/j.ebiom.2024.105307 39226681 PMC11403251 Yu Q. He J. Xing B. Li X. Qian H. Zhang H. 2020 Potential value of serum Aspergillus IgG antibody detection in the diagnosis of invasive and chronic pulmonary aspergillosis in non-agranulocytic patients BMC Pulm Med. 20 89 10.1186/s12890-020-1125-y 32293386 PMC7158007 Zhang P. Liu B. Zhang S. Chang X. Zhang L. Gu D. 2024 Clinical application of targeted next-generation sequencing in severe pneumonia: a retrospective review Crit. Care 28 225 10.1186/s13054-024-05009-8 38978111 PMC11232260 Zhang L. Zheng C. Sun Y. Chen X. Wang Y. Xiang H. 2025 Diagnostic tests performance in detecting Pneumocystis jirovecii: A systematic review and meta-analysis Eur. J. Clin. Microbiol. Infect. Dis. 44 789 805 10.1007/s10096-025-05051-6 39900713 ",
  "metadata": {
    "Title of this paper": "Diagnostic tests performance in detecting Pneumocystis jirovecii: A systematic review and meta-analysis",
    "Journal it was published in:": "Frontiers in Cellular and Infection Microbiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489942/"
  }
}