{
  "title": "Paper_968",
  "abstract": "pmc Int J Epidemiol Int J Epidemiol 745 intjepid ije International Journal of Epidemiology 0300-5771 1464-3685 Oxford University Press PMC12476908 PMC12476908.1 12476908 12476908 41016747 10.1093/ije/dyaf158 dyaf158 1 Cohort Profile AcademicSubjects/MED00860 Cohort Profile Update: The Irish Longitudinal Study on Ageing (TILDA)—Waves 5 and 6 https://orcid.org/0000-0002-3856-2848 Scarlett Siobhan  The Irish Longitudinal Study on Ageing (TILDA), Medical Gerontology, School of Medicine, Trinity College Ireland https://orcid.org/0000-0003-1048-8188 Monaghan Ann  The Irish Longitudinal Study on Ageing (TILDA), Medical Gerontology, School of Medicine, Trinity College Ireland https://orcid.org/0000-0002-9257-0400 McLoughlin Sinead  The Irish Longitudinal Study on Ageing (TILDA), Medical Gerontology, School of Medicine, Trinity College Ireland Hever Ann  The Irish Longitudinal Study on Ageing (TILDA), Medical Gerontology, School of Medicine, Trinity College Ireland https://orcid.org/0000-0001-6575-2367 McCrory Cathal  The Irish Longitudinal Study on Ageing (TILDA), Medical Gerontology, School of Medicine, Trinity College Ireland https://orcid.org/0000-0001-6309-4866 Ward Mark  The Irish Longitudinal Study on Ageing (TILDA), Medical Gerontology, School of Medicine, Trinity College Ireland https://orcid.org/0000-0001-5814-5673 McGarrigle Christine A  The Irish Longitudinal Study on Ageing (TILDA), Medical Gerontology, School of Medicine, Trinity College Ireland https://orcid.org/0000-0002-9336-8124 Kenny Rose Anne  The Irish Longitudinal Study on Ageing (TILDA), Medical Gerontology, School of Medicine, Trinity College Ireland  Mercer’s Institute for Successful Ageing, St James’s Hospital Ireland Corresponding author. TILDA, Trinity College, 152–160 Pearse St, Dublin 2, Ireland. E-mail: siobhan.scarlett@tcd.ie 10 2025 28 9 2025 54 5 495159 dyaf158 12 5 2025 01 8 2025 28 09 2025 29 09 2025 30 09 2025 © The Author(s) 2025. Published by Oxford University Press on behalf of the International Epidemiological Association. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ longitudinal data ageing epigenetics demographics population Ireland data linkage Health Research Board 10.13039/100010414 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Key Features The Irish Longitudinal Study on Ageing (TILDA)—a nationally representative cohort of 8175 community-dwelling adults aged ≥50 years—was established in 2006 to capture the social, health, and economic circumstances of the ageing population in Ireland. Six waves of data collection have been completed, after a pilot phase, with the most recent wave taking place in 2021–2023 during the COVID-19 pandemic, offering a unique opportunity to analyse the impact of this global health crisis. Because of the COVID-19 pandemic, the sixth wave of data collection required significant reconfiguration of fieldwork modes. For the first time, interviews were conducted via telephone, self-completion questionnaires (SCQs) were distributed by post, and saliva and faecal sample kits were posted for self-collection and postal return. Additional new sub-studies were undertaken during the sixth wave, such as a COVID-19 SCQ, saliva and faecal sample collections, and new modalities of cognitive assessments for the TILDA Healthy Cognitive Ageing Project. Information on data access for research and research collaboration can be found at https://tilda.tcd.ie/data/accessing-data/ siobhan.scarlett@tcd.ie The original cohort The Irish Longitudinal Study on Ageing (TILDA) is a nationally representative longitudinal study of community-dwelling adults residing in Ireland [ 1 1 2 3 There were three modes of assessment during the Wave 1–5 fieldwork periods. At each wave, a face-to-face computer-assisted personal interview (CAPI) was administered by a trained field interviewer and participants were invited to fill in a self-completion questionnaire (SCQ) [ 2 4 1 2 4 Participants who experience cognitive or physical impairment that may compromise their ability to complete a self-report interview are offered a proxy interview instead where consent has previously been obtained. Where participants have passed away, an end-of-life (EOL) interview is completed with a close family member or friend of the participant. What is the reason for the new focus? The study has now completed six waves of data collection, spanning >15 years since the first interview was completed. A Cohort Profile Update was published in 2018 covering the period up to the completion of Wave 4 data collection [ 1 Fieldwork reconfiguration Preparation for fieldwork generally commences 12 months in advance of the wave. Fieldwork for Wave 6 commenced in January 2020 but was suspended in March 2020 due to the COVID-19 outbreak. Extensive periods of movement restrictions were in place during 2020 and 2021 that limited face-to-face interaction. TILDA therefore opted to reconfigure the mode of assessment for Wave 6 from CAPI to CATI in 2021 and delay the HA and cohort replenishment to 2022, as initial face-to-face contact was considered optimal for potential new participants. What will be the new areas of research? TILDA is now a well-established longitudinal study and described in Kenny et al. 2 et al. 1 More specifically, areas of research to be focused on include: epigenetics and omics profiling, including metabolomics, genomics, transcriptomics, and proteomics [ 5 6 impact of the COVID-19 pandemic by using a COVID-19 SCQ and saliva samples measuring a suite of SARS-CoV-2 antibodies [ 7 social connectedness [ 8 lifelong environmental exposures [ 9 10 cognitive decline and accelerated brain ageing [ 11–15 projection of care needs and the role of the caregiver [ 16 17 unmet healthcare need (through comparison of objective health measurements coupled with self-reported diagnoses), disease clusters, and multimorbidity [ 18 falls risk and prevention. Additional detail is provided in the Supplementary Material Supplementary Methods S1 Who is in the cohort? Wave 1 included 8504 (8175 aged 50+) participants. Sample attrition from Waves 1 to 4 is covered in detail in the previous Cohort Profile Update [ 1 Figure 1 Figure 1. Attrition flowchart following the completion of Wave 4 to the end of Wave 6 showing sample eligibility and completed interviews. Detailed breakdowns of attrition between waves, such as withdrawals and descriptions of attrition during each wave are provided. a b c d Graphical representation of attrition during the Wave 5 and Wave 6 (original and replenishment cohort) fieldwork periods using a flowchart design. Numbers of eligible participants for each period, completed interviews by type (self, proxy, end-of-life), no interview by refusal reason (e.g. soft refusal, withdrawal, no contact, moved outside of country), and attrition numbers between fieldwork periods are presented. Replenishment sample A total of 2194 participants from 1708 households were recruited between May 2022 and October 2023 in Wave 6 as the sample replenishment. To recruit the replenishment sample, the RANSAM sampling procedure was followed [ 2 3 community-dwelling; aged 45–64 years (and spouse/partner of any age); cognitively and physically capable of providing informed consent. Descriptive statistics of the Wave 1 sample (as described in Donoghue et al. 1 Table 1 Table 1 Table 1. Participant characteristics of the baseline sample of TILDA, the core and replenishment sample at Wave 6, and the combined sample at Wave 6. Demographic breakdowns of age, sex, education, marital status, and location are provided. Descriptive statistics of the Wave 1 sample are adapted from Donoghue et al. 1 Completed self-report interview at Wave 1 Completed self-report interview at Wave 6 (core sample) Completed self-report interview at Wave 6 (replenishment sample) Completed self-report interview at Wave 6 (combined sample)  n  n  n  n Age (years) [ n <50 330 (3.9) 11 (0.3) 469 (21.4) 480 (7.5) 50–64 4668 (54.9) 985 (23.3) 1630 (74.4) 2615 (40.7) 65–74 2164 (25.4) 1886 (44.6) 91 (4.2) 1977 (30.8) 75+ 1342 (15.8) 1345 (31.8) 2 (0.1) 1347 (21.0) Age (years), mean ± SD 63.1 ± 10.2 71.1 ± 8.0 55.0 ± 6.0 65.6 ± 10.6 Sex [ n Male 3780 (44.5) 1816 (43.0) 862 (39.3) 2678 (41.7) Female 4724 (55.5) 2412 (57.1) 1332 (60.7) 3744 (58.3) Education [ n Primary 2521 (29.7) 715 (16.9) 72 (3.3) 787 (12.3) Secondary 3431 (40.4) 1691 (40.0) 578 (26.4) 2269 (35.3) Tertiary 2548 (30.0) 1822 (43.1) 1542 (70.4) 3364 (52.4) Marital status [ n Married 5966 (70.2) 2922 (69.1) 1657 (75.5) 4579 (71.3) Never married 791 (9.3) 329 (7.8) 271 (12.4) 600 (9.3) Separated/divorced 552 (6.5) 308 (7.3) 210 (9.6) 518 (8.1) Widowed 1195 (14.0) 669 (15.8) 56 (2.6) 725 (11.3) Location [ n Dublin city or county 2012 (23.7) 1044 (24.7) 572 (26.1) 1616 (25.2) Other town/city 2390 (28.1) 1142 (27.0) 916 (41.8) 2058 (32.1) Rural 4102 (48.2) 2042 (48.3) 706 (32.2) 2748 (42.8) Response rates for the Wave 5 and 6 data-collection periods are presented in Table 2 Table 2. Response rates for Waves 5 and Wave 6 of TILDA including sub-studies run concurrently with the wave. Wave 5 Wave 6 January 2018–December 2018 September 2020–December 2023  N a  N a  CAPI/CATI  a EOL 172 (58) 174 (51) Self-report 5099 (81) 4228 (76) Proxy 124 (57) 104 (68) SCQ b 4410 (86) 3501 (83) Faecal microbiome pilot c n/a 391 (79) Replenishment SCQ a n/a 1583 (73)  TILDA Healthy Cognitive Ageing Project  d n/a 1344 (73)  HA  e n/a 1918 (77) Centre n/a 1414 (57) Home n/a 504 (20) Blood samples f n/a 2706 (62.5) TruCulture g n/a 100 (100) Accelerometry g n/a 1387 (72) Faecal microbiome g n/a 1499 (78) Oral HA g n/a 1090 (77) a Response rate calculated based on eligible participants at each respective wave and interview type (self-reported interview, proxy interview, EOL interview). b SCQs were only provided to participants who completed a self-report interview at each respective wave. c Pilot faecal sample collection was offered to a limited number of participants who completed a Wave 6 CATI. d TILDA Healthy Cognitive Ageing Project (HCAP) (randomly selected subsample of participants aged ≥65 years drawn from the Wave 6 CATI). e HAs were only offered to participants who completed a Wave 6 CATI self-report interview and had not been invited to take part in the TILDA-HCAP assessment. f Blood samples were taken from participants who completed either a HA or TILDA-HCAP assessment [ 15 g HA sub-studies were offered to different groups of participants: faecal sample collection was offered to all HA participants; accelerometry was offered to all HA participants where a device was available at the end of their assessment; TruCulture ® Wave 5 The Wave 5 data collection, from January to December 2018, included a CAPI and SCQ for all eligible participants. The CAPI self-report interview and SCQ response rates were 81% and 86%, respectively [ 19 Wave 6 The Wave 6 data collection took place from September 2020 to December 2023. Components were administered as face-to-face (CAPI or health practitioner assessment), telephone (CATI), or postal. A timeline of the core fieldwork components, most of the assessments, and the number of participants is shown in Fig. 2 Figure 2. Wave 6 core components timeline including mode of assessment and number of valid responses. Each component of the fieldwork is shown relative to the time span during which the fieldwork took place, with a visual representation of the mode of assessment. Graphical representation of the core components of the Wave 6 fieldwork period spanning September 2020 to January 2023. Horizontal bars spanning an x-axis with years and months are used to represent the time span of the collection phase for each component of the fieldwork. A letter indicator is used to differentiate between modes of assessment in the corresponding y-axis category label: [F] for face-to-face, [T] for telephone, and [P] for postal. Modifications to the self-report interview were required where components could not be administered over the telephone. Physical measures of grip strength and timed up-and-go (TUG) were omitted. The Mini-Mental State Examination (MMSE) (PAR, Inc ® 20 21 The self-report interview response rate was lower than those in previous waves, at 76%, as was the SCQ, at 83%. Seventy-six per cent of the sample completed an HA, which was slightly lower compared with previous waves. Twenty per cent of this group opted to complete a home-based rather than centre-based assessment HA. Wave 6 sub-study data collection Sub-studies ran concurrently with the Wave 6 data collection by using either the CATI or HA samples as a base for eligible participants ( Supplementary Methods S2 n n ® What has been measured? An overview of the topics collected in each core component is provided in Table 3 22 Table 3. Data/tests collected in the TILDA interview, SCQ, and HAs from Waves 1–6. Overall domains and individual components within each domain are provided. CAPI/CATI Wave 5 Wave 6 core Wave 6 replenishment  Demographics Household composition 1–4 ✓ ✓ ✓ Marital status 1–4 ✓ ✓ ✓ Education 1–4 ✓ ✓ ✓ Childhood circumstances 1–4 ✓ ✓ ✓ Siblings information 1–4 ✓ ✓ ✓ Migration history 1–4 ✓ ✓ ✓ lf  Social circumstances Financial and non-financial assistance given and received 1–4 ✓ ✓ ✓ Social connectedness 1–4 ✓ ✓ ✓ Helpers 1–4 ✓ ✓ ✓ Religion 1–4 ✓ ✓ Volunteering and caring 1–4 ✓ ✓ ✓ Crime 3,4 ✓ Driving and travel 1 ✓ ✓  Literacy Numeracy/financial literacy 3,4 ✓ ✓ lf  Retirement and expectations Planning for retirement 1–4 ✓ ✓ ✓ lf Expectations 1–4 ✓ ✓ Advance care planning 4 ✓ ✓  Economic circumstances Employment situation 1–4 ✓ ✓ Job history 1–4 ✓ ✓ ✓ lf Pensions 1–4 ✓ ✓ ✓ lf Sources of income 1–4 ✓ ✓ ✓ Household consumption 3–4 ✓ ✓ ✓ Assets 1–4 ✓ ✓ ✓ lf House ownership 1–4 ✓ ✓  Physical health Self-rated health 1–4 ✓ ✓ ✓ Sensory function (smell/taste/sight/hearing) 1–4 ✓ ✓ ✓ Functional limitations 1–4 ✓ ✓ ✓ (Instrumental) activities of daily living 1–4 ✓ ✓ ✓ Cardiovascular conditions 1–4 ✓ ✓ ✓ Chronic conditions 1–4 ✓ ✓ ✓ Falls/fractures 1–4 ✓ ✓ ✓ Fear of falling 1–4 ✓ ✓ ✓ lf Pain 1–4 ✓ ✓ ✓ Vaccination 1–4 ✓ ✓ ✓ Healthcare screening 1–4 ✓ ✓ ✓ Healthcare utilization 1–4 ✓ ✓ ✓ Medications 1–4 ✓ ✓ ✓ Physical function: TUG 2,4 ✓ ✓ lf Physical function: grip strength 2,4 ✓  COVID-19 ✓ ✓ Behavioural health Smoking 1–4 ✓ ✓ ✓ Physical activity 1–4 ✓ ✓ ✓ Sleep 1–4 ✓ ✓ ✓ Alcohol use 2–4 , a ✓ ✓  Cognitive health Self-rated memory 1–4 ✓ ✓ ✓ MMSE 2–4 ✓ ✓ ✓ Verbal fluency 1–4 ✓ ✓ ✓ Immediate and delayed recall 1–4 ✓ ✓ ✓ Prospective memory 1–4 ✓ ✓  Mental health Self-reported mental health 1–4 ✓ ✓ ✓ Life satisfaction 1–4 ✓ ✓ ✓ Depression 1–4 ✓ ✓ ✓ Anxiety 2–4 ✓ ✓ ✓ SCQ Wave 5 Wave 6 core Wave 6 replenishment Social activities 1–4 ✓ ✓ ✓ Clubs/organizations 4 ✓ ✓ ✓ QOL 1–4 ✓ ✓ ✓ Loneliness 1–4 ✓ ✓ ✓ Stress 1–4 ✓ ✓ ✓ Relationship quality 1–4 ✓ ✓ ✓ Alcohol use 1–4 ✓ ✓ ✓ Ageing perceptions 1,3 ✓ ✓ ✓ Worry (Penn State) 1–4 ✓ ✓ ✓ Technology and internet use ✓ ✓ ✓ Discrimination ✓ ✓ ✓ Heating 2–4 ✓ ✓ ✓ Social standing 4 ✓ ✓ Pet ownership ✓ ✓ Sleep (Munich Chronotype Questionnaire) ✓ ✓ Creative activity ✓ ✓ Anxiety 1 ✓ ✓ Falls efficacy 2,3 ✓ ✓ Stress 3 ✓ ✓ Life satisfaction ✓ ✓ Fruit and vegetable consumption 3,4 ✓ ✓ COVID-19 ✓ ✓ International Physical Activity Questionnaire (IPAQ)—Environmental ✓ ✓ Purpose in life 4 ✓ ✓ Gambling ✓ Stressful life events 1,2 ✓ Sexual activity 2,4 ✓ Neighbourhood disorder 2,4 ✓ Childhood health conditions 4 ✓ EOL interview Wave 5 Wave 6 core Wave 6 replenishment  Demographics Circumstances of death 2–4 ✓ ✓ – Residence before death 2–4 ✓ ✓ –  Physical, mental, and cognitive health (Instrumental) activities of daily living 2–4 ✓ ✓ – Helpers 2–4 ✓ ✓ – Chronic illness 2–4 ✓ ✓ – Falls/fracture 2–4 ✓ ✓ – Pain 2–4 ✓ ✓ – Cognitive function 2–4 ✓ ✓ – Mood 2–4 ✓ ✓ –  Behavioural health Alcohol use 2–4 ✓ ✓ – Smoking 2–4 ✓ ✓ – Weight 2–4 Healthcare utilization 2–4 ✓ ✓ – Assets and life insurance 2–4 ✓ ✓ – Advance/after death planning 3–4 ✓ ✓ – COVID-19 ✓ – Wave 6 HA Wave 6 Core Centre Home  Neuropsychological tests MMSE 1,3 ✓ ✓ Montreal Cognitive Assessment (MOCA) 1,3 ✓ ✓ Sustained Attention to Response Task (SART) 1,3 ✓ ✓ Choice reaction time 1,3 ✓ ✓ Colour trails 1,3 ✓ ✓ Centre for Epidemiological Studies Depression scale (CES-D) short form 1,3 ✓ ✓ State anxiety 3 ✓ ✓  Cardiovascular tests Blood pressure (OMRON) 1,3 ✓ ✓ Pulse wave velocity 1,3 ✓ Heart rate variability 1,3 ✓ Phasic blood pressure 1,3 ✓ Near infrared spectroscopy (NIRS) 3 ✓  Physical function TUG 1,3 ✓ ✓ Repeated chair stands 3 ✓ ✓  GAITRite Normal pace 1,3 ✓ Dual task (cognitive) 1,3 ✓ Maximum pace 3 ✓  Ultrasound Heel bone ultrasound 1,3 ✓  Anthropometric/other Grip strength 1,3 ✓ ✓ Height and weight 1,3 ✓ Waist circumference 1,3 ✓ ✓ Bloods 1,3 ✓ ✓ Faecal sample ✓ ✓ Oral health 3 ✓ Accelerometry 3 ✓ ✓ [1–4] indicate the previous waves in which the measure has been included. lf A long-form version of the replenishment interview was administered to 183 participants before the interview was shortened to improve response rates and encourage wider participation in the sampling frame. This measure was only included in the long-form replenishment interview. a Alcohol use in CAPI/CATI questionnaire is only asked of proxy respondents. b Fruit and vegetable consumption was measured as part of a food frequency questionnaire in Waves 3 and 4. Data linkage Data linkage with administrative and health datasets continued throughout 2019–2023 with the Primary Care Reimbursement Scheme database [ 23 8 9 10 Supplementary Methods S3 What has it found? Key findings and publications As of December 2024, the TILDA study data had been used in >600 publications ( https://tilda.tcd.ie/publications/publications-search/ 24 A strong association between social disconnection and a wish to die was identified, as was a bidirectional association between loneliness and depression, suggesting interventions enabling prosocial settings and alleviating loneliness may be protective against suicidal ideation [ 25 26 et al. 17 Projections of care needs showed that older people living with a serious disease requiring palliative care will increase by >80% between 2016 and 2046, highlighting an urgent need for improved resources, funding, and service provisions [ 16 18 Combining the mortality information with TILDA’s novel DNA methylation data found that the GrimAge epigenetic clock outperformed other established clocks in predicting age-related decline and all-cause mortality [ 5 27 28 Delayed recovery of systolic blood pressure upon standing predicted accelerated progression of age-related macular degeneration and accelerated brain ageing [ 14 11 29 30 Low folate predicted accelerated cognitive decline over 8 years, with implications for public policies on folic acid fortification [ 12 13 31 What are the main strengths and weaknesses? TILDA is now a well-established longitudinal study, featuring six waves of data collection and HA data at three distinct time points. The study has become a valuable resource for informing policies on all aspects of societal ageing at the population level. A rapid reconfiguration of methodology was successfully applied to ensure that fieldwork could continue during COVID-19 restrictions, with lessons learned for future pandemic preparedness. In recognition of the quality of the work and the international impact of TILDA, it has been designated as the WHO Collaborating Centre for Longitudinal Studies on Ageing and the Life Course, playing a crucial role in advancing knowledge and data on ageing and life-course research, with a focus on supporting ageing studies in low- and middle-income countries ( https://tilda.tcd.ie/who-collaborating-centre/terms/ One of the key strengths of the TILDA study is the breadth of objective HA data. Comparing self-report versus objectively measured outcomes allows a thorough assessment of unmet need, thus assisting healthcare providers and systems to identify high-risk groups, target interventions, and address gaps in treatment. The expansion of biomarkers, including epigenetics and metabolomics at Waves 1 and 3, affords more precise health and lifespan profiling and risk stratification [ 32 27 Limitations are also present. Additional processing of the biomarkers, such as for epigenetics, is expensive, and preparation of the samples and appropriate paperwork are resource-intensive. To date, these measures have only been available for a subset of participants at each wave so far. While TILDA has made progress with data linkage to external databases, the lack of an individual health identifier in Ireland limits the ability to conclusively link certain datasets. Therefore, while consent for GP linkage is high (∼90%), the linkage process, coordination with GP practices, and data preparation are cumbersome and slow. As part of the replenishment of participants aged 45–64 years, TILDA endeavoured to recruit a population-representative cohort within this age demographic. The replenishment cohort has an overrepresentation of females (60% vs 50%) and is underrepresented in the non-White Irish population (11% versus 19.96% compared with Census 2022 figures in this age cohort). Consequently, this may limit the generalizability of findings. Survey weights have been established to account for this disparity in future iterations of the datasets. Can I get hold of the data? Where can I find out more? Researchers can apply to access pseudonymized TILDA data through the Irish Social Science Data Archive ( https://www.ucd.ie/issda/ https://tilda.tcd.ie/tilda-vista/ https://tilda.tcd.ie/data/ siobhan.scarlett@tcd.ie Ethics approval TILDA Wave 5 data collection was approved by the Trinity College Dublin Faculty of Health Sciences Research Ethics Committee on 15 May 2017 (Ref: 170304) and for Wave 6 on 31 May 2019 (Ref: 190407). Supplementary Material dyaf158_Supplementary_Data Acknowledgements TILDA wish to acknowledge the contribution of TILDA participants to the success of the study, the funders, the TILDA team, and all TILDA collaborators. Author contributions S.S., A.M., S.McL., A.H., C.McC., and R.A.K. planned the Cohort Profile Update and analysed the data with contributions from M.W. and C.McG. A.M., S.S., and S.McL. drafted the manuscript. All authors revised the manuscript. Supplementary data  Supplementary data IJE Conflict of interest None declared. Funding The Irish Longitudinal Study on Ageing Wave 5 and Wave 6 were funded by the Department of Health (Government of Ireland) with funding administered by the Health Research Board (TILDA-2017–1) and The Atlantic Philanthropies. Data availability Details of how to access the TILDA data are outlined in the section ‘Can I get hold of the data?’ above. Enquiries about data access can also be sent to either tilda@tcd.ie siobhan.scarlett@tcd.ie Use of Artificial Intelligence (AI) tools The authors confirm AI was not used for the purposes of collecting and/or analysing data, producing images or graphical elements, or in writing this paper. References 1 Donoghue OA McGarrigle CA Foley M Fagan A Meaney J Kenny RA. Cohort profile update: The Irish Longitudinal Study on Ageing (TILDA) Int J Epidemiol 2018 47 1398-l 30124849 10.1093/ije/dyy163 2 Kenny RA Whelan BJ Cronin H et al The Design of The Irish Longitudinal Study on Ageing Dublin The Irish Longitudinal Study on Ageing 2010 3 Whelan B. A national random sampling design for Ireland Econ Soc Rev 1979 10 169 74 4 Kearney PM Cronin H O’Regan C et al Cohort profile: the Irish Longitudinal Study on Ageing Int J Epidemiol 2011 40 877 84 21810894 10.1093/ije/dyr116 5 McCrory C Fiorito G Hernandez B et al GrimAge outperforms other epigenetic clocks in the prediction of age-related clinical phenotypes and all-cause mortality J Gerontol Series A 2020 76 741 9 10.1093/gerona/glaa286 PMC8087266 33211845 6 McLoughlin S Präg P Bartley M Kenny RA McCrory C. Intergenerational social mobility and allostatic load in midlife and older ages: a diagonal reference modeling approach J Gerontol B Psychol Sci Soc Sci 2023 78 154 66 36008104 10.1093/geronb/gbac122 PMC9890911 7 Ward M Clarke N Wang M et al Study protocol for TILDA COVID-19 survey. Altered lives in a time of crisis: preparing for recovery from the impact of the COVID-19 pandemic on the lives of older adults HRB Open Res 2021 4 1 11 8 Ward M May P Normand C Kenny RA Nolan A. Mortality risk associated with combinations of loneliness and social isolation. Findings from The Irish Longitudinal Study on Ageing (TILDA) Age Ageing 2021 50 1329 35 33570566 10.1093/ageing/afab004 PMC7929441 9 Dempsey S Lyons S Nolan A. High Radon Areas and lung cancer prevalence: evidence from Ireland J Environ Radioact 2018 182 12 9 29175007 10.1016/j.jenvrad.2017.11.014 10 Lyons S Nolan A Carthy P Griffin M O’Connell B. Long-term exposure to PM2.5 air pollution and mental health: a retrospective cohort study in Ireland Environ Health 2024 23 54 38858702 10.1186/s12940-024-01093-z PMC11163701 11 Newman L Nolan H Carey D Reilly RB Kenny RA. Age and sex differences in frontal lobe cerebral oxygenation in older adults—Normative values using novel, scalable technology: findings from The Irish Longitudinal Study on Ageing (TILDA) Arch Gerontol Geriatr 2020 87 103988 31775091 10.1016/j.archger.2019.103988 12 O’Connor DMA Scarlett S De Looze C et al Low folate predicts accelerated cognitive decline: 8-year follow-up of 3140 older adults in Ireland Eur J Clin Nutr 2022 76 950 7 35022554 10.1038/s41430-021-01057-3 13 Feeney JC O’Halloran AM Kenny RA. The association between hair cortisol, hair cortisone, and cognitive function in a population-based cohort of older adults: results from The Irish Longitudinal Study on Ageing J Gerontol Series A 2020 75 257 65 10.1093/gerona/gly258 30412218 14 Connolly E Knight SP Duggan E et al Cardiovascular autonomic function and progression of age-related macular degeneration in The Irish Longitudinal Study of Ageing (TILDA) Invest Ophthalmol Vis Sci 2024 65 24 10.1167/iovs.65.6.24 PMC11182369 38874963 15 Feeney J Monaghan A McLoughlin S et al Cohort profile update: the harmonised cognitive assessment protocol sub-study of The Irish Longitudinal Study on Ageing (TILDA-HCAP) Int J Epidemiol 2024 54 1 7 10.1093/ije/dyaf008 PMC11821264 39938889 16 May P Johnston B Normand C Higginson I Kenny R Ryan K. Population-based palliative care planning in Ireland: how many people will live and die with serious illness to 2046? HRB Open Res 2019 2 35 32104781 10.12688/hrbopenres.12975.1 PMC7017420 17 McGarrigle CA Ward M Kenny RA. An investigation of what protective individual- and community-level factors are associated with life satisfaction in middle-aged and older family carers in Ireland Front Public Health 2023 11 1207523 37637804 10.3389/fpubh.2023.1207523 PMC10457003 18 Hernández B Voll S Lewis NA et al Comparisons of disease cluster patterns, prevalence and health factors in the USA, Canada, England and Ireland BMC Public Health 2021 21 1674 34526001 10.1186/s12889-021-11706-8 PMC8442402 19 Kenny RA Scarlett S O’Mahoney P The Older Population of Ireland on the Eve of the COVID-19 Pandemic Dublin The Irish Longitudinal Study on Ageing 2020 20 Folstein MF Folstein SE McHugh PR. “Mini-mental state”. A practical method for grading the cognitive state of patients for the clinician J Psychiatr Res 1975 12 189 98 1202204 10.1016/0022-3956(75)90026-6 21 Hodkinson HM. Evaluation of a mental test score for assessment of mental impairment in the elderly Age Ageing 1972 1 233 8 4669880 10.1093/ageing/1.4.233 22 Donoghue O McGarrigle C Kenny RA. Associations of Pet Ownership with Health and Wellbeing in Community-Dwelling Adults Aged 50 Years and over in Ireland Dublin The Irish Longitudinal Study on Ageing 2019 23 Richardson K Kenny RA Peklar J Bennett K. Agreement between patient interview data on prescription medication use and pharmacy records in those aged older than 50 years varied by therapeutic group and reporting of indicated health conditions J Clin Epidemiol 2013 66 1308 16 23968693 10.1016/j.jclinepi.2013.02.016 24 Houses of the Oireachtas 2018 https://www.oireachtas.ie/en/search/?q=The%20Irish%20Longitudinal%20Study%20on%20Ageing 25 Ward M Briggs R Kenny RA. Social disconnection correlates of a “Wish to Die” among a large community-dwelling cohort of older adults Front Public Health 2024 12 1436218 39234069 10.3389/fpubh.2024.1436218 PMC11371793 26 Ward M Briggs R McGarrigle CA De Looze C O’Halloran AM Kenny RA. The bi-directional association between loneliness and depression among older adults from before to during the COVID-19 pandemic Int J Geriatr Psychiatry 2023 38 e5856 36462183 10.1002/gps.5856 27 McCrory C Fiorito G O’Halloran AM Polidoro S Vineis P Kenny RA. Early life adversity and age acceleration at mid-life and older ages indexed using the next-generation GrimAge and Pace of Aging epigenetic clocks Psychoneuroendocrinology 2022 137 105643 34999481 10.1016/j.psyneuen.2021.105643 28 McCarthy K O’Halloran AM Fallon P Kenny RA McCrory C. Metabolic syndrome accelerates epigenetic ageing in older adults: findings from The Irish Longitudinal Study on Ageing (TILDA) Exp Gerontol 2023 183 112314 37883858 10.1016/j.exger.2023.112314 29 Briggs R Carey D Claffey P et al The association between frontal lobe perfusion and depressive symptoms in later life Br J Psychiatry 2019 214 230 6 30606275 10.1192/bjp.2018.288 30 McDowell CP Newman L Monroe DC et al The association between generalized anxiety disorder and resting-state prefrontal cortex oxygenation is modified by self-reported physical activity: results from The Irish Longitudinal Study on Ageing J Gerontol A Biol Sci Med Sci 2021 76 1391 7 33780537 10.1093/gerona/glab090 PMC8600010 31 Feeney J Newman L Kenny RA. Hair glucocorticoids and resting-state frontal lobe oxygenation: Findings from The Irish Longitudinal Study on Ageing Psychoneuroendocrinology 2021 125 105107 33352472 10.1016/j.psyneuen.2020.105107 32 McCrory C McLoughlin S Layte R et al Towards a consensus definition of allostatic load: a multi-cohort, multi-system, multi-biomarker individual participant data (IPD) meta-analysis Psychoneuroendocrinology 2023 153 106117 37100008 10.1016/j.psyneuen.2023.106117 PMC10620736 ",
  "metadata": {
    "Title of this paper": "Towards a consensus definition of allostatic load: a multi-cohort, multi-system, multi-biomarker individual participant data (IPD) meta-analysis",
    "Journal it was published in:": "International Journal of Epidemiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476908/"
  }
}