{
  "title": "Paper_340",
  "abstract": "pmc Front Pharmacol Front Pharmacol 1524 frontpharmacol Front. Pharmacol. Frontiers in Pharmacology 1663-9812 Frontiers Media SA PMC12487651 PMC12487651.1 12487651 12487651 41041648 10.3389/fphar.2025.1644186 1644186 1 Pharmacology Review Cantharidin: a double-edged sword in medicine and toxicology Zhang et al. 10.3389/fphar.2025.1644186 Zhang Jie  1  † Tian Tongtong  2  † Li Canyu  3 Liu Yong  1 Wang Yunyun  1 Liu Ling  3 *  ‡ Liu Liang  1 *  ‡ Yao Yufeng  2 *  ‡  1 Department of Forensic Medicine, Tongji Medical College, Huazhong University of Science and Technology Wuhan Hubei China  2 Key Laboratory of Molecular Biophysics of the Ministry of Education, College of Life Science and Technology and Center for Human Genome Research, Huazhong University of Science and Technology Wuhan Hubei China  3 Prenatal Diagnosis Center, The Third Affiliated Hospital of Zhengzhou University Zhengzhou Henan China  Edited by: Ming-Jen Hsu  Reviewed by: Ajay Pradhan  Carlos L. Cespedes-Acuña  Kakarla Ramakrishna *Correspondence: Ling Liu, liuling@zzu.edu.cn liuliang@mails.tjmu.edu.cn 2017501001@hust.edu.cn  † These authors have contributed equally to this work and share first authorship  ‡ These authors have contributed equally to this work and share last authorship 17 9 2025 2025 16 480654 1644186 10 6 2025 20 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Zhang, Tian, Li, Liu, Wang, Liu, Liu and Yao. 2025 Zhang, Tian, Li, Liu, Wang, Liu, Liu and Yao https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Cantharidin (CTD), a natural terpenoid toxin secreted by blister beetles, acts as a potent inhibitor of protein phosphatase. As the principal active component of Mylabris, a traditional Chinese medicine, CTD has attracted considerable interest due to its dual properties, combining potent anti-tumor activity with significant toxicity. Contemporary pharmacological research demonstrates that CTD inhibits the growth and proliferation of diverse cancer cells lines. It exhibits antibacterial and antiparasitic properties, and demonstrates pesticidal activity in agricultural applications. Despite these benefits, CTD exhibits a prominent double-edged profile, marked by severe toxic effects, including cardiotoxicity, nephrotoxicity, gastrointestinal toxicity, and reproductive toxicity. Our prior research has identified the heart and liver as primary targets of CTD’s acute toxicity, where it induces apoptosis and necrosis of cardiomyocytes and hepatocytes. Recent efforts to mitigate its toxicity while preserving efficacy have focused on the structural modifications of CTD and the development of its derivatives. Additionally, CTD has been demonstrated to enhance anti-tumor efficacy when combined with other drugs, particularly against certain drug-resistant tumors. This review comprehensively evaluates CTD’s pharmacology and toxicology, synthesizes pertinent toxicological data, and explores strategies for toxicity reduction to guide future research. anti-cancer drug cantharidin pharmacology toxicology analogues National Key Research and Development Program of China 10.13039/501100012166 National Natural Science Foundation of China 10.13039/501100001809 The author(s) declare that financial support was received for the research and/or publication of this article. This work was supported by the National Key Research and Development Program of China (No. 2023YFA1800902), National Natural Science Foundation of China (No. 82370366), Key R & D Special Project in Henan Province (No. 241111311300), Henan Province Medical Appropriate Technology Promotion Project (No. SYJS2022063), Key scientific research projects of colleges and universities of Henan Provincial Department of Education (NO:23A320001). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Pharmacology of Anti-Cancer Drugs 1 Introduction Natural products have the potential to yield significant advancements in disease treatment. Their bioactive constituents frequently contribute to unexpected therapeutic insights, particularly within the domain of traditional Chinese medicine (TCM). Cantharidin (CTD), a toxic tricyclic monoterpene, is a naturally occurring compound derived from blister beetles, notably as the primary active constituent present in bodies of southern meloid beetles, such as Mylabris phalerata or Mylabris variabilis, and Spanish flies (Lytta vesicatoria). Typically, species of the genus Mylabris Nicholls et al., 1990 Carrel et al., 1993 10 12 4 Figure 1 FIGURE 1 Chemical structure of CTD. A beetle with black and orange markings is shown next to a chemical structure. The formula consists of a hexagonal shape with an oxygen atom, two CH3 groups, and double-bonded oxygen atoms connected with arrows. Owing to its distinctive pharmacological properties, CTD has been widely utilized globally across centuries. It is used to chiefly to treat conditions such as ulcers and lymphadenitis, acting as a topical vesicant that induces separation syndrome. Its clinical applications encompass wart removal, molluscum contagiosum (MC), and acquired perforating dermatosis, as well as the treatment of ulcers and leishmaniasis ( Torbeck et al., 2014 Knapp et al., 1998 Ellenhorn, 1997 Whitman et al., 2019 Wang et al., 2018 Pan et al., 2019 in vivo in vitro Deng et al., 2013 Khan et al., 2013 Although CTD offers extensive clinical applications, its pronounced toxic effects restrict its widespread adoption. Exposure to high doses can induce severe reactions in both animals and humans. Symptoms of CTD poisoning include formation of large cutaneous blisters, hematuria, myocardial damage, mucosal erosion and bleeding in the upper gastrointestinal tract, gastrointestinal erosion, renal failure, and abnormal penile erection ( Karras et al., 1996 Polettini et al., 1992 Chen and Huang, 2013 2 Pharmacological effects 2.1 Anticancer effects 2.1.1 CTD induces DNA damage and inhibits cancer cell growth and proliferation CTD exhibits potent cytotoxicity, inducing DNA damage in cancer cells by compromising the integrity of their genomes, leading to DNA fragmentation ( Li et al., 2017 Figure 2 Naz et al., 2020 Kuo et al., 2015 Hsia et al., 2015 Sun et al., 2016 Zheng et al., 2008 Xu et al., 2018 Zhang et al., 2004 FIGURE 2 Pharmacological actions of CTD in anticancer and cardiovascular effects. Diagram illustrating the biochemical pathways and effects of cantharidin. It includes pathways leading to autophagy, apoptosis, and anti-metastasis, and shows regulation impacts such as inflammation and angiogenesis inhibition. Up-regulation and down-regulation are highlighted in pink and green, respectively, with connections to DNA damage and positive inotropic effects on the heart. 2.1.2 Induction of apoptosis in cancer cells CTD induces apoptosis in cancer cells via both intrinsic and extrinsic pathways ( Figure 2 Pistritto et al., 2016 Liu et al., 2018 2+ Hsia et al., 2015 Kuo et al., 2015 Tian et al., 2015 Zhu et al., 2020 Li et al., 2017 Li et al., 2011 2.1.3 Induction of cell cycle arrest in cancer cells In higher organisms, the cell cycle is a tightly regulated process, divided into four phases: G1, S, G2, and M phase. In higher organisms, the cell cycle is a highly regulated event controlled by various mechanisms. Treatment of chronic myelogenous leukemia (CML) cells K562 cells and imatinib-resistant K562R cells with CTD induces mitotic arrest, mediated by activation of the cyclin B1/Cdc2 complex and downregulation of cyclin D1. After 24 h of treatment, 19.2%–24.5% of K562 cells and 10.8%–13.0% of K562R cells are arrested in mitosis phase ( Sun et al., 2016 Li et al., 2017 Kuo et al., 2015 Le et al., 2016 Li et al., 2011 Chen et al., 2019 Yan et al., 2023 2.1.4 Inhibition of cancer cell metastasis Cancer cells degrade the extracellular matrix (ECM) to invade normal tissues, With matrix metalloproteinases (MMPs) playing a pivotal role in this ECM degradation. Of the over 20 MMPs identified to date, MMP-2 and MMP-9 are intrinsic factors in cancer metastasis ( Kim et al., 2013 Figure 2 Huang et al., 2013 Song et al., 2020 Ji et al., 2015 Hsia et al., 2016 Shou et al., 2013 Wu et al., 2014 Hu et al., 2021 Pan et al., 2019 2.2 Cardiovascular effects Serine/threonine phosphatases, including PP1, PP2A, and PP2B, account for approximately 90% of the dephosphorylation events in the heart. The pronounced toxicity of CTD and its analogs in mammals stems from their elevated affinity and specificity for CTD-binding proteins, identified as PP1 and PP2A, and the efficiency of CTD in inhibiting PP2A is 10 times that of inhibiting PP1 ( Neumann et al., 1995 Neumann et al., 1995 Knapp et al., 1998 Neumann et al., 1995 + 2+ + + El Refaey et al., 2019 Schwarz et al., 2024 Chu et al., 2003 Moreover, CTD protects heart from ischemia and reduces infarct size through ERK phosphorylation dependency ( Yang et al., 2011 Knapp et al., 1997 Knapp et al., 1998 Knapp et al., 1998 Qiu et al., 2019 Wang T. et al., 2015 2.3 Antimicrobial and insecticidal effects Despite its toxicity to many animals, some species such as the Otis tarda Bravo et al., 2014 Escherichia coli Staphylococcus aureus Streptococcus pneumoniae B. majalis Trichomonas vaginalis Meloidogyne javanica Hyalomma lusitanicum Whitman et al., 2019 Leishmania Ghaffarifar, 2010 in vitro in vivo Periplaneta americana Sun et al., 2020 Li Y. et al., 2021 Musca domestica Sun et al., 2022 Figure 3 FIGURE 3 Double-edged profile of CTD in medicine and toxicology. Flowchart illustrating the pharmacology and toxicity of cantharidin. The left section shows pharmacological effects: cancer cell DNA damage, apoptosis, cell cycle arrest, metastasis inhibition, positive inotropic effects, angiogenesis inhibition, bacteriostasis, antiparasitic efficacy, and insecticidal activity. The right section depicts toxic effects: endoplasmic reticulum stress, mitochondrial dysfunction, renal oxidative stress, inflammation, apoptosis, oxidative stress, vascular injury, and immune dysfunction. 2.4 Clinical applications of CTD In July 2023, YCANTH™ (CTD 0.7% topical solution) was approved in the United States for the topical treatment of molluscum contagiosum in adult and pediatric patients aged 2 years and older ( Keam, 2024 Torbeck et al., 2014 Naz et al., 2020 Dinh et al., 2011 Sun et al., 2022 In China, Aidi Injection (Z52020236, approved by the National Medical Products Administration), comprising extracts from Astragalus membranaceus, Acanthopanax senticosus, Panax ginseng C. A. Mey, and CTD from Lytta vesicatoria, has emerged as a widely utilized adjuvant chemotherapy agent for anti-tumor therapy ( Zhang et al., 2025 Xiao et al., 2019 Xiao et al., 2017 3 Side effects of CTD Although cantharidin exhibits significant pharmacological effects, its toxic side effects are substantial and warrant attention. Our research group previously compiled the adverse toxicity events associated with cantharidin, revealing that it exerts toxic effects on various bodily organs, especially the heart, liver, and kidneys ( Zhang Y. et al., 2018 Youyou et al., 2020 Zhang et al., 2020 Yu et al., 2020 Figure 4 FIGURE 4 The damage caused by CTD to various organs. Diagram illustrating various human body systems and associated symptoms. Left column: Nervous system includes dizziness, headaches, seizures. Lungs show dyspnea. Stomach issues like nausea, hemorrhage in intestines. Reproductive system with azoospermia in males, bleeding in females. Muscle issues include reversible myasthenia. Right column: Oral cavity has blisters, heart arrhythmias, liver failure indicators, kidney irritation, bladder hemorrhage, skin conditions like blistering. Central image is a human figure for reference. 3.1 Cardiotoxicity In case of large-dose CTD poisoning, myocardial injury manifests earlier than hepatic and kidney functional abnormalities. Excessive exposure can lead to direct cardiotoxic effects, including arrhythmias and arterial occlusion ( Rabkin et al., 1979 Zhang Y. et al., 2018 Youyou et al., 2020 Rabkin et al., 1979 Shao et al., 2020 Fleckenstein et al. (1975) Shi et al., 2022 Youyou et al. (2020) Shao et al. (2020) Tnc Myh7 Youyou et al., 2020 Knapp et al., 1999 Shao et al. (2020) 3.2 Hepatotoxicity The liver, as the primary organ responsible for drug metabolism and detoxification, is more susceptible to drug-induced damage compared to other organs. Zhang Y. et al. (2018) Yu et al., 2020 Jin et al. (2023) Zhu et al., 2019 Li et al., 2024 Zhou et al., 2015 Wu et al., 2015 Xiong Xiong et al., 2024 Huang et al., 2021 Jin et al., 2023 3.3 Renal toxicity CTD poisoning frequently manifests as lumbago and renal dysfunction, evidenced by elevated serum creatinine and urea levels. AS the kidneys metabolized CTD, it may irritate the urinary tract, leading to conditions such as proteinuria, glucosuria, and hematuria ( Cotovio et al., 2013 Karras et al., 1996 He et al., 2022 Liu et al., 2023 He et al., 2020 He et al., 2025 Gao et al., 2020 3.4 Reproductive toxicity While the deleterious effects of CTD on cardiac, hepatic, and renal functions have been well-documented, its reproductive toxicity remains understudied. Historically, CTD was employed in Europe as an aphrodisiac due to its effects on penile congestion and erection in males, and vaginal bleeding in females ( Karras et al., 1996 Xiao et al., 2024 Liu et al., 2024 Twu et al., 2012 Xiao et al., 2024 3.5 Other toxicities CTD exhibits significant irritant effects on skin and mucous membranes, leading to desquamation ( Karras et al., 1996 Cotovio et al., 2013 Harrisberg et al., 1984 Zouvanis et al., 1994 2+ Koss et al., 2007 Chen and Teik, 1961 Huan et al., 2012 3.6 Animal toxicities The toxic effects of CTD in animals are similar to those in humans. Toxicosis occurs when horses consume alfalfa hay or products contaminated with “blister” beetles ( Schmitz, 1989 Qualls et al., 2013 Currently, there is no specific antidote for CTD poisoning. The treatment after CTD poisoning mainly focuses on protecting the gastrointestinal mucosa, performing blood purification, and safeguarding the functions of the heart, lungs, kidneys, and brain. For those who have ingested CTD orally, gastric lavage should be carried out as early as possible. Patients at risk of acute kidney injury should have their renal function closely monitored, and protective measures such as urine alkalization, the use of diuretics (e.g., furosemide), and avoiding the use of nephrotoxic drugs should be taken ( Duan et al., 2025 Xu et al., 2024 4 Chemical analysis and toxicological data of CTD Following oral administration, CTD is rapidly absorbed into the bloodstream and extensively distributed into tissues, facilitated by its lipophilicity and strong penetrability. Topical applcation also results in rapid systemic absorption, as evidenced by documented fatalities from external application reported by Chinese scholars. In beagle dogs, intravenous administration of CTD results in swift distribution across various organ tissues and rapid elimination, with a half-life of 0.69 ± 0.03 h ( Dang and Zhu, 2009 Duan et al., 2021 Xiao et al., 2019 Polettini et al., 1992 postmortem It has been reported that most Cantharis Al-Binali et al., 2010 Tagwireyi et al., 2000 Jin et al., 2023 Polettini et al., 1992 Hundt et al., 1990 postmortem postmortem Cheng et al., 1990 Zhang Y. et al., 2018 postmortem Table 1 Cantharis postmortem TABLE 1 Basic information of reported cases of CTD poison in China. No. Age/Sex Primary diseases Dosage and medication method Survival time Toxicological analysis Clinical and autopsy information Clinical information Autopsy information 1 ( Huang and Xian, 1995 44/F Fatigue 6g/oral 3 days - Dizziness, perioral numbness, nausea, muscle rigidity, twitching of the extremities, myocardial impairment, Mobitz type II AV block, acute kidney failure no autopsy 2 ( Tian et al., 1982 48/F Stomach discomfort 1.66 g for 3days/oral 4 days Qualitative Blister formation on the inner thighs and lateral lower leg, water and electrolyte disturbances, oliguria, acute kidney failure Pulmonary edema and myocardial necrosis, scattered bleeding points on the kidney capsule surface, glomerulosclerosis, renal tubular type, renal interstitial hemorrhage 3 ( Chi and Ma, 1964 28/F Mistake 3g/oral 34 h - Nausea and vomiting, abdominal pain, urination with burning, urinary frequency and oliguria, low blood pressure, urine protein, normal liver function no autopsy 4 ( Zou, 1999 21/F Abortion 25g/oral 24 h Qualitative Nausea and vomiting, P 140/min, low blood pressure, generalized cutaneous blisters gastric and small intestinal mucosal necrosis, gastric mucosal bleeding, myocardial fiber rupture, necrosis of hepatocytes, mild multifocal acute necrosis of tubular epithelial cells in kidneys 5 ( Tan, 2002 43/F Skin ulcers -/oral - Qualitative Nausea and vomiting, abdominal pain, urinary frequency and oliguria gastric and small intestinal mucosal hemorrhage, swollen renal epithelial tubular cells, fibrin exudation in the lungs 6 ( Zhang et al., 2012 10/F Psoriasis -/extern 25 h 0.1 ug/mL in stomach by GC-MS (may be caused by postmortem Headache, nausea and vomiting, blister formation no autopsy 7 ( Li et al., 2008 34/F Psoriasis -/extern 5 d Qualitative Vomiting, abdominal pain, urinary frequency and oliguria, urination with burning, skin ulcer Neural cell death and calcification, focal cardiac myocyte dissolution, kidney swelling, necrosis of renal tubular epithelial cells and glomerular atrophy, renal tubular type, hemorrhage of the bladder mucosa 8 ( Shi and Wang, 2003 39/M Psoriasis 20g/extern (25% of body surface area) 22 h 90.7 μg/m、130 μg/g、53 μg/g and 1.8 mg/g in the blood, skin, kidney and medicine Blister formation, vomiting Scattered bleeding points in the aortic root and surface of heart, necrosis of renal tubular epithelial cells, renal tubular type, small intestinal mucosal erosion, hepatic bridging necrosis with infiltration of neutrophils, plasma cells, lymphocytes 9 ( Yang and Wang, 2005 28/F lymphadenopathy 3g/oral/3 d 3 days Qualitative (GC/MS) Headache, nausea and vomiting, abdominal pain, hematuresis Cardiomyocyte hypertrophy, esophageal and gastric mucosal bleeding, hemorrhage of the bladder mucosa, necrosis of renal tubular epithelial cells and glomerular atrophy, renal tubular type 10 ( Sun and Shi, 2009 24/F Psoriasis 10g/extern 2 days Qualitative Nausea and vomiting, blister formation Hemorrhages in subepicardial and subserosal areas, pneumonia, hydropic degeneration of hepatocytes, necrosis of renal tubular epithelial cells, renal tubular type, microthrombi formation within glomerular capillaries 11 ( Peng and Liang, 2015 56/M Dog bite 5g/oral 2 days Qualitative Nausea and vomiting, abdominal pain, hematuresis, hematochezia Hemorrhages in subepicardial and subserosal areas, scattered bleeding points in the surface of heart 12 ( Li and Dai, 1986 8/M Dog bite 6g/oral 24 h - Nausea and vomiting, P 160/min, bloody nasal discharge Scattered bleeding points in the surface of left ventricle, myocardial interstitial hemorrhage, some broken and dissolved myocardial fibers, necrosis of renal tubular epithelial cells, renal tubular type, renal interstitial hemorrhage 13 ( Xun, 1990 21/22/F Abortion 30 g/oral 4h/9 h Qualitative Ulceration in the oral mucosa, blister formation, nausea and vomiting, abdominal pain, bloody vaginal discharge Esophageal and gastric mucosal bleeding 14 ( Chen, 1981 34/24/23/20/32/F - - 24h/2h/2h/2h/3 days - Haemorrhage (1), bloody vaginal discharge (1), nausea and vomiting (3), blister formation (5) bloated cadaver (3) 5 Modification of the structure of CTD CTD exhibits strong toxicity to mammals, which limits its clinical application. Additionally, it has poor solubility and a low gastrointestinal bioavailability of 26.7% ( Puerto Galvis et al., 2013 Wang et al., 2018 Figure 5 FIGURE 5 Structural modification of cantharidin derivatives. Chemical structure diagram depicting structural modifications of cantharidin derivatives. The central structure shows cantharidin with numbered carbon positions. Arrows point to three modifications: Norcantharidin through 2-,3- modification, 5,6-Dihydro-Norcantharidin through 5-,6- modification, N-Hydroxycantharidimide, a closed-loop derivative, and an open-loop derivative with hydroxyl groups. 5.1 Modification on C-1,4 and 7-O position Through the study on the structure-activity relationship of modifications at positions 1 and 4 of the CTD structure ( Figure 5 Table 2 McCluskey et al., 2003 Ren and Kinghorn, 2021 McCuskey et al., 2000 Mccluskey et al. (1996) Shan et al., 2006 TABLE 2 Common methods for structural modification of CTD. Modification positions Compounds Name IC 50 Cells Inhibition of PPs (IC 50 PP2A inhibition rate (%) Pharmacology (compered with CTD) Toxicity (compered with CTD) LD 50 References PP1 PP2A -  CTD 19.1 HepG2 0.47 0.04 92–95 - - 1.0  Ren and Kinghorn (2021), McCuskey et al. (2000) Modification on C-1,4 Positions  - ≥1000 HepG2 ≥1000 ≥1000 - Decrease - -  Shan et al. (2006), Baba et al. (2003)  - ≥1000 HepG2 ≥1000 ≥1000 - Decrease - -  Shan et al. (2006) Modification on C-2,3 Positions  Norcantharidin 212.9 ± 26.2/2.71 HepG2/L1210 1.98 0.37 - Increase Decrease 4.0  Ren and Kinghorn (2021), Shan et al. (2006)  ( S - - 0.66 0.12 - Similar Decrease -  Ren and Kinghorn (2021)  2,3-Difluoronorcantharidin 6.19 L1210 - - - Similar Decrease -  Essers et al. (2001) Modification on C-5,6 Positions  Unsaturated Norcantharidin 245 HepG2 - - 97 Similar Decrease -  McCuskey et al. (2000), McCluskey et al. (2000)  Δ-5,6-ethyl norcantharidin ≥1000 - ≥1000 ≥1000 - Decrease - -  Thaqi et al. (2010) Modification on C-7 Positions  Hexahydro-4,7-methanoisobenzofuran-1,3-dione - - ≥1000 ≥1000 38.7 Decrease - -  Mccluskey et al. (1996) Analogues that Maintain the Five-Membered ring  2,3-dimethyl endothall thioanhydrid 14.7 ± 7.0 HepG2 3.05± 2.11± - Similar Similar -  Shan et al. (2006)   N 0.4 Hep3B - - - Increase Decrease -  Ren and Kinghorn (2021) Analogues that Open the Five-Membered Ring  Cantharidic acid 218.5 0.56 0.05 92–95 Similar Decrease 1.8  Ren and Kinghorn (2021), McCuskey et al. (2000)  Endothall - - 5.0 0.97 - Similar Decrease 14  Ren and Kinghorn (2021)  Metal Salt Analogues a.M1 = Na,M2 = K a = 67.37% HepG2 - - - Similar Decreased Toxicity, -  Zhao et al. (2019) 5.2 Modification on C-2,3 position Norcantharidin (NCTD) is a synthetic anti-cancer compound derived from CTD. It is produced by removing methyl groups from C-2 and C-3 positions of CTD through hydrolysis, which reduces nephrotoxicity while maintaining anti-cancer activity comparable to that of CTD ( Hizartz et al., 2019 Massicot et al., 2005 Li et al., 2010 Zhao et al., 2019 Zavoral et al., 2011 Li XY. et al., 2021 Essers introduced fluorine groups at the C-2,3 positions, and the derivatives retained the antitumor activity and simultaneously reduced the toxic effects ( Essers et al., 2001 Laidley et al., 1999 Baba et al., 2003 5.3 Modification on C-5,6 position Dehydrogenation at the fifth and sixth positions of CTD forms a C=C double bond, yielding a derivative ( McCluskey et al., 2000 Thaqi et al., 2010 5.4 Acid Anhydride-Modified derivatives Anhydride-Modified derivatives of CTD through anhydride modifications yield various analogues ( Wang Y. et al., 2015 McCluskey demonstrated through research that introducing a nitrogen atom into the five-membered ring can lead to the loss of the effect on PP2A. However, introducing a sulfur atom results in an inhibitory effect on PP2A similar to that of CTD and NCTD ( McCuskey et al., 2000 McCluskey et al., 2001 Regarding the analogs with an opened five - membered ring, metal salt analogs are currently a hot research topic. NCT sodium salt is a newly developed drug, and the sodium atom can be substituted with various metal atoms. These NCT metal salt analogs have a strong inhibitory effect on tumors and hold broad application prospects ( Zhao et al., 2019 McCluskey et al., 2001 Zhao et al., 2019 Lee et al., 2014 McCuskey et al., 2000 McCuskey et al., 2000 In addition, researches had also been conducted on the carriers of CTD and its derivatives. Drug-loaded liposomes have attracted much attention due to their advantages such as enhancing activity, improving bioavailability, having low toxicity, and enhancing targeting ( Wang et al., 2021 Zhu et al., 2018 Zhou et al., 2019 Zhang H. et al., 2018 Yao et al., 2020 Shao et al., 2020 Huang et al., 2021 In summary, current modifications of CTD primarily focus on its six-membered and five-membered rings, with the first, fourth, and seventh hydroxy groups on the six-membered ring being crucial factors, modifications at these positions should be avoided in the future. Removing the methyl groups at the C-2 and C-3 positions of cantharidin or substituting them with other groups can significantly reduce the toxic effects and result in better selectivity. Similarly, the C-5, 6 ethyl bridge position is crucial. Forming a C=C double bond or introducing hydrophobic groups at this position can reduce toxic side effects and enhance the inhibitory effect on tumor cells. For the five-membered ring, introducing a carboxylic acid group or a metal salt can increase the water solubility of CTD and its derivatives, enhance absorption, and reduce toxicity. Moreover, after opening the five-membered ring, the inhibitory effect on PP2A is lower compared to the closed-ring form, which is a point worthy of attention. Moreover, “packaging” strategies for CTD, such as liposome encapsulation, have shown promising anti-proliferative effects against cancer cells. 6 Conclusion In recent years, with deepening research into CTD, researchers have discovered its broad pharmacological effects and significant clinical potential, particularly in oncology, where it demonstrates extensive anti-tumor activity and promising applications. The core mechanism lies in its ability to inhibit the activity of protein phosphatases, thereby causing changes in the internal mechanisms of tumor cells. While it brings benefits, it also damages the functions of organs in the human body. Here, we provide a comprehensive review of CTD, covering its pharmacology, toxicology, toxic dose, and derivatives. In particular, it summarizes cantharidin’s cardiovascular effects, its role in the agricultural field, as well as the symptoms, mechanisms, and toxic dose of CTD poisoning. Additionally, we analyze the structure of CTD, offering reference suggestions for future modifications of cantharidin. However, due to space constraints, this thesis cannot list all mechanisms and only summarizes the important ones. Future studies can focus on a specific property of cantharidin for a dedicated summary. In the future, we should focus on the modification of CTD, retaining the active groups and removing the toxic groups in its structure. With the development of new materials such as nanomaterials, we can develop advanced drug carriers and targeted drug-delivery systems, and explore bacterial biotransformation. Moreover, for the use of CTD and its derivatives, standardized management should be carried out, and corresponding clinical use manuals should be compiled. While strictly restricting its clinical use, treatment for its toxic effects should be well-prepared. Research on the combined therapy involving CTD and other drugs also has great prospects, which is expected to provide theoretical basis and practical guidance for the development of safer and more effective therapeutic drugs. Author contributions JZ: Conceptualization, Investigation, Methodology, Writing – original draft, Writing – review and editing. TT: Conceptualization, Investigation, Methodology, Writing – original draft. CL: Data curation, Formal Analysis, Funding acquisition, Writing – review and editing. YL: Data curation, Investigation, Writing – review and editing. YW: Formal Analysis, Investigation, Methodology, Writing – review and editing. LinL: Data curation, Funding acquisition, Methodology, Writing – review and editing. LiaL: Conceptualization, Investigation, Methodology, Writing – review and editing. YY: Conceptualization, Data curation, Funding acquisition, Investigation, Project administration, Writing – review and editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Al-Binali A. M. Shabana M. Al-Fifi S. Dawood S. Shehri A. A. Al-Barki A. 2010 Cantharidin poisoning due to blister beetle ingestion in children: two case reports and a review of clinical presentations Sultan Qaboos Univ. Med. J. 10 2 258 261 10.18295/2075-0528.1196 21509239 PMC3074703 Baba Y. Hirukawa N. Tanohira N. Sodeoka M. 2003 Structure-based design of a highly selective catalytic site-directed inhibitor of ser/thr protein phosphatase 2B (calcineurin) J. Am. Chem. Soc. 125 32 9740 9749 10.1021/ja034694y 12904040 Bravo C. Bautista L. M. García-París M. Blanco G. Alonso J. C. 2014 Males of a strongly polygynous species consume more poisonous food than females PLoS One 9 10 e111057 10.1371/journal.pone.0111057 25337911 PMC4206510 Carrel J. E. McCairel M. H. Slagle A. J. Doom J. P. Brill J. McCormick J. P. 1993 Cantharidin production in a blister beetle Experientia 49 171 174 10.1007/bf01989424 8440353 Chen J. 1981 Analysis of death from cantharides poisoning: a report of five cases and the danger of abortion Med. Pharm. Yunnan 01 15 17 Chen L. Huang G. Z. 2013 Poisoning by toxic animals in China--18 autopsy case studies and a comprehensive literature review Forensic Sci. Int. 232 1-3 e12 e23 10.1016/j.forsciint.2013.08.013 24008199 Chen B. T. Teik K. O. 1961 A case of cantharidin poisoning Singap. Med. J. 2 72 73 13692753 Chen C. C. Chueh F. S. Peng S. F. Huang W. W. Tsai C. H. Tsai F. J. 2019 CTD decreased viable cell number in human osteosarcoma U-2 OS cells through G 2 Biosci. Biotechnol. Biochem. 83 10 1912 1923 10.1080/09168451.2019.1627182 31187696 Cheng K. C. Lee H. M. Shum S. F. Yip C. P. 1990 A fatality due to the use of cantharides from Mylabris phalerata as an abortifacient Med. Sci. Law 30 4 336 340 10.1177/106002809003000410 2263179 Chi Z. Ma S. 1964 A case report of death from acute cantharides poisoning Shandong Med. J. 35 08 Chu L. Norota I. Ishii K. Endoh M. 2003 Inhibitory action of the phosphatase inhibitor cantharidin on the endothelin-1-induced and the carbachol-induced negative inotropic effect in the canine ventricular myocardium J. Cardiovasc Pharmacol. 41 Suppl. 1 S89 S92 12688404 Cotovio P. Silva C. Guedes Marques M. Ferrer F. Costa F. Carreira A. 2013 Acute kidney injury by cantharidin poisoning following a silly bet on an ugly beetle Clin. Kidney J. 6 2 201 203 10.1093/ckj/sft001 26019851 PMC4432444 Dang Y. J. Zhu C. Y. 2009 Determination of trace cantharidin in plasma and pharmacokinetic study in beagle dogs using gas chromatography-mass spectrometry J. Anal. Toxicol. 33 7 384 388 10.1093/jat/33.7.384 19796509 Deng L. P. Dong J. Cai H. Wang W. 2013 Cantharidin as an antitumor agent: a retrospective review Curr. Med. Chem. 20 2 159 166 10.2174/092986713804806711 23210849 Dinh P. H. Corraza F. Mestdagh K. Kassengera Z. Doyen V. Michel O. 2011 Validation of the cantharidin-induced skin blister as an in vivo model of inflammation Br. J. Clin. Pharmacol. 72 6 912 920 10.1111/j.1365-2125.2011.04020.x 21595743 PMC3244638 Duan C. Cheng W. Chen Q. Li X. Zhang J. 2021 Pharmacokinetics and tissue distribution of cantharidin after oral administration of aqueous extracts from mylabris in rats Biomed. Chromatogr. 35 10 e5172 10.1002/bmc.5172 33982312 Duan Z. Qu Y. Tang R. Sheng M. Wang L. Li J. 2025 Case report: persistent toxic reactions in a toddler with a negative blood cantharidin toxicology test Front. Pediatr. 13 1546669 10.3389/fped.2025.1546669 40083431 PMC11903399 El Refaey M. Musa H. Murphy N. P. Lubbers E. R. Skaf M. Han M. 2019 Protein phosphatase 2A regulates cardiac na+ channels Circ. Res. 124 5 737 746 10.1161/CIRCRESAHA.118.314350 30602331 PMC6395500 Ellenhorn M. J. 1997 Ellenhorn's medical toxicology: diagnosis and treatment of human poisoning 2nd ed. Baltimore, Md Williams and Wilkins Essers M. Wibbeling B. Haufe G. 2001 Synthesis of the first fluorinated cantharidin analogues Tetrahedron Lett. 42 32 5429 5433 10.1016/S0040-4039(01)01056-5 Fleckenstein A. Kanke J. Döring H. J. Leder O. 1975 Key role of Ca in the production of noncoronarogenic myocardial necroses Recent Adv. Stud. Card. Struct. Metab. 6 21 32 1197883 Gao H. Kang N. Hu C. Zhang Z. Xu Q. Liu Y. 2020 Ginsenoside Rb1 exerts anti-inflammatory effects in vitro and in vivo by modulating toll-like receptor 4 dimerization and NF-kB/MAPKs signaling pathways Phytomedicine 69 153197 10.1016/j.phymed.2020.153197 32146298 Ghaffarifar F. 2010 Leishmania major: in vitro and in vivo anti-leishmanial effect of cantharidin Exp. Parasitol. 126 2 126 129 10.1016/j.exppara.2010.04.004 20435039 Harrisberg J. Deseta J. C. Cohen L. Temlett J. Milne F. J. 1984 Cantharidin poisoning with neurological complications S. Afr. Med. J. 65 15 614 615 6324396 He T. Liu J. Wang X. Duan C. Li X. Zhang J. 2020 Analysis of cantharidin-induced nephrotoxicity in HK-2 cells using untargeted metabolomics and an integrative network pharmacology analysis Food Chem. Toxicol. 146 111845 10.1016/j.fct.2020.111845 33152469 He T. Wang Q. Ao J. Chen K. Li X. Zhang J. 2022 Endoplasmic reticulum stress contributes to autophagy and apoptosis in cantharidin-induced nephrotoxicity Food Chem. Toxicol. 163 112986 10.1016/j.fct.2022.112986 35398186 He T. Lin K. Xiong L. Zhang W. Zhang H. Duan C. 2025 Disorder of phospholipid metabolism in the renal cortex and medulla contributes to acute tubular necrosis in mice after cantharidin exposure using integrative lipidomics and spatial metabolomics J. Pharm. Anal. 15 7 101210 10.1016/j.jpha.2025.101210 40735028 PMC12304689 Hizartzidis L. Gilbert J. Gordon C. P. Sakoff J. A. McCluskey A. 2019 Synthesis and cytotoxicity of Octahydroepoxyisoindole-7-carboxylic acids and Norcantharidin-Amide hybrids as norcantharidin analogues ChemMedChem 14 12 1152 1161 10.1002/cmdc.201900180 30938091 Hsia T. C. Lin J. H. Hsu S. C. Tang N. Y. Lu H. F. Wu S. H. 2015 Cantharidin induces DNA damage and inhibits DNA repair-associated protein levels in NCI-H460 human lung cancer cells Environ. Toxicol. 30 10 1135 1143 10.1002/tox.21986 24639390 Hsia T. C. Yu C. C. Hsiao Y. T. Wu S. H. Bau D. T. Lu H. F. 2016 Cantharidin impairs cell migration and invasion of human lung cancer NCI-H460 cells via UPA and MAPK signaling pathways Anticancer Res. 36 11 5989 5997 10.21873/anticanres.11187 27793925 Hu S. Chang J. Ruan H. Zhi W. Wang X. Zhao F. 2021 Cantharidin inhibits osteosarcoma proliferation and metastasis by directly targeting miR-214-3p/DKK3 axis to inactivate β-catenin nuclear translocation and LEF1 translation Int. J. Biol. Sci. 17 10 2504 2522 10.7150/ijbs.51638 34326690 PMC8315017 Huan S. K. Wang K. T. Yeh S. D. Lee C. J. Lin L. C. Liu D. Z. 2012 Scutellaria baicalensis alleviates cantharidin-induced rat hemorrhagic cystitis through inhibition of cyclooxygenase-2 overexpression Molecules 17 6 6277 6289 10.3390/molecules17066277 22634839 PMC6268386 Huang K. Xian H. 1995 A report on death caused by cantharidin poisoning Guangxi J. Traditional Chin. Med. 04 33 Huang Y. P. Ni C. H. Lu C. C. Chiang J. H. Yang J. S. Ko Y. C. 2013 Suppressions of migration and invasion by cantharidin in TSGH-8301 human bladder carcinoma cells through the inhibitions of matrix Metalloproteinase-2/-9 signaling Evid. Based Complement. Altern. Med. 2013 190281 10.1155/2013/190281 23431332 PMC3568914 Huang X. Tang W. Lin C. Sa Z. Xu M. Liu J. 2021 Protective mechanism of astragalus polysaccharides against Cantharidin-induced liver injury determined in vivo by liquid chromatography/mass spectrometry metabolomics Basic Clin. Pharmacol. Toxicol. 129 1 61 71 10.1111/bcpt.13585 33834601 Hundt H. K. Steyn J. M. Wagner L. 1990 Post-mortem serum concentration of cantharidin in a fatal case of cantharides poisoning Hum. Exp. Toxicol. 9 1 35 40 10.1177/096032719000900108 2328147 Ji B. C. Hsiao Y. P. Tsai C. H. Chang S. J. Hsu S. C. Liu H. C. 2015 Cantharidin impairs cell migration and invasion of A375.S2 human melanoma cells by suppressing MMP-2 and -9 through PI3K/NF-κB signaling pathways Anticancer Res. 35 2 729 738 25667452 Jin D. Huang N. N. Wei J. X. 2023 Hepatotoxic mechanism of cantharidin: insights and strategies for therapeutic intervention Front. Pharmacol. 14 1201404 10.3389/fphar.2023.1201404 37383714 PMC10293652 Karras D. J. Farrell S. E. Harrigan R. A. Henretig F. M. Gealt L. 1996 Poisoning from “Spanish fly” (Cantharidin) Am. J. Emerg. Med. 14 5 478 483 10.1016/S0735-6757(96)90158-8 8765116 Keam S. J. 2024 Cantharidin topical solution 0.7%: first approval Paediatr. Drugs 26 1 95 100 10.1007/s40272-023-00600-y 38007409 Khan R. A. Liu J. Y. Rashid M. Wang D. Zhang Y. L. 2013 Cantharidin impedes activity of glutathione S-Transferase in the midgut of Helicoverpa armigera hübner Int. J. Mol. Sci. 14 3 5482 5500 10.3390/ijms14035482 23528854 PMC3634466 Kim Y. M. Ku M. J. Son Y. J. Yun J. M. Kim S. H. Lee S. Y. 2013 Anti-metastatic effect of cantharidin in A549 human lung cancer cells Arch. Pharm. Res. 36 4 479 484 10.1007/s12272-013-0044-3 23435912 Knapp J. Bokník P. Linck B. Lüss H. Müller F. U. Nacke P. 1997 The effect of the protein phosphatases inhibitor cantharidin on beta-adrenoceptor-mediated vasorelaxation Br. J. Pharmacol. 120 3 421 428 10.1038/sj.bjp.0700929 9031745 PMC1564485 Knapp J. Bokník P. Huke S. Gombosová I. Linck B. Lüss H. 1998 Contractility and inhibition of protein phosphatases by cantharidin Gen. Pharmacol. 31 5 729 733 10.1016/s0306-3623(98)00053-6 9809469 Knapp J. Bokník P. Lüss I. Huke S. Linck B. Lüss H. 1999 The protein phosphatase inhibitor cantharidin alters vascular endothelial cell permeability J. Pharmacol. Exp. Ther. 289 3 1480 1486 10.1016/s0022-3565(24)38295-3 10336542 Koss D. J. Hindley K. P. Riedel G. Platt B. 2007 Modulation of hippocampal calcium signalling and plasticity by serine/threonine protein phosphatases J. Neurochem. 102 4 1009 1023 10.1111/j.1471-4159.2007.04579.x 17442047 Kuo J. H. Shih T. Y. Lin J. P. Lai K. C. Lin M. L. Yang M. D. 2015 Cantharidin induces DNA damage and inhibits DNA repair-associated protein expressions in TSGH8301 human bladder cancer cell Anticancer Res. 35 2 795 804 25667459 Laidley C. W. Dauben W. G. Guo Z. R. Lam J. Y. Casida J. E. 1999 2-Carboxymethylendothal analogues as affinity probes for stabilized protein phosphatase 2A Bioorg Med. Chem. 7 12 2937 2944 10.1016/s0968-0896(99)00239-4 10658599 Le A. P. Zhang L. L. Liu W. Shi Y. F. 2016 Cantharidin inhibits cell proliferation and induces apoptosis through G2/M phase cell cycle arrest in hepatocellular carcinoma stem cells Oncol. Rep. 35 5 2970 2976 10.3892/or.2016.4684 26986084 Lee J. Y. Chung T. W. Choi H. J. Lee C. H. Eun J. S. Han Y. T. 2014 A novel cantharidin analog N-benzylcantharidinamide reduces the expression of MMP-9 and invasive potentials of Hep3B via Biochem. Biophys. Res. Commun. 447 2 371 377 10.1016/j.bbrc.2014.04.035 24735540 Li D. Dai J. 1986 A case report of CTD poisoning Chin. J. Integr. Traditional West. Med. 755 12 Li Y. Li F. Cheng W. 2008 A case of CTD poisoning Forensic Sci. Technol. 02 76 77 10.16467/j.1008-3650.2008.02.001 Li G. Q. Zhang S. J. Lü J. F. Wu Y. Li J. Zhang G. 2010 Molecular mechanism of norCTD inducing apoptosis in liver cancer cells Zhonghua Yi Xue Za Zhi 90 30 2145 2148 21029633 Li W. Chen Z. Zong Y. Gong F. Zhu Y. Zhu Y. 2011 PP2A inhibitors induce apoptosis in pancreatic cancer cell line PANC-1 through persistent phosphorylation of IKKα and sustained activation of the NF-κB pathway Cancer Lett. 304 2 117 127 10.1016/j.canlet.2011.02.009 21376459 Li C. C. Yu F. S. Fan M. J. Chen Y. Y. Lien J. C. Chou Y. C. 2017 Anticancer effects of cantharidin in A431 human skin cancer (epidermoid carcinoma) cells in vitro in vivo Environ. Toxicol. 32 3 723 738 10.1002/tox.22273 27113412 Li Y. Sun H. Yasoob H. Tian Z. Li Y. Li R. 2021a Biogenetic cantharidin is a promising leading compound to manage insecticide resistance of Mythimna separata (lepidoptera: noctuidae) Pestic. Biochem. Physiol. 172 104769 10.1016/j.pestbp.2020.104769 33518040 Li X. Y. Guan Q. X. Shang Y. Z. Wang Y. H. Lv S. W. Yang Z. X. 2021b Metal-organic framework IRMOFs coated with a temperature-sensitive gel delivering norcantharidin to treat liver cancer World J. Gastroenterol. 27 26 4208 4220 10.3748/wjg.v27.i26.4208 34326620 PMC8311525 Li S. Duan X. Zhang Y. Zhao C. Yu M. Li X. 2024 Lipidomics reveals serum lipid metabolism disorders in CTD-Induced liver injury BMC Pharmacol. Toxicol. 25 1 10 10.1186/s40360-024-00732-y 38225635 PMC10790540 Liu Y. P. Li L. Xu L. Dai E. N. Chen W. D. 2018 Cantharidin suppresses cell growth and migration, and activates autophagy in human non-small cell lung cancer cells Oncol. Lett. 15 5 6527 6532 10.3892/ol.2018.8141 29731854 PMC5920915 Liu X. Zhang L. Tang W. Zhang T. Xiang P. Shen Q. 2023 Transcriptomic profiling and differential analysis reveal the renal toxicity mechanisms of mice under cantharidin exposure Toxicol. Appl. Pharmacol. 465 116450 10.1016/j.taap.2023.116450 36907384 Liu R. Yang C. Yang X. Yu J. Tang W. 2024 Network toxicology, molecular docking technology, and experimental verification revealed the mechanism of cantharidin-induced testicular injury in mice Toxicol. Appl. Pharmacol. 486 116921 10.1016/j.taap.2024.116921 38582374 Massicot F. Dutertre-Catella H. Pham-Huy C. Liu X. H. Duc H. T. Warnet J. M. 2005  In vitro Basic Clin. Pharmacol. Toxicol. 96 1 26 32 10.1111/j.1742-7843.2005.pto960104.x 15667592 Mccluskey A. Taylor C. Quinn R. J. Suganuma M. Fujiki H. 1996 Inhibition of protein phosphatase 2A by cantharidin analogues Bioorg. and Med. Chem. Lett. 6 9 1025 1028 10.1016/0960-894X(96)00166-7 McCluskey A. Bowyer M. C. Collins E. Sim A. T. R. Sakoff J. A. Baldwin M. L. 2000 Anhydride modified cantharidin analogues: synthesis, inhibition of protein phosphatases 1 and 2A and anticancer activity Bioorg Med. Chem. Lett. 10 15 1687 1690 10.1016/s0960-894x(00)00323-1 10937725 McCluskey A. Walkom C. Bowyer M. C. Ackland S. P. Gardiner E. Sakoff J. A. 2001 Cantharimides: a new class of modified cantharidin analogues inhibiting protein phosphatases 1 and 2A Bioorg Med. Chem. Lett. 11 22 2941 2946 10.1016/s0960-894x(01)00594-7 11677131 McCluskey A. Ackland S. P. Bowyer M. C. Baldwin M. L. Garner J. Walkom C. C. 2003 Cantharidin analogues: synthesis and evaluation of growth inhibition in a panel of selected tumour cell lines Bioorg Chem. 31 1 68 79 10.1016/s0045-2068(02)00524-2 12697169 McCuskey A. Keane M. A. Mudgee L. M. Sim A. T. Sakoff J. Quinn R. J. 2000 Anhydride modified cantharidin analogues. Is ring opening important in the inhibition of protein phosphatase 2A? Eur. J. Med. Chem. 35 10 957 964 10.1016/s0223-5234(00)00186-0 11121622 Naz F. Wu Y. Zhang N. Yang Z. Yu C. 2020 Anticancer attributes of cantharidin: involved molecular mechanisms and pathways Molecules 25 14 3279 10.3390/molecules25143279 32707651 PMC7397086 Neumann J. Herzig S. Boknik P. Apel M. Kaspareit G. Schmitz W. 1995 On the cardiac contractile, biochemical and electrophysiological effects of cantharidin, a phosphatase inhibitor J. Pharmacol. Exp. Ther. 274 1 530 539 10.1016/s0022-3565(25)10676-9 7616441 Nicholls D. S. Christmas T. I. Greig D. E. 1990 Oedemerid blister beetle dermatosis: a review J. Am. Acad. Dermatol 22 5 Pt 1 815 819 10.1016/0190-9622(90)70114-w 2189910 Pan Y. Zheng Q. Ni W. Wei Z. Yu S. Jia Q. 2019 Breaking glucose transporter 1/Pyruvate kinase M2 glycolytic loop is required for cantharidin inhibition of metastasis in highly metastatic breast cancer Front. Pharmacol. 10 590 10.3389/fphar.2019.00590 31178738 PMC6544055 Peng C. Liang H. 2015 One case of death from rabies treated with CTD J. Henan Univ. Sci. and Technol. Med. Sci. 33 04 296 297 10.15926/j.cnki.issn1672-688x.2015.04.022 Pistritto G. Trisciuoglio D. Ceci C. Garufi A. D'Orazi G. 2016 Apoptosis as anticancer mechanism: function and dysfunction of its modulators and targeted therapeutic strategies Aging (Albany NY) 8 4 603 619 10.18632/aging.100934 27019364 PMC4925817 Polettini A. Crippa O. Ravagli A. Saragoni A. 1992 A fatal case of poisoning with cantharidin Forensic Sci. Int. 56 1 37 43 10.1016/0379-0738(92)90144-l 1398375 Puerto Galvis C. E. Vargas Méndez L. Y. Kouznetsov V. V. 2013 Cantharidin-based small molecules as potential therapeutic agents Chem. Biol. Drug Des. 82 5 477 499 10.1111/cbdd.12180 23809227 Qiu L. Xu C. Jiang H. Li W. Tong S. Xia H. 2019 Cantharidin attenuates the proliferation and migration of vascular smooth muscle cells through suppressing inflammatory response Biol. Pharm. Bull. 42 1 34 42 10.1248/bpb.b18-00462 30393274 Qualls H. J. Holbrook T. C. Gilliam L. L. Njaa B. L. Panciera R. J. Pope C. N. 2013 Evaluation of efficacy of mineral oil, charcoal, and smectite in a rat model of equine cantharidin toxicosis J. Vet. Intern Med. 27 5 1179 1184 10.1111/jvim.12164 24033422 Rabkin S. W. Friesen J. M. Ferris J. A. Fung H. Y. 1979 A model of cardiac arrhythmias and sudden death: cantharidin-induced toxic cardiomyopathy J. Pharmacol. Exp. Ther. 210 1 43 50 10.1016/s0022-3565(25)31704-0 448646 Ren Y. Kinghorn A. D. 2021 Antitumor potential of the protein phosphatase inhibitor, cantharidin, and selected derivatives Bioorg Med. Chem. 32 116012 10.1016/j.bmc.2021.116012 33454654 PMC7854516 Schmitz D. G. 1989 Cantharidin toxicosis in horses J. Vet. Intern Med. 3 4 208 215 10.1111/j.1939-1676.1989.tb00859.x 2685272 Schwarz R. Hofmann B. Gergs U. Neumann J. 2024 Cantharidin and sodium fluoride attenuate the negative inotropic effects of carbachol in the isolated human atrium Naunyn Schmiedeb. Arch. Pharmacol. 397 4 2183 2202 10.1007/s00210-023-02747-4 37801145 PMC10933163 Shan H.-B. Cai Y.-C. Liu Y. Zeng W.-N. Chen H.-X. Fan B.-T. 2006 Cytotoxicity of cantharidin analogues targeting protein phosphatase 2A Anti-Cancer Drugs 17 8 905 911 10.1097/01.cad.0000217428.90325.35 16940800 Shao H. Dong L. Feng Y. Wang C. Tong H. 2020 The protective effect of L-glutamine against acute Cantharidin-induced cardiotoxicity in the mice BMC Pharmacol. Toxicol. 21 1 71 10.1186/s40360-020-00449-8 33004081 PMC7528483 Shi K. Wang M. 2003 A case of mixed Chinese medicine transdermal absorption of acute poisoning death Chin. J. Forensic Med. 04 240 241 10.13618/j.issn.1001-5728.2003.04.020 Shi Y. Lv Y. You Q. Qian W. 2022 Cantharidin induces senescence via inhibition of AMP-Activated protein kinase and activation of NLRP3 inflammasome in H9c2 cardiomyocytes Pak J. Pharm. Sci. 35 6 1827 1834 36861250 Shou L. M. Zhang Q. Y. Li W. Xie X. Chen K. Lian L. 2013 Cantharidin and norcantharidin inhibit the ability of MCF-7 cells to adhere to platelets via protein kinase C pathway-dependent downregulation of α2 integrin Oncol. Rep. 30 3 1059 1066 10.3892/or.2013.2601 23835679 PMC3783059 Song M. Wang X. Luo Y. Liu Z. Tan W. Ye P. 2020 Cantharidin suppresses gastric cancer cell migration/invasion by inhibiting the PI3K/Akt signaling pathway via CCAT1 Chem. Biol. Interact. 317 108939 10.1016/j.cbi.2020.108939 31945315 Sun Z. Shi B. 2009 Large area coating outside of acute CTD poisoning death: a case report J. Hebei North Univ. J. Med. 26 01 59 Sun X. Cai X. Yang J. Chen J. Guo C. Cao P. 2016 Cantharidin overcomes imatinib resistance by depleting BCR-ABL in chronic Myeloid leukemia Mol. Cells 39 12 869 876 10.14348/molcells.2016.0023 27989101 PMC5223104 Sun H. Li Y. Li X. Zhang Y. 2020 The inhibition of serine/Threonine protein phosphatase type 5 mediates cantharidin toxicity to control Periplaneta americana Insects 11 10 682 10.3390/insects11100682 33050059 PMC7600710 Sun H. Wang P. Wei C. Li Y. Zhang Y. 2022 The detoxification enzymatic responses of Plutella xylostella (Lepidoptera: plutellidae) to cantharidin J. Econ. Entomol. 115 5 1551 1556 10.1093/jee/toac139 36073195 Tagwireyi D. Ball D. E. Loga P. J. Moyo S. 2000 Cantharidin poisoning due to “Blister beetle” ingestion Toxicon 38 12 1865 1869 10.1016/s0041-0101(00)00093-3 10858524 Tan J. 2002 A fatal case of skin ulcer poisoning caused by cantharides Guangdong: Public Security Technology 04 25 26 Thaqi A. Scott J. L. Gilbert J. Sakoff J. A. McCluskey A. 2010 Synthesis and biological activity of Delta-5,6-norcantharimides: importance of the 5,6-bridge Eur. J. Med. Chem. 45 5 1717 1723 10.1016/j.ejmech.2010.01.004 20153915 Tian J. Chi B. Du X. 1982 A case report of fatal cantharides poisoning Railw. Med. J. 56 01 Tian X. Zeng G. Li X. Wu Z. Wang L. 2015 Cantharidin inhibits cell proliferation and promotes apoptosis in tongue squamous cell carcinoma through suppression of miR-214 and regulation of p53 and Bcl-2/Bax Oncol. Rep. 33 6 3061 3068 10.3892/or.2015.3942 25962755 Torbeck R. Pan M. DeMoll E. Levitt J. 2014 Cantharidin: a comprehensive review of the clinical literature Dermatol Online J. 20 6 10.5070/d3206022861 24945640 Twu N. F. Srinivasan R. Chou C. H. Wu L. S. Chiu C. H. 2012 Cantharidin and norcantharidin inhibit caprine luteal cell steroidogenesis in vitro Exp. Toxicol. Pathol. 64 1-2 37 44 10.1016/j.etp.2010.06.003 20594813 Wang T. Liu J. Xiao X. Q. 2015a Cantharidin inhibits angiogenesis by suppressing VEGF-induced JAK1/STAT3, ERK and AKT signaling pathways Arch. Pharm. Res. 38 2 282 289 10.1007/s12272-014-0383-8 24733674 Wang Y. Sun W. Zha S. Wang H. Zhang Y. 2015b Synthesis and biological evaluation of norcantharidin derivatives possessing an aromatic amine moiety as antifungal agents Molecules 20 12 21464 21480 10.3390/molecules201219782 26633341 PMC6331962 Wang G. Dong J. Deng L. 2018 Overview of cantharidin and its analogues Curr. Med. Chem. 25 17 2034 2044 10.2174/0929867324666170414165253 28413963 Wang J. Gong J. Wei Z. 2021 Strategies for liposome drug delivery systems to improve tumor treatment efficacy AAPS PharmSciTech 23 1 27 10.1208/s12249-021-02179-4 34907483 Whitman D. W. Andrés M. F. Martínez-Díaz R. A. Ibáñez-Escribano A. Olmeda A. S. González-Coloma A. 2019 Antiparasitic properties of cantharidin and the blister beetle Berberomeloe majalis (Coleoptera: meloidae) Toxins (Basel) 11 4 234 10.3390/toxins11040234 31013660 PMC6521026 Wu M. Y. Xie X. Xu Z. K. Xie L. Chen Z. Shou L. M. 2014 PP2A inhibitors suppress migration and growth of PANC-1 pancreatic cancer cells through inhibition on the Wnt/β-catenin pathway by phosphorylation and degradation of β-catenin Oncol. Rep. 32 2 513 522 10.3892/or.2014.3266 24926961 PMC4091883 Wu W. Su M. Li T. Wu K. Wu X. Tang Z. 2015 Cantharidin-induced liver injuries in mice and the protective effect of vitamin C supplementation Int. Immunopharmacol. 28 1 182 187 10.1016/j.intimp.2015.06.003 26071218 Xiao Z. Wang C. Chen L. Tang X. Li L. Li N. 2017 Has aidi injection the attenuation and synergistic efficacy to gemcitabine and cisplatin in non-small cell lung cancer? A meta-analysis of 36 randomized controlled trials Oncotarget 8 1 1329 1342 10.18632/oncotarget.13617 27901493 PMC5352058 Xiao Z. Wang C. Zhou M. Hu S. Jiang Y. Huang X. 2019 Clinical efficacy and safety of Aidi injection plus paclitaxel-based chemotherapy for advanced non-small cell lung cancer: a meta-analysis of 31 randomized controlled trials following the PRISMA guidelines J. Ethnopharmacol. 228 110 122 10.1016/j.jep.2018.09.024 30243827 Xiao Y. Liu R. Tang W. Yang C. 2024 Cantharidin-induced toxic injury, oxidative stress, and autophagy attenuated by Astragalus polysaccharides in mouse testis Reprod. Toxicol. 123 108520 10.1016/j.reprotox.2023.108520 38056682 Xiong L. Lin K. He T. Liu X. Yuan R. Li X. 2024 A novel approach combining network pharmacology and experimental validation to study the protective effect of ginsenoside Rb1 against cantharidin-induced hepatotoxicity in mice Basic Clin. Pharmacol. Toxicol. 134 5 737 749 10.1111/bcpt.13999 38477401 Xun X. 1990 Two case of CTD poisoning Chin. J. Forensic Med. 156 03 10.13618/j.issn.1001-5728.1990.03.012 Xu M. D. Liu S. L. Zheng B. B. Wu J. Wu M. Y. Zhang Y. 2018 The radiotherapy-sensitization effect of cantharidin: mechanisms involving cell cycle regulation, enhanced DNA damage, and inhibited DNA damage repair Pancreatology 18 7 822 832 10.1016/j.pan.2018.08.007 30201439 Xu W. L. Tang W. J. Yang W. Y. Sun L. C. Zhang Z. Q. Li W. 2024 Multiorgan dysfunction syndrome due to high-dose cantharidin poisoning: a case report World J. Clin. Cases 12 12 2074 2078 10.12998/wjcc.v12.i12.2074 38680272 PMC11045515 Yan J. Deng X. L. Ma S. Q. Hui Li Y. Gao Y. M. Shi G. T. 2023 Cantharidin suppresses hepatocellular carcinoma development by regulating EZH2/H3K27me3-dependent cell cycle progression and antitumour immune response BMC Complement. Med. Ther. 23 1 160 10.1186/s12906-023-03975-0 37202806 PMC10193799 Yang L. Wang H. 2005 CTD poisoning causing death: a case report Chin. J. Forensic Med. 183 03 10.13618/j.issn.1001-5728.2005.03.022 Yang X. Liu Y. Yang X. M. Hu F. Cui L. Swingle M. R. 2011 Cardioprotection by mild hypothermia during ischemia involves preservation of ERK activity Basic Res. Cardiol. 106 3 421 430 10.1007/s00395-011-0165-0 21399968 PMC3638756 Yao H. Zhao J. Wang Z. Lv J. Du G. Jin Y. 2020 Enhanced anticancer efficacy of cantharidin by mPEG-PLGA micellar encapsulation: an effective strategy for application of a poisonous traditional Chinese medicine Colloids Surf. B Biointerfaces 196 111285 10.1016/j.colsurfb.2020.111285 32771818 Youyou Z. Yalei Y. Jie Z. Chuhuai G. Liang L. Liang R. 2020 Molecular biomarkers of cantharidin-induced cardiotoxicity in Sprague-Dawley rats: troponin T, vascular endothelial growth factor and hypoxia inducible factor-1α J. Appl. Toxicol. 40 8 1153 1161 10.1002/jat.3974 32162354 Yu Y. Zhang Y. Zhang J. Guan C. Liu L. Ren L. 2020 Cantharidin-induced acute hepatotoxicity: the role of TNF-α, IKK-α, Bcl-2, Bax and caspase3 J. Appl. Toxicol. 40 11 1526 1533 10.1002/jat.4003 32627230 Zavoral M. Minarikova P. Zavada F. Salek C. Minarik M. 2011 Molecular biology of pancreatic cancer World J. Gastroenterol. 17 24 2897 2908 10.3748/wjg.v17.i24.2897 21734801 PMC3129504 Zhang J. P. Ying K. Xiao Z. Y. Zhou B. Huang Q. S. Wu H. M. 2004 Analysis of gene expression profiles in human HL-60 cell exposed to cantharidin using cDNA microarray Int. J. Cancer 108 2 212 218 10.1002/ijc.11405 14639605 Zhang L. Yu Z. Dong Y. Cui W. Du H. 2012 A case of CTD poisoning Chin. J. Forensic Med. 27 02 167 10.13618/j.issn.1001-5728.2012.02.038 Zhang Y. Zhou X. Zhang J. Guan C. Liu L. 2018a Cantharides poisoning: a retrospective analysis from 1996 to 2016 in China Regul. Toxicol. Pharmacol. 96 142 145 10.1016/j.yrtph.2018.05.007 29753762 Zhang H. Jiang Y. Ni X. Chen L. Wu M. Liu J. 2018b Glycyrrhetinic acid-modified norcantharidin nanoparticles for active targeted therapy of hepatocellular carcinoma J. Biomed. Nanotechnol. 14 1 114 126 10.1166/jbn.2018.2467 29463369 Zhang Y. Liu L. Ren L. 2020 RNA-sequencing-based transcriptome analysis of cantharidin-induced myocardial injury J. Appl. Toxicol. 40 11 1491 1497 10.1002/jat.4000 32618016 Zhang J. Yang S. Chen X. Zhang F. Guo S. Wu C. 2025 Aidi injection inhibits the migration and invasion of gefitinib-resistant lung adenocarcinoma cells by regulating the PLAT/FAK/AKT pathway Chin. Med. 20 1 2 10.1186/s13020-024-01054-1 39754146 PMC11699780 Zhao C. Jia J. Wang X. Luo C. Wang Y. 2019 Synthesis of Norcantharidin complex salts J. Heterocycl. Chem. 56 1567 1570 10.1002/jhet.3533 Zheng L. H. Bao Y. L. Wu Y. Yu C. L. Meng X. Li Y. X. 2008 Cantharidin reverses multidrug resistance of human hepatoma HepG2/ADM cells via Cancer Lett. 272 1 102 109 10.1016/j.canlet.2008.06.029 18703276 Zhou C. J. Qiao L. M. Zhao L. H. Li Z. Y. 2015 Evaluation of the impact of cantharidin on rat CYP enzymes by using a cocktail of probe drugs Fitoterapia 107 49 53 10.1016/j.fitote.2015.10.008 26498206 Zhou L. Zou M. Zhu K. Ning S. Xia X. 2019 Development of 11-DGA-3- O Molecules 24 17 3080 10.3390/molecules24173080 31450608 PMC6749572 Zhu J. Zhang W. Wang D. Li S. Wu W. 2018 Preparation and characterization of norcantharidin liposomes modified with stearyl glycyrrhetinate Exp. Ther. Med. 16 3 1639 1646 10.3892/etm.2018.6416 30186382 PMC6122258 Zhu S. S. Long R. Song T. Zhang L. Dai Y. L. Liu S. W. 2019 UPLC-Q-TOF/MS based metabolomics approach to Study the hepatotoxicity of cantharidin on mice Chem. Res. Toxicol. 32 11 2204 2213 10.1021/acs.chemrestox.9b00233 31617706 Zhu M. Shi X. Gong Z. Su Q. Yu R. Wang B. 2020 Cantharidin treatment inhibits hepatocellular carcinoma development by regulating the JAK2/STAT3 and PI3K/Akt pathways in an EphB4-dependent manner Pharmacol. Res. 158 104868 10.1016/j.phrs.2020.104868 32407961 Zou W. 1999 Forensic identification of death from oral cantharides induced by abortion poisoning J. Mod. Clin. Med. Bioeng. 203 03 Zouvanis M. Feldman C. Smith C. Promnitz D. A. James S. Seftel H. C. 1994 Renal and neuromuscular respiratory failure--is this a syndrome associated with cantharidin poisoning? S. Afr. Med. J. 84 11 Suppl. l 814 816 8914545 Glossary ADP Adenosine diphosphate ALP Alkaline phosphatase ALT Alanine aminotransferase AST Aspartate aminotransferase ATP Adenosine triphosphate Bax BCL2-associated X protein Bcl-2 B-cell lymphoma 2 protein CarEs Carboxylesterases c-Fos c-Cellular oncogene CML Chronic myeloid leukemia c-myc MYC proto-oncogene, bHLH transcription factor COX-2 Cyclooxygenase 2 CTD Cantharidin CYP2C9 Cytochrome P450 2C9 CYP2D6 Cytochrome P450 2D6 CYP3A4 Cytochrome P450 3A4 DCs Dendritic cells DKK3 Dickkopf WNT signaling pathway inhibitor 3 DR4/5 Death receptor 4/5 ECM Extracellular matrix ERCC DNA excision repair protein ERK Extracellular signal-regulated kinases ERS Endoplasmic reticulum stress FANCG Fanconi anemia group G protein GC/MS Gas chromatography-mass spectrometry GLUT1 Glucose transporter 1 GSTs Glutathione S-transferases GTP Guanosine triphosphate HIF-1 Hypoxia-inducible factor-1 JNK c-Jun N-terminal kinase MAPK Mitogen-activated protein kinase MC Molluscum Contagiosum MCF-7 Michigan Cancer Foundation - 7 MMP Matrix metalloproteinase Myh7 Myosin heavy chain 7 NCTD Norcantharidin NF-κB Nuclear factor kappa-B P450s Cytochrome P450 monooxygenases PERK/CHOP Protein kinase R-like ER kinase/C/EBP-homologous protein PI3K Phosphatidylinositol 3-kinase PKC Protein kinase C PLD2 Phospholipase D2 PP1 Protein Phosphatase 1 PP2A Protein phosphatase 2A ROS Reactive oxygen species TLR4 Toll-like receptor 4 TNC Tenascin C TNF-α Tumor necrosis factor-α TRAIL Tumor necrosis factor-related apoptosis-inducing ligand UPLC-Q-TOF/MS Ultra performance liquid chromatography-quadrupole-time-of-flight mass spectrometry VC Vitamin C VEGF Vascular endothelial growth factor β-TrCP beta-transducin repeats-containing protein ",
  "metadata": {
    "Title of this paper": "Renal and neuromuscular respiratory failure--is this a syndrome associated with cantharidin poisoning?",
    "Journal it was published in:": "Frontiers in Pharmacology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487651/"
  }
}