{
  "title": "Paper_612",
  "abstract": "pmc BMC Health Serv Res BMC Health Serv Res 34 bmchsr BMC Health Services Research 1472-6963 BMC PMC12482015 PMC12482015.1 12482015 12482015 41029694 10.1186/s12913-025-13299-z 13299 1 Research Patients’ and healthcare personnel’s experiences of a health-literacy intervention in chronic obstructive pulmonary disease - a qualitative study http://orcid.org/0000-0001-9113-1062 Larsen Marie Hamilton Marie.Hamilton.Larsen@ldh.no m.h.larsen@medisin.uio.no Marie.h.larsen@ldh.no 1 Wahl Astrid Klopstad 2 Borge Christine Raaheim 1 2 3 1 https://ror.org/015rzvz05 grid.458172.d 0000 0004 0389 8311 Department for Postgraduate Studies, Lovisenberg Diaconal University College, 2 https://ror.org/01xtthb56 grid.5510.1 0000 0004 1936 8921 Department of Public Health and Interdisciplinary Health Sciences, University of Oslo, 3 https://ror.org/03ym7ve89 grid.416137.6 0000 0004 0627 3157 Lovisenberg Diaconal Hospital, 30 9 2025 2025 25 478160 1256 22 4 2025 25 7 2025 30 09 2025 01 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Chronic obstructive pulmonary disease (COPD) poses challenges to people's self-management, especially after hospital discharge. Few studies have qualitatively examined the experiences of patients and healthcare personnel following a nurse-led health literacy intervention to prevent readmission. Methods This exploratory qualitative process evaluation was conducted within a randomized controlled trial aimed at understanding the perspectives of both patients and professionals following the implementation of a health literacy intervention. The intervention includes home visits conducted by nurses trained in COPD, employing motivational interviewing techniques and supporting the development of individualised treatment plans post-hospital discharge. Eight semi-structured interviews with patients, one focus group, and one individual interview with healthcare providers ( n Results Two main themes arose among patients: “Building health literacy through personalized nursing support” and “From knowledge to action: Strengthening health literacy through motivational support” – and two among healthcare professionals; “Health professionals’ experience of developing health literacy competency” and “Perceived shifts in understanding, roles, and relationships through health literacy awareness”. Conclusion The nurse-led health literacy intervention was perceived as valuable by both patients and healthcare professionals. Patients described how home-based support from competent nurses may have contributed to a better understanding of post-discharge care and fostered a sense of preparedness. Professionals reported gaining insights into patient needs, which they felt enabled more tailored communication and care planning. While the findings are based on a small qualitative sample, they suggest that such interventions may support the transition from hospital to home. T The RCT study is registered on ClinicalTrials.gov (ID: NCT 03216603 Supplementary Information The online version contains supplementary material available at 10.1186/s12913-025-13299-z. Keywords COPD Health literacy Motivational interviewing Person-centred care Qualitative interviews University of Oslo (incl Oslo University Hospital) Open access funding provided by University of Oslo (incl Oslo University Hospital) pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction The World Health Organization (WHO) 2021 World Health Statistics reveal that non-communicable diseases (NCDs) are a major global health concern, comprising seven of the top ten causes of death and contributing to over a third of the global disease burden [ 1 2 3 Chronic Obstructive Pulmonary Disease (COPD) is a significant NCD affecting around 65 million people globally, with a growing incidence [ 4 5 6 7 8 9 11 12 13 14 15 9 The intervention developed new toolkits and strategies for healthcare professionals and patients using the Ophelia process. Furthermore, new collaborative relationships, various health personnel competencies and communication systems across different health care services were established. Inspired by the Ophelia process, the study comprises three phases. In phase one, we identified health literacy needs through focus groups and a health literacy survey [ 10 11 9 9 9 16 17 Aim The present paper focuses on the process evaluation of the intervention by exploring the experiences of patients participating in the intervention group and the healthcare personnel who performed the intervention. Results from the other phases have been published separately [ 9 11 18 Methods The Consolidated Criteria for Reporting Qualitative Research (COREQ) checklist was used during the development and reporting of the study [ 19 Design This study has an explorative, descriptive, qualitative design. It was nested within the RCT study and conducted before the trial's results regarding the effectiveness of the COPD-HL intervention were known [ 18 Rationale for the multi-perspective approach We included both patient and healthcare professional perspectives based on the understanding that health literacy interventions function within complex health systems shaped by patient-provider interactions. Research shows their effectiveness depends on patient engagement and providers’ ability to adapt communication [ 20 Personal characteristics of the research team Two female researchers (AKW & MHL) conducted individual interviews with the patients with COPD and one of the study nurses (AKW). MHL led a focus group with other healthcare professionals (HCP), supported by a research assistant for note-taking and observation. At the time of the study, MHL was an associate professor at a Norwegian nursing college (master's studies) and a senior researcher at the University of Oslo. AKW is a professor at the University of Oslo and a senior researcher at Oslo University Hospital. CRB serves as the head researcher and principal investigator of the RCT study, and is a senior researcher at the recruiting hospital, and an associate professor at the University of Oslo. Relationship with participants The interviewers had no prior acquaintance with the patients. Some HCP had casual familiarity with the interviewers, while others did not. Participants were informed that the interviewers' involvement was due to their research expertise and not direct implementation of the project. Neither interviewer had prior experience in COPD care, reducing any assumptions about participant responses. Study setting and recruitment Participants with COPD were recruited by a study nurse after the intervention, interviewed six months later, and before the final one-year follow-up (with no intervention during this period). Purposeful sampling aimed to gather diverse post-intervention experiences. The inclusion criteria for the intervention included a COPD diagnosis, age over 18, and admission for COPD on the medical unit. Exclusion criteria comprised documented cognitive impairment and cancer treatment. Interviews with all healthcare professionals took place after data collection concluded at the one-year follow-up in December 2020, which was delayed due to the COVID-19 epidemic. Health literacy informed intervention The health literacy intervention was a collaboration between a medium-sized hospital in Oslo, Norway, and four municipal health departments: Grünerløkka, Gamle Oslo, St.Hanshaugen and Sagene. It entailed eight weeks of home follow-up post-hospitalisation by nurses trained in COPD care and motivational interviewing (MI). These nurses also worked in the hospital ward where patients were admitted. Additionally, patients received four months of telephone support and could contact the nurses during the day if needed (see Fig. 1 9 Fig. 1 Content of the health literacy intervention in people with COPD Data collection Patients who had taken part in the health literacy intervention (FGD number: 2017/1281), were approached by a study nurse during post-intervention data collection. Only participants in the intervention group were interviewed to address the article’s objective. Three of the approached patients declined to be interviewed due to COPD-related fatigue. The RCT study is registered on ClinicalTrials.gov, 7/7–2017 (ID: NCT03216603 An interview guide with open-ended and follow-up questions regarding various aspects of study participation was employed (see Supplementary files 1& 2). The guide was not pilot-tested, but participants were encouraged to freely share their experiences, and probing questions, like ‘What do you mean by that?’ ‘Could you tell me more?’ was used for clarification. Interviews conducted either in the patient's home or the hospital, ranged from 20 to 90 min. No one else participated in the individual interviews except for the interviewer and the patient. The focus group and healthcare professional interviews lasted approximately 90 min and were conducted in the hospital`s administration building. One researcher served as the moderator, while another acted as the secretary in the focus group. All interviews were conducted in Norwegian and were audio recorded and transcribed verbatim. They were not returned for comments or corrections. Data analysis Reflexive thematic analysis guided by Braun and Clarke’s six phases (i.e. familiarising oneself with the data, generating initial codes, searching for themes, reviewing the themes, defining and naming the themes and report production) [ 21 1 22 23 Table 1 Details of the analysis steps Steps to reflexive thematic analysis Details of analysis Step 1: Familiarising oneself with the data CRB, MHL and AKW read all the transcripts to gain a general impression of the data from both the patient and health care personnel interviews Step 2: Generating initial codes The same three authors read and coded the eight individual patient interviews independently and then met and coded together using Nvivo software to draft the first codebook. Hence, the transcripts were examined on a line-by-line basis with codes assigned to segments of the data and an initial coding frame developed The patient interviews were coded first to let the patients` voices guide the analysis. Then, the same three authors independently coded the transcriptions from the focus group interview with health care personnel and one individual interview with one of the nurses using the codebook from the patient interviews and, through discussion, agreed on additional new codes to assure the relevance of the codebook. Some codes were only relevant for the patients and some for the HCPs. This process was flexible; the texts were often double- and triple-coded; and the codes had to be re-evaluated and adjusted. The text was sorted into 47 codes from patients and HCPs Step 3: Searching for themes Codes were gradually expanded into broader categories through comparison across transcripts, and higher-level recurring themes were developed. All data relevant to each potential theme were gathered. Every theme with connected data extractions was read and coded to identify the core elements of the theme and check whether the themes were logical and meaningful Step 4: Reviewing themes The themes were checked to determine whether they worked on the coded extracts (level 1) and the entire data set (level 2). A visual mind map was created during one of the later workshops to create a general idea about the themes and subthemes to avoid missing the overall picture and determine what was relevant to the research question related to experiences participating in the intervention. Subthemes were identified; certain data extracts were moved to a different theme, and specific themes were split, whereas others were renamed and merged All the transcriptions were then re-read to check the validity of the themes. No further adjustments were needed Step 5: Defining and naming themes A short text capturing the core story of each theme relevant to answering the research question was formed. Illustrative quotes were identified Step 6: Producing the report This step involved relating to the analysis of the research question and literature and reporting the analysis. Vivid, compelling extract examples were selected Rigour and reflexivity Lincoln and Guba [ 24 25 26 25 19 Findings Participants characteristics The average age of the patients who participated in the interviews was 69, with a range of 58–86 years. The median time since diagnosis of COPD was 15 years, with a range of 0–29 years. There were four men and two women, approximately 50% lived alone, and 25% had more than four years of higher education. Of the healthcare professionals who followed up with the patients, five were nurses, and one was a pulmonary physician. All were females, and their ages ranged from 27 to 40 years. Experiences after the intervention Table 2 3 4 5 6 Table 2 Overview of themes and sub-themes Patient perspectives HCPs’ perspectives Themes Building health literacy through personalized nursing support From knowledge to action: Strengthening health literacy through motivational support Health professionals’ experience of developing health literacy competency Perceived shifts in understanding, roles, and relationships through health literacy awareness Sub themes Learning to navigate COPD knowledge within life's complexities Motivation for positive lifestyle change The need to acquire new knowledge and competence Experiencing understanding through secure personal relations Competence and trust go hand in hand The importance of a tailored treatment plan Communicating differently with MI Collaboration across and between healthcare services From confusion to confidence: participants'experiences of personalized health education The treatment plan as a compass for action A limitless nursing role COPD MI Table 3 Quotes from Theme 1 Subtheme 1: Learning to navigate COPD knowledge within life's complexities Quote 1: No, so now I'm trying to look ahead; I've always been good at that. Concentrate on the things I can manage instead of all the things I can't Quote 2: I usually say that I have Emphysema, and it is a genetic variant. We sort into the diagnosis of COPD. Then we are done for. Because then you will not only be assessed as ill but in other words, you have inflicted the disease on yourself. And in addition, you are considered to be a bit stupid. In other words, placed in a group that is\"second class\". That's the impression you get. That's how it is. So that in itself is an enormous burden. I think this might apply to many chronically ill people. It's not a day you can turn on the TV, social media, or whatever without seeing pink ribbons for cancer and for this and that. There are no limits but chronically ill or lung diseases, never anything. No way. You get nothing. That's as far “down the ladder” as you can go. So that's why this initiative is terribly important Subtheme 2: Competence and trust go hand in hand Quote 3: It's been very nice (the project), and again this, gaining trust in the individual nurses means that it gives a quality of life that you otherwise don't have access to. Else, when you contact the hospital, so you have no idea who, and you have to have regular people around you. Predictability, it means a lot, at least when you are struggling with breathing and hyperventilating and just knowing that you can contact someone and that you can leave a message Quote 4: “But what has meant the most to me, as I said, is simply the contact between me and a single human being, and in this case (name of nurse in project). That is…., it gives you peace of mind, knowing you have somewhere to call. Someone you can talk to and get help from and get things done. Absolutely priceless, I think” Sub theme 3: From confusion to confidence: participants'experiences of personalized health education Q5 Now I can happily stand in front of a group and talk about my illness (…). Yes, I have learned so much, (….) I could stand and give a long lecture myself Table 4 Quotes from the participants on Theme 2 Subtheme 1: Motivation for a positive lifestyle change Quote 1: “They were different, because before there were exhortations, and now there was more encouragement. There was no pointing finger like that. Because I have sort of experienced that before, that kind of pointing finger, it was so stupid, but now; basically, I became more motivated” Quote 2: “ Oh yes yes (laughs)—well, I think I've been given a second chance in life, and I don't want to waste it. Because I've been thinking about quitting smoking for so long and been upset about myself because I haven't succeeded, and then you get such a hard slap (his exacerbation)—and then – NO, I don't want to go back to that—no I don't want to go there again—ush.” Subtheme 2: The importance of a tailored treatment plan Quote 3: Yes, a plan—I'll take that plan first and afterwards if it happens—yes because it's green, yellow and red – (Name of project nurse) has made it for me and if it gets bad I'll probably call and go to the hospital, but on the road there, I have various things to do—I think that's a good idea—because if that—then I can start, then I know I can start, and I can take extra medicine” Quote 4: Yes absolutely. It is difficult to say to what extent it (the plan) prevents hospital admissions, but I think we have stopped perhaps a couple of infections quite early, where they take CRP, tests and start early with a little extra Prednisolone. A couple of such cases. (…..). But what has meant the most to me is simply that, because I know my illness, it's a full-time job dealing with nebulizers and medication and all this, get rid of mucus and, it's an all-day job, so, but what has meant the most to me, as I said, is, it's simply the contact between me and a single person and, in this case, (the name of project nurse). It gives you peace of mind and you know you have somewhere to call. Someone you can talk to and, yes, get help from and get things done. Absolutely priceless, I think Quote 5 Interviewer: But after you were part of the project and had these conversations with the nurses, is there anything that you do differently than before? Patient: Well, yes, I follow this (points to the treatment plan). (I: You follow the plan.) Yes. And I know now that I have to go to the doctor earlier than before. Before this (the project), I was reluctant to go. I have been hospitalized too many times before. So, as I said, I have been given Prednisolone two times, and the other one, I don't remember what it was called. I have it here, (reads from the plan) Doxylin. Yes, this plan has now worked twice. So, no, that one is the most important, it is absolutely superb Table 5 Participant quotes from Theme 3 Subtheme 1: The need to acquire new knowledge and competence Quote 1: “I noticed that when I worked on the project a bit, the more opportunities you see for the project patients, the more opportunities you see for the hospital patients as well. You learn a lot when you visit several homes and observe how others solve problems. This experience allows you to come up with more suggestions for the patients admitted to the ward as well.” Quote 2: “Because we also discovered that there was a lot of information that was given at the hospital – that the patients don't remember when they get home, so being able to come and be able to repeat a lot of it was great, so I think it was one of the most important things, repeating information and going through things again. They have been so sick, and it was such an aha experience, I knew about it, and there has been a lot of research into it, but it becomes very relevant when you work like that, so you realize that it is actually like that too. A lot of information is being missed.” Quote 3: “Many (patients) were very grateful and happy that we had so much time. Yes, they were, and the other group were also, in a way, the ones who had so many problems that they didn't quite have the energy to be grateful. At least it didn't really come out then, but I got the impression that the vast majority of them really appreciated it, and they had a lot to contribute then. It was mostly very easy to fill those hours Subtheme 2: Communicating differently using MI Quote 4: One of the nurses after being asked if the MI techniques changed her way of working; “ Yes. I think so. Absolutely. And I think I use different words when I teach too. I notice that I use MI more now on the ward as well. I don`t feel that I am more ineffective when I sit down and spend 5 min and am sort of “in the situation” with the patient than when I was kind of running around trying to do a lot of things at once Subtheme 3: The treatment plan as a compass for action Quote 5 For many patients, I think it was very nice (making the plan), and we got to know them well during the process. I think they thought it was very nice to learn about how the medicines worked—that they got…because there were a lot of them who didn't know exactly how the medicines worked in their lungs or in their body Table 6 Participant quotes from theme 4 Subtheme 1: Experiencing understanding through secure personal relations Quote 1: I also think that the patient could talk and open up a lot when he was in his safe home environment. When you have been several times in a patients'homes, it also becomes easier to ask about things—then things come up that they might not have otherwise shared regarding family or relationships or practical things at home or challenges or whatever it might be—so yes, it's actually a very nice way to work and be able to go on home visits—yes, so you get a lot more information. Then you also see how the patients feel about hygiene and cleaning and—yes, there may be things they struggle with—or that they are unable to tidy up at home, for example—you pick up a lot by being in a home—how the patient feels at home, yes you do that—with mastery in life then you can simply say Quote 2 I think it was very nice to see them at home and in their own element where they have their own things, their own clothes, not wearing just a patient's shirt. That meant that they became more of a different person, yes, we saw them from a new side…. and we began to see what they actually achieved and what the actual challenges were. Because it is not always so easy to understand in the hectic everyday life at the hospital Quote 3 Sometimes I was very surprised at how well the patient functioned at home when compared to how they functioned during many hospitalisations. I thought about what quality of life they have or what their everyday life is like. Some are also very social and have their regular routines and meet at the cafe on the first floor every day with the same group, and have somehow created an everyday life that works. Yes, seeing them in their own clothes was a very positive surprise, and I realised they had much more resources than I had thought. The prejudice you get from seeing them at their worst in the ward. So, it's only a small part of their lives (……). But then there were the other ones. The bad living conditions many lived in, with no cleaning, and some had many challenges as they collected things, couldn't get rid of them, it was just completely overcrowded, you almost got sick from living in such an environment. So, yes, it made a big impression. See how they lived; I hadn`t thought much about how they lived at home earlier Subtheme 2: Collaboration across and between healthcare services Quote 4: “The home nursing service in the municipalities would like us to be present on a regular basis. So, they see us and can ask questions. Because it gets easier for them, but then it is suddenly a full-time position to work with interaction. You can't do that.” Quote 5: In any case, I think it was very good to discuss with them (home care nurses). It was nice to have someone, yes, to discuss the patient with and often share the experience then. And, yes, knowing that there are more people who see the patient and that it was useful for both sides then (…..) Subtheme 3: A limitless nursing role Quote 6: We (the project nurses) had a really good dialogue, and we also got to talk to one of our hospital chaplains about things that were difficult – that was very good, so I went there a couple of times—so it was very nice because as I said, when you get so close to the patients, it gets a bit heavy and then this boundary setting …… so it was very useful Quote 7: It's been very educational—I've learned a lot—it's been really nice afterwards because I've gotten to know so many people at the hospital now from different professional groups—so I've been able to do a much better job—after the project because you know the physiotherapists well, you know and you call and sort things out and—so I've become a much better nurse than I was before (laughs a little) Quote 8: Yes, I've learned a lot and just how to have contacts that you know, it has been much easier, and I refer patients much faster now, both to lung physio and nutritionist—which maybe you didn't think about before the project—I have much more focus on such things now when I work. I also write much more to the municipality care nurses—I am much more aware of—for example if they come with a CPAP or whatever, that I see looks miserable, then you can send measures or electronic questions to the municipality services so that they can initiate measures so the patients get help… yes I have much more focus on such things and I can call and—so I feel that I have become a better nurse after this project—learned a lot and thought more—more broadly in a way actually—I have learned a lot from the patients—they have taught us a lot—actually—so it's not just us we who teach them Perspectives of patients with COPD Theme 1. Building health literacy through personalised nursing support In this first theme, the three subthemes reflect different aspects of the patient`s experience of receiving home follow-up and the interactions with the visiting nurse; 1) Learning to navigate COPD knowledge within life's complexities 2) Competence and trust go hand in hand and 3) From confusion to confidence: participants'experiences of personalized health education. All interviewed patients expressed overall positive experiences with nurses'home visits, citing newfound COPD knowledge, practical adjustments, and technical equipment provided by the nurses. Several patients expressed a desire for continued follow-up with hospital-based nurses. In ‘ Learning to navigate COPD knowledge within life's complexities 3 3 In the second subtheme, ‘ Competence and trust go hand in hand 3 3 In the third subtheme, ‘ From confusion to confidence: participants'experiences of personalized health education 3 Theme 2: From knowledge to action: strengthening health literacy through motivational support This second main theme consists of two sub themes; 1) Motivation for positive lifestyle change and 2) The importance of a treatment plan. In this theme, the patients talked about the consequences of the COPD intervention on their lifestyle- and treatment choices. The motivational interviewing techniques and the nurses` empathy were assessed as positive, and many of the patients experienced the treatment plan as an important measure to gain more control of their COPD symptoms. In the first subtheme describing motivation for positive lifestyle change 4 Another patient, who had recently quit smoking after 45 years, described the importance of project nurses providing positive reinforcement for his efforts. The informant reported finding motivation in colleagues'positive comments about improved physical endurance at work and described experiencing reduced breathing problems and less mucus. However, the most significant motivation was not wanting to deceive the project nurse, who regularly inquired about the progress as a non-smoker. The informant described how the improved physical fitness also motivated to pay more attention to diet and be more physically active, reporting that this gave a sense of having a fresh start in life (Table 4 In the second subtheme, ‘ The importance of a tailored treatment plan 4 The treatment plan also improved the patients` understanding of how different medications addressed their symptoms. Patients believed that early medication use, guided by the plan, could, in some situations prevent hospitalization (Table 4 Perspectives of healthcare professionals The second part of the themes is based on the interviews with the nurses and the doctor who had participated in the intervention. These interviews led to two main themes 1) Health professionals` experience of developing health literacy competency, 2) Descriptions of new understandings, roles, and relationships through health literacy knowledge. Theme 3: Health professionals’ experience of developing health literacy competency This theme includes three subthemes: (1) The need to acquire new knowledge and competence, (2) communicating differently with MI, and (3) the treatment plan as a tailored compass for action. The nurses discussed how meeting patients in their homes made them rethink the challenges faced by individuals living with COPD. They emphasised the importance and challenges of learning and applying motivational interviewing techniques and developing new skills such as writing treatment plans and gaining more knowledge on COPD-related topics like nutrition, smoking cessation, and pulmonary function tests. In the first subtheme, ‘ The need to acquire new knowledge and competence 5 5 5 In the second subtheme, ‘ Communicating differently with MI 5 Additionally, nurses mentioned that, as healthcare professionals, they were accustomed to giving advice and solving problems for patients, but using MI shifted their approach, allowing patients to arrive at their own conclusions. In the third subtheme, ‘ The treatment plan as a compass for action 5 Theme 4: Perceived shifts in understanding, roles, and relationships through health literacy awareness This theme consists of three subthemes: 1) Experiencing understanding through secure personal relations In subtheme one, Experiencing understanding through secure personal relations; nurses described the importance of social support for patients. Many participants in the project were perceived by the nurses as appearing lonely with limited support systems. Nurses reported that establishing more personal connections allowed patients to be more open and expressive about their needs. They described how this deeper rapport facilitated trust and collaborative problem-solving (Table 6 6 6 The second subtheme, ‘ Collaboration across and between healthcare services,’ describes how nurses effectively collaborated 6 Furthermore, nurses described technical obstacles arising due to differences in electronic systems between the hospital and municipalities, leading to poor communication. The nurses described valuing the teamwork aspect but reported finding it sometimes challenging to determine the best solutions for a patient when they were the sole nurse visiting them. They described how collaboration with other nurses or the doctor, who were more familiar with the patient, facilitated discussions and decision-making (Table 6 In the third subtheme, ‘ A limitless nursing role 6 Overall, the nurses found the project to be highly educational, leading to a deeper understanding of their nursing roles. They described noting changes in their communication styles after the intervention, with a heightened awareness of the patients'home environments (Table 6 6 Discussion and conclusion Discussion This study aimed to qualitatively evaluate a health literacy intervention by exploring the experiences of both patients and healthcare personnel in the intervention group. Process evaluation that focuses on more than efficacy and effectiveness is recommended by the framework for the development and evaluation of complex interventions (i.e. the Medical Research Council’s framework for developing and evaluating complex interventions [ 16 Most participants described positive views of the intervention, and both patients and healthcare workers reported enhanced COPD knowledge. COPD self-management is complex, requiring collaboration between patients and professionals to define their roles. The emotional and clinical burden reported by patients with COPD is consistent with existing literature [ 27 28 29 30 31 However, participants described how focusing on health literacy with MI techniques and nonjudgmental communication by nurses motivated them to seek knowledge and adopt positive health behaviors, similar to other COPD studies [ 32 33 12 34 35 36 37 Our study found that patients receiving the health literacy intervention highly valued practical solutions to their issues. They especially reported appreciating nurses consulting the hospital's lung specialist to facilitate prescription arrangements, avoiding the need for a GP visit. Similar results are evident in another COPD study [ 38 39 40 41 42 Strengths and limitations of the study Strengths include the fact that the researchers who conducted patient interviews had no prior knowledge of the participants, or the healthcare professionals involved in the study, reducing potential bias. However, there may be some recall bias among the nurses due to the long-time interval between project completion and the interviews. All healthcare provider participants were female, which may limit the transferability of findings to healthcare settings with more gender-diverse teams. Male healthcare providers may possess different communication styles, perspectives, or approaches to health literacy interventions that could influence patient experiences and outcomes. Furthermore, the gender dynamics between our all-female provider sample and both male and female patients may have created specific interaction patterns that affect the generalisability of results to varying provider-patient gender combinations. The interviewed participants may not fully represent the diversity of individuals with severe COPD. Only one participant was from an ethnic minority background, despite the RCT cohort encompassing a broad demographic, social, and clinical spectrum. Additionally, the study primarily featured one doctor, and other healthcare professionals, such as physiotherapists, nutritionists, or those from community healthcare services who consulted the nurses, were not interviewed. Furthermore, while the inclusion of both patient and healthcare professional perspectives enriched the study by offering a more holistic view of the intervention’s impact, we acknowledge that the analysis maintained separate thematic structures for each group. This approach preserved the integrity of their distinct experiences but limited opportunities for a more integrated synthesis. A more in-depth comparative analysis, exploring convergences, divergences, and complementary insights between patients and providers, could have further strengthened the findings and offered more nuanced implications for practice and implementation. Member checking was not conducted to verify the accuracy of transcripts and interpretations with participants, which represents a missed opportunity to enhance the credibility and trustworthiness of our findings through participant validation. The sample size—eight patient interviews and six healthcare professional interviews—was small, but deemed sufficient based on the concept of information power [ 43 Mixing interviews and focus groups might limit the depth of discussion on certain topics, as these methods offer different possibilities for exploration. Another limitation is the inclusion of only intervention arm participants, without control arm participants for comparison. This means we cannot compare participants ‘ experiences with those who did not receive the intervention, limiting our understanding of what aspects of the experience were specifically related to the intervention components. Another key limitation of this study is the absence of clinical data regarding participants’ COPD severity (e.g., GOLD stage or spirometry results). This restricted our ability to explore how disease stage may have influenced patients’ experiences and needs within the health literacy intervention. While the intervention was designed to be individualised and responsive to each patient’s functional status and expressed concerns, we acknowledge that patients at different stages of COPD may require different types and intensities of support. Overall, while the study provides valuable insights into participants’ experiences, the findings should be viewed as exploratory and hypothesis-generating. Future studies with larger, more diverse samples could explore the transferability to other contexts and populations. Future research should also incorporate clinical indicators to enable a more nuanced understanding of how disease progression shapes HL needs and outcomes. Relevance to clinical practice The study highlights the importance of understanding and respecting patients with COPD`s perspectives and knowledge for effective treatment. The collaborative negotiation of patient-professional relationships is key to health literacy and self-management in COPD follow-up. Whether from hospitals or municipalities, patients and healthcare professionals must collaborate to define their roles and responsibilities in addressing health literacy, self-management, and timely treatment of exacerbations. Conclusion The nurse-led health literacy intervention was perceived as valuable by both patients and healthcare professionals. Participants described how home-based support contributed to a better understanding of post-discharge care and fostered a kind of preparedness. Healthcare professionals reported gaining greater awareness of patient needs for involvement, which they felt enabled more tailored and empathetic support. However, COPD self-management remains complex and requires ongoing collaboration between patients, professionals, and health care services. While these findings are based on a small qualitative sample, they suggest that such interventions may support patient-centered COPD care transitions when healthcare professionals possess appropriate health literacy competencies. Electronic Supplementary Material  Supplementary Material 1: Interview guide for participants  Supplementary Material 2: Interview guide for HCP  Supplementary Material 3: COREQ checklist Abbreviations COPD Chronic Obstructive Pulmonary Disease HL Health literacy RCT Randomized controlled trial HCP Health Care Personnel MI Motivational Interviewing BMI Body Mass Index eHLQ E- Health Literacy Questionnaire COOP WONCA Dartmouth COOP Functional Health Assessment Charts / WONCA in measuring functional status Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors would like to thank the patients with COPD who shared their experiences from the intervention and the healthcare personnel who were so dedicated and contributed greatly to a positive result and to the implementation of the study. We confirm all patient/personal identifiers have been removed or disguised so the patient/person(s) described are not identifiable and cannot be identified through the details of the story. Authors’ contributions CRB, AKW, and MHL were responsible for the study's literature search, conception, and design. CRB recruited participants for the interviews. AKW and ML were responsible for data collection. CRB, AKW and MHL analysed and interpreted the data. MHL wrote the first draft of the manuscript. All authors wrote substantial parts and critically revised the manuscript. All authors, CRB, AKW, and MHL, were responsible for writing and revising the manuscript and have approved the final article. Funding Open access funding provided by University of Oslo (incl Oslo University Hospital). This study has been supported by The Foundation Dam Feedback Study to the project' A key to health in COPD' (link: Nøkkelen til helse for personer med KOLS-Stiftelsen Dam, project number 2017/ FO147263 Data availability The transcripted interview data used to support the findings of this study are restricted by the Regional Ethics committee, East Norway in order to protect patient privacy. Data are available from PI Christine R Borge, mail: c.r.borge@medisin.uio.no for researchers who meet the criteria for access to confidential data. Declarations Ethics approval and consent to participate The study is in accordance with the Declaration of Helsinki and the Health Research Act. It was approved by the ethical committee of South East, Oslo, Norway (2016/12981/REK sør-øst), and research data protection officers at Lovisenberg Diaconal Hospital, and the RCT, on which this study is based, is registered in the clinical trials database. All participants received information about the purpose of the study, voluntary participation, the option to withdraw at any time, and confidentiality for all data. Participants signed written informed consent before participating in the interviews. The written interviews and audio recordings were stored in the research database of the main research hospital. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. World-Health-Organization. World health statistics 2021: monitoring health for the SDGs, sustainable development goals. Geneva: World Health Organization; 2021. 2. World Health Organisation. Health promotion glossary of terms 2021. Geneva: World Health Organisation; 2021. Available from: https://apps.who.int/iris/handle/10665/350161 3. Osborne RH Elmer S Hawkins M Cheng CC Batterham RW Dias S Health literacy development is central to the prevention and control of non-communicable diseases BMJ Glob Health 2022 7 12 e010362 10.1136/bmjgh-2022-010362 36460323 PMC9723891 Osborne RH, Elmer S, Hawkins M, Cheng CC, Batterham RW, Dias S, et al. Health literacy development is central to the prevention and control of non-communicable diseases. BMJ Glob Health. 2022;7(12):e010362. 36460323 10.1136/bmjgh-2022-010362 PMC9723891 4. Safiri S Carson-Chahhoud K Noori M Nejadghaderi SA Sullman MJM AhmadianHeris J Burden of chronic obstructive pulmonary disease and its attributable risk factors in 204 countries and territories, 1990–2019: results from the Global Burden of Disease Study 2019 BMJ 2022 378 e069679 10.1136/bmj-2021-069679 35896191 PMC9326843 Safiri S, Carson-Chahhoud K, Noori M, Nejadghaderi SA, Sullman MJM, AhmadianHeris J, et al. Burden of chronic obstructive pulmonary disease and its attributable risk factors in 204 countries and territories, 1990–2019: results from the Global Burden of Disease Study 2019. BMJ. 2022;378:e069679. 35896191 10.1136/bmj-2021-069679 PMC9326843 5. Waatevik M Skorge TD Omenaas E Bakke PS Gulsvik A Johannessen A Increased prevalence of chronic obstructive pulmonary disease in a general population Respir Med 2013 107 7 1037 1045 10.1016/j.rmed.2013.04.008 23680166 Waatevik M, Skorge TD, Omenaas E, Bakke PS, Gulsvik A, Johannessen A. Increased prevalence of chronic obstructive pulmonary disease in a general population. Respir Med. 2013;107(7):1037–45. 23680166 10.1016/j.rmed.2013.04.008 6. GOLD. Global initiative for chronic obstructive lung disease. Global strategy for the diagnosis, managment, and prevention of chronic obstructive pulmonary disease. 2023. 7. Elixhauser A, Au DH, Podulka J. Readmissions for chronic obstructive pulmonary disease, 2008. Rockville: Agency for Healthcare Research and Quality; 2006. 22049571 8. Larsen MH Mengshoel AM Andersen MH Borge CR Ahlsen B Dahl KG \"A bit of everything\": health literacy interventions in chronic conditions - a systematic review Patient Educ Couns 2022 105 10 2999 3016 10.1016/j.pec.2022.05.008 35641366 Larsen MH, Mengshoel AM, Andersen MH, Borge CR, Ahlsen B, Dahl KG, et al. “A bit of everything”: health literacy interventions in chronic conditions - a systematic review. Patient Educ Couns. 2022;105(10):2999–3016. 35641366 10.1016/j.pec.2022.05.008 9. Borge CR Larsen MH Osborne RH Engebretsen E Andersen MH Holter IA How to co-design a health literacy-informed intervention based on a needs assessment study in chronic obstructive pulmonary disease BMJ Open 2022 12 10 e063022 10.1136/bmjopen-2022-063022 36302571 PMC9621159 Borge CR, Larsen MH, Osborne RH, Engebretsen E, Andersen MH, Holter IA, et al. How to co-design a health literacy-informed intervention based on a needs assessment study in chronic obstructive pulmonary disease. BMJ Open. 2022;12(10):e063022. 36302571 10.1136/bmjopen-2022-063022 PMC9621159 10. Wahl AK Osborne RH Larsen MH Andersen MH Holter IA Borge CR Exploring health literacy needs in chronic obstructive pulmonary disease (COPD): associations between demographic, clinical variables, psychological well-being and health literacy Heart Lung 2021 50 3 417 424 10.1016/j.hrtlng.2021.02.007 33618148 Wahl AK, Osborne RH, Larsen MH, Andersen MH, Holter IA, Borge CR. Exploring health literacy needs in chronic obstructive pulmonary disease (COPD): associations between demographic, clinical variables, psychological well-being and health literacy. Heart Lung. 2021;50(3):417–24. 33618148 10.1016/j.hrtlng.2021.02.007 11. Borge CR Larsen MH Osborne RH Engebretsen E Andersen MH Holter IA Exploring patients’ and health professionals’ perspectives on health literacy needs in the context of chronic obstructive pulmonary disease Chronic Illn 2022 18 3 549 561 10.1177/1742395321999441 33705224 Borge CR, Larsen MH, Osborne RH, Engebretsen E, Andersen MH, Holter IA, et al. Exploring patients’ and health professionals’ perspectives on health literacy needs in the context of chronic obstructive pulmonary disease. Chronic Illn. 2022;18(3):549–61. 33705224 10.1177/1742395321999441 12. Beauchamp A Batterham RW Dodson S Astbury B Elsworth GR McPhee C Systematic development and implementation of interventions to OPtimise Health Literacy and Access (Ophelia) BMC Public Health 2017 17 1 230 10.1186/s12889-017-4147-5 28253883 PMC5335493 Beauchamp A, Batterham RW, Dodson S, Astbury B, Elsworth GR, McPhee C, et al. Systematic development and implementation of interventions to OPtimise Health Literacy and Access (Ophelia). BMC Public Health. 2017;17(1):230. 28253883 10.1186/s12889-017-4147-5 PMC5335493 13. Jawahar Z, Elmer S, Hawkins M, Osborne RH. Application of the optimizing health literacy and access (Ophelia) process in partnership with a refugee community in Australia: study protocol. Front Public Health. 2023;11:1112538. 10.3389/fpubh.2023.1112538 PMC9989023 36895685 14. Tan AL, Co SAL, Modina CAEM, Espinosa CIM, Fowler KC, Wong JQ. Using the Ophelia (Optimising Health Literacy and Access to Health Services) process as a practical tool for health promotion program delivery in various Philippine communities. Health Promot J Austr. 2023;34(4):910–22. 10.1002/hpja.701 36746622 15. World Health Organization. Regional Office for E, Bakker MM, Putrik P, Aaby A, Debussche X, Morrissey J, et al. Acting together – WHO National Health Literacy Demonstration Projects (NHLDPs) address health literacy needs in the European Region. Public Health Panorama. 2019;5(2–3):123–329. 16. Skivington K Matthews L Simpson SA Craig P Baird J Blazeby JM A new framework for developing and evaluating complex interventions: update of Medical Research Council guidance BMJ 2021 374 n2061 10.1136/bmj.n2061 34593508 PMC8482308 Skivington K, Matthews L, Simpson SA, Craig P, Baird J, Blazeby JM, et al. A new framework for developing and evaluating complex interventions: update of Medical Research Council guidance. BMJ. 2021;374:n2061. 34593508 10.1136/bmj.n2061 PMC8482308 17. Sekhon M Cartwright M Francis JJ Acceptability of healthcare interventions: an overview of reviews and development of a theoretical framework BMC Health Serv Res 2017 17 1 13 10.1186/s12913-017-2031-8 28126032 PMC5267473 Sekhon M, Cartwright M, Francis JJ. Acceptability of healthcare interventions: an overview of reviews and development of a theoretical framework. BMC Health Serv Res. 2017;17:1–13. 28126032 10.1186/s12913-017-2031-8 PMC5267473 18. Borge CR, Larsen MH, Osborne RH, Aas E, Kolle IT, Reinertsen R, et al. Impacts of a health literacy-informed intervention in people with chronic obstructive pulmonary disease (COPD) on hospitalization, health literacy, self-management, quality of life, and health costs–a randomized controlled trial. Patient Educ Counsel. 2024;123:108220. 10.1016/j.pec.2024.108220 38458089 19. Tong A Sainsbury P Craig J Consolidated criteria for reporting qualitative research (COREQ): a 32-item checklist for interviews and focus groups Int J Qual Health Care 2007 19 6 349 357 10.1093/intqhc/mzm042 17872937 Tong A, Sainsbury P, Craig J. Consolidated criteria for reporting qualitative research (COREQ): a 32-item checklist for interviews and focus groups. Int J Qual Health Care. 2007;19(6):349–57. 17872937 10.1093/intqhc/mzm042 20. Ownby RL Purcell D Thomas-Purcell K Simonson M Liamputtong P Mobile health literacy interventions and health disparities reduction Handbook of concepts in health, health behaviour and environmental health 2025 Singapore Springer Nature Singapore 1 24 Ownby RL, Purcell D, Thomas-Purcell K, Simonson M. Mobile health literacy interventions and health disparities reduction. In: Liamputtong P, editor. Handbook of concepts in health, health behaviour and environmental health. Singapore: Springer Nature Singapore; 2025. p. 1–24. 21. Braun V, Clarke V. Thematic analysis. 2012. 22. Jackson K, Bazeley P. Qualitative data analysis with NVivo. Thousand Oaks: SAGE publications Inc.; 2019. p. 1–376. 23. Braun V Clarke V Conceptual and design thinking for thematic analysis Qual Psychol 2022 9 1 3 10.1037/qup0000196 Braun V, Clarke V. Conceptual and design thinking for thematic analysis. Qual Psychol. 2022;9(1):3. 24. Lincoln YS, Guba EG. Naturalistic inquiry. Thousands Oaks: Sage; 1985. p. 75. 25. Patton MQ. Qualitative research & evaluation methods: Integrating theory and practice. Thousand Oaks: Sage Publications; 2014. 26. Braun V, Clarke V. Thematic analysis: a practical guide. 2021. 27. Rehman AU Muhammad SA Tasleem Z Alsaedi A Dar M Iqbal MO Humanistic and socioeconomic burden of COPD patients and their caregivers in Malaysia Sci Rep 2021 11 1 22598 10.1038/s41598-021-01551-5 34799609 PMC8604899 Rehman AU, Muhammad SA, Tasleem Z, Alsaedi A, Dar M, Iqbal MO, et al. Humanistic and socioeconomic burden of COPD patients and their caregivers in Malaysia. Sci Rep. 2021;11(1):22598. 34799609 10.1038/s41598-021-01551-5 PMC8604899 28. Buttery SC Zysman M Vikjord SAA Hopkinson NS Jenkins C Vanfleteren LEGW Contemporary perspectives in COPD: Patient burden, the role of gender and trajectories of multimorbidity Respirology 2021 26 5 419 441 10.1111/resp.14032 33751727 PMC9011688 Buttery SC, Zysman M, Vikjord SAA, Hopkinson NS, Jenkins C, Vanfleteren LEGW. Contemporary perspectives in COPD: Patient burden, the role of gender and trajectories of multimorbidity. Respirology. 2021;26(5):419–41. 33751727 10.1111/resp.14150_842 PMC9011688 29. Russell S Ogunbayo OJ Newham JJ Heslop-Marshall K Netts P Hanratty B Qualitative systematic review of barriers and facilitators to self-management of chronic obstructive pulmonary disease: views of patients and healthcare professionals NPJ Prim Care Respir Med 2018 28 1 2 10.1038/s41533-017-0069-z 29343739 PMC5772437 Russell S, Ogunbayo OJ, Newham JJ, Heslop-Marshall K, Netts P, Hanratty B, et al. Qualitative systematic review of barriers and facilitators to self-management of chronic obstructive pulmonary disease: views of patients and healthcare professionals. NPJ Prim Care Respir Med. 2018;28(1):2. 29343739 10.1038/s41533-017-0069-z PMC5772437 30. Sheridan N Kenealy T Salmon E Rea H Raphael D Schmidt-Busby J Helplessness, self-blame and faith may impact on self management in COPD: a qualitative study Prim Care Respir J 2011 20 3 307 314 10.4104/pcrj.2011.00035 21509413 PMC6549848 Sheridan N, Kenealy T, Salmon E, Rea H, Raphael D, Schmidt-Busby J. Helplessness, self-blame and faith may impact on self management in COPD: a qualitative study. Prim Care Respir J. 2011;20(3):307–14. 21509413 10.4104/pcrj.2011.00035 PMC6549848 31. Hilary P Marilyn K Scott AM Allison W Pamela L Mike P Living and dying with severe chronic obstructive pulmonary disease: multi-perspective longitudinal qualitative study BMJ Support Palliat Care 2011 1 2 174 10.1136/bmjspcare.d142rep 24653231 Hilary P, Marilyn K, Scott AM, Allison W, Pamela L, Mike P, et al. Living and dying with severe chronic obstructive pulmonary disease: multi-perspective longitudinal qualitative study. BMJ Support Palliat Care. 2011;1(2):174. 10.1136/bmjspcare.d142rep 24653231 32. Naderloo H Vafadar Z Eslaminejad A Ebadi A Effects of motivational interviewing on treatment adherence among patients with chronic obstructive pulmonary disease: a randomized controlled clinical trial Tanaffos 2018 17 4 241 249 31143214 PMC6534798 Naderloo H, Vafadar Z, Eslaminejad A, Ebadi A. Effects of motivational interviewing on treatment adherence among patients with chronic obstructive pulmonary disease: a randomized controlled clinical trial. Tanaffos. 2018;17(4):241–9. 31143214 PMC6534798 33. Wang C Liu K Sun X Yin Y Tang T Effectiveness of motivational interviewing among patients with COPD: a systematic review with meta-analysis and trial sequential analysis of randomized controlled trials Patient Educ Couns 2022 105 11 3174 3185 10.1016/j.pec.2022.07.019 35927110 Wang C, Liu K, Sun X, Yin Y, Tang T. Effectiveness of motivational interviewing among patients with COPD: a systematic review with meta-analysis and trial sequential analysis of randomized controlled trials. Patient Educ Couns. 2022;105(11):3174–85. 35927110 10.1016/j.pec.2022.07.019 34. Zwakman M Weldam SWM Vervoort S Lammers JJ Schuurmans MJ Patients' perspectives on the COPD-GRIP intervention, a new nursing care intervention for COPD BMC Fam Pract 2019 20 1 78 10.1186/s12875-019-0957-0 31182032 PMC6558823 Zwakman M, Weldam SWM, Vervoort S, Lammers JJ, Schuurmans MJ. Patients’ perspectives on the COPD-GRIP intervention, a new nursing care intervention for COPD. BMC Fam Pract. 2019;20(1):78. 31182032 10.1186/s12875-019-0957-0 PMC6558823 35. Prochaska JO, DiClemente CC. Toward a comprehensive model of change. Treating addictive behaviors: processes of change. 1986. pp. 3–27. 36 Harrison SL Robertson N Apps L Steiner CM Morgan MD Singh SJ “We are not worthy”–understanding why patients decline pulmonary rehabilitation following an acute exacerbation of COPD Disabil Rehabil 2015 37 9 750 6 10.3109/09638288.2014.939770 25009949 Harrison SL, Robertson N, Apps L, Steiner CM, Morgan MD, Singh SJ. “We are not worthy”–understanding why patients decline pulmonary rehabilitation following an acute exacerbation of COPD. Disabil Rehabil. 2015;37(9):750–6. 25009949 10.3109/09638288.2014.939770 37. Robinson K Lucas E van den Dolder P Halcomb E Living with chronic obstructive pulmonary disease: the stories of frequent attenders to the Emergency Department J Clin Nurs 2018 27 1–2 48 56 10.1111/jocn.13842 28382725 Robinson K, Lucas E, van den Dolder P, Halcomb E. Living with chronic obstructive pulmonary disease: the stories of frequent attenders to the Emergency Department. J Clin Nurs. 2018;27(1–2):48–56. 28382725 10.1111/jocn.13842 38. Fitzsimmons DA Thompson J Bentley CL Mountain GA Comparison of patient perceptions of Telehealth-supported and specialist nursing interventions for early stage COPD: a qualitative study BMC Health Serv Res 2016 16 1 420 10.1186/s12913-016-1623-z 27549751 PMC4994236 Fitzsimmons DA, Thompson J, Bentley CL, Mountain GA. Comparison of patient perceptions of Telehealth-supported and specialist nursing interventions for early stage COPD: a qualitative study. BMC Health Serv Res. 2016;16(1):420. 27549751 10.1186/s12913-016-1623-z PMC4994236 39. Sulaiman I Cushen B Greene G Seheult J Seow D Rawat F Objective assessment of adherence to inhalers by patients with chronic obstructive pulmonary disease Am J Respir Crit Care Med 2017 195 10 1333 1343 10.1164/rccm.201604-0733OC 27409253 Sulaiman I, Cushen B, Greene G, Seheult J, Seow D, Rawat F, et al. Objective assessment of adherence to inhalers by patients with chronic obstructive pulmonary disease. Am J Respir Crit Care Med. 2017;195(10):1333–43. 27409253 10.1164/rccm.201604-0733OC 40. Cushen B Madden A Long D Whelan Y O’Brien ME Carroll D Integrating hospital and community care: using a community virtual ward model to deliver combined specialist and generalist care to patients with severe chronic respiratory disease in their homes Irish J Med Sci (1971 -) 2022 191 2 615 21 10.1007/s11845-021-02633-z PMC8100740 33956325 Cushen B, Madden A, Long D, Whelan Y, O’Brien ME, Carroll D, et al. Integrating hospital and community care: using a community virtual ward model to deliver combined specialist and generalist care to patients with severe chronic respiratory disease in their homes. Irish J Med Sci (1971 -). 2022;191(2):615–21. 10.1007/s11845-021-02633-z PMC8100740 33956325 41. Andersen IC Thomsen TG Bruun P Bødtger U Hounsgaard L The experience of being a participant in one's own care at discharge and at home, following a severe acute exacerbation in chronic obstructive pulmonary disease: a longitudinal study Int J Qual Stud Health Well-being 2017 12 1 1371994 10.1080/17482631.2017.1371994 28875771 PMC5613917 Andersen IC, Thomsen TG, Bruun P, Bødtger U, Hounsgaard L. The experience of being a participant in one’s own care at discharge and at home, following a severe acute exacerbation in chronic obstructive pulmonary disease: a longitudinal study. Int J Qual Stud Health Well-being. 2017;12(1):1371994. 28875771 10.1080/17482631.2017.1371994 PMC5613917 42. Korpershoek Y Vervoort S Nijssen L Trappenburg J Schuurmans MJ Factors influencing exacerbation-related self-management in patients with COPD: a qualitative study Int J Chron Obstruct Pulmon Dis 2016 11 2977 2990 10.2147/COPD.S116196 27932877 PMC5135062 Korpershoek Y, Vervoort S, Nijssen L, Trappenburg J, Schuurmans MJ. Factors influencing exacerbation-related self-management in patients with COPD: a qualitative study. Int J Chron Obstruct Pulmon Dis. 2016;11:2977–90. 27932877 10.2147/COPD.S116196 PMC5135062 43. Malterud K Siersma VD Guassora AD Sample size in qualitative interview studies: guided by information power Qual Health Res 2016 26 13 1753 1760 10.1177/1049732315617444 26613970 Malterud K, Siersma VD, Guassora AD. Sample size in qualitative interview studies: guided by information power. Qual Health Res. 2016;26(13):1753–60. 10.1177/1049732315617444. 26613970 10.1177/1049732315617444 ",
  "metadata": {
    "Title of this paper": "Sample size in qualitative interview studies: guided by information power",
    "Journal it was published in:": "BMC Health Services Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482015/"
  }
}