{
  "title": "Paper_378",
  "abstract": "pmc Biomark Res Biomark Res 2201 biomarkerres Biomarker Research 2050-7771 BMC PMC12486790 PMC12486790.1 12486790 12486790 41035074 10.1186/s40364-025-00811-0 811 1 Review Single-cell sequencing technology in renal cancer: insights into tumor biology and clinical application Zhang Hanzhong 1 2 Liu Ying 1 Liu Wenqiang 1 Lin Anqi 2 3 Fang Yu 1 Qu Le 4 Zhang Xu 5 Luo Peng luopeng@smu.edu.cn 2 3 Wang Linhui wanglinhui@smmu.edu.cn 1 Jiang Aimin czjiangaimin@smmu.edu.cn 1 1 https://ror.org/02bjs0p66 grid.411525.6 0000 0004 0369 1599 Department of Urology, Changhai Hospital, Naval Medical University (Second Military Medical University), 2 https://ror.org/059gcgy73 grid.89957.3a 0000 0000 9255 8984 Donghai County Peoples Hospital, Jiangnan University Smart Healthcare Joint Laboratory, Donghai County People’s Hospital (Affiliated Kangda College of Nanjing Medical University), 3 https://ror.org/02mhxa927 grid.417404.2 0000 0004 1771 3058 Department of Oncology, Zhujiang Hospital, Southern Medical University, 4 https://ror.org/01rxvg760 grid.41156.37 0000 0001 2314 964X Department of Urology, Affiliated Jinling Hospital, Medical School of Nanjing University, 5 https://ror.org/04gw3ra78 grid.414252.4 0000 0004 1761 8894 Department of Urology, Chinese PLA General Hospital, 1 10 2025 2025 13 478333 121 7 2 2025 16 7 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ Renal cancer, particularly clear cell renal cell carcinoma (ccRCC), is characterized by significant intratumoral heterogeneity, which poses challenges for diagnosis and treatment. Single-cell sequencing (SCS) provides unprecedented insights into the cellular landscape of renal cancer, allowing for detailed characterization of tumor heterogeneity at the single-cell level. This review highlights how SCS has been instrumental in elucidating the origins of different renal cancer subtypes, understanding mechanisms of tumor initiation and progression, and dissecting the complex tumor microenvironment (TME). It discusses the identification of novel biomarkers and therapeutic targets, as well as the potential of SCS to inform personalized treatment strategies. The review also explores the integration of SCS with spatial omics technologies, which enhances the understanding of cellular interactions within their spatial context. Moreover, it addresses the challenges and future directions in applying SCS to clinical practice, emphasizing its significance in advancing renal cancer biology and improving clinical interventions. Keywords Renal cell carcinoma (RCC) Single-cell sequencing (SCS) Single-cell multi-omics Spatial transcriptomics (ST) Tumor microenvironment (TME) Tumor heterogeneity Personalized medicine https://doi.org/10.13039/501100001809 National Natural Science Foundation of China 81902560 81902560 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Yumed Inc. and BioMed Central Ltd., part of Springer Nature 2025 Introduction Renal cancer is a significant global health concern, with a high prevalence among various malignancies. In 2022, there were approximately 434,419 new cases of kidney cancer worldwide [ 1 2 3 4 Traditional renal cancer research and diagnostics have been constrained by their inability to fully encompass the heterogeneity of the disease. Bulk sequencing methods, which have been the cornerstone of genetic analysis, have often failed to capture the nuance of cellular heterogeneity characteristic of renal cancer [ 5 6 7 8 13 14 15 20 This review aims to provide a comprehensive overview of the current state and cutting-edge advancements of SCS technology in renal cancer research. It will highlight the fundamental processes underlying SCS and recent breakthroughs that have advanced our understanding of cellular and molecular intricacies in renal cancer. The review will explore the applications of SCS in renal cancer research and emphasize pivotal findings, including the origins of different renal cancer subtypes, mechanisms of initiation and progression, the comprehensive panorama of the TME, and the complexity of tumor heterogeneity. Furthermore, it will discuss the prospects of SCS in shaping clinical practice, emphasizing its potential to inform personalized treatment strategies, facilitate the development of targeted therapies, and improve prognostication. Ultimately, this review underscores the indispensability of SCS in advancing renal cancer biology and its significance in the quest for more effective and precise clinical interventions. Principles and advances in single-cell sequencing technology Principles of single-cell sequencing technology SCS is a cutting-edge methodology that allows for the analysis of individual cells at the molecular level, including gene expression profiles and epigenetic signatures [ 6 10 21 22 23 24 The first step in SCS involves isolating individual cells from complex tissue samples. Common methods for cell isolation include Fluorescence-Activated Cell Sorting (FACS), microfluidic approaches, and flow cytometry. These techniques efficiently isolate single cells, which is essential for subsequent molecular analysis [ 25 28 29 30 31 29 30 32 33 34 22 35 1 Fig. 1 Principles of single-cell sequencing technology. Single-cell sequencing (SCS) involves a series of methodical steps that begin with the isolation of individual cells from heterogeneous tissue samples. Each cell is then barcoded to track its origin, and a library is constructed by converting RNA into complementary DNA (cDNA) through amplification. The subsequent sequencing is followed by a rigorous data analysis phase, which includes noise reduction, duplicate removal, and the segregation of cell types. The culmination of this process is the visualization of the data, providing a detailed map of cellular gene expression, functional status, and heterogeneity. This figure was created based on the tools provided by Figuredraw.com Evolution of single-cell sequencing technology Initially, life sciences research predominantly relied on the analysis of cell populations or tissue samples. Traditional sequencing methods, such as DNA sequencing and bulk RNA sequencing, were applied to these samples [ 36 39 40 41 35 42 43 44 The application of SCS in cancer research has been particularly prominent. For instance, since 2016, Tirosh et al. have utilized scRNA-seq to reveal the multicellular ecosystem of metastatic melanoma, demonstrating the immense potential of this technology in cancer immunology research [ 45 10 Recent years have witnessed continuous progress in SCS technologies. For example, strategies such as barcoding, multiplex barcoding, and CRISPR barcoding have enabled mitochondrial tracking at the single-cell resolution, methods that have been validated in animal development and stem cell research [ 46 10 47 Advancements in single-cell sequencing technology With ongoing technological advancements, SCS has made significant strides in addressing challenges such as complex data processing, high costs, and sequencing accuracy. For instance, droplet-based technologies and high-throughput SCS platforms, including Drop-seq, InDrop, CEL-seq, and the 10X Genomics Chromium system, have been employed to reduce costs [ 48 51 52 57 The development and application of more efficient computational methods, such as clustering algorithms, anomaly detection algorithms, self-supervised learning, and deep learning have improved the accuracy and efficiency of data analysis [ 58 64 65 69 70 75 Advancements in single-cell multi-omics In recent years, SCS has made significant strides, expanding its scope beyond gene expression analysis to include the study of epigenetic characteristics at the single-cell level, such as chromatin structure and regulatory elements. Techniques like single-cell chromatin accessibility (scATAC-seq) are now commonly used. And over the past few years, advancements by various research groups have enabled the examination of histone modifications and transcription factor (TF) interactions with DNA at a resolution that captures individual cell details. Notably, the laboratories of Henikoff and Castelo-Branco have employed the 10X Genomics scATAC-seq platform to pioneer a single-cell CUT&Tag technique, which facilitates the dissection of histone mark patterns within solitary cells. The emergence of multimodal chromatin profiling techniques, including nanoCT and Nanobody-tethered transposition (NTT)-seq [ 76 77 86 87 88 93 94 97 98 103 104 105 108 74 96 109 110 Advancements in the integration of spatial omics and single-cell sequencing While SCS can elucidate the genetic, transcriptional, and proteomic characteristics of cells at the individual level, it lacks spatial context, which may lead to incomplete information and potentially misleading conclusions. The integration of SCS with spatial omics technologies adeptly addresses this limitation, providing a comprehensive view of cellular heterogeneity within its spatial framework. This combined approach allows researchers to discern the spatial relationships and interactions among cells, thereby enhancing the understanding of cellular function and organization in health and disease. Spatial transcriptomics (ST) technology, through high-resolution imaging and analysis, is capable of revealing the molecular dynamics between cells and within tissues, allowing for precise analysis of cellular transcriptional profiles. Moreover, it quantifies and visualizes the heterogeneity of the tumor microenvironment (TME) [ 111 112 113 114 115 120 Single-cell sequencing technology advances renal cancer research Exploring the origins of renal cancer epithelial cells with single-cell sequencing technology Clear cell renal cell carcinoma Exploring the origins of tumor cells is a crucial step in oncology research, as it provides insights into the development of cancer. Recent studies using single-cell transcriptomic analysis have shed light on the possible origin of ccRCC from proximal tubule (PT) cells within the kidney [ 121 122 123 124 125 129 130 131 132 These studies highlight the complexity of ccRCC origins, with evidence supporting both PT cells and CSCs as potential cellular sources. Further investigation is needed to fully elucidate the precise mechanisms underlying ccRCC development and the contributions of different cell populations in tumor initiation and progression. Papillary renal cell carcinoma Single-cell transcriptomic analysis of renal tumors has provided insights into the origin of type 1 papillary renal cell carcinoma (pRCC) cells. Similar to ccRCC, pRCC cells have been found to share similarities with PT cells, suggesting a potential common origin for both pRCC and ccRCC from PT cells [ 121 133 121 134 135 136 Chromophobe renal cell carcinoma Chromophobe renal cell carcinoma (chrRCC) is the second most common subtype of non-clear cell renal cell carcinoma (nccRCC), and it is believed to have a distinct cellular origin compared to ccRCC [ 137 123 122 134 124 138 Wilms tumor Analyses of scRNA-seq data from Wilms tumors have uncovered a resemblance between these malignant cells (MCs) and their normal fetal counterparts, such as the cells of the ureteric bud and nephrogenic vesicles, which are part of the developing kidney. The presence of distinct Wilms tumor cell populations that mirror these fetal cell types suggests an evolutionary lineage from healthy fetal cells [ 121 139 133 140 141 Other rare subtypes of renal cell carcinoma Through multi-omics analysis, it has been identified that translocation renal cell carcinoma (TRCC) and eosinophilic solid and cystic renal cell carcinoma (ESCRCC) most likely originate from PT cells, while renal oncocytoma (RO) shows the highest similarity to ICs, suggesting an origin from the distal nephron. In renal angiomyolipoma (AML), tumor cell subpopulations resemble vSMCs and ECs [ 134 142 143 144 145 146 Single-cell sequencing technology contributes to a deeper understanding of the mechanisms underlying the initiation and progression of renal cancer Single-cell sequencing technology reveals renal cancer epithelial-mesenchymal transition and metastasis dynamics The disruption of the epithelial-mesenchymal transition (EMT) process plays a significant role in cancer progression, enhancing the invasive and metastatic capabilities of cancer cells [ 147 148 149 150 123 TAGLN KRT19 MALAT1 SOD2 151 152 FN1 VIM laminins A3 C3 B3 JUP 153 154 131 155 156 157 161 162 163 164 The remodeling of the tumor ECM is closely associated with cancer invasion, metastasis, poor prognosis, and angiogenesis [ 165 174 175 176 177 In nccRCC, scRNA-seq has provided insights into the underlying mechanisms. In RMC, RMC cells exhibit a gradient of EMT characteristics, encompassing both epithelial-like and mesenchymal-like cell subpopulations with distinct gene expression profiles and functions. Furthermore, the loss of transcription factor CP2-like 1 (TFCP2L1) and the activation of myelocytomatosis oncogene ( MYC 144 145 Single-cell sequencing technology deciphers the metabolic reprogramming in renal cancer Metabolic reprogramming is a characteristic feature of renal cancer [ 178 182 183 185 186 189 190 132 191 192 131 193 194 195 196 198 199 200 205 196 206 199 207 208 192 209 210 Metabolic reprogramming also plays a crucial role in the progression of nccRCC [ 180 211 212 134 213 Single-cell sequencing technology dissects the immune evasion mechanisms in renal cancer Tumor cells evade immune surveillance through various mechanisms, which is a significant factor in cancer progression [ 214 221 210 222 224 Detailed research on the TIME of ccRCC using scRNA-seq and scTCR-seq has revealed progressive exhaustion of CD8 + T cells and M2 polarization of macrophages during disease progression. There is an interaction between M2-like macrophages and exhausted CD8 + T cells. M2-like macrophages express multiple ligands, including poliovirus receptor (PVR), CD80, CD86, Galectin-9 (LGALS9), Programmed cell death-ligand 1 (PD-L1), and nectin cell adhesion molecule 2 (NECTIN2), associated with T cell inhibition. Exhausted CD8 + T cells express factors that promote M2-like polarization, such as macrophage migration inhibitory factor (MIF) and colony-stimulating factor-1 (CSF1). This creates a positive feedback interaction loop leading to sustained mutual suppression of macrophage and T cell functions within the TIME, potentially causing immune evasion in ccRCC [ 225 ( 226 227 228 231 232 233 236 scRNA-seq analysis suggests that MCs modulate immune functions by highly expressing SPP1, which acts on the receptor integrin β1 (ITGB1) of NK cells and integrin α4 (ITGA4) of cytotoxic T lymphocyte (CTL)−1 cells. MCs express high levels of CD70, which interacts with the receptor CD27 on CTL-1 cells, inducing T cell exhaustion and apoptosis, potentially facilitating immune evasion [ 175 237 239 240 241 130 242 2 Fig. 2 The immune evasion mechanisms in renal cancer revealed by single-cell sequencing. A B C D Single-cell sequencing technology depicts the landscape of gene expression regulation in renal cancer Elucidating the epigenetic regulation landscape is crucial for understanding the biology of tumors, uncovering their mechanisms of development and progression, and identifying potential therapeutic strategies in cancer research [ 243 249 SLC38A8 MAFA TUBB3 VEGFA) EGLN3 TP53 GDF15) C228T C250T TERT 250 251 AHNAK) 252 253 HIF1 AHNAK 254 HPSE2) ATRNL1) IGSF21) 255 256 257 VHL 222 258 266 RASSF1A 267 272 VHL RASSF1A VHL RASSF1A RASSF1A 273 274 275 ENL ENL 276 ENL TFs typically exert control over gene expression at the transcriptional level, and alterations in their regulatory networks have significant implications in the onset and progression of cancers [ 277 282 283 287 288 289 255 213 These studies shed light on the importance of epigenetic regulations, TFs, and their networks in renal cancer development and progression, providing valuable insights for understanding the underlying biology and potential therapeutic strategies. Single-cell sequencing technology decodes the complex cell-cell communication networks in renal cancer The complex cell–cell communication within the TME is closely associated with tumor development and therapeutic response [ 290 294 295 299 150 300 288 130 (VHL) VHL 301 In addition to immune cells, renal cancer cells engage in complex intercellular communication with stromal cells. For example, ccRCC.mes cells induce the transition of pericytes to myofibroblasts through secretion of transforming growth factor – β (TGF-β), IL6-IL6 receptor (R), and growth arrest-specific protein 6 (GAS6) – AXL receptor tyrosine kinase (AXL), as well as pyruvate dehydrogenase kinase (PDK)1-PDK2. Reciprocally, myofibroblasts promote EMT in ccRCC.mes cells through secretion of TGF-β, GAS6-AXL, and CXCL12-CXCR4 pathways, forming positive feedback signaling network [ 131 199 Additionally, significant cell–cell communication exists among MCs in ccRCC. Analysis through scRNA-seq has revealed increased expression of angiogenin (ANG) and its receptors EGFR and Plexin-B2 (PLXNB2) in MCs of ccRCC. Notably, the ANG signaling pathway downregulates inflammatory responses and promotes the proliferation of MCs [ 302 303 3 Fig. 3 The complex cell–cell communication networks in renal cancer illuminated by single-cell sequencing. A B C D Single-cell sequencing technology illuminates the intricate panorama of tumor immune microenvironment in renal cancer Numerous studies have demonstrated that in the renal cancer TME, the proportion of immune cells significantly outweighs that of tumor cells, underscoring the critical importance of the TIME in renal cancer [ 255 288 CD8 + T cell Research indicates that CD8 + T cells constitute a predominant immune cell population within the RCC TIME, accounting for an average of 51%, and play a crucial role in the TIME [ 304 305 306 307 308 309 175 254 225 207 225 254 225 310 150 207 TCF7 ENTPD1 311 288 131 195 240 312 313 314 316 313 317 318 319 213 242 320 225 CD8 + T cells play a crucial role in cancer immunotherapy [ 321 327 328 329 226 330 331 336 337 CD8 + T cells display heterogeneity across various types of cancer, highlighting the importance of understanding their diversity in cancer research [ 338 344 304 255 150 288 131 130 176 257 123 190 345 CD4 + T cell CD4 + T cells exhibit a spectrum of heterogeneity within the TME in various cancers [ 346 349 150 329 304 LEF1 SELL IL7R IL2 IL21 313 225 350 355 356 357 Tregs, a subset of CD4 + T cells, often play an immunosuppressive role within the TME across various types of cancer and their activity is associated with cancer progression [ 358 359 360 362 309 227 363 227 195 304 MECRGs MECRGs 241 364 176 317 328 330 365 366 329 175 367 123 Macrophage It has been reported that TAMs play a significant role in various cancers progression [ 368 370 371 375 376 377 378 226 328 ISG 329 379 365 156 Macrophages in RCC exhibit pronounced heterogeneity. Multi-region scRNA-seq has identified four distinct TAM subgroups in ccRCC, each with unique molecular profiles and immune phenotypes. The distribution of these TAM subgroups across patients and tissue regions correlates with the TIME and pathological features. These TAM subgroups interact with CD8 + T cells, CD4 + T cells, and dendritic cells (DCs), forming a complex network that significantly influences the tumor immune status [ 329 304 195 207 380 IL1B IL23A CCL4 CCL3 CCL20 122 CD86 CSF1R) CD163 255 SPP1) (S100A) SEPP1 240 130 150 311 227 APOE 131 288 131 TREM2 SPP1 175 381 176 COL3A1 COL1A1 COL1A2 382 383 190 123 144 213 Macrophages within tumors are associated with the exhaustion of CD8 + T cells [ 312 384 385 225 121 386 388 NK cell NK cells constitute a significant component of the TIME and exert complex functions in both tumor suppression and promotion processes [ 389 393 175 150 195 227 394 ( 395 NK cells exhibit extensive interactions with other cells within the TIME [ 396 397 GZMB (PRF1) 225 The potential of NK cells in cancer immunotherapy has been increasingly recognized [ 398 404 226 Dendritic cell Dendritic cells (DCs) play a complex and multifaceted role in the TIME across various cancers, engaging in extensive interactions with other cellular components, thereby underscoring their significance in cancer progression [ 405 409 328 150 329 329 240 ( ( 225 DCs hold substantial promise in the field of tumor immunotherapy [ 410 415 226 330 416 Monocyte Monocytes are considered precursor cells of macrophages and are an integral part of the TIME in many cancers [ 417 421 150 225 329 288 422 (LYPD3) MHC-II 240 Chen et al.'s research reveals that intercellular communication molecules, such as C3, EGFR, and HAVCR2, play a crucial role in the differentiation process of monocytes. The expression changes of these molecules are closely associated with the infiltration status of monocytes, indicating that the functional state of monocytes within the TME is intimately connected to cell-to-cell communication in ccRCC [ 301 145 B cell B cells, as a major type of lymphocyte, play a complex role in the TIME, immunotherapy and targeted therapy, which is of great significance for cancer research [ 423 428 227 225 256 429 430 345 In the context of ICB therapy for renal cancer, scRNA-seq and other technologies have revealed a significant presence of B cells at baseline in responders compared to non-responders. However, this difference was not observed during the course of treatment. Notably, while there was a trend towards increased B cell numbers and GZMB expression in responders, these changes did not reach statistical significance in bulk RNA sequencing. This suggests that B cells may play a complex role in ICB therapy and further investigation is needed to understand their specific functions and mechanisms of action [ 330 In terms of targeted therapy, scRNA-seq analysis of ccRCC has revealed that genes associated with sorafenib resistance are significantly enriched in the marker genes of immune cells, such as macrophages, B cells, and T cells, while sensitive genes are enriched in the marker genes of MCs [ 156 431 These insights enhance our comprehension of the role and composition of B cells within the renal cancer TME and may inform the development of targeted immunotherapies, potentially leading to more personalized treatment strategies. Mast cell Although mast cells have been less studied in the TIME, they are still an important component of the TIME [ 432 436 437 KIT TPSAB1 288 438 195 Neutrophil Neutrophils are an integral part of the TIME and play a multifaceted role in various cancers and immunotherapy [ 439 445 446 176 447 4 Fig. 4 The intricate panorama of RCC TIME. In the TME of RCC, immune cells significantly outnumber tumor cells. Mapping the immune landscape of RCC is essential for deepening our understanding of the disease and for the development of therapeutic strategies. The immune microenvironment of RCC encompasses a variety of immune cells, with CD8+ T cells predominating, followed by NK cells, dendritic cells, monocytes, B cells, mast cells, and neutrophils. These immune cells do not exist in isolation but engage in complex interactions with other immune and tumor cells, creating an immunological niche that supports the growth and metastasis of RCC. This figure was created based on the tools provided by Figuredraw.com Single-cell sequencing technology provides a detailed view of the tumor matrix microenvironment in renal cancer Endothelial Cell ECs are a crucial component of the TME and play a significant role in tumor angiogenesis [ 448 452 256 150 121 195 EDNR)B VWF HSPG)2 122 ENPP2 ENPP2 207 453 130 454 123 345 175 PECAM)1 CDH)5 VWF 255 288 SOST NDUFA4L2 GJA5) ACKR1 CXCR4 176 LY6H) PGF) LOX) CHST1) 177 455 FOS JUND FOSB 190 438 213 Fibroblast Fibroblasts, as a significant component of the tumor stroma, have been increasingly recognized for their complex and critical roles in cancers [ 456 462 463 466 227 195 150 131 ( ( 467 468 345 (FAP) (LRRC)15 (FN)1 (TGFBI) (THY)1 175 207 469 470 Among RCC subtypes, CAFs show subtype-specific heterogeneity. Using scRNA-seq, Xu et al. identified seven CAF subgroups with unique transcriptional signatures, variably present in ccRCC, chrRCC, and pRCC. At the pathway level, CAFs exhibit significant metabolic and regulatory diversity. In ccRCC, CAFs and macrophages engage in bidirectional signaling, absent in chrRCC. Furthermore, fibroblasts in chrRCC lack interaction with other cell types [ 471 121 472 144 242 213 CAFs in RCC TME also participate in various crosstalk with other cells. For example, fibroblasts in ccRCC accumulate in the IM4 subtype, which is attributed to the enrichment of IGF1 + macrophages that promote their survival and migration [ 190 162 In terms of myofibroblasts, Shi et al. classified myofibroblasts into five subgroups: Myo1 (high heat shock protein expression, indicating stress), Myo2 (highly perivascular phenotype), Myo3 [actin gamma (ACTG)2 + fibroblast-associated], Myo4 (antigen-presenting phenotype), and Myo5 (CAF features). The perivascular-like Myo2 subgroup is more prevalent in PT and TT than in ART, possibly due to its role in tumor vasculature maturation and remodeling. Myofibroblasts in PT are enriched in TNFα response pathways, while those in TT are active in angiogenesis and ECM remodeling pathways, including EMT, collagen fiber organization, and ECM organization. In sunitinib-treated patients, higher Myo2 signature scores correlate with longer PFS, indicating Myo2 as a potential predictor of TKI response in ccRCC patients [ 176 CD44 MPZL1) MPZL1 199 177 Pericyte Pericytes, which surround microvessels and play a crucial role in vascular stability and function [ 473 477 478 482 RGS5 THY1 AXL KCNJ8 ACTA2 PLN) TAGLN RERGL 175 131 483 455 These findings highlight the heterogeneity and complex roles of pericytes in ccRCC, including their involvement in tumor angiogenesis, vascular remodeling, and interaction with other cellular components within the TME. Other stromal cell Mesangial cells, a specialized cell type located within the glomerulus, play a crucial role in the structure and function of the glomerulus, and their dysfunction is associated with the onset and progression of various kidney diseases [ 484 131 CD36 NDUFA4L2 REN 177 TPPP3 SPARCL1 PDGFRB 145 5 1 Fig. 5 The landscape of RCC tumor matrix environment. In the TME of RCC, stromal cells constitute a significant component, interacting with the immune microenvironment and tumor cells to form the TME. The matrix microenvironment includes a variety of cell types such as tumor-associated endothelial cells (TECs), cancer-associated fibroblasts (CAFs), pericytes, and vascular smooth muscle cells (vSMCs). These cells not only interact with each other but also have extensive connections with tumor cells, playing crucial roles in tumor angiogenesis, EMT, invasion, and metastasis in RCC. This figure was created based on the tools provided by Figuredraw.com Table 1 The panorama of the RCC TME, including TIME and matrix microenvironment. The TME of RCC comprises a variety of cell types, including immune cells, stromal cells, and tumor cells. These cells do not exist in isolation but engage in extensive interactions and connections, collectively forming a microenvironment conducive to the growth and progression of RCC. Single-cell resolution analysis provides a clearer and more precise understanding of the RCC TME, facilitating research on RCC and contributing to clinical treatment strategies Cell type Functions in the RCC TME Reference Immune cells CD8 + T cells  During the progression of RCC, CD8 + T cells undergo a transition from a functional to an exhausted state, characterized by a reduction in TCR diversity, decreased expression of cytotoxic genes, and an increasing expression of immune checkpoint molecules. Their metabolic activity initially increases and then declines, indicating a shift from an active to a dysfunctional state. The interaction of CD8 + T cells with tumor cells, TAMs, and Tregs contributes to this exhaustion process. The loss of CD8 + T cell function is associated with higher tumor grades, advanced pathological staging, and distant metastasis. Furthermore, responders and non-responders to ICB therapy exhibit distinct dynamics, heterogeneity in CD8 + T cell subsets, clonal expansion of TCRs, and gene expression profiles, which ICB therapy reshapes in RCC patients'TME. This reshaping provides insights into the mechanisms of response to immunotherapy and resistance to ICB treatment. CD8 + T cells display significant heterogeneity within the TME, which can be categorized into various subsets based on gene expression and molecular markers, each with distinct functional states. This heterogeneity offers clues for further understanding the evolution of RCC Yang et al. [ 207 Braun et al. [ 225 Li et al. [ 150 Mujal et al. [ 240 Alchahin et al. [ 175 Bi et al. [ 226 Long et al. [ 288 CD4 + T cells  CD4 + T cells exhibit significant heterogeneity at the single-cell resolution within the TME of RCC. Distinct subsets of these cells possess varying functional states and gene expression profiles. Notably, Tregs are highly enriched in RCC and mediate immune suppression and resistance to immunotherapy through their interactions with other immune cells, tumor cells, and stromal cells Krishna et al. [ 329 Kinget et al. [ 328 Hu et al. [ 195 Chevrier et al. [ 304 Macrophages  Macrophages within the TME of RCC exhibit significant heterogeneity. At a single-cell resolution, they can be finely classified, surpassing the traditional M1/M2 classification method. In RCC immunotherapy, pro-inflammatory (M1-like) macrophages are beneficial to treatment, while anti-inflammatory (M2-like) macrophages are detrimental. TREM + C1Q + macrophages have been identified as closely associated with high recurrence risk, poor prognosis, and resistance to ICB treatment in RCC, suggesting their potential as biomarkers for predicting recurrence and prognosis. Additionally, macrophages participate in the remodeling of the ECM, thereby promoting RCC metastasis Bi et al. [ 226 Aggen et al. [ 365 Obradovic et al. [ 227 Alchahin et al. [ 175 Litchfield et al. [ 382 Shi et al. [ 176 NK cells  Natural killer (NK) cells within the TME of RCC are divided into distinct subsets, such as CD56 +, CD56bright, and CD56dim, indicating their heterogeneity. These subsets engage in complex intercellular communications with other cells. Notably, LAMP3 + DCs interact significantly with the CD56dimCD16hi NK cell subset, suppressing the anticancer toxicity of NK cells. Additionally, the NK (EGR1 +) and NK (CAPG +) subsets are considered key cells in the metastatic process of RCC Li et al. [ 150 Tang et al. [ 394 Liang et al. [ 395 Dendritic cells  Dendritic cells (DCs) within the TME of RCC exhibit subset and spatial distribution heterogeneity, including plasmacytoid DCs (pDCs) and conventional DCs (cDCs). Among these, cDC1 plays a central role in mediating T cell immunity. Furthermore, during immunotherapy, DCs in RCC display various states, ranging from pro-inflammatory to anti-inflammatory characteristics. There is a notable difference in the functional states of DCs between non-responders and responders to immunotherapy, suggesting their potential role in the response to treatment Li et al. [ 150 Krishna et al. [ 329 Li et al. [ 416 Monocytes  In the TME of RCC, monocytes are categorized into distinct subpopulations, such as CD14 + FCGR3A-, CD14-FCGR3A +, and CD14 + CD16 + monocytes, demonstrating their heterogeneity. The complex intercellular communications within the TME influence the differentiation of monocytes, and these cells participate in the osteotropic metastatic process of CDRCC Krishna et al. [ 329 Braun et al. [ 225 Pan et al. [ 145 Chen et al. [ 301 B cells  B cells within the TME of RCC are present in relatively low proportions but exhibit stable ratios. Their differentiation trajectory initiates from naive B cells, progresses through memory B cells, and ultimately terminates at plasma cells. Among the B cell subsets, tumor-associated atypical B cells (TAABs) are enriched in RCC and are associated with better prognosis for RCC patients. Furthermore, certain sorafenib resistance genes are enriched in B cells, suggesting their involvement in resistance to targeted therapies. The presence of TAABs and their interaction with other immune cells, including CD4 T cells, highlight their potential as prognostic markers and their role in the TME Braun et al. [ 225 Obradovic et al. [ 227 Fitzsimons et al. [ 429 Yang et al. [ 430 Zhang et al. [ 156 Mast cells  Mast cells in the TME of RCC are more abundant compared to other cancers, with a higher frequency of VEGFA + mast cells than TNF + cells, suggesting their role in promoting cancer angiogenesis. Additionally, mast cell abundance is higher in type 1 pRCC compared to ccRCC and type 2 pRCC. In terms of prognosis, mast cells may correlate with better outcomes for ccRCC patients Cheng et al. [ 437 Young et al. [ 438 Hu et al. [ 195 Neutrophils  Neutrophils in the TME of RCC exhibit heterogeneity, dividing into two subsets, including VEGFA + SPP1 + neutrophils, which are significantly overexpressed in RCC and associated with tumor angiogenesis and growth; and HLA-DR + CD74 + neutrophils, which activate T cells to promote antitumor immunity. A reduction in neutrophils has been observed in tumor thrombi (TT) of RCC, suggesting that RCC may suppress the immune surveillance function of neutrophils through certain pathways, thereby acquiring the ability to invade and metastasize Wu et al. [ 446 Shi et al. [ 176 Stromal cells Endothelial cells  Within RCC, endothelial cells comprise multiple subsets, each expressing distinct molecules and fulfilling unique functions. These include participating in the remodeling of the RCC, engaging in the VEGF regulatory network, facilitating vascular restructuring and tumor angiogenesis, and suppressing the antitumor activities of immune cells. Furthermore, certain subsets of endothelial cells are indicative of prognosis and responsiveness to immunotherapy Li et al. [ 150 Young et al. [ 121 Li et al. [ 453 Zhang et al. [ 130 Zhang et al. [ 122 Fibroblasts  In RCC, the majority of fibroblasts originate from tumor tissues and exhibit significant heterogeneity. Cancer-associated fibroblasts (CAFs) are categorized into various subclasses, including inflammatory (iCAF), antigen-presenting (apCAF), myofibroblast (myCAF), immunomodulatory CAF (immuno-CAF), and TEX-associated CAF, among others. These CAFs interact with other cells within the TME and participate in processes such as ECM remodeling, RCC tumor invasion and migration, and suppression of immune cell anti-tumor activity. Additionally, certain subsets of CAFs can serve as potential predictive markers for prognosis, response to immunotherapy, and targeted therapy, as well as recurrence Li et al. [ 150 Davidson et al. [ 131 Chen et al. [ 468 Du et al. [ 162 Shi et al. [ 176 Pan et al. [ 470 Pericytes  Pericytes in RCC can be categorized into two distinct subpopulations, each with unique molecular signatures and functional roles. One subset exhibits a pro-inflammatory angiogenic phenotype, characterized by the high expression of genes related to angiogenesis and inflammation, suggesting their role in promoting tumor angiogenesis. The other subset presents a vascular smooth muscle cell (vSMC) phenotype, expressing genes crucial for the integrity of vascular structure. A decrease in the proportion of vSMC-like pericytes is observed with RCC progression, indicating that tumors may acquire the ability to invade and metastasize by disrupting vascular integrity. Furthermore, pericytes interact with other cells in the TME, including their transformation into myofibroblast-like cancer-associated fibroblasts (myCAFs), which promote the EMT process in RCC, their role in angiogenesis by interacting with endothelial cells, and their contribution to vascular dysfunction by altering the ECM, thereby facilitating RCC progression Alchahin et al. [ 175 Davidson et al. [ 131 Zhang et al. [ 483 Du et al. [ 455 Other stromal cells vSMCs  In RCC, mesenchymal cells can be categorized into multiple subpopulations, such as smooth muscle cells (SMCs), classic mesenchymal cells (MSG), and MSG.inf. MSG.inf characteristically expresses factors associated with stress and inflammation. In CDRCC, vascular smooth muscle cells (vSMCs) form a distinct cluster within the cellular population, marked by the specific expression of genes like TPPP3 SPARCL1 PDGFRB Pan et al. [ 145 Davidson et al. [ 131 Clinical applications of single-cell sequencing technology in renal cancer Single-cell sequencing technology assists in renal cancer diagnosis Accurate molecular classification and early diagnosis of RCC remain significant clinical challenges, particularly due to disease's complex heterogeneity. Traditional bulk sequencing approaches often mask critical molecular features, but scRNA-seq has emerged as a powerful tool to address these limitations and provide unprecedented resolution in tumor characterization. Recent multi-omic analyses have further enhanced our understanding of RCC progression. Hu et al. [ 190 213 438 122 Differential diagnosis in morphologically similar tumors has been challenging, but Yu et al. [ 255 Single-cell sequencing technology facilitates prognostic stratification Despite advances in treatment options, accurately predicting disease progression and treatment outcomes remains a critical challenge in renal cancer management. Traditional prognostic models based on bulk tissue analysis often fail to capture the complex cellular interactions that influence patient outcomes. SCS has revolutionized our approach to prognostic stratification by revealing intricate relationships between cellular heterogeneity and clinical outcomes. A fundamental challenge in prognostic assessment lies in understanding the evolution of immune dysfunction during disease progression. Braun et al. addressed this through a comprehensive single-cell profiling study of 164,722 cells from 13 patients across clinical stages [ 225 256 328 257 Stromal components and their interactions with tumors have also been implicated in disease progression and immunotherapy response. Davidson et al. [ 131 485 176 For clinical implementation, Recent scRNA analyses have revealed significant cellular heterogeneity in RCC, with studies identifying distinct cell populations and their interactions within the tumor microenvironment [ 122 Single-cell sequencing technology predicts treatment response Recent investigations have revealed specific molecular mechanisms underlying treatment response. Au et al. [ 486 365 242 Treatment resistance and variable therapeutic responses present major challenges in renal cancer management. Traditional methods of predicting treatment outcomes often fail to capture the complex cellular mechanisms underlying therapeutic response. scRNA technology has emerged as a powerful tool for understanding treatment resistance mechanisms and predicting therapeutic responses, particularly in the context of immunotherapy and targeted therapy. A fundamental challenge in prognostic assessment lies in understanding cellular mechanisms of treatment resistance. Building upon their previous findings, Braun et al. [ 225 Understanding the dynamic changes during immunotherapy poses another significant challenge. Bi et al. [ 226 The heterogeneous response to therapy presents a particular challenge in treatment planning. Zhang et al. [ 130 487 122 Most recently, Yang et al. [ 366 Clinical trials and treatment innovation The translation of SCS insights into clinical practice represents a critical step toward personalized medicine in renal cancer treatment. Clinical trials investigating SCS applications have shown promising results in guiding therapeutic decisions and monitoring treatment responses. These trials span multiple aspects of renal cancer management, from biomarker validation to treatment strategy optimization. In the context of immunotherapy selection, NCT04770246 The BIONIKK trial ( NCT02960906 6 2 Fig. 6 Applications of Single-cell Sequencing in Renal Cell Carcinoma Research. Single-cell sequencing analysis in RCC reveals three major research applications depicted in a radial layout. The inner circle represents the core technology application in RCC research. The middle layer illustrates three key research directions: diagnosis, focusing on cell-type identification and molecular markers (CA9/ITGB8, CA9/ALPK2); prognosis, highlighting immune cell states and risk assessment through eITH scoring; and treatment response, emphasizing immunotherapy markers and resistance mechanisms. The outer layer details specific cellular and molecular features, including PT-B cells in ccRCC, CD8+ T cell differentiation trajectories, and treatment-induced molecular alterations. This figure was created based on the tools provided by Figuredraw.com and Biorender.com Table 2 Summary of clinical trials implementing single-cell sequencing in renal cell carcinoma research NCT number Phase Title Status Primary outcome measures Single-cell sequencing-related outcome Enrollment NCT05485896 Phase 2 A Prospective Single-arm Clinical Study of Pembrolizumab Combined with Lenvatinib Neoadjuvant Therapy in Patients With Advanced Renal Cell Carcinoma Completed 1. Tumor responses evaluation using RECIST criteria. Adverse events monitoring according to CTCAE v5.0 Bulk RNA-seq and/or single cell RNA-seq were performed in part of tissues before and after neoadjuvant treatment to seek biomarkers predicting Response 23 NCT06195150 Observational Study Overtaking Intra and Inter Tumoral Heterogeneity In Von Hippel-Lindau Related Renal Cancer (ITHORinVHL) Recruiting 1. Integration of imaging and multiregion biopsy sampling. Determine immune and stromal heterogeneity 2. Generation and characterization of patient-derived organoids Single cell RNA sequencing will be performed to analyze immune and stromal heterogeneity in VHL-ccRCC 3 NCT04495894 Phase 2 Pre-Incisional Ketorolac for Patients Undergoing Surgery for Non-Small Cell Lung Cancer and Renal Cell Carcinoma Terminated 1. Incidence of blood transfusion. Incidence of hematoma development 2. Incidence of return to OR for bleeding. Incidence of postoperative renal failure 3. Incidence of postoperative morbidity Single cell RNA sequencing will be performed to evaluate the effects of ketorolac on immune response pathways 82 ChiCTR2000030405 Phase 2 Study of Efficacy and Safety of Preoperative Axitinib Combined with Toripalimab in Renal Cell Carcinoma with Inferior Vena Cava Tumor Thrombus: a Clinical Multicentric Prospective Study Prospective registration The down-staging rate of IVC-TT at 6 weeks after treatment Single cell RNA sequencing was performed to identify biomarkers of therapy effectiveness, which can guide strategy of neoadjuvant treatment 25 Conclusion and future perspectives SCS technology has significantly advanced renal cancer research. It has provided detailed insights into the cellular origins of various renal cancer subtypes, elucidating the potential roles of different cell types. SCS has also enhanced our understanding of the mechanisms underlying renal cancer initiation and progression, including EMT, metabolic reprogramming, immune evasion, gene expression regulation, and complex cell–cell communication networks. Moreover, SCS has illuminated the complex TME, demonstrating the heterogeneity and functions of immune cells. In clinical applications, SCS has demonstrated potential in renal cancer diagnosis by identifying novel biomarkers and improving molecular classification. It has facilitated prognostic stratification by elucidating the relationships between cellular heterogeneity and clinical outcomes, and has contributed to predicting treatment response, particularly in immunotherapy and targeted therapy. Clinical trials based on SCS are currently in progress, aiming to translate these findings into personalized medicine for renal cancer treatment. Despite the advancements in SCS technology, significant challenges persist in data processing complexity and associated high costs. Future research endeavors should prioritize the development of more efficient computational methods and experimental designs to mitigate costs and enhance the accuracy and efficiency of data analysis [ 488 489 490 In conclusion, while SCS has made significant progress in renal cancer research, continued efforts in technology development, biological exploration, and clinical translation are essential to fully realize its potential in improving renal cancer diagnosis, prognosis, and treatment. Abbreviations ccRCC Clear cell renal cell carcinoma pRCC Papillary renal cell carcinoma chrRCC Chromophobe renal cell carcinoma TRCC Translocation renal cell carcinoma ESCRCC Eosinophilic solid and cystic renal cell carcinoma RO Renal oncocytoma AML Angiomyolipoma HLRCC Hereditary leiomyomatosis and renal cell carcinoma BHD-RCCs Birt-Hogg-Dubé-associated kidney cancer VHL-RCC Von Hippel-Lindau-associated kidney cancer s-RCC Sporadic clear cell renal cell carcinoma RMC Renal medullary carcinoma CDRCC Collecting duct renal cell carcinoma PT Proximal tubule vSMCs Vascular smooth muscle cells ICs Intercalated cells EGF Epidermal growth factor EGFR Epidermal growth factor receptor VCAM1 Vascular Cell Adhesion Molecule 1 PST Proximal straight tubules CSCs Cancer stem cells MCs Malignant cells SIX2 Sine oculis homeobox 2 CITED1 Cbp/p300-interacting transactivator with Glu/Asp-rich carboxy-terminal domain 1 TAL Thick ascending limb MPs Meta-programs EMT Epithelial-mesenchymal transition NMF Non-negative matrix factorization CNs Cellular niches T Tumor core IM Invasive margin SN Normal region TAGLN Transgelin KRT19 Keratin 19 SOD2 Superoxide dismutase MALAT1 Metastasis-associated lung adenocarcinoma transcript 1 RHPs Recurrent heterogeneity programs FN1 Fibronectin VIM Vimentin JUP Plakoglobin OCLR One-class logistic regression ccRCC.mes Mesenchymal-like ccRCC cells myCAFs Myofibroblast-like cancer associated fibroblasts ECM Extracellular matrix TFs Transcription factors SNAIL Snail family transcriptional repressor TWIST Twist basic helix-loop-helix transcription factor BMRCC Bone metastatic RCC EMP1 Epithelial membrane protein 1 COL3A1 Collagen type III alpha 1 chain WNT Wingless-type MMTV integration site family SIRPα Signal regulatory protein alpha chain CD47 Integrin-associated protein PT Primary tumor TT Tumor thrombus nccRCC Non-clear cell renal cell carcinoma TFCP2L1 Transcription factor CP2-like 1 MYC Myelocytomatosis oncogene DCCD De-clear cell differentiation GSH Glutathione GSSG Glutathione disulfide ROS Reactive oxygen species FAO Fatty acid oxidation Cu Copper CuCOX Cytochrome c oxidase OXPHOS Oxidative phosphorylation PPAR Peroxisome proliferator-activated receptors CAFs Cancer-associated fibroblasts TME Tumor microenvironment EPCs Endothelial progenitor cells TIME Tumor immune microenvironment NNMT Nicotinamide-N-methyltransferase wGII Weighted gene instability index PYCR1 Pyrroline-5-Carboxylate Reductase-1 PVR Poliovirus receptor LGALS9 Galectin-9 FHRCC Fumarate hydratase-deficient renal cell carcinoma PFS Progression-free survival TRM Tissue-resident memory T PD-L1 Programmed cell death ligand 1 NECTIN2 Nectin cell adhesion molecule 2 MIF Macrophage migration inhibitory factor CSF1 Colony-stimulating factor-1 ICB Immune chekpoint blockade TAMs Tumor-associated macrophages TIM-3 T cell immunoglobulin and mucin domain 3 TIGIT T-cell immunoglobulin and immunoreceptor tyrosine-based inhibitory motif domain SPP1 Secreted phosphoprotein 1 TREM2 Triggering receptor expressed on myeloid cells 2 APOE Apolipoprotein E C1Q Complement Component 1, Q subcomponent ITGB1 Integrin β1 ITGA4 Integrin α4 CTL Cytotoxic T lymphocyte Tregs Regulatory T cells PLOD2 Procollagen-lysine 2-oxoglutarate 5-dioxygenase 2 SAA1 Serum amyloid A 1 LIGHT Lymphotoxin-like inducible protein that competes with glycoprotein D for herpesvirus entry mediator on T cells CXCR4 C-X-C motif chemokine receptor 4 LRP Low density lipoprotein receptor-related protein C3 Complement component 3 C3AR1 C3a receptor 1 ECs Endothelial cells PILRα Paired immunoglobulin-like type 2 receptor α PR Partial response PD Progressive disease Fas Factor associated suicide SLC38A8 Solute carrier family 38 member 8 ACRs Chromatin regions MAFA Musculoaponeurotic fibrosarcoma oncogene homolog A TUBB3 Class III β-tubulin R Receptor TGF-β Transforming growth factor – β GAS6 Growth arrest-specific protein 6 AXL AXL receptor tyrosine kinase PDK Pyruvate dehydrogenase kinase MPZ Myelin protein zero ANG Angiogenin PLXNB2 Plexin-B2 BMP Bone morphogenetic protein VEGFA Vascular endothelial growth factor A EGLN3 Egl-9 family hypoxia-inducible factor 3 GATA6 Gata—binding protein 6 GDF15 Growth differentiation factor 15 TERT Telomerase reverse transcriptase CRC Colorectal cancer YAP Yes—associated protein TAZ Transcriptional co—activator with PDZ—binding motif AHNAK Desmoyokin HIF1α Hypoxia—inducible factor 1—α lncRNAs Long non-coding RNAs HPSE2 Heparanase 2 ATRNL1 Attractin—like 1 IGSF21 Immunoglobulin superfamily member 21 CNVs Copy number variations CXCL C-X-C motif chemokine CCL C—C motif chemokine ligand ENL AF9 family transcriptional elongation regulator Fox Forkhead box AP-1 Activator protein—1 FOS FBJ murine osteosarcoma viral oncogene homolog FOSL2 FOS—like antigen 2 c-FOS Cellular-FOS JUN Jun proto—oncogene c-JUN Cellular-JUN CA9 Carbonic anhydrase IX TNF Tumor necrosis factor MAPK Mitogen-activated protein kinase OTP Orthopedia VENTX Ventral anterior homeobox HOXC5 Homeobox C5 ISL1 Insulin gene enhancer binding protein 1 FXYD2 FXYD domain-containing ion-transport regulator 2 CRYAB Crystallin alpha B ZEB1 Zinc finger E-box-binding homeobox SFFV proviral integration oncogene spi-C Spleen-focus-forming virus EOMES Eomesodermin ETV4 ETS variant transcription factor 4 ETS transcription factor 1 E-twenty-six EBF2 Early B-cell factor 2 SOX8 SRY-related HMG-box 8 HNF Hepatocyte nuclear factor TEAD3 TEA domain transcription factor 3 NFIB Nuclear factor I B CEBPB CCAAT/enhancer-binding protein beta KLF Kruppel-like factor NR1H4 Nuclear receptor subfamily 1 group H member 4 RARA Retinoic acid receptor alpha STAT3 Signal transducer and activator of transcription 3 NFκB Nuclear factor kappa-light-chain-enhancer of activated B cells POU2F2 POU domain, class 2, transcription factor 2 TR Mac Tissue-resident macrophages IL Interleukin bZIP TF Basic-leucine zipper MMPs Matrix metalloproteinases LTB Secrete lymphotoxin beta LTBR Lymphotoxin beta receptor FasLG Fas ligand VHL Von Hippel-Lindau GZM Granzyme ACVR Activin A receptor FGF Fibroblast growth factor COL1A1 Collagen type I alpha 1 DDR1 Discoidin domain receptor 1 HMMR Hyaluronan-mediated motility receptor INHBA Inhibin beta A LTF Lactotransferrin HG High-grade LG Low-grade PD-1 Programmed cell death protein 1 LAG3 Lymphocyte-activation gene 3 TCR T-cell receptor TCRB T cell receptor beta chain KLRG1 Killer cell lectin-like receptor G1 GNLY Granulysin CTLA4 Cytotoxic T-lymphocyte-associated protein 4 HAVCR2 Hepatitis A virus cellular receptor 2 ST-seq Spatial transcriptomics sequencing TCF7 Transcription factor 7 ENTPD1 Ectonucleoside triphosphate diphosphohydrolase 1 BATF Basic leucine zipper transcription factor ATF-like TOX Thymocyte selection-associated high mobility group box protein PRDM1 Positive regulatory domain zinc finger protein 1 NR4A1 Nuclear receptor subfamily 4 group A member 1 NFAT Nuclear factor of activated T – cells cDC1 Conventional type 1 dendritic cell sarRCC Sarcomatoid RCC RCCpm RCC pancreatic metastasis PAX8 Paired box gene 8 HLA Human leukocyte antigen MX1 Myxovirus resistance 1 4-1BB-Lo 4-1BB ligand-low expression GRB Growth-related oncogene B IM Immunological subtypes scNanoRNAseq Single-cell long-read sequencing DCIs Differential expression of transcript isoforms MDTs Most dominant transcripts IEG Immediate early gene SELL Selectin L LEF1 Lymphoid enhancer-binding factor 1 TFH Follicular helper T cells TNFRSF Tumor necrosis factor receptor superfamily STR Stress-reactive HSPA1 Heat shock protein family A member 1 MECRGs Malignant epithelial cell-related genes TI Treg Tumor-infiltrating Treg PB Peripheral blood CF1 Cell Fate #1 CF2 Cell Fate #2 ART Normal renal tissue CR Chemokine receptor mRCC Metastatic RCC RCN1 Reticulocalbin-1 TKIs Tyrosine kinase inhibitors ISG Interferon-stimulated gene IRF Interferon regulatory factor DCs Dendritic cells FGL1 Fibrinogen-like protein 1 MSR1 Macrophage scavenger receptor 1 CSF1R Colony-stimulating factor 1 receptor C1QC C1q c chain SPP1 Selenoprotein P plasma 1 FOLR2 Folate receptor 2 S100A S100 calcium-binding protein A MHC Major histocompatibility complex TAM ISGint, anti-tumor Intermediate interferon signaling gene expression TAM HLAhi High HLA-DR expression pro-tumorigenic Tissue-resident monocytes CTSS Cathepsin s LGALS3 Lectin galactoside-binding soluble 3 RGCC Regulator of cell cycle MEF Myocyte-enhancer factor TCF7L2 TCF7 ligand 2 IGF Insulin-like growth factor THBS1 Thrombospondin 1 NDUFA4L2 NADH dehydrogenase [ubiquinone] 1 alpha subcomplex 4—like 2 NK Natural killer XCL Chemokine (C - motif) ligand KLR Killer-cell lectin-like receptor subfamily FGFBP2 FGF-binding protein 2 CX3CR1 C-X3-C chemokine receptor 1 NCAM Neural cell adhesion molecule FCGR3A Fc fragment of igg receptor III a dim Dimly expressed hi Highly expressed LAMP Lysosome—associated membrane protein EGR Early growth response gene CAPG Capping protein gelsolin – like PRF Prolactin—releasing factor NCR Natural cytotoxicity triggering receptor mDCs Myeloid dendritic cells pDCs Plasmacytoid DCs FLT Fms-like tyrosine kinase CLEC9A C-type lectin domain family 9 member A CCR C-C chemokine receptor (A cell-surface protein that binds chemokines to guide immune cell movement) LILR Leukocyte immunoglobulin-like receptor LYPD3 Ly6/PLAUR domain-containing proteins 3 FZD Frizzled class receptor MT Metallothionein MS4A1 Membrane-spanning 4 – domains subfamily A member 1 TAABs Tumor-associated atypical B cells Bgc Germinal center B cells IGHG1 Immunoglobulin heavy chain gamma 1 KIT Kinase insert domain receptor TPSAB1 Tryptase alpha/beta 1 ADGR Adhesion G protein-coupled receptor IGFBP IGF-binding protein TECs Tumor-associated endothelial cells KDR Kinase insert domain receptor ACKR Atypical chemokine receptor SERPINE2 Serine proteinase inhibitor clade E member 2 SOST Sclerostin KCNE3 Potassium voltage-gated channel subfamily E regulatory subunit 3 VWF Von willebrand factor ENPP Ectonucleotide pyrophosphatase EDNR Endothelin receptor type HSPG Heparan sulfate proteoglycan AVR Ascending vasa recta CHRBP Chromatin-remodeling binding protein POSTN Periostin deMuts Differential mutations RPS2 Ribosomal protein S2 PECAM Endothelial cell adhesion molecule CDH Cadherin ACTA2 Actin alpha 2 smooth muscle aorta PDGFRB Platelet-derived growth factor receptor beta GJA5 Gap junction protein alpha 5 LY6H Lymphocyte antigen 6 complex locus H PGF Placental growth factor LOX Lysyl oxidase CHST1 Carbohydrate sulfotransferase 1 PXDN Peroxidasin SPARCL Secreted protein acidic and rich in cysteine – like CRHBP Corticotropin-releasing hormone-binding protein SMA Smooth muscle actin FABP Fatty-acid-binding protein iCAFs Inflammatory apCAFs Antigen-presenting XBP X-box-binding protein ATF Activating transcription factor FAP Fibroblast activation protein TGFBI Transforming growth factor beta induced THY Thyroid-stimulating hormone reRCC Recurrent RCC PLK Polo-like kinase HMGA High-mobility group A PTTG Pituitary tumor-transforming gene MPZL1 MPZ like-1 TIMP Tissue inhibitor of metalloproteinase RERGL Ras-related and estrogen-regulated growth inhibitor–like MCAM Melanoma cell adhesion molecule SMCs Smooth muscle cells MSG Mesangial cells REN Renin ANX Annexin FPR Formyl peptide receptor SCS Single-cell sequencing FACS Fluorescence-Activated Cell Sorting cDNA Complementary DNA scRNA-seq Single-cell RNA sequencing scATAC-seq Single-cell chromatin accessibility scMetabolomics Single-cell metabolomics scProteomics Single-cell proteomics snRNA-seq sequencing Single-nucleus RNA TPPP3 Tubulin polymerization promoting protein family member 3 scTCR-seq Single-cell T cell receptor sequencing scBCR-seq Single-cell B cell receptor sequencing JAG Jagged LILRB Leukocyte immunoglobulin-like receptor B Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Hanzhong Zhang, Ying Liu, Wenqiang Liu and Anqi Lin contributed equally to this work. Acknowledgements We thank Biorender ( https://www.biorender.com/ www.home-for-researchers.com Authors’ contributions P.L, L.W and A.J was involved in the conception of the study. H.Z, L.W and A.J were involved in the study design. Z.Z, Y.L, W.L and A.L were involved in the data collection and preparing the first draft of the manuscript. Y.F., L.Q, X.Z and A.J reviewed the manuscript and provided critical comments. All authors have read and approved the article. Funding This work was supported by grants from National Natural Science Foundation of China (grant numbers: 81902560, 81730073). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Bray F Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2022 74 229 263 10.3322/caac.21834(2024) 38572751 Bray F, et al. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2022;74:229–63. 10.3322/caac.21834(2024). 10.3322/caac.21834 38572751 2. Young M Renal cell carcinoma Lancet (London, England) 2024 404 476 491 10.1016/s0140-6736(24)00917-6 39033764 Young M, et al. Renal cell carcinoma. Lancet (London, England). 2024;404:476–91. 10.1016/s0140-6736(24)00917-6. 39033764 10.1016/S0140-6736(24)00917-6 3. Bukavina L Epidemiology of renal cell carcinoma: 2022 update Eur Urol 2022 82 529 42 10.1016/j.eururo.2022.08.019 36100483 Bukavina L, et al. Epidemiology of renal cell carcinoma: 2022 update. Eur Urol. 2022;82:529–42. 10.1016/j.eururo.2022.08.019. 36100483 10.1016/j.eururo.2022.08.019 4. Jiang A Renal cancer: signaling pathways and advances in targeted therapies MedComm 2024 5 e676 10.1002/mco2.676 39092291 PMC11292401 Jiang A, et al. Renal cancer: signaling pathways and advances in targeted therapies. MedComm. 2024;5: e676. 10.1002/mco2.676. 39092291 10.1002/mco2.676 PMC11292401 5. Ren X Kang B Zhang Z Understanding tumor ecosystems by single-cell sequencing: promises and limitations Genome Biol 2018 19 211 10.1186/s13059-018-1593-z 30509292 PMC6276232 Ren X, Kang B, Zhang Z. Understanding tumor ecosystems by single-cell sequencing: promises and limitations. Genome Biol. 2018;19:211. 10.1186/s13059-018-1593-z. 30509292 10.1186/s13059-018-1593-z PMC6276232 6. Potter SS Single-cell RNA sequencing for the study of development, physiology and disease Nat Rev Nephrol 2018 14 479 492 10.1038/s41581-018-0021-7 29789704 PMC6070143 Potter SS. Single-cell RNA sequencing for the study of development, physiology and disease. Nat Rev Nephrol. 2018;14:479–92. 10.1038/s41581-018-0021-7. 29789704 10.1038/s41581-018-0021-7 PMC6070143 7. Casado-Pelaez M Bueno-Costa A Esteller M Single cell cancer epigenetics Trends in cancer 2022 8 820 838 10.1016/j.trecan.2022.06.005 35821003 Casado-Pelaez M, Bueno-Costa A, Esteller M. Single cell cancer epigenetics. Trends in cancer. 2022;8:820–38. 10.1016/j.trecan.2022.06.005. 35821003 10.1016/j.trecan.2022.06.005 8. Lindskrog SV Single-nucleus and spatially resolved intratumor subtype heterogeneity in bladder cancer Eur Urol Open Sci 2023 51 78 88 10.1016/j.euros.2023.03.006 37187723 PMC10175738 Lindskrog SV, et al. Single-nucleus and spatially resolved intratumor subtype heterogeneity in bladder cancer. Eur Urol Open Sci. 2023;51:78–88. 10.1016/j.euros.2023.03.006. 37187723 10.1016/j.euros.2023.03.006 PMC10175738 9. Addala V Computational immunogenomic approaches to predict response to cancer immunotherapies Nat Rev Clin Oncol 2024 21 28 46 10.1038/s41571-023-00830-6 37907723 Addala V, et al. Computational immunogenomic approaches to predict response to cancer immunotherapies. Nat Rev Clin Oncol. 2024;21:28–46. 10.1038/s41571-023-00830-6. 37907723 10.1038/s41571-023-00830-6 10. Lei Y Applications of single-cell sequencing in cancer research: progress and perspectives J Hematol Oncol 2021 14 91 10.1186/s13045-021-01105-2 34108022 PMC8190846 Lei Y, et al. Applications of single-cell sequencing in cancer research: progress and perspectives. J Hematol Oncol. 2021;14:91. 10.1186/s13045-021-01105-2. 34108022 10.1186/s13045-021-01105-2 PMC8190846 11. Nam AS Chaligne R Landau DA Integrating genetic and non-genetic determinants of cancer evolution by single-cell multi-omics Nat Rev Genet 2021 22 3 18 10.1038/s41576-020-0265-5 32807900 PMC8450921 Nam AS, Chaligne R, Landau DA. Integrating genetic and non-genetic determinants of cancer evolution by single-cell multi-omics. Nat Rev Genet. 2021;22:3–18. 10.1038/s41576-020-0265-5. 32807900 10.1038/s41576-020-0265-5 PMC8450921 12. Guruprasad P Lee YG Kim KH Ruella M The current landscape of single-cell transcriptomics for cancer immunotherapy J Exp Med 2021 10.1084/jem.20201574 33601414 PMC7754680 Guruprasad P, Lee YG, Kim KH, Ruella M. The current landscape of single-cell transcriptomics for cancer immunotherapy. J Exp Med. 2021. 10.1084/jem.20201574. 33601414 10.1084/jem.20201574 PMC7754680 13. Malikic S Jahn K Kuipers J Sahinalp SC Beerenwinkel N Integrative inference of subclonal tumour evolution from single-cell and bulk sequencing data Nat Commun 2019 10 2750 10.1038/s41467-019-10737-5 31227714 PMC6588593 Malikic S, Jahn K, Kuipers J, Sahinalp SC, Beerenwinkel N. Integrative inference of subclonal tumour evolution from single-cell and bulk sequencing data. Nat Commun. 2019;10:2750. 10.1038/s41467-019-10737-5. 31227714 10.1038/s41467-019-10737-5 PMC6588593 14. Fu Y Unbiasedly decoding the tumor microenvironment with single-cell multiomics analysis in pancreatic cancer Mol Cancer 2024 23 140 10.1186/s12943-024-02050-7 38982491 PMC11232163 Fu Y, et al. Unbiasedly decoding the tumor microenvironment with single-cell multiomics analysis in pancreatic cancer. Mol Cancer. 2024;23:140. 10.1186/s12943-024-02050-7. 38982491 10.1186/s12943-024-02050-7 PMC11232163 15. Ren X Insights gained from single-cell analysis of immune cells in the tumor microenvironment Annu Rev Immunol 2021 39 583 609 10.1146/annurev-immunol-110519-071134 33637019 Ren X, et al. Insights gained from single-cell analysis of immune cells in the tumor microenvironment. Annu Rev Immunol. 2021;39:583–609. 10.1146/annurev-immunol-110519-071134. 33637019 10.1146/annurev-immunol-110519-071134 16. Sherman MH Beatty GL Tumor microenvironment in pancreatic cancer pathogenesis and therapeutic resistance Annu Rev Pathol 2023 18 123 148 10.1146/annurev-pathmechdis-031621-024600 36130070 PMC9877114 Sherman MH, Beatty GL. Tumor microenvironment in pancreatic cancer pathogenesis and therapeutic resistance. Annu Rev Pathol. 2023;18:123–48. 10.1146/annurev-pathmechdis-031621-024600. 36130070 10.1146/annurev-pathmechdis-031621-024600 PMC9877114 17. van Vlerken-Ysla L Tyurina YY Kagan VE Gabrilovich DI Functional states of myeloid cells in cancer Cancer Cell 2023 41 490 504 10.1016/j.ccell.2023.02.009 36868224 PMC10023509 van Vlerken-Ysla L, Tyurina YY, Kagan VE, Gabrilovich DI. Functional states of myeloid cells in cancer. Cancer Cell. 2023;41:490–504. 10.1016/j.ccell.2023.02.009. 36868224 10.1016/j.ccell.2023.02.009 PMC10023509 18. Ding S Chen X Shen K Single-cell RNA sequencing in breast cancer: Understanding tumor heterogeneity and paving roads to individualized therapy Cancer communications (London, England) 2020 40 329 344 10.1002/cac2.12078 32654419 PMC7427308 Ding S, Chen X, Shen K. Single-cell RNA sequencing in breast cancer: Understanding tumor heterogeneity and paving roads to individualized therapy. Cancer communications (London, England). 2020;40:329–44. 10.1002/cac2.12078. 32654419 10.1002/cac2.12078 PMC7427308 19. Walsh LA Quail DF Decoding the tumor microenvironment with spatial technologies Nat Immunol 2023 24 1982 1993 10.1038/s41590-023-01678-9 38012408 Walsh LA, Quail DF. Decoding the tumor microenvironment with spatial technologies. Nat Immunol. 2023;24:1982–93. 10.1038/s41590-023-01678-9. 38012408 10.1038/s41590-023-01678-9 20. Han J DePinho RA Maitra A Single-cell RNA sequencing in pancreatic cancer Nat Rev Gastroenterol Hepatol 2021 18 451 452 10.1038/s41575-021-00471-z 34040169 PMC8819738 Han J, DePinho RA, Maitra A. Single-cell RNA sequencing in pancreatic cancer. Nat Rev Gastroenterol Hepatol. 2021;18:451–2. 10.1038/s41575-021-00471-z. 34040169 10.1038/s41575-021-00471-z PMC8819738 21. Li Z Unveiling the novel immune and molecular signatures of ovarian cancer: insights and innovations from single-cell sequencing Front Immunol 2023 14 1288027 10.3389/fimmu.2023.1288027 38022625 PMC10654630 Li Z, et al. Unveiling the novel immune and molecular signatures of ovarian cancer: insights and innovations from single-cell sequencing. Front Immunol. 2023;14:1288027. 10.3389/fimmu.2023.1288027. 38022625 10.3389/fimmu.2023.1288027 PMC10654630 22. Huang M Ma J An G Ye X Unravelling cancer subtype-specific driver genes in single-cell transcriptomics data with CSDGI PLoS Comput Biol 2023 19 e1011450 10.1371/journal.pcbi.1011450 38096269 PMC10754467 Huang M, Ma J, An G, Ye X. Unravelling cancer subtype-specific driver genes in single-cell transcriptomics data with CSDGI. PLoS Comput Biol. 2023;19: e1011450. 10.1371/journal.pcbi.1011450. 38096269 10.1371/journal.pcbi.1011450 PMC10754467 23. Li CL Somatosensory neuron types identified by high-coverage single-cell RNA-sequencing and functional heterogeneity Cell Res 2016 26 83 102 10.1038/cr.2015.149 26691752 PMC4816136 Li CL, et al. Somatosensory neuron types identified by high-coverage single-cell RNA-sequencing and functional heterogeneity. Cell Res. 2016;26:83–102. 10.1038/cr.2015.149. 26691752 10.1038/cr.2015.149 PMC4816136 24. Lake BB Neuronal subtypes and diversity revealed by single-nucleus RNA sequencing of the human brain Science 2016 352 1586 1590 10.1126/science.aaf1204 27339989 PMC5038589 Lake BB, et al. Neuronal subtypes and diversity revealed by single-nucleus RNA sequencing of the human brain. Science. 2016;352:1586–90. 10.1126/science.aaf1204. 27339989 10.1126/science.aaf1204 PMC5038589 25. Grün D van Oudenaarden A Design and analysis of single-cell sequencing experiments Cell 2015 163 799 810 10.1016/j.cell.2015.10.039 26544934 Grün D, van Oudenaarden A. Design and analysis of single-cell sequencing experiments. Cell. 2015;163:799–810. 10.1016/j.cell.2015.10.039. 26544934 10.1016/j.cell.2015.10.039 26. Chen WW Deciphering the Immune-Tumor Interplay During Early-Stage Lung Cancer Development via Single-Cell Technology Front Oncol 2021 11 716042 10.3389/fonc.2021.716042 35047383 PMC8761635 Chen WW, et al. Deciphering the Immune-Tumor Interplay During Early-Stage Lung Cancer Development via Single-Cell Technology. Front Oncol. 2021;11: 716042. 10.3389/fonc.2021.716042. 35047383 10.3389/fonc.2021.716042 PMC8761635 27. Mazutis L Single-cell analysis and sorting using droplet-based microfluidics Nat Protoc 2013 8 870 891 10.1038/nprot.2013.046 23558786 PMC4128248 Mazutis L, et al. Single-cell analysis and sorting using droplet-based microfluidics. Nat Protoc. 2013;8:870–91. 10.1038/nprot.2013.046. 23558786 10.1038/nprot.2013.046 PMC4128248 28. Mark D Haeberle S Roth G von Stetten F Zengerle R Microfluidic lab-on-a-chip platforms: requirements, characteristics and applications Chem Soc Rev 2010 39 1153 82 10.1039/b820557b 20179830 Mark D, Haeberle S, Roth G, von Stetten F, Zengerle R. Microfluidic lab-on-a-chip platforms: requirements, characteristics and applications. Chem Soc Rev. 2010;39:1153–82. 10.1039/b820557b. 20179830 10.1039/b820557b 29. van Kuijk K Heterogeneity and plasticity in healthy and atherosclerotic vasculature explored by single-cell sequencing Cardiovasc Res 2019 115 1705 15 10.1093/cvr/cvz185 31350876 PMC6873093 van Kuijk K, et al. Heterogeneity and plasticity in healthy and atherosclerotic vasculature explored by single-cell sequencing. Cardiovasc Res. 2019;115:1705–15. 10.1093/cvr/cvz185. 31350876 10.1093/cvr/cvz185 PMC6873093 30. Macosko EZ Highly parallel genome-wide expression profiling of individual cells using nanoliter droplets Cell 2015 161 1202 1214 10.1016/j.cell.2015.05.002 26000488 PMC4481139 Macosko EZ, et al. Highly parallel genome-wide expression profiling of individual cells using nanoliter droplets. Cell. 2015;161:1202–14. 10.1016/j.cell.2015.05.002. 26000488 10.1016/j.cell.2015.05.002 PMC4481139 31. Li C Wang S Chen Y Zhang X Somatosensory neuron typing with high-coverage single-cell RNA sequencing and functional analysis Neurosci Bull 2018 34 200 207 10.1007/s12264-017-0147-9 28612318 PMC5799126 Li C, Wang S, Chen Y, Zhang X. Somatosensory neuron typing with high-coverage single-cell RNA sequencing and functional analysis. Neurosci Bull. 2018;34:200–7. 10.1007/s12264-017-0147-9. 28612318 10.1007/s12264-017-0147-9 PMC5799126 32. Picelli S Smart-seq2 for sensitive full-length transcriptome profiling in single cells Nat Methods 2013 10 1096 1098 10.1038/nmeth.2639 24056875 Picelli S, et al. Smart-seq2 for sensitive full-length transcriptome profiling in single cells. Nat Methods. 2013;10:1096–8. 10.1038/nmeth.2639. 24056875 10.1038/nmeth.2639 33. Hagemann-Jensen M Single-cell RNA counting at allele and isoform resolution using Smart-seq3 Nat Biotechnol 2020 38 708 714 10.1038/s41587-020-0497-0 32518404 Hagemann-Jensen M, et al. Single-cell RNA counting at allele and isoform resolution using Smart-seq3. Nat Biotechnol. 2020;38:708–14. 10.1038/s41587-020-0497-0. 32518404 10.1038/s41587-020-0497-0 34. Aubin RG Clustering-independent estimation of cell abundances in bulk tissues using single-cell RNA-seq data Cell Rep Methods 2024 4 100905 10.1016/j.crmeth.2024.100905 39561717 PMC11705773 Aubin RG, et al. Clustering-independent estimation of cell abundances in bulk tissues using single-cell RNA-seq data. Cell Rep Methods. 2024;4: 100905. 10.1016/j.crmeth.2024.100905. 39561717 10.1016/j.crmeth.2024.100905 PMC11705773 35. Wang Q Characterization of global research trends and prospects on single-cell sequencing technology: bibliometric analysis J Med Internet Res 2021 23 e25789 10.2196/25789 34014832 PMC8386406 Wang Q, et al. Characterization of global research trends and prospects on single-cell sequencing technology: bibliometric analysis. J Med Internet Res. 2021;23: e25789. 10.2196/25789. 34014832 10.2196/25789 PMC8386406 36. Wang Z Gerstein M Snyder M RNA-Seq: a revolutionary tool for transcriptomics Nat Rev Genet 2009 10 57 63 10.1038/nrg2484 19015660 PMC2949280 Wang Z, Gerstein M, Snyder M. RNA-Seq: a revolutionary tool for transcriptomics. Nat Rev Genet. 2009;10:57–63. 10.1038/nrg2484. 19015660 10.1038/nrg2484 PMC2949280 37. Ozsolak F Milos PM RNA sequencing: advances, challenges and opportunities Nat Rev Genet 2011 12 87 98 10.1038/nrg2934 21191423 PMC3031867 Ozsolak F, Milos PM. RNA sequencing: advances, challenges and opportunities. Nat Rev Genet. 2011;12:87–98. 10.1038/nrg2934. 21191423 10.1038/nrg2934 PMC3031867 38. Stark R Grzelak M Hadfield J RNA sequencing: the teenage years Nat Rev Genet 2019 20 631 656 10.1038/s41576-019-0150-2 31341269 Stark R, Grzelak M, Hadfield J. RNA sequencing: the teenage years. Nat Rev Genet. 2019;20:631–56. 10.1038/s41576-019-0150-2. 31341269 10.1038/s41576-019-0150-2 39. Li X Wang CY From bulk, single-cell to spatial RNA sequencing Int J Oral Sci 2021 13 36 10.1038/s41368-021-00146-0 34782601 PMC8593179 Li X, Wang CY. From bulk, single-cell to spatial RNA sequencing. Int J Oral Sci. 2021;13:36. 10.1038/s41368-021-00146-0. 34782601 10.1038/s41368-021-00146-0 PMC8593179 40. Dal Molin A Di Camillo B How to design a single-cell RNA-sequencing experiment: pitfalls, challenges and perspectives Brief Bioinform 2019 20 1384 94 10.1093/bib/bby007 29394315 Dal Molin A, Di Camillo B. How to design a single-cell RNA-sequencing experiment: pitfalls, challenges and perspectives. Brief Bioinform. 2019;20:1384–94. 10.1093/bib/bby007. 29394315 10.1093/bib/bby007 41. Ruiz Sebastián C O’Ryan C Single-cell sequencing of dinoflagellate (Dinophyceae) nuclear ribosomal genes Mol Ecol Notes 2001 1 329 331 10.1046/j.1471-8278.2001.00084.x Ruiz Sebastián C, O’Ryan C. Single-cell sequencing of dinoflagellate (Dinophyceae) nuclear ribosomal genes. Mol Ecol Notes. 2001;1:329–31. 10.1046/j.1471-8278.2001.00084.x. 42. Xu M Fujita D Hanagata N Perspectives and challenges of emerging single-molecule DNA sequencing technologies Small 2009 5 2638 2649 10.1002/smll.200900976 19904762 Xu M, Fujita D, Hanagata N. Perspectives and challenges of emerging single-molecule DNA sequencing technologies. Small. 2009;5:2638–49. 10.1002/smll.200900976. 19904762 10.1002/smll.200900976 43. Tang F mRNA-seq whole-transcriptome analysis of a single cell Nat Methods 2009 6 377 382 10.1038/nmeth.1315 19349980 Tang F, et al. mRNA-seq whole-transcriptome analysis of a single cell. Nat Methods. 2009;6:377–82. 10.1038/nmeth.1315. 19349980 10.1038/nmeth.1315 44. Navin N Tumour evolution inferred by single-cell sequencing Nature 2011 472 90 94 10.1038/nature09807 21399628 PMC4504184 Navin N, et al. Tumour evolution inferred by single-cell sequencing. Nature. 2011;472:90–4. 10.1038/nature09807. 21399628 10.1038/nature09807 PMC4504184 45. Tirosh I Dissecting the multicellular ecosystem of metastatic melanoma by single-cell RNA-seq Science 2016 352 189 196 10.1126/science.aad0501 27124452 PMC4944528 Tirosh I, et al. Dissecting the multicellular ecosystem of metastatic melanoma by single-cell RNA-seq. Science. 2016;352:189–96. 10.1126/science.aad0501. 27124452 10.1126/science.aad0501 PMC4944528 46. Chen C Liao Y Peng G Connecting past and present: single-cell lineage tracing Protein Cell 2022 13 790 807 10.1007/s13238-022-00913-7 35441356 PMC9237189 Chen C, Liao Y, Peng G. Connecting past and present: single-cell lineage tracing. Protein Cell. 2022;13:790–807. 10.1007/s13238-022-00913-7. 35441356 10.1007/s13238-022-00913-7 PMC9237189 47. Paik DT Cho S Tian L Chang HY Wu JC Single-cell RNA sequencing in cardiovascular development, disease and medicine Nat Rev Cardiol 2020 17 457 473 10.1038/s41569-020-0359-y 32231331 PMC7528042 Paik DT, Cho S, Tian L, Chang HY, Wu JC. Single-cell RNA sequencing in cardiovascular development, disease and medicine. Nat Rev Cardiol. 2020;17:457–73. 10.1038/s41569-020-0359-y. 32231331 10.1038/s41569-020-0359-y PMC7528042 48. Zhang X Comparative Analysis of Droplet-Based Ultra-High-Throughput Single-Cell RNA-Seq Systems Mol Cell 2019 73 130 142.e135 10.1016/j.molcel.2018.10.020 30472192 Zhang X, et al. Comparative Analysis of Droplet-Based Ultra-High-Throughput Single-Cell RNA-Seq Systems. Mol Cell. 2019;73:130-142.e135. 10.1016/j.molcel.2018.10.020. 30472192 10.1016/j.molcel.2018.10.020 49. Wang Y Dissolvable Polyacrylamide Beads for High-Throughput Droplet DNA Barcoding Adv Sci (Weinh) 2020 7 1903463 10.1002/advs.201903463 32328429 PMC7175265 Wang Y, et al. Dissolvable Polyacrylamide Beads for High-Throughput Droplet DNA Barcoding. Adv Sci (Weinh). 2020;7:1903463. 10.1002/advs.201903463. 32328429 10.1002/advs.201903463 PMC7175265 50. Hashimshony T Wagner F Sher N Yanai I CEL-Seq: single-cell RNA-Seq by multiplexed linear amplification Cell Rep 2012 2 666 673 10.1016/j.celrep.2012.08.003 22939981 Hashimshony T, Wagner F, Sher N, Yanai I. CEL-Seq: single-cell RNA-Seq by multiplexed linear amplification. Cell Rep. 2012;2:666–73. 10.1016/j.celrep.2012.08.003. 22939981 10.1016/j.celrep.2012.08.003 51. Hashimshony T CEL-seq2: sensitive highly-multiplexed single-cell RNA-seq Genome Biol 2016 17 77 10.1186/s13059-016-0938-8 27121950 PMC4848782 Hashimshony T, et al. CEL-seq2: sensitive highly-multiplexed single-cell RNA-seq. Genome Biol. 2016;17:77. 10.1186/s13059-016-0938-8. 27121950 10.1186/s13059-016-0938-8 PMC4848782 52. Giladi A Single-cell characterization of haematopoietic progenitors and their trajectories in homeostasis and perturbed haematopoiesis Nat Cell Biol 2018 20 836 846 10.1038/s41556-018-0121-4 29915358 Giladi A, et al. Single-cell characterization of haematopoietic progenitors and their trajectories in homeostasis and perturbed haematopoiesis. Nat Cell Biol. 2018;20:836–46. 10.1038/s41556-018-0121-4. 29915358 10.1038/s41556-018-0121-4 53. Duan B Model-based understanding of single-cell CRISPR screening Nat Commun 2019 10 2233 10.1038/s41467-019-10216-x 31110232 PMC6527552 Duan B, et al. Model-based understanding of single-cell CRISPR screening. Nat Commun. 2019;10:2233. 10.1038/s41467-019-10216-x. 31110232 10.1038/s41467-019-10216-x PMC6527552 54. Dixit A Perturb-Seq: Dissecting Molecular Circuits with Scalable Single-Cell RNA Profiling of Pooled Genetic Screens Cell 2016 167 1853 1866.e1817 10.1016/j.cell.2016.11.038 27984732 PMC5181115 Dixit A, et al. Perturb-Seq: Dissecting Molecular Circuits with Scalable Single-Cell RNA Profiling of Pooled Genetic Screens. Cell. 2016;167:1853-1866.e1817. 10.1016/j.cell.2016.11.038. 27984732 10.1016/j.cell.2016.11.038 PMC5181115 55. Datlinger P Pooled CRISPR screening with single-cell transcriptome readout Nat Methods 2017 14 297 301 10.1038/nmeth.4177 28099430 PMC5334791 Datlinger P, et al. Pooled CRISPR screening with single-cell transcriptome readout. Nat Methods. 2017;14:297–301. 10.1038/nmeth.4177. 28099430 10.1038/nmeth.4177 PMC5334791 56. Replogle JM Combinatorial single-cell CRISPR screens by direct guide RNA capture and targeted sequencing Nat Biotechnol 2020 38 954 961 10.1038/s41587-020-0470-y 32231336 PMC7416462 Replogle JM, et al. Combinatorial single-cell CRISPR screens by direct guide RNA capture and targeted sequencing. Nat Biotechnol. 2020;38:954–61. 10.1038/s41587-020-0470-y. 32231336 10.1038/s41587-020-0470-y PMC7416462 57. Morris JA Discovery of target genes and pathways at GWAS loci by pooled single-cell CRISPR screens Science 2023 380 eadh7699 10.1126/science.adh7699 37141313 PMC10518238 Morris JA, et al. Discovery of target genes and pathways at GWAS loci by pooled single-cell CRISPR screens. Science. 2023;380:eadh7699. 10.1126/science.adh7699. 37141313 10.1126/science.adh7699 PMC10518238 58. Schwartz GW Toomanycells identifies and visualizes relationships of single-cell clades Nat Methods 2020 17 405 413 10.1038/s41592-020-0748-5 32123397 PMC7439807 Schwartz GW, et al. Toomanycells identifies and visualizes relationships of single-cell clades. Nat Methods. 2020;17:405–13. 10.1038/s41592-020-0748-5. 32123397 10.1038/s41592-020-0748-5 PMC7439807 59. Brendel M Application of deep learning on single-cell RNA sequencing data analysis: a review Genomics Proteomics Bioinformatics 2022 20 814 835 10.1016/j.gpb.2022.11.011 36528240 PMC10025684 Brendel M, et al. Application of deep learning on single-cell RNA sequencing data analysis: a review. Genomics Proteomics Bioinformatics. 2022;20:814–35. 10.1016/j.gpb.2022.11.011. 36528240 10.1016/j.gpb.2022.11.011 PMC10025684 60. Lin X Tian T Wei Z Hakonarson H Clustering of single-cell multi-omics data with a multimodal deep learning method Nat Commun 2022 13 7705 10.1038/s41467-022-35031-9 36513636 PMC9748135 Lin X, Tian T, Wei Z, Hakonarson H. Clustering of single-cell multi-omics data with a multimodal deep learning method. Nat Commun. 2022;13:7705. 10.1038/s41467-022-35031-9. 36513636 10.1038/s41467-022-35031-9 PMC9748135 61. Liu W Joint dimension reduction and clustering analysis of single-cell RNA-seq and spatial transcriptomics data Nucleic Acids Res 2022 50 e72 10.1093/nar/gkac219 35349708 PMC9262606 Liu W, et al. Joint dimension reduction and clustering analysis of single-cell RNA-seq and spatial transcriptomics data. Nucleic Acids Res. 2022;50: e72. 10.1093/nar/gkac219. 35349708 10.1093/nar/gkac219 PMC9262606 62. Grabski IN Street K Irizarry RA Significance analysis for clustering with single-cell RNA-sequencing data Nat Methods 2023 20 1196 1202 10.1038/s41592-023-01933-9 37429993 PMC11282907 Grabski IN, Street K, Irizarry RA. Significance analysis for clustering with single-cell RNA-sequencing data. Nat Methods. 2023;20:1196–202. 10.1038/s41592-023-01933-9. 37429993 10.1038/s41592-023-01933-9 PMC11282907 63. Lotfollahi M Yuhan H Theis FJ Satija R The future of rapid and automated single-cell data analysis using reference mapping Cell 2024 187 2343 2358 10.1016/j.cell.2024.03.009 38729109 PMC11184658 Lotfollahi M, Yuhan H, Theis FJ, Satija R. The future of rapid and automated single-cell data analysis using reference mapping. Cell. 2024;187:2343–58. 10.1016/j.cell.2024.03.009. 38729109 10.1016/j.cell.2024.03.009 PMC11184658 64. Zhao Y CAbiNet: joint clustering and visualization of cells and genes for single-cell transcriptomics Nucleic Acids Res 2024 52 e57 10.1093/nar/gkae480 38850160 PMC11260446 Zhao Y, et al. CAbiNet: joint clustering and visualization of cells and genes for single-cell transcriptomics. Nucleic Acids Res. 2024;52: e57. 10.1093/nar/gkae480. 38850160 10.1093/nar/gkae480 PMC11260446 65. Konry T Sarkar S Sabhachandani P Cohen N Innovative tools and technology for analysis of single cells and cell-cell interaction Annu Rev Biomed Eng 2016 18 259 284 10.1146/annurev-bioeng-090215-112735 26928209 Konry T, Sarkar S, Sabhachandani P, Cohen N. Innovative tools and technology for analysis of single cells and cell-cell interaction. Annu Rev Biomed Eng. 2016;18:259–84. 10.1146/annurev-bioeng-090215-112735. 26928209 10.1146/annurev-bioeng-090215-112735 66. Prakadan SM Shalek AK Weitz DA Scaling by shrinking: empowering single-cell 'omics' with microfluidic devices Nat Rev Genet 2017 18 345 361 10.1038/nrg.2017.15 28392571 PMC5495114 Prakadan SM, Shalek AK, Weitz DA. Scaling by shrinking: empowering single-cell “omics” with microfluidic devices. Nat Rev Genet. 2017;18:345–61. 10.1038/nrg.2017.15. 28392571 10.1038/nrg.2017.15 PMC5495114 67. De Jonghe J spinDrop: a droplet microfluidic platform to maximise single-cell sequencing information content Nat Commun 2023 14 4788 10.1038/s41467-023-40322-w 37553326 PMC10409775 De Jonghe J, et al. spinDrop: a droplet microfluidic platform to maximise single-cell sequencing information content. Nat Commun. 2023;14:4788. 10.1038/s41467-023-40322-w. 37553326 10.1038/s41467-023-40322-w PMC10409775 68. Shang Y Droplet-based single-cell sequencing: strategies and applications Biotechnol Adv 2024 77 108454 10.1016/j.biotechadv.2024.108454 39271031 Shang Y, et al. Droplet-based single-cell sequencing: strategies and applications. Biotechnol Adv. 2024;77: 108454. 10.1016/j.biotechadv.2024.108454. 39271031 10.1016/j.biotechadv.2024.108454 69. Clark IC Microfluidics-free single-cell genomics with templated emulsification Nat Biotechnol 2023 41 1557 66 10.1038/s41587-023-01685-z 36879006 PMC10635830 Clark IC, et al. Microfluidics-free single-cell genomics with templated emulsification. Nat Biotechnol. 2023;41:1557–66. 10.1038/s41587-023-01685-z. 36879006 10.1038/s41587-023-01685-z PMC10635830 70. Su Y Single-cell sequencing insights into the transcriptional landscape of Parkinson's disease Ageing Res Rev 2024 102 102553 10.1016/j.arr.2024.102553 39454761 Su Y, et al. Single-cell sequencing insights into the transcriptional landscape of Parkinson’s disease. Ageing Res Rev. 2024;102: 102553. 10.1016/j.arr.2024.102553. 39454761 10.1016/j.arr.2024.102553 71. Tian R Evaluation of T cell receptor construction methods from scRNA-seq data Genomics Proteomics Bioinformatics 2024 10.1093/gpbjnl/qzae086 39666949 PMC11846667 Tian R, et al. Evaluation of T cell receptor construction methods from scRNA-seq data. Genomics Proteomics Bioinformatics. 2024. 10.1093/gpbjnl/qzae086. 39666949 10.1093/gpbjnl/qzae086 PMC11846667 72. Depuydt MAC Single-cell T cell receptor sequencing of paired human atherosclerotic plaques and blood reveals autoimmune-like features of expanded effector T cells Nat Cardiovasc Res 2023 2 112 125 10.1038/s44161-022-00208-4 38665903 PMC11041750 Depuydt MAC, et al. Single-cell T cell receptor sequencing of paired human atherosclerotic plaques and blood reveals autoimmune-like features of expanded effector T cells. Nat Cardiovasc Res. 2023;2:112–25. 10.1038/s44161-022-00208-4. 38665903 10.1038/s44161-022-00208-4 PMC11041750 73. Setliff I High-Throughput Mapping of B Cell Receptor Sequences to Antigen Specificity Cell 2019 179 1636 1646.e1615 10.1016/j.cell.2019.11.003 31787378 PMC7158953 Setliff I, et al. High-Throughput Mapping of B Cell Receptor Sequences to Antigen Specificity. Cell. 2019;179:1636-1646.e1615. 10.1016/j.cell.2019.11.003. 31787378 10.1016/j.cell.2019.11.003 PMC7158953 74. Wu X Single-cell sequencing to multi-omics: technologies and applications Biomark Res 2024 12 110 10.1186/s40364-024-00643-4 39334490 PMC11438019 Wu X, et al. Single-cell sequencing to multi-omics: technologies and applications. Biomark Res. 2024;12:110. 10.1186/s40364-024-00643-4. 39334490 10.1186/s40364-024-00643-4 PMC11438019 75. Zhu L Peng Q Wu Y Yao X ScBCR-seq revealed a special and novel IG H&L V(D)J allelic inclusion rearrangement and the high proportion dual BCR expressing B cells Cellular and molecular life sciences : CMLS 2023 80 319 10.1007/s00018-023-04973-8 37804328 PMC11073065 Zhu L, Peng Q, Wu Y, Yao X. ScBCR-seq revealed a special and novel IG H&L V(D)J allelic inclusion rearrangement and the high proportion dual BCR expressing B cells. Cellular and molecular life sciences : CMLS. 2023;80:319. 10.1007/s00018-023-04973-8. 37804328 10.1007/s00018-023-04973-8 PMC11073065 76. Stuart T Nanobody-tethered transposition enables multifactorial chromatin profiling at single-cell resolution Nat Biotechnol 2023 41 806 812 10.1038/s41587-022-01588-5 36536150 PMC10272075 Stuart T, et al. Nanobody-tethered transposition enables multifactorial chromatin profiling at single-cell resolution. Nat Biotechnol. 2023;41:806–12. 10.1038/s41587-022-01588-5. 36536150 10.1038/s41587-022-01588-5 PMC10272075 77. Buenrostro JD Single-cell chromatin accessibility reveals principles of regulatory variation Nature 2015 523 486 490 10.1038/nature14590 26083756 PMC4685948 Buenrostro JD, et al. Single-cell chromatin accessibility reveals principles of regulatory variation. Nature. 2015;523:486–90. 10.1038/nature14590. 26083756 10.1038/nature14590 PMC4685948 78. Satpathy AT Massively parallel single-cell chromatin landscapes of human immune cell development and intratumoral T cell exhaustion Nat Biotechnol 2019 37 925 936 10.1038/s41587-019-0206-z 31375813 PMC7299161 Satpathy AT, et al. Massively parallel single-cell chromatin landscapes of human immune cell development and intratumoral T cell exhaustion. Nat Biotechnol. 2019;37:925–36. 10.1038/s41587-019-0206-z. 31375813 10.1038/s41587-019-0206-z PMC7299161 79. Stuart T Comprehensive Integration of Single-Cell Data Cell 2019 177 1888 1902.e1821 10.1016/j.cell.2019.05.031 31178118 PMC6687398 Stuart T, et al. Comprehensive Integration of Single-Cell Data. Cell. 2019;177:1888-1902.e1821. 10.1016/j.cell.2019.05.031. 31178118 10.1016/j.cell.2019.05.031 PMC6687398 80. Giles JR Shared and distinct biological circuits in effector, memory and exhausted CD8(+) T cells revealed by temporal single-cell transcriptomics and epigenetics Nat Immunol 2022 23 1600 13 10.1038/s41590-022-01338-4 36271148 PMC10408358 Giles JR, et al. Shared and distinct biological circuits in effector, memory and exhausted CD8(+) T cells revealed by temporal single-cell transcriptomics and epigenetics. Nat Immunol. 2022;23:1600–13. 10.1038/s41590-022-01338-4. 36271148 10.1038/s41590-022-01338-4 PMC10408358 81. Joung J A transcription factor atlas of directed differentiation Cell 2023 186 209 229.e226 10.1016/j.cell.2022.11.026 36608654 PMC10344468 Joung J, et al. A transcription factor atlas of directed differentiation. Cell. 2023;186:209-229.e226. 10.1016/j.cell.2022.11.026. 36608654 10.1016/j.cell.2022.11.026 PMC10344468 82. De Rop FV Systematic benchmarking of single-cell ATAC-sequencing protocols Nat Biotechnol 2024 42 916 926 10.1038/s41587-023-01881-x 37537502 PMC11180611 De Rop FV, et al. Systematic benchmarking of single-cell ATAC-sequencing protocols. Nat Biotechnol. 2024;42:916–26. 10.1038/s41587-023-01881-x. 37537502 10.1038/s41587-023-01881-x PMC11180611 83. Xie Y Droplet-based single-cell joint profiling of histone modifications and transcriptomes Nat Struct Mol Biol 2023 30 1428 33 10.1038/s41594-023-01060-1 37563440 PMC10584685 Xie Y, et al. Droplet-based single-cell joint profiling of histone modifications and transcriptomes. Nat Struct Mol Biol. 2023;30:1428–33. 10.1038/s41594-023-01060-1. 37563440 10.1038/s41594-023-01060-1 PMC10584685 84. Yeung J scChIX-seq infers dynamic relationships between histone modifications in single cells Nat Biotechnol 2023 41 813 823 10.1038/s41587-022-01560-3 36593403 PMC10264247 Yeung J, et al. scChIX-seq infers dynamic relationships between histone modifications in single cells. Nat Biotechnol. 2023;41:813–23. 10.1038/s41587-022-01560-3. 36593403 10.1038/s41587-022-01560-3 PMC10264247 85. Rang FJ Single-cell profiling of transcriptome and histone modifications with EpiDamID Mol Cell 2022 82 1956 1970.e1914 10.1016/j.molcel.2022.03.009 35366395 PMC9153956 Rang FJ, et al. Single-cell profiling of transcriptome and histone modifications with EpiDamID. Mol Cell. 2022;82:1956-1970.e1914. 10.1016/j.molcel.2022.03.009. 35366395 10.1016/j.molcel.2022.03.009 PMC9153956 86. Bartosovic M Kabbe M Castelo-Branco G Single-cell CUT&Tag profiles histone modifications and transcription factors in complex tissues Nat Biotechnol 2021 39 825 835 10.1038/s41587-021-00869-9 33846645 PMC7611252 Bartosovic M, Kabbe M, Castelo-Branco G. Single-cell CUT&Tag profiles histone modifications and transcription factors in complex tissues. Nat Biotechnol. 2021;39:825–35. 10.1038/s41587-021-00869-9. 33846645 10.1038/s41587-021-00869-9 PMC7611252 87. Li W Scnanohi-c: a single-cell long-read concatemer sequencing method to reveal high-order chromatin structures within individual cells Nat Methods 2023 20 1493 1505 10.1038/s41592-023-01978-w 37640936 Li W, et al. Scnanohi-c: a single-cell long-read concatemer sequencing method to reveal high-order chromatin structures within individual cells. Nat Methods. 2023;20:1493–505. 10.1038/s41592-023-01978-w. 37640936 10.1038/s41592-023-01978-w 88. Ludwig LS Lineage Tracing in Humans Enabled by Mitochondrial Mutations and Single-Cell Genomics Cell 2019 176 1325 1339.e1322 10.1016/j.cell.2019.01.022 30827679 PMC6408267 Ludwig LS, et al. Lineage Tracing in Humans Enabled by Mitochondrial Mutations and Single-Cell Genomics. Cell. 2019;176:1325-1339.e1322. 10.1016/j.cell.2019.01.022. 30827679 10.1016/j.cell.2019.01.022 PMC6408267 89. Lareau CA Massively parallel single-cell mitochondrial DNA genotyping and chromatin profiling Nat Biotechnol 2021 39 451 461 10.1038/s41587-020-0645-6 32788668 PMC7878580 Lareau CA, et al. Massively parallel single-cell mitochondrial DNA genotyping and chromatin profiling. Nat Biotechnol. 2021;39:451–61. 10.1038/s41587-020-0645-6. 32788668 10.1038/s41587-020-0645-6 PMC7878580 90. Miller TE Mitochondrial variant enrichment from high-throughput single-cell RNA sequencing resolves clonal populations Nat Biotechnol 2022 40 1030 1034 10.1038/s41587-022-01210-8 35210612 PMC9288977 Miller TE, et al. Mitochondrial variant enrichment from high-throughput single-cell RNA sequencing resolves clonal populations. Nat Biotechnol. 2022;40:1030–4. 10.1038/s41587-022-01210-8. 35210612 10.1038/s41587-022-01210-8 PMC9288977 91. Lareau CA Single-cell multi-omics of mitochondrial DNA disorders reveals dynamics of purifying selection across human immune cells Nat Genet 2023 55 1198 1209 10.1038/s41588-023-01433-8 37386249 PMC10548551 Lareau CA, et al. Single-cell multi-omics of mitochondrial DNA disorders reveals dynamics of purifying selection across human immune cells. Nat Genet. 2023;55:1198–209. 10.1038/s41588-023-01433-8. 37386249 10.1038/s41588-023-01433-8 PMC10548551 92. Zhang H Systematic investigation of mitochondrial transfer between cancer cells and T cells at single-cell resolution Cancer Cell 2023 41 1788 1802.e1710 10.1016/j.ccell.2023.09.003 37816332 PMC10568073 Zhang H, et al. Systematic investigation of mitochondrial transfer between cancer cells and T cells at single-cell resolution. Cancer Cell. 2023;41:1788-1802.e1710. 10.1016/j.ccell.2023.09.003. 37816332 10.1016/j.ccell.2023.09.003 PMC10568073 93. Nitsch L Lareau CA Ludwig LS Mitochondrial genetics through the lens of single-cell multi-omics Nat Genet 2024 56 1355 1365 10.1038/s41588-024-01794-8 38951641 PMC11260401 Nitsch L, Lareau CA, Ludwig LS. Mitochondrial genetics through the lens of single-cell multi-omics. Nat Genet. 2024;56:1355–65. 10.1038/s41588-024-01794-8. 38951641 10.1038/s41588-024-01794-8 PMC11260401 94. Argüello RJ SCENITH: A Flow Cytometry-Based Method to Functionally Profile Energy Metabolism with Single-Cell Resolution Cell Metab 2020 32 1063 1075.e1067 10.1016/j.cmet.2020.11.007 33264598 PMC8407169 Argüello RJ, et al. SCENITH: A Flow Cytometry-Based Method to Functionally Profile Energy Metabolism with Single-Cell Resolution. Cell Metab. 2020;32:1063-1075.e1067. 10.1016/j.cmet.2020.11.007. 33264598 10.1016/j.cmet.2020.11.007 PMC8407169 95. Zenobi R Single-cell metabolomics: analytical and biological perspectives Science 2013 342 1243259 10.1126/science.1243259 24311695 Zenobi R. Single-cell metabolomics: analytical and biological perspectives. Science. 2013;342:1243259. 10.1126/science.1243259. 24311695 10.1126/science.1243259 96. Baysoy A Bai Z Satija R Fan R The technological landscape and applications of single-cell multi-omics Nat Rev Mol Cell Biol 2023 24 695 713 10.1038/s41580-023-00615-w 37280296 PMC10242609 Baysoy A, Bai Z, Satija R, Fan R. The technological landscape and applications of single-cell multi-omics. Nat Rev Mol Cell Biol. 2023;24:695–713. 10.1038/s41580-023-00615-w. 37280296 10.1038/s41580-023-00615-w PMC10242609 97. Hu T Single-cell spatial metabolomics with cell-type specific protein profiling for tissue systems biology Nat Commun 2023 14 8260 10.1038/s41467-023-43917-5 38086839 PMC10716522 Hu T, et al. Single-cell spatial metabolomics with cell-type specific protein profiling for tissue systems biology. Nat Commun. 2023;14:8260. 10.1038/s41467-023-43917-5. 38086839 10.1038/s41467-023-43917-5 PMC10716522 98. Perkel JM Single-cell proteomics takes centre stage Nature 2021 597 580 582 10.1038/d41586-021-02530-6 34545225 Perkel JM. Single-cell proteomics takes centre stage. Nature. 2021;597:580–2. 10.1038/d41586-021-02530-6. 34545225 10.1038/d41586-021-02530-6 99. Vistain LF Tay S Single-cell proteomics Trends Biochem Sci 2021 46 661 672 10.1016/j.tibs.2021.01.013 33653632 PMC11697639 Vistain LF, Tay S. Single-cell proteomics. Trends Biochem Sci. 2021;46:661–72. 10.1016/j.tibs.2021.01.013. 33653632 10.1016/j.tibs.2021.01.013 PMC11697639 100. Mund A Deep visual proteomics defines single-cell identity and heterogeneity Nat Biotechnol 2022 40 1231 1240 10.1038/s41587-022-01302-5 35590073 PMC9371970 Mund A, et al. Deep visual proteomics defines single-cell identity and heterogeneity. Nat Biotechnol. 2022;40:1231–40. 10.1038/s41587-022-01302-5. 35590073 10.1038/s41587-022-01302-5 PMC9371970 101. Slavov N Counting protein molecules for single-cell proteomics Cell 2022 185 232 234 10.1016/j.cell.2021.12.013 35063071 PMC8855622 Slavov N. Counting protein molecules for single-cell proteomics. Cell. 2022;185:232–4. 10.1016/j.cell.2021.12.013. 35063071 10.1016/j.cell.2021.12.013 PMC8855622 102. Bennett HM Stephenson W Rose CM Darmanis S Single-cell proteomics enabled by next-generation sequencing or mass spectrometry Nat Methods 2023 20 363 374 10.1038/s41592-023-01791-5 36864196 Bennett HM, Stephenson W, Rose CM, Darmanis S. Single-cell proteomics enabled by next-generation sequencing or mass spectrometry. Nat Methods. 2023;20:363–74. 10.1038/s41592-023-01791-5. 36864196 10.1038/s41592-023-01791-5 103. Gatto L Initial recommendations for performing, benchmarking and reporting single-cell proteomics experiments Nat Methods 2023 20 375 386 10.1038/s41592-023-01785-3 36864200 PMC10130941 Gatto L, et al. Initial recommendations for performing, benchmarking and reporting single-cell proteomics experiments. Nat Methods. 2023;20:375–86. 10.1038/s41592-023-01785-3. 36864200 10.1038/s41592-023-01785-3 PMC10130941 104. Stoeckius M Simultaneous epitope and transcriptome measurement in single cells Nat Methods 2017 14 865 868 10.1038/nmeth.4380 28759029 PMC5669064 Stoeckius M, et al. Simultaneous epitope and transcriptome measurement in single cells. Nat Methods. 2017;14:865–8. 10.1038/nmeth.4380. 28759029 10.1038/nmeth.4380 PMC5669064 105. Mimitou EP Multiplexed detection of proteins, transcriptomes, clonotypes and CRISPR perturbations in single cells Nat Methods 2019 16 409 412 10.1038/s41592-019-0392-0 31011186 PMC6557128 Mimitou EP, et al. Multiplexed detection of proteins, transcriptomes, clonotypes and CRISPR perturbations in single cells. Nat Methods. 2019;16:409–12. 10.1038/s41592-019-0392-0. 31011186 10.1038/s41592-019-0392-0 PMC6557128 106. Mimitou EP Scalable, multimodal profiling of chromatin accessibility, gene expression and protein levels in single cells Nat Biotechnol 2021 39 1246 1258 10.1038/s41587-021-00927-2 34083792 PMC8763625 Mimitou EP, et al. Scalable, multimodal profiling of chromatin accessibility, gene expression and protein levels in single cells. Nat Biotechnol. 2021;39:1246–58. 10.1038/s41587-021-00927-2. 34083792 10.1038/s41587-021-00927-2 PMC8763625 107. Chung H Joint single-cell measurements of nuclear proteins and RNA in vivo Nat Methods 2021 18 1204 1212 10.1038/s41592-021-01278-1 34608310 PMC8532076 Chung H, et al. Joint single-cell measurements of nuclear proteins and RNA in vivo. Nat Methods. 2021;18:1204–12. 10.1038/s41592-021-01278-1. 34608310 10.1038/s41592-021-01278-1 PMC8532076 108. Rivello F Single-cell intracellular epitope and transcript detection reveals signal transduction dynamics Cell Rep Methods 2021 1 100070 10.1016/j.crmeth.2021.100070 35474668 PMC9017125 Rivello F, et al. Single-cell intracellular epitope and transcript detection reveals signal transduction dynamics. Cell Rep Methods. 2021;1: 100070. 10.1016/j.crmeth.2021.100070. 35474668 10.1016/j.crmeth.2021.100070 PMC9017125 109. Li C Virgilio MC Collins KL Welch JD Multi-omic single-cell velocity models epigenome-transcriptome interactions and improves cell fate prediction Nat Biotechnol 2023 41 387 398 10.1038/s41587-022-01476-y 36229609 PMC10246490 Li C, Virgilio MC, Collins KL, Welch JD. Multi-omic single-cell velocity models epigenome-transcriptome interactions and improves cell fate prediction. Nat Biotechnol. 2023;41:387–98. 10.1038/s41587-022-01476-y. 36229609 10.1038/s41587-022-01476-y PMC10246490 110. Cui H ScGPT: toward building a foundation model for single-cell multi-omics using generative AI Nat Methods 2024 21 1470 1480 10.1038/s41592-024-02201-0 38409223 Cui H, et al. ScGPT: toward building a foundation model for single-cell multi-omics using generative AI. Nat Methods. 2024;21:1470–80. 10.1038/s41592-024-02201-0. 38409223 10.1038/s41592-024-02201-0 111. Chen J Larsson L Swarbrick A Lundeberg J Spatial landscapes of cancers: insights and opportunities Nat Rev Clin Oncol 2024 21 660 674 10.1038/s41571-024-00926-7 39043872 Chen J, Larsson L, Swarbrick A, Lundeberg J. Spatial landscapes of cancers: insights and opportunities. Nat Rev Clin Oncol. 2024;21:660–74. 10.1038/s41571-024-00926-7. 39043872 10.1038/s41571-024-00926-7 112. Gulati GS D’Silva JP Liu Y Wang L Newman AM Profiling cell identity and tissue architecture with single-cell and spatial transcriptomics Nat Rev Mol Cell Biol 2025 26 11 31 10.1038/s41580-024-00768-2 39169166 Gulati GS, D’Silva JP, Liu Y, Wang L, Newman AM. Profiling cell identity and tissue architecture with single-cell and spatial transcriptomics. Nat Rev Mol Cell Biol. 2025;26:11–31. 10.1038/s41580-024-00768-2. 39169166 10.1038/s41580-024-00768-2 113. Ospina OE spatialGE: quantification and visualization of the tumor microenvironment heterogeneity using spatial transcriptomics Bioinformatics (Oxford, England) 2022 38 2645 2647 10.1093/bioinformatics/btac145 35258565 PMC9890305 Ospina OE, et al. spatialGE: quantification and visualization of the tumor microenvironment heterogeneity using spatial transcriptomics. Bioinformatics (Oxford, England). 2022;38:2645–7. 10.1093/bioinformatics/btac145. 35258565 10.1093/bioinformatics/btac145 PMC9890305 114. Ospina OE spatialGE is a User-Friendly Web Application that Facilitates Spatial Transcriptomics Data Analysis Can Res 2024 10.1158/0008-5472.Can-24-2346 PMC11873723 39636739 Ospina OE, et al. spatialGE is a User-Friendly Web Application that Facilitates Spatial Transcriptomics Data Analysis. Can Res. 2024. 10.1158/0008-5472.Can-24-2346. 10.1158/0008-5472.CAN-24-2346 PMC11873723 39636739 115. Lu X Single-cell multi-omics analysis of human testicular germ cell tumor reveals its molecular features and microenvironment Nat Commun 2023 14 8462 10.1038/s41467-023-44305-9 38123589 PMC10733385 Lu X, et al. Single-cell multi-omics analysis of human testicular germ cell tumor reveals its molecular features and microenvironment. Nat Commun. 2023;14:8462. 10.1038/s41467-023-44305-9. 38123589 10.1038/s41467-023-44305-9 PMC10733385 116. Yousuf S Spatially Resolved Multi-Omics Single-Cell Analyses Inform Mechanisms of Immune Dysfunction in Pancreatic Cancer Gastroenterology 2023 165 891 908.e814 10.1053/j.gastro.2023.05.036 37263303 Yousuf S, et al. Spatially Resolved Multi-Omics Single-Cell Analyses Inform Mechanisms of Immune Dysfunction in Pancreatic Cancer. Gastroenterology. 2023;165:891-908.e814. 10.1053/j.gastro.2023.05.036. 37263303 10.1053/j.gastro.2023.05.036 117. Bian X Integration Analysis of Single-Cell Multi-Omics Reveals Prostate Cancer Heterogeneity Adv Sci (Weinh). 2024 11 e2305724 10.1002/advs.202305724 38483933 PMC11095148 Bian X, et al. Integration Analysis of Single-Cell Multi-Omics Reveals Prostate Cancer Heterogeneity. Adv Sci (Weinh). 2024;11:e2305724. 10.1002/advs.202305724. 38483933 10.1002/advs.202305724 PMC11095148 118. Nirmal AJ The spatial landscape of progression and immunoediting in primary melanoma at single-cell resolution Cancer Discov 2022 12 1518 41 10.1158/2159-8290.Cd-21-1357 35404441 PMC9167783 Nirmal AJ, et al. The spatial landscape of progression and immunoediting in primary melanoma at single-cell resolution. Cancer Discov. 2022;12:1518–41. 10.1158/2159-8290.Cd-21-1357. 35404441 10.1158/2159-8290.CD-21-1357 PMC9167783 119. Karimi E Single-cell spatial immune landscapes of primary and metastatic brain tumours Nature 2023 614 555 563 10.1038/s41586-022-05680-3 36725935 PMC9931580 Karimi E, et al. Single-cell spatial immune landscapes of primary and metastatic brain tumours. Nature. 2023;614:555–63. 10.1038/s41586-022-05680-3. 36725935 10.1038/s41586-022-05680-3 PMC9931580 120. Wang X Almet AA Nie Q The promising application of cell-cell interaction analysis in cancer from single-cell and spatial transcriptomics Semin Cancer Biol 2023 95 42 51 10.1016/j.semcancer.2023.07.001 37454878 PMC10627116 Wang X, Almet AA, Nie Q. The promising application of cell-cell interaction analysis in cancer from single-cell and spatial transcriptomics. Semin Cancer Biol. 2023;95:42–51. 10.1016/j.semcancer.2023.07.001. 37454878 10.1016/j.semcancer.2023.07.001 PMC10627116 121. Young MD Single-cell transcriptomes from human kidneys reveal the cellular identity of renal tumors Science 2018 361 594 599 10.1126/science.aat1699 30093597 PMC6104812 Young MD, et al. Single-cell transcriptomes from human kidneys reveal the cellular identity of renal tumors. Science. 2018;361:594–9. 10.1126/science.aat1699. 30093597 10.1126/science.aat1699 PMC6104812 122. Zhang Y Single-cell analyses of renal cell cancers reveal insights into tumor microenvironment, cell of origin, and therapy response Proc Natl Acad Sci U S A 2021 10.1073/pnas.2103240118 34099557 PMC8214680 Zhang Y, et al. Single-cell analyses of renal cell cancers reveal insights into tumor microenvironment, cell of origin, and therapy response. Proc Natl Acad Sci U S A. 2021. 10.1073/pnas.2103240118. 34099557 10.1073/pnas.2103240118 PMC8214680 123. Cao J Decoder-seq enhances mRNA capture efficiency in spatial RNA sequencing Nat Biotechnol 2024 42 1735 1746 10.1038/s41587-023-02086-y 38228777 Cao J, et al. Decoder-seq enhances mRNA capture efficiency in spatial RNA sequencing. Nat Biotechnol. 2024;42:1735–46. 10.1038/s41587-023-02086-y. 38228777 10.1038/s41587-023-02086-y 124. Zhang C Single-nucleus sequencing unveils heterogeneity in renal cell carcinomas microenvironment: insights into pathogenic origins and treatment-responsive cellular subgroups Cancer Lett 2024 604 217259 10.1016/j.canlet.2024.217259 39278398 Zhang C, et al. Single-nucleus sequencing unveils heterogeneity in renal cell carcinomas microenvironment: insights into pathogenic origins and treatment-responsive cellular subgroups. Cancer Lett. 2024;604: 217259. 10.1016/j.canlet.2024.217259. 39278398 10.1016/j.canlet.2024.217259 125. Cohen HT McGovern FJ Renal-cell carcinoma N Engl J Med 2005 353 2477 2490 10.1056/NEJMra043172 16339096 Cohen HT, McGovern FJ. Renal-cell carcinoma. N Engl J Med. 2005;353:2477–90. 10.1056/NEJMra043172. 16339096 10.1056/NEJMra043172 126. Turajlic S Swanton C Boshoff C Kidney cancer: The next decade J Exp Med 2018 215 2477 2479 10.1084/jem.20181617 30217855 PMC6170181 Turajlic S, Swanton C, Boshoff C. Kidney cancer: The next decade. J Exp Med. 2018;215:2477–9. 10.1084/jem.20181617. 30217855 10.1084/jem.20181617 PMC6170181 127. Lv D Genetic and epigenetic control of UNC5C expression in human renal cell carcinoma Eur J Cancer 2011 47 2068 76 10.1016/j.ejca.2011.04.021 21600761 Lv D, et al. Genetic and epigenetic control of UNC5C expression in human renal cell carcinoma. Eur J Cancer. 2011;47:2068–76. 10.1016/j.ejca.2011.04.021. 21600761 10.1016/j.ejca.2011.04.021 128. Motzer RJ Bander NH Nanus DM Renal-cell carcinoma N Engl J Med 1996 335 865 875 10.1056/nejm199609193351207 8778606 Motzer RJ, Bander NH, Nanus DM. Renal-cell carcinoma. N Engl J Med. 1996;335:865–75. 10.1056/nejm199609193351207. 8778606 10.1056/NEJM199609193351207 129. Shimazui T Alterations in expression of cadherin-6 and E-cadherin during kidney development and in renal cell carcinoma Eur Urol 2000 38 331 338 10.1159/000020302 10940709 Shimazui T, et al. Alterations in expression of cadherin-6 and E-cadherin during kidney development and in renal cell carcinoma. Eur Urol. 2000;38:331–8. 10.1159/000020302. 10940709 10.1159/000020302 130. Zhang M Single cell analysis reveals intra-tumour heterogeneity, microenvironment and potential diagnosis markers for clear cell renal cell carcinoma Clin Transl Med 2022 12 e713 10.1002/ctm2.713 35605062 PMC9126499 Zhang M, et al. Single cell analysis reveals intra-tumour heterogeneity, microenvironment and potential diagnosis markers for clear cell renal cell carcinoma. Clin Transl Med. 2022;12: e713. 10.1002/ctm2.713. 35605062 10.1002/ctm2.713 PMC9126499 131. Davidson G Mesenchymal-like Tumor Cells and Myofibroblastic Cancer-Associated Fibroblasts Are Associated with Progression and Immunotherapy Response of Clear Cell Renal Cell Carcinoma Can Res 2023 83 2952 2969 10.1158/0008-5472.Can-22-3034 37335139 Davidson G, et al. Mesenchymal-like Tumor Cells and Myofibroblastic Cancer-Associated Fibroblasts Are Associated with Progression and Immunotherapy Response of Clear Cell Renal Cell Carcinoma. Can Res. 2023;83:2952–69. 10.1158/0008-5472.Can-22-3034. 10.1158/0008-5472.CAN-22-3034 37335139 132. Pan XW Molecular subtyping and characterization of clear cell renal cell carcinoma by tumor differentiation trajectories iScience 2023 26 108370 10.1016/j.isci.2023.108370 38034348 PMC10682269 Pan XW, et al. Molecular subtyping and characterization of clear cell renal cell carcinoma by tumor differentiation trajectories. iScience. 2023;26: 108370. 10.1016/j.isci.2023.108370. 38034348 10.1016/j.isci.2023.108370 PMC10682269 133. Peired AJ Acute kidney injury promotes development of papillary renal cell adenoma and carcinoma from renal progenitor cells Sci Transl Med 2020 10.1126/scitranslmed.aaw6003 32213630 Peired AJ, et al. Acute kidney injury promotes development of papillary renal cell adenoma and carcinoma from renal progenitor cells. Sci Transl Med. 2020. 10.1126/scitranslmed.aaw6003. 32213630 10.1126/scitranslmed.aaw6003 134. Li GX Comprehensive proteogenomic characterization of rare kidney tumors Cell Rep Med 2024 5 101547 10.1016/j.xcrm.2024.101547 38703764 PMC11148773 Li GX, et al. Comprehensive proteogenomic characterization of rare kidney tumors. Cell Rep Med. 2024;5: 101547. 10.1016/j.xcrm.2024.101547. 38703764 10.1016/j.xcrm.2024.101547 PMC11148773 135. Lindgren D Sjölund J Axelson H Tracing renal cell carcinomas back to the nephron Trends Cancer 2018 4 472 484 10.1016/j.trecan.2018.05.003 29937046 Lindgren D, Sjölund J, Axelson H. Tracing renal cell carcinomas back to the nephron. Trends Cancer. 2018;4:472–84. 10.1016/j.trecan.2018.05.003. 29937046 10.1016/j.trecan.2018.05.003 136. Wang Q Single-cell chromatin accessibility landscape in kidney identifies additional cell-of-origin in heterogenous papillary renal cell carcinoma Nat Commun 2022 13 31 10.1038/s41467-021-27660-3 35013217 PMC8748507 Wang Q, et al. Single-cell chromatin accessibility landscape in kidney identifies additional cell-of-origin in heterogenous papillary renal cell carcinoma. Nat Commun. 2022;13: 31. 10.1038/s41467-021-27660-3. 35013217 10.1038/s41467-021-27660-3 PMC8748507 137. Henske EP Cheng L Hakimi AA Choueiri TK Braun DA Chromophobe renal cell carcinoma Cancer Cell 2023 41 8 1383 8 10.1016/j.ccell.2023.07.006 37541245 Henske EP, Cheng L, Hakimi AA, Choueiri TK, Braun DA. Chromophobe renal cell carcinoma. Cancer Cell. 2023;41(8):1383–8. 10.1016/j.ccell.2023.07.006. 37541245 10.1016/j.ccell.2023.07.006 138. Skala SL Next-generation RNA sequencing-based biomarker characterization of chromophobe renal cell carcinoma and related oncocytic neoplasms Eur Urol 2020 78 63 74 10.1016/j.eururo.2020.03.003 32299640 PMC8996310 Skala SL, et al. Next-generation RNA sequencing-based biomarker characterization of chromophobe renal cell carcinoma and related oncocytic neoplasms. Eur Urol. 2020;78:63–74. 10.1016/j.eururo.2020.03.003. 32299640 10.1016/j.eururo.2020.03.003 PMC8996310 139. Stupar Z Wilms' tumour may also develop from impaired differentiation of the ureteric bud Histopathology 2007 51 265 268 10.1111/j.1365-2559.2007.02741.x 17650220 Stupar Z, et al. Wilms’ tumour may also develop from impaired differentiation of the ureteric bud. Histopathology. 2007;51:265–8. 10.1111/j.1365-2559.2007.02741.x. 17650220 10.1111/j.1365-2559.2007.02741.x 140. Aiden AP Wilms tumor chromatin profiles highlight stem cell properties and a renal developmental network Cell Stem Cell 2010 6 591 602 10.1016/j.stem.2010.03.016 20569696 PMC2897075 Aiden AP, et al. Wilms tumor chromatin profiles highlight stem cell properties and a renal developmental network. Cell Stem Cell. 2010;6:591–602. 10.1016/j.stem.2010.03.016. 20569696 10.1016/j.stem.2010.03.016 PMC2897075 141. Petrosyan A Identification and Characterization of the Wilms Tumor Cancer Stem Cell Adv Sci (Weinh). 2023 10 e2206787 10.1002/advs.202206787 37114795 PMC10369255 Petrosyan A, et al. Identification and Characterization of the Wilms Tumor Cancer Stem Cell. Adv Sci (Weinh). 2023;10:e2206787. 10.1002/advs.202206787. 37114795 10.1002/advs.202206787 PMC10369255 142. Jikuya R Comparative analyses define differences between BHD-associated renal tumour and sporadic chromophobe renal cell carcinoma EBioMedicine 2023 92 104596 10.1016/j.ebiom.2023.104596 37182269 PMC10200853 Jikuya R, et al. Comparative analyses define differences between BHD-associated renal tumour and sporadic chromophobe renal cell carcinoma. EBioMedicine. 2023;92: 104596. 10.1016/j.ebiom.2023.104596. 37182269 10.1016/j.ebiom.2023.104596 PMC10200853 143. Jikuya R Single-cell transcriptomes underscore genetically distinct tumor characteristics and microenvironment for hereditary kidney cancers iScience 2022 25 104463 10.1016/j.isci.2022.104463 35874919 PMC9301876 Jikuya R, et al. Single-cell transcriptomes underscore genetically distinct tumor characteristics and microenvironment for hereditary kidney cancers. iScience. 2022;25:104463. 10.1016/j.isci.2022.104463. 35874919 10.1016/j.isci.2022.104463 PMC9301876 144. Vokshi BH SMARCB1 regulates a TFCP2L1-MYC transcriptional switch promoting renal medullary carcinoma transformation and ferroptosis resistance Nat Commun 2023 14 3034 10.1038/s41467-023-38472-y 37236926 PMC10220073 Vokshi BH, et al. SMARCB1 regulates a TFCP2L1-MYC transcriptional switch promoting renal medullary carcinoma transformation and ferroptosis resistance. Nat Commun. 2023;14:3034. 10.1038/s41467-023-38472-y. 37236926 10.1038/s41467-023-38472-y PMC10220073 145. Pan XW Identification of a novel cancer stem cell subpopulation that promotes progression of human fatal renal cell carcinoma by single-cell RNA-seq analysis Int J Biol Sci 2020 16 3149 62 10.7150/ijbs.46645 33162821 PMC7645996 Pan XW, et al. Identification of a novel cancer stem cell subpopulation that promotes progression of human fatal renal cell carcinoma by single-cell RNA-seq analysis. Int J Biol Sci. 2020;16:3149–62. 10.7150/ijbs.46645. 33162821 10.7150/ijbs.46645 PMC7645996 146. Li C Single-cell exome sequencing identifies mutations in KCP, LOC440040, and LOC440563 as drivers in renal cell carcinoma stem cells Cell Res 2017 27 590 593 10.1038/cr.2016.150 27981968 PMC5385607 Li C, et al. Single-cell exome sequencing identifies mutations in KCP, LOC440040, and LOC440563 as drivers in renal cell carcinoma stem cells. Cell Res. 2017;27:590–3. 10.1038/cr.2016.150. 27981968 10.1038/cr.2016.150 PMC5385607 147. Huang Y Hong W Wei X The molecular mechanisms and therapeutic strategies of EMT in tumor progression and metastasis J Hematol Oncol 2022 15 129 10.1186/s13045-022-01347-8 36076302 PMC9461252 Huang Y, Hong W, Wei X. The molecular mechanisms and therapeutic strategies of EMT in tumor progression and metastasis. J Hematol Oncol. 2022;15:129. 10.1186/s13045-022-01347-8. 36076302 10.1186/s13045-022-01347-8 PMC9461252 148. Mittal V Epithelial mesenchymal transition in tumor metastasis Annu Rev Pathol 2018 13 395 412 10.1146/annurev-pathol-020117-043854 29414248 Mittal V. Epithelial mesenchymal transition in tumor metastasis. Annu Rev Pathol. 2018;13:395–412. 10.1146/annurev-pathol-020117-043854. 29414248 10.1146/annurev-pathol-020117-043854 149. Gavish A Hallmarks of transcriptional intratumour heterogeneity across a thousand tumours Nature 2023 618 598 606 10.1038/s41586-023-06130-4 37258682 Gavish A, et al. Hallmarks of transcriptional intratumour heterogeneity across a thousand tumours. Nature. 2023;618:598–606. 10.1038/s41586-023-06130-4. 37258682 10.1038/s41586-023-06130-4 150. Li R Mapping single-cell transcriptomes in the intra-tumoral and associated territories of kidney cancer Cancer Cell 2022 40 1583 1599.e1510 10.1016/j.ccell.2022.11.001 36423636 PMC9767677 Li R, et al. Mapping single-cell transcriptomes in the intra-tumoral and associated territories of kidney cancer. Cancer Cell. 2022;40:1583-1599.e1510. 10.1016/j.ccell.2022.11.001. 36423636 10.1016/j.ccell.2022.11.001 PMC9767677 151. Zhong Z Domain generalization enables general cancer cell annotation in single-cell and spatial transcriptomics Nat Commun 2024 15 1929 10.1038/s41467-024-46413-6 38431724 PMC10908802 Zhong Z, et al. Domain generalization enables general cancer cell annotation in single-cell and spatial transcriptomics. Nat Commun. 2024;15:1929. 10.1038/s41467-024-46413-6. 38431724 10.1038/s41467-024-46413-6 PMC10908802 152. Barkley D Cancer cell states recur across tumor types and form specific interactions with the tumor microenvironment Nat Genet 2022 54 1192 1201 10.1038/s41588-022-01141-9 35931863 PMC9886402 Barkley D, et al. Cancer cell states recur across tumor types and form specific interactions with the tumor microenvironment. Nat Genet. 2022;54:1192–201. 10.1038/s41588-022-01141-9. 35931863 10.1038/s41588-022-01141-9 PMC9886402 153. Kinker GS Pan-cancer single-cell RNA-seq identifies recurring programs of cellular heterogeneity Nat Genet 2020 52 1208 1218 10.1038/s41588-020-00726-6 33128048 PMC8135089 Kinker GS, et al. Pan-cancer single-cell RNA-seq identifies recurring programs of cellular heterogeneity. Nat Genet. 2020;52:1208–18. 10.1038/s41588-020-00726-6. 33128048 10.1038/s41588-020-00726-6 PMC8135089 154. Malta TM Machine Learning Identifies Stemness Features Associated with Oncogenic Dedifferentiation Cell 2018 173 338 354.e315 10.1016/j.cell.2018.03.034 29625051 PMC5902191 Malta TM, et al. Machine Learning Identifies Stemness Features Associated with Oncogenic Dedifferentiation. Cell. 2018;173:338-354.e315. 10.1016/j.cell.2018.03.034. 29625051 10.1016/j.cell.2018.03.034 PMC5902191 155. Chen WJ Single-cell RNA-seq integrated with multi-omics reveals SERPINE2 as a target for metastasis in advanced renal cell carcinoma Cell Death Dis 2023 14 30 10.1038/s41419-023-05566-w 36646679 PMC9842647 Chen WJ, et al. Single-cell RNA-seq integrated with multi-omics reveals SERPINE2 as a target for metastasis in advanced renal cell carcinoma. Cell Death Dis. 2023;14:30. 10.1038/s41419-023-05566-w. 36646679 10.1038/s41419-023-05566-w PMC9842647 156. Zhang P Integrated bulk and single-cell transcriptome data identify clinically relevant cell populations in clear cell renal cell carcinoma Genes Dis 2024 11 42 45 10.1016/j.gendis.2023.03.007 37588222 PMC10425786 Zhang P, et al. Integrated bulk and single-cell transcriptome data identify clinically relevant cell populations in clear cell renal cell carcinoma. Genes Dis. 2024;11:42–5. 10.1016/j.gendis.2023.03.007. 37588222 10.1016/j.gendis.2023.03.007 PMC10425786 157. Chen S Macrophages in immunoregulation and therapeutics Signal Transduct Target Ther 2023 8 207 10.1038/s41392-023-01452-1 37211559 PMC10200802 Chen S, et al. Macrophages in immunoregulation and therapeutics. Signal Transduct Target Ther. 2023;8:207. 10.1038/s41392-023-01452-1. 37211559 10.1038/s41392-023-01452-1 PMC10200802 158. Mantovani A Marchesi F Malesci A Laghi L Allavena P Tumour-associated macrophages as treatment targets in oncology Nat Rev Clin Oncol 2017 14 399 416 10.1038/nrclinonc.2016.217 28117416 PMC5480600 Mantovani A, Marchesi F, Malesci A, Laghi L, Allavena P. Tumour-associated macrophages as treatment targets in oncology. Nat Rev Clin Oncol. 2017;14:399–416. 10.1038/nrclinonc.2016.217. 28117416 10.1038/nrclinonc.2016.217 PMC5480600 159. Pello OM Role of c-MYC in alternative activation of human macrophages and tumor-associated macrophage biology Blood 2012 119 411 421 10.1182/blood-2011-02-339911 22067385 Pello OM, et al. Role of c-MYC in alternative activation of human macrophages and tumor-associated macrophage biology. Blood. 2012;119:411–21. 10.1182/blood-2011-02-339911. 22067385 10.1182/blood-2011-02-339911 160. Baer C Suppression of microrna activity amplifies IFN-γ-induced macrophage activation and promotes anti-tumour immunity Nat Cell Biol 2016 18 790 802 10.1038/ncb3371 27295554 Baer C, et al. Suppression of microrna activity amplifies IFN-γ-induced macrophage activation and promotes anti-tumour immunity. Nat Cell Biol. 2016;18:790–802. 10.1038/ncb3371. 27295554 10.1038/ncb3371 161. Locati M Curtale G Mantovani A Diversity, mechanisms, and significance of macrophage plasticity Annu Rev Pathol 2020 15 123 147 10.1146/annurev-pathmechdis-012418-012718 31530089 PMC7176483 Locati M, Curtale G, Mantovani A. Diversity, mechanisms, and significance of macrophage plasticity. Annu Rev Pathol. 2020;15:123–47. 10.1146/annurev-pathmechdis-012418-012718. 31530089 10.1146/annurev-pathmechdis-012418-012718 PMC7176483 162. Du H An integrated analysis of bulk and single-cell sequencing data reveals that EMP1(+)/COL3A1(+) fibroblasts contribute to the bone metastasis process in breast, prostate, and renal cancers Front Immunol 2023 14 1313536 10.3389/fimmu.2023.1313536 38187400 PMC10770257 Du H, et al. An integrated analysis of bulk and single-cell sequencing data reveals that EMP1(+)/COL3A1(+) fibroblasts contribute to the bone metastasis process in breast, prostate, and renal cancers. Front Immunol. 2023;14: 1313536. 10.3389/fimmu.2023.1313536. 38187400 10.3389/fimmu.2023.1313536 PMC10770257 163. Ma F Single-cell profiling of the microenvironment in human bone metastatic renal cell carcinoma 2024 7 91 10.1038/s42003-024-05772-y PMC10786927 38216635 Ma F, et al. Single-cell profiling of the microenvironment in human bone metastatic renal cell carcinoma. 2024;7:91. 10.1038/s42003-024-05772-y PMC10786927 38216635 164. Talia M Cancer-associated fibroblasts (CAFs) gene signatures predict outcomes in breast and prostate tumor patients J Transl Med 2024 22 597 10.1186/s12967-024-05413-2 38937754 PMC11210052 Talia M, et al. Cancer-associated fibroblasts (CAFs) gene signatures predict outcomes in breast and prostate tumor patients. J Transl Med. 2024;22:597. 10.1186/s12967-024-05413-2. 38937754 10.1186/s12967-024-05413-2 PMC11210052 165. Schipper J Loss of microrna-21 leads to profound stromal remodeling and short survival in K-Ras-driven mouse models of pancreatic cancer Int J Cancer 2020 147 2265 78 10.1002/ijc.33041 32388866 Schipper J, et al. Loss of microrna-21 leads to profound stromal remodeling and short survival in K-Ras-driven mouse models of pancreatic cancer. Int J Cancer. 2020;147:2265–78. 10.1002/ijc.33041. 32388866 10.1002/ijc.33041 166. Goetz JG Biomechanical remodeling of the microenvironment by stromal caveolin-1 favors tumor invasion and metastasis Cell 2011 146 148 163 10.1016/j.cell.2011.05.040 21729786 PMC3244213 Goetz JG, et al. Biomechanical remodeling of the microenvironment by stromal caveolin-1 favors tumor invasion and metastasis. Cell. 2011;146:148–63. 10.1016/j.cell.2011.05.040. 21729786 10.1016/j.cell.2011.05.040 PMC3244213 167. Radtke AJ Multi-omic profiling of follicular lymphoma reveals changes in tissue architecture and enhanced stromal remodeling in high-risk patients Cancer Cell 2024 42 444 463.e410 10.1016/j.ccell.2024.02.001 38428410 PMC10966827 Radtke AJ, et al. Multi-omic profiling of follicular lymphoma reveals changes in tissue architecture and enhanced stromal remodeling in high-risk patients. Cancer Cell. 2024;42:444-463.e410. 10.1016/j.ccell.2024.02.001. 38428410 10.1016/j.ccell.2024.02.001 PMC10966827 168. Cox TR Erler JT Remodeling and homeostasis of the extracellular matrix: implications for fibrotic diseases and cancer Dis Model Mech 2011 4 165 178 10.1242/dmm.004077 21324931 PMC3046088 Cox TR, Erler JT. Remodeling and homeostasis of the extracellular matrix: implications for fibrotic diseases and cancer. Dis Model Mech. 2011;4:165–78. 10.1242/dmm.004077. 21324931 10.1242/dmm.004077 PMC3046088 169. Levental KR Matrix crosslinking forces tumor progression by enhancing integrin signaling Cell 2009 139 891 906 10.1016/j.cell.2009.10.027 19931152 PMC2788004 Levental KR, et al. Matrix crosslinking forces tumor progression by enhancing integrin signaling. Cell. 2009;139:891–906. 10.1016/j.cell.2009.10.027. 19931152 10.1016/j.cell.2009.10.027 PMC2788004 170. Pankova D Cancer-Associated Fibroblasts Induce a Collagen Cross-link Switch in Tumor Stroma Molecular cancer research : MCR 2016 14 287 295 10.1158/1541-7786.Mcr-15-0307 26631572 PMC4794404 Pankova D, et al. Cancer-Associated Fibroblasts Induce a Collagen Cross-link Switch in Tumor Stroma. Molecular cancer research : MCR. 2016;14:287–95. 10.1158/1541-7786.Mcr-15-0307. 26631572 10.1158/1541-7786.MCR-15-0307 PMC4794404 171. Friedl P Wolf K Proteolytic interstitial cell migration: a five-step process Cancer Metastasis Rev 2009 28 129 135 10.1007/s10555-008-9174-3 19153672 Friedl P, Wolf K. Proteolytic interstitial cell migration: a five-step process. Cancer Metastasis Rev. 2009;28:129–35. 10.1007/s10555-008-9174-3. 19153672 10.1007/s10555-008-9174-3 172. Yu M Circulating breast tumor cells exhibit dynamic changes in epithelial and mesenchymal composition Science 2013 339 580 584 10.1126/science.1228522 23372014 PMC3760262 Yu M, et al. Circulating breast tumor cells exhibit dynamic changes in epithelial and mesenchymal composition. Science. 2013;339:580–4. 10.1126/science.1228522. 23372014 10.1126/science.1228522 PMC3760262 173. Naba A Extracellular matrix signatures of human primary metastatic colon cancers and their metastases to liver BMC Cancer 2014 14 518 10.1186/1471-2407-14-518 25037231 PMC4223627 Naba A, et al. Extracellular matrix signatures of human primary metastatic colon cancers and their metastases to liver. BMC Cancer. 2014;14:518. 10.1186/1471-2407-14-518. 25037231 10.1186/1471-2407-14-518 PMC4223627 174. Yuzhalin AE Colorectal cancer liver metastatic growth depends on PAD4-driven citrullination of the extracellular matrix Nat Commun 2018 9 4783 10.1038/s41467-018-07306-7 30429478 PMC6235861 Yuzhalin AE, et al. Colorectal cancer liver metastatic growth depends on PAD4-driven citrullination of the extracellular matrix. Nat Commun. 2018;9:4783. 10.1038/s41467-018-07306-7. 30429478 10.1038/s41467-018-07306-7 PMC6235861 175. Alchahin AM A transcriptional metastatic signature predicts survival in clear cell renal cell carcinoma Nat Commun 2022 13 5747 10.1038/s41467-022-33375-w 36180422 PMC9525645 Alchahin AM, et al. A transcriptional metastatic signature predicts survival in clear cell renal cell carcinoma. Nat Commun. 2022;13:5747. 10.1038/s41467-022-33375-w. 36180422 10.1038/s41467-022-33375-w PMC9525645 176. Shi Y Decoding the multicellular ecosystem of vena caval tumor thrombus in clear cell renal cell carcinoma by single-cell RNA sequencing Genome Biol 2022 23 87 10.1186/s13059-022-02651-9 35361264 PMC8969307 Shi Y, et al. Decoding the multicellular ecosystem of vena caval tumor thrombus in clear cell renal cell carcinoma by single-cell RNA sequencing. Genome Biol. 2022;23:87. 10.1186/s13059-022-02651-9. 35361264 10.1186/s13059-022-02651-9 PMC8969307 177. Zvirblyte J Single-cell transcriptional profiling of clear cell renal cell carcinoma reveals a tumor-associated endothelial tip cell phenotype Commun Biol 2024 7 780 10.1038/s42003-024-06478-x 38942917 PMC11213875 Zvirblyte J, et al. Single-cell transcriptional profiling of clear cell renal cell carcinoma reveals a tumor-associated endothelial tip cell phenotype. Commun Biol. 2024;7:780. 10.1038/s42003-024-06478-x. 38942917 10.1038/s42003-024-06478-x PMC11213875 178. Linehan WM The metabolic basis of kidney cancer Cancer Discov 2019 9 1006 21 10.1158/2159-8290.Cd-18-1354 31088840 Linehan WM, et al. The metabolic basis of kidney cancer. Cancer Discov. 2019;9:1006–21. 10.1158/2159-8290.Cd-18-1354. 31088840 10.1158/2159-8290.CD-18-1354 179. Chen X TRIM21 attenuates renal carcinoma lipogenesis and malignancy by regulating SREBF1 protein stability Journal of experimental & clinical cancer research : CR 2023 42 34 10.1186/s13046-022-02583-z 36694250 PMC9875457 Chen X, et al. TRIM21 attenuates renal carcinoma lipogenesis and malignancy by regulating SREBF1 protein stability. Journal of experimental & clinical cancer research : CR. 2023;42:34. 10.1186/s13046-022-02583-z. 36694250 10.1186/s13046-022-02583-z PMC9875457 180. Davis CF The somatic genomic landscape of chromophobe renal cell carcinoma Cancer Cell 2014 26 319 330 10.1016/j.ccr.2014.07.014 25155756 PMC4160352 Davis CF, et al. The somatic genomic landscape of chromophobe renal cell carcinoma. Cancer Cell. 2014;26:319–30. 10.1016/j.ccr.2014.07.014. 25155756 10.1016/j.ccr.2014.07.014 PMC4160352 181. Bezwada D Mitochondrial complex i promotes kidney cancer metastasis Nature 2024 633 923 931 10.1038/s41586-024-07812-3 39143213 PMC11424252 Bezwada D, et al. Mitochondrial complex i promotes kidney cancer metastasis. Nature. 2024;633:923–31. 10.1038/s41586-024-07812-3. 39143213 10.1038/s41586-024-07812-3 PMC11424252 182. Yong C Stewart GD Frezza C Oncometabolites in renal cancer Nat Rev Nephrol 2020 16 156 172 10.1038/s41581-019-0210-z 31636445 PMC7030949 Yong C, Stewart GD, Frezza C. Oncometabolites in renal cancer. Nat Rev Nephrol. 2020;16:156–72. 10.1038/s41581-019-0210-z. 31636445 10.1038/s41581-019-0210-z PMC7030949 183. Wettersten HI, Aboud OA, Lara PN Jr, Weiss RH. Metabolic reprogramming in clear cell renal cell carcinoma. Nat Rev Nephrol. 2017;13:410–9. 10.1038/nrneph.2017.59. 10.1038/nrneph.2017.59 28480903 184. Courtney KD Isotope Tracing of Human Clear Cell Renal Cell Carcinomas Demonstrates Suppressed Glucose Oxidation In Vivo Cell Metab 2018 28 793 800.e792 10.1016/j.cmet.2018.07.020 30146487 PMC6221993 Courtney KD, et al. Isotope Tracing of Human Clear Cell Renal Cell Carcinomas Demonstrates Suppressed Glucose Oxidation In Vivo. Cell Metab. 2018;28:793-800.e792. 10.1016/j.cmet.2018.07.020. 30146487 10.1016/j.cmet.2018.07.020 PMC6221993 185. Riscal R Cholesterol auxotrophy as a targetable vulnerability in clear cell renal cell carcinoma Cancer Discov 2021 11 3106 25 10.1158/2159-8290.Cd-21-0211 34244212 PMC8741905 Riscal R, et al. Cholesterol auxotrophy as a targetable vulnerability in clear cell renal cell carcinoma. Cancer Discov. 2021;11:3106–25. 10.1158/2159-8290.Cd-21-0211. 34244212 10.1158/2159-8290.CD-21-0211 PMC8741905 186. Tan SK Hougen HY Merchan JR Gonzalgo ML Welford SM Fatty acid metabolism reprogramming in ccRCC: mechanisms and potential targets Nat Rev Urol 2023 20 48 60 10.1038/s41585-022-00654-6 36192502 PMC10826284 Tan SK, Hougen HY, Merchan JR, Gonzalgo ML, Welford SM. Fatty acid metabolism reprogramming in ccRCC: mechanisms and potential targets. Nat Rev Urol. 2023;20:48–60. 10.1038/s41585-022-00654-6. 36192502 10.1038/s41585-022-00654-6 PMC10826284 187. Rao H SETD2 deficiency accelerates sphingomyelin accumulation and promotes the development of renal cancer Nat Commun 2023 14 7572 10.1038/s41467-023-43378-w 37989747 PMC10663509 Rao H, et al. SETD2 deficiency accelerates sphingomyelin accumulation and promotes the development of renal cancer. Nat Commun. 2023;14:7572. 10.1038/s41467-023-43378-w. 37989747 10.1038/s41467-023-43378-w PMC10663509 188. Wang D GPR1 and CMKLR1 Control Lipid Metabolism to Support the Development of Clear Cell Renal Cell Carcinoma Can Res 2024 84 2141 2154 10.1158/0008-5472.Can-23-2926 PMC11290988 38640229 Wang D, et al. GPR1 and CMKLR1 Control Lipid Metabolism to Support the Development of Clear Cell Renal Cell Carcinoma. Can Res. 2024;84:2141–54. 10.1158/0008-5472.Can-23-2926. 10.1158/0008-5472.CAN-23-2926 PMC11290988 38640229 189. Zhou L Fatty Acid Oxidation Mediated by Malonyl-CoA Decarboxylase Represses Renal Cell Carcinoma Progression Can Res 2023 83 3920 3939 10.1158/0008-5472.Can-23-0969 PMC10690093 37729394 Zhou L, et al. Fatty Acid Oxidation Mediated by Malonyl-CoA Decarboxylase Represses Renal Cell Carcinoma Progression. Can Res. 2023;83:3920–39. 10.1158/0008-5472.Can-23-0969. 10.1158/0008-5472.CAN-23-0969 PMC10690093 37729394 190. Hu J Multi-omic profiling of clear cell renal cell carcinoma identifies metabolic reprogramming associated with disease progression Nat Genet 2024 56 442 457 10.1038/s41588-024-01662-5 38361033 PMC10937392 Hu J, et al. Multi-omic profiling of clear cell renal cell carcinoma identifies metabolic reprogramming associated with disease progression. Nat Genet. 2024;56:442–57. 10.1038/s41588-024-01662-5. 38361033 10.1038/s41588-024-01662-5 PMC10937392 191. Bischoff ME Copper drives remodeling of metabolic state and progression of clear cell renal cell carcinoma Cancer Discov 2024 10.1158/2159-8290.Cd-24-0187 PMC11803400 39476412 Bischoff ME, et al. Copper drives remodeling of metabolic state and progression of clear cell renal cell carcinoma. Cancer Discov. 2024. 10.1158/2159-8290.Cd-24-0187. 10.1158/2159-8290.CD-24-0187 PMC11803400 39476412 192. Shang Y Zeng J Mai J Xiao J Metabolic reprogramming landscape of pan-cancer by single-cell transcriptome data integration Sci Bull 2024 10.1016/j.scib.2024.10.026 39500689 Shang Y, Zeng J, Mai J, Xiao J. Metabolic reprogramming landscape of pan-cancer by single-cell transcriptome data integration. Sci Bull. 2024. 10.1016/j.scib.2024.10.026. 10.1016/j.scib.2024.10.026 39500689 193. Zhuang W Shi X Gao S Qin X Restoring gluconeogenesis by TEF inhibited proliferation and promoted apoptosis and immune surveillance in kidney renal clear cell carcinoma Cancer Metab 2023 11 11 10.1186/s40170-023-00312-4 37553601 PMC10410999 Zhuang W, Shi X, Gao S, Qin X. Restoring gluconeogenesis by TEF inhibited proliferation and promoted apoptosis and immune surveillance in kidney renal clear cell carcinoma. Cancer Metab. 2023;11:11. 10.1186/s40170-023-00312-4. 37553601 10.1186/s40170-023-00312-4 PMC10410999 194. Xiao Y Endocytosis-Mediated Replenishment of Amino Acids Favors Cancer Cell Proliferation and Survival in Chromophobe Renal Cell Carcinoma Can Res 2020 80 5491 5501 10.1158/0008-5472.Can-20-1998 33115803 Xiao Y, et al. Endocytosis-Mediated Replenishment of Amino Acids Favors Cancer Cell Proliferation and Survival in Chromophobe Renal Cell Carcinoma. Can Res. 2020;80:5491–501. 10.1158/0008-5472.Can-20-1998. 10.1158/0008-5472.CAN-20-1998 33115803 195. Hu J Single-Cell Transcriptome Analysis Reveals Intratumoral Heterogeneity in ccRCC, which Results in Different Clinical Outcomes Molecular therapy : the journal of the American Society of Gene Therapy 2020 28 1658 1672 10.1016/j.ymthe.2020.04.023 32396851 PMC7335756 Hu J, et al. Single-Cell Transcriptome Analysis Reveals Intratumoral Heterogeneity in ccRCC, which Results in Different Clinical Outcomes. Molecular therapy : the journal of the American Society of Gene Therapy. 2020;28:1658–72. 10.1016/j.ymthe.2020.04.023. 32396851 10.1016/j.ymthe.2020.04.023 PMC7335756 196. Arbiser JL Reactive oxygen generated by Nox1 triggers the angiogenic switch Proc Natl Acad Sci USA 2002 99 715 20 10.1073/pnas.022630199 11805326 PMC117371 Arbiser JL, et al. Reactive oxygen generated by Nox1 triggers the angiogenic switch. Proc Natl Acad Sci USA. 2002;99:715–20. 10.1073/pnas.022630199. 11805326 10.1073/pnas.022630199 PMC117371 197. Martinez-Outschoorn UE Lisanti MP Sotgia F Catabolic cancer-associated fibroblasts transfer energy and biomass to anabolic cancer cells, fueling tumor growth Semin Cancer Biol 2014 25 47 60 10.1016/j.semcancer.2014.01.005 24486645 Martinez-Outschoorn UE, Lisanti MP, Sotgia F. Catabolic cancer-associated fibroblasts transfer energy and biomass to anabolic cancer cells, fueling tumor growth. Semin Cancer Biol. 2014;25:47–60. 10.1016/j.semcancer.2014.01.005. 24486645 10.1016/j.semcancer.2014.01.005 198. Eisenberg L Eisenberg-Bord M Eisenberg-Lerner A Sagi-Eisenberg R Metabolic alterations in the tumor microenvironment and their role in oncogenesis Cancer Lett 2020 484 65 71 10.1016/j.canlet.2020.04.016 32387442 Eisenberg L, Eisenberg-Bord M, Eisenberg-Lerner A, Sagi-Eisenberg R. Metabolic alterations in the tumor microenvironment and their role in oncogenesis. Cancer Lett. 2020;484:65–71. 10.1016/j.canlet.2020.04.016. 32387442 10.1016/j.canlet.2020.04.016 199. Zhou W Lin Z Tan W Deciphering the molecular landscape: integrating single-cell transcriptomics to unravel myofibroblast dynamics and therapeutic targets in clear cell renal cell carcinomas Front Immunol 2024 15 1374931 10.3389/fimmu.2024.1374931 38562930 PMC10982338 Zhou W, Lin Z, Tan W. Deciphering the molecular landscape: integrating single-cell transcriptomics to unravel myofibroblast dynamics and therapeutic targets in clear cell renal cell carcinomas. Front Immunol. 2024;15:1374931. 10.3389/fimmu.2024.1374931. 38562930 10.3389/fimmu.2024.1374931 PMC10982338 200. Vera-Ramirez L Long-term effects of systemic cancer treatment on DNA oxidative damage: the potential for targeted therapies Cancer Lett 2012 327 134 41 10.1016/j.canlet.2011.12.029 22274413 Vera-Ramirez L, et al. Long-term effects of systemic cancer treatment on DNA oxidative damage: the potential for targeted therapies. Cancer Lett. 2012;327:134–41. 10.1016/j.canlet.2011.12.029. 22274413 10.1016/j.canlet.2011.12.029 201. Arfin S Oxidative stress in cancer cell metabolism Antioxidants 2021 10.3390/antiox10050642 33922139 PMC8143540 Arfin S, et al. Oxidative stress in cancer cell metabolism. Antioxidants. 2021. 10.3390/antiox10050642. 33922139 10.3390/antiox10050642 PMC8143540 202. Ma S Fu A Chiew GG Luo KQ Hemodynamic shear stress stimulates migration and extravasation of tumor cells by elevating cellular oxidative level Cancer Lett 2017 388 239 248 10.1016/j.canlet.2016.12.001 27965040 Ma S, Fu A, Chiew GG, Luo KQ. Hemodynamic shear stress stimulates migration and extravasation of tumor cells by elevating cellular oxidative level. Cancer Lett. 2017;388:239–48. 10.1016/j.canlet.2016.12.001. 27965040 10.1016/j.canlet.2016.12.001 203. Kudo Y PKCλ/ι Loss Induces Autophagy, Oxidative Phosphorylation, and NRF2 to Promote Liver Cancer Progression Cancer Cell 2020 38 247 262.e211 10.1016/j.ccell.2020.05.018 32589943 PMC7423690 Kudo Y, et al. PKCλ/ι Loss Induces Autophagy, Oxidative Phosphorylation, and NRF2 to Promote Liver Cancer Progression. Cancer Cell. 2020;38:247-262.e211. 10.1016/j.ccell.2020.05.018. 32589943 10.1016/j.ccell.2020.05.018 PMC7423690 204. Wang Y The double-edged roles of ROS in cancer prevention and therapy Theranostics 2021 11 4839 4857 10.7150/thno.56747 33754031 PMC7978298 Wang Y, et al. The double-edged roles of ROS in cancer prevention and therapy. Theranostics. 2021;11:4839–57. 10.7150/thno.56747. 33754031 10.7150/thno.56747 PMC7978298 205. Kotsantis P Petermann E Boulton SJ Mechanisms of oncogene-induced replication stress: jigsaw falling into place Cancer Discov 2018 8 537 555 10.1158/2159-8290.Cd-17-1461 29653955 PMC5935233 Kotsantis P, Petermann E, Boulton SJ. Mechanisms of oncogene-induced replication stress: jigsaw falling into place. Cancer Discov. 2018;8:537–55. 10.1158/2159-8290.Cd-17-1461. 29653955 10.1158/2159-8290.CD-17-1461 PMC5935233 206. Ushio-Fukai M Nakamura Y Reactive oxygen species and angiogenesis: NADPH oxidase as target for cancer therapy Cancer Lett 2008 266 37 52 10.1016/j.canlet.2008.02.044 18406051 PMC2673114 Ushio-Fukai M, Nakamura Y. Reactive oxygen species and angiogenesis: NADPH oxidase as target for cancer therapy. Cancer Lett. 2008;266:37–52. 10.1016/j.canlet.2008.02.044. 18406051 10.1016/j.canlet.2008.02.044 PMC2673114 207. Yang G Metabolic heterogeneity in clear cell renal cell carcinoma revealed by single-cell RNA sequencing and spatial transcriptomics J Transl Med 2024 22 210 10.1186/s12967-024-04848-x 38414015 PMC10900752 Yang G, et al. Metabolic heterogeneity in clear cell renal cell carcinoma revealed by single-cell RNA sequencing and spatial transcriptomics. J Transl Med. 2024;22:210. 10.1186/s12967-024-04848-x. 38414015 10.1186/s12967-024-04848-x PMC10900752 208. Pichler R A chemokine network of T cell exhaustion and metabolic reprogramming in renal cell carcinoma Front Immunol 2023 14 1095195 10.3389/fimmu.2023.1095195 37006314 PMC10060976 Pichler R, et al. A chemokine network of T cell exhaustion and metabolic reprogramming in renal cell carcinoma. Front Immunol. 2023;14:1095195. 10.3389/fimmu.2023.1095195. 37006314 10.3389/fimmu.2023.1095195 PMC10060976 209. Reustle A Nicotinamide-N-methyltransferase is a promising metabolic drug target for primary and metastatic clear cell renal cell carcinoma Clin Transl Med 2022 12 e883 10.1002/ctm2.883 35678045 PMC9178377 Reustle A, et al. Nicotinamide-N-methyltransferase is a promising metabolic drug target for primary and metastatic clear cell renal cell carcinoma. Clin Transl Med. 2022;12: e883. 10.1002/ctm2.883. 35678045 10.1002/ctm2.883 PMC9178377 210. Fu Q Tumor-associated macrophage-derived interleukin-23 interlinks kidney cancer glutamine addiction with immune evasion Eur Urol 2019 75 752 63 10.1016/j.eururo.2018.09.030 30293904 Fu Q, et al. Tumor-associated macrophage-derived interleukin-23 interlinks kidney cancer glutamine addiction with immune evasion. Eur Urol. 2019;75:752–63. 10.1016/j.eururo.2018.09.030. 30293904 10.1016/j.eururo.2018.09.030 211. Linehan WM Comprehensive molecular characterization of papillary renal-cell carcinoma N Engl J Med 2016 374 135 145 10.1056/NEJMoa1505917 26536169 PMC4775252 Linehan WM, et al. Comprehensive molecular characterization of papillary renal-cell carcinoma. N Engl J Med. 2016;374:135–45. 10.1056/NEJMoa1505917. 26536169 10.1056/NEJMoa1505917 PMC4775252 212. Coffey NJ Simon MC Metabolic alterations in hereditary and sporadic renal cell carcinoma Nat Rev Nephrol 2024 20 233 250 10.1038/s41581-023-00800-2 38253811 PMC11165401 Coffey NJ, Simon MC. Metabolic alterations in hereditary and sporadic renal cell carcinoma. Nat Rev Nephrol. 2024;20:233–50. 10.1038/s41581-023-00800-2. 38253811 10.1038/s41581-023-00800-2 PMC11165401 213. Chen WJ Heterogeneity of tumor microenvironment is associated with clinical prognosis of non-clear cell renal cell carcinoma: a single-cell genomics study Cell Death Dis 2022 13 50 10.1038/s41419-022-04501-9 35017463 PMC8752784 Chen WJ, et al. Heterogeneity of tumor microenvironment is associated with clinical prognosis of non-clear cell renal cell carcinoma: a single-cell genomics study. Cell Death Dis. 2022;13: 50. 10.1038/s41419-022-04501-9. 35017463 10.1038/s41419-022-04501-9 PMC8752784 214. Galassi C Chan TA Vitale I Galluzzi L The hallmarks of cancer immune evasion Cancer Cell 2024 42 1825 1863 10.1016/j.ccell.2024.09.010 39393356 Galassi C, Chan TA, Vitale I, Galluzzi L. The hallmarks of cancer immune evasion. Cancer Cell. 2024;42:1825–63. 10.1016/j.ccell.2024.09.010. 39393356 10.1016/j.ccell.2024.09.010 215. Freed-Pastor WA The CD155/TIGIT axis promotes and maintains immune evasion in neoantigen-expressing pancreatic cancer Cancer Cell 2021 39 1342 1360.e1314 10.1016/j.ccell.2021.07.007 34358448 PMC8511341 Freed-Pastor WA, et al. The CD155/TIGIT axis promotes and maintains immune evasion in neoantigen-expressing pancreatic cancer. Cancer Cell. 2021;39:1342-1360.e1314. 10.1016/j.ccell.2021.07.007. 34358448 10.1016/j.ccell.2021.07.007 PMC8511341 216. Cao X M(6)A methylation: a process reshaping the tumour immune microenvironment and regulating immune evasion Mol Cancer 2023 22 42 10.1186/s12943-022-01704-8 36859310 PMC9976403 Cao X, et al. M(6)A methylation: a process reshaping the tumour immune microenvironment and regulating immune evasion. Mol Cancer. 2023;22: 42. 10.1186/s12943-022-01704-8. 36859310 10.1186/s12943-022-01704-8 PMC9976403 217. Kubelick KP Quiroz FG Biocondensates fuel tumor immune evasion Nat Cancer 2023 4 312 314 10.1038/s43018-023-00520-3 36894638 Kubelick KP, Quiroz FG. Biocondensates fuel tumor immune evasion. Nat Cancer. 2023;4:312–4. 10.1038/s43018-023-00520-3. 36894638 10.1038/s43018-023-00520-3 218. Lehtiö J Proteogenomics of non-small cell lung cancer reveals molecular subtypes associated with specific therapeutic targets and immune evasion mechanisms Nat Cancer 2021 2 1224 42 10.1038/s43018-021-00259-9 34870237 PMC7612062 Lehtiö J, et al. Proteogenomics of non-small cell lung cancer reveals molecular subtypes associated with specific therapeutic targets and immune evasion mechanisms. Nat Cancer. 2021;2:1224–42. 10.1038/s43018-021-00259-9. 34870237 10.1038/s43018-021-00259-9 PMC7612062 219. Jhunjhunwala S Hammer C Delamarre L Antigen presentation in cancer: insights into tumour immunogenicity and immune evasion Nat Rev Cancer 2021 21 298 312 10.1038/s41568-021-00339-z 33750922 Jhunjhunwala S, Hammer C, Delamarre L. Antigen presentation in cancer: insights into tumour immunogenicity and immune evasion. Nat Rev Cancer. 2021;21:298–312. 10.1038/s41568-021-00339-z. 33750922 10.1038/s41568-021-00339-z 220. Dhanasekaran R The MYC oncogene - the grand orchestrator of cancer growth and immune evasion Nat Rev Clin Oncol 2022 19 23 36 10.1038/s41571-021-00549-2 34508258 PMC9083341 Dhanasekaran R, et al. The MYC oncogene - the grand orchestrator of cancer growth and immune evasion. Nat Rev Clin Oncol. 2022;19:23–36. 10.1038/s41571-021-00549-2. 34508258 10.1038/s41571-021-00549-2 PMC9083341 221. Quastel M Dustin M The CD58-CD2 axis in cancer immune evasion Nat Rev Immunol 2022 22 409 10.1038/s41577-022-00738-9 35589965 Quastel M, Dustin M. The CD58-CD2 axis in cancer immune evasion. Nat Rev Immunol. 2022;22:409. 10.1038/s41577-022-00738-9. 35589965 10.1038/s41577-022-00738-9 222. Shenoy N Pagliaro L Sequential pathogenesis of metastatic VHL mutant clear cell renal cell carcinoma: putting it together with a translational perspective Annals of oncology : official journal of the European Society for Medical Oncology 2016 27 1685 1695 10.1093/annonc/mdw241 27329246 Shenoy N, Pagliaro L. Sequential pathogenesis of metastatic VHL mutant clear cell renal cell carcinoma: putting it together with a translational perspective. Annals of oncology : official journal of the European Society for Medical Oncology. 2016;27:1685–95. 10.1093/annonc/mdw241. 27329246 10.1093/annonc/mdw241 223. Wang X Immune evasion in renal cell carcinoma: biology, clinical translation, future directions Kidney Int 2021 99 75 85 10.1016/j.kint.2020.08.028 32949550 Wang X, et al. Immune evasion in renal cell carcinoma: biology, clinical translation, future directions. Kidney Int. 2021;99:75–85. 10.1016/j.kint.2020.08.028. 32949550 10.1016/j.kint.2020.08.028 224. Dubrot J In vivo CRISPR screens reveal the landscape of immune evasion pathways across cancer Nat Immunol 2022 23 1495 1506 10.1038/s41590-022-01315-x 36151395 Dubrot J, et al. In vivo CRISPR screens reveal the landscape of immune evasion pathways across cancer. Nat Immunol. 2022;23:1495–506. 10.1038/s41590-022-01315-x. 36151395 10.1038/s41590-022-01315-x 225. Braun DA Progressive immune dysfunction with advancing disease stage in renal cell carcinoma Cancer Cell 2021 39 632 648.e638 10.1016/j.ccell.2021.02.013 33711273 PMC8138872 Braun DA, et al. Progressive immune dysfunction with advancing disease stage in renal cell carcinoma. Cancer Cell. 2021;39:632-648.e638. 10.1016/j.ccell.2021.02.013. 33711273 10.1016/j.ccell.2021.02.013 PMC8138872 226. Bi K Tumor and immune reprogramming during immunotherapy in advanced renal cell carcinoma Cancer Cell 2021 39 649 661.e645 10.1016/j.ccell.2021.02.015 33711272 PMC8115394 Bi K, et al. Tumor and immune reprogramming during immunotherapy in advanced renal cell carcinoma. Cancer Cell. 2021;39:649-661.e645. 10.1016/j.ccell.2021.02.015. 33711272 10.1016/j.ccell.2021.02.015 PMC8115394 227. Obradovic A Single-cell protein activity analysis identifies recurrence-associated renal tumor macrophages Cell 2021 184 2988 3005.e2916 10.1016/j.cell.2021.04.038 34019793 PMC8479759 Obradovic A, et al. Single-cell protein activity analysis identifies recurrence-associated renal tumor macrophages. Cell. 2021;184:2988-3005.e2916. 10.1016/j.cell.2021.04.038. 34019793 10.1016/j.cell.2021.04.038 PMC8479759 228. Roumenina LT Tumor Cells Hijack Macrophage-Produced Complement C1q to Promote Tumor Growth Cancer Immunol Res 2019 7 1091 1105 10.1158/2326-6066.Cir-18-0891 31164356 Roumenina LT, et al. Tumor Cells Hijack Macrophage-Produced Complement C1q to Promote Tumor Growth. Cancer Immunol Res. 2019;7:1091–105. 10.1158/2326-6066.Cir-18-0891. 31164356 10.1158/2326-6066.CIR-18-0891 229. Zhang Q Landscape and Dynamics of Single Immune Cells in Hepatocellular Carcinoma Cell 2019 179 829 845.e820 10.1016/j.cell.2019.10.003 31675496 Zhang Q, et al. Landscape and Dynamics of Single Immune Cells in Hepatocellular Carcinoma. Cell. 2019;179:829-845.e820. 10.1016/j.cell.2019.10.003. 31675496 10.1016/j.cell.2019.10.003 230. Yang J Integrated genomic and transcriptomic analysis reveals unique characteristics of hepatic metastases and pro-metastatic role of complement C1q in pancreatic ductal adenocarcinoma Genome Biol 2021 22 4 10.1186/s13059-020-02222-w 33397441 PMC7780398 Yang J, et al. Integrated genomic and transcriptomic analysis reveals unique characteristics of hepatic metastases and pro-metastatic role of complement C1q in pancreatic ductal adenocarcinoma. Genome Biol. 2021;22:4. 10.1186/s13059-020-02222-w. 33397441 10.1186/s13059-020-02222-w PMC7780398 231. Bulla R C1q acts in the tumour microenvironment as a cancer-promoting factor independently of complement activation Nat Commun 2016 7 10346 10.1038/ncomms10346 26831747 PMC4740357 Bulla R, et al. C1q acts in the tumour microenvironment as a cancer-promoting factor independently of complement activation. Nat Commun. 2016;7:10346. 10.1038/ncomms10346. 26831747 10.1038/ncomms10346 PMC4740357 232. Tan J TREM2(+) macrophages suppress CD8(+) T-cell infiltration after transarterial chemoembolisation in hepatocellular carcinoma J Hepatol 2023 79 126 140 10.1016/j.jhep.2023.02.032 36889359 Tan J, et al. TREM2(+) macrophages suppress CD8(+) T-cell infiltration after transarterial chemoembolisation in hepatocellular carcinoma. J Hepatol. 2023;79:126–40. 10.1016/j.jhep.2023.02.032. 36889359 10.1016/j.jhep.2023.02.032 233. Molgora M TREM2 Modulation Remodels the Tumor Myeloid Landscape Enhancing Anti-PD-1 Immunotherapy Cell 2020 182 886 900.e817 10.1016/j.cell.2020.07.013 32783918 PMC7485282 Molgora M, et al. TREM2 Modulation Remodels the Tumor Myeloid Landscape Enhancing Anti-PD-1 Immunotherapy. Cell. 2020;182:886-900.e817. 10.1016/j.cell.2020.07.013. 32783918 10.1016/j.cell.2020.07.013 PMC7485282 234. Sun R TREM2 inhibition triggers antitumor cell activity of myeloid cells in glioblastoma Sci Adv 2023 9 eade3559 10.1126/sciadv.ade3559 37172094 PMC10181199 Sun R, et al. TREM2 inhibition triggers antitumor cell activity of myeloid cells in glioblastoma. Sci Adv. 2023;9: eade3559. 10.1126/sciadv.ade3559. 37172094 10.1126/sciadv.ade3559 PMC10181199 235. Park MD TREM2 macrophages drive NK cell paucity and dysfunction in lung cancer Nat Immunol 2023 24 792 801 10.1038/s41590-023-01475-4 37081148 PMC11088947 Park MD, et al. TREM2 macrophages drive NK cell paucity and dysfunction in lung cancer. Nat Immunol. 2023;24:792–801. 10.1038/s41590-023-01475-4. 37081148 10.1038/s41590-023-01475-4 PMC11088947 236. Yofe I Spatial and temporal mapping of breast cancer lung metastases identify TREM2 macrophages as regulators of the metastatic boundary Cancer Discov 2023 13 2610 31 10.1158/2159-8290.Cd-23-0299 37756565 PMC7617931 Yofe I, et al. Spatial and temporal mapping of breast cancer lung metastases identify TREM2 macrophages as regulators of the metastatic boundary. Cancer Discov. 2023;13:2610–31. 10.1158/2159-8290.Cd-23-0299. 37756565 10.1158/2159-8290.CD-23-0299 PMC7617931 237. Wang YA Effects of tumor metabolic microenvironment on regulatory T cells Mol Cancer 2018 17 168 10.1186/s12943-018-0913-y 30477520 PMC6260778 Wang YA, et al. Effects of tumor metabolic microenvironment on regulatory T cells. Mol Cancer. 2018;17: 168. 10.1186/s12943-018-0913-y. 30477520 10.1186/s12943-018-0913-y PMC6260778 238. Sun YF Dissecting spatial heterogeneity and the immune-evasion mechanism of CTCs by single-cell RNA-seq in hepatocellular carcinoma Nat Commun 2021 12 4091 10.1038/s41467-021-24386-0 34215748 PMC8253833 Sun YF, et al. Dissecting spatial heterogeneity and the immune-evasion mechanism of CTCs by single-cell RNA-seq in hepatocellular carcinoma. Nat Commun. 2021;12:4091. 10.1038/s41467-021-24386-0. 34215748 10.1038/s41467-021-24386-0 PMC8253833 239. Cervantes-Villagrana RD Albores-García D Cervantes-Villagrana AR García-Acevez SJ Tumor-induced neurogenesis and immune evasion as targets of innovative anti-cancer therapies Signal Transduct Target Ther 2020 5 99 10.1038/s41392-020-0205-z 32555170 PMC7303203 Cervantes-Villagrana RD, Albores-García D, Cervantes-Villagrana AR, García-Acevez SJ. Tumor-induced neurogenesis and immune evasion as targets of innovative anti-cancer therapies. Signal Transduct Target Ther. 2020;5:99. 10.1038/s41392-020-0205-z. 32555170 10.1038/s41392-020-0205-z PMC7303203 240. Mujal AM Holistic Characterization of Tumor Monocyte-to-Macrophage Differentiation Integrates Distinct Immune Phenotypes in Kidney Cancer Cancer Immunol Res 2022 10 403 419 10.1158/2326-6066.Cir-21-0588 35181780 PMC8982148 Mujal AM, et al. Holistic Characterization of Tumor Monocyte-to-Macrophage Differentiation Integrates Distinct Immune Phenotypes in Kidney Cancer. Cancer Immunol Res. 2022;10:403–19. 10.1158/2326-6066.Cir-21-0588. 35181780 10.1158/2326-6066.CIR-21-0588 PMC8982148 241. Liu S Comprehensive investigation of malignant epithelial cell-related genes in clear cell renal cell carcinoma: development of a prognostic signature and exploration of tumor microenvironment interactions J Transl Med 2024 22 607 10.1186/s12967-024-05426-x 38951896 PMC11218120 Liu S, et al. Comprehensive investigation of malignant epithelial cell-related genes in clear cell renal cell carcinoma: development of a prognostic signature and exploration of tumor microenvironment interactions. J Transl Med. 2024;22:607. 10.1186/s12967-024-05426-x. 38951896 10.1186/s12967-024-05426-x PMC11218120 242. Dong P Genomic Characteristics and Single-Cell Profiles After Immunotherapy in Fumarate Hydratase-Deficient Renal Cell Carcinoma Clinical cancer research : an official journal of the American Association for Cancer Research 2022 28 4807 4819 10.1158/1078-0432.Ccr-22-1279 36074152 Dong P, et al. Genomic Characteristics and Single-Cell Profiles After Immunotherapy in Fumarate Hydratase-Deficient Renal Cell Carcinoma. Clinical cancer research : an official journal of the American Association for Cancer Research. 2022;28:4807–19. 10.1158/1078-0432.Ccr-22-1279. 36074152 10.1158/1078-0432.CCR-22-1279 243. Dawson MA Kouzarides T Cancer epigenetics: from mechanism to therapy Cell 2012 150 12 27 10.1016/j.cell.2012.06.013 22770212 Dawson MA, Kouzarides T. Cancer epigenetics: from mechanism to therapy. Cell. 2012;150:12–27. 10.1016/j.cell.2012.06.013. 22770212 10.1016/j.cell.2012.06.013 244. Kiri S Ryba T Cancer, metastasis, and the epigenome Mol Cancer 2024 23 154 10.1186/s12943-024-02069-w 39095874 PMC11295362 Kiri S, Ryba T. Cancer, metastasis, and the epigenome. Mol Cancer. 2024;23:154. 10.1186/s12943-024-02069-w. 39095874 10.1186/s12943-024-02069-w PMC11295362 245. Feinberg AP Levchenko A Epigenetics as a mediator of plasticity in cancer Science 2023 379 eaaw3835 10.1126/science.aaw3835 36758093 PMC10249049 Feinberg AP, Levchenko A. Epigenetics as a mediator of plasticity in cancer. Science. 2023;379:eaaw3835. 10.1126/science.aaw3835. 36758093 10.1126/science.aaw3835 PMC10249049 246. LaFave LM Epigenomic State Transitions Characterize Tumor Progression in Mouse Lung Adenocarcinoma Cancer Cell 2020 38 212 228.e213 10.1016/j.ccell.2020.06.006 32707078 PMC7641015 LaFave LM, et al. Epigenomic State Transitions Characterize Tumor Progression in Mouse Lung Adenocarcinoma. Cancer Cell. 2020;38:212-228.e213. 10.1016/j.ccell.2020.06.006. 32707078 10.1016/j.ccell.2020.06.006 PMC7641015 247. Hou Y Single-cell triple omics sequencing reveals genetic, epigenetic, and transcriptomic heterogeneity in hepatocellular carcinomas Cell Res 2016 26 304 319 10.1038/cr.2016.23 26902283 PMC4783472 Hou Y, et al. Single-cell triple omics sequencing reveals genetic, epigenetic, and transcriptomic heterogeneity in hepatocellular carcinomas. Cell Res. 2016;26:304–19. 10.1038/cr.2016.23. 26902283 10.1038/cr.2016.23 PMC4783472 248. Nacev BA The epigenomics of sarcoma Nat Rev Cancer 2020 20 608 623 10.1038/s41568-020-0288-4 32782366 PMC8380451 Nacev BA, et al. The epigenomics of sarcoma. Nat Rev Cancer. 2020;20:608–23. 10.1038/s41568-020-0288-4. 32782366 10.1038/s41568-020-0288-4 PMC8380451 249. Hogg SJ Beavis PA Dawson MA Johnstone RW Targeting the epigenetic regulation of antitumour immunity Nat Rev Drug Discov 2020 19 776 800 10.1038/s41573-020-0077-5 32929243 Hogg SJ, Beavis PA, Dawson MA, Johnstone RW. Targeting the epigenetic regulation of antitumour immunity. Nat Rev Drug Discov. 2020;19:776–800. 10.1038/s41573-020-0077-5. 32929243 10.1038/s41573-020-0077-5 250. Terekhanova NV Epigenetic regulation during cancer transitions across 11 tumour types Nature 2023 623 432 441 10.1038/s41586-023-06682-5 37914932 PMC10632147 Terekhanova NV, et al. Epigenetic regulation during cancer transitions across 11 tumour types. Nature. 2023;623:432–41. 10.1038/s41586-023-06682-5. 37914932 10.1038/s41586-023-06682-5 PMC10632147 251. Della Chiara G Epigenomic landscape of human colorectal cancer unveils an aberrant core of pan-cancer enhancers orchestrated by YAP/TAZ Nat Commun 2021 12 2340 10.1038/s41467-021-22544-y 33879786 PMC8058065 Della Chiara G, et al. Epigenomic landscape of human colorectal cancer unveils an aberrant core of pan-cancer enhancers orchestrated by YAP/TAZ. Nat Commun. 2021;12:2340. 10.1038/s41467-021-22544-y. 33879786 10.1038/s41467-021-22544-y PMC8058065 252. Deribe YL Regulation of epidermal growth factor receptor trafficking by lysine deacetylase HDAC6 Sci Signal 2009 2 ra84 10.1126/scisignal.2000576 20029029 Deribe YL, et al. Regulation of epidermal growth factor receptor trafficking by lysine deacetylase HDAC6. Sci Signal. 2009;2: ra84. 10.1126/scisignal.2000576. 20029029 10.1126/scisignal.2000576 253. Choudhary C Lysine acetylation targets protein complexes and co-regulates major cellular functions Science 2009 325 834 840 10.1126/science.1175371 19608861 Choudhary C, et al. Lysine acetylation targets protein complexes and co-regulates major cellular functions. Science. 2009;325:834–40. 10.1126/science.1175371. 19608861 10.1126/science.1175371 254. Xu X Single-cell exome sequencing reveals single-nucleotide mutation characteristics of a kidney tumor Cell 2012 148 886 895 10.1016/j.cell.2012.02.025 22385958 PMC7458411 Xu X, et al. Single-cell exome sequencing reveals single-nucleotide mutation characteristics of a kidney tumor. Cell. 2012;148:886–95. 10.1016/j.cell.2012.02.025. 22385958 10.1016/j.cell.2012.02.025 PMC7458411 255. Yu Z Integrative Single-Cell Analysis Reveals Transcriptional and Epigenetic Regulatory Features of Clear Cell Renal Cell Carcinoma Can Res 2023 83 700 719 10.1158/0008-5472.Can-22-2224 PMC9978887 36607615 Yu Z, et al. Integrative Single-Cell Analysis Reveals Transcriptional and Epigenetic Regulatory Features of Clear Cell Renal Cell Carcinoma. Can Res. 2023;83:700–19. 10.1158/0008-5472.Can-22-2224. 10.1158/0008-5472.CAN-22-2224 PMC9978887 36607615 256. Saout JR Single-cell deconvolution of a specific malignant cell population as a poor prognostic biomarker in low-risk clear cell renal cell carcinoma patients Eur Urol 2023 83 441 51 10.1016/j.eururo.2023.02.008 36801089 Saout JR, et al. Single-cell deconvolution of a specific malignant cell population as a poor prognostic biomarker in low-risk clear cell renal cell carcinoma patients. Eur Urol. 2023;83:441–51. 10.1016/j.eururo.2023.02.008. 36801089 10.1016/j.eururo.2023.02.008 257. Miheecheva N Multiregional single-cell proteogenomic analysis of ccRCC reveals cytokine drivers of intratumor spatial heterogeneity Cell Rep 2022 40 111180 10.1016/j.celrep.2022.111180 35977503 Miheecheva N, et al. Multiregional single-cell proteogenomic analysis of ccRCC reveals cytokine drivers of intratumor spatial heterogeneity. Cell Rep. 2022;40: 111180. 10.1016/j.celrep.2022.111180. 35977503 10.1016/j.celrep.2022.111180 258. Gossage L Eisen T Maher ER VHL, the story of a tumour suppressor gene Nat Rev Cancer 2015 15 55 64 10.1038/nrc3844 25533676 Gossage L, Eisen T, Maher ER. VHL, the story of a tumour suppressor gene. Nat Rev Cancer. 2015;15:55–64. 10.1038/nrc3844. 25533676 10.1038/nrc3844 259. Gerlinger M Intratumor heterogeneity and branched evolution revealed by multiregion sequencing N Engl J Med 2012 366 883 892 10.1056/NEJMoa1113205 22397650 PMC4878653 Gerlinger M, et al. Intratumor heterogeneity and branched evolution revealed by multiregion sequencing. N Engl J Med. 2012;366:883–92. 10.1056/NEJMoa1113205. 22397650 10.1056/NEJMoa1113205 PMC4878653 260. Chen W Targeting renal cell carcinoma with a HIF-2 antagonist Nature 2016 539 112 117 10.1038/nature19796 27595394 PMC5340502 Chen W, et al. Targeting renal cell carcinoma with a HIF-2 antagonist. Nature. 2016;539:112–7. 10.1038/nature19796. 27595394 10.1038/nature19796 PMC5340502 261. Buckley M Saturation genome editing maps the functional spectrum of pathogenic VHL alleles Nat Genet 2024 56 1446 1455 10.1038/s41588-024-01800-z 38969834 PMC11250436 Buckley M, et al. Saturation genome editing maps the functional spectrum of pathogenic VHL alleles. Nat Genet. 2024;56:1446–55. 10.1038/s41588-024-01800-z. 38969834 10.1038/s41588-024-01800-z PMC11250436 262. Yao X VHL deficiency drives enhancer activation of oncogenes in clear cell renal cell carcinoma Cancer Discov 2017 7 1284 305 10.1158/2159-8290.Cd-17-0375 28893800 Yao X, et al. VHL deficiency drives enhancer activation of oncogenes in clear cell renal cell carcinoma. Cancer Discov. 2017;7:1284–305. 10.1158/2159-8290.Cd-17-0375. 28893800 10.1158/2159-8290.CD-17-0375 263. Ricketts CJ Linehan WM Insights into epigenetic remodeling in VHL-deficient clear cell renal cell carcinoma Cancer Discov 2017 7 1221 1223 10.1158/2159-8290.Cd-17-0971 29097620 Ricketts CJ, Linehan WM. Insights into epigenetic remodeling in VHL-deficient clear cell renal cell carcinoma. Cancer Discov. 2017;7:1221–3. 10.1158/2159-8290.Cd-17-0971. 29097620 10.1158/2159-8290.CD-17-0971 264. Frew IJ Moch H A clearer view of the molecular complexity of clear cell renal cell carcinoma Annu Rev Pathol 2015 10 263 289 10.1146/annurev-pathol-012414-040306 25387056 Frew IJ, Moch H. A clearer view of the molecular complexity of clear cell renal cell carcinoma. Annu Rev Pathol. 2015;10:263–89. 10.1146/annurev-pathol-012414-040306. 25387056 10.1146/annurev-pathol-012414-040306 265. Brugarolas J Molecular genetics of clear-cell renal cell carcinoma J Clin Oncol 2014 32 1968 1976 10.1200/jco.2012.45.2003 24821879 PMC4050206 Brugarolas J. Molecular genetics of clear-cell renal cell carcinoma. J Clin Oncol. 2014;32:1968–76. 10.1200/jco.2012.45.2003. 24821879 10.1200/JCO.2012.45.2003 PMC4050206 266. Sato Y Integrated molecular analysis of clear-cell renal cell carcinoma Nat Genet 2013 45 860 867 10.1038/ng.2699 23797736 Sato Y, et al. Integrated molecular analysis of clear-cell renal cell carcinoma. Nat Genet. 2013;45:860–7. 10.1038/ng.2699. 23797736 10.1038/ng.2699 267. de Martino M Klatte T Haitel A Marberger M Serum cell-free DNA in renal cell carcinoma: a diagnostic and prognostic marker Cancer 2012 118 82 90 10.1002/cncr.26254 21713763 de Martino M, Klatte T, Haitel A, Marberger M. Serum cell-free DNA in renal cell carcinoma: a diagnostic and prognostic marker. Cancer. 2012;118:82–90. 10.1002/cncr.26254. 21713763 10.1002/cncr.26254 268. Kawai Y Methylation level of the RASSF1A promoter is an independent prognostic factor for clear-cell renal cell carcinoma Annals of oncology : official journal of the European Society for Medical Oncology 2010 21 1612 1617 10.1093/annonc/mdp577 20038516 Kawai Y, et al. Methylation level of the RASSF1A promoter is an independent prognostic factor for clear-cell renal cell carcinoma. Annals of oncology : official journal of the European Society for Medical Oncology. 2010;21:1612–7. 10.1093/annonc/mdp577. 20038516 10.1093/annonc/mdp577 269. Peters I RASSF1A promoter methylation and expression analysis in normal and neoplastic kidney indicates a role in early tumorigenesis Mol Cancer 2007 6 49 10.1186/1476-4598-6-49 17634119 PMC1939711 Peters I, et al. RASSF1A promoter methylation and expression analysis in normal and neoplastic kidney indicates a role in early tumorigenesis. Mol Cancer. 2007;6:49. 10.1186/1476-4598-6-49. 17634119 10.1186/1476-4598-6-49 PMC1939711 270. Ibanez de Caceres I Identification of novel target genes by an epigenetic reactivation screen of renal cancer Cancer Res 2006 66 5021 5028 10.1158/0008-5472.Can-05-3365 16707423 Ibanez de Caceres I, et al. Identification of novel target genes by an epigenetic reactivation screen of renal cancer. Cancer Res. 2006;66:5021–8. 10.1158/0008-5472.Can-05-3365. 16707423 10.1158/0008-5472.CAN-05-3365 271. Gonzalgo ML Molecular profiling and classification of sporadic renal cell carcinoma by quantitative methylation analysis Clinical cancer research : an official journal of the American Association for Cancer Research 2004 10 7276 7283 10.1158/1078-0432.Ccr-03-0692 15534102 Gonzalgo ML, et al. Molecular profiling and classification of sporadic renal cell carcinoma by quantitative methylation analysis. Clinical cancer research : an official journal of the American Association for Cancer Research. 2004;10:7276–83. 10.1158/1078-0432.Ccr-03-0692. 15534102 10.1158/1078-0432.CCR-03-0692 272. Morrissey C Epigenetic inactivation of the RASSF1A 3p21.3 tumor suppressor gene in both clear cell and papillary renal cell carcinoma Cancer research 2001 61 7277 7281 11585766 Morrissey C, et al. Epigenetic inactivation of the RASSF1A 3p21.3 tumor suppressor gene in both clear cell and papillary renal cell carcinoma. Cancer research. 2001;61:7277–81. 11585766 273. Catalano A Mutations in tumor suppressor genes Vhl and Rassf1a cause DNA damage, chromosomal instability and induce gene expression changes characteristic of clear cell renal cell carcinoma Kidney Int 2024 10.1016/j.kint.2024.12.003 39725222 Catalano A, et al. Mutations in tumor suppressor genes Vhl and Rassf1a cause DNA damage, chromosomal instability and induce gene expression changes characteristic of clear cell renal cell carcinoma. Kidney Int. 2024. 10.1016/j.kint.2024.12.003. 39725222 10.1016/j.kint.2024.12.003 274. Huang C Sccancerexplorer: a comprehensive database for interactively exploring single-cell multi-omics data of human pan-cancer Nucleic Acids Res 2024 10.1093/nar/gkae1100 39558175 PMC11701644 Huang C, et al. Sccancerexplorer: a comprehensive database for interactively exploring single-cell multi-omics data of human pan-cancer. Nucleic Acids Res. 2024. 10.1093/nar/gkae1100. 39558175 10.1093/nar/gkae1100 PMC11701644 275. Wan L Impaired cell fate through gain-of-function mutations in a chromatin reader Nature 2020 577 121 126 10.1038/s41586-019-1842-7 31853060 PMC7061414 Wan L, et al. Impaired cell fate through gain-of-function mutations in a chromatin reader. Nature. 2020;577:121–6. 10.1038/s41586-019-1842-7. 31853060 10.1038/s41586-019-1842-7 PMC7061414 276. Song L Single-cell multiomics reveals ENL mutation perturbs kidney developmental trajectory by rewiring gene regulatory landscape Nat Commun 2024 15 5937 10.1038/s41467-024-50171-w 39009564 PMC11250843 Song L, et al. Single-cell multiomics reveals ENL mutation perturbs kidney developmental trajectory by rewiring gene regulatory landscape. Nat Commun. 2024;15:5937. 10.1038/s41467-024-50171-w. 39009564 10.1038/s41467-024-50171-w PMC11250843 277. Wang H Body-Wide Inactivation of the Myc-Like Mlx Transcription Factor Network Accelerates Aging and Increases the Lifetime Cancer Incidence Adv Sci (Weinh) 2024 11 e2401593 10.1002/advs.202401593 38976573 PMC11425880 Wang H, et al. Body-Wide Inactivation of the Myc-Like Mlx Transcription Factor Network Accelerates Aging and Increases the Lifetime Cancer Incidence. Adv Sci (Weinh). 2024;11:e2401593. 10.1002/advs.202401593. 38976573 10.1002/advs.202401593 PMC11425880 278. He T Targeting the mSWI/SNF complex in POU2F-POU2AF transcription factor-driven malignancies Cancer Cell 2024 42 1336 1351.e1339 10.1016/j.ccell.2024.06.006 39029462 PMC12147762 He T, et al. Targeting the mSWI/SNF complex in POU2F-POU2AF transcription factor-driven malignancies. Cancer Cell. 2024;42:1336-1351.e1339. 10.1016/j.ccell.2024.06.006. 39029462 10.1016/j.ccell.2024.06.006 PMC12147762 279. McRae HM Hargreaves DC Transcription factor dependencies identify BAF-dependent cancers Cancer Cell 2024 42 1326 1328 10.1016/j.ccell.2024.06.013 39029465 McRae HM, Hargreaves DC. Transcription factor dependencies identify BAF-dependent cancers. Cancer Cell. 2024;42:1326–8. 10.1016/j.ccell.2024.06.013. 39029465 10.1016/j.ccell.2024.06.013 280. Ervin EH French R Chang CH Pauklin S Inside the stemness engine: mechanistic links between deregulated transcription factors and stemness in cancer Semin Cancer Biol 2022 87 48 83 10.1016/j.semcancer.2022.11.001 36347438 Ervin EH, French R, Chang CH, Pauklin S. Inside the stemness engine: mechanistic links between deregulated transcription factors and stemness in cancer. Semin Cancer Biol. 2022;87:48–83. 10.1016/j.semcancer.2022.11.001. 36347438 10.1016/j.semcancer.2022.11.001 281. Hasan A Khan NA Uddin S Khan AQ Steinhoff M Deregulated transcription factors in the emerging cancer hallmarks Semin Cancer Biol 2024 98 31 50 10.1016/j.semcancer.2023.12.001 38123029 Hasan A, Khan NA, Uddin S, Khan AQ, Steinhoff M. Deregulated transcription factors in the emerging cancer hallmarks. Semin Cancer Biol. 2024;98:31–50. 10.1016/j.semcancer.2023.12.001. 38123029 10.1016/j.semcancer.2023.12.001 282. Morgan MP Finnegan E Das S The role of transcription factors in the acquisition of the four latest proposed hallmarks of cancer and corresponding enabling characteristics Semin Cancer Biol 2022 86 1203 1215 10.1016/j.semcancer.2022.10.002 36244529 Morgan MP, Finnegan E, Das S. The role of transcription factors in the acquisition of the four latest proposed hallmarks of cancer and corresponding enabling characteristics. Semin Cancer Biol. 2022;86:1203–15. 10.1016/j.semcancer.2022.10.002. 36244529 10.1016/j.semcancer.2022.10.002 283. Bushweller JH Targeting transcription factors in cancer - from undruggable to reality Nat Rev Cancer 2019 19 611 624 10.1038/s41568-019-0196-7 31511663 PMC8820243 Bushweller JH. Targeting transcription factors in cancer - from undruggable to reality. Nat Rev Cancer. 2019;19:611–24. 10.1038/s41568-019-0196-7. 31511663 10.1038/s41568-019-0196-7 PMC8820243 284. Li Y Azmi AS Mohammad RM Deregulated transcription factors and poor clinical outcomes in cancer patients Semin Cancer Biol 2022 86 122 134 10.1016/j.semcancer.2022.08.001 35940398 Li Y, Azmi AS, Mohammad RM. Deregulated transcription factors and poor clinical outcomes in cancer patients. Semin Cancer Biol. 2022;86:122–34. 10.1016/j.semcancer.2022.08.001. 35940398 10.1016/j.semcancer.2022.08.001 285. DiFeo A Martignetti JA Narla G The role of KLF6 and its splice variants in cancer therapy Drug Resist Updat 2009 12 1 7 10.1016/j.drup.2008.11.001 19097929 DiFeo A, Martignetti JA, Narla G. The role of KLF6 and its splice variants in cancer therapy. Drug Resist Updat. 2009;12:1–7. 10.1016/j.drup.2008.11.001. 19097929 10.1016/j.drup.2008.11.001 286. Shukla V Genome-Wide Analysis Identifies Nuclear Factor 1C as a Novel Transcription Factor and Potential Therapeutic Target in SCLC Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer 2024 19 1201 1217 10.1016/j.jtho.2024.03.023 38583771 Shukla V, et al. Genome-Wide Analysis Identifies Nuclear Factor 1C as a Novel Transcription Factor and Potential Therapeutic Target in SCLC. Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer. 2024;19:1201–17. 10.1016/j.jtho.2024.03.023. 38583771 10.1016/j.jtho.2024.03.023 287. Zhang S Xiong X Sun Y Functional characterization of SOX2 as an anticancer target Signal Transduct Target Ther 2020 5 135 10.1038/s41392-020-00242-3 32728033 PMC7391717 Zhang S, Xiong X, Sun Y. Functional characterization of SOX2 as an anticancer target. Signal Transduct Target Ther. 2020;5:135. 10.1038/s41392-020-00242-3. 32728033 10.1038/s41392-020-00242-3 PMC7391717 288. Long Z Single-cell multiomics analysis reveals regulatory programs in clear cell renal cell carcinoma Cell discovery 2022 8 68 10.1038/s41421-022-00415-0 35853872 PMC9296597 Long Z, et al. Single-cell multiomics analysis reveals regulatory programs in clear cell renal cell carcinoma. Cell discovery. 2022;8:68. 10.1038/s41421-022-00415-0. 35853872 10.1038/s41421-022-00415-0 PMC9296597 289. Zheng J Liu F Su C Unveiling the hidden AP-1: revealing the crucial role of AP-1 in ccRCC at single-cell resolution Mol Cancer 2023 22 209 10.1186/s12943-023-01913-9 38114996 PMC10731896 Zheng J, Liu F, Su C. Unveiling the hidden AP-1: revealing the crucial role of AP-1 in ccRCC at single-cell resolution. Mol Cancer. 2023;22:209. 10.1186/s12943-023-01913-9. 38114996 10.1186/s12943-023-01913-9 PMC10731896 290. Kalluri R McAndrews KM The role of extracellular vesicles in cancer Cell 2023 186 1610 1626 10.1016/j.cell.2023.03.010 37059067 PMC10484374 Kalluri R, McAndrews KM. The role of extracellular vesicles in cancer. Cell. 2023;186:1610–26. 10.1016/j.cell.2023.03.010. 37059067 10.1016/j.cell.2023.03.010 PMC10484374 291. Maacha S Extracellular vesicles-mediated intercellular communication: roles in the tumor microenvironment and anti-cancer drug resistance Mol Cancer 2019 18 55 10.1186/s12943-019-0965-7 30925923 PMC6441157 Maacha S, et al. Extracellular vesicles-mediated intercellular communication: roles in the tumor microenvironment and anti-cancer drug resistance. Mol Cancer. 2019;18:55. 10.1186/s12943-019-0965-7. 30925923 10.1186/s12943-019-0965-7 PMC6441157 292. Wilczyński B Dąbrowska A Kulbacka J Baczyńska D Chemoresistance and the tumor microenvironment: the critical role of cell-cell communication Cell Commun Signal 2024 22 486 10.1186/s12964-024-01857-7 39390572 PMC11468187 Wilczyński B, Dąbrowska A, Kulbacka J, Baczyńska D. Chemoresistance and the tumor microenvironment: the critical role of cell-cell communication. Cell Commun Signal. 2024;22:486. 10.1186/s12964-024-01857-7. 39390572 10.1186/s12964-024-01857-7 PMC11468187 293. Gonzalez-Molina J Chemotherapy as a regulator of extracellular matrix-cell communication: implications in therapy resistance Semin Cancer Biol 2022 86 224 36 10.1016/j.semcancer.2022.03.012 35331851 Gonzalez-Molina J, et al. Chemotherapy as a regulator of extracellular matrix-cell communication: implications in therapy resistance. Semin Cancer Biol. 2022;86:224–36. 10.1016/j.semcancer.2022.03.012. 35331851 10.1016/j.semcancer.2022.03.012 294. Münz C Autophagy in cellular transformation, survival and communication with the tumor microenvironment Semin Cancer Biol 2013 23 299 300 10.1016/j.semcancer.2013.06.006 23811289 Münz C. Autophagy in cellular transformation, survival and communication with the tumor microenvironment. Semin Cancer Biol. 2013;23:299–300. 10.1016/j.semcancer.2013.06.006. 23811289 10.1016/j.semcancer.2013.06.006 295. Giladi A Dissecting cellular crosstalk by sequencing physically interacting cells Nat Biotechnol 2020 38 629 637 10.1038/s41587-020-0442-2 32152598 Giladi A, et al. Dissecting cellular crosstalk by sequencing physically interacting cells. Nat Biotechnol. 2020;38:629–37. 10.1038/s41587-020-0442-2. 32152598 10.1038/s41587-020-0442-2 296. Saviano A Henderson NC Baumert TF Single-cell genomics and spatial transcriptomics: discovery of novel cell states and cellular interactions in liver physiology and disease biology J Hepatol 2020 73 1219 1230 10.1016/j.jhep.2020.06.004 32534107 PMC7116221 Saviano A, Henderson NC, Baumert TF. Single-cell genomics and spatial transcriptomics: discovery of novel cell states and cellular interactions in liver physiology and disease biology. J Hepatol. 2020;73:1219–30. 10.1016/j.jhep.2020.06.004. 32534107 10.1016/j.jhep.2020.06.004 PMC7116221 297. Almet AA Tsai YC Watanabe M Nie Q Inferring pattern-driving intercellular flows from single-cell and spatial transcriptomics Nat Methods 2024 21 1806 1817 10.1038/s41592-024-02380-w 39187683 PMC11466815 Almet AA, Tsai YC, Watanabe M, Nie Q. Inferring pattern-driving intercellular flows from single-cell and spatial transcriptomics. Nat Methods. 2024;21:1806–17. 10.1038/s41592-024-02380-w. 39187683 10.1038/s41592-024-02380-w PMC11466815 298. Armingol E Officer A Harismendy O Lewis NE Deciphering cell-cell interactions and communication from gene expression Nat Rev Genet 2021 22 71 88 10.1038/s41576-020-00292-x 33168968 PMC7649713 Armingol E, Officer A, Harismendy O, Lewis NE. Deciphering cell-cell interactions and communication from gene expression. Nat Rev Genet. 2021;22:71–88. 10.1038/s41576-020-00292-x. 33168968 10.1038/s41576-020-00292-x PMC7649713 299. Longo SK Guo MG Ji AL Khavari PA Integrating single-cell and spatial transcriptomics to elucidate intercellular tissue dynamics Nat Rev Genet 2021 22 627 644 10.1038/s41576-021-00370-8 34145435 PMC9888017 Longo SK, Guo MG, Ji AL, Khavari PA. Integrating single-cell and spatial transcriptomics to elucidate intercellular tissue dynamics. Nat Rev Genet. 2021;22:627–44. 10.1038/s41576-021-00370-8. 34145435 10.1038/s41576-021-00370-8 PMC9888017 300. Petrella BL Vincenti MP Interleukin-1β mediates metalloproteinase-dependent renal cell carcinoma tumor cell invasion through the activation of CCAAT enhancer binding protein β Cancer Med 2012 1 17 27 10.1002/cam4.7 23342250 PMC3544428 Petrella BL, Vincenti MP. Interleukin-1β mediates metalloproteinase-dependent renal cell carcinoma tumor cell invasion through the activation of CCAAT enhancer binding protein β. Cancer Med. 2012;1:17–27. 10.1002/cam4.7. 23342250 10.1002/cam4.7 PMC3544428 301. Chen LX Cell-cell communications shape tumor microenvironment and predict clinical outcomes in clear cell renal carcinoma J Transl Med 2023 21 1 113 10.1186/s12967-022-03858-x 36765369 PMC9921120 Chen LX, et al. Cell-cell communications shape tumor microenvironment and predict clinical outcomes in clear cell renal carcinoma. J Transl Med. 2023;21(1): 113. 10.1186/s12967-022-03858-x. 36765369 10.1186/s12967-022-03858-x PMC9921120 302. Massenet-Regad L Large-scale analysis of cell-cell communication reveals angiogenin-dependent tumor progression in clear cell renal cell carcinoma iScience 2023 26 108367 10.1016/j.isci.2023.108367 38025776 PMC10663819 Massenet-Regad L, et al. Large-scale analysis of cell-cell communication reveals angiogenin-dependent tumor progression in clear cell renal cell carcinoma. iScience. 2023;26:108367. 10.1016/j.isci.2023.108367. 38025776 10.1016/j.isci.2023.108367 PMC10663819 303. Ghoshdastider U Pan-Cancer Analysis of Ligand-Receptor Cross-talk in the Tumor Microenvironment Can Res 2021 81 1802 1812 10.1158/0008-5472.Can-20-2352 33547160 Ghoshdastider U, et al. Pan-Cancer Analysis of Ligand-Receptor Cross-talk in the Tumor Microenvironment. Can Res. 2021;81:1802–12. 10.1158/0008-5472.Can-20-2352. 10.1158/0008-5472.CAN-20-2352 33547160 304. Chevrier S An Immune Atlas of Clear Cell Renal Cell Carcinoma Cell 2017 169 736 749.e718 10.1016/j.cell.2017.04.016 28475899 PMC5422211 Chevrier S, et al. An Immune Atlas of Clear Cell Renal Cell Carcinoma. Cell. 2017;169:736-749.e718. 10.1016/j.cell.2017.04.016. 28475899 10.1016/j.cell.2017.04.016 PMC5422211 305. Gebhardt T Park SL Parish IA Stem-like exhausted and memory CD8(+) T cells in cancer Nat Rev Cancer 2023 23 780 798 10.1038/s41568-023-00615-0 37821656 Gebhardt T, Park SL, Parish IA. Stem-like exhausted and memory CD8(+) T cells in cancer. Nat Rev Cancer. 2023;23:780–98. 10.1038/s41568-023-00615-0. 37821656 10.1038/s41568-023-00615-0 306. Wherry EJ Kurachi M Molecular and cellular insights into T cell exhaustion Nat Rev Immunol 2015 15 486 499 10.1038/nri3862 26205583 PMC4889009 Wherry EJ, Kurachi M. Molecular and cellular insights into T cell exhaustion. Nat Rev Immunol. 2015;15:486–99. 10.1038/nri3862. 26205583 10.1038/nri3862 PMC4889009 307. Chow A Perica K Klebanoff CA Wolchok JD Clinical implications of T cell exhaustion for cancer immunotherapy Nat Rev Clin Oncol 2022 19 775 790 10.1038/s41571-022-00689-z 36216928 PMC10984554 Chow A, Perica K, Klebanoff CA, Wolchok JD. Clinical implications of T cell exhaustion for cancer immunotherapy. Nat Rev Clin Oncol. 2022;19:775–90. 10.1038/s41571-022-00689-z. 36216928 10.1038/s41571-022-00689-z PMC10984554 308. Barsch M T-cell exhaustion and residency dynamics inform clinical outcomes in hepatocellular carcinoma J Hepatol 2022 77 397 409 10.1016/j.jhep.2022.02.032 35367533 Barsch M, et al. T-cell exhaustion and residency dynamics inform clinical outcomes in hepatocellular carcinoma. J Hepatol. 2022;77:397–409. 10.1016/j.jhep.2022.02.032. 35367533 10.1016/j.jhep.2022.02.032 309. Zheng L Pan-cancer single-cell landscape of tumor-infiltrating T cells Science 2021 374 abe6474 10.1126/science.abe6474 34914499 Zheng L, et al. Pan-cancer single-cell landscape of tumor-infiltrating T cells. Science. 2021;374:abe6474. 10.1126/science.abe6474. 34914499 10.1126/science.abe6474 310. Guo L Characteristics, dynamic changes, and prognostic significance of TCR repertoire profiling in patients with renal cell carcinoma J Pathol 2020 251 26 37 10.1002/path.5396 32073142 PMC7317472 Guo L, et al. Characteristics, dynamic changes, and prognostic significance of TCR repertoire profiling in patients with renal cell carcinoma. J Pathol. 2020;251:26–37. 10.1002/path.5396. 32073142 10.1002/path.5396 PMC7317472 311. Raghubar AM High risk clear cell renal cell carcinoma microenvironments contain protumour immunophenotypes lacking specific immune checkpoints NPJ Precis Oncol 2023 7 88 10.1038/s41698-023-00441-5 37696903 PMC10495390 Raghubar AM, et al. High risk clear cell renal cell carcinoma microenvironments contain protumour immunophenotypes lacking specific immune checkpoints. NPJ Precis Oncol. 2023;7:88. 10.1038/s41698-023-00441-5. 37696903 10.1038/s41698-023-00441-5 PMC10495390 312. Kersten K Spatiotemporal co-dependency between macrophages and exhausted CD8(+) T cells in cancer Cancer Cell 2022 40 624 638.e629 10.1016/j.ccell.2022.05.004 35623342 PMC9197962 Kersten K, et al. Spatiotemporal co-dependency between macrophages and exhausted CD8(+) T cells in cancer. Cancer Cell. 2022;40:624-638.e629. 10.1016/j.ccell.2022.05.004. 35623342 10.1016/j.ccell.2022.05.004 PMC9197962 313. Kourtis N A single-cell map of dynamic chromatin landscapes of immune cells in renal cell carcinoma Nat Cancer 2022 3 885 898 10.1038/s43018-022-00391-0 35668194 PMC9325682 Kourtis N, et al. A single-cell map of dynamic chromatin landscapes of immune cells in renal cell carcinoma. Nat Cancer. 2022;3:885–98. 10.1038/s43018-022-00391-0. 35668194 10.1038/s43018-022-00391-0 PMC9325682 314. Blanchett S Boal-Carvalho I Layzell S Seddon B NF-κB and extrinsic cell death pathways - entwined do-or-die decisions for T cells Trends Immunol 2021 42 76 88 10.1016/j.it.2020.10.013 33246882 Blanchett S, Boal-Carvalho I, Layzell S, Seddon B. NF-κB and extrinsic cell death pathways - entwined do-or-die decisions for T cells. Trends Immunol. 2021;42:76–88. 10.1016/j.it.2020.10.013. 33246882 10.1016/j.it.2020.10.013 315. Zhang L Xiao X Arnold PR Li XC Transcriptional and epigenetic regulation of immune tolerance: roles of the NF-κB family members Cell Mol Immunol 2019 16 315 323 10.1038/s41423-019-0202-8 30872809 PMC6461939 Zhang L, Xiao X, Arnold PR, Li XC. Transcriptional and epigenetic regulation of immune tolerance: roles of the NF-κB family members. Cell Mol Immunol. 2019;16:315–23. 10.1038/s41423-019-0202-8. 30872809 10.1038/s41423-019-0202-8 PMC6461939 316. Paul S Schaefer BC A new look at T cell receptor signaling to nuclear factor-κB Trends Immunol 2013 34 269 281 10.1016/j.it.2013.02.002 23474202 PMC3674144 Paul S, Schaefer BC. A new look at T cell receptor signaling to nuclear factor-κB. Trends Immunol. 2013;34:269–81. 10.1016/j.it.2013.02.002. 23474202 10.1016/j.it.2013.02.002 PMC3674144 317. Xu X Effects of PYCR1 on prognosis and immunotherapy plus tyrosine kinase inhibition responsiveness in metastatic renal cell carcinoma patients Neoplasia 2023 43 100919 10.1016/j.neo.2023.100919 37517099 PMC10404727 Xu X, et al. Effects of PYCR1 on prognosis and immunotherapy plus tyrosine kinase inhibition responsiveness in metastatic renal cell carcinoma patients. Neoplasia. 2023;43:100919. 10.1016/j.neo.2023.100919. 37517099 10.1016/j.neo.2023.100919 PMC10404727 318. Ning K Sex differences in renal cell carcinoma: a single-cell analysis reveals exhausted CD8(+) T-cells highly infiltrated in males Biol Sex Differ 2023 14 58 10.1186/s13293-023-00540-9 37715192 PMC10503187 Ning K, et al. Sex differences in renal cell carcinoma: a single-cell analysis reveals exhausted CD8(+) T-cells highly infiltrated in males. Biol Sex Differ. 2023;14: 58. 10.1186/s13293-023-00540-9. 37715192 10.1186/s13293-023-00540-9 PMC10503187 319. Yang C Androgen receptor-mediated CD8(+) T cell stemness programs drive sex differences in antitumor immunity Immunity 2022 55 1268 1283.e1269 10.1016/j.immuni.2022.05.012 35700739 Yang C, et al. Androgen receptor-mediated CD8(+) T cell stemness programs drive sex differences in antitumor immunity. Immunity. 2022;55:1268-1283.e1269. 10.1016/j.immuni.2022.05.012. 35700739 10.1016/j.immuni.2022.05.012 320. Qiu J Single-cell RNA-seq reveals heterogeneity in metastatic renal cell carcinoma and effect of anti-angiogenesis therapy in the pancreas metastatic lesion Cancer Lett 2024 601 217193 10.1016/j.canlet.2024.217193 39159881 Qiu J, et al. Single-cell RNA-seq reveals heterogeneity in metastatic renal cell carcinoma and effect of anti-angiogenesis therapy in the pancreas metastatic lesion. Cancer Lett. 2024;601: 217193. 10.1016/j.canlet.2024.217193. 39159881 10.1016/j.canlet.2024.217193 321. Jiang P Signatures of T cell dysfunction and exclusion predict cancer immunotherapy response Nat Med 2018 24 1550 1558 10.1038/s41591-018-0136-1 30127393 PMC6487502 Jiang P, et al. Signatures of T cell dysfunction and exclusion predict cancer immunotherapy response. Nat Med. 2018;24:1550–8. 10.1038/s41591-018-0136-1. 30127393 10.1038/s41591-018-0136-1 PMC6487502 322. Philip M Schietinger A CD8(+) T cell differentiation and dysfunction in cancer Nat Rev Immunol 2022 22 209 223 10.1038/s41577-021-00574-3 34253904 PMC9792152 Philip M, Schietinger A. CD8(+) T cell differentiation and dysfunction in cancer. Nat Rev Immunol. 2022;22:209–23. 10.1038/s41577-021-00574-3. 34253904 10.1038/s41577-021-00574-3 PMC9792152 323. Jia D Microbial metabolite enhances immunotherapy efficacy by modulating T cell stemness in pan-cancer Cell 2024 187 1651 1665.e1621 10.1016/j.cell.2024.02.022 38490195 Jia D, et al. Microbial metabolite enhances immunotherapy efficacy by modulating T cell stemness in pan-cancer. Cell. 2024;187:1651-1665.e1621. 10.1016/j.cell.2024.02.022. 38490195 10.1016/j.cell.2024.02.022 324. Rahim MK Dynamic CD8(+) T cell responses to cancer immunotherapy in human regional lymph nodes are disrupted in metastatic lymph nodes Cell 2023 186 1127 1143.e1118 10.1016/j.cell.2023.02.021 36931243 PMC10348701 Rahim MK, et al. Dynamic CD8(+) T cell responses to cancer immunotherapy in human regional lymph nodes are disrupted in metastatic lymph nodes. Cell. 2023;186:1127-1143.e1118. 10.1016/j.cell.2023.02.021. 36931243 10.1016/j.cell.2023.02.021 PMC10348701 325. Beltra JC Developmental Relationships of Four Exhausted CD8(+) T Cell Subsets Reveals Underlying Transcriptional and Epigenetic Landscape Control Mechanisms Immunity 2020 52 825 841.e828 10.1016/j.immuni.2020.04.014 32396847 PMC8360766 Beltra JC, et al. Developmental Relationships of Four Exhausted CD8(+) T Cell Subsets Reveals Underlying Transcriptional and Epigenetic Landscape Control Mechanisms. Immunity. 2020;52:825-841.e828. 10.1016/j.immuni.2020.04.014. 32396847 10.1016/j.immuni.2020.04.014 PMC8360766 326. Giles JR Globig AM Kaech SM Wherry EJ CD8(+) T cells in the cancer-immunity cycle Immunity 2023 56 2231 2253 10.1016/j.immuni.2023.09.005 37820583 PMC11237652 Giles JR, Globig AM, Kaech SM, Wherry EJ. CD8(+) T cells in the cancer-immunity cycle. Immunity. 2023;56:2231–53. 10.1016/j.immuni.2023.09.005. 37820583 10.1016/j.immuni.2023.09.005 PMC11237652 327. Hudson WH Wieland A Technology meets TILs: deciphering T cell function in the -omics era Cancer Cell 2023 41 41 57 10.1016/j.ccell.2022.09.011 36206755 PMC9839604 Hudson WH, Wieland A. Technology meets TILs: deciphering T cell function in the -omics era. Cancer Cell. 2023;41:41–57. 10.1016/j.ccell.2022.09.011. 36206755 10.1016/j.ccell.2022.09.011 PMC9839604 328. Kinget L A spatial architecture-embedding HLA signature to predict clinical response to immunotherapy in renal cell carcinoma Nat Med 2024 30 1667 1679 10.1038/s41591-024-02978-9 38773341 Kinget L, et al. A spatial architecture-embedding HLA signature to predict clinical response to immunotherapy in renal cell carcinoma. Nat Med. 2024;30:1667–79. 10.1038/s41591-024-02978-9. 38773341 10.1038/s41591-024-02978-9 329. Krishna C Single-cell sequencing links multiregional immune landscapes and tissue-resident T cells in ccRCC to tumor topology and therapy efficacy Cancer Cell 2021 39 662 677.e666 10.1016/j.ccell.2021.03.007 33861994 PMC8268947 Krishna C, et al. Single-cell sequencing links multiregional immune landscapes and tissue-resident T cells in ccRCC to tumor topology and therapy efficacy. Cancer Cell. 2021;39:662-677.e666. 10.1016/j.ccell.2021.03.007. 33861994 10.1016/j.ccell.2021.03.007 PMC8268947 330. Au L Determinants of anti-PD-1 response and resistance in clear cell renal cell carcinoma Cancer Cell 2021 39 1497 1518.e1411 10.1016/j.ccell.2021.10.001 34715028 PMC8599450 Au L, et al. Determinants of anti-PD-1 response and resistance in clear cell renal cell carcinoma. Cancer Cell. 2021;39:1497-1518.e1411. 10.1016/j.ccell.2021.10.001. 34715028 10.1016/j.ccell.2021.10.001 PMC8599450 331. De Meerleer G Radiotherapy for renal-cell carcinoma Lancet Oncol 2014 15 e170 177 10.1016/s1470-2045(13)70569-2 24694640 De Meerleer G, et al. Radiotherapy for renal-cell carcinoma. Lancet Oncol. 2014;15:e170-177. 10.1016/s1470-2045(13)70569-2. 24694640 10.1016/S1470-2045(13)70569-2 332. Ljungberg B EAU guidelines on renal cell carcinoma: the 2010 update Eur Urol 2010 58 398 406 10.1016/j.eururo.2010.06.032 20633979 Ljungberg B, et al. EAU guidelines on renal cell carcinoma: the 2010 update. Eur Urol. 2010;58:398–406. 10.1016/j.eururo.2010.06.032. 20633979 10.1016/j.eururo.2010.06.032 333. Motzer RJ NCCN clinical practice guidelines in oncology: kidney cancer Journal of the National Comprehensive Cancer Network : JNCCN 2009 7 618 630 10.6004/jnccn.2009.0043 19555584 Motzer RJ, et al. NCCN clinical practice guidelines in oncology: kidney cancer. Journal of the National Comprehensive Cancer Network : JNCCN. 2009;7:618–30. 10.6004/jnccn.2009.0043. 19555584 10.6004/jnccn.2009.0043 334. Yun EJ Downregulation of Human DAB2IP Gene Expression in Renal Cell Carcinoma Results in Resistance to Ionizing Radiation Clinical cancer research : an official journal of the American Association for Cancer Research 2019 25 4542 4551 10.1158/1078-0432.Ccr-18-3004 31000589 PMC6635020 Yun EJ, et al. Downregulation of Human DAB2IP Gene Expression in Renal Cell Carcinoma Results in Resistance to Ionizing Radiation. Clinical cancer research : an official journal of the American Association for Cancer Research. 2019;25:4542–51. 10.1158/1078-0432.Ccr-18-3004. 31000589 10.1158/1078-0432.CCR-18-3004 PMC6635020 335. Wu Z Asymmetrically PEGylated and amphipathic heptamethine indocyanine dyes potentiate radiotherapy of renal cell carcinoma via mitochondrial targeting J Nanobiotechnology 2024 22 756 10.1186/s12951-024-03012-3 39695771 PMC11658457 Wu Z, et al. Asymmetrically PEGylated and amphipathic heptamethine indocyanine dyes potentiate radiotherapy of renal cell carcinoma via mitochondrial targeting. J Nanobiotechnology. 2024;22:756. 10.1186/s12951-024-03012-3. 39695771 10.1186/s12951-024-03012-3 PMC11658457 336. Siva S Radiotherapy for renal cell carcinoma: renaissance of an overlooked approach Nat Rev Urol 2017 14 549 563 10.1038/nrurol.2017.87 28631740 Siva S, et al. Radiotherapy for renal cell carcinoma: renaissance of an overlooked approach. Nat Rev Urol. 2017;14:549–63. 10.1038/nrurol.2017.87. 28631740 10.1038/nrurol.2017.87 337. Chow J, et al. Tumor and immune remodeling following radiotherapy in human renal cell carcinoma. J Immunotherof Cancer. 2023;11. 10.1136/jitc-2022-006392. 10.1136/jitc-2022-006392 PMC10124322 37080610 338. Li H Dysfunctional CD8 T Cells Form a Proliferative, Dynamically Regulated Compartment within Human Melanoma Cell 2019 176 775 789.e718 10.1016/j.cell.2018.11.043 30595452 PMC7253294 Li H, et al. Dysfunctional CD8 T Cells Form a Proliferative, Dynamically Regulated Compartment within Human Melanoma. Cell. 2019;176:775-789.e718. 10.1016/j.cell.2018.11.043. 30595452 10.1016/j.cell.2018.11.043 PMC7253294 339. Li J Tumor Cell-Intrinsic Factors Underlie Heterogeneity of Immune Cell Infiltration and Response to Immunotherapy Immunity 2018 49 178 193.e177 10.1016/j.immuni.2018.06.006 29958801 PMC6707727 Li J, et al. Tumor Cell-Intrinsic Factors Underlie Heterogeneity of Immune Cell Infiltration and Response to Immunotherapy. Immunity. 2018;49:178-193.e177. 10.1016/j.immuni.2018.06.006. 29958801 10.1016/j.immuni.2018.06.006 PMC6707727 340. Milner JJ Heterogenous Populations of Tissue-Resident CD8(+) T Cells Are Generated in Response to Infection and Malignancy Immunity 2020 52 808 824.e807 10.1016/j.immuni.2020.04.007 32433949 PMC7784612 Milner JJ, et al. Heterogenous Populations of Tissue-Resident CD8(+) T Cells Are Generated in Response to Infection and Malignancy. Immunity. 2020;52:808-824.e807. 10.1016/j.immuni.2020.04.007. 32433949 10.1016/j.immuni.2020.04.007 PMC7784612 341. Sun Y Phenotypic and spatial heterogeneity of CD8(+) tumour infiltrating lymphocytes Mol Cancer 2024 23 193 10.1186/s12943-024-02104-w 39251981 PMC11382426 Sun Y, et al. Phenotypic and spatial heterogeneity of CD8(+) tumour infiltrating lymphocytes. Mol Cancer. 2024;23: 193. 10.1186/s12943-024-02104-w. 39251981 10.1186/s12943-024-02104-w PMC11382426 342. Guo X Global characterization of T cells in non-small-cell lung cancer by single-cell sequencing Nat Med 2018 24 978 985 10.1038/s41591-018-0045-3 29942094 Guo X, et al. Global characterization of T cells in non-small-cell lung cancer by single-cell sequencing. Nat Med. 2018;24:978–85. 10.1038/s41591-018-0045-3. 29942094 10.1038/s41591-018-0045-3 343. Joshi K Spatial heterogeneity of the T cell receptor repertoire reflects the mutational landscape in lung cancer Nat Med 2019 25 1549 1559 10.1038/s41591-019-0592-2 31591606 PMC6890490 Joshi K, et al. Spatial heterogeneity of the T cell receptor repertoire reflects the mutational landscape in lung cancer. Nat Med. 2019;25:1549–59. 10.1038/s41591-019-0592-2. 31591606 10.1038/s41591-019-0592-2 PMC6890490 344. Philip M Chromatin states define tumour-specific T cell dysfunction and reprogramming Nature 2017 545 452 456 10.1038/nature22367 28514453 PMC5693219 Philip M, et al. Chromatin states define tumour-specific T cell dysfunction and reprogramming. Nature. 2017;545:452–6. 10.1038/nature22367. 28514453 10.1038/nature22367 PMC5693219 345. Shiau CK High throughput single cell long-read sequencing analyses of same-cell genotypes and phenotypes in human tumors Nat Commun 2023 14 4124 10.1038/s41467-023-39813-7 37433798 PMC10336110 Shiau CK, et al. High throughput single cell long-read sequencing analyses of same-cell genotypes and phenotypes in human tumors. Nat Commun. 2023;14:4124. 10.1038/s41467-023-39813-7. 37433798 10.1038/s41467-023-39813-7 PMC10336110 346. Deep D Precursor central memory versus effector cell fate and naïve CD4+ T cell heterogeneity J Exp Med 2024 10.1084/jem.20231193 39321257 PMC11448869 Deep D, et al. Precursor central memory versus effector cell fate and naïve CD4+ T cell heterogeneity. J Exp Med. 2024. 10.1084/jem.20231193. 39321257 10.1084/jem.20231193 PMC11448869 347. Künzli M Masopust D CD4(+) T cell memory Nat Immunol 2023 24 903 914 10.1038/s41590-023-01510-4 37156885 PMC10343737 Künzli M, Masopust D. CD4(+) T cell memory. Nat Immunol. 2023;24:903–14. 10.1038/s41590-023-01510-4. 37156885 10.1038/s41590-023-01510-4 PMC10343737 348. Oja AE Functional heterogeneity of CD4(+) tumor-infiltrating lymphocytes with a resident memory phenotype in NSCLC Front Immunol 2018 9 2654 10.3389/fimmu.2018.02654 30505306 PMC6250821 Oja AE, et al. Functional heterogeneity of CD4(+) tumor-infiltrating lymphocytes with a resident memory phenotype in NSCLC. Front Immunol. 2018;9: 2654. 10.3389/fimmu.2018.02654. 30505306 10.3389/fimmu.2018.02654 PMC6250821 349. Speiser DE Chijioke O Schaeuble K Münz C CD4(+) T cells in cancer Nat Cancer 2023 4 317 329 10.1038/s43018-023-00521-2 36894637 Speiser DE, Chijioke O, Schaeuble K, Münz C. CD4(+) T cells in cancer. Nat Cancer. 2023;4:317–29. 10.1038/s43018-023-00521-2. 36894637 10.1038/s43018-023-00521-2 350. Borst J Ahrends T Bąbała N Melief CJM Kastenmüller W CD4(+) T cell help in cancer immunology and immunotherapy Nat Rev Immunol 2018 18 635 647 10.1038/s41577-018-0044-0 30057419 Borst J, Ahrends T, Bąbała N, Melief CJM, Kastenmüller W. CD4(+) T cell help in cancer immunology and immunotherapy. Nat Rev Immunol. 2018;18:635–47. 10.1038/s41577-018-0044-0. 30057419 10.1038/s41577-018-0044-0 351. Guo M Liu MYR Brooks DG Regulation and impact of tumor-specific CD4(+) T cells in cancer and immunotherapy Trends Immunol 2024 45 303 313 10.1016/j.it.2024.02.005 38508931 Guo M, Liu MYR, Brooks DG. Regulation and impact of tumor-specific CD4(+) T cells in cancer and immunotherapy. Trends Immunol. 2024;45:303–13. 10.1016/j.it.2024.02.005. 38508931 10.1016/j.it.2024.02.005 352. Su S Blocking the recruitment of naive CD4(+) T cells reverses immunosuppression in breast cancer Cell Res 2017 27 461 82 10.1038/cr.2017.34 28290464 PMC5385617 Su S, et al. Blocking the recruitment of naive CD4(+) T cells reverses immunosuppression in breast cancer. Cell Res. 2017;27:461–82. 10.1038/cr.2017.34. 28290464 10.1038/cr.2017.34 PMC5385617 353. Oh DY Intratumoral CD4(+) T Cells Mediate Anti-tumor Cytotoxicity in Human Bladder Cancer Cell 2020 181 1612 1625.e1613 10.1016/j.cell.2020.05.017 32497499 PMC7321885 Oh DY, et al. Intratumoral CD4(+) T Cells Mediate Anti-tumor Cytotoxicity in Human Bladder Cancer. Cell. 2020;181:1612-1625.e1613. 10.1016/j.cell.2020.05.017. 32497499 10.1016/j.cell.2020.05.017 PMC7321885 354. Alizadeh D Wang D Brown CE Uncovering the role of CD4+ CAR T cells in cancer immunotherapy Can Res 2023 83 2813 2815 10.1158/0008-5472.Can-23-1948 37404063 Alizadeh D, Wang D, Brown CE. Uncovering the role of CD4+ CAR T cells in cancer immunotherapy. Can Res. 2023;83:2813–5. 10.1158/0008-5472.Can-23-1948. 10.1158/0008-5472.CAN-23-1948 37404063 355. Kagamu H Single-Cell Analysis Reveals a CD4+ T-cell Cluster That Correlates with PD-1 Blockade Efficacy Can Res 2022 82 4641 4653 10.1158/0008-5472.Can-22-0112 PMC9755963 36219677 Kagamu H, et al. Single-Cell Analysis Reveals a CD4+ T-cell Cluster That Correlates with PD-1 Blockade Efficacy. Can Res. 2022;82:4641–53. 10.1158/0008-5472.Can-22-0112. 10.1158/0008-5472.CAN-22-0112 PMC9755963 36219677 356. Chu Y Pan-cancer T cell atlas links a cellular stress response state to immunotherapy resistance Nat Med 2023 29 1550 1562 10.1038/s41591-023-02371-y 37248301 PMC11421770 Chu Y, et al. Pan-cancer T cell atlas links a cellular stress response state to immunotherapy resistance. Nat Med. 2023;29:1550–62. 10.1038/s41591-023-02371-y. 37248301 10.1038/s41591-023-02371-y PMC11421770 357. Arora R Spatial transcriptomics reveals distinct and conserved tumor core and edge architectures that predict survival and targeted therapy response Nat Commun 2023 14 5029 10.1038/s41467-023-40271-4 37596273 PMC10439131 Arora R, et al. Spatial transcriptomics reveals distinct and conserved tumor core and edge architectures that predict survival and targeted therapy response. Nat Commun. 2023;14:5029. 10.1038/s41467-023-40271-4. 37596273 10.1038/s41467-023-40271-4 PMC10439131 358. Nishikawa H Koyama S Mechanisms of regulatory T cell infiltration in tumors: implications for innovative immune precision therapies J Immunother Cancer 2021 10.1136/jitc-2021-002591 34330764 PMC8327843 Nishikawa H, Koyama S. Mechanisms of regulatory T cell infiltration in tumors: implications for innovative immune precision therapies. J Immunother Cancer. 2021. 10.1136/jitc-2021-002591. 34330764 10.1136/jitc-2021-002591 PMC8327843 359. Marshall EA Emerging roles of T helper 17 and regulatory T cells in lung cancer progression and metastasis Mol Cancer 2016 15 67 10.1186/s12943-016-0551-1 27784305 PMC5082389 Marshall EA, et al. Emerging roles of T helper 17 and regulatory T cells in lung cancer progression and metastasis. Mol Cancer. 2016;15:67. 10.1186/s12943-016-0551-1. 27784305 10.1186/s12943-016-0551-1 PMC5082389 360. Watson MJ Metabolic support of tumour-infiltrating regulatory T cells by lactic acid Nature 2021 591 645 651 10.1038/s41586-020-03045-2 33589820 PMC7990682 Watson MJ, et al. Metabolic support of tumour-infiltrating regulatory T cells by lactic acid. Nature. 2021;591:645–51. 10.1038/s41586-020-03045-2. 33589820 10.1038/s41586-020-03045-2 PMC7990682 361. Wang H Franco F Ho PC Metabolic regulation of Tregs in cancer: opportunities for immunotherapy Trends in cancer 2017 3 583 592 10.1016/j.trecan.2017.06.005 28780935 Wang H, Franco F, Ho PC. Metabolic regulation of Tregs in cancer: opportunities for immunotherapy. Trends in cancer. 2017;3:583–92. 10.1016/j.trecan.2017.06.005. 28780935 10.1016/j.trecan.2017.06.005 362. Kang JH Zappasodi R Modulating Treg stability to improve cancer immunotherapy Trends in cancer 2023 9 911 927 10.1016/j.trecan.2023.07.015 37598003 Kang JH, Zappasodi R. Modulating Treg stability to improve cancer immunotherapy. Trends in cancer. 2023;9:911–27. 10.1016/j.trecan.2023.07.015. 37598003 10.1016/j.trecan.2023.07.015 363. Murakami T Multiplexed single-cell pathology reveals the association of CD8 T-cell heterogeneity with prognostic outcomes in renal cell carcinoma Cancer immunology, immunotherapy : CII 2021 70 3001 3013 10.1007/s00262-021-03006-2 34259900 PMC10992910 Murakami T, et al. Multiplexed single-cell pathology reveals the association of CD8 T-cell heterogeneity with prognostic outcomes in renal cell carcinoma. Cancer immunology, immunotherapy : CII. 2021;70:3001–13. 10.1007/s00262-021-03006-2. 34259900 10.1007/s00262-021-03006-2 PMC10992910 364. Kim MC CD177 modulates the function and homeostasis of tumor-infiltrating regulatory T cells Nat Commun 2021 12 5764 10.1038/s41467-021-26091-4 34599187 PMC8486774 Kim MC, et al. CD177 modulates the function and homeostasis of tumor-infiltrating regulatory T cells. Nat Commun. 2021;12:5764. 10.1038/s41467-021-26091-4. 34599187 10.1038/s41467-021-26091-4 PMC8486774 365. Aggen DH Blocking IL1 Beta Promotes Tumor Regression and Remodeling of the Myeloid Compartment in a Renal Cell Carcinoma Model: Multidimensional Analyses Clinical cancer research : an official journal of the American Association for Cancer Research 2021 27 608 621 10.1158/1078-0432.Ccr-20-1610 33148676 PMC7980495 Aggen DH, et al. Blocking IL1 Beta Promotes Tumor Regression and Remodeling of the Myeloid Compartment in a Renal Cell Carcinoma Model: Multidimensional Analyses. Clinical cancer research : an official journal of the American Association for Cancer Research. 2021;27:608–21. 10.1158/1078-0432.Ccr-20-1610. 33148676 10.1158/1078-0432.CCR-20-1610 PMC7980495 366. Yang X Single-Cell Analysis Identifies Distinct Populations of Cytotoxic CD4(+) T Cells Linked to the Therapeutic Efficacy of Immune Checkpoint Inhibitors in Metastatic Renal Cell Carcinoma J Inflamm Res 2024 17 4505 4523 10.2147/jir.S457570 39006494 PMC11246657 Yang X, et al. Single-Cell Analysis Identifies Distinct Populations of Cytotoxic CD4(+) T Cells Linked to the Therapeutic Efficacy of Immune Checkpoint Inhibitors in Metastatic Renal Cell Carcinoma. J Inflamm Res. 2024;17:4505–23. 10.2147/jir.S457570. 39006494 10.2147/JIR.S457570 PMC11246657 367. Qixin Y Transcriptome-based network analysis related to regulatory T cells infiltration identified RCN1 as a potential biomarker for prognosis in clear cell renal cell carcinoma BioData mining 2024 17 51 10.1186/s13040-024-00404-x 39543725 PMC11566375 Qixin Y, et al. Transcriptome-based network analysis related to regulatory T cells infiltration identified RCN1 as a potential biomarker for prognosis in clear cell renal cell carcinoma. BioData mining. 2024;17:51. 10.1186/s13040-024-00404-x. 39543725 10.1186/s13040-024-00404-x PMC11566375 368. Cassetta L Pollard JW Targeting macrophages: therapeutic approaches in cancer Nat Rev Drug Discov 2018 17 887 904 10.1038/nrd.2018.169 30361552 Cassetta L, Pollard JW. Targeting macrophages: therapeutic approaches in cancer. Nat Rev Drug Discov. 2018;17:887–904. 10.1038/nrd.2018.169. 30361552 10.1038/nrd.2018.169 369. Yang L Zhang Y Tumor-associated macrophages: from basic research to clinical application J Hematol Oncol 2017 10 58 10.1186/s13045-017-0430-2 28241846 PMC5329931 Yang L, Zhang Y. Tumor-associated macrophages: from basic research to clinical application. J Hematol Oncol. 2017;10:58. 10.1186/s13045-017-0430-2. 28241846 10.1186/s13045-017-0430-2 PMC5329931 370. Chu X Tian Y Lv C Decoding the spatiotemporal heterogeneity of tumor-associated macrophages Mol Cancer 2024 23 150 10.1186/s12943-024-02064-1 39068459 PMC11282869 Chu X, Tian Y, Lv C. Decoding the spatiotemporal heterogeneity of tumor-associated macrophages. Mol Cancer. 2024;23:150. 10.1186/s12943-024-02064-1. 39068459 10.1186/s12943-024-02064-1 PMC11282869 371. Li X Harnessing tumor-associated macrophages as aids for cancer immunotherapy Mol Cancer 2019 18 177 10.1186/s12943-019-1102-3 31805946 PMC6894344 Li X, et al. Harnessing tumor-associated macrophages as aids for cancer immunotherapy. Mol Cancer. 2019;18:177. 10.1186/s12943-019-1102-3. 31805946 10.1186/s12943-019-1102-3 PMC6894344 372. Kumari N Choi SH Tumor-associated macrophages in cancer: recent advancements in cancer nanoimmunotherapies Journal of experimental & clinical cancer research : CR 2022 41 68 10.1186/s13046-022-02272-x 35183252 PMC8857848 Kumari N, Choi SH. Tumor-associated macrophages in cancer: recent advancements in cancer nanoimmunotherapies. Journal of experimental & clinical cancer research : CR. 2022;41:68. 10.1186/s13046-022-02272-x. 35183252 10.1186/s13046-022-02272-x PMC8857848 373. van Elsas MJ Immunotherapy-activated T cells recruit and skew late-stage activated M1-like macrophages that are critical for therapeutic efficacy Cancer Cell 2024 42 1032 1050.e1010 10.1016/j.ccell.2024.04.011 38759656 van Elsas MJ, et al. Immunotherapy-activated T cells recruit and skew late-stage activated M1-like macrophages that are critical for therapeutic efficacy. Cancer Cell. 2024;42:1032-1050.e1010. 10.1016/j.ccell.2024.04.011. 38759656 10.1016/j.ccell.2024.04.011 374. Anderson NR Minutolo NG Gill S Klichinsky M Macrophage-Based Approaches for Cancer Immunotherapy Can Res 2021 81 1201 1208 10.1158/0008-5472.Can-20-2990 33203697 Anderson NR, Minutolo NG, Gill S, Klichinsky M. Macrophage-Based Approaches for Cancer Immunotherapy. Can Res. 2021;81:1201–8. 10.1158/0008-5472.Can-20-2990. 10.1158/0008-5472.CAN-20-2990 33203697 375. Li H The allergy mediator histamine confers resistance to immunotherapy in cancer patients via activation of the macrophage histamine receptor H1 Cancer Cell 2022 40 36 52.e39 10.1016/j.ccell.2021.11.002 34822775 PMC8779329 Li H, et al. The allergy mediator histamine confers resistance to immunotherapy in cancer patients via activation of the macrophage histamine receptor H1. Cancer Cell. 2022;40:36-52.e39. 10.1016/j.ccell.2021.11.002. 34822775 10.1016/j.ccell.2021.11.002 PMC8779329 376. Liu H Molecular understanding and clinical aspects of tumor-associated macrophages in the immunotherapy of renal cell carcinoma Journal of experimental & clinical cancer research : CR 2024 43 242 10.1186/s13046-024-03164-y 39169402 PMC11340075 Liu H, et al. Molecular understanding and clinical aspects of tumor-associated macrophages in the immunotherapy of renal cell carcinoma. Journal of experimental & clinical cancer research : CR. 2024;43:242. 10.1186/s13046-024-03164-y. 39169402 10.1186/s13046-024-03164-y PMC11340075 377. Mantovani A Sica A Locati M Macrophage polarization comes of age Immunity 2005 23 4 344 6 10.1016/j.immuni.2005.10.001 16226499 Mantovani A, Sica A, Locati M. Macrophage polarization comes of age. Immunity. 2005;23(4):344–6. 10.1016/j.immuni.2005.10.001. 16226499 10.1016/j.immuni.2005.10.001 378. Mantovani A Sozzani S Locati M Allavena P Sica A Macrophage polarization: tumor-associated macrophages as a paradigm for polarized M2 mononuclear phagocytes Trends Immunol 2002 23 549 555 10.1016/s1471-4906(02)02302-5 12401408 Mantovani A, Sozzani S, Locati M, Allavena P, Sica A. Macrophage polarization: tumor-associated macrophages as a paradigm for polarized M2 mononuclear phagocytes. Trends Immunol. 2002;23:549–55. 10.1016/s1471-4906(02)02302-5. 12401408 10.1016/s1471-4906(02)02302-5 379. Yang J Liu Q Shyr Y A Large-Scale Meta-Analysis Reveals Positive Feedback between Macrophages and T Cells That Sensitizes Tumors to Immunotherapy Can Res 2024 84 626 638 10.1158/0008-5472.Can-23-2006 PMC10867621 38117502 Yang J, Liu Q, Shyr Y. A Large-Scale Meta-Analysis Reveals Positive Feedback between Macrophages and T Cells That Sensitizes Tumors to Immunotherapy. Can Res. 2024;84:626–38. 10.1158/0008-5472.Can-23-2006. 10.1158/0008-5472.CAN-23-2006 PMC10867621 38117502 380. Schoenfeld DA Immune dysfunction revealed by digital spatial profiling of immuno-oncology markers in progressive stages of renal cell carcinoma and in brain metastases J Immunother Cancer 2023 10.1136/jitc-2023-007240 37586773 PMC10432651 Schoenfeld DA, et al. Immune dysfunction revealed by digital spatial profiling of immuno-oncology markers in progressive stages of renal cell carcinoma and in brain metastases. J Immunother Cancer. 2023. 10.1136/jitc-2023-007240. 37586773 10.1136/jitc-2023-007240 PMC10432651 381. Guo F Single-cell analysis reveals that TCF7L2 facilitates the progression of ccRCC via tumor-associated macrophages Cell Signal 2024 124 111453 10.1016/j.cellsig.2024.111453 39366533 Guo F, et al. Single-cell analysis reveals that TCF7L2 facilitates the progression of ccRCC via tumor-associated macrophages. Cell Signal. 2024;124: 111453. 10.1016/j.cellsig.2024.111453. 39366533 10.1016/j.cellsig.2024.111453 382. Litchfield K Meta-analysis of tumor- and T cell-intrinsic mechanisms of sensitization to checkpoint inhibition Cell 2021 184 596 614.e514 10.1016/j.cell.2021.01.002 33508232 PMC7933824 Litchfield K, et al. Meta-analysis of tumor- and T cell-intrinsic mechanisms of sensitization to checkpoint inhibition. Cell. 2021;184:596-614.e514. 10.1016/j.cell.2021.01.002. 33508232 10.1016/j.cell.2021.01.002 PMC7933824 383. Coulton A Using a pan-cancer atlas to investigate tumour associated macrophages as regulators of immunotherapy response Nat Commun 2024 15 5665 10.1038/s41467-024-49885-8 38969631 PMC11226649 Coulton A, et al. Using a pan-cancer atlas to investigate tumour associated macrophages as regulators of immunotherapy response. Nat Commun. 2024;15:5665. 10.1038/s41467-024-49885-8. 38969631 10.1038/s41467-024-49885-8 PMC11226649 384. Bassez A A single-cell map of intratumoral changes during anti-PD1 treatment of patients with breast cancer Nat Med 2021 27 820 832 10.1038/s41591-021-01323-8 33958794 Bassez A, et al. A single-cell map of intratumoral changes during anti-PD1 treatment of patients with breast cancer. Nat Med. 2021;27:820–32. 10.1038/s41591-021-01323-8. 33958794 10.1038/s41591-021-01323-8 385. Liang Y Single-cell atlases link macrophages and CD8(+) T-cell subpopulations to disease progression and immunotherapy response in urothelial carcinoma Theranostics 2022 12 7745 59 10.7150/thno.77281 36451860 PMC9706581 Liang Y, et al. Single-cell atlases link macrophages and CD8(+) T-cell subpopulations to disease progression and immunotherapy response in urothelial carcinoma. Theranostics. 2022;12:7745–59. 10.7150/thno.77281. 36451860 10.7150/thno.77281 PMC9706581 386. Luckett T Mesothelin Secretion by Pancreatic Cancer Cells Co-opts Macrophages and Promotes Metastasis Can Res 2024 84 527 544 10.1158/0008-5472.Can-23-1542 38356443 Luckett T, et al. Mesothelin Secretion by Pancreatic Cancer Cells Co-opts Macrophages and Promotes Metastasis. Can Res. 2024;84:527–44. 10.1158/0008-5472.Can-23-1542. 10.1158/0008-5472.CAN-23-1542 38356443 387. Ni X Interrogating glioma-M2 macrophage interactions identifies Gal-9/Tim-3 as a viable target against PTEN-null glioblastoma Sci Adv 2022 8 eabl5165 10.1126/sciadv.abl5165 35857445 PMC9269888 Ni X, et al. Interrogating glioma-M2 macrophage interactions identifies Gal-9/Tim-3 as a viable target against PTEN-null glioblastoma. Sci Adv. 2022;8: eabl5165. 10.1126/sciadv.abl5165. 35857445 10.1126/sciadv.abl5165 PMC9269888 388. Zhao Y XBP1 regulates the protumoral function of tumor-associated macrophages in human colorectal cancer Signal Transduct Target Ther 2021 6 357 10.1038/s41392-021-00761-7 34667145 PMC8526672 Zhao Y, et al. XBP1 regulates the protumoral function of tumor-associated macrophages in human colorectal cancer. Signal Transduct Target Ther. 2021;6:357. 10.1038/s41392-021-00761-7. 34667145 10.1038/s41392-021-00761-7 PMC8526672 389. Albini A Noonan DM Decidual-like NK cell polarization: from cancer killing to cancer nurturing Cancer Discov 2021 11 28 33 10.1158/2159-8290.Cd-20-0796 33277305 Albini A, Noonan DM. Decidual-like NK cell polarization: from cancer killing to cancer nurturing. Cancer Discov. 2021;11:28–33. 10.1158/2159-8290.Cd-20-0796. 33277305 10.1158/2159-8290.CD-20-0796 390. Cong J Dysfunction of Natural Killer Cells by FBP1-Induced Inhibition of Glycolysis during Lung Cancer Progression Cell Metab 2018 28 243 255.e245 10.1016/j.cmet.2018.06.021 30033198 Cong J, et al. Dysfunction of Natural Killer Cells by FBP1-Induced Inhibition of Glycolysis during Lung Cancer Progression. Cell Metab. 2018;28:243-255.e245. 10.1016/j.cmet.2018.06.021. 30033198 10.1016/j.cmet.2018.06.021 391. Poznanski SM Metabolic flexibility determines human NK cell functional fate in the tumor microenvironment Cell Metab 2021 33 1205 1220.e1205 10.1016/j.cmet.2021.03.023 33852875 Poznanski SM, et al. Metabolic flexibility determines human NK cell functional fate in the tumor microenvironment. Cell Metab. 2021;33:1205-1220.e1205. 10.1016/j.cmet.2021.03.023. 33852875 10.1016/j.cmet.2021.03.023 392. Wu SY Fu T Jiang YZ Shao ZM Natural killer cells in cancer biology and therapy Mol Cancer 2020 19 120 10.1186/s12943-020-01238-x 32762681 PMC7409673 Wu SY, Fu T, Jiang YZ, Shao ZM. Natural killer cells in cancer biology and therapy. Mol Cancer. 2020;19:120. 10.1186/s12943-020-01238-x. 32762681 10.1186/s12943-020-01238-x PMC7409673 393. Huntington ND Cursons J Rautela J The cancer-natural killer cell immunity cycle Nat Rev Cancer 2020 20 437 454 10.1038/s41568-020-0272-z 32581320 Huntington ND, Cursons J, Rautela J. The cancer-natural killer cell immunity cycle. Nat Rev Cancer. 2020;20:437–54. 10.1038/s41568-020-0272-z. 32581320 10.1038/s41568-020-0272-z 394. Tang F A pan-cancer single-cell panorama of human natural killer cells Cell 2023 186 4235 4251.e4220 10.1016/j.cell.2023.07.034 37607536 Tang F, et al. A pan-cancer single-cell panorama of human natural killer cells. Cell. 2023;186:4235-4251.e4220. 10.1016/j.cell.2023.07.034. 37607536 10.1016/j.cell.2023.07.034 395. Liang Z Heterogeneity in NK Cell Subpopulations May Be Involved in Kidney Cancer Metastasis J Immunol Res 2022 2022 6378567 10.1155/2022/6378567 36046723 PMC9424044 Liang Z, et al. Heterogeneity in NK Cell Subpopulations May Be Involved in Kidney Cancer Metastasis. J Immunol Res. 2022;2022:6378567. 10.1155/2022/6378567. 36046723 10.1155/2022/6378567 PMC9424044 396. Gupta R The interactions of docetaxel with tumor microenvironment Int Immunopharmacol 2023 119 110214 10.1016/j.intimp.2023.110214 37126985 Gupta R, et al. The interactions of docetaxel with tumor microenvironment. Int Immunopharmacol. 2023;119: 110214. 10.1016/j.intimp.2023.110214. 37126985 10.1016/j.intimp.2023.110214 397. Zhou J Zhang S Guo C Crosstalk between macrophages and natural killer cells in the tumor microenvironment Int Immunopharmacol 2021 101 108374 10.1016/j.intimp.2021.108374 34824036 Zhou J, Zhang S, Guo C. Crosstalk between macrophages and natural killer cells in the tumor microenvironment. Int Immunopharmacol. 2021;101: 108374. 10.1016/j.intimp.2021.108374. 34824036 10.1016/j.intimp.2021.108374 398. Gong Y Klein Wolterink RGJ Wang J Bos GMJ Germeraad WTV Chimeric antigen receptor natural killer (CAR-NK) cell design and engineering for cancer therapy J Hematol Oncol 2021 14 73 10.1186/s13045-021-01083-5 33933160 PMC8088725 Gong Y, Klein Wolterink RGJ, Wang J, Bos GMJ, Germeraad WTV. Chimeric antigen receptor natural killer (CAR-NK) cell design and engineering for cancer therapy. J Hematol Oncol. 2021;14:73. 10.1186/s13045-021-01083-5. 33933160 10.1186/s13045-021-01083-5 PMC8088725 399. Liu S NK cell-based cancer immunotherapy: from basic biology to clinical development J Hematol Oncol 2021 14 7 10.1186/s13045-020-01014-w 33407739 PMC7788999 Liu S, et al. NK cell-based cancer immunotherapy: from basic biology to clinical development. J Hematol Oncol. 2021;14:7. 10.1186/s13045-020-01014-w. 33407739 10.1186/s13045-020-01014-w PMC7788999 400. Bald T Krummel MF Smyth MJ Barry KC The NK cell-cancer cycle: advances and new challenges in NK cell-based immunotherapies Nat Immunol 2020 21 835 847 10.1038/s41590-020-0728-z 32690952 PMC8406687 Bald T, Krummel MF, Smyth MJ, Barry KC. The NK cell-cancer cycle: advances and new challenges in NK cell-based immunotherapies. Nat Immunol. 2020;21:835–47. 10.1038/s41590-020-0728-z. 32690952 10.1038/s41590-020-0728-z PMC8406687 401. Myers JA Miller JS Exploring the NK cell platform for cancer immunotherapy Nat Rev Clin Oncol 2021 18 85 100 10.1038/s41571-020-0426-7 32934330 PMC8316981 Myers JA, Miller JS. Exploring the NK cell platform for cancer immunotherapy. Nat Rev Clin Oncol. 2021;18:85–100. 10.1038/s41571-020-0426-7. 32934330 10.1038/s41571-020-0426-7 PMC8316981 402. Shimasaki N Jain A Campana D NK cells for cancer immunotherapy Nat Rev Drug Discovery 2020 19 200 218 10.1038/s41573-019-0052-1 31907401 Shimasaki N, Jain A, Campana D. NK cells for cancer immunotherapy. Nat Rev Drug Discovery. 2020;19:200–18. 10.1038/s41573-019-0052-1. 31907401 10.1038/s41573-019-0052-1 403. Vivier E Natural killer cell therapies Nature 2024 626 727 736 10.1038/s41586-023-06945-1 38383621 Vivier E, et al. Natural killer cell therapies. Nature. 2024;626:727–36. 10.1038/s41586-023-06945-1. 38383621 10.1038/s41586-023-06945-1 404. Chiossone L Dumas PY Vienne M Vivier E Natural killer cells and other innate lymphoid cells in cancer Nat Rev Immunol 2018 18 671 688 10.1038/s41577-018-0061-z 30209347 Chiossone L, Dumas PY, Vienne M, Vivier E. Natural killer cells and other innate lymphoid cells in cancer. Nat Rev Immunol. 2018;18:671–88. 10.1038/s41577-018-0061-z. 30209347 10.1038/s41577-018-0061-z 405. Del Prete A Dendritic cell subsets in cancer immunity and tumor antigen sensing Cell Mol Immunol 2023 20 432 447 10.1038/s41423-023-00990-6 36949244 PMC10203372 Del Prete A, et al. Dendritic cell subsets in cancer immunity and tumor antigen sensing. Cell Mol Immunol. 2023;20:432–47. 10.1038/s41423-023-00990-6. 36949244 10.1038/s41423-023-00990-6 PMC10203372 406. Gerhard GM Bill R Messemaker M Klein AM Pittet MJ Tumor-infiltrating dendritic cell states are conserved across solid human cancers J Exp Med 2021 10.1084/jem.20200264 33601412 PMC7754678 Gerhard GM, Bill R, Messemaker M, Klein AM, Pittet MJ. Tumor-infiltrating dendritic cell states are conserved across solid human cancers. J Exp Med. 2021. 10.1084/jem.20200264. 33601412 10.1084/jem.20200264 PMC7754678 407. Wiernicki B Cancer cells dying from ferroptosis impede dendritic cell-mediated anti-tumor immunity Nat Commun 2022 13 3676 10.1038/s41467-022-31218-2 35760796 PMC9237053 Wiernicki B, et al. Cancer cells dying from ferroptosis impede dendritic cell-mediated anti-tumor immunity. Nat Commun. 2022;13:3676. 10.1038/s41467-022-31218-2. 35760796 10.1038/s41467-022-31218-2 PMC9237053 408. Herber DL Lipid accumulation and dendritic cell dysfunction in cancer Nat Med 2010 16 880 886 10.1038/nm.2172 20622859 PMC2917488 Herber DL, et al. Lipid accumulation and dendritic cell dysfunction in cancer. Nat Med. 2010;16:880–6. 10.1038/nm.2172. 20622859 10.1038/nm.2172 PMC2917488 409. Gabrilovich D Mechanisms and functional significance of tumour-induced dendritic-cell defects Nat Rev Immunol 2004 4 941 952 10.1038/nri1498 15573129 Gabrilovich D. Mechanisms and functional significance of tumour-induced dendritic-cell defects. Nat Rev Immunol. 2004;4:941–52. 10.1038/nri1498. 15573129 10.1038/nri1498 410. Lesterhuis WJ de Vries IJ Adema GJ Punt CJ Dendritic cell-based vaccines in cancer immunotherapy: an update on clinical and immunological results Ann Oncol 2004 15 Suppl 4 iv145 151 10.1093/annonc/mdh919 15477299 Lesterhuis WJ, de Vries IJ, Adema GJ, Punt CJ. Dendritic cell-based vaccines in cancer immunotherapy: an update on clinical and immunological results. Ann Oncol. 2004;15(Suppl 4):iv145-151. 10.1093/annonc/mdh919. 15477299 10.1093/annonc/mdh919 411. Fong L Engleman EG Dendritic cells in cancer immunotherapy Annu Rev Immunol 2000 18 245 73 10.1146/annurev.immunol.18.1.245 10837059 Fong L, Engleman EG. Dendritic cells in cancer immunotherapy. Annu Rev Immunol. 2000;18:245–73. 10.1146/annurev.immunol.18.1.245. 10837059 10.1146/annurev.immunol.18.1.245 412. Palucka K Banchereau J Dendritic-cell-based therapeutic cancer vaccines Immunity 2013 39 38 48 10.1016/j.immuni.2013.07.004 23890062 PMC3788678 Palucka K, Banchereau J. Dendritic-cell-based therapeutic cancer vaccines. Immunity. 2013;39:38–48. 10.1016/j.immuni.2013.07.004. 23890062 10.1016/j.immuni.2013.07.004 PMC3788678 413. Pitt JM Dendritic cell-derived exosomes for cancer therapy J Clin Investig 2016 126 1224 1232 10.1172/jci81137 27035813 PMC4811123 Pitt JM, et al. Dendritic cell-derived exosomes for cancer therapy. J Clin Investig. 2016;126:1224–32. 10.1172/jci81137. 27035813 10.1172/JCI81137 PMC4811123 414. Figdor CG de Vries IJ Lesterhuis WJ Melief CJ Dendritic cell immunotherapy: mapping the way Nat Med 2004 10 475 480 10.1038/nm1039 15122249 Figdor CG, de Vries IJ, Lesterhuis WJ, Melief CJ. Dendritic cell immunotherapy: mapping the way. Nat Med. 2004;10:475–80. 10.1038/nm1039. 15122249 10.1038/nm1039 415. Heras-Murillo I Adán-Barrientos I Galán M Wculek SK Sancho D Dendritic cells as orchestrators of anticancer immunity and immunotherapy Nat Rev Clin Oncol 2024 21 257 277 10.1038/s41571-024-00859-1 38326563 Heras-Murillo I, Adán-Barrientos I, Galán M, Wculek SK, Sancho D. Dendritic cells as orchestrators of anticancer immunity and immunotherapy. Nat Rev Clin Oncol. 2024;21:257–77. 10.1038/s41571-024-00859-1. 38326563 10.1038/s41571-024-00859-1 416. Li W A single-cell pan-cancer analysis to show the variability of tumor-infiltrating myeloid cells in immune checkpoint blockade Nat Commun 2024 15 6142 10.1038/s41467-024-50478-8 39034339 PMC11271490 Li W, et al. A single-cell pan-cancer analysis to show the variability of tumor-infiltrating myeloid cells in immune checkpoint blockade. Nat Commun. 2024;15:6142. 10.1038/s41467-024-50478-8. 39034339 10.1038/s41467-024-50478-8 PMC11271490 417. Ugel S Canè S De Sanctis F Bronte V Monocytes in the tumor microenvironment Annu Rev Pathol 2021 16 93 122 10.1146/annurev-pathmechdis-012418-013058 33497262 Ugel S, Canè S, De Sanctis F, Bronte V. Monocytes in the tumor microenvironment. Annu Rev Pathol. 2021;16:93–122. 10.1146/annurev-pathmechdis-012418-013058. 33497262 10.1146/annurev-pathmechdis-012418-013058 418. Chen DP Peritumoral monocytes induce cancer cell autophagy to facilitate the progression of human hepatocellular carcinoma Autophagy 2018 14 1335 1346 10.1080/15548627.2018.1474994 29940792 PMC6103724 Chen DP, et al. Peritumoral monocytes induce cancer cell autophagy to facilitate the progression of human hepatocellular carcinoma. Autophagy. 2018;14:1335–46. 10.1080/15548627.2018.1474994. 29940792 10.1080/15548627.2018.1474994 PMC6103724 419. Wang R Intermediate monocytes induced by IFN-γ inhibit cancer metastasis by promoting NK cell activation through FOXO1 and interleukin-27 J Immunother Cancer 2022 10.1136/jitc-2021-003539 35091454 PMC8804695 Wang R, et al. Intermediate monocytes induced by IFN-γ inhibit cancer metastasis by promoting NK cell activation through FOXO1 and interleukin-27. J Immunother Cancer. 2022. 10.1136/jitc-2021-003539. 35091454 10.1136/jitc-2021-003539 PMC8804695 420. Hayashi Y IL36G-producing neutrophil-like monocytes promote cachexia in cancer Nat Commun 2024 15 7662 10.1038/s41467-024-51873-x 39266531 PMC11393454 Hayashi Y, et al. IL36G-producing neutrophil-like monocytes promote cachexia in cancer. Nat Commun. 2024;15:7662. 10.1038/s41467-024-51873-x. 39266531 10.1038/s41467-024-51873-x PMC11393454 421. Robinson A Han CZ Glass CK Pollard JW Monocyte regulation in homeostasis and malignancy Trends Immunol 2021 42 104 19 10.1016/j.it.2020.12.001 33446416 PMC7877795 Robinson A, Han CZ, Glass CK, Pollard JW. Monocyte regulation in homeostasis and malignancy. Trends Immunol. 2021;42:104–19. 10.1016/j.it.2020.12.001. 33446416 10.1016/j.it.2020.12.001 PMC7877795 422. Borcherding N Mapping the immune environment in clear cell renal carcinoma by single-cell genomics Communications biology 2021 4 122 10.1038/s42003-020-01625-6 33504936 PMC7840906 Borcherding N, et al. Mapping the immune environment in clear cell renal carcinoma by single-cell genomics. Communications biology. 2021;4:122. 10.1038/s42003-020-01625-6. 33504936 10.1038/s42003-020-01625-6 PMC7840906 423. Silina K B cell-rich niches support stem-like CD8(+) T cells in cancer microenvironment Cancer Cell 2023 41 824 825 10.1016/j.ccell.2023.04.007 37160101 Silina K. B cell-rich niches support stem-like CD8(+) T cells in cancer microenvironment. Cancer Cell. 2023;41:824–5. 10.1016/j.ccell.2023.04.007. 37160101 10.1016/j.ccell.2023.04.007 424. Hollern D Memory B cell fitness and anergy has significant links to cancer lethality Cell 2024 187 4551 4553 10.1016/j.cell.2024.07.037 39178833 Hollern D. Memory B cell fitness and anergy has significant links to cancer lethality. Cell. 2024;187:4551–3. 10.1016/j.cell.2024.07.037. 39178833 10.1016/j.cell.2024.07.037 425. Liu Y Zhou X Wang X Targeting the tumor microenvironment in B-cell lymphoma: challenges and opportunities J Hematol Oncol 2021 14 125 10.1186/s13045-021-01134-x 34404434 PMC8369706 Liu Y, Zhou X, Wang X. Targeting the tumor microenvironment in B-cell lymphoma: challenges and opportunities. J Hematol Oncol. 2021;14:125. 10.1186/s13045-021-01134-x. 34404434 10.1186/s13045-021-01134-x PMC8369706 426. Laumont CM Banville AC Gilardi M Hollern DP Nelson BH Tumour-infiltrating B cells: immunological mechanisms, clinical impact and therapeutic opportunities Nat Rev Cancer 2022 22 414 430 10.1038/s41568-022-00466-1 35393541 PMC9678336 Laumont CM, Banville AC, Gilardi M, Hollern DP, Nelson BH. Tumour-infiltrating B cells: immunological mechanisms, clinical impact and therapeutic opportunities. Nat Rev Cancer. 2022;22:414–30. 10.1038/s41568-022-00466-1. 35393541 10.1038/s41568-022-00466-1 PMC9678336 427. Machado HE Diverse mutational landscapes in human lymphocytes Nature 2022 608 724 732 10.1038/s41586-022-05072-7 35948631 PMC9402440 Machado HE, et al. Diverse mutational landscapes in human lymphocytes. Nature. 2022;608:724–32. 10.1038/s41586-022-05072-7. 35948631 10.1038/s41586-022-05072-7 PMC9402440 428. Tellier J Nutt SL B cell trajectories influence cancer outcomes Science. 2024 384 510 511 10.1126/science.adp1865 38696586 Tellier J, Nutt SL. B cell trajectories influence cancer outcomes. Science. 2024;384:510–1. 10.1126/science.adp1865. 38696586 10.1126/science.adp1865 429. Fitzsimons E A pan-cancer single-cell RNA-seq atlas of intratumoral B cells Cancer Cell 2024 42 1784 1797.e1784 10.1016/j.ccell.2024.09.011 39406187 Fitzsimons E, et al. A pan-cancer single-cell RNA-seq atlas of intratumoral B cells. Cancer Cell. 2024;42:1784-1797.e1784. 10.1016/j.ccell.2024.09.011. 39406187 10.1016/j.ccell.2024.09.011 430. Yang Y Pan-cancer single-cell dissection reveals phenotypically distinct B cell subtypes Cell 2024 187 4790 4811.e4722 10.1016/j.cell.2024.06.038 39047727 Yang Y, et al. Pan-cancer single-cell dissection reveals phenotypically distinct B cell subtypes. Cell. 2024;187:4790-4811.e4722. 10.1016/j.cell.2024.06.038. 39047727 10.1016/j.cell.2024.06.038 431. Chen WJ Preoperative neoadjuvant targeted therapy remodels intra-tumoral heterogeneity of clear-cell renal cell carcinoma and ferroptosis inhibition induces resistance progression Cancer Lett 2024 593 216963 10.1016/j.canlet.2024.216963 38768682 Chen WJ, et al. Preoperative neoadjuvant targeted therapy remodels intra-tumoral heterogeneity of clear-cell renal cell carcinoma and ferroptosis inhibition induces resistance progression. Cancer Lett. 2024;593: 216963. 10.1016/j.canlet.2024.216963. 38768682 10.1016/j.canlet.2024.216963 432. Shi S Ye L Yu X Jin K Wu W Focus on mast cells in the tumor microenvironment: current knowledge and future directions Biochimica et Biophysica Acta (BBA) 2023 1878 188845 10.1016/j.bbcan.2022.188845 36476563 Shi S, Ye L, Yu X, Jin K, Wu W. Focus on mast cells in the tumor microenvironment: current knowledge and future directions. Biochimica et Biophysica Acta (BBA). 2023;1878: 188845. 10.1016/j.bbcan.2022.188845. 10.1016/j.bbcan.2022.188845 36476563 433. Marichal T Tsai M Galli SJ Mast cells: potential positive and negative roles in tumor biology Cancer Immunol Res 2013 1 269 279 10.1158/2326-6066.Cir-13-0119 24777963 Marichal T, Tsai M, Galli SJ. Mast cells: potential positive and negative roles in tumor biology. Cancer Immunol Res. 2013;1:269–79. 10.1158/2326-6066.Cir-13-0119. 24777963 10.1158/2326-6066.CIR-13-0119 434. Khazaie K The significant role of mast cells in cancer Cancer Metastasis Rev 2011 30 45 60 10.1007/s10555-011-9286-z 21287360 Khazaie K, et al. The significant role of mast cells in cancer. Cancer Metastasis Rev. 2011;30:45–60. 10.1007/s10555-011-9286-z. 21287360 10.1007/s10555-011-9286-z 435. Majorini MT Colombo MP Lecis D Few, but Efficient: The Role of Mast Cells in Breast Cancer and Other Solid Tumors Can Res 2022 82 1439 1447 10.1158/0008-5472.Can-21-3424 PMC9306341 35045983 Majorini MT, Colombo MP, Lecis D. Few, but Efficient: The Role of Mast Cells in Breast Cancer and Other Solid Tumors. Can Res. 2022;82:1439–47. 10.1158/0008-5472.Can-21-3424. 10.1158/0008-5472.CAN-21-3424 PMC9306341 35045983 436. Komi DEA Redegeld FA Role of mast cells in shaping the tumor microenvironment Clin Rev Allergy Immunol 2020 58 313 25 10.1007/s12016-019-08753-w 31256327 PMC7244463 Komi DEA, Redegeld FA. Role of mast cells in shaping the tumor microenvironment. Clin Rev Allergy Immunol. 2020;58:313–25. 10.1007/s12016-019-08753-w. 31256327 10.1007/s12016-019-08753-w PMC7244463 437. Cheng S A pan-cancer single-cell transcriptional atlas of tumor infiltrating myeloid cells Cell 2021 184 792 809.e723 10.1016/j.cell.2021.01.010 33545035 Cheng S, et al. A pan-cancer single-cell transcriptional atlas of tumor infiltrating myeloid cells. Cell. 2021;184:792-809.e723. 10.1016/j.cell.2021.01.010. 33545035 10.1016/j.cell.2021.01.010 438. Young MD Single cell derived mRNA signals across human kidney tumors Nat Commun 2021 12 3896 10.1038/s41467-021-23949-5 34162837 PMC8222373 Young MD, et al. Single cell derived mRNA signals across human kidney tumors. Nat Commun. 2021;12:3896. 10.1038/s41467-021-23949-5. 34162837 10.1038/s41467-021-23949-5 PMC8222373 439. He XY Chronic stress increases metastasis via neutrophil-mediated changes to the microenvironment Cancer Cell 2024 42 474 486.e412 10.1016/j.ccell.2024.01.013 38402610 PMC11300849 He XY, et al. Chronic stress increases metastasis via neutrophil-mediated changes to the microenvironment. Cancer Cell. 2024;42:474-486.e412. 10.1016/j.ccell.2024.01.013. 38402610 10.1016/j.ccell.2024.01.013 PMC11300849 440. Ager A Cancer immunotherapy: T cells and neutrophils working together to attack cancers Cell 2023 186 1304 1306 10.1016/j.cell.2023.03.005 37001496 Ager A. Cancer immunotherapy: T cells and neutrophils working together to attack cancers. Cell. 2023;186:1304–6. 10.1016/j.cell.2023.03.005. 37001496 10.1016/j.cell.2023.03.005 441. Xiong S Dong L Cheng L Neutrophils in cancer carcinogenesis and metastasis J Hematol Oncol 2021 14 173 10.1186/s13045-021-01187-y 34674757 PMC8529570 Xiong S, Dong L, Cheng L. Neutrophils in cancer carcinogenesis and metastasis. J Hematol Oncol. 2021;14: 173. 10.1186/s13045-021-01187-y. 34674757 10.1186/s13045-021-01187-y PMC8529570 442. Huang X Neutrophils in Cancer immunotherapy: friends or foes? Mol Cancer 2024 23 107 10.1186/s12943-024-02004-z 38760815 PMC11102125 Huang X, et al. Neutrophils in Cancer immunotherapy: friends or foes? Mol Cancer. 2024;23:107. 10.1186/s12943-024-02004-z. 38760815 10.1186/s12943-024-02004-z PMC11102125 443. Jaillon S Neutrophil diversity and plasticity in tumour progression and therapy Nat Rev Cancer 2020 20 485 503 10.1038/s41568-020-0281-y 32694624 Jaillon S, et al. Neutrophil diversity and plasticity in tumour progression and therapy. Nat Rev Cancer. 2020;20:485–503. 10.1038/s41568-020-0281-y. 32694624 10.1038/s41568-020-0281-y 444. Hedrick CC Malanchi I Neutrophils in cancer: heterogeneous and multifaceted Nat Rev Immunol 2022 22 173 187 10.1038/s41577-021-00571-6 34230649 Hedrick CC, Malanchi I. Neutrophils in cancer: heterogeneous and multifaceted. Nat Rev Immunol. 2022;22:173–87. 10.1038/s41577-021-00571-6. 34230649 10.1038/s41577-021-00571-6 445. Xue R Liver tumour immune microenvironment subtypes and neutrophil heterogeneity Nature 2022 612 141 147 10.1038/s41586-022-05400-x 36352227 Xue R, et al. Liver tumour immune microenvironment subtypes and neutrophil heterogeneity. Nature. 2022;612:141–7. 10.1038/s41586-022-05400-x. 36352227 10.1038/s41586-022-05400-x 446. Wu Y Neutrophil profiling illuminates anti-tumor antigen-presenting potency Cell 2024 187 1422 1439.e1424 10.1016/j.cell.2024.02.005 38447573 Wu Y, et al. Neutrophil profiling illuminates anti-tumor antigen-presenting potency. Cell. 2024;187:1422-1439.e1424. 10.1016/j.cell.2024.02.005. 38447573 10.1016/j.cell.2024.02.005 447. Lv S Tao L Liao H Huang Z Lu Y Comprehensive analysis of single-cell RNA-seq and bulk RNA-seq revealed the heterogeneity and convergence of the immune microenvironment in renal cell carcinoma Funct Integr Genomics 2023 23 193 10.1007/s10142-023-01113-0 37264263 Lv S, Tao L, Liao H, Huang Z, Lu Y. Comprehensive analysis of single-cell RNA-seq and bulk RNA-seq revealed the heterogeneity and convergence of the immune microenvironment in renal cell carcinoma. Funct Integr Genomics. 2023;23:193. 10.1007/s10142-023-01113-0. 37264263 10.1007/s10142-023-01113-0 448. Pan X Tumour vasculature at single-cell resolution Nature 2024 632 429 436 10.1038/s41586-024-07698-1 38987599 Pan X, et al. Tumour vasculature at single-cell resolution. Nature. 2024;632:429–36. 10.1038/s41586-024-07698-1. 38987599 10.1038/s41586-024-07698-1 449. de Visser KE Joyce JA The evolving tumor microenvironment: From cancer initiation to metastatic outgrowth Cancer Cell 2023 41 374 403 10.1016/j.ccell.2023.02.016 36917948 de Visser KE, Joyce JA. The evolving tumor microenvironment: From cancer initiation to metastatic outgrowth. Cancer Cell. 2023;41:374–403. 10.1016/j.ccell.2023.02.016. 36917948 10.1016/j.ccell.2023.02.016 450. Rohlenova K Single-Cell RNA Sequencing Maps Endothelial Metabolic Plasticity in Pathological Angiogenesis Cell Metab 2020 31 862 877.e814 10.1016/j.cmet.2020.03.009 32268117 Rohlenova K, et al. Single-Cell RNA Sequencing Maps Endothelial Metabolic Plasticity in Pathological Angiogenesis. Cell Metab. 2020;31:862-877.e814. 10.1016/j.cmet.2020.03.009. 32268117 10.1016/j.cmet.2020.03.009 451. Zeng Q Understanding tumour endothelial cell heterogeneity and function from single-cell omics Nat Rev Cancer 2023 23 544 564 10.1038/s41568-023-00591-5 37349410 Zeng Q, et al. Understanding tumour endothelial cell heterogeneity and function from single-cell omics. Nat Rev Cancer. 2023;23:544–64. 10.1038/s41568-023-00591-5. 37349410 10.1038/s41568-023-00591-5 452. Strilic B Tumour-cell-induced endothelial cell necroptosis via death receptor 6 promotes metastasis Nature 2016 536 215 218 10.1038/nature19076 27487218 Strilic B, et al. Tumour-cell-induced endothelial cell necroptosis via death receptor 6 promotes metastasis. Nature. 2016;536:215–8. 10.1038/nature19076. 27487218 10.1038/nature19076 453. Li J Pan-cancer integrative analyses dissect the remodeling of endothelial cells in human cancers Natl Sci Rev 2024 11 nwae231 10.1093/nsr/nwae231 39345334 PMC11429526 Li J, et al. Pan-cancer integrative analyses dissect the remodeling of endothelial cells in human cancers. Natl Sci Rev. 2024;11:nwae231. 10.1093/nsr/nwae231. 39345334 10.1093/nsr/nwae231 PMC11429526 454. Su C Single-cell RNA sequencing in multiple pathologic types of renal cell carcinoma revealed novel potential tumor-specific markers Front Oncol 2021 11 719564 10.3389/fonc.2021.719564 34722263 PMC8551404 Su C, et al. Single-cell RNA sequencing in multiple pathologic types of renal cell carcinoma revealed novel potential tumor-specific markers. Front Oncol. 2021;11: 719564. 10.3389/fonc.2021.719564. 34722263 10.3389/fonc.2021.719564 PMC8551404 455. Du Y Integration of Pan-Cancer Single-Cell and Spatial Transcriptomics Reveals Stromal Cell Features and Therapeutic Targets in Tumor Microenvironment Can Res 2024 84 192 210 10.1158/0008-5472.Can-23-1418 38225927 Du Y, et al. Integration of Pan-Cancer Single-Cell and Spatial Transcriptomics Reveals Stromal Cell Features and Therapeutic Targets in Tumor Microenvironment. Can Res. 2024;84:192–210. 10.1158/0008-5472.Can-23-1418. 10.1158/0008-5472.CAN-23-1418 38225927 456. Park D Sahai E Rullan A SnapShot: Cancer-Associated Fibroblasts Cell 2020 181 486 486.e481 10.1016/j.cell.2020.03.013 32302576 Park D, Sahai E, Rullan A. SnapShot: Cancer-Associated Fibroblasts. Cell. 2020;181:486-486.e481. 10.1016/j.cell.2020.03.013. 32302576 10.1016/j.cell.2020.03.013 457. Cords L Cancer-associated fibroblast phenotypes are associated with patient outcome in non-small cell lung cancer Cancer Cell 2024 42 396 412.e395 10.1016/j.ccell.2023.12.021 38242124 PMC10929690 Cords L, et al. Cancer-associated fibroblast phenotypes are associated with patient outcome in non-small cell lung cancer. Cancer Cell. 2024;42:396-412.e395. 10.1016/j.ccell.2023.12.021. 38242124 10.1016/j.ccell.2023.12.021 PMC10929690 458. Hasan S Buechler MB What’s in a name? An emerging framework for cancer-associated fibroblasts, myofibroblasts, and fibroblasts Cancer Cell 2022 40 1273 5 10.1016/j.ccell.2022.10.018 36379205 Hasan S, Buechler MB. What’s in a name? An emerging framework for cancer-associated fibroblasts, myofibroblasts, and fibroblasts. Cancer Cell. 2022;40:1273–5. 10.1016/j.ccell.2022.10.018. 36379205 10.1016/j.ccell.2022.10.018 459. Zhang H Define cancer-associated fibroblasts (CAFs) in the tumor microenvironment: new opportunities in cancer immunotherapy and advances in clinical trials Mol Cancer 2023 22 159 10.1186/s12943-023-01860-5 37784082 PMC10544417 Zhang H, et al. Define cancer-associated fibroblasts (CAFs) in the tumor microenvironment: new opportunities in cancer immunotherapy and advances in clinical trials. Mol Cancer. 2023;22:159. 10.1186/s12943-023-01860-5. 37784082 10.1186/s12943-023-01860-5 PMC10544417 460. Kalluri R Zeisberg M Fibroblasts in cancer Nat Rev Cancer 2006 6 392 401 10.1038/nrc1877 16572188 Kalluri R, Zeisberg M. Fibroblasts in cancer. Nat Rev Cancer. 2006;6:392–401. 10.1038/nrc1877. 16572188 10.1038/nrc1877 461. Chen Y McAndrews KM Kalluri R Clinical and therapeutic relevance of cancer-associated fibroblasts Nat Rev Clin Oncol 2021 18 792 804 10.1038/s41571-021-00546-5 34489603 PMC8791784 Chen Y, McAndrews KM, Kalluri R. Clinical and therapeutic relevance of cancer-associated fibroblasts. Nat Rev Clin Oncol. 2021;18:792–804. 10.1038/s41571-021-00546-5. 34489603 10.1038/s41571-021-00546-5 PMC8791784 462. Biffi G Tuveson DA Diversity and Biology of Cancer-Associated Fibroblasts Physiol Rev 2021 101 147 176 10.1152/physrev.00048.2019 32466724 PMC7864232 Biffi G, Tuveson DA. Diversity and Biology of Cancer-Associated Fibroblasts. Physiol Rev. 2021;101:147–76. 10.1152/physrev.00048.2019. 32466724 10.1152/physrev.00048.2019 PMC7864232 463. Costa A Fibroblast Heterogeneity and Immunosuppressive Environment in Human Breast Cancer Cancer Cell 2018 33 463 479.e410 10.1016/j.ccell.2018.01.011 29455927 Costa A, et al. Fibroblast Heterogeneity and Immunosuppressive Environment in Human Breast Cancer. Cancer Cell. 2018;33:463-479.e410. 10.1016/j.ccell.2018.01.011. 29455927 10.1016/j.ccell.2018.01.011 464. McAndrews KM Identification of functional heterogeneity of carcinoma-associated fibroblasts with distinct IL6-mediated therapy resistance in pancreatic cancer Cancer Discov 2022 12 1580 97 10.1158/2159-8290.Cd-20-1484 35348629 PMC9399904 McAndrews KM, et al. Identification of functional heterogeneity of carcinoma-associated fibroblasts with distinct IL6-mediated therapy resistance in pancreatic cancer. Cancer Discov. 2022;12:1580–97. 10.1158/2159-8290.Cd-20-1484. 35348629 10.1158/2159-8290.CD-20-1484 PMC9399904 465. Chhabra Y Weeraratna AT Fibroblasts in cancer: unity in heterogeneity Cell 2023 186 1580 609 10.1016/j.cell.2023.03.016 37059066 PMC11422789 Chhabra Y, Weeraratna AT. Fibroblasts in cancer: unity in heterogeneity. Cell. 2023;186:1580–609. 10.1016/j.cell.2023.03.016. 37059066 10.1016/j.cell.2023.03.016 PMC11422789 466. Yin Z Heterogeneity of cancer-associated fibroblasts and roles in the progression, prognosis, and therapy of hepatocellular carcinoma J Hematol Oncol 2019 12 101 10.1186/s13045-019-0782-x 31547836 PMC6757399 Yin Z, et al. Heterogeneity of cancer-associated fibroblasts and roles in the progression, prognosis, and therapy of hepatocellular carcinoma. J Hematol Oncol. 2019;12:101. 10.1186/s13045-019-0782-x. 31547836 10.1186/s13045-019-0782-x PMC6757399 467. Wang J Single-cell transcriptome analysis revealing the intratumoral heterogeneity of ccRCC and validation of MT2A in pathogenesis Funct Integr Genomics 2023 23 300 10.1007/s10142-023-01225-7 37713131 Wang J, et al. Single-cell transcriptome analysis revealing the intratumoral heterogeneity of ccRCC and validation of MT2A in pathogenesis. Funct Integr Genomics. 2023;23:300. 10.1007/s10142-023-01225-7. 37713131 10.1007/s10142-023-01225-7 468. Chen H Yang W Ma L Li Y Ji Z Machine-learning based integrating bulk and single-cell RNA sequencing reveals the SLC38A5-CCL5 signaling as a promising target for clear cell renal cell carcinoma treatment Transl Oncol 2023 38 101790 10.1016/j.tranon.2023.101790 37722291 PMC10518726 Chen H, Yang W, Ma L, Li Y, Ji Z. Machine-learning based integrating bulk and single-cell RNA sequencing reveals the SLC38A5-CCL5 signaling as a promising target for clear cell renal cell carcinoma treatment. Transl Oncol. 2023;38: 101790. 10.1016/j.tranon.2023.101790. 37722291 10.1016/j.tranon.2023.101790 PMC10518726 469. Peng YL, et al. Single-cell transcriptomics reveals a low CD8(+) T cell infiltrating state mediated by fibroblasts in recurrent renal cell carcinoma. J Immunother Cancer. 2022;10. 10.1136/jitc-2021-004206. 10.1136/jitc-2021-004206 PMC8819783 35121646 470. Pan Q CXCL14 Ther Adv Med Oncol 2023 15 17588359231217966 10.1177/17588359231217966 38152696 PMC10752123 Pan Q, et al. CXCL14 38152696 10.1177/17588359231217966 PMC10752123 471. Xu K Decoding ecosystem heterogeneity and transcriptional regulation characteristics of multi-subtype renal cell carcinoma Heliyon 2024 10 e33196 10.1016/j.heliyon.2024.e33196 39044973 PMC11263639 Xu K, et al. Decoding ecosystem heterogeneity and transcriptional regulation characteristics of multi-subtype renal cell carcinoma. Heliyon. 2024;10: e33196. 10.1016/j.heliyon.2024.e33196. 39044973 10.1016/j.heliyon.2024.e33196 PMC11263639 472. Calandrini C An organoid biobank for childhood kidney cancers that captures disease and tissue heterogeneity Nat Commun 2020 11 1310 10.1038/s41467-020-15155-6 32161258 PMC7066173 Calandrini C, et al. An organoid biobank for childhood kidney cancers that captures disease and tissue heterogeneity. Nat Commun. 2020;11:1310. 10.1038/s41467-020-15155-6. 32161258 10.1038/s41467-020-15155-6 PMC7066173 473. Simonavicius N Pericytes promote selective vessel regression to regulate vascular patterning Blood 2012 120 1516 1527 10.1182/blood-2011-01-332338 22740442 Simonavicius N, et al. Pericytes promote selective vessel regression to regulate vascular patterning. Blood. 2012;120:1516–27. 10.1182/blood-2011-01-332338. 22740442 10.1182/blood-2011-01-332338 474. Avolio E Campagnolo P Katare R Madeddu P The role of cardiac pericytes in health and disease: therapeutic targets for myocardial infarction Nat Rev Cardiol 2024 21 106 118 10.1038/s41569-023-00913-y 37542118 Avolio E, Campagnolo P, Katare R, Madeddu P. The role of cardiac pericytes in health and disease: therapeutic targets for myocardial infarction. Nat Rev Cardiol. 2024;21:106–18. 10.1038/s41569-023-00913-y. 37542118 10.1038/s41569-023-00913-y 475. Shaw I Rider S Mullins J Hughes J Péault B Pericytes in the renal vasculature: roles in health and disease Nat Rev Nephrol 2018 14 521 534 10.1038/s41581-018-0032-4 29942044 Shaw I, Rider S, Mullins J, Hughes J, Péault B. Pericytes in the renal vasculature: roles in health and disease. Nat Rev Nephrol. 2018;14:521–34. 10.1038/s41581-018-0032-4. 29942044 10.1038/s41581-018-0032-4 476. Vanlandewijck M A molecular atlas of cell types and zonation in the brain vasculature Nature 2018 554 475 480 10.1038/nature25739 29443965 Vanlandewijck M, et al. A molecular atlas of cell types and zonation in the brain vasculature. Nature. 2018;554:475–80. 10.1038/nature25739. 29443965 10.1038/nature25739 477. Bergers G Song S The role of pericytes in blood-vessel formation and maintenance Neuro Oncol 2005 7 452 464 10.1215/s1152851705000232 16212810 PMC1871727 Bergers G, Song S. The role of pericytes in blood-vessel formation and maintenance. Neuro Oncol. 2005;7:452–64. 10.1215/s1152851705000232. 16212810 10.1215/S1152851705000232 PMC1871727 478. Hong CL CD248 Regulates Wnt Signaling in Pericytes to Promote Angiogenesis and Tumor Growth in Lung Cancer Can Res 2022 82 3734 3750 10.1158/0008-5472.Can-22-1695 35950912 Hong CL, et al. CD248 Regulates Wnt Signaling in Pericytes to Promote Angiogenesis and Tumor Growth in Lung Cancer. Can Res. 2022;82:3734–50. 10.1158/0008-5472.Can-22-1695. 10.1158/0008-5472.CAN-22-1695 35950912 479. Zhang C Methionine secreted by tumor-associated pericytes supports cancer stem cells in clear cell renal carcinoma Cell Metab 2024 36 778 792.e710 10.1016/j.cmet.2024.01.018 38378000 Zhang C, et al. Methionine secreted by tumor-associated pericytes supports cancer stem cells in clear cell renal carcinoma. Cell Metab. 2024;36:778-792.e710. 10.1016/j.cmet.2024.01.018. 38378000 10.1016/j.cmet.2024.01.018 480. Li X Novel TCF21(high) pericyte subpopulation promotes colorectal cancer metastasis by remodelling perivascular matrix Gut 2023 72 710 21 10.1136/gutjnl-2022-327913 36805487 PMC10086488 Li X, et al. Novel TCF21(high) pericyte subpopulation promotes colorectal cancer metastasis by remodelling perivascular matrix. Gut. 2023;72:710–21. 10.1136/gutjnl-2022-327913. 36805487 10.1136/gutjnl-2022-327913 PMC10086488 481. De Palma M Biziato D Petrova TV Microenvironmental regulation of tumour angiogenesis Nat Rev Cancer 2017 17 457 74 10.1038/nrc.2017.51 28706266 De Palma M, Biziato D, Petrova TV. Microenvironmental regulation of tumour angiogenesis. Nat Rev Cancer. 2017;17:457–74. 10.1038/nrc.2017.51. 28706266 10.1038/nrc.2017.51 482. van Splunder H Villacampa P Martínez-Romero A Graupera M Pericytes in the disease spotlight Trends Cell Biol 2024 34 58 71 10.1016/j.tcb.2023.06.001 37474376 PMC10777571 van Splunder H, Villacampa P, Martínez-Romero A, Graupera M. Pericytes in the disease spotlight. Trends Cell Biol. 2024;34:58–71. 10.1016/j.tcb.2023.06.001. 37474376 10.1016/j.tcb.2023.06.001 PMC10777571 483. Zhang J Single-cell analysis of multiple cancer types reveals differences in endothelial cells between tumors and normal tissues Comput Struct Biotechnol J 2023 21 665 676 10.1016/j.csbj.2022.12.049 36659929 PMC9826920 Zhang J, et al. Single-cell analysis of multiple cancer types reveals differences in endothelial cells between tumors and normal tissues. Comput Struct Biotechnol J. 2023;21:665–76. 10.1016/j.csbj.2022.12.049. 36659929 10.1016/j.csbj.2022.12.049 PMC9826920 484. Avraham S Korin B Chung JJ Oxburgh L Shaw AS The mesangial cell - the glomerular stromal cell Nat Rev Nephrol 2021 17 855 864 10.1038/s41581-021-00474-8 34508249 Avraham S, Korin B, Chung JJ, Oxburgh L, Shaw AS. The mesangial cell - the glomerular stromal cell. Nat Rev Nephrol. 2021;17:855–64. 10.1038/s41581-021-00474-8. 34508249 10.1038/s41581-021-00474-8 485. Liu S Zhao Y Zhao Y Tang X The prognostic value of miR-487a in clear cell renal cell carcinoma and its influence on cell biological behavior Arch Esp Urol 2022 75 346 353 10.56434/j.arch.esp.urol.20227504.49 35818915 Liu S, Zhao Y, Zhao Y, Tang X. The prognostic value of miR-487a in clear cell renal cell carcinoma and its influence on cell biological behavior. Arch Esp Urol. 2022;75:346–53. 10.56434/j.arch.esp.urol.20227504.49. 35818915 10.56434/j.arch.esp.urol.20227504.49 486. Au L Determinants of anti-PD-1 response and resistance in clear cell renal cell carcinoma Cancer Cell 2021 39 1497 1518 10.1016/j.ccell.2021.10.001 34715028 PMC8599450 Au L, et al. Determinants of anti-PD-1 response and resistance in clear cell renal cell carcinoma. Cancer Cell. 2021;39:1497–518. 10.1016/j.ccell.2021.10.001. e1411. 34715028 10.1016/j.ccell.2021.10.001 PMC8599450 487. Krishna C Single-cell sequencing links multiregional immune landscapes and tissue-resident T cells in ccRCC to tumor topology and therapy efficacy Cancer Cell 2021 39 662 677 10.1016/j.ccell.2021.03.007 33861994 PMC8268947 Krishna C, et al. Single-cell sequencing links multiregional immune landscapes and tissue-resident T cells in ccRCC to tumor topology and therapy efficacy. Cancer Cell. 2021;39:662–77. 10.1016/j.ccell.2021.03.007. e666. 33861994 10.1016/j.ccell.2021.03.007 PMC8268947 488. Jiang A Establishment of a Prognostic Prediction and Drug Selection Model for Patients with Clear Cell Renal Cell Carcinoma by Multiomics Data Analysis Oxid Med Cell Longev 2022 2022 3617775 10.1155/2022/3617775 35028006 PMC8752262 Jiang A, et al. Establishment of a Prognostic Prediction and Drug Selection Model for Patients with Clear Cell Renal Cell Carcinoma by Multiomics Data Analysis. Oxid Med Cell Longev. 2022;2022:3617775. 10.1155/2022/3617775. 35028006 10.1155/2022/3617775 PMC8752262 489. Jiang A DCS, a novel classifier system based on disulfidptosis reveals tumor microenvironment heterogeneity and guides frontline therapy for clear cell renal carcinoma J Natl Cancer Center 2024 4 263 279 10.1016/j.jncc.2024.06.003 39281723 PMC11401502 Jiang A, et al. DCS, a novel classifier system based on disulfidptosis reveals tumor microenvironment heterogeneity and guides frontline therapy for clear cell renal carcinoma. J Natl Cancer Center. 2024;4:263–79. 10.1016/j.jncc.2024.06.003. 39281723 10.1016/j.jncc.2024.06.003 PMC11401502 490. Jiang A TDERS, an exosome RNA-derived signature predicts prognosis and immunotherapeutic response in clear cell renal cell cancer: a multicohort study J Natl Cancer Center 2024 4 382 394 10.1016/j.jncc.2024.07.002 39735439 PMC11674438 Jiang A, et al. TDERS, an exosome RNA-derived signature predicts prognosis and immunotherapeutic response in clear cell renal cell cancer: a multicohort study. J Natl Cancer Center. 2024;4:382–94. 10.1016/j.jncc.2024.07.002. 39735439 10.1016/j.jncc.2024.07.002 PMC11674438 ",
  "metadata": {
    "Title of this paper": "TDERS, an exosome RNA-derived signature predicts prognosis and immunotherapeutic response in clear cell renal cell cancer: a multicohort study",
    "Journal it was published in:": "Biomarker Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486790/"
  }
}