{
  "title": "Paper_433",
  "abstract": "pmc J Dent Sci J Dent Sci 3597 jds Journal of Dental Sciences 1991-7902 2213-8862 Association for Dental Sciences of the Republic of China PMC12485403 PMC12485403.1 12485403 12485403 41040571 10.1016/j.jds.2025.06.003 S1991-7902(25)00187-4 1 Original Article miR-376a/Neuropilin-1 axis mediates the cancer stemness in oral squamous cell carcinoma-an in vitro study Liao Yi-Wen a b † Yu Cheng-Chia b c † Liao Heng-Yi d Chang Yu-Chao cyc@csmu.edu.tw c d ⁎ a b c d ⁎ cyc@csmu.edu.tw † These two authors contributed equally to this study. 10 2025 20 6 2025 20 4 498055 2238 2244 30 5 2025 5 6 2025 20 06 2025 02 10 2025 03 10 2025 © 2025 Association for Dental Sciences of the Republic of China. Publishing services by Elsevier B.Vé. 2025 Association for Dental Sciences of the Republic of China https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Background/purpose The incidence of oral cancer has been steadily increased over the years. Recent researches indicated that exploring oral cancer stem cells (CSCs) characterized by self-renewal, pluripotency, and aggressiveness have emerged as a promising strategy for predicting oral squamous cell carcinoma (OSCC) recurrence and metastasis. Previous studies have demonstrated that microRNAs regulate cancer stemness. However, the mechanisms that miR-376a/neuropilin-1 (NRP1) axis influences CSC traits have not yet been fully understood. Therefore, an in-depth investigation was conducted in this study. Materials and methods miR-376a expression in CSCs derived from OSCC cell line SAS was quantified by quantitative real-time polymerase chain reaction. Aldehyde dehydrogenase 1 (ALDH1) activity and CD44 expression were assessed via flow cytometry. The CSC phenotype was characterized through self-renewal, migration, and colony formation assays. A luciferase reporter assay was used to confirm the direct interaction between miR-376a and NRP1. Results We found that miR-376a expression was downregulated in SAS-CSCs. Overexpression of miR-376a significantly reduced several CSC phenotypes including ALDH1 activity, CD44 expression, migration, and colony-forming abilities, respectively ( P P P Conclusion Within the limitations of our findings, miR-376a/NRP1 axis may play a crucial role in stemness of OSCC. Targeting this pathway could represent a promising strategy to inhibit OSCC progression. Keywords Oral squamous cell carcinoma Cancer stem cells microRNA-376a Neuropilin-1 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction According to global cancer statistics, oral cancer ranks as the sixth most common cancer worldwide. 1 2 2 3 4 5 6 CSCs are a subpopulation of tumor cells that exist in low proportions within tumor tissue, typically comprising only 0.01–2 % of total tumor mass. 7 8 9 + 10 11 An increasing number of studies have revealed that non-coding RNAs possess the ability to regulate various physiological functions and even cancer stemness. 12 , 13 14 15 16 17 Situated on human chromosome 14q32, miR-376a has been implicated in multiple cancer-related processes. It has been shown that dysregulation of miR-376a affects proliferation, aggressiveness, and apoptosis in various types of cancer such as glioblastoma, 18 19 20 21 22 19 23 24 25 26 These studies suggest that miR-376a may serve a key function in the modulation of cancer stemness. However, the significance of miR-376a in oral CSCs has not yet been investigated. Herein, the aims of this in vitro study was to explore the functional role of miR-376a in regulating the stemness in OSCC and its putative target involved in this process. Materials and methods OSCC cell culture The OSCC cell line SAS was cultured following the established protocols. 27 + + 28 Sphere formation assay Cells were dissociated and cultured as tumor spheres in modified DMEM/F-12 supplemented with N2 (R&D Systems, Minneapolis, MN, USA), 10 ng/mL epidermal growth factor (Invitrogen Life Technologies, Carlsbad, CA, USA), 10 ng/mL basic fibroblast growth factor (Invitrogen Life Technologies), and penicillin/streptomycin. A density of 10 3 28 Quantitative real-time PCR (qRT-PCR Total RNA was prepared from cells using Trizol reagent according to the manufacturer's protocol (Invitrogen Life Technologies). mRNAs were reverse-transcribed using the Superscript III first-strand synthesis system for RT-PCR (Invitrogen Life Technologies). qRT-PCR reactions on the resulting cDNAs were performed on an ABI StepOne™ Real-Time PCR System (Applied Biosystems, Waltham, MA, USA) according to our previous study. 28 Western blot analysis The Western blot analysis was executed as per the previously described protocols. 29 Reporter construction and assay The NRP1 3′UTR sequence was inserted into the pMIR-REPORT vector to create a wild-type reporter (WT). Briefly, a mutant reporter (MUT) was generated by altering the miR-376a binding site within the WT construct. Reporter activity was determined by measuring firefly luciferase activity normalized to transfection efficiency. 30 Transwell migration assay 1x10 5 30 Colony-formation assay Six-well plates were prepared with a 0.6 % agar bottom layer and a 0.3 % agar top layer containing 2 x 10 4 31 Statistical analysis All data are expressed as the mean ± standard deviation (SD) of triplicate analyses. Student's t-test and One way ANOVA were employed to assess the statistical significance of differences between groups. P Results To assess whether miR-376a was aberrantly expressed in OSCC cell line SAS, we initiated this study by isolating ALDH1 + + + Fig. 1 + Fig. 1 + + Fig. 2 Figure 1 miR-376a is downregulated in oral cancer stem cells derived from SAS cell line. Results from quantitative real-time polymerase chain reaction showed that miR-376a was downregulated in (A) ALDH1 + + P - - Figure 1 Figure 2 Overexpression of miR-376a inhibits ALDH1 activity and relative CD44 + + P Figure 2 In an effort to examine this hypothesis, we analyzed several CSC characteristics in addition to stemness marker expression. Given that CSCs often exhibit a more malignant phenotype, we assessed the migratory capacity following miR-376a overexpression. The results showed the increased miR-376a expression resulted in approximately 60 % reduction in cell migration as compared with the control ( Fig. 3 Fig. 3 Figure 3 Upregulation of miR-376a has an inhibitory effect on cancer stem cells' phenotypes. Ectopic expression of miR-376a in SAS cancer stem cells mitigated the (A) transwell migration (B) and colony-forming abilities. ∗ P Figure 3 Since miRs often regulate target genes by binding to their 3'untranslated regions (3′UTRs) to repress their express, we analyzed the binding sequences of miR-376a and the NRP1 region using bioinformatics databases (miRBase and starBase) and designed luciferase reporter constructs. Fig. 4 Fig. 4 Fig. 4 Figure 4 NRP1 is a direct target of miR-376a. (A) The sequences of wild-type neuropilin-1 (wt-NRP1) and mutant NRP1 (mut-NRP1) 3′UTRs along with the miR-376a binding site were presented. (B) MiR-376a mimics decreased the luciferase activity of wt-NRP1 but not that of mut-NRP1. (C) The expression of NRP1 in SAS cancer stem cells transfected with miR-Scr. or miR-376a mimics. ∗ P Figure 4 Subsequently, we investigated whether NRP1 was implicated in the miR-376a-mediated regulation of cancer stemess. Our data showed that overexpression of NRP1 reversed the inhibitory effect of miR-376a mimics on migration ability ( Fig. 5 Fig. 5 Figure 5 NRP1 overexpression reverses the suppressive effects of miR-376a mimics on cell migration and self-renewal. (A) Transwell migration assay was used to analyze the effects of miR-376a mimics and NRP1 overexpression on cell migration. (B) The self-renewal ability was determined via a secondary sphere formation assay. ∗ P P Figure 5 Discussion miR-376a was first reported in 2005 32 33 18 34 35 36 21 22 19 20 19 24 NRP1 (CD304 or BDCA-4) is a transmembrane glycoprotein that plays a role in a wide range of cellular events, including cell migration, angiogenesis, and axon growth. 37 , 38 39 40 41 42 43 6 44 45 46 47 48 49 Within the limitation of this in vitro study only using a single oral cancer cell line (SAS), our results suggest that miR-376a may function as a tumor suppressor in OSCC by regulating NRP1 and thereby influencing cancer stemness. Developing therapeutic strategies targeting the miR-376a/NRP1 axis may help slow the progression of OSCC. Further in vivo studies are warranted to validate these findings and explore clinical implications. Declaration of competing interest All authors have no conflicts of interest relevant to this article. References 1 Borse V. Konwar A.N. Buragohain P. Oral cancer diagnosis and perspectives in India Sens Int 1 2020 100046 10.1016/j.sintl.2020.100046 PMC7515567 34766046 2 Cheng F.C. Wang L.H. Lin H.P. Chiang C.P. Morbidity and mortality of oral cancer in Taiwan: trends from 2000 to 2021 J Dent Sci 18 2023 1338 1346 37404658 10.1016/j.jds.2023.04.019 PMC10316500 3 Warnakulasuriya S. Living with oral cancer: epidemiology with particular reference to prevalence and life-style changes that influence survival Oral Oncol 46 2010 407 410 20403722 10.1016/j.oraloncology.2010.02.015 4 Hendawy H. Esmail A.D. Zahani A.N. Elmahdi A.H. Ibrahiem A. Clinicopathological correlation of stem cell markers expression in oral squamous cell carcinoma; relation to patientsoutcome J Immunoassay Immunochem 42 2021 571 595 33896397 10.1080/15321819.2021.1911814 5 Chen J. Zhou J. Lu J. Xiong H. Shi X. Gong L. Significance of CD44 expression in head and neck cancer: a systemic review and meta-analysis BMC Cancer 14 2014 1 9 24410905 10.1186/1471-2407-14-15 PMC3893437 6 Venugopal D.C. Caleb C.L. Kirupakaran N.P. Clinicopathological significance of cancer stem cell markers (OCT-3/4 and SOX-2) in oral submucous fibrosis and oral squamous cell carcinoma Biomedicines 11 2023 1040 37189658 10.3390/biomedicines11041040 PMC10136201 7 Iyer A.K. Singh A. Ganta S. Amiji M.M. Role of integrated cancer nanomedicine in overcoming drug resistance Adv Drug Deliv Rev 65 2013 1784 1802 23880506 10.1016/j.addr.2013.07.012 8 Bighetti-Trevisan R.L. Sousa L.O. Castilho R.M. Almeida L.O. Cancer stem cells: powerful targets to improve current anticancer therapeutics Stem Cell Int 2019 2019 9618065 10.1155/2019/9618065 PMC6874936 31781251 9 Baillie R. Tan S.T. Itinteang T. Cancer stem cells in oral cavity squamous cell carcinoma: a review Front Oncol 7 2017 112 28626726 10.3389/fonc.2017.00112 PMC5454033 10 Prince M.E. Sivanandan R. Kaczorowski A. Identification of a subpopulation of cells with cancer stem cell properties in head and neck squamous cell carcinoma Proc Natl Acad Sci U S A 104 2007 973 978 17210912 10.1073/pnas.0610117104 PMC1783424 11 Chen Y.C. Chen Y.W. Hsu H.S. Aldehyde dehydrogenase 1 is a putative marker for cancer stem cells in head and neck squamous cancer Biochem Biophys Res Commun 385 2009 307 313 19450560 10.1016/j.bbrc.2009.05.048 12 Hua F. Shang S. Yang Y.W. TRIB3 interacts with β-catenin and TCF4 to increase stem cell features of colorectal cancer stem cells and tumorigenesis Gastroenterol 156 2019 708 721 10.1053/j.gastro.2018.10.031 30365932 13 Bu J. Zhang Y. Wu S. KK-LC-1 as a therapeutic target to eliminate ALDH+ stem cells in triple negative breast cancer Nat Commun 14 2023 2602 37147285 10.1038/s41467-023-38097-1 PMC10163259 14 Kapranov P. Cheng J. Dike S. RNA maps reveal new RNA classes and a possible function for pervasive transcription Science 316 2007 1484 1488 17510325 10.1126/science.1138341 15 Jaksic Karisik M. Lazarevic M. Mitic D. MicroRNA-21 as a regulator of cancer stem cell properties in oral cancer Cells 14 2025 91 39851519 10.3390/cells14020091 PMC11763652 16 Lu Y.C. Cheng A.J. Lee L.Y. MiR-520b as a novel molecular target for suppressing stemness phenotype of head-neck cancer by inhibiting CD44 Sci Rep 7 2017 2042 28515423 10.1038/s41598-017-02058-8 PMC5435724 17 Yu C.C. Chen Y.W. Chiou G.Y. MicroRNA let-7a represses chemoresistance and tumourigenicity in head and neck cancer via stem-like properties ablation Oral Oncol 47 2011 202 210 21292542 10.1016/j.oraloncology.2010.12.001 18 Choudhury Y. Tay F.C. Lam D.H. Attenuated adenosine-to-inosine editing of microRNA-376a∗ promotes invasiveness of glioblastoma cells J Clin Investig 122 2012 4059 4076 23093778 10.1172/JCI62925 PMC3484441 19 Zehavi L. Avraham R. Barzilai A. Silencing of a large microRNA cluster on human chromosome 14q32 in melanoma: biological effects of mir-376a and mir-376c on insulin growth factor 1 receptor Mol Cancer 11 2012 44 22747855 10.1186/1476-4598-11-44 PMC3444916 20 Zheng Y. Yin L. Chen H. miR-376a suppresses proliferation and induces apoptosis in hepatocellular carcinoma FEBS Lett 586 2012 2396 2403 22684007 10.1016/j.febslet.2012.05.054 21 Nadal E. Zhong J. Lin J. A MicroRNA cluster at 14q32 drives aggressive lung adenocarcinoma Clin Cancer Res 20 2014 3107 3117 24833665 10.1158/1078-0432.CCR-13-3348 22 Formosa A. Markert E.K. Lena A.M. MicroRNAs, miR-154, miR-299-5p, miR-376a, miR-376c, miR-377, miR-381, miR-487b, miR-485-3p, miR-495 and miR-654-3p, mapped to the 14q32.31 locus, regulate proliferation, apoptosis, migration and invasion in metastatic prostate cancer cells Oncogene 33 2014 5173 5182 24166498 10.1038/onc.2013.451 23 Chen W.J. Ho C.C. Chang Y.L. Cancer-associated fibroblasts regulate the plasticity of lung cancer stemness via paracrine signalling Nat Commun 5 2014 3472 24668028 10.1038/ncomms4472 24 Zeng Y. Yang Z. Yang Y. Wang P. LncRNA NUTM2A-AS1 silencing inhibits glioma via miR-376a-3p/YAP1 axis Cell Div 19 2024 17 38730506 10.1186/s13008-024-00122-0 PMC11088135 25 Faraji F. Ramirez S.I. Clubb L.M. YAP-Driven malignant reprogramming of oral epithelial stem cells at single cell resolution Nat Commun 16 2025 498 39779672 10.1038/s41467-024-55660-6 PMC11711616 26 Zhang L. Chen Y. Li C. RNA binding protein PUM2 promotes the stemness of breast cancer cells via competitively binding to neuropilin-1 (NRP-1) mRNA with miR-376a Biomed Pharmacother 114 2019 108772 10.1016/j.biopha.2019.108772 30909144 27 Liao P.H. Chuang F.H. Wang Y.Y. Sprouty 4 expression in human oral squamous cell carcinogenesis J Dent Sci 18 2023 781 790 37021228 10.1016/j.jds.2023.01.016 PMC10068491 28 Lu M.Y. Fang C.Y. Hsieh P.L. Liao Y.W. Tsai L.L. Yu C.C. miR-509 inhibits cancer stemness properties in oral carcinomas via directly targeting PlK1 J Dent Sci 17 2022 653 658 35756764 10.1016/j.jds.2021.09.028 PMC9201550 29 Chen P.Y. Ho D.C.Y. Liao Y.W. Honokiol inhibits arecoline-induced oral fibrogenesis through transforming growth factor-β/Smad2/3 signaling inhibition J Formos Med Assoc 120 2021 1988 1993 33980461 10.1016/j.jfma.2021.04.012 30 Yang H.W. Yu C.C. Hsieh P.L. Arecoline enhances miR-21 to promote buccal mucosal fibroblasts activation J Formos Med Assoc 120 2021 1108 1113 33191095 10.1016/j.jfma.2020.10.019 31 Tsai L.L. Hu F.W. Lee S.S. Yu C.H. Yu C.C. Chang Y.C. Oct4 mediates tumor initiating properties in oral squamous cell carcinomas through the regulation of epithelial-mesenchymal transition PLoS One 9 2014 87207 10.1371/journal.pone.0087207 PMC3903644 24475251 32 Altuvia Y. Landgraf P. Lithwick G. Clustering and conservation patterns of human microRNAs Nucleic Acids Res 33 2005 2697 2706 15891114 10.1093/nar/gki567 PMC1110742 33 Kawahara Y. Zinshteyn B. Sethupathy P. Iizasa H. Hatzigeorgiou A.G. Nishikura K. Redirection of silencing targets by adenosine-to-inosine editing of miRNAs Science 315 2007 1137 1140 17322061 10.1126/science.1138050 PMC2953418 34 Lee E.J. Gusev Y. Jiang J. Expression profiling identifies microRNA signature in pancreatic cancer Int J Cancer 120 2007 1046 1054 17149698 10.1002/ijc.22394 PMC2680248 35 Liu X. Sempere L.F. Ouyang H. MicroRNA-31 functions as an oncogenic microRNA in mouse and human lung cancer cells by repressing specific tumor suppressors J Clin Investig 120 2010 1298 1309 20237410 10.1172/JCI39566 PMC2846041 36 Yang L. Wei Q.M. Zhang X.W. Sheng Q. Yan X.T. MiR-376a promotion of proliferation and metastases in ovarian cancer: potential role as a biomarker Life Sci 173 2017 62 67 27979415 10.1016/j.lfs.2016.12.007 37 Sulpice E. Plouët J. Bergé M. Allanic D. Tobelem G. Merkulova-Rainon T. Neuropilin-1 and neuropilin-2 act as coreceptors, potentiating proangiogenic activity Blood 111 2008 2036 2045 18065694 10.1182/blood-2007-04-084269 38 Telley L. Cadilhac C. Cioni J.M. Dual function of NRP1 in axon guidance and subcellular target recognition in cerebellum Neuron 91 2016 1276 1291 27618676 10.1016/j.neuron.2016.08.015 39 Chaudhary B. Khaled Y.S. Ammori B.J. Elkord E. Neuropilin 1: function and therapeutic potential in cancer Cancer Immunol Immunother 63 2014 81 99 24263240 10.1007/s00262-013-1500-0 PMC11028473 40 Angom R.S. Mondal S.K. Wang F. Ablation of neuropilin-1 improves the therapeutic response in conventional drug-resistant glioblastoma multiforme Oncogene 39 2020 7114 7126 33005016 10.1038/s41388-020-01462-1 41 Hamerlik P. Lathia J.D. Rasmussen R. Autocrine VEGF-VEGFR2-Neuropilin-1 signaling promotes glioma stem-like cell viability and tumor growth J Exp Med 209 2012 507 520 22393126 10.1084/jem.20111424 PMC3302235 42 Grun D. Adhikary G. Eckert R.L. VEGF-A acts via neuropilin-1 to enhance epidermal cancer stem cell survival and formation of aggressive and highly vascularized tumors Oncogene 35 2016 4379 4387 26804163 10.1038/onc.2015.507 PMC4959993 43 Wang L. Zhang L. Zhao L. VEGFA/NRP-1/GAPVD1 axis promotes progression and cancer stemness of triple-negative breast cancer by enhancing tumor cell-macrophage crosstalk Int J Biol Sci 20 2024 446 463 38169627 10.7150/ijbs.86085 PMC10758102 44 Wang Y. Zhang L. Sun X.L. NRP1 contributes to stemness and potentiates radioresistance via WTAP-mediated m6A methylation of Bcl-2 mRNA in breast cancer Apoptosis 28 2023 233 246 36333630 10.1007/s10495-022-01784-3 45 Luo M. Hou L. Li J. VEGF/NRP-1axis promotes progression of breast cancer via enhancement of epithelial-mesenchymal transition and activation of NF-κB and β-catenin Cancer Lett 373 2016 1 11 26805761 10.1016/j.canlet.2016.01.010 46 Wang X. Hu H. Liu H. RNA binding protein Lin28B confers gastric cancer cells stemness via directly binding to NRP-1 Biomed Pharmacother 104 2018 383 389 29787985 10.1016/j.biopha.2018.05.064 47 Chu W. Song X. Yang X. Neuropilin-1 promotes epithelial-to-mesenchymal transition by stimulating nuclear factor-kappa B and is associated with poor prognosis in human oral squamous cell carcinoma PLoS One 9 2014 101931 10.1371/journal.pone.0101931 PMC4084996 24999732 48 Zheng Y. Wang C. Song A. CMTM6 promotes cell proliferation and invasion in oral squamous cell carcinoma by interacting with NRP1 Am J Cancer Res 10 2020 1691 1709 32642284 PMC7339282 49 Chen L. Yang Q.C. Li Y.C. Targeting CMTM6 suppresses stem cell-like properties and enhances antitumor immunity in head and neck squamous cell carcinoma Cancer Immunol Res 8 2020 179 191 31771985 10.1158/2326-6066.CIR-19-0394 Acknowledgments This study was supported by grants from 10.13039/501100004699 Chung Shan Medical University Hospital CSH-2024-D-009 ",
  "metadata": {
    "Title of this paper": "Targeting CMTM6 suppresses stem cell-like properties and enhances antitumor immunity in head and neck squamous cell carcinoma",
    "Journal it was published in:": "Journal of Dental Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485403/"
  }
}