{
  "title": "Paper_220",
  "abstract": "pmc J Bone Oncol J Bone Oncol 2843 jbo Journal of Bone Oncology 2212-1366 2212-1374 Elsevier PMC12489765 PMC12489765.1 12489765 12489765 10.1016/j.jbo.2025.100709 S2212-1374(25)00050-8 100709 1 Research Paper Modified OPTIModel with oligometastatic disease for the prediction of overall survival of patients with renal cell cancer and symptomatic long bone metastases Dootjes E.W. e.dootjes@erasmusmc.nl a ⁎ Willeumier J.J. b van der Wal C.W.P.G. b van der Wal R.J.P. b van der Zwaal P. c Leithner A. d van der Veldt A.A.M. e f Fiocco M. g h i van Broekhoven D.L.M. a b van der Linden Y.M. j k a b c d e f g h i j k ⁎ e.dootjes@erasmusmc.nl 12 2025 02 9 2025 55 498178 100709 29 4 2025 24 8 2025 26 8 2025 02 09 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Highlights • Renal cell carcinoma patients with oligometastastic bone lesions have better survival than those with diffuse bone metastases. • A survival prediction tool informs clinicians on expected remaining survival. • The OPTIModel helps clinicians discuss treatment options with patients in light of their prognosis. Aims For patients with long bone metastasis (LBM), we have previously developed OPTIModel. In this study, we investigated whether the OPTIModel could be improved for patients with metastatic renal cell cancer (mRCC) by including oligometastatic bone metastases (OBM) as a risk factor. Methods Patients with mRCC and symptomatic LBMs were included in a retrospective and prospective multicenter cohort. Bone metastases (BMs) were categorized as: solitary (SBM), limited BMs (2–4 BMs) or diffuse BMs (DBM; >4 BMs). OBM were defined as ≤ 4 BMs. Overall survival was estimated using Kaplan Meier method. Effect of risk factors on overall survival were assessed using multivariate Cox regression model. Based on these results, the OPTIModel was modified. To assess the discriminatory ability, Harrell’s C-statistic was used. Results 178 patients were included. Overall, median overall survival was 12.1 months (95 % confidence interval (CI): 8.8–15.3). Median survival for SBM (n = 53, 29.8 %), limited BMs (n = 60, 33.7 %) and DBMs (n = 65, 36.5 %) was 19.6 months (95 %CI: 6.8–32.4), 14.8 months (95 %CI: 7.6–21.9) and 6.1 months (95 %CI: 2.7–9.5), respectively. Median survival was 16.3 months (95 %CI: 10.6–22.0) in patients with OBM (n = 113, 63.5 %), with a hazard ratio of 2.11 (95 %CI: 1.44–3.09) compared to patients with DBM. Including OBM in the OPTIModel for mRCC improved C-statistic from 0.585 (standard error (SE) = 0.027) to 0.618 (SE = 0.024). Conclusion Both SBM and limited BMs were associated with a longer overall survival in patients with mRCC and symptomatic LBMs. The modified OPTIModel for mRCC with inclusion of oligometastatic disease could guide decisions about local treatment of symptomatic LBMs. Keywords Renal cell carcinoma Bone metastases Symptoms Survival Prediction pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations BM Bone metastasis CI Confidence interval CT Computed tomography DBM Diffuse bone metastases ECOG Eastern Cooperative Oncology Group EPR Endoprosthetic reconstruction HR Hazard ratio IQR Interquartile range KPS Karnofsky Performance Score LBM Long bone metastasis mRCC Metastatic renal cell carcinoma MRI Magnetic resonance imaging OBM Oligometastatic bone metastases OPTIModel Prognostic model PET Positron emission tomography ProMISe Multicentre prospective database SBM Solitary (long) bone metastasis SBMI Symptomatic bone metastatic interval SBRT Stereotactic body radiotherapy SE Standard error SRE Skeletal related events TKI Tyrosine kinase inhibitor RCC Renal cell carcinoma VBM visceral and/or brain metastases WHO World Health Organization 1 Introduction Renal cell cancer (RCC) is commonly reported in highly developed countries, with approximately 138.600 new cases and 54.100 deaths in 2020 in Europe [ 1 2 3 4 In patients with mRCC, long bone metastases (LBMs) have a high fracture risk and significant impact on quality of life [ 5 6 7 8 For patients with LBMs, we have previously developed the OPTIModel which is based on the primary tumour histology, the Karnofsky Performance Score (KPS) [ 9 Fig. 1 10 11 12 Fig. 1 OPTIModel as developed by Willeumier JJ et al. 10 In patients with RCC, solitary bone metastasis (SBM) is considered a favourable prognostic factor and was already incorporated in the current OPTIModel [ 10 13 [14] [15] [16] 17 18 In this study, we investigated whether the prognostic value of the OPTIModel could be improved for patients with mRCC and symptomatic LBMs by including oligometastatic disease as a risk factor. Therefore, the prognostic factor for metastatic burden in bone was modified for oligometastatic disease and incorporated in the OPTIModel. 2 Patients and Methods 2.1 Study design For the development of OPTIModel a multicentre retrospective database was previously created to collect survival data of patients with symptomatic LBMs [ 10 10 For all cohorts of the OPTIModel, the external validation and the ProMISe, the collected following clinical variables included primary tumour histology, date of diagnosis of the primary tumour and the presence of symptomatic BMs, number of BMs, presence of VBM, KPS, systemic treatment, use of TKIs and local treatment of symptomatic LBMs . 2.2 Data collection For this study, all patients with mRCC were selected from the cohorts of OPTIModel, external validation and ProMISe. First, bone metastases were categorized into three categories: SBM (solitary bone metastasis), limited number of BMs (2–4 bone metastases) or DBM (>4 bone metastases). To align with current literature, we then combined SBM and limited BMs into a group of OBM [ 13 Performance status was scored according to the KPS. In case of the Eastern Cooperative Oncology Group (ECOG) and WHO scores were reported, these scores were converted into KPS. According to the KPS, patients were categorized into two groups: ≥ 80 (able to continue normal activities) and ≤ 70 (unable to continue normal activities). The presence of visceral metastases was based on radiology reports. The presence of brain metastases was based on whole brain CT or MRI, if available. If brain imaging was not available, it was assumed that brain metastases were absent. 2.3 Modelling In the OPTIModel ( Fig. 1 Fig. 2 10 12 Fig. 2 Old and new distribution of primary tumours into the different clinical profiles in the OPTIModel. SBM: solitary bone metastasis; OBM: oligometastatic bone metastases; DBM: diffuse bone metastases. 2.4 Statistics To test differences between the groups, Kruskal-Wallis non-parametric test for continuous variables and Chi-Square for categorical data were used. Time of overall survival was calculated from date of first local treatment for symptomatic LBM to date of death or last follow-up. The Kaplan-Meier method was used to estimate survival and the Log Rank test was used to assess the difference in overall survival between SBM, OBM and DBM. Median follow up was estimated with reversed Kaplan-Meier’s methodology [ 19 20 3 Results 3.1 Patient characteristics A total of 214 patients with mRCC and symptomatic LBM were identified. In 36 patients, the reports did not fulfil the requirements. After exclusion of these patients, 178 patients could be included for the analyses ( Table 1 Table 1 Table 1 Patient and treatment characteristics, N (%). Characteristics Included SBM Limited BM DBM Patients 178 (100) 53 (29.8) 60 (33.7) 65 (36.5) Gender § 123 (69.1) 38 (71.7) 40 (66.7) 45 (69.2) Age at first treat BM § 68.0 (59.9–74.5) 68.4 (58.9–75.3) 69.2 (60.6–75.6) 66.6 (59.9–73.5) SBMI § 1.0 (0.1–4.6) 1.6 (0.1–7.8) 0.9 (0.1–3.4) 0.8 (0.1–4.6) KPS § 80–100 95 (53.4) 30 (56.6) 35 (58.3) 30 (46.2) 0–70 58 (32.6) 17 (32.1) 18 (30.0) 23 (35.4) Missing 25 (14.0) 6 (11.3) 7 (11.7) 12 (18.5) VBM § Present 105 (59.0) 30 (56.6) 38 (63.3) 37 (56.9) Not present 73 (41.0) 23 (43.4) 22 (36.7) 28 (43.1) Treatment primary tumour § Surgery only 100 (56.2) 37 (69.8) 35 (58.3) 28 (43.1) Systemic only 40 (22.5) 7 (13.2) 15 (25.0) 18 (27.7) Combination 13 (7.3) 4 (7.5) 3 (5.0) 6 (9.2) No treatment 23 (12.9) 5 (9.4) 6 (10.0) 12 (18.5) Missing 2 (1.1) 0 1 (1.7) 1 (1.5) TKI § Yes 49 (27.5) 12 (23.1) 18 (30.0) 19 (27.7) No 128 (71.9) 40 (76.9) 42 (70.0) 46 (72.3) Localisation § Femur 98 (55.1) 32 (60.4) 31 (51.7) 35 (53.8) Humerus 57 (32.0) 13 (24.5) 17 (28.3) 27 (41.5) Tibia 11 (6.2) 3 (5.7) 7 (11.7) 1 (1.5) Other 12 (6.7) 5 (9.4) 5 (8.3) 2 (3.1) Fracture status § Actual 78 (43.8) 27 (50.9) 25 (41.7) 26 (40.0) Impending 61 (34.3) 13 (24.5) 21 (35.0) 27 (41.5) No fracture 39 (21.9) 13 (24.5) 14 (23.3) 12 (18.5) Local treatment metastasis § Surgery only 43 (24.2) 19 (35.8) 14 (23.3) 10 (15.4) Surgery + RT 64 (36.0) 22 (41.5) 20 (33.3) 22 (33.8) RT + surgery 25 (14.0) 3 (5.7) 13 (21.7) 9 (13.8) RT only 46 (25.8) 9 (17.0) 13 (21.7) 24 (36.9) Enbloc surgery performed Yes 24 (13.5) 17 (32.1) 6 (10.0) 1 (1.5) No 154 (86.5) 36 (67.9) 54 (90.0) 64 (98.5) SBM: ‘solitary bone metastasis’; BM: ‘bone metastases’; DBM:’diffuse bone metastases’; SBMI: ‘symptomatic bone metastases interval’; IQR: ‘Interquartile range’; KPS: ‘Karnofsky performance score’; VBM: ‘visceral − and / or brain metastases’; TKI: ‘tyrosine kinase inhibitor’; RT:’radiotherapy’. § 3.2 Bone metastases and survival Median overall survival was 12.1 months (95 % confidence interval (CI): 8.8–15.3) with a median follow-up of 7.1 years (range 0.3–14.7). Median overall survival time was 19.6 months (95 %CI: 6.8–32.4), 14.8 months (95 %CI: 7.6–21.9) and 6.1 months (95 %CI: 2.7–9.5) for SBM, limited BMs and DBM, respectively ( Fig. 3 Fig. 4 Table 2 Fig. 3 Estimated overall survival of 178 renal cell carcinoma patients with symptomatic bone metastases by metastatic status (‘SBM’ n = 53; ‘limited BM’ n = 60; ‘DBM’ n = 65 (p < 0.001)). SBM: solitary bone metastasis; limited BM: limited bone metastases; DBM: diffuse bone metastases. Fig. 4 Estimated overall survival of 178 renal cell carcinoma patients with symptomatic bone metastases by metastatic status (‘OBM’ n = 113; ‘DBM’ n = 65 (p < 0.001)). OBM: oligometastatic bone metastases; DBM: diffuse bone metastases. Table 2 Univariate and multivariate Cox proportional hazards regression model for overall survival. Item UV MV Metastatic load HR 95 % CI p-value HR 95 % CI p-value SBM + limited BMs ref ref DBM 2.36 1.69-3.28 < 0.001 2.11 1.44 3.09 <0.001 Age at treatment BMs <65 ref ref ≥65 1.31 0.94–1.82 0.11 1.19 0.82–1.72 0.35 SBMI <60 months ref ref ≥60 months 1.02 0.70–1.49 0.92 1.2 0.76–1.89 0.44 KPS ≥80 ref ref ≤70 1.87 1.31 2.67 < 0.001 1.62 1.12– 2.33 0.01 VBM No ref ref Yes 1.47 1.05 2.05 0.02 1.71 1.17 2.50 0.01 TKI Yes ref ref No 1.16 0.81–1.66 0.43 1.2 0.78–1.85 0.41 Localisation Upper extremity ref ref Lower extremity 0.96 0.69–1.33 0.8 0.88 0.60–1.28 0.51 Pathological fracture No ref ref Yes 1.06 0.77–1.47 0.71 1.01 0.69–1.47 0.98 Enbloc surgery No ref ref Yes 0.39 0.23 –0.67 < 0.001 0.49 0.27 0.88 0.02 UV: ‘univariate analyses’; MV: ‘multivariate analyses’; HR: ‘hazard ratio’; CI: ‘confidence interval’; SBM: ‘solitary bone metastasis’; BMs: ‘bone metastases’; DBM:’diffuse bone metastases’; SMBI:’symptomatic bone metastasis interval’; KPS: ‘Karnofsky performance score’; VBM: ‘visceral and / or brain metastases’; TKI: ‘tyrosine kinase inhibitor’. 3.3 Modified OPTIModel For patients with mRCC and BMs, the OPTIModel was adapted according to the number of BMs. Having ≤ 4 BMs (OBM) was categorised as a favourable risk factor, whereas the presence of > 4 BMs (DBM) was a moderate risk factor ( Fig. 2 Table 3 Table 3 Before and after modification of § Fig. 1 PredictiveCategory n (%) Median Overall Survival, months (95 % CI) HR 95 % CI C-statistic Original OPTIModel [ 10 0.58 A 36 (23.5) 26.2 (15.4–37.0) ref ref B 76 (49.7) 10.5 (5.9–15.2) 1.76 1.10–2.82 C 41 (26.8) 7.6 (2.5–12.7) 2.23 1.33–3.75 D NA NA NA NA  Modified adjustment 0.62 A 78 (51.0) 21.6 (12.1–31.0) ref ref B 52 (34.0) 7.2 (5.3–9.0) 2.11 1.43–3.12 C 23 (15.0) 5.7 (1.0–10.4) 2.86 1.74–4.70 D NA NA NA NA CI: ‘confidence interval’; NA: ‘not applicable’ (no patients in this category). 4 Discussion In this study, we investigated impact of the number of BMs on overall survival in patients with mRCC and symptomatic LBMs. Patients with symptomatic LBMs and oligometastatic bone metastases (≤4 BMs) had a significantly longer overall survival as compared to patients with diffuse bone metastases (>4 BMs; 16.3 versus There are large differences in disease trajectories for patients with metastatic cancer [ 21 22 In the current study, 30 % of the patients survived two years or longer. These patients could possibly benefit from more extensive treatment strategies for symptomatic LBMs. More ablative local treatment in patients with SBM and especially limited BM is still debatable. Durable local control could be achieved with en bloc resection often followed by endoprosthetic reconstruction (EPR), and/or high dose radiotherapy (e.g. stereotactic body radiotherapy (SBRT)). Numerous studies have reported the association between metastatic burden of BMs and survival in patients with mRCC [ [23] [24] [25] [26] [27] [28] [29] [30] 24 25 28 29 25 27 For patients with mRCC who are candidates for extensive surgery, SRBT can still be considered to treat symptomatic LBMs. However, despite excellent 1-year local control and low toxicity, the benefit of SBRT on survival is questionable [ 31 13 10 Table 3 Bone metastases from RCC are usually lytic and prone to skeletal related events (SREs), which are defined as pathological fractures, bone surgery for pending pathological fractures, bone pain requiring radiotherapy, spinal cord and nerve root compression, and hypercalcaemia. These SREs are reported in approximately 80 % of patients with RCC and bone metastases [ 32 33 A limitation of the study is the retrospective design and the use of different imaging modalities. In mRCC, PET/CT using 18 34 35 In addition, the long inclusion period and the lack of systemic treatments in this period may have limited further optimalization of the modified OPTIModel. Between 2000 and 2014, the first TKIs targeting VEGFR signalling were introduced in the Netherlands. After 2014, immune checkpoint inhibitors and several combinations with immune checkpoint inhibitors were approved in the Netherlands for the treatment of mRCC. With the increasing number of available systemic treatments, the use of the risk model of the International Metastatic RCC Database Consortium (IMDC) has increased to select patients for the different systemic treatments. However, the IMDC risk factors (e.g. hypercalcaemia and neutrophilia) were not collected in the current study. Nevertheless, the data of the used homogenous cohorts with long follow-up are still useful since the clinical outcomes in these cohorts were not significantly affected by the different systemic strategies that are currently available in clinical practice. Therefore, the modified OPTIModel may still be valuable to guide local treatment of symptomatic LBMs in the current era of mRCC treatment. In conclusion, both solitary bone metastasis and limited (2–4) bone metastases were associated with a longer overall survival in patients with mRCC and symptomatic LBMs. The modified OPTIModel with inclusion of oligometastatic disease may assist treating physicians and patients in making decisions about local treatments of symptomatic LBMs, thereby improving the quality of life of patients with mRCC and symptomatic LBMs. CRediT authorship contribution statement E.W. Dootjes: J.J. Willeumier: C.W.P.G. van der Wal: R.J.P. van der Wal: P. van der Zwaal: A. Leithner: A.A.M. van der Veldt: M. Fiocco: D.L.M. van Broekhoven: Y.M. van der Linden: Funding The OPTIMAL study was supported by a grant from the Dutch Cancer Society / Alpe d’HuZes. Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Dyba T. Randi G. The European cancer in 2020: Incidence and mortality estimates for 40 countries and 25 major cancers Eur. J. Cancer 157 2021 308 347 34560371 10.1016/j.ejca.2021.07.039 PMC8568058 2 Bahadoram S. Davoodi M. Renal cell carcinoma: an overview of the epidemiology, diagnosis and treatment G. Ital. Nefrol. 39(3):2022-vol3 2022 35819037 3 Bianchi M. Sun M. Distribution of metastatic sites in renal cell carcinoma: a population-based analysis Ann. Oncol. 23 4 2012 973 980 21890909 10.1093/annonc/mdr362 4 Chen Y.W. McKay R.R. Mitigating the risk of skeletal events in metastatic renal cell carcinoma Eur. Urol. Focus S2405–4569 25 2025 Apr 000085 000089 10.1016/j.euf.2025.04.007 40280849 5 Guida A. Escudier B. Albiges L. Treating patients with renal cell carcinoma and bone metastases Expert Rev. Anticancer Ther. 18 11 2018 1135 1143 30183421 10.1080/14737140.2018.1520097 6 Willeumier J.J. van der Linden Y.M. Treatment of pathological fractures of the long bones EFORT Open Rev. 1 5 2016 136 145 28461940 10.1302/2058-5241.1.000008 PMC5367617 7 Bauer H.C. Wedin R. Survival after surgery for spinal and extremity metastases. Prognostication in 241 patients Acta Orthop. Scand. 66 2 1995 143 146 7740944 10.3109/17453679508995508 8 Katagiri H. Takahashi M. Prognostic factors and a scoring system for patients with skeletal metastasis J. Bone Joint Surg. Br. 87 5 2005 698 703 15855375 10.1302/0301-620X.87B5.15185 9 Karnofsky D. Clinical evaluation of anticancer drugs: cancer chemotherapy Gann Monogr. 2 1967 223 231 10 Willeumier J.J. van der Linden Y.M. An easy-to-use prognostic model for survival estimation for patients with symptomatic long bone metastases J. Bone Joint Surg. Am. 100 3 2018 196 204 29406340 10.2106/JBJS.16.01514 11 Willeumier J.J. van der Hoeven N.M.A. Epidermal growth factor receptor mutations should be considered as a prognostic factor for survival of patients with pathological fractures or painful bone metastases from non-small cell lung cancer Bone Joint J. 99-B 4 2017 516 521 28385942 10.1302/0301-620X.99B4.BJJ-2016-0872.R1 12 Bollen L. Wibmer C. Molecular phenotype is associated with survival in breast cancer patients with spinal bone metastases Clin. Exp. Metastasis 32 1 2015 1 5 25359620 10.1007/s10585-014-9685-y 13 Guckenberger M. Lievens Y. Characterisation and classification of oligometastatic disease: a European Society for Radiotherapy and Oncology and European Organisation for Research and Treatment of Cancer consensus recommendation Lancet Oncol. 21 1 2020 e18 e28 31908301 10.1016/S1470-2045(19)30718-1 14 Tree A.C. Khoo V.S. Stereotactic body radiotherapy for oligometastases Lancet Oncol. 14 1 2013 e28 e37 23276369 10.1016/S1470-2045(12)70510-7 15 Weichselbaum R.R. Hellman S. Oligometastases revisited Nat. Rev. Clin. Oncol. 8 6 2011 378 382 21423255 10.1038/nrclinonc.2011.44 16 Huang F. Wu G. Oligometastasis and oligo-recurrence: more than a mirage Radiat. Oncol. 9 2014 230 25359216 10.1186/s13014-014-0230-6 PMC4222373 17 Kane C.J. Mallin K. Renal cell cancer stage migration: analysis of the National Cancer Data Base Cancer 113 1 2008 78 83 18491376 10.1002/cncr.23518 18 Fukushima H. Hozumi T. Prognostic significance of intensive local therapy to bone lesions in renal cell carcinoma patients with bone metastasis Clin. Exp. Metastasis 33 7 2016 699 705 27316704 10.1007/s10585-016-9805-y 19 Schemper M. Smith T.L. A note on quantifying follow-up in studies of failure time Control. Clin. Trials 17 4 1996 343 346 8889347 10.1016/0197-2456(96)00075-x 20 Harrell F.E. Jr Lee K.L. Multivariable prognostic models: issues in developing models, evaluating assumptions and adequacy, and measuring and reducing errors Stat. Med. 15 4 1996 361 387 8668867 10.1002/(SICI)1097-0258(19960229)15:4<361::AID-SIM168>3.0.CO;2-4 21 Kim H.J. Ahn S.G. Metastasis-free interval is closely related to tumor characteristics and has prognostic value in breast cancer patients with distant relapse J. Breast Cancer 18 4 2015 371 377 26770244 10.4048/jbc.2015.18.4.371 PMC4705089 22 Hernandez R.K. Wade S.W. Incidence of bone metastases in patients with solid tumors: analysis of oncology electronic medical records in the United States BMC Cancer 18 1 2018 44 29306325 10.1186/s12885-017-3922-0 PMC5756362 23 Lu X. Gu W. Oligometastatic state predicts a outcome for renal cell carcinoma patients with bone metastasis under the treatment of sunitinib Oncotarget 7 18 2016 26879 26887 27058898 10.18632/oncotarget.8568 PMC5042022 24 Hoshi M. Takada J. Prognostic factors for patients with solitary bone metastasis Int. J. Clin. Oncol. 18 1 2013 164 169 22173837 10.1007/s10147-011-0359-3 25 Laitinen M. Parry M. Survival and complications of skeletal reconstructions after surgical treatment of bony metastatic renal cell carcinoma Eur. J. Surg. Oncol. 41 7 2015 886 892 25964050 10.1016/j.ejso.2015.04.008 26 Ratasvuori M. Wedin R. Prognostic role of en-bloc resection and late onset of bone metastasis in patients with bone-seeking carcinomas of the kidney, breast, lung, and prostate: SSG study on 672 operated skeletal metastases J. Surg. Oncol. 110 4 2014 360 365 24889389 10.1002/jso.23654 27 Szendroi A. Dinya E. Prognostic factors and survival of renal clear cell carcinoma patients with bone metastases Pathol. Oncol. Res. 16 1 2010 29 38 19639393 10.1007/s12253-009-9184-7 28 Fuchs B. Trousdale R.T. Solitary bony metastasis from renal cell carcinoma: significance of surgical treatment Clin. Orthop. Relat. Res. 431 2005 187 192 10.1097/01.blo.0000149820.65137.b4 15685074 29 Hwang N. Nandra R. Massive endoprosthetic replacement for bone metastases resulting from renal cell carcinoma: factors influencing patient survival Eur. J. Surg. Oncol. 40 4 2014 429 434 24063967 10.1016/j.ejso.2013.08.001 30 Lin P.P. Mirza A.N. Patient survival after surgery for osseous metastases from renal cell carcinoma J. Bone Joint Surg. Am. 89 8 2007 1794 1801 17671020 10.2106/JBJS.F.00603 31 Zaorsky N.G. Lehrer E.J. Stereotactic ablative radiation therapy for oligometastatic renal cell carcinoma (SABR ORCA): a meta-analysis of 28 studies Eur. Urol. Oncol. 2 5 2019 515 523 31302061 10.1016/j.euo.2019.05.007 32 Woodward E. Jagdev S. Skeletal complications and survival in renal cancer patients with bone metastases Bone 48 1 2011 160 166 20854942 10.1016/j.bone.2010.09.008 33 van Broekhoven D.L.M. Dootjes L.W. Effect of bisphosphonates on skeletal related events in long bone metastases of renal cell carcinoma: a systematic review Clin. Genitourin. Cancer 21 3 2023 e190 e197 36707394 10.1016/j.clgc.2022.12.010 34 Verhoef S.R. van Es S.C. Lesion detection by [ 89 18 Eur. J. Nucl. Med. Mol. Imaging 46 9 2019 1931 1939 31172212 10.1007/s00259-019-04358-9 PMC6647180 35 Gerety E.L. Lawrence E.M. Prospective study evaluating the relative sensitivity of 18F-NaF PET/CT for detecting skeletal metastases from renal cell carcinoma in comparison to multidetector CT and 99mTc-MDP bone scintigraphy, using an adaptive trial design Ann. Oncol. 26 10 2015 2113 2118 26202597 10.1093/annonc/mdv289 PMC4576907 ",
  "metadata": {
    "Title of this paper": "Prospective study evaluating the relative sensitivity of 18F-NaF PET/CT for detecting skeletal metastases from renal cell carcinoma in comparison to multidetector CT and 99mTc-MDP bone scintigraphy, using an adaptive trial design",
    "Journal it was published in:": "Journal of Bone Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489765/"
  }
}