{
  "title": "Paper_824",
  "abstract": "pmc J Immunother J Immunother 2035 lwwopen CJI Journal of Immunotherapy (Hagerstown, Md. : 1997) 1524-9557 1537-4513 pmc-is-collection-domain yes pmc-collection-title Lippincott Open Access PMC12479067 PMC12479067.1 12479067 12479067 40831319 10.1097/CJI.0000000000000577 JIT-D-24-00196 1 3 Clinical Studies Integrated Analysis of Single-cell and Bulk RNA-Sequencing Identifies a Signature Based on Cancer-related Fibroblast Marker Genes to Predict Prognosis and Therapy Response in Lung Adenocarcinoma Liu Gengqiu * liugq8@mail2.sysu.edu.cn Feng Jiacheng † 2664245344@qq.com Huang Yufeng * huangyf235@mail2.sysu.edu.cn Zhang Junhang * zhangjh33@mail.sysu.edu.cn Li Yong ‡ langebai@163.com  *  †  ‡ Reprints: Yong Li, Department of Thoracic Surgery, BaoAn Central Hospital of Shenzhen, Shenzhen 518101, China (e-mail: langebai@163.com zhangjh33@mail.sysu.edu.cn Nov-Dec 2025 20 8 2025 48 9 497813 365 378 19 9 2024 14 7 2025 29 09 2025 30 09 2025 30 09 2025 Copyright © 2025 The Author(s). Published by Wolters Kluwer Health, Inc. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution-Non Commercial-No Derivatives License 4.0 (CCBY-NC-ND) Cancer-related fibroblasts (CAFs), crucial in the tumor microenvironment, significantly influence tumorigenesis and extracellular matrix shaping. This study aimed to analyze the expression of CAF marker genes in lung adenocarcinoma (LUAD) and create a prognostic signature. We included 716 LUAD patients from different cohorts, conducting a comprehensive analysis of single-cell RNA sequencing data from the Gene Expression Omnibus (GEO) database, identifying 227 CAF marker genes. Using the Cancer Genome Atlas (TCGA) LUAD cohort, we developed a 3-gene prognostic signature, categorizing patients into high-risk and low-risk groups. The signature’s predictive capability was validated across clinical subgroups and GEO cohorts. It was determined as an independent prognostic factor via univariate and multivariate analyses, leading to the construction of a nomogram for clinical prognosis prediction. Immune profile analysis indicated that high-risk patients exhibited immunosuppression and immune cell infiltration, while the tumor immune dysfunction and exclusion score suggested higher immunotherapy sensitivity in the low-risk group. In addition, high-risk patients showed greater sensitivity to several first-line chemotherapeutic drugs. The expression of hub genes was validated using quantitative real-time reverse transcription polymerase chain reaction (qRT-PCR) and the Human Protein Atlas (HPA). In conclusion, this study presented a novel prognostic signature for LUAD patients based on CAF marker genes, demonstrating strong predictive power for prognosis and treatment response. Key Words: cancer-associated fibroblast lung adenocarcinoma single-cell RNA sequencing tumor microenvironment prognosis Yong Li BAYXH2023050 Yong Li pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes OPEN-ACCESS TRUE SDC T Lung cancer, as one of the most prevalent malignancies, is the primary contributor to cancer-associated mortality worldwide. 1 2 3 5 6 7 8 9 10 11 12 TME is an intricate system consisting of various components, including immune cells, stromal cells, extracellular matrix (ECM), and cytokines. 13 14 15 16 17 18 19 20 22 23 24 The development of single-cell single cell RNA sequencing (scRNA-seq) technology and related transcriptomic analysis provide novel insights into tumor heterogeneity and evolution, and establish the foundation for predicting prognosis and optimizing individualized treatment options. 25 26 27 28 The predictive capability of CAFMGS was further substantiated through validation using an independent cohort obtained from the Gene Expression Omnibus (GEO) database, and a nomogram was developed for clinical prognosis prediction. Finally, we analyzed the differences in TME, immunotherapy response and drug sensitivity comparing the 2 risk groups. The current investigation findings strongly support the identification of relevant prognostic biomarkers and potential therapeutic targets for LUAD. MATERIALS AND METHODS Data Collection The Single-cell transcriptome file of GSE123902 GSE31210 Single-cell RNA Sequencing Analysis and Identification of CAF Marker Genes By utilizing the “Seurat” and “SingleR” packages, our study conducted an in-depth analysis of scRNA-seq data to comprehensively characterize the CAF signature. 29 In the initial step, we employed the “Seurat” package to perform data normalization on the scRNA-seq data set, using the “NormalizeData” and “ScaleData” functions, specifically specifying “LogNormalize” as the chosen normalization method. Subsequent to normalization, we further transformed the normalized scRNA-seq data into a Seurat object and utilized the “FindVariableSignatures” function to identify the top 2000 genes exhibiting high variability. Following this, we used the “RunPCA” function from the “Seurat” package to conduct a principal component analysis (PCA), aiming to achieve preliminary linear dimensionality reduction of the scRNA-seq data. This was done based on the selection of the top 2000 genes. Following the implementation of an ElbowPlot analysis to identify the main principal components (PCs), we leveraged the top 15 PCs to carry out a subsequent cell clustering analysis. Employing the FindNeighbors and FindClusters functions, individual cells were effectively clustered into distinct subgroups. The major clusters were then determined by applying the t-distributed random neighborhood embedding (t-SNE) algorithm, a nonlinear dimensionality reduction technique. The “FindAllMarkers” function was applied to calculate the marker genes for each cluster. Automatic annotation of the corresponding cell type for each cluster was achieved using the SingleR package. Next, we isolated the sample data corresponding to LUAD tissue type and conducted t-SNE downscaling clustering analysis using the same algorithm. To identify marker genes for CAFs, the adjusted P Development and Validation of a Prognostic Signature Based on Marker genes Expressed by CAFs In the initial step, we employed the “limma” package to discern differentially expressed genes (DEGs) between tumor and normal tissue based on CAF marker genes, employing a stringent threshold of false discovery rate (FDR)<0.05 and |log2(Fold Change) |> 1. Transcriptomic and survival data from 490 LUAD patients were integrated as the training cohort for model construction, and 30% of these patients were randomly selected as the testing cohort. Subsequently, a univariate Cox regression analysis was conducted to assess the prognostic significance of the screened CAF marker genes for overall survival (OS) in LUAD patients from the TCGA data set. Genes demonstrating a P To minimize the risk of overfitting, we then employed the LASSO Cox regression analysis technique and opted for a stringent criterion whereby one standard error above the minimum threshold was selected. By employing the genes identified through LASSO Cox regression analysis, we performed stepwise multivariate Cox regression analysis to ascertain the prognostic significance of a specific gene signature. Based on the results of the multivariate Cox model, the risk model was established by linearly combining the mRNA expression of genes with their corresponding risk coefficients. Utilizing the median risk score threshold, patients were classified into low-risk and high-risk groups, and their relationship with OS was analyzed employing Kaplan-Meier analysis. Following that, heat maps were generated to depict the correlation between risk scores and target genes. For additional affirmation of prognostic efficacy, we calculated the area under the curve (AUC) using the “survival ROC” package. In a similar manner, we substantiated the prognostic performance of our risk model through survival analysis and evaluation of the AUC in both the TCGA validation set and the GSE31210 Prognostic Signatures and Nomogram Establishment To ascertain the independent prognostic value of CAFMGS, we employed univariate and multivariate Cox regression analyses on the risk scores, with adjustments made for age, sex, smoking history, and tumor, lymph nodes, metastasis (TNM) stage. Afterwards, the construction of a nomogram was performed using the “rms” R package, incorporating the multivariate Cox regression coefficients of clinical variables and CAFMGS obtained from the TCGA training cohort. To assess the predictive performance of the nomogram, the consistency index ( C Enrichment Analysis of Gene Set The Gene Set Enrichment Analysis (GSEA) was utilized to elucidate the significant pathways and molecular mechanisms linked to the low-risk and high-risk patient cohorts diagnosed with LUAD. The GSEA software was utilized to load gene sets from the Kyoto Encyclopedia of Genes and Genomes (KEGG), as well as expression files for phenotype annotation. The inclusion criteria required a normalized enrichment score (NES) with an absolute value exceeding 1, a normalized (NOM) P q Tumor Immune Microenvironment and Immunotherapeutic Response The “Estimate” R package was employed to calculate the stromal score, immune score, and ESTIMATE score for lung squamous cell carcinoma (LUSC) patients to evaluate the degree of infiltration by stromal cells and immune cells within the tumor tissue. 30 31 32 http://tide.dfci.harvard.edu Drug Sensitivity Analysis To delve into the discrepancies in chemotherapy susceptibility between high-risk and low-risk patient subsets, we utilized the GDSC platform to assess the response to chemotherapy in patients diagnosed with LUAD. 33 34 Differential Expression Analysis of Signature Candidate Genes Based on Online Databases and the Quantitative Real-time Reverse Transcription Polymerase Chain Reaction Experiment An investigation into the differential expression of 3 signature candidate genes between normal and LUAD tissues was carried out using data extracted from the TCGA database. Meanwhile, to substantiate the differential expression of 3 signature candidate genes in TCGA analysis, we obtained 20 paired LUAD tumor and matched normal adjacent lung tissue samples from patients undergoing surgical resection at the Seventh Affiliated Hospital of Sun Yat-sen University (Shenzhen, China) for conducting quantitative real-time reverse transcription polymerase chain reaction (qRT-PCR) experiments. All specimens from surgical resection specimens are rapidly frozen in liquid nitrogen and stored at −80 °C until RNA extraction. The clinicopathologic signatures of all tumor specimens examined in this study were verified as indicative of LUAD. The study protocol received ethical approval from the hospital’s ethics committee, and written informed consent was obtained from each participant. Total RNA was extracted from a total of 10 LUAD tissues and 10 normal lung tissues of human origin using TRIzol reagent. RNA was reverse transcribed into complementary DNA through the Evo M-MLV RT premix. Real-time PCR analysis was performed to detect gene expression using the SYBR-Green Pro Taq HS real-time fluorescence quantitative polymerase chain reaction (q-PCR) Kit II (Accurate Biology). The 2–ΔΔCt method was employed to normalize the relative mRNA expression of the target genes to GAPDH. The primer sequences employed for amplification are shown in the Supplemental Table 1 (Supplemental Digital Content 1, http://links.lww.com/JIT/A996 Protein Levels of Signature Candidate Genes in the Human Protein Atlas Database The Human Protein Atlas (HPA) is a comprehensive project that aims to map all the human proteins in cells, tissues, and organs using a combination of experimental and computational methods. 32 https://www.proteinatlas.org/ The HPA utilizes a various of technical tools, such as immunohistochemistry (IHC), immunofluorescence (IF), and antibody-based analysis, for systematic evaluation of protein expression and localization in normal and tumor tissues. All tissue images included in our study from the HPA database were stained by immunohistochemistry. Statistical Analysis The R software version 4.2.2 ( http://www.R-project.org P RESULTS Revealing CAF Marker Gene Profiles through scRNA Sequencing Data Analysis The overall research process is illustrated in the flowchart (Supplementary Fig. 1, Supplemental Digital Content 2, http://links.lww.com/JIT/A997 http://links.lww.com/JIT/A997 1 http://links.lww.com/JIT/A998 1 http://links.lww.com/JIT/A997 1 1 http://links.lww.com/JIT/A997 1 http://links.lww.com/JIT/A997 http://links.lww.com/JIT/A999 FIGURE 1 Identification of CAF marker genes by single-cell RNA-sequencing analysis. (A) t-SNE plot colored by various cell types. (B) The cell types identified by marker genes. (C) t-SNE plot split by different tissue types. (D) Proportions of various cell types originated from tumor and normal tissue. (E) t-SNE plot colored by various tumor samples. (F) The cell types of tumor tissue identified by marker genes. The Construction of Prognostic Signature Based on CAF Marker Genes To establish the prognostic signature on the basis of CAF marker genes, we first screened the DEGs between tumor and normal tissue within the CAF marker genes. All together 67 DEGs were obtained, as shown in Supplemental Figure 3a, Supplemental Digital Content 2, http://links.lww.com/JIT/A997 http://links.lww.com/JIT/A1000 http://links.lww.com/JIT/A997 P 2 2 2 http://links.lww.com/JIT/A997 P 2 2 P 2 2 P 1 2 FIGURE 2 Construction and validation of prognostic signature. (A and B) LASSO regression analysis. (C) Forest plot of multivariate Cox regression result, * represents P P * P Independent Prognostic and the Establishment of Nomogram Utilizing the TCGA cohort, we performed univariate and multivariate Cox regression analyses to examine whether the prognostic utility of CAFMGS was unaffected by other clinical variables, including sex, age, smoking history and TNM stage. After conducting univariate and multivariate Cox regression analyses, we observed that the risk score demonstrated significant independent prognostic significance, as supported by the results evaluating both the risk score and clinical characteristics (Figs. 3 FIGURE 3 The establishment and validation of nomogram. (A and B) The results of univariate and multivariate Cox regression analyses of risk score and clinical characteristics. (C) The construction of the nomogram. (D) Calibration curve for assess the agreement at 1-, 3- and 5-year overall survival ***P<0.001, **P<0.01, *P<0.05. Subsequently, we constructed a nomogram that amalgamates risk scores with other clinically significant parameters, resulting in a robust tool for quantifying risk assessment and predicting the probability of survival in patients with LUAD (Fig. 3 C 3 P http://links.lww.com/JIT/A997 Gene Set Enrichment Analysis Given the strong association of our designed Comprehensive Assessment of Functional CAFMGS with poor prognosis and limited response to immunotherapy, we employed GSEA to explore the underlying functional pathways within this signature. Our findings revealed that a majority of the pathways enriched in the high-risk group were closely associated with cellular proliferation, encompassing processes such as cell cycle regulation, DNA replication, homologous recombination, base excision repair, and proteasome activity (Fig. 4 4 FIGURE 4 Gene set enrichment analysis. (A) The signaling pathways enriched in the high-risk group. (B) The signaling pathways enriched in the low-risk group. Assessment of Tumor Immune Microenvironment and Immune-related Genes The relationship between CAFMGS and TIME was subsequently examined in our analysis. Our statistical analysis using the ESTIMATE algorithm revealed significantly higher stromal, immune, and estimated scores in the low-risk group ( P 5 5 5 FIGURE 5 Characteristics of tumor immune microenvironment. (A–C) Differences in expression levels of stromal, immune, and ESTIMATE scores between low-risk and high-risk groups. (D) Differential expression levels of 22 types of tumor-infiltrating immune cells between low-risk and high-risk groups. (E) Differential expression levels of the immune checkpoint-related genes between low-risk and high-risk groups. (F) Tumor immune dysfunction and exclusion (TIDE) score between low-risk and high-risk groups. (G) Differential expression levels of the human leukocyte antigen-related genes between low-risk and high-risk groups. *** P P P Notably, the TIDE score results displayed markedly lower scores within the low-risk patient group (Fig. 5 5 Prediction of Drug Sensitivity In an effort to fully assess the applicability of this signature in guiding systemic therapy, we undertook subsequent analyses to examine the variances in sensitivity to chemotherapeutic drugs for LUAD between low-risk and high-risk groups. The findings revealed that individuals categorized into the low-risk group showed decreased IC50 values for frequently employed first-line anticancer medications, including docetaxel, cisplatin, vinorelbine, paclitaxel, afatinib, erlotinib, gefitinib, lapatinib, and oxitinib (Figs. 6 FIGURE 6 Evaluation of drug sensitivity. The comparisons in IC50 value of docetaxel (A), cisplatin (B), paclitaxel (C), vinorelbine (D), gefitinib (E), lapatinib (F), osimertinib (G), erlotinib (H), afatinib (I) between low-risk and high-risk groups. Differential Expression of Signature Candidate Genes Analysis of TCGA data indicated a significant decrease in the expression of DCN mRNA, as opposed to normal lung tissues ( P 7 P 7 FIGURE 7 Differential RNA expression levels of the signature candidate genes between normal and tumor tissues. (A–C) Differential RNA expression levels of DCN, POSTN, and GPX8 between normal and tumor tissues in TCGA database. (D–F) Differential relative RNA expression levels of DCN, POSTN, and GPX8 between normal and tumor tissues. *** P P In addition, to validate the coherence of the expression patterns observed for the three candidate genes considered as signature markers with the TCGA database analysis, we employed q-PCR analysis to investigate the mRNA expression levels of these signature genes in clinical samples obtained from LUAD patients and normal lung tissues. The outcomes presented a statistically significant decline in DCN expression in LUAD tissues ( P 7 P 7 Revealing Protein-level Differential Expression of Signature Candidate Genes Figure 8 FIGURE 8 Differential expression of signature candidate genes at the protein level. DISCUSSION With the continuous improvement of scRNA-seq technology, there has been a surge in research focused on elucidating the molecular signatures of tumor-associated cells within the TME. Despite extensive research on immune cells within TME, there has been a notable neglect of the role played by stromal cells. This limited exploration of stromal cells can have a substantial effect on prognosis and treatment response, particularly in the realm of immunotherapy. The pivotal role and influential nature of fibroblasts within stromal cell populations cannot be overstated, as they intricately contribute to tumorigenesis and significantly shape the effectiveness of subsequent treatment modalities. 21 35 36 37 38 39 40 Meanwhile, CAFs within the TME secrete cytokines and chemokines, which promotes lymphatic angiogenesis and thereby enhances the endocrine function of cancer cells. 41 43 44 Inspired by this finding and previous studies, our study aimed to delve into the CAF marker genes present in LUAD through meticulous scRNA-seq analysis, with the goal of identifying potential therapeutic targets, and we constructed a unique prognostic prediction signature utilizing CAF marker genes obtained from LUAD patients within the TCGA database. The validation of this signature in an independent cohort sourced from the GEO data set is of utmost significance. Thereafter, we successfully identified this signature as an independent risk factor for patients with LUAD. Augmenting our findings, we rigorously assessed the predictive potential of CAFMGS within diverse clinical subgroups. Taking these advancements into account, we developed a robust nomogram to aid in clinical prediction. The aforementioned findings imply that the low-risk score group of CAFMGS was tightly associated with abundant infiltration of immune cells. In addition, our study demonstrated a substantial discrepancy in immunotherapy response rates between the low-risk score group and the high-risk score group. The findings of this study provide compelling evidence that low-risk patients have a considerably greater potential to derive benefits from immune checkpoint blockade therapy. In the context of several extensively utilized anticancer chemotherapies, the drug sensitivity IC50 was found to be higher in patients classified as low-risk compared with those in the high-risk group. The findings indicate that certain commonly employed first-line anticancer chemotherapies may be more appropriate for individuals classified as a high-risk group. According to our findings, CAFMGS might be a pragmatic tool to anticipate the prognosis and treatment efficacy of LUAD patients following further validation. This study involved the analysis of 3 CAF marker genes: DCN, POSTN, and GPX8. The results revealed that DCN had a protective effect on the prognosis of LUAD patients, while POSTN and GPX8 were prognostically unfavorable genes. It is well-established that both DCN and POSTN serve as markers of fibroblasts. DCN, a small leucine-rich proteoglycan primarily secreted by fibroblasts, plays a crucial role as an integral component of the ECM and primarily functions as a regulator of cellular behavior. 45 46 47 50 51 55 56 57 58 59 60 61 62 63 Multiple investigations have provided evidence linking GPX8 to an adverse cancer prognosis, as well as its involvement in various pathophysiological processes associated with tumor initiation, advancement, and metastasis. Notably, these processes encompass lung cancer and gastric cancer. 64 66 64 67 68 Subsequently, our investigation unveiled significant variations in the levels of infiltration by 22 immune cells between the high-risk and low-risk groups. These observations suggest the potential existence of discrepant phases of anti-tumor immune response among patients classified into these groups. In addition, immune checkpoint blockade represents a vital therapeutic modality for lung malignancy management. 69 To sum up, HLA is a gene product that is expressed by the major histocompatibility complex within the living organism, functioning as an essential mediator in antigen presentation and immune response modulation against lung cancer. 70 71 On the whole, it was observed that patients assigned to the low-risk group showcased augmented immune cell infiltration and a more positive immunotherapy response, suggesting a greater likelihood of therapeutic gains through immunotherapeutic approaches. With the aim of enhancing the precision of clinical interventions in LUAD, a thorough evaluation of drug sensitivity was executed among distinct risk categories. The efficacy of 9 anticancer therapeutics, including docetaxel, cisplatin, paclitaxel, vinorelbine, gefitinib, lapatinib, osimertinib, erlotinib, and afatinib, was examined across low-risk and high-risk populations. The study outcomes showcased increased susceptibility of the high-risk patient population to the nine anticancer drugs under evaluation, serving as a valuable reference for choosing appropriate chemotherapy medications in clinical settings. The clinical significance of these drugs in LUAD patients will be further explored in subsequent studies. There still remained some limitations, despite the promising findings of this study in the area of treatment of lung adenocarcinoma. Firstly, the data of our study were obtained from retrospective cohorts in publicly available databases. Secondly, this study focused exclusively on signature candidate genes that serve as markers for CAFs while acknowledging the significant spatial heterogeneity within the TME. The prognostic predictive capability of the identified signature was consequently limited. All mechanistic analyses conducted in our research were primarily descriptive in nature. Future endeavors should focus on conducting larger-scale basic experimental studies to elucidate the potential mechanisms linking gene expression in CAFMGS with LUAD prognosis. In summary, by performing an integrative analysis of single-cell and bulk RNA-seq, we have developed and validated an innovative prognostic signature comprising 3 CAF marker genes. This signature demonstrates great potential as a reliable prognostic biomarker and has the ability to predict patient response to LUAD therapy. Our investigation provided new insights into the effects of stromal cell marker genes, excluding immune cells, regarding the prognosis and treatment response of LUAD patients within the TME. Supplementary Material ACKNOWLEDGMENTS Thanks to the 10 patients who participated in this medical research. Conflicts of Interest/Financial Disclosures This work received support from the following funding source: the Medical and Health Research Project of Bao’an District Medical Association (Grant No: BAYXH2023050). All authors have declared that there are no financial conflicts of interest with regard to this work. G.L. and J.F. contributed equally to this work and share first authorship. This study was approved by the Human Experiment Committee of the Seventh Affiliated Hospital of Sun Yat-sen University (KY-2023-051-02). All patients received informed consent. All results shown here are based on the TCGA database: https://www.cancer.gov/tcga https://www.ncbi.nlm.nih.gov/geo/ GSE123902 GSE31210 G.L. and J.Z.: conceptualization and design. G.L.: data collection. G.L., J.F., and Y.H.: statistical analysis and interpretation of data. G.L., Y.L., and J.F.: preparation of the figures. J.F., G.L., and J.Z.: the original draft writing. J.Z. and Y.L.: review and revise the manuscript. All the authors read and approved the final manuscript. Supplemental Digital Content is available for this article. Direct URL citations are provided in the HTML and PDF versions of this article on the journal's website, www.immunotherapy-journal.com REFERENCES 1 Sung H Ferlay J Siegel RL Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 209 249 33538338 10.3322/caac.21660 2 Siegel RL Miller KD Fuchs HE Cancer statistics, 2022 CA Cancer J Clin 2022 72 7 33 35020204 10.3322/caac.21708 3 Hirsch FR Scagliotti GV Mulshine JL Lung cancer: current therapies and new targeted treatments Lancet 2017 389 299 311 27574741 10.1016/S0140-6736(16)30958-8 4 Chang JT Lee YM Huang RS The impact of the Cancer Genome Atlas on lung cancer Transl Res 2015 166 568 585 26318634 10.1016/j.trsl.2015.08.001 PMC4656061 5 Testa U Castelli G Pelosi E Lung cancers: molecular characterization, clonal heterogeneity and evolution, and cancer stem cells Cancers 2018 10 248 30060526 10.3390/cancers10080248 PMC6116004 6 Ruiz-Cordero R Devine WP Targeted therapy and checkpoint immunotherapy in lung cancer Surg Pathol Clin 2020 13 17 33 32005431 10.1016/j.path.2019.11.002 7 Herbst RS Morgensztern D Boshoff C The biology and management of non-small cell lung cancer Nature 2018 553 446 454 29364287 10.1038/nature25183 8 Lin JJ Shaw AT Resisting resistance: targeted therapies in lung cancer Trends Cancer 2016 2 350 364 27819059 10.1016/j.trecan.2016.05.010 PMC5091655 9 Wang M Herbst RS Boshoff C Toward personalized treatment approaches for non-small-cell lung cancer Nat Med 2021 27 1345 1356 34385702 10.1038/s41591-021-01450-2 10 Sharma P Allison JP The future of immune checkpoint therapy Science 2015 348 56 61 25838373 10.1126/science.aaa8172 11 Passaro A Brahmer J Antonia S Managing resistance to immune checkpoint inhibitors in lung cancer: treatment and novel strategies J Clin Oncol 2022 40 598 610 34985992 10.1200/JCO.21.01845 12 Zhou F Qiao M Zhou C The cutting-edge progress of immune-checkpoint blockade in lung cancer Cell Mol Immunol 2021 18 279 293 33177696 10.1038/s41423-020-00577-5 PMC8027847 13 Binnewies M Roberts EW Kersten K Understanding the tumor immune microenvironment (TIME) for effective therapy Nat Med 2018 24 541 550 29686425 10.1038/s41591-018-0014-x PMC5998822 14 Hanahan D Weinberg RA The hallmarks of cancer Cell 2000 100 57 70 10647931 10.1016/s0092-8674(00)81683-9 15 Fane M Weeraratna AT How the ageing microenvironment influences tumour progression Nat Rev Cancer 2020 20 89 106 31836838 10.1038/s41568-019-0222-9 PMC7377404 16 Lee S Hong JH Kim JS Cancer-associated fibroblasts activated by miR-196a promote the migration and invasion of lung cancer cells Cancer Lett 2021 508 92 103 33775710 10.1016/j.canlet.2021.03.021 17 Liu T Zhou L Li D Cancer-associated fibroblasts build and secure the tumor microenvironment Front Cell Dev Biol 2019 7 60 31106200 10.3389/fcell.2019.00060 PMC6492564 18 Sahai E Astsaturov I Cukierman E A framework for advancing our understanding of cancer-associated fibroblasts Nat Rev Cancer 2020 20 174 186 31980749 10.1038/s41568-019-0238-1 PMC7046529 19 Yamamura Y Asai N Enomoto A Akt-Girdin signaling in cancer-associated fibroblasts contributes to tumor progression Cancer Res 2015 75 813 823 25732845 10.1158/0008-5472.CAN-14-1317 20 Erez N Truitt M Olson P Cancer-associated fibroblasts are activated in incipient neoplasia to orchestrate tumor-promoting inflammation in an NF-kappaB-dependent manner Cancer Cell 2010 17 135 147 20138012 10.1016/j.ccr.2009.12.041 21 Barrett RL Puré E Cancer-associated fibroblasts and their influence on tumor immunity and immunotherapy Elife 2020 9 e57243 33370234 10.7554/eLife.57243 PMC7769568 22 Mao X Xu J Wang W Crosstalk between cancer-associated fibroblasts and immune cells in the tumor microenvironment: new findings and future perspectives Mol Cancer 2021 20 131 34635121 10.1186/s12943-021-01428-1 PMC8504100 23 Teichgräber V Monasterio C Chaitanya K Specific inhibition of fibroblast activation protein (FAP)-alpha prevents tumor progression in vitro Adv Med Sci 2015 60 264 272 26057860 10.1016/j.advms.2015.04.006 24 Lee PJ Ho CC Ho H Tumor microenvironment-based screening repurposes drugs targeting cancer stem cells and cancer-associated fibroblasts Theranostics 2021 11 9667 9686 34646392 10.7150/thno.62676 PMC8490509 25 Wu F Fan J He Y Single-cell profiling of tumor heterogeneity and the microenvironment in advanced non-small cell lung cancer Nat Commun 2021 12 2540 33953163 10.1038/s41467-021-22801-0 PMC8100173 26 Maynard A McCoach CE Rotow JK Therapy-induced evolution of human lung cancer revealed by single-cell rna sequencing Cell 2020 182 1232 1251.e22 32822576 10.1016/j.cell.2020.07.017 PMC7484178 27 Lambrechts D Wauters E Boeckx B Phenotype molding of stromal cells in the lung tumor microenvironment Nat Med 2018 24 1277 1289 29988129 10.1038/s41591-018-0096-5 28 Zhang J Song C Tian Y Single-cell RNA sequencing in lung cancer: revealing phenotype shaping of stromal cells in the microenvironment Front Immunol 2021 12 802080 35126365 10.3389/fimmu.2021.802080 PMC8807562 29 Aran D Looney AP Liu L Reference-based analysis of lung single-cell sequencing reveals a transitional profibrotic macrophage Nat Immunol 2019 20 163 172 30643263 10.1038/s41590-018-0276-y PMC6340744 30 Yoshihara K Shahmoradgoli M Martínez E Inferring tumour purity and stromal and immune cell admixture from expression data Nat Commun 2013 4 2612 24113773 10.1038/ncomms3612 PMC3826632 31 Newman AM Liu CL Green MR Robust enumeration of cell subsets from tissue expression profiles Nat Methods 2015 12 453 457 25822800 10.1038/nmeth.3337 PMC4739640 32 Jiang P Gu S Pan D Signatures of T cell dysfunction and exclusion predict cancer immunotherapy response Nat Med 2018 24 1550 1558 30127393 10.1038/s41591-018-0136-1 PMC6487502 33 Yang W Soares J Greninger P Genomics of Drug Sensitivity in Cancer (GDSC): a resource for therapeutic biomarker discovery in cancer cells Nucleic Acids Res 2013 41 D955 D961 23180760 10.1093/nar/gks1111 PMC3531057 34 Maeser D Gruener RF Huang RS oncoPredict: an R package for predicting in vivo or cancer patient drug response and biomarkers from cell line screening data Brief Bioinform 2021 22 bbab260 34260682 10.1093/bib/bbab260 PMC8574972 35 Chen X Song E Turning foes to friends: targeting cancer-associated fibroblasts Nat Rev Drug Discov 2019 18 99 115 30470818 10.1038/s41573-018-0004-1 36 Chen Y McAndrews KM Kalluri R Clinical and therapeutic relevance of cancer-associated fibroblasts Nat Rev Clin Oncol 2021 18 792 804 34489603 10.1038/s41571-021-00546-5 PMC8791784 37 Gaggioli C Hooper S Hidalgo-Carcedo C Fibroblast-led collective invasion of carcinoma cells with differing roles for RhoGTPases in leading and following cells Nat Cell Biol 2007 9 1392 1400 18037882 10.1038/ncb1658 38 Goetz JG Minguet S Navarro-Lérida I Biomechanical remodeling of the microenvironment by stromal caveolin-1 favors tumor invasion and metastasis Cell 2011 146 148 163 21729786 10.1016/j.cell.2011.05.040 PMC3244213 39 Jacobetz MA Chan DS Neesse A Hyaluronan impairs vascular function and drug delivery in a mouse model of pancreatic cancer Gut 2013 62 112 120 22466618 10.1136/gutjnl-2012-302529 PMC3551211 40 Olivares O Mayers JR Gouirand V Collagen-derived proline promotes pancreatic ductal adenocarcinoma cell survival under nutrient limited conditions Nat Commun 2017 8 16031 28685754 10.1038/ncomms16031 PMC5504351 41 Kumar V Donthireddy L Marvel D Cancer-associated fibroblasts neutralize the anti-tumor effect of CSF1 receptor blockade by inducing PMN-MDSC infiltration of tumors Cancer Cell 2017 32 654 668.e5 29136508 10.1016/j.ccell.2017.10.005 PMC5827952 42 Biffi G Oni TE Spielman B IL1-induced JAK/STAT signaling is antagonized by TGFβ to shape CAF heterogeneity in pancreatic ductal adenocarcinoma Cancer Discov 2019 9 282 301 30366930 10.1158/2159-8290.CD-18-0710 PMC6368881 43 Cadamuro M Brivio S Mertens J Platelet-derived growth factor-D enables liver myofibroblasts to promote tumor lymphangiogenesis in cholangiocarcinoma J Hepatol 2019 70 700 709 30553841 10.1016/j.jhep.2018.12.004 PMC10878126 44 Jenkins BH Buckingham JF Hanley CJ Targeting cancer-associated fibroblasts: challenges, opportunities and future directions Pharmacol Ther 2022 240 108231 35718294 10.1016/j.pharmthera.2022.108231 45 Iozzo RV Matrix proteoglycans: from molecular design to cellular function Annu Rev Biochem 1998 67 609 652 9759499 10.1146/annurev.biochem.67.1.609 46 Iozzo RV The biology of the small leucine-rich proteoglycans. Functional network of interactive proteins J Biol Chem 1999 274 18843 18846 10383378 10.1074/jbc.274.27.18843 47 Campioni M Ambrogi V Pompeo E Identification of genes down-regulated during lung cancer progression: a cDNA array study J Exp Clin Cancer Res 2008 27 38 18793406 10.1186/1756-9966-27-38 PMC2556648 48 Yan Y Xu Z Qian L Identification of CAV1 and DCN as potential predictive biomarkers for lung adenocarcinoma Am J Physiol Lung Cell Mol Physiol 2019 316 L630 l643 30604627 10.1152/ajplung.00364.2018 49 Liang S Xu JF Cao WJ Human decorin regulates proliferation and migration of human lung cancer A549 cells Chin Med J 2013 126 4736 4741 24342321 50 Bozoky B Savchenko A Guven H Decreased decorin expression in the tumor microenvironment Cancer Med 2014 3 485 491 24634138 10.1002/cam4.231 PMC4101739 51 Schaefer L Tredup C Gubbiotti MA Proteoglycan neofunctions: regulation of inflammation and autophagy in cancer biology Febs j 2017 284 10 26 27860287 10.1111/febs.13963 PMC5226885 52 Sainio AO Järveläinen HT Decorin-mediated oncosuppression—a potential future adjuvant therapy for human epithelial cancers Br J Pharmacol 2019 176 5 15 29488209 10.1111/bph.14180 PMC6284329 53 Neill T Schaefer L Iozzo RV Oncosuppressive functions of decorin Mol Cell Oncol 2015 2 e975645 27308453 10.4161/23723556.2014.975645 PMC4905288 54 Goldoni S Seidler DG Heath J An antimetastatic role for decorin in breast cancer Am J Pathol 2008 173 844 855 18688028 10.2353/ajpath.2008.080275 PMC2527080 55 Buraschi S Neill T Goyal A Decorin causes autophagy in endothelial cells via Peg3 Proc Natl Acad Sci U S A 2013 110 E2582 E2591 23798385 10.1073/pnas.1305732110 PMC3710796 56 Biaoxue R Xiguang C Hua L Decreased expression of decorin and p57(KIP2) correlates with poor survival and lymphatic metastasis in lung cancer patients Int J Biol Markers 2011 26 9 21 21360479 10.5301/jbm.2011.6372 57 González-González L Alonso J Periostin: a matricellular protein with multiple functions in cancer development and progression Front Oncol 2018 8 225 29946533 10.3389/fonc.2018.00225 PMC6005831 58 Morra L Rechsteiner M Casagrande S Characterization of periostin isoform pattern in non-small cell lung cancer Lung Cancer 2012 76 183 190 22079858 10.1016/j.lungcan.2011.10.013 59 Li G Jin R Norris RA Periostin mediates vascular smooth muscle cell migration through the integrins alphavbeta3 and alphavbeta5 and focal adhesion kinase (FAK) pathway Atherosclerosis 2010 208 358 365 19695571 10.1016/j.atherosclerosis.2009.07.046 PMC2841688 60 Liu Y Huang Z Cui D The multiaspect functions of periostin in tumor progression Adv Exp Med Biol 2019 1132 125 136 31037631 10.1007/978-981-13-6657-4_13 61 Xu CH Wang W Lin Y Diagnostic and prognostic value of serum periostin in patients with non-small cell lung cancer Oncotarget 2017 8 18746 18753 27816968 10.18632/oncotarget.13004 PMC5386644 62 Zhang Y Yuan D Yao Y Predictive and prognostic value of serum periostin in advanced non-small cell lung cancer patients receiving chemotherapy Tumour Biol 2017 39 1010428317698367 28459197 10.1177/1010428317698367 63 Brigelius-Flohé R Maiorino M Glutathione peroxidases Biochim Biophys Acta 2013 1830 3289 3303 23201771 10.1016/j.bbagen.2012.11.020 64 Zhang J Liu Y Guo Y GPX8 promotes migration and invasion by regulating epithelial characteristics in non-small cell lung cancer Thorac Cancer 2020 11 3299 3308 32975378 10.1111/1759-7714.13671 PMC7606007 65 Chen H Xu L Shan ZL GPX8 is transcriptionally regulated by FOXC1 and promotes the growth of gastric cancer cells through activating the Wnt signaling pathway Cancer Cell Int 2020 20 596 33317536 10.1186/s12935-020-01692-z PMC7735419 66 Khatib A Solaimuthu B Ben Yosef M The glutathione peroxidase 8 (GPX8)/IL-6/STAT3 axis is essential in maintaining an aggressive breast cancer phenotype Proc Natl Acad Sci U S A 2020 117 21420 21431 32817494 10.1073/pnas.2010275117 PMC7474634 67 Xu YL Yuan LW Jiang XM Glutathione peroxidase 8 expression on cancer cells and cancer-associated fibroblasts facilitates lung cancer metastasis MedComm (2020) 2022 3 e152 35978854 10.1002/mco2.152 PMC9365937 68 Pitt JM Marabelle A Eggermont A Targeting the tumor microenvironment: removing obstruction to anticancer immune responses and immunotherapy Ann Oncol 2016 27 1482 1492 27069014 10.1093/annonc/mdw168 69 Yang J Chen J Wei J Immune checkpoint blockade as a potential therapeutic target in non-small cell lung cancer Expert Opin Biol Ther 2016 16 1209 1223 27426430 10.1080/14712598.2016.1214265 70 McGranahan N Rosenthal R Hiley CT Allele-specific HLA loss and immune escape in lung cancer evolution Cell 2017 171 1259 1271.e11 29107330 10.1016/j.cell.2017.10.001 PMC5720478 71 Schaafsma E Fugle CM Wang X Pan-cancer association of HLA gene expression with cancer prognosis and immunotherapy efficacy Br J Cancer 2021 125 422 432 33981015 10.1038/s41416-021-01400-2 PMC8329209 ",
  "metadata": {
    "Title of this paper": "Pan-cancer association of HLA gene expression with cancer prognosis and immunotherapy efficacy",
    "Journal it was published in:": "Journal of Immunotherapy (Hagerstown, Md. : 1997)",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479067/"
  }
}