{
  "title": "Paper_12",
  "abstract": "pmc Dig Dis Dig Dis 2985 kargersd DDI Digestive Diseases (Basel, Switzerland) 0257-2753 1421-9875 pmc-is-collection-domain yes pmc-collection-title Karger Author's Choice PMC12490832 PMC12490832.1 12490832 12490832 40659005 10.1159/000547392 547392 1 Liver Peri-Complication Diagnosis of Nonalcoholic Fatty Liver Disease: A US Population-Based Retrospective Analysis Peri-complication Diagnosis of Nonalcoholic Fatty Liver Disease 2794216 Manikat Richie  a 2794217 Tran Sally  a 2794218 Kam Leslie Yeeman  a 2794219 Dronamraju Deepti  a 2794220 Cheung Ramsey  a 2794221 Nguyen Mindie H.  a  b  a Palo Alto CA USA  b Stanford CA USA Correspondence to: Mindie H. Nguyen, mindiehn@stanford.edu 14 7 2025 10 2025 43 5 498211 582 592 12 1 2025 23 6 2025 2025 14 07 2025 03 10 2025 03 10 2025 © 2025 The Author(s). Published by S. Karger AG, Basel 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is licensed under the Creative Commons Attribution-NonCommercial 4.0 International License (CC BY-NC) ( https://karger.com/Services/OpenAccessLicense Abstract Introduction Screening guidelines for nonalcoholic fatty liver disease, now called metabolic dysfunction‐associated steatotic liver disease (MASLD), remain controversial, though early diagnosis can faciliate intervention and prevention. Methods A retrospective analysis of adult patients within the Merative™ Marketscan® Databases (1/2007-12/2021) with a diagnosis of MASLD, a liver complication (defined as HCC, cirrhosis with or without evidence of portal hypertension such as varices, ascites, and hepatic encephalopathy or liver transplant), and ≥12 months of insurance coverage prior to the first liver complication. Results We analyzed 143,310 patients meeting inclusion criteria. The majority (95,843, 66.8%, p p p p Conclusion Diagnosis of MASLD in real-world patients is severely delayed, with 2 in 3 patients diagnosed either after or within 6 months from a liver complication. Patients followed longitudinally by medical providers in gastroenterology and other metabolic specialties had a substantially lower risk of an early complication. Keywords Database analysis Early diagnosis Longitudinal care Primary prevention There is no external funding to disclose. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes accessibilitySummary WCAG 2.1 Level AA accessibility-pdf-ua-compliance yes Introduction Metabolic dysfunction-associated steatotic liver disease (MASLD), formerly known as nonalcoholic fatty liver disease, has a global prevalence of 30 percent with further rise due to increases in obesity and type 2 diabetes mellitus [ 1 2 3 Until recently, no FDA-approved medications existed for the treatment of nonalcoholic steatohepatitis (NASH) and the cornerstone of management remains a healthy diet and regular exercise which can improve liver histology provided adequate weight loss is achieved [ 4 4 5 6 7 Methods Study Design and Study Population This study is a retrospective analysis of patients within the Merative™ Marketscan ® 8 Study Definitions We defined the diagnosis of MASLD by the presence of the ICD-10 code K76.0 which is a diagnosis code for the old terminology of nonalcoholic fatty liver disease, given that the new nomenclature of MASLD is now the recommended terminology for this condition [ 9 https://doi.org/10.1159/000547392 Study Outcome The total study population was divided into two groups, the pericomplication group and the non-pericomplication group. We defined “pericomplication” as developing a liver disease-related complication within 6 months of the index diagnosis of MASLD. In other words, if the patient was diagnosed with MASLD and was then diagnosed with a complication in less than 6 months, or if the complication was diagnosed before the diagnosis of MASLD, the patient was considered “pericomplication.” Decompensated cirrhosis, HCC, or liver transplant were considered as liver disease-related complications. A negative time interval occurred when the patient presented with an acute decompensation event and workup later revealed that the underlying etiology was MASLD. The non-pericomplication group included patients with known diagnoses of MASLD and then developed a complication more than 6 months later. Other Variables Variables measured included age, sex, tobacco use, illicit drug use, presence of cardiovascular disease, chronic kidney disease, diabetes, and the Charlson Comorbidity Index (CCI) at the index diagnosis of MASLD. Other variables included the total number of outpatient visits to a primary care provider, a gastroenterology (GI) specialist and a non-GI metabolic specialist. Primary care providers were defined as providers engaged in the practice of family medicine, internal medicine, obstetrics/gynecology, or hospitalist medicine. We defined GI specialists as clinicians practicing GI and/or hepatology. We defined other non-GI metabolic specialists who frequently encounter patients with metabolic disease in their practice as practitioners in the field of cardiology, endocrinology, or nephrology. The time period from the first visit with any medical provider to the index diagnosis of MASLD was also collected, i.e., how long after a first visit with a provider was the patient diagnosed with MASLD. Statistical Analysis For the descriptive analysis, categorical variables were reported as counts and percentages, while continuous variables were reported either as mean and SD or median and interquartile range. Subgroups were compared using the Pearson chi-squared test for categorical variables and the Student’s t H p p This study was performed in accordance with the Declaration of Helsinki. This human study was approved by Institutional Review Board at Stanford University, Stanford, CA (Approval No. 13927). This study was based on data available from the Merative™ Marketscan ® The data in this study were obtained from the Stanford Center for Population Health Sciences (PHS) and restrictions may apply. Datasets may be made available from PHS at https://med.stanford.edu/phs/data.html Results Overall Study Population and Proportion of Patients with Pericomplication Diagnosis of MASLD The study population included 143,310 patients with a diagnosis of MASLD and at least one liver complication, namely decompensated cirrhosis, HCC, or liver transplant (online suppl. – Study flowchart). The mean age in the whole population was 56.3 ± 14.0 years and 53% of the population was female. Two-thirds of patients were diagnosed with MASLD less than 6 months before or even after the development of a liver complication, which was termed the pericomplication group, compared to the other one-third of patients that developed a complication more than 6 months after being diagnosed with MASLD (95,843 [66.8%] vs. 47,467 [33.1%], p Fig. 1 Fig. 1. Histogram of the time interval from the diagnosis of MASLD to a liver complication. Negative intervals signify that the liver complication occurred before the diagnosis of MASLD. MASLD, non-alcoholic fatty liver disease. Patients with a pericomplication diagnosis of MASLD were more likely to be older (57.6 ± 14.5 vs. 53.8 ± 12.5), have cardiovascular disease (13.7% vs. 5.5%), hypertension (72.2% vs. 68.4%), diabetes (45.7% vs. 43.2%), chronic kidney disease (16.7% vs. 7.1%), obesity (36.2% vs. 31.1%), tobacco use (18.7% vs. 12.6%), and illicit drug use (2.3% vs. 1.4%), all p Table 1 p Table 1. Demographic characteristics of MASLD patients with a liver complication (decompensated cirrhosis, HCC, or liver transplant), categorized by the presence of a peri-complication diagnosis of MASLD Characteristics Total Peri-complication diagnosis # Not a peri-complication diagnosis @  p  N  N  N Mean age (±SD), years 56.3±14.0 57.6±14.5 53.8±12.5 <0.0001 Sex Male 66,731 (46.6%) 46,037 (48.0%) 20,694 (43.6%) <0.001 Female 76,579 (53.4%) 49,806 (52.0%) 26,773 (56.4%) ​ Tobacco use 23,913 (16.7%) 17,941 (18.7%) 5,972 (12.6%) <0.001 Illicit drug use 2,917 (2.0%) 2,241 (2.3%) 676 (1.4%) <0.001 Cardiovascular disease* 15,692 (11.0%) 13,094 (13.7%) 2,598 (5.5%) <0.001 Hypertension 101,690 (71.0%) 69,223 (72.2%) 32,467 (68.4%) <0.001 Diabetes mellitus 64,318 (44.9%) 43,816 (45.7%) 20,502 (43.2%) <0.001 Overweight/obese 49,444 (34.5%) 34,692 (70.2%) 14,752 (29.8%) <0.001 CKD but not ESRD 14,124 (9.9%) 11,307 (11.8%) 2,817 (5.9%) <0.001 ESRD 5,270 (3.7%) 4,727 (4.9%) 543 (1.1%) ​ Median follow-up (range), years 3.3 (1.6–5.8) 2.6 (1.1–4.9) 4.7 (2.9–7.1) <0.0001 Charlson Comorbidity Index (CCI) Score 0 35,565 (24.8%) 20,675 (58.1%) 14,890 (41.9%) <0.001 Score 1 to 2 51,918 (36.2%) 32,742 (63.1%) 19,176 (36.9%) ​ Score 3 to 4 27,124 (18.9%) 19,155 (70.6%) 7,969 (29.4%) ​ Score ≥5 28,703 (20.0%) 23,271 (81.1%) 5,432 (18.9%) ​ Median CCI (IQR) 2 (1–4) 2 (1–4) 1 (0–3) <0.0001 CCI, Charlson Comorbidity Index; CKD, chronic kidney disease; ESRD, end-stage renal disease or on dialysis; HCC, hepatocellular carcinoma; IQR, interquartile range; MASLD, non-alcoholic fatty liver disease; SD, standard deviation.  #  @ *Cardiovascular disease – presence of a cerebrovascular accident or myocardial infarction. Among the liver-related complications experienced, 99.8% (143,081) of patients in the study population had decompensated cirrhosis, 1.3% (1,883) of patients had HCC and 0.1% (165) of patients underwent liver transplantation. The median number of outpatient visits prior to development of a complication were also noted ( Table 2 p Table 2. Median number of visits that patients made to primary care providers and specialists over the study period, categorized by the presence of a peri-complication diagnosis of MASLD ​ Total (median, IQR) Peri-complication diagnosis a Not a peri-complication diagnosis b  p Median number of visits made to a primary care provider c 28 (13–53) 26 (11–50) 33 (17–59) <0.0001 Median number of visits made to a GI specialist d 2 (0–5) 1 (0–5) 3 (0–6) <0.0001 Median number of visits made to a non-GI metabolic specialist e 3 (0–10) 3 (0–10) 4 (1–12) <0.0001 GI, gastrointestinal; HCC, hepatocellular carcinoma; MASLD, non-alcoholic fatty liver disease; IQR, interquartile range.  a  b  c  d  e On multivariable logistic regression, female sex and a visit with a GI or a metabolic specialist more than 12 months before a complication were associated with decreased odds of a pericomplication diagnosis of MASLD (female sex: aOR 0.89, 95% confidence interval [CI]: 0.87–0.91; any GI visit more than 12 months before complication: aOR 0.31, 95% CI 0.30–0.32; any non-GI metabolic specialist visit more than 12 months before complication: aOR 0.44, 95% CI: 0.42–0.45) ( Table 3 Table 3. Factors associated with a peri-complication diagnosis of MASLD a ​ Univariable analysis Multivariable analysis odds ratio 95% CI  p adjusted odds ratio 95% CI  p Age 1.02 1.01–1.03 <0.001 1.02 1.01–1.03 <0.001 Female sex 0.84 0.82–0.85 <0.001 0.89 0.87–0.91 <0.001 Charlson Comorbidity Index Score 0 1 (Ref) ​ ​ 1 (Ref) ​ ​ Score 1 to 2 1.22 1.19–1.26 <0.001 1.29 1.25–1.33 <0.001 Score 3 to 4 1.69 1.64–1.75 <0.001 1.86 1.79–1.94 <0.001 Score ≥5 3.14 3.03–3.26 <0.001 3.33 3.19–3.48 <0.001 GI specialist visit more than 12 months before complication ​ ​ No GI visit 1 (Ref) ​ ​ 1 (Ref) ​ ​ Any GI visit 0.27 0.26–0.28 <0.001 0.31 0.30–0.32 <0.001 Non-GI metabolic specialist visit more than 12 months before complication No non-GI metabolic specialist visit 1 (Ref) ​ ​ 1 (Ref) ​ ​ Any non-GI metabolic specialist visit 0.43 0.42–0.44 <0.001 0.44 0.42–0.45 <0.001 CI, confidence interval; GI, gastrointestinal; HCC, hepatocellular carcinoma; MASLD, non-alcoholic fatty liver disease.  a Subgroup Analyses Subgroup with Pericomplication HCC and by Age Subgroup analysis was performed to analyze the 1,889 patients in the total cohort with MASLD and HCC as a complication. The patients presenting with pericomplication HCC were older than the patients in the nonpericomplication group (64.9 ± 12.8 years vs. 62.0 ± 11.2 years, p Fig. 2 Fig. 2. Age distribution of patients with both MASLD and HCC, categorized by the presence of a peri-complication diagnosis of MASLD. Peri-complication diagnosis – a liver complication (decompensated cirrhosis, HCC, or liver transplant) was diagnosed less than 6 months after or even before MASLD itself was diagnosed. Not a peri-complication diagnosis – a liver complication (decompensated cirrhosis, HCC, or liver transplant) was diagnosed more than 6 months after MASLD was diagnosed. HCC, hepatocellular carcinoma; MASLD, non-alcoholic fatty liver disease. Subgroup by Time Period and by Age Patients were grouped into 3 time periods: 2007 to 2010, 2011 to 2015, and 2016 to 2021, which saw decreasing proportions of peri-complication diagnosis of MASLD from 82.7% in the earliest time period to 68.9% then 49.9% during the latest period, respectively ( Table 4 p Table 5 Fig. 3 Table 4. Characteristics of MASLD patients with a liver complication (decompensated cirrhosis, HCC, or liver transplant), categorized by time periods Time periods Total Peri-complication diagnosis a Not a peri-complication diagnosis b  p 2007–2010 33,581 27,775 (82.7%) 5,806 (17.3%) <0.001 2011–2015 70,228 48,363 (68.9%) 21,865 (31.1%) 2016–2021 39,501 19,705 (49.9%) 19,796 (50.1%)  a  b Table 5. Characteristics of patients with a peri-complication diagnosis of MASLD a ​ 2007–2010 2011–2015 2016–2021  p  N  N  N Mean age (±SD), years 58.8±14.3 58.4±14.6 54.0±13.8 <0.0001 Female sex 14,810 (53.3%) 25,066 (51.2%) 9,930 (50.4%) <0.001 Tobacco use 4,553 (16.4%) 10,395 (21.5%) 2,993 (15.2%) <0.001 Illicit drug use 560 (2.0%) 1,157 (2.4%) 524 (2.7%) <0.001 Cardiovascular disease b 3,127 (11.2%) 6,351 (13.1%) 3,616 (18.3%) <0.001 Hypertension 19,634 (70.7%) 36,055 (74.6%) 13,534 (68.7%) <0.001 Diabetes 13,023 (46.9%) 22,605 (46.7%) 8,188 (41.6%) <0.001 Overweight/obese 7,054 (20.3%) 17,593 (50.7%) 10,045 (29.0%) <0.001 CKD but not ESRD 2,972 (10.7%) 6,270 (13.0%) 2,065 (10.5%) <0.001 ESRD 1,525 (5.5%) 2,440 (5.0%) 762 (3.9%) Median CCI (IQR) 2 (1–4) 2 (1–5) 2 (0–4) 0.0001 CCI, Charlson Comorbidity Index; CKD, chronic kidney disease; ESRD, end-stage renal disease or on dialysis; IQR, interquartile range.  a  b Fig. 3. Age distribution of the patients with a peri-complication diagnosis of MASLD @ @ Subgroup by Care Provider Type There were significant differences in the distribution of pericomplication diagnosis proportion by the length of time between the initial visit to primary care, GI or metabolic specialist to the time of the first liver complication, with a higher proportion of pericomplication diagnosis seen among patients with a shorter time lag between the first visit to any of the care provider type and then developing a liver complication (online suppl. Table 4, all p For primary care visits, higher proportions of pericomplication diagnosis were observed with shorter time lag between first visit to developing complication (e.g., 14.3% vs. 4.3% if less than 12 months, 14.9% vs. 7.4% if 12–18 months), and a higher proportion of non-pericomplication diagnosis was only observed when patients had their first visit with primary care providers more than 36 months before developing a complication (66.1% vs. 42.1%). For first GI and non-GI metabolic specialist visits, the proportions of pericomplication diagnosis and non-pericomplication diagnosis were 43.9% and 32.7% compared with 21.6% and 17.2% if the visits were less than 12 months from developing complications, respectively, while the corresponding proportions were in an opposite direction, 25.4% and 30.4% compared to 45.1% and 50.5% if the first visits were more than 36 months before the development of complication. Factors Associated with Pericomplication Diagnosis of MASLD On multivariable logistic regression adjusted for age, sex, and CCI ( Table 3 p p In a subgroup analysis of patients whose liver complication was HCC, also adjusted for age, sex, and CCI (online suppl. Table 6), we observed similar findings with having a first visit with a GI specialist (aOR 0.23, 95% CI 0.18–0.30, p p Discussion Our findings from this large retrospective nationwide cohort study demonstrate a severe care gap, with two-thirds of patients developing a liver complication of MASLD less than 6 months after they are diagnosed with MASLD itself. Only 1 in 3 patients were diagnosed with MASLD 6 months or more prior to the development of a complication to allow for some time to modify their risk factors for disease progression. These results are consistent with and even more sobering than those from prior studies analyzing pericomplication diagnosis of hepatitis B [ 6 7 10 11 Furthermore, more than half of the patients in our study presented with a complication such as decompensated cirrhosis, HCC or underwent liver transplant before even being diagnosed with MASLD, despite having had private insurance coverage for at least 1 year prior to the complicating event. A lack of health insurance is often posited as a reason for underdiagnosis [ 12 13 14 We also determined several risk factors that are associated with a delayed diagnosis of MASLD including older age, higher number of comorbidities, male sex, and lack of specialist visits (GI or other metabolic specialists). We found that age, a known risk factor for the development of complications, is also associated with a delayed diagnosis of MASLD. It is possible that older patients may have more acute medical problems and concerns that supersede the ability of clinicians to detect asymptomatic conditions like MASLD during clinic visits. As noted, the use of focused algorithms to diagnose MASLD earlier based on the identified risk factors may result in an earlier diagnosis and allow adequate time for intervention while being highly cost-effective [ 11 15 16 Though the association between metabolic syndrome and MASLD has been known for decades [ 17 17 In patients with MASLD, the rate of progression to decompensated cirrhosis is only about 3 percent over 15 years [ 18 19 20 1 Another important reason for timely diagnosis of MASLD is to identify patients who may need HCC surveillance as NASH is a rising etiology of HCC [ 21 22 An encouraging finding from our study was that a greater number of visits with medical providers were protective against a delayed diagnosis of MASLD. More visits would likely allow more time for investigation of mildly abnormal liver tests or possibly screening for MASLD in the setting of other metabolic risk factors. Importantly, the greater the number of outpatient visits to either primary care, GI specialists or non-GI metabolic specialists, the less likely that the diagnosis of MASLD was delayed. This data supports encouraging regular follow-up visits, which will likely decrease delays in diagnosis and ultimately lead to alleviating the morbidity and mortality associated with MASLD. An increased number of visits to specialists in the fields of GI, endocrinology, cardiology and nephrology were found to decrease the odds of a delayed diagnosis of MASLD, which may be, in part, due to selection bias implicit in the patients receiving specialist care. However, while increasing specialist coverage may improve the detection of MASLD, it is likely not practical on a population level due to higher costs, the availability of specialists, and increased logistical challenges. Additionally, early diagnosis of MASLD is especially important as more treatment options for MASLD become available. Once the complications of MASLD develop, healthcare costs can be significant due to hospitalizations and treatment interventions. MASLD has been found to be associated with an increased risk of 30-day hospital readmissions even when compared to other chronic liver diseases such as alcohol-related liver disease and viral hepatitis, along with higher cost and in-hospital mortality rates [ 23 The strengths of our study include its large national cohort of real-world data and detailed examination of the timespan between the index diagnosis of MASLD and the development of a complication. Analyses were performed to find the most important risk factors contributing to delays in the diagnosis of MASLD. We used well-defined meaningful clinical events and retrospectively determined timing of the diagnosis of MASLD. Since all patients have health insurance, the study also avoids the impact of delayed diagnosis due to lack of healthcare coverage. Limitations of the study include its dependence on the treating clinicians to code the diagnosis at the time it presented and factors inherent to a claims-based database such as changing eligibility requirements for enrollment in insurance plans. The data are also specific to the USA and to populations with private health insurance, so further studies are needed to evaluate the care cascade of MASLD in other populations and world regions though the care gaps are likely to be even greater in uninsured populations or in more resource limited regions. The study relied on ICD codes which could be miscoded or undercoded, but the Marketscan Databases are large with careful procedures for data curation and maintenance to help minimize potential biases. The change in nomenclature of NAFLD to metabolic dysfunction‐associated steatotic liver disease (MASLD) [ 9 Conclusion Diagnosis of MASLD in real-world patients is severely delayed, with 2 in 3 patients diagnosed either after or within 6 months from a liver complication. Patients followed longitudinally by medical providers in GI and other metabolic specialties for 1 year or greater had a lower risk of a delayed diagnosis. Early diagnosis and continued follow-up of MASLD does delay the risk of developing the devastating complications of this condition. Statement of Ethics This study was performed in accordance with the Declaration of Helsinki. This human study was approved by Institutional Review Board at Stanford University, Stanford, CA (Approval No. 13927). This study was based on data available from the Merative™ Marketscan ® Conflict of Interest Statement Mindie H. Nguyen: research support: Pfizer, Enanta, Gilead, Glycotest, Vir, B.K. Kee Foundation, National Cancer Institute. Advisory board/consulting: Janssen, Spring Bank, Gilead, Novartis, Bayer, Eisai, Eli Lilly, Exact Sciences, Laboratory of Advanced Medicine, Helio Health, Intercept. The other authors have no disclosures. Funding Sources There is no external funding to disclose. Author Contributions R.M.: study design, data analysis and interpretation, and primary drafting of the manuscript. S.T.: data collection, data analysis and interpretation, and drafting of the manuscript. L.Y.K.: data collection, data interpretation, and manuscript revision. D.D.: data interpretation and manuscript revision. R.C.: study design, data analysis and interpretation, and manuscript revision. M.H.N.: study concept, study supervision, study design, data analysis and interpretation, and drafting of the manuscript. All authors approved the final draft of the manuscript as well as the authorship list. Data Availability Statement Data were obtained from the Stanford Center for Population Health Sciences (PHS), and restrictions may apply. Datasets may be made available from PHS at https://med.stanford.edu/phs/data.html Supplementary Material References 1. Younossi ZM Golabi P Paik JM Henry A Van Dongen C Henry L The global epidemiology of nonalcoholic fatty liver disease (NAFLD) and nonalcoholic steatohepatitis (NASH): a systematic review Hepatology 2023 77 4 1335 47 36626630 10.1097/HEP.0000000000000004 PMC10026948 2. Estes C Razavi H Loomba R Younossi Z Sanyal AJ Modeling the epidemic of nonalcoholic fatty liver disease demonstrates an exponential increase in burden of disease Hepatology 2018 67 1 123 33 28802062 10.1002/hep.29466 PMC5767767 3. Rinella ME Neuschwander-Tetri BA Siddiqui MS Abdelmalek MF Caldwell S Barb D AASLD practice guidance on the clinical assessment and management of nonalcoholic fatty liver disease Hepatology 2023 77 5 1797 835 36727674 10.1097/HEP.0000000000000323 PMC10735173 4. Vilar-Gomez E Martinez-Perez Y Calzadilla-Bertot L Torres-Gonzalez A Gra-Oramas B Gonzalez-Fabian L Weight loss through lifestyle modification significantly reduces features of nonalcoholic steatohepatitis Gastroenterology 2015 149 2 367 e15 25865049 10.1053/j.gastro.2015.04.005 5. Harrison SA Bedossa P Guy CD Schattenberg JM Loomba R Taub R A phase 3, randomized, controlled trial of resmetirom in NASH with liver fibrosis N Engl J Med 2024 390 6 497 509 38324483 10.1056/NEJMoa2309000 6. Lapointe-Shaw L Chung H Holder L Kwong JC Sander B Austin PC Diagnosis of chronic hepatitis B pericomplication: risk factors and trends over time Hepatology 2021 73 6 2141 54 32931613 10.1002/hep.31557 7. Lapointe-Shaw L Chung H Sander B Kwong JC Holder L Cerocchi O Peri-complication diagnosis of hepatitis C infection: risk factors and trends over time Liver Int 2021 41 1 33 47 32956567 10.1111/liv.14670 8. Stanford Center for Population Health Sciences MarketScan databases (version 3.0) Redivis 2023 9. Rinella ME Lazarus JV Ratziu V Francque SM Sanyal AJ Kanwal F A multi-society Delphi consensus statement on new fatty liver disease nomenclature Ann Hepatol 2024 29 1 101133 37364816 10.1016/j.aohep.2023.101133 10. Li J Le MH Barakat MT Cheung RC Nguyen MH The changing epidemiology of liver disease among US children and adolescents from 1999 to 2016 Am J Gastroenterol 2021 116 10 2068 78 34328446 10.14309/ajg.0000000000001386 11. Ginès P Castera L Lammert F Graupera I Serra-Burriel M Allen AM Population screening for liver fibrosis: toward early diagnosis and intervention for chronic liver diseases Hepatology 2022 75 1 219 28 34537988 10.1002/hep.32163 12. Saab S Manne V Nieto J Schwimmer JB Chalasani NP Nonalcoholic fatty liver disease in latinos Clin Gastroenterol Hepatol 2016 14 1 5 e10 25976180 10.1016/j.cgh.2015.05.001 13. Hussain A Patel PJ Rhodes F Srivastava A Patch D Rosenberg W Decompensated cirrhosis is the commonest presentation for NAFLD patients undergoing liver transplant assessment Clin Med 2020 20 3 313 8 10.7861/clinmed.2019-0250 PMC7354028 32414722 14. Bassegoda O Olivas P Turco L Mandorfer M Serra-Burriel M Tellez L Decompensation in advanced nonalcoholic fatty liver disease may occur at lower hepatic venous pressure gradient levels than in patients with viral disease Clin Gastroenterol Hepatol 2022 20 10 2276 86.e6 34688952 10.1016/j.cgh.2021.10.023 15. Blais P Husain N Kramer JR Kowalkowski M El-Serag H Kanwal F Nonalcoholic fatty liver disease is underrecognized in the primary care setting Am J Gastroenterol 2015 110 1 10 4 24890441 10.1038/ajg.2014.134 16. Abu-Freha N Cohen B Weissmann S Hizkiya R Abu-Hammad R Taha G Comorbidities and outcomes among females with non-alcoholic fatty liver disease compared to males Biomedicines 2022 10 11 2908 36428478 10.3390/biomedicines10112908 PMC9687768 17. Marchesini G Bugianesi E Forlani G Cerrelli F Lenzi M Manini R Nonalcoholic fatty liver, steatohepatitis, and the metabolic syndrome Hepatology 2003 37 4 917 23 12668987 10.1053/jhep.2003.50161 18. Allen AM Therneau TM Ahmed OT Gidener T Mara KC Larson JJ Clinical course of non-alcoholic fatty liver disease and the implications for clinical trial design J Hepatol 2022 77 5 1237 45 35843374 10.1016/j.jhep.2022.07.004 PMC9974107 19. Canivet CM Costentin C Irvine KM Delamarre A Lannes A Sturm N Validation of the new 2021 EASL algorithm for the noninvasive diagnosis of advanced fibrosis in NAFLD Hepatology 2023 77 3 920 30 35822302 10.1002/hep.32665 20. Wong VWS Zelber-Sagi S Cusi K Carrieri P Wright E Crespo J Management of NAFLD in primary care settings Liver Int 2022 42 11 2377 89 35986897 10.1111/liv.15404 21. Younossi Z Stepanova M Ong JP Jacobson IM Bugianesi E Duseja A Nonalcoholic steatohepatitis is the fastest growing cause of hepatocellular carcinoma in liver transplant candidates Clin Gastroenterol Hepatol 2019 17 4 748 55.e3 29908364 10.1016/j.cgh.2018.05.057 22. Singal AG Pillai A Tiro J Early detection, curative treatment, and survival rates for hepatocellular carcinoma surveillance in patients with cirrhosis: a meta-analysis Med 2014 11 4 e1001624 10.1371/journal.pmed.1001624 PMC3972088 24691105 23. Paik JM Eberly KE Kabbara K Harring M Younossi Y Henry L Non-alcoholic fatty liver disease is associated with greater risk of 30-day hospital readmission in the United States (U.S.) Ann Hepatol 2023 28 4 101108 37088421 10.1016/j.aohep.2023.101108 ",
  "metadata": {
    "Title of this paper": "Non-alcoholic fatty liver disease is associated with greater risk of 30-day hospital readmission in the United States (U.S.)",
    "Journal it was published in:": "Digestive Diseases (Basel, Switzerland)",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490832/"
  }
}