{
  "title": "Paper_469",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12484879 PMC12484879.1 12484879 12484879 41027960 10.1038/s41598-025-09251-0 9251 1 Article Production, characterization and yield optimization of biodiesel from waste neem Melia azadirachta Zuhanee Md. Khalid Al 4 Rahman Md. Mahmudur shamrat.acce@gmail.com 1 Hassan Md. Mahafujul 4 Hossain Md. Ismail 1 Ghos Bijoy Chandra 1 Rana G. M. Masud 1 Hossain Md. Saddam 2 Ahmed Nasim 3 Rahman Mohammad Nurur 4 Yeasmin Mst. Sarmina 1 1 https://ror.org/03njdre41 grid.466521.2 0000 0001 2034 6517 BCSIR, Rajshahi Laboratory, Bangladesh Council of Scientific and Industrial Research (BCSIR), 2 https://ror.org/03njdre41 grid.466521.2 0000 0001 2034 6517 Institute of Technology Transfer and Innovation (ITTI), Bangladesh Council of Scientific and Industrial Research (BCSIR), 3 https://ror.org/03njdre41 grid.466521.2 0000 0001 2034 6517 Institute of Energy Research and Development (IERD), Bangladesh Council of Scientific and Industrial Research (BCSIR), 4 https://ror.org/049ysg747 grid.443086.d 0000 0004 1755 355X Department of Chemical and Food Process Engineering, Rajshahi University of Engineering and Technology (RUET), 30 9 2025 2025 15 478255 33913 15 4 2025 26 6 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ The burning of excessive fossil fuel produces a high amount of noxious compounds, posing significant threats to environmental and human health. However, to elucidate these problems in this study biodiesel was produced from the locally available dropdown neem (Melia azadirachta Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-09251-0. Keywords Neem seed oil Biodiesel and renewable energy Transesterification and calorific value Sustainable environmental protection Subject terms Chemistry Energy science and technology https://doi.org/10.13039/501100005999 Bangladesh Council of Scientific and Industrial Research G.O. 39.02.0000.011.14.169.2023/877 G.O. 39.02.0000.011.14.169.2023/877 G.O.39.02. 0000.011.14.180.2024/1116 G.O.39.02. 0000.011.14.180.2024/1116 G.O. 39.02.0000.011.14.169.2023/877 Rahman Md. Mahmudur Hossain Md. Ismail Ghos Bijoy Chandra Rana G. M. Masud Yeasmin Mst. Sarmina pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction To meet the luxurious life style as well as the massive demand of the growing population nowadays we are enormously reliant on various fossil based hazardous materials 1 3 4 6 7 2 8 So this particular problem should be solved urgently by replacing the hazardous fossil fuels by biobased ecofriendly energy sources/fuels for the sustainable environmental protection. While biodiesel, primarily derived from naturally occurring plant materials, can serve as an alternative to fossil fuels, it stands out as a renewable energy source, especially as the demand for fossil fuels decreases. Plus, it has the potential to enhance a nation’s socioeconomic value 9 10 11 12 13 14 15 16 18 19 20 21 22 23 24 1 8  Fig. 1 Global energy consumption in 2023. Data taken from (IEA, 2024) 8 After over 350 oil-bearing crops were examined, some of them were suitable to be taken into consideration as possible diesel engine alternative fuels 11 Melia azadirachta 25 26 28 1  Table 1 Comparative study of this work with others addressing the production of biodiesel from different natural sources indicating the name of seed oil, method of production, name of the catalyst, and yield percent of biodiesel with relevant references. Serial no Name of the seed Method of production Name of the catalyst Yield of biodiesel (%) References 1. Castor seed oil Microwave irradiation NaHSO 4 2 74  29 2. Mahua oil Ultrasonic KOH 97.4  30 3. Palm oil Catalytic cracking HZSM-5 1.20  31 4. Neem seed oil Catalytic transesterification KOH 86 This study Though, a limited number of works has been done on the production of biodiesel from different sources. But biodiesel production from the specific species of Melia azadirachta Experimental Materials Unripe fresh neem seeds specious of Melia azadirachta 3 3 2 2 3 2 Method for extraction of neem oil from neem seeds First, clean water was used to wash the entire neem seed. Next, it was dried in a microwave oven set to 105 °C for 24 h of retention. In a grinder, whole dried neem seeds were pulverized. After the material was sieved, it was confirmed that every particle was less than 5 mm. The analytical balance was then used to weigh 50 g of neem powder. Filter paper was used to hold this sample. A stapler pin was then used to seal it. The soxhlet chamber was filled with the sample. A 300 mL round-bottom flask containing the solvent n-hexane was filled. After heating n-hexane to 70 °C, the extraction process took almost two hours 32 2  Fig. 2 Extraction procedure of neem oil from the collected neem seeds by conducting soxhlet apparatus during the experimental sessions. Noteworthy that the yield percent (%) of the extracted neem seed oil can be measured by using the following equation (Eq. 1 1 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:Yield\\:\\left(wt\\%\\right)=\\frac{Mass\\:of\\:extracted\\:oil}{Initial\\:mass\\:of\\:fed}\\times\\:100$$\\end{document} Methods of physicochemical parameters analysis of the extracted neem oil Acid value determination 1.4028 g of KOH was thoroughly mixed with 100 mL of distilled water into a conical flask so that it does dissolve in water. Additional amount of water added to make 250 mL solution. 50 mL from this solution was taken into burette. 10 mL of absolute ethanol shifted into conical flask and some drop of phenolphthalein indicator was added into it. Then ethanol was neutralized to do blank titration by adding 0.1 N KOH solution drop wise from burette until light pink color was just attained. At this time burette reading was 0.1 mL. After this 2 g of extracted neem seed oil was taken into another conical flask. Then neutralized abs. ethanol was mixed with this amount of oil by ultrasonic bath where temperature was 60 °C and heating time was 20 min. 2/3 drops phenolphthalein indicator was added with oil sample.0.1 N KOH solution was added drop wise from burette into the oil sample until light pink color attained. At that time burette reading was 1.4. Acid value can be measured by the following equation (Eq. 2 2 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:Acid\\:Value\\:\\left(AV\\right)=\\frac{(S-B)\\times\\:N\\times\\:M}{W}$$\\end{document} Where, S = Volume of KOH (mL) required in titration; B = Volume of KOH (mL) required in blank titration; N = Normality of KOH; M = Molecular weight of KOH; W = Weight of sample. Free fatty acid determination Free fatty acid content (FFA) can be determined by the following equation (Eq. 3 3 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:\\%\\:FFA=\\frac{Acid\\:Value}{2}$$\\end{document} Biodiesel production and analysis The significant route of production of biodiesel from the extracted neem seed oil by employing the prominent method namely transesterification and solvent washing has been described below. For better clarity the flow diagram along with the required chemical reaction have also been presented. Transesterification of neem seed oil In the context of biodiesel, transesterification is a chemical reaction that is commonly used to produce mono esters (biodiesel) and glycerol by reacting triglycerides and alcohol (Sekhar et al. 2009). Transesterification can be represented by (Eq. 4  4 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\text{Triglyceride}} + {\\text{Alcohol}}\\xrightarrow{{catalyst}}{\\text{Biodiesel}}\\;\\left( {{\\text{Fatty}}\\;{\\text{acid}}\\;{\\text{methyl}}/{\\text{ethyl}}\\;{\\text{ester}}} \\right) + {\\text{Glycerol}}$$\\end{document} The base catalyzed transesterification was carried out using 10 mL of neem oil in a magnetic stirrer. The alcohol and catalyst used was methanol and potassium hydroxide (KOH) respectively. Potassium hydroxide (KOH) was selected as the catalyst for transesterification due to its high catalytic activity, cost-effectiveness, and ability to tolerate moderate levels of free fatty acids. Its efficiency in promoting the conversion of triglycerides to methyl esters has been well-documented in literature. However, one known drawback of alkali catalysts like KOH is the possibility of soap formation when free fatty acids are present, which can hinder separation and reduce biodiesel yield. Although soap formation was not quantitatively measured in this study, its potential influence on the reaction efficiency is acknowledged. Similarly, while methanol was used in excess to drive the reaction forward, no methanol recovery was performed, and the recovery rate was not quantified. These aspects are considered limitations of the current study and are identified as targets for future optimization and sustainability assessments. Due to the more reactive and less expensive methanol (CH 3 3  Fig. 3 Separation procedure of the newly produced biodiesel during the experimental sessions. Washing of biodiesel The biodiesel was washed to remove impurities and water soluble contaminants. Biodiesel and water was mixed together in a conical flask. After phase separation, the biodiesel layer was washed three times with warm distilled water (20% v/v of biodiesel). Each wash involved 2 min of stirring, followed by 15 min of settling to remove residual catalyst, glycerol, and water-soluble impurities. The washed biodiesel was dried at 105 °C for 30 min to eliminate moisture, adhering to American Society for Testing and Materials (ASTM) D6751 standards. However, for better understanding the scope, contribution, novelty, selectivity, and significances of the applied method as well as to stand out the originality of this current study, the overall experimental process addressing the extraction of neem oil, production of biodiesel, and processing of the newly produced crude biodiesel by following the beneficial purification methods during the real-time experimental session has been shown in Fig. 4  Fig. 4 Schematic flow diagram regarding the route of production of biodiesel from neem seed oil by employing a series of chemical reaction and physical process as well as purification steps during the real-time experimental sessions. Biodiesel analysis Different types of significant physical and chemical properties including density, viscosity, specific gravity, refractive index, peroxide value, para-anisidine, calorific value, etc., were investigated by ASTM standard protocol. However, for better understanding a short description of these particular methods including the experimental conditions have been provided below: Density measurement The density was determined by measuring the mass and volume of each sample. The mass of test sample was measured to an accuracy of 0.0001 g by using an analytical balance. And the volume was measured by measuring cylinder. Temperature of the sample can affect density 33 5  5 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:Density,\\:\\rho\\:=\\frac{Weight\\:of\\:sample}{Volume\\:of\\:sample}(g/cc)$$\\end{document} Specific gravity Specific gravity gives information about any substance is how much lighter or denser comparing with the density of water. It provides clear insight about fluid behavior of biodiesel. Specific gravity (S.G) was measured by using the following equation (Eq. 6  6 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$Specific\\;gravity\\;(SG) = \\frac{{Density\\;of\\;oil}}{{Density\\;of\\;water}}$$\\end{document} Refractive index Refractive index method determines light bending or refraction when light enters that medium or exits. Refractive index assesses the valuable insight about the purity and overall quality of biodiesel. Refractive index was determined by using digital refractometer (Model number: DR 102, China) with high accuracy by maintaining the protocol of ASTMD1218. Peroxide value 2 g of biodiesel sample was taken in a 250 mL conical flask. 25 mL chloroform to acetic acid (2:3) mixture was added with the sample. 1 mL of saturated KI solution was added with sample. Then the conical flask was shacked for 1 min and kept it for 5 min in a dark place. Side wall of flask was washed by distilled water. 0.5 mL of 1% starch solution was added with the sample very carefully. Then titration was done using 0.05 N Na 2 2 3 2 7 34  7 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:Peroxide\\:value\\:\\left(PV\\right)=\\frac{\\left(S-B\\right)\\times\\:N}{W}\\,(meq/kg)$$\\end{document} Where: S = Volume of Na 2 2 3 2 2 2 3 2 2 2 3 2 Para-anisidine The para-anisidine value (PAV) is a measure of the oxidation products in fats and oils, including biodiesel. It assesses the degree of oxidative degradation and is an important parameter to evaluate the stability and quality of biodiesel. The determination procedure was done by conducting a special types of CDR Foodlab Analyzer device by maintaining the protocol of ASTM D4492. Calorific value Calorific value, sometimes called heating value or energy value, is the amount of energy generated during the whole burn of a fuel. It is an important factor to consider while evaluating the effectiveness and acceptability of various fuels for different purposes 35 36 8 8 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\:Q=-\\:\\text{m}\\:\\text{c}\\:{\\Delta\\:}\\:\\text{T}$$\\end{document} Where, ‘m’ is mass of water, ‘c’ is the specific heat capacity of the water and ‘ΔT’ is measured temperature change. Viscosity analysis Viscosity can be described as resistance to flow. Viscosity is an important physical properties of biodiesel. Higher viscosity can show adverse effect in case of performance of engine and can causes higher energy demand 37 Gas chromatography analysis One of the most recognized and sophisticated analytical techniques for separating and evaluating components in a mixture is gas chromatography. Gas chromatography enables it to be feasible to with accuracy and delicately analyze heterogeneous mixtures. In this study GC (which have a model number: Shimadzu GC-2010 plus, country of origin: Japan) has been used for analyzing the subjected sample of biodiesel. The sample was injected into a heated column, and specific components were carried out by the inert gas acting as a mobile phase 38 39 FTIR analysis FTIR-ATR is one of the most known method that has been widely used for identification of specific functional groups within a sample and to know molecular bonds and arrangements 40 42 43 44 -1 -1 45 46 47 48 Results and discussions Analysis of extracted neem oil Yield of oil have influence on production of biodiesel. But yield of oil can vary depending on type of species and maturity of the seeds 49 Melia azadirachta Free fatty acid (FFA) and acid value (AV) FFA and AV are important factor of oil. Lower FFA and AV means higher shelf life of oil 50 51 Factor affecting production of biodiesel Due to low FFA and AV direct transesterification was done to produce the biodiesel. Molar ratio of alcohol to oil, reaction time, amount of catalysts, stirring speed, and temperature influence the transesterification process 52 5  Fig. 5 Optimization the significant effects of the influencing factors. a b c d e Effect of molar ratio of oil to methanol The molar ratio of oil to methanol had a major influence on the synthesis of biodiesel from neem seed oil. This ratio was a key indicator because it controlled the availability of reactants throughout the transesterification process. Neem seed oil includes triglycerides, and the molar ratio determined how much methanol molecules were mixed with these triglycerides to produce biodiesel and glycerol. At molar ratio of 1:02 reaction didn’t start might be because of lack of methanol solution. While molar ratio was at 1:03 showing increment of biodiesel yield. When the molar ratio of oil to methanol was 1:06, highest yield of biodiesel had been achieved which was about 86% when other influential parameters were fixed at their optimum level (in Fig. 5 53 Effect of catalyst weight (%) Catalyst (KOH) facilitated conversion of triglyceride in the oil to biodiesel and glycerol. Optimal weight% of KOH was important for efficient conversion rate and achieving high yield. In this Fig. 5 54 Effect of time Change of reaction time was also a critical aspect of transesterification process influenced by the intricate kinetics of the transesterification process. The time parameter directly affected the extent of conversion of triglycerides into biodiesel and glycerol. Adequate reaction time was essential for complete conversion, which ensured optimal yield and purity of the biodiesel product. Effect of reaction time studied ranging from 60 to 150 mints. Beginning of the process as the time was increasing yield of biodiesel also started to increase. Figure 5 55 Effect of variation of stirrer speed The stirring speed directly affected the mass transfer and mixing efficiency during the transesterification reaction between the neem oil and methanol in the presence of a catalyst. Magnetic stirrer was used for the production of biodiesel. And the production was carried out by varying stirring speeds: 250, 400, 500, and 750 revolution per minute (rpm). The optimal stirring speed, more than 500 rpm ensured the effective dispersion of reactants, promote greater contact between the neem seed oil and methanol molecules. This enhanced interaction facilitated the conversion of triglycerides into biodiesel and glycerol. However, excessive stirring (more than 500 rpm) was led to energy inefficiency and unnecessary turbulence, while inadequate stirring (less than 500 rpm) was resulted in incomplete mixing and it reduced reaction rates (in Fig. 5 Effect of temperature Temperature also affected the overall reaction kinetics and fluid properties during the transesterification process. Higher temperatures generally accelerated the reaction rate, led to faster conversion of triglycerides into biodiesel and glycerol. However, excessively high temperatures like more than 65 °C were promoted side reactions and caused thermal degradation of the biodiesel product. That’s why the yield of biodiesel was lower at those conditions. On the other hand, lower temperatures like less than 60 °C was responsible for the result in sluggish reaction rates and incomplete conversion. When the temperature was 60 °C and 65 °C, we have got the higher yield of biodiesel (in Fig. 5 FTIR analysis of biodiesel and neem seed oil FTIR-ATR analysis gives important information about presence of functional group with the particular peak. Here at the Fig. 6 2 − 1 56 57 − 1 58 − 1 59 60 − 1 − 1 41 42 − 1 − 1 42 61 63 2  Fig. 6 Comparative FTIR-ATR spectra of the subjected neem seed oil, and biodiesel samples at 400 to 4000 cm -1  Table 2 FTIR-ATR analysis showing the most responsible functional groups of the subjected neem seed oil and biodiesel samples including their particular peaks. Serial no. Neem seed oil peaks (cm -1 Biodiesel peaks (cm -1 Respective functional group 1. 3500 –3000 3500–2950 N–H of Amine 2. 3000–2850 2950–2760 C–H stretching 4. 1770.1 1800 C=O stretching of ester 5. 1600–1390 1600 –1400 C=C 6. …………. 1250–1000 C–O stretching vibration of ester 7. …………. 900–800 C–H bending of 1,3- disubstituted 8. 790.1 749.01 N–O 9. 740–500 540 C–H in aromatic ring 10. 446.03 440.05 S–S stretching Fatty acid profiling of newly produced biodiesel by GC analysis When separating and identifying chemicals in a sample, gas chromatography (GC) analysis is a potent analytical method GC analysis widely used in case of determining Fatty Acid Methyl Ester (FAME). The obtained findings addressing the saturated, and unsaturated (both mono and poly unsaturated) fatty acid methyl ester of the newly produced biodiesel sample according to the GC analysis have been shown in Fig. 7 3 4 5  Fig. 7 GC analysis of the newly produced biodiesel sample at 2 to 30 min retention time during the experimental session. methyl esters into the spectra of the subjected biodiesel are clearly observed from the above figure (Fig. 6 3 4 5  Table 3 A list of observed saturated fatty acids in the newly produced biodiesel sample according to the GC analysis. Serial no. Chain length Systematic name Trivial name Area (%) 1 C6:0 Hexanoic acid Caproic acid 0.193 2 C8:0 Octanoic acid Caprylic acid 0.364 3 C12:0 Dodecanoic acid Lauric acid 0.267 4 C14:0 Tetradecanoic acid Myristic acid 0.206 5 C16:0 Hexadecanoic acid Palmitic acid 7.495 6 C18:0 Octadecanoic acid Stearic acid 2.716 7 C20:0 Eicosanoic acid Arachidic acid 0.115  Table 4 A list of observed monounsaturated fatty acids in the newly produced biodiesel sample according to the GC analysis. Serial no. Chain length Systematic name Trivial name Configuration & group Area (%) 1 C18:1 Octadec-9-enoic acid Oleic acid -9 cis 17.519 2 C20:1 Docosenoic acid Eicosenoic acid -1 cis 0.254 3 C24:1 15-Tetracosenic acid Nervonic -9 cis 0.150  Table 5 A list of observed polyunsaturated fatty acids in the newly produced biodiesel sample according to the GC analysis. Serial no. Chain length Systematic name Trivial name Configuration & group Area (%) 1 C18:2 Octadecadienoic acid Linoleic acid -6 cis 69.696 2 C18:3(n-3) Octadecatrienoic acid Alpha-linolenic acid -3 cis 0.666 3 C22:2 13,16-Docosadienoic acid …… -6 cis 0.209 4 C22:2 ……. -6 cis 0.147 From the table main fatty acids are linoleic acid 69.696%, oleic acid 17.519%, stearic acid 2.761% and palmitic acid 7.495%.Linoleic and oleic acid is in high proportion. 97.471% of the fatty acids in neem seed oil are these specific fatty acids. In fact, validate the oil’s unsaturated behavior. Physicochemical properties of the newly produced biodiesel The overall physicochemical properties regarding the considered neem seed oil derived biodiesel including the density, sp. gravity, viscosity, calorific value, flash point, acid value, saponification value, iodine value, para-anisidine value, peroxide value, refractive index value, etc., have been listed and presented in Table 6  Table 6 A list of observed overall physicochemical properties of the newly produced biodiesel sample. Serial No Biodiesel properties Units Measured values EN 14,214 (EU) ASTM D6715 (USA) GB/T 20,828 (China) 1 Density Kg/m 3 874.12 ± 1.09 860–900 870–900 860–900 2 Specific gravity – 0.86704 ± 0.03 – – – 3 Refractive index – 1.4465 ± 0.005 – – – 4 Brix Value % 62.19 ± 0.23 – – – 5 Kinematic viscosity cSt 6.05 ± 0.07 3.5-5.0 1.9-6.0 1.9-6.0 6 Peroxide value meq/kg 3.98 ± 0.06 < 20 – < 10 7 Para-anisidine AnV 4.11 ± 0.19 – – – 8 Calorific value kcal/kg 9562.22 ± 5.87 – – > 9000 9 Flash point °C 142 ± 0.01 ≥ 101 ≥ 93 ≥ 130 10 Acid value mg NaOH/g 1.819 ± 0.42 ≤ 0.50 ≤ 0.50 ≤ 0.80 11 Free fatty acid % 0.91 ± 0.08 ≤ 0.25 ≤ 0.25 ≤ 0.50 The physicochemical properties of the neem-derived biodiesel were evaluated against global standards EN 14214 (EU), ASTM D6751 (USA), and GB/T 20828 (China) to assess its viability as a sustainable alternative fuel. The density (874.12 kg/m³) falls within the permissible ranges of all three standards (EU: 860–900, US: 870–900, China: 860–900 kg/m³), demonstrating compatibility with conventional diesel engines. However, the kinematic viscosity (6.05 cSt) exceeds the EU limit (3.5–5.0 cSt) but complies with the broader ASTM (1.9–6.0 cSt) and Chinese specifications, likely due to the high unsaturated fatty acid content (e.g., 69.7% linoleic acid). The acid value 1.819 mg NaOH/g surpasses EU/US thresholds ≤ 0.50 mg NaOH/g but aligns with China’s less stringent limit ≤ 0.80 mg NaOH/g, indicating residual free fatty acids that could be mitigated through acid pre-treatment. Notably, the flash point 142 °C far exceeds all standards (EU: ≥101 °C, US: ≥93 °C, China: ≥130 °C), ensuring safe storage and handling. The calorific value 956222 Kcal/kg outperforms China’s baseline (≥ 9000 kcal/kg) and approaches fossil diesel’s energy content (~ 10,000 kcal/kg), underscoring its efficiency. While the peroxide value(3.98 meq/kg complies with EU limits (≤ 20 meq/kg), it exceeds China’s stricter threshold (≤ 10 meq/kg), suggesting mild oxidative instability that could be addressed with antioxidants. Non-standardized parameters (e.g., refractive index, para-anisidine value) are reported for holistic characterization. Overall, the biodiesel meets critical benchmarks for density, flash point, and energy content globally but requires refinement in acid value and viscosity for stricter EU/US compliance, achievable through feedstock pretreatment or blending with diesel. Conclusion Neem seed is a type of feedstock from which, with minimal environmental pollution, biodiesel has been produced. As well as neem seed is renewable in nature. From the useless dropped neem oil was extracted by using soxhlet apparatus where 20% oil was found. In this study, the transesterification method was explored for the efficient production of biodiesel magnificently. simultaneously optimum condition for the produce biodiesel was also observed by varying reaction parameter such as molar ratio of oil to alcohol, catalyst concentration, temperature, time, stirring speed and subsequent resulting conditions found that molar ratio of oil to alcohol 1:6, catalyst concentration 1.5%, temperature 60 °C, time 120 minutes, stirring speed 500 rpm. A notable amount of biodiesel has been produced, which was around 86%. Besides a considerable yield of oil it possessed outstanding physicochemical properties. Sophisticated instruments and techniques are used for those analyses. Noteworthy results reveal that high calorific value 9562.22 ± 5.87 kcal/kg. This work is even more superior because of its remarkable implementation. Likewise, from the experimental data, it indicates that eco-friendly biodiesel from useless neem seed could have a major impact due to its outstanding properties and would be used as a suitable alternative to conventional fossil fuel to mitigate environmental pollution as well as to build a greener environment and a cleaner society. However, it is still needed to scale up this work by further research, whereas piloting as well as direct applications on real-time engines would be much more important and beneficial. Additionally, the purity and overall properties of the newly produced biodiesel can be improved by conducting more trials and errors regarding future research. Electronic supplementary material Below is the link to the electronic supplementary material.  Supplementary Material 1. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements All authors of this paper devoutly acknowledge the chairman of Bangladesh Council of Scientific and Industrial Research (BCSIR), as well as the Ministry of Science and Technology (MOST), People’s Republic of Bangladesh for their financial support and for consenting us to conduct their highly sophisticated instruments for experimentation. Furthermore, we want to acknowledge our lab attendant Md. Mofijul Islam and Mst. Ronjina Khatun for their cordial support during the experimental session and drafting. Author contributions M.K.A.Z.: Sample collection & preparation, Conceptualization, Software. M.M.R.: Conceptualization, Fund acquisition, Methodology, Software, Validation, Formal analysis, Data Curation, Writing - Review & Editing. M.S.Y.: Sample collection & preparation. M.M.H.: Writing - Review & Editing. M.I.H.: Data Curation. B.C.G.: Data analysis. G.M.M.R.: Formal analysis. M.S.H.: Visualization. N.A.: Data Curation. M.N.R.: Formal analysis, Data Curation. Funding The authors extend their appreciation to the Ministry of Science and Technology (MOST), the People’s Republic of Bangladesh, and the Bangladesh Council of Scientific and Industrial Research (BCSIR), for their joint funding to conduct this current work through Research and Development Project under grant number of (G.O.39.02. 0000.011.14.180.2024/1116 and G.O. 39.02.0000.011.14.169.2023/877). Data availability Data should be available on request to the corresponding author (Md. Mahmudur Rahman via the Email address: shamrat.acce@gmail.com). Declarations Competing interests The authors declare no competing interests. References 1. Benti NE Biodiesel production in Ethiopia: current status and future prospects Sci. Afr. 2023 19 e01531 10.1016/j.sciaf.2022.e01531 Benti, N. E. et al. Biodiesel production in Ethiopia: current status and future prospects. Sci. Afr. 19 2. Rahman, M. M. & Rahman, M. S. Green synthesis of Chitosan from shrimp shell and fabrication of Chitosan- modified clay nanofilter composite for the purification of drinking water. 10.13140/RG.2.2.27864.67844 (2022). 3. Sheikh MS Rahman MM Rahman MS Yildirim K Maniruzzaman M Fabrication of nano composite membrane filter from graphene Oxide(GO) and banana rachis cellulose nano Crystal(CNC) for industrial effluent treatment J. Ind. Eng. Chem. 2023 128 196 208 10.1016/j.jiec.2023.07.048 Sheikh, M. S., Rahman, M. M., Rahman, M. S., Yildirim, K. & Maniruzzaman, M. Fabrication of nano composite membrane filter from graphene Oxide(GO) and banana rachis cellulose nano Crystal(CNC) for industrial effluent treatment. J. Ind. Eng. Chem. 128 4. El Messaoudi N Recent developments in the synthesis of tetraethylenepentamine-based nanocomposites to eliminate heavy metal pollutants from wastewater through adsorption Bioresource Technol. Rep. 2024 28 101982 10.1016/j.biteb.2024.101982 El Messaoudi, N. et al. Recent developments in the synthesis of tetraethylenepentamine-based nanocomposites to eliminate heavy metal pollutants from wastewater through adsorption. Bioresource Technol. Rep. 28 5. Rahman MM Adsorptive abatement of Pb2 + and crystal Violet using chitosan-modified coal nanocomposites: A down flow column study Groundw. Sustainable Dev. 2023 23 101028 10.1016/j.gsd.2023.101028 Rahman, M. M. et al. Adsorptive abatement of Pb2 + and crystal Violet using chitosan-modified coal nanocomposites: A down flow column study. Groundw. Sustainable Dev. 23 6. Rahman MM Simultaneous removal of Ni2 + and congo red from wastewater by crystalline nanocellulose - Modified coal bionanocomposites: continuous adsorption study with mathematical modeling Groundw. Sustainable Dev. 2024 26 101244 10.1016/j.gsd.2024.101244 Rahman, M. M. et al. Simultaneous removal of Ni2 + and congo red from wastewater by crystalline nanocellulose - Modified coal bionanocomposites: continuous adsorption study with mathematical modeling. Groundw. Sustainable Dev. 26 7. Lelieveld, J. et al. Air pollution deaths attributable to fossil fuels: observational and modelling study. Bmj 10.1136/bmj-2023-077784 PMC10686100 38030155 8. IEA. World Energy Outlook 2024, IEA, Paris https://www.iea.org/reports/world-energy-outlook-2024 9. Priya, Deora, P. S., Verma, Y., Muhal, R. A., Goswami, C. & Singh, T. Biofuels: an alternative to conventional fuel and energy source. Mater. Today Proc. 48 10. Höök M Tang X Depletion of fossil fuels and anthropogenic climate change—A review Energy Policy 2013 52 797 809 10.1016/j.enpol.2012.10.046 Höök, M. & Tang, X. Depletion of fossil fuels and anthropogenic climate change—A review. Energy Policy 52 11. Hosseini SE Wahid MA Necessity of biodiesel utilization as a source of renewable energy in Malaysia Renew. Sustain. Energy Rev. 2012 16 2012 5732 5740 10.1016/j.rser.2012.05.025 Hosseini, S. E. & Wahid, M. A. Necessity of biodiesel utilization as a source of renewable energy in Malaysia. Renew. Sustain. Energy Rev. 16 12. Babir F Veziroǧlu TN Plass HJ Environmental damage due to fossil fuels use Int. J. Hydrog. Energy 1990 15 739 749 10.1016/0360-3199(90)90005-J Babir, F., Veziroǧlu, T. N. & Plass, H. J. Environmental damage due to fossil fuels use. Int. J. Hydrog. Energy 15 13. Rahman MM Cellulose nanocrystal (CNC) from Okra plant (Abelmoschus esculentus L.) stalks as a reinforcement in Bionanocomposite fabrication: extraction, processing, and characterization study Carbohydr. Polym. Technol. Appl. 2024 8 100581 10.1016/j.carpta.2024.100581 Rahman, M. M. et al. Cellulose nanocrystal (CNC) from Okra plant (Abelmoschus esculentus L.) stalks as a reinforcement in Bionanocomposite fabrication: extraction, processing, and characterization study. Carbohydr. Polym. Technol. Appl. 8 14. Wuebbles DJ Jain AK Concerns about climate change and the role of fossil fuel use Fuel Process. Technol. 2001 71 99 119 10.1016/S0378-3820(01)00139-4 Wuebbles, D. J. & Jain, A. K. Concerns about climate change and the role of fossil fuel use. Fuel Process. Technol. 71 15. Lelieveld, J. et al. Effects of fossil fuel and total anthropogenic emission removal on public health and climate. Proceedings of the National Academy of Sciences. 116, 7192–7197. (2019). 10.1073/pnas.1819989116 10.1073/pnas.1819989116 PMC6462052 30910976 16. Guarnieri M Balmes JR Outdoor air pollution and asthma Lancet 2014 383 1581 1592 10.1016/S0140-6736(14)60617-6 24792855 PMC4465283 Guarnieri, M. & Balmes, J. R. Outdoor air pollution and asthma. Lancet 383 24792855 10.1016/S0140-6736(14)60617-6 PMC4465283 17. Schikowski T Ambient air pollution: a cause of COPD Eur. Respiratory Soc. 2014 43 250 263 10.1183/09031936.00100112 23471349 Schikowski, T. et al. Ambient air pollution: a cause of COPD. Eur. Respiratory Soc. 43 10.1183/09031936.00100112 23471349 18. Kurt O Zhang J Pinkerton KE Pulmonary health effects of air pollution Curr. Opin. Pulm. Med. 2016 22 138 143 10.1097/MCP.0000000000000248 26761628 PMC4776742 Kurt, O., Zhang, J. & Pinkerton, K. E. Pulmonary health effects of air pollution. Curr. Opin. Pulm. Med. 22 26761628 10.1097/MCP.0000000000000248 PMC4776742 19. Narula, K. Global energy system and sustainable energy security. In: The Maritime Dimension of Sustainable Energy Security 20. Shafiee S Topal E An econometrics view of worldwide fossil fuel consumption and the role of US Energy Policy 2008 36 775 786 10.1016/j.enpol.2007.11.002 Shafiee, S. & Topal, E. An econometrics view of worldwide fossil fuel consumption and the role of US. Energy Policy 36 21. Leblond D Iea: fossil energy to dominate market through 2030 Oil Gas J. 2006 104 28 29 Leblond, D. Iea: fossil energy to dominate market through 2030. Oil Gas J. 104 22. Martins F Felgueiras C Smitkova M Caetano N Analysis of fossil fuel energy consumption and environmental impacts in European countries Energies 2019 12 6 964 10.3390/en12060964 Martins, F., Felgueiras, C., Smitkova, M. & Caetano, N. Analysis of fossil fuel energy consumption and environmental impacts in European countries. Energies 12 23. IEA. Tracking Clean Energy Progress 2023, IEA, Paris. https://www.iea.org/reports/tracking-clean-energy-progress-2023 24. Khan, M. A. H. et al. Investigation of biofuel as a potential renewable energy source. Atmosphere 12 25. Karmakar A Karmakar S Mukherjee S Biodiesel production from Neem towards feedstock diversification: Indian perspective Renew. Sustain. Energy Rev. 2012 16 1050 1060 10.1016/j.rser.2011.10.001 Karmakar, A., Karmakar, S. & Mukherjee, S. Biodiesel production from Neem towards feedstock diversification: Indian perspective. Renew. Sustain. Energy Rev. 16 26. Rabby MMR Production of CNC from agro-waste biomass (maize shells) as a potential reinforcement in bio-nanocomposites: extraction, modification, and characterization study Carbohydr. Polym. Technol. Appl. 2025 9 100671 10.1016/j.carpta.2025.100671 Rabby, M. M. R. et al. Production of CNC from agro-waste biomass (maize shells) as a potential reinforcement in bio-nanocomposites: extraction, modification, and characterization study. Carbohydr. Polym. Technol. Appl. 9 27. Dewan S Isolation and characterization of CNC from waste maize cob available in Bangladesh as a potential candidate for the fabrication of multifunctional bio-nanocomposites: A new approach S. Afr. J. Chem. Eng. 2025 51 287 301 10.1016/j.sajce.2024.12.007 Dewan, S. et al. Isolation and characterization of CNC from waste maize cob available in Bangladesh as a potential candidate for the fabrication of multifunctional bio-nanocomposites: A new approach. S. Afr. J. Chem. Eng. 51 28. Hassan MM Rahman MM Ghos BC Hossain MI Zuhanee MKA Extraction, and characterization of CNC from waste sugarcane leaf sheath as a reinforcement of multifunctional bio-nanocomposite material: A waste to wealth approach Carbon Trends 2024 17 100400 10.1016/j.cartre.2024.100400 Hassan, M. M., Rahman, M. M., Ghos, B. C., Hossain, M. I. & Zuhanee, M. K. A. Extraction, and characterization of CNC from waste sugarcane leaf sheath as a reinforcement of multifunctional bio-nanocomposite material: A waste to wealth approach. Carbon Trends 17 29. Yuan, H., Yang, B., Zhang, H. & Zhou, X. Synthesis of biodiesel using Castor oil under microwave radiation. Int. J. Chem. Reactor Eng. 9 30. Bahadur S Goyal P Sudhakar K Prakash Bijarniya J A comparative study of ultrasonic and conventional methods of biodiesel production from Mahua oil Biofuels 2015 6 107 113 10.1080/17597269.2015.1057790 Bahadur, S., Goyal, P., Sudhakar, K. & Prakash Bijarniya, J. A comparative study of ultrasonic and conventional methods of biodiesel production from Mahua oil. Biofuels 6 31. Sirajudin, N., Jusoff, K., Yani, S., Ifa, L. A. & Roesyadi, A. Biofuel production from catalytic cracking of palm oil. Catalyst 5 32. Rahman MM Fabrication of CNC-AC bionanosorbents from the residual mass of Magnolia champaca Environ. Nanatechnol. Monit. Manage. 2024 22 101015 10.1016/j.enmm.2024.101015 Rahman, M. M. et al. Fabrication of CNC-AC bionanosorbents from the residual mass of Magnolia champaca Environ. Nanatechnol. Monit. Manage. 22 33. Felipe L Verduzco R Density and viscosity of biodiesel as a function of temperature: empirical models Renew. Sustain. Energy Rev. 2013 19 652 665 10.1016/j.rser.2012.11.022/article/pii/S1364032112006338) Felipe, L. & Verduzco, R. Density and viscosity of biodiesel as a function of temperature: empirical models. Renew. Sustain. Energy Rev. 19 34. Rahman MM Islam MR Islam MR Naznin S Extraction and characterization of lipid from Pangus fish (P. Pangasius) available in Bangladesh by solvent extraction method Am. J. Zool. 2018 1 2 28 34 10.11648/j.ajz.20180102.11 Rahman, M. M., Islam, M. R., Islam, M. R. & Naznin, S. Extraction and characterization of lipid from Pangus fish (P. Pangasius) available in Bangladesh by solvent extraction method. Am. J. Zool. 1 35. Ozcanli, M., Gungor, C. & Aydin, K. Biodiesel fuel specifications: a review. Energy Sources Part A Recov. Util. Environ. Effects 35 36. Nabizadeh R Biodiesel production from supernatant waste cooking oil by a simple one- step technique: calorific value optimization using response surface methodology (RSM) based on D-optimal design J. Mater. Cycles Waste Manag 2023 25 3567 3583 10.1007/s10163-023-01779-5 Nabizadeh, R. et al. Biodiesel production from supernatant waste cooking oil by a simple one- step technique: calorific value optimization using response surface methodology (RSM) based on D-optimal design. J. Mater. Cycles Waste Manag 25 37. Baroutian S Aroua MK Raman AA Sulaiman NM Viscosities and densities of binary and ternary blends of palm oil + palm biodiesel + diesel fuel at different temperatures J. Chem. Eng. Data 2010 55 1 504 507 10.1021/je900299x Baroutian, S., Aroua, M. K., Raman, A. A. & Sulaiman, N. M. Viscosities and densities of binary and ternary blends of palm oil + palm biodiesel + diesel fuel at different temperatures. J. Chem. Eng. Data 55 38. Yeasmin MS Chowdhury TA Rana GMM Rahman MM Ferdousi L Characteristics of Sesame ( Sesamum Indi-cum Biomed. J. Sci. Tech. Res. 2021 38 1 29944 29949 10.26717/BJSTR.2021.38.006083 Yeasmin, M. S., Chowdhury, T. A., Rana, G. M. M., Rahman, M. M. & Ferdousi, L. Characteristics of Sesame ( Sesamum Indi-cum Biomed. J. Sci. Tech. Res. 38 39. Yeasmin MS Physico-Chemical properties and GCMS analyses of Indigenous rice Bran and mustard seed oils and their blends Biomed. J. Sci. Tech. Res. 2021 34 5 27167 27172 10.26717/BJSTR.2021.34.005620 Yeasmin, M. S. et al. Physico-Chemical properties and GCMS analyses of Indigenous rice Bran and mustard seed oils and their blends. Biomed. J. Sci. Tech. Res. 34 40. Rahman MM Maniruzzaman M Islam MR Rahman MS Synthesis of Nano- cellulose from Okra fibre and FTIR as well as morphological studies on it Am. J. Polym. Sci. Technol. 2018 4 42 52 10.11648/j.ajpst.20180402.11 Rahman, M. M., Maniruzzaman, M., Islam, M. R. & Rahman, M. S. Synthesis of Nano- cellulose from Okra fibre and FTIR as well as morphological studies on it. Am. J. Polym. Sci. Technol. 4 41. Rahman MM Adsorptive removal of toxic heavy metal and dyes from wastewater by rice husk (lignocellulosic biomass) derived activated biochar: A fixed-bed column adsorption study Carbohydr. Polym. Technol. Appl. 2025 9 100698 10.1016/j.carpta.2025.100698 Rahman, M. M. et al. Adsorptive removal of toxic heavy metal and dyes from wastewater by rice husk (lignocellulosic biomass) derived activated biochar: A fixed-bed column adsorption study. Carbohydr. Polym. Technol. Appl. 9 42. Rahman MM A state-of-the-art review focusing on the fabrication technique of activated chitosan-bitumin coal based multifunctional bionanocomposites for industrial wastewater treatment: production, characterization, and fixed bed column adsorption study J. Environ. Chem. Eng. 2025 13 2 115908 10.1016/j.jece.2025.115908 Rahman, M. M. et al. A state-of-the-art review focusing on the fabrication technique of activated chitosan-bitumin coal based multifunctional bionanocomposites for industrial wastewater treatment: production, characterization, and fixed bed column adsorption study. J. Environ. Chem. Eng. 13 43. Rahman MM Maniruzzaman M Yeasmin MS A State-of-the-Art review focusing on the significant techniques for naturally available fibers as reinforcement in sustainable Bio-composites: extraction, processing, purification, modification, as well as characterization study Result Eng. 2023 20 101511 10.1016/j.rineng.2023.101511 Rahman, M. M., Maniruzzaman, M. & Yeasmin, M. S. A State-of-the-Art review focusing on the significant techniques for naturally available fibers as reinforcement in sustainable Bio-composites: extraction, processing, purification, modification, as well as characterization study. Result Eng. 20 44. Rahman, M. M., Maniruzzaman, M. & Zaman, M. N. Fabrication and characterization of environmentally friendly biopolymeric nanocomposite films from cellulose nanocrystal of banana M. Oranta (Sagar kala) tree rachis fibers and Poly lactic acid: A new route. S. Afr. J. Chem. Eng. 100619 45. Rahman MM Islam MM Maniruzzaman M Preparation and characterization of biocomposite from modified α-cellulose of Agave cantala leaf fiber by graft copolymerization with 2-hydroxy Ethyl methacrylate Carbohydr. Polym. Technol. Appl. 2023 10.1016/j.carpta.2023.100354 Rahman, M. M., Islam, M. M. & Maniruzzaman, M. Preparation and characterization of biocomposite from modified α-cellulose of Agave cantala leaf fiber by graft copolymerization with 2-hydroxy Ethyl methacrylate. Carbohydr. Polym. Technol. Appl. 46. Rahman MM Production of cellulose nanocrystals from the waste banana ( M. Oranta Carbohydr. Polym. Technol. Appl. 2024 8 100607 10.1016/j.carpta.2024.100607 Rahman, M. M. et al. Production of cellulose nanocrystals from the waste banana ( M. Oranta Carbohydr. Polym. Technol. Appl. 8 47. Rahman MM Maniruzzaman M Preparation of shrimp shell Chitosan-Clay-Nanofilter for the purification of drinking water Int. J. Food Eng. Technol. 2018 2 17 26 10.11648/j.ijfet.20180202.12 Rahman, M. M. & Maniruzzaman, M. Preparation of shrimp shell Chitosan-Clay-Nanofilter for the purification of drinking water. Int. J. Food Eng. Technol. 2 48. Rahman MM Maniruzzaman M Extraction of nanocellulose from banana rachis (Agro-waste) and Preparation of nanocellulose-Clay nanofilter for the industrial wastewater purification J. Bioremediat. Biodegradation 2021 12 485 10.4172/2155-6199.1000485 Rahman, M. M. & Maniruzzaman, M. Extraction of nanocellulose from banana rachis (Agro-waste) and Preparation of nanocellulose-Clay nanofilter for the industrial wastewater purification. J. Bioremediat. Biodegradation 12 49. Dubey KKD Biodiesel production from Hiptage benghalensis seed oil Ind. Crops Prod. 2020 144 112027 10.1016/j.indcrop.2019.112027 Dubey, K. K. D. et al. Biodiesel production from Hiptage benghalensis seed oil. Ind. Crops Prod. 144 50. Ouilly JT Chemical composition, physicochemical characteristics, and nutritional value of Lannea kerstingii seeds and seed oil J. Anal. Methods Chem. 2017 2017 1 6 10.1155/2017/2840718 PMC5307246 28255501 Ouilly, J. T. et al. Chemical composition, physicochemical characteristics, and nutritional value of Lannea kerstingii seeds and seed oil. J. Anal. Methods Chem. 2017 10.1155/2017/2840718 PMC5307246 28255501 51. Canakci, M. & Gerpen., J. V. Biodiesel production from oils and fats with high free fatty acids. Am. Soc. Agric. Biol. Eng. 44 52. Sahoo PK Das LM Process optimization for biodiesel production from jatropha, Karanja and Polanga oils Fuel 2009 88 1588 1594 10.1016/j.fuel.2009.02.016 Sahoo, P. K. & Das, L. M. Process optimization for biodiesel production from jatropha, Karanja and Polanga oils. Fuel 88 53. Guan G Kusakabe K Moriyama K Sakurai N Continuous production of biodiesel using a microtube reactor Chem. Eng. Trans. 2008 14 237 244 Guan, G., Kusakabe, K., Moriyama, K. & Sakurai, N. Continuous production of biodiesel using a microtube reactor. Chem. Eng. Trans. 14 54. Rashid, W. N. W. A., Uemura, Y., Kusakabe, K., Osman, N. B. & Abdullah, B. Synthesis of biodiesel from palm oil in capillary millichannel reactor: effect of temperature,methanol to oil molar ratio, and KOH concentration on FAME yield. Procedia Chem. 55. Okwundu OS El-Shazly AH Elkady M Comparative effect of reaction time on biodiesel production from low free fatty acid beef tallow: a definition of product yield SN Appl. Sci. 2019 1 140 10.1007/s42452-018-0145-1 Okwundu, O. S., El-Shazly, A. H. & Elkady, M. Comparative effect of reaction time on biodiesel production from low free fatty acid beef tallow: a definition of product yield. SN Appl. Sci. 1 56. Rahman MM Simultaneous abatement of Ni2 + and Cu2 + effectually from industrial wastewater by a low cost natural clay-chitosan nanocomposite filter: synthesis, characterization and fixed bed column adsorption study Environ. Nanatechnol. Monit. Manage. 2023 20 100797 10.1016/j.enmm.2023.100797 Rahman, M. M. et al. Simultaneous abatement of Ni2 + and Cu2 + effectually from industrial wastewater by a low cost natural clay-chitosan nanocomposite filter: synthesis, characterization and fixed bed column adsorption study. Environ. Nanatechnol. Monit. Manage. 20 57. Rahman MM Maniruzzaman M Environmentally friendly strength bio-composite Preparation by grafting of HEMA onto shrimp Chitosan without destroying original microstructure to enrich their physicochemical, thermomechanical, and morphological properties S. Afr. J. Chem. Eng. 2024 47 300 311 10.1016/j.sajce.2023.12.005 Rahman, M. M. & Maniruzzaman, M. Environmentally friendly strength bio-composite Preparation by grafting of HEMA onto shrimp Chitosan without destroying original microstructure to enrich their physicochemical, thermomechanical, and morphological properties. S. Afr. J. Chem. Eng. 47 58. Rahman MM Fabrication of Chitosan coated bentonite clay multifunctional nanosorbents from waste biomass for the effective elimination of hazardous pollutants from waterbodies: A fixed bed biosorption, mechanism, and mathematical model study Int. J. Biol. Macromol. 2024 282 6 137439 10.1016/j.ijbiomac.2024.137439 39522922 Rahman, M. M. et al. Fabrication of Chitosan coated bentonite clay multifunctional nanosorbents from waste biomass for the effective elimination of hazardous pollutants from waterbodies: A fixed bed biosorption, mechanism, and mathematical model study. Int. J. Biol. Macromol. 282 39522922 10.1016/j.ijbiomac.2024.137439 59. Rahman MM Maniruzzaman M A new route of production of the mesoporous Chitosan with well-organized honeycomb surface microstructure from shrimp waste without destroying the original structure of native shells: extraction, modification and characterization study Result Eng. 2023 19 101362 10.1016/j.rineng.2023.101362 Rahman, M. M. & Maniruzzaman, M. A new route of production of the mesoporous Chitosan with well-organized honeycomb surface microstructure from shrimp waste without destroying the original structure of native shells: extraction, modification and characterization study. Result Eng. 19 60. Uddin MJ Morphostructural studies of pure and mixed metal oxide nanoparticles of Cu with Ni and Zn Heliyon 2024 10 e30544 10.1016/j.heliyon.2024.e30544 38742051 PMC11089366 Uddin, M. J. et al. Morphostructural studies of pure and mixed metal oxide nanoparticles of Cu with Ni and Zn. Heliyon 10 38742051 10.1016/j.heliyon.2024.e30544 PMC11089366 61. Rahman, O., Rahman, M. M. & Maniruzzaman, M. Removal of dye and heavy metals from industrial wastewater by activated charcoal-banana rachis cellulose nanocrystal composite filter. Int. J. Environ. Anal. Chem. 62. Rahman MM Maniruzzaman M Saha RK A green route of antibacterial films production from shrimp ( Penaeus monodon S. Afr. J. Chem. Eng. 2024 10.1016/j.sajce.2024.11.005 Rahman, M. M., Maniruzzaman, M. & Saha, R. K. A green route of antibacterial films production from shrimp ( Penaeus monodon S. Afr. J. Chem. Eng. 63. Rahman MM Production of functionalized clay-CNC based biopolymeric nanocomposite from agro-waste biomass for bulky industrial wastewater treatment via continuous column adsorption study with mathematical modeling: A critical review J. Clean. Prod. 2025 518 145883 10.1016/j.jclepro.2025.145883 Rahman, M. M. et al. Production of functionalized clay-CNC based biopolymeric nanocomposite from agro-waste biomass for bulky industrial wastewater treatment via continuous column adsorption study with mathematical modeling: A critical review. J. Clean. Prod. 518 ",
  "metadata": {
    "Title of this paper": "Production of functionalized clay-CNC based biopolymeric nanocomposite from agro-waste biomass for bulky industrial wastewater treatment via continuous column adsorption study with mathematical modeling: A critical review",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484879/"
  }
}