{
  "title": "Paper_476",
  "abstract": "pmc Nat Commun Nat Commun 2873 ncomms Nature Communications 2041-1723 Nature Publishing Group PMC12484792 PMC12484792.1 12484792 12484792 41027899 10.1038/s41467-025-63741-3 63741 1 Article Macrophage WDFY3 mitigates autoimmunity by enhancing efferocytosis and suppressing T cell activation in mice http://orcid.org/0000-0002-0742-7459 Wu Xun xw2698@cumc.columbia.edu 1 Wang Ziyi 1 Croce Katherine R. 2 Li Fang 1 Cui Jian 1 D’Agati Vivette D. 3 4 http://orcid.org/0000-0002-4556-4358 Soni Rajesh K. 3 Tabas Ira 3 5 6 Yamamoto Ai 2 3 http://orcid.org/0000-0001-8655-938X Zhang Hanrui hz2418@cumc.columbia.edu 1 1 https://ror.org/01esghr10 grid.239585.0 0000 0001 2285 2675 Cardiometabolic Genomics Program, Division of Cardiology, Department of Medicine, Columbia University Irving Medical Center, 2 https://ror.org/00hj8s172 grid.21729.3f 0000 0004 1936 8729 Department of Neurology, Columbia University, 3 https://ror.org/00hj8s172 grid.21729.3f 0000 0004 1936 8729 Department of Pathology and Cell Biology, Columbia University, 4 https://ror.org/01esghr10 grid.239585.0 0000 0001 2285 2675 Renal Pathology Laboratory, Columbia University Irving Medical Center, 5 https://ror.org/01esghr10 grid.239585.0 0000 0001 2285 2675 Department of Medicine, Columbia University Irving Medical Center, 6 https://ror.org/01esghr10 grid.239585.0 0000 0001 2285 2675 Department of Physiology and Cellular Biophysics, Columbia University Irving Medical Center, 30 9 2025 2025 16 478256 8694 8 8 2024 25 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Efficient efferocytosis is crucial for immune homeostasis. Conversely, excessive apoptotic cell (AC) death and impaired macrophage efferocytosis lead to autoantigen release, autoantibody production, and immune activation. It is unclear whether immunogenic autoantigens from impaired clearance are the sole cause of autoimmunity or if AC efferocytosis directly alters macrophage function, affecting T cell activation and amplifying autoimmunity. Our prior work identified WDFY3 as essential for macrophage efferocytosis. Here, we demonstrate that myeloid Wdfy3 Wdfy3 + + Excessive apoptotic cell death and defective efferocytosis drive loss of tolerance and autoimmunity; however, a direct role for macrophage-specific defects in autoimmunity is underexplored. Here, the authors identify macrophage WDFY3 as a negative regulator of autoimmunity by enhancing efferocytosis and reducing MHC-II-mediated antigen presentation, T cell activation, and cytokine dysregulation. Subject terms Phagocytes Cell death and immune response Autoimmunity CD4-positive T cells https://doi.org/10.13039/100000050 U.S. Department of Health & Human Services | NIH | National Heart, Lung, and Blood Institute (NHLBI) R01HL151611 P01HL172741 R01HL168174 R35HL177389 Zhang Hanrui https://doi.org/10.13039/100000968 American Heart Association (American Heart Association, Inc.) 25CDA1451366 23CDA1052177 Wu Xun Li Fang pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Efficient efferocytosis of dying cells by phagocytes, mainly macrophages, is essential for maintaining homeostasis 1 2 + 3 4 5 6 1 7 Excessive AC death and impaired efferocytosis are observed in patients with systemic lupus erythematosus 8 11 12 13 14 18 14 15 16 17 18 We have previously identified, via a genome-wide CRISPR screening, that WDFY3 is required for both the engulfment and the subsequent lysosomal acidification and degradation of ACs by macrophages 19 Wdfy3 WDFY3 Wdfy3 + Results Myeloid knockout of Wdfy3 Given our previous findings demonstrating the importance of WDFY3 in regulating multiple steps of the efferocytic clearance of ACs 19 Wdfy3 14 Wdfy3 We backcrossed Wdfy3 fl/fl 20 loxP Wdfy3 Wdfy3 fl/fl LysMCre 21 LysMCre +/− Wdfy3 fl/fl + LysMCre −/− Wdfy3 fl/fl − 1a + 19 LysMCre Wdfy3 1 − + 1a 1b, c 1d, e 1f–i 1b, c − + + − + 1d 1e + 1f 1g + − 1h, i 1 − + 2 − + Wdfy3 3 3a 3b 22 Wdfy3 Fig. 1 Myeloid knockout of Wdfy3 a LysMCre- Wdfy3 + LysMCre +/− Wdfy3 fl/fl − LysMCre −/− Wdfy3 fl/fl b n − + c n − + d n − + e n − + f n − + g n − + h i h i n − + h n − + i t g U The kidney immune complex deposition and nephritis-like phenotype were unlikely due to the direct effects of intrarenal AC accumulation, since the injected ACs mostly accumulated in the spleen (Supplementary Fig. 4 + + − + 5 Autoinflammatory and autoimmune responses progress with age, advancing from autoreactivity to autoimmunity, when immune dysregulation, impaired efferocytosis, and chronic inflammation disrupt tolerance and amplify autoreactive T and B cell activities 23 Wdfy3 19 + 6b − 6c + 6d − 6e − + 6f + 6g 6i 6j, k 6h − + 1 Wdfy3 Myeloid knockout of Wdfy3 It remains unclear whether autoimmunity is solely triggered by increased immunogenic autoantigens from dead cells because of impaired clearance, or if the cell-intrinsic effects within macrophages triggered by AC engulfment directly impact macrophages’ ability to activate T cells and potentially amplify autoimmune responses. While myeloid knockout of Wdfy3 Wdfy3 2a + hi lo + + 2b, d 7a 24 + + + 2c 7a Fig. 2 Myeloid knockout of Wdfy3 + a − + b high low + + n − + n − + c + + + n − + d high low + + n − + e f 323-339 257-264 + + n − + n − + g l g i 323-339 + + + + n − + n − + j l 257-264 + + + + n − + n − + − + t T cells are activated when their receptors recognize antigens presented by antigen-presenting cells, such as macrophages, DCs, and B cells, and receive additional signals from cytokines 25 27 2e, f 7b–d 323-339 + 257-264 + Wdfy3 + 2e + + 2f + hi hi − 2e, f To confirm our findings in vivo, we immunized Cre + 323-339 + + 25 25 2g, j + + + 2h, i Wdfy3 + 2k, l We next determined if T cell activation is associated with increased inflammatory cytokine production at systemic levels and the cellular mechanisms (Fig. 3a 8 + 3b 28 29 28 29 Wdfy3 + + 3c 3d Fig. 3 Myeloid knockout of Wdfy3 a − + b n − + c + n − + n − + d + − n − + e n − + f n − + g WDFY3 h + + n − + t To investigate whether Wdfy3 Wdfy3 3e + − 3f WDFY3 3g Wdfy3 30 IL-1β is known to enhance antigen-primed CD4 + 31 + 32 − + − + + − + + 3h 7b 33 Taken together, myeloid Wdfy3 + Overexpression of WDFY3 enhances macrophage efferocytosis in vitro and in vivo Given how the loss of WDFY3 diminishes efferocytosis and promotes autoimmunity, we next investigated whether increasing expression levels of WDFY3 could enhance efferocytosis and mitigate autoimmunity (Fig. 4a WDFY3 loxP-STOP-loxP-3xFLAG-hWDFY3 Rosa26 Rosa26 loxP-STOP-loxP-3xFLAG-hWDFY3 cDNA/+ 34 HprtCre 35 loxP-STOP-loxP Rosa26 3xFLAG-hWDFY3/+ Rosa26 3xFLAG-hWDFY3/+ KI/KI Fig. 4 Overexpression of WDFY3 a WDFY3 WDFY3 loxP Rosa26 Rosa26 loxP-STOP-loxP-3xFLAG-hWDFY3/+ HprtCre loxP-STOP-loxP Rosa26 3xFLAG-hWDFY3/+ Rosa26 3xFLAG-hWDFY3/+ Rosa26 3xFLAG-hWDFY3/3xFLAG-hWDFY3 KI/KI Rosa26 +/+ b n KI/KI c + n KI/KI + + + n KI/KI d n KI/KI e + n KI/KI f g n KI/KI h n KI/KI i + n KI/KI j + + + + n − KI/KI k 7 + + n KI/KI t BMDMs from hWDFY3 KI/KI 4b 4c + 19 4c 4d 36 4e We further validated efferocytosis in mice using two in vivo assays: thymus efferocytosis and PM efferocytosis 19 KI/KI 4f 37 4g, h KI/KI 4g, h KI/KI + 4i + + + 4j KI/KI 19 KI/KI + KI/KI 4k Overexpression of WDFY3 attenuates autoimmunity induced by systemic AC injections in young mice and autoreactivity in middle-aged mice After confirming the enhanced efferocytic capacity in macrophages overexpressing WDFY3, we asked whether WDFY3 overexpression in mice protects against autoimmunity. We challenged hWDFY3 KI/KI 1 5a 5 KI/KI 5b, c KI/KI 5d, e 5f 5g, h KI/KI 9 5d, e Fig. 5 Overexpression of WDFY3 a KI/KI 1a b n KI/KI c n KI/KI d n KI/KI e n KI/KI f n KI/KI g h g h n KI/KI t The protective effects of WDFY3 overexpression also extended to middle-aged mice without AC injections (Supplementary Fig. 10a KI/KI 10b 10c 10d 10f, g 10e KI/KI 10h 10i Collectively, these findings highlight the potential therapeutic opportunity of WDFY3 overexpression to mitigate autoimmunity driven by increased dead cell burden and age-associated chronic inflammation. Overexpression of WDFY3 in macrophages mitigates T cell activation and IL-1β secretion in response to the efferocytosis of ACs We next examined whether WDFY3 overexpression suppresses T cell activation and cytokine dysregulation (Fig. 6 hi lo + + + + + KI/KI 6b, c hi lo + + KI/KI 6d KI/KI + 6e KI/KI 6f KI/KI + 6g, h KI/KI 6i + KI/KI 6j 7b KI/KI 2 Fig. 6 Overexpression of WDFY3 a KI/KI b d e f i j b high low + + n KI/KI + n KI/KI + c + + + n KI/KI + n KI/KI + d high low + + n KI/KI + n KI/KI + e 323-339 + + + + n KI/KI f n KI/KI g + n KI/KI h + n KI/KI i n KI/KI j + + n KI/KI t g Discussion Our work advances several conceptual ideas on macrophage efferocytosis in autoimmunity. First, we identified a significant role for the myeloid-specific knockout of Wdfy3 + It is worth noting that efferocytosis, particularly following the degradation of the AC corpses, induces the production of anti-inflammatory cytokines such as transforming growth factor-beta (TGF-β) and interleukin-10 (IL-10), thereby promoting the resolution of inflammation 38 41 + Wdfy3 19 42 43 44 45 48 Among immune cells, WDFY3 is abundantly expressed in monocytes and macrophages, with low expression in granulocytes, B cells and DCs 19 46 48 34 49 50 51 Methods Mice Animal protocols were approved by the Institutional Animal Care and Use Committee at Columbia University (Protocol Number AC-AABN5558). Mice were housed socially in standard cages at 22 °C with 40–60% humidity under a 12-12 h light-dark cycle within specific pathogen-free (SPF) facilities. Experimental and control mice were co-housed in the same cage whenever possible to minimize environmental variation. Ad libitum Wdfy3 Wdfy3 fl/fl 20 LysMCre +/− 21 LysMCre +/− Wdfy3 fl/fl + Wdfy3 LysMCre -/- Wdfy3 fl/fl − 19 WDFY3 34 WDFY3 loxP Rosa26 Rosa26 loxP-STOP-loxP-3xFLAG-hWDFY3/+ Rosa26 HprtCre loxP-STOP-loxP Rosa26 3xFLAG-hWDFY3/+ Rosa26 3xFLAG-hWDFY3/+ Rosa26 3xFLAG-hWDFY3/3xFLAG-hWDFY3 3xFLAG-hWDFY3 KI/KI KI/KI 52 53 Wdfy3 19 Inclusion and exclusion criteria were established for the mouse cohorts in this study. Inclusion criteria required age- and sex-matched littermates that could be genotyped. Exclusion criteria included mice that died prematurely due to causes unrelated to experimental conditions (e.g., congenital defects or fighting). No differences in mortality rates were observed across groups up to middle-aged time points (approximately 52-60 weeks, or 12-14 months of age). Attrition due to technical or equipment errors during sample collection and processing after euthanasia was also accounted for, with affected samples excluded to ensure data reliability. Murine bone marrow-derived macrophages Murine bone marrow-derived macrophages (BMDM) were prepared by differentiating bone marrow (BM) cells isolated from femurs and tibia 19 6 6 L 19 19 Murine peritoneal macrophages Mouse peritoneal macrophages (PM) were prepared by collecting peritoneal exudates. The exudates were centrifuged at 400 × g 6 L 19 19 Murine splenic macrophages Spleen single-cell suspensions were prepared by pressing spleens through 70 µm cell strainers (Fisher Scientific, 22-363-548) 54 + + Human monocyte-derived macrophages Human monocyte-derived macrophages (HMDM) were differentiated from peripheral blood mononuclear cells (PBMC) 19 19 19 55 Murine bone-marrow derived dendritic cells BMs were plated in 6-well non-tissue-culture (TC)-treated plates at 2 × 10 6 6 25 25 + Preparation of apoptotic cells and fluorescent labeling for efferocytosis assays Apoptotic cells (AC) were generated by exposing isolated mouse thymocytes to ultraviolet light (UV, 254-nm wavelength) irradiation using a UVP EL Series UV Lamp (Analytik Jena US, Upland, CA; Model UVS-18, 95-0200-01) as described 19 56 57 7 2 Fluorescent labeling of ACs was performed as described 19 P36600 58 In vitro efferocytosis assay As we described 19 58 6 2 In vivo thymus efferocytosis assay Mice were injected intraperitoneally with 200 µL PBS containing 250 µg dexamethasone (Sigma-Aldrich, 265005-100MG) as previously described 19 19 C10618 19 + In vivo peritoneal macrophage efferocytosis assay Mice were injected intraperitoneally with 1 × 10 7 + 19 Induction of autoimmune-like responses via repeated AC injections Exposure to large numbers of ACs was used to evoke immune responses in mice as previously described 22 7 Single AC injection to assess accumulation in different organs To determine AC accumulation in different organs upon injection, ACs were labeled with 10 µg/mL TAMRA (Thermo Fisher Scientific, C1171) for 25 min and 2 × 10 7 59 54 60 + Assessment of autoimmunity-related phenotypes in mice Organ weight: Spleen, kidney, and subiliac lymph node (LN) were dissected and weighed. Serum alanine aminotransferase and creatinine: Peripheral blood was collected to obtain serum by centrifuging at 1400 × g Serum autoantibodies: Serum antinuclear antibodies (ANA) and anti-dsDNA antibodies were determined using mouse antinuclear antigens Ig’s (Total A + G + M) ELISA kit (Alpha Diagnostics International, 5210), mouse anti-nuclear antibody (IgG) ELISA Kit (CUSABIO, CSB-E12912m) and mouse anti-dsDNA Ig’s (Total A + G + M) ELISA kit (Alpha Diagnostics International, 5110). Histopathological analysis of mouse kidney, spleen, liver and skin: Kidney, spleen, liver, and skin were harvested at euthanasia and immersion-fixed in 4% formaldehyde (Thermo Fisher Scientific, 28908), embedded in paraffin, and coronal sections cut at 3 µm thickness 25 1 Glomerular area and immune complex deposition in the glomeruli: kidneys were embedded in optimal cutting temperature (OCT) compound and snap frozen. Cryostat sections were cut at 3 µm for periodic acid-Schiff (PAS) staining (Sigma-Aldrich, 395B) and for indirect immunofluorescent staining. For PAS staining, frozen sections were fixed with 4% formaldehyde for 20 min at room temperature. Cross sections were imaged with the Leica Aperio AT2 Slide Scanner. Glomeruli along the longitudinal line and the transverse line of the cross section were identified. Glomerular area was quantified and presented as the mean area of 12-15 glomeruli per mouse using the Aperio ImageScope software (Leica, V12.4.6.5003) 25 61 62 W11261 P36931 P36930 Characterization of splenic and liver macrophages by flow cytometry and immunofluorescence staining Single-cell suspensions of spleen 54 60 50 50 For immunofluorescence staining of CD68, paraffin sections were used 63 P36931 P36930 Western blotting Cells from one-well of 6-well plate, i.e., about 1 × 10 6 64 g 34 MA547253 T cell activation by flow cytometry T cell activation was characterized in blood T cells and splenic T cells in mice as previous described 25 54 + + − − + + + − − + − + + − − + + + + + − + T cell subset characterization by flow cytometry For CD4 + 65 + + 65 In vitro antigen presentation assay MHC-II and MHC-I mediated antigen presentation by BMDMs in vitro was assessed using ovalbumin (OVA) peptides and OT-II and OT-I transgenic T cells, as modified from previously published protocols 25 26 66 + + 323-339 + 257-264 + + + In vivo antigen presentation assay To assess antigen presentation in vivo, mice were immunized by subcutaneous injection of 100 µL per mouse of a 1:1 mixture of immunogen (20 µg OVA peptide in PBS) and Freund’s Adjuvant (Sigma-Aldrich, F5881) 25 67 6 + + + + + + + + + + Assessment of efferocyte-T cell interaction The method to assess efferocyte-T cell interaction to induce T cell activation was modified from a previously published protocol 32 g 7 2 + 26 68 LC3 lipidation measurement by flow cytometry BMDMs were incubated with TAMRA-labeled ACs at a 5:1 AC-to-BMDM ratio at 37 °C, 5% CO 2 g 69 + Intracellular staining to determine Pro-IL-1β expression by flow cytometry For the detection of pro-IL-1β in murine splenic macrophages, F4/80 + + 25 Immunofluorescence staining of ASC in BMDMs post-efferocytosis BMDMs were co-incubated with TAMRA-labeled ACs for 15 min to initiate efferocytosis, after which unbound ACs were removed by washing. The BMDMs were then fixed with 4% formaldehyde for 30 min at room temperature. Permeabilization was performed using 0.5% Triton X-100 in PBS, followed by blocking with 5% BSA in PBST for 30 min. For ASC staining 70 Cytokine and chemokine measurement in serum or culture media The 26-plex ProcartaPlex Mouse Cytokine & Chemokine Convenience Panel 1 was used to analyze serum samples using Luminex xMAP technology (Thermo Fisher Scientific, EPXR260-26088-901) 71 DY762505 25 To determine how efferocytosis affect IL-1β secretion 72 6 6 siRNA-mediated gene silencing Non-targeting siRNA control (si-Ctrl) (Dharmacon, D-001810-10-05) and WDFY3-targeting siRNA (si-WDFY3) (Dharmacon, L-012924-01-0005) were obtained from Dharmacon 19 6 6 73 6 6 RNA-sequencing sample preparation and data analysis BM cells were isolated from 6-8-week-old Ctrl and hWDFY3 KI/KI n 19 Statistical analysis Statistical analyses were conducted using GraphPad Prism 8. A two-tailed Student’s t U P P Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Transparent Peer Review file Reporting Summary Description of Additional Supplementary Files Supplementary Data 1 Supplementary Data 2 Source data  Source Data Publisher’s note Supplementary information The online version contains supplementary material available at 10.1038/s41467-025-63741-3. Acknowledgements The authors’ research work has received funding from the National Institutes of Health (NIH) (R01HL151611, R01HL168174, P01HL172741, R35HL177389) and the National Center for Advancing Translational Sciences (NCATS) (Irving Scholar Award through UL1TR001873), the Marjorie and Lewis Katz Scholar Award, and the M. Iréne Ferrer Scholar Award (to H.Z.), R35HL145228 (to I.T.), R01NS077111 and R01NS101663 (to A.Y.), the Russell Berrie Foundation Diabetes Scholar Program (to X.W.), the American Heart Association Postdoctoral Fellowship 21POST829654 and Career Development Award 25CDA1451366 (to X.W.), the American Heart Association Postdoctoral Fellowship 20POST35130003 and Career Development Award 23CDA1052177 (to F.L.), and an National Science Foundation (NSF) predoctoral fellowship (to K.R.C.). We would like to acknowledge the NIH funding sources to the Columbia Center for Translational Immunology (CCTi) Flow Cytometry Core by grant number S10OD020056, S10RR027050 and P30DK063608; the NIH/NCI Cancer Center Support Grant P30CA013696 for the use of resources at the Columbia Genome Center; the Columbia Stem Cell Initiative (CSCI) Flow Cytometry Core under the leadership of Michael Kissner; and Nivia M. Urena at the Institute of Comparative Medicine (ICM) for technical support on blood chemistry analyzer. We acknowledge that design elements used in the schematic illustrations in this paper were adapted from publicly available resources provided by the NIAID NIH BIOART collection (bioart.niaid.nih.gov/bioart). Author contributions X.W. and H.Z. conceived and designed the project. X.W. performed majority of the experiments. Z.W. and J.C. assisted experiments. K.R.C., F.L., and R.K.S. provided technical support. X.W. and H.Z. performed bioinformatic analysis of the RNA-sequencing data. V.D.D. performed pathological and histological assessment. A.Y. established the mouse models for Cre-mediated knockout and overexpression of WDFY3 and provided critical intellectual input to WDFY3 biology. X.W. and H.Z. drafted the paper. I.T. and A.Y. critically read the paper. H.Z. supervised the project and funding. All the authors have read the paper and provided input to the paper. Peer review Peer review information Nature Communications Data availability All data are included in the paper or the Supplementary Information. The raw numbers for charts and graphs, and unedited gel images are available in the Source Data. Additional raw data are available from the authors, as are unique reagents used in this article. The RNA-sequencing data have been deposited in the Gene Expression Omnibus (GEO) repository under the accession code GSE290443 Source data Code availability Code for RNA-sequencing data analysis is available via the Zhang lab GitHub repository ( https://github.com/hanruizhang/NatCommun-bioRxiv.2024.608411 Competing interests Columbia University has filed patent applications related to this work for which K.R.C., A.Y., X.W. and H.Z. are inventors. The remaining authors declare no other competing interests. References 1. Doran, A. C., Yurdagul, A., Jr & Tabas, I. Efferocytosis in health and disease. Nat. Rev. Immunol. 20 10.1038/s41577-019-0240-6 PMC7667664 31822793 2. Boada-Romero, E., Martinez, J., Heckmann, B. L. & Green, D. R. The clearance of dead cells by efferocytosis. Nat. Rev. Mol. Cell Biol 21 10.1038/s41580-020-0232-1 PMC7392086 32251387 3. Sachet M Liang YY Oehler R The immune response to secondary necrotic cells Apoptosis 2017 22 1189 1204 10.1007/s10495-017-1413-z 28861714 PMC5630647 Sachet, M., Liang, Y. Y. & Oehler, R. The immune response to secondary necrotic cells. Apoptosis 22 28861714 10.1007/s10495-017-1413-z PMC5630647 4. Kawano M Nagata S Efferocytosis and autoimmune disease Int. Immunol. 2018 30 551 558 10.1093/intimm/dxy055 30165442 PMC6234909 Kawano, M. & Nagata, S. Efferocytosis and autoimmune disease. Int. Immunol. 30 30165442 10.1093/intimm/dxy055 PMC6234909 5. Suurmond J Diamond B Autoantibodies in systemic autoimmune diseases: specificity and pathogenicity J. Clin. Investig. 2015 125 2194 2202 10.1172/JCI78084 25938780 PMC4497746 Suurmond, J. & Diamond, B. Autoantibodies in systemic autoimmune diseases: specificity and pathogenicity. J. Clin. Investig. 125 25938780 10.1172/JCI78084 PMC4497746 6. Ma Y Efferocytosis in dendritic cells: an overlooked immunoregulatory process Front. Immunol. 2024 15 1415573 10.3389/fimmu.2024.1415573 38835772 PMC11148234 Ma, Y. et al. Efferocytosis in dendritic cells: an overlooked immunoregulatory process. Front. Immunol. 15 38835772 10.3389/fimmu.2024.1415573 PMC11148234 7. Mehrotra, P. & Ravichandran, K. S. Drugging the efferocytosis process: concepts and opportunities. Nat. Rev. Drug Discov. 21 10.1038/s41573-022-00470-y PMC9157040 35650427 8. Herrmann M Impaired phagocytosis of apoptotic cell material by monocyte-derived macrophages from patients with systemic lupus erythematosus Arthritis Rheum. 1998 41 1241 1250 10.1002/1529-0131(199807)41:7&#x0003c;1241::AID-ART15&#x0003e;3.0.CO;2-H 9663482 Herrmann, M. et al. Impaired phagocytosis of apoptotic cell material by monocyte-derived macrophages from patients with systemic lupus erythematosus. Arthritis Rheum. 41 9663482 10.1002/1529-0131(199807)41:7<1241::AID-ART15>3.0.CO;2-H 9. Baumann I Impaired uptake of apoptotic cells into tingible body macrophages in germinal centers of patients with systemic lupus erythematosus Arthritis Rheum. 2002 46 191 201 10.1002/1529-0131(200201)46:1&#x0003c;191::AID-ART10027&#x0003e;3.0.CO;2-K 11817590 Baumann, I. et al. Impaired uptake of apoptotic cells into tingible body macrophages in germinal centers of patients with systemic lupus erythematosus. Arthritis Rheum. 46 11817590 10.1002/1529-0131(200201)46:1<191::AID-ART10027>3.0.CO;2-K 10. Muñoz LE Remnants of secondarily necrotic cells fuel inflammation in systemic lupus erythematosus Arthritis Rheum. 2009 60 1733 1742 10.1002/art.24535 19479824 Muñoz, L. E. et al. Remnants of secondarily necrotic cells fuel inflammation in systemic lupus erythematosus. Arthritis Rheum. 60 19479824 10.1002/art.24535 11. Huang WN Tso TK Wu HC Yang HF Tsay GJ Impaired phagocytosis of apoptotic cell material in serologically active clinically quiescent patients with systemic lupus erythematosis Int. J. Rheum. Dis. 2016 19 1310 1316 10.1111/1756-185X.12826 26692544 Huang, W. N., Tso, T. K., Wu, H. C., Yang, H. F. & Tsay, G. J. Impaired phagocytosis of apoptotic cell material in serologically active clinically quiescent patients with systemic lupus erythematosis. Int. J. Rheum. Dis. 19 26692544 10.1111/1756-185X.12826 12. Hu H Defective efferocytosis by aged macrophages promotes STING signaling mediated inflammatory liver injury Cell Death Discov. 2023 9 236 10.1038/s41420-023-01497-9 37422464 PMC10329662 Hu, H. et al. Defective efferocytosis by aged macrophages promotes STING signaling mediated inflammatory liver injury. Cell Death Discov. 9 37422464 10.1038/s41420-023-01497-9 PMC10329662 13. Boucher, D. M. et al. Age-related impairments in immune cell efferocytosis and autophagy hinder atherosclerosis regression. Arterioscler. Thromb. Vasc. Biol. 45 10.1161/ATVBAHA.124.321662 PMC11936474 39945065 14. Cohen PL Delayed apoptotic cell clearance and lupus-like autoimmunity in mice lacking the c-mer membrane tyrosine kinase J. Exp. Med. 2002 196 135 140 10.1084/jem.20012094 12093878 PMC2194017 Cohen, P. L. et al. Delayed apoptotic cell clearance and lupus-like autoimmunity in mice lacking the c-mer membrane tyrosine kinase. J. Exp. Med. 196 12093878 10.1084/jem.20012094 PMC2194017 15. Rodriguez-Manzanet R T and B cell hyperactivity and autoimmunity associated with niche-specific defects in apoptotic body clearance in TIM-4-deficient mice Proc. Natl Acad. Sci. USA 2010 107 8706 8711 10.1073/pnas.0910359107 20368430 PMC2889349 Rodriguez-Manzanet, R. et al. T and B cell hyperactivity and autoimmunity associated with niche-specific defects in apoptotic body clearance in TIM-4-deficient mice. Proc. Natl Acad. Sci. USA 107 20368430 10.1073/pnas.0910359107 PMC2889349 16. Ramirez-Ortiz ZG The scavenger receptor SCARF1 mediates the clearance of apoptotic cells and prevents autoimmunity Nat. Immunol. 2013 14 917 926 10.1038/ni.2670 23892722 PMC3752698 Ramirez-Ortiz, Z. G. et al. The scavenger receptor SCARF1 mediates the clearance of apoptotic cells and prevents autoimmunity. Nat. Immunol. 14 23892722 10.1038/ni.2670 PMC3752698 17. Asano K Masking of phosphatidylserine inhibits apoptotic cell engulfment and induces autoantibody production in mice J. Exp. Med. 2004 200 459 467 10.1084/jem.20040342 15302904 PMC2211927 Asano, K. et al. Masking of phosphatidylserine inhibits apoptotic cell engulfment and induces autoantibody production in mice. J. Exp. Med. 200 15302904 10.1084/jem.20040342 PMC2211927 18. Hanayama R Autoimmune disease and impaired uptake of apoptotic cells in MFG-E8-deficient mice Science 2004 304 1147 1150 10.1126/science.1094359 15155946 Hanayama, R. et al. Autoimmune disease and impaired uptake of apoptotic cells in MFG-E8-deficient mice. Science 304 15155946 10.1126/science.1094359 19. Shi J A genome-wide CRISPR screen identifies WDFY3 as a regulator of macrophage efferocytosis Nat. Commun. 2022 13 7929 10.1038/s41467-022-35604-8 36566259 PMC9789999 Shi, J. et al. A genome-wide CRISPR screen identifies WDFY3 as a regulator of macrophage efferocytosis. Nat. Commun. 13 36566259 10.1038/s41467-022-35604-8 PMC9789999 20. Dragich, J. M. et al. Autophagy linked FYVE (Alfy/WDFY3) is required for establishing neuronal connectivity in the mammalian brain. eLife 5 10.7554/eLife.14810 PMC5030082 27648578 21. Clausen BE Burkhardt C Reith W Renkawitz R Förster I Conditional gene targeting in macrophages and granulocytes using LysMcre mice Transgenic Res. 1999 8 265 277 10.1023/A:1008942828960 10621974 Clausen, B. E., Burkhardt, C., Reith, W., Renkawitz, R. & Förster, I. Conditional gene targeting in macrophages and granulocytes using LysMcre mice. Transgenic Res. 8 10621974 10.1023/a:1008942828960 22. Mevorach D Zhou JL Song X Elkon KB Systemic exposure to irradiated apoptotic cells induces autoantibody production J. Exp. Med. 1998 188 387 392 10.1084/jem.188.2.387 9670050 PMC2212450 Mevorach, D., Zhou, J. L., Song, X. & Elkon, K. B. Systemic exposure to irradiated apoptotic cells induces autoantibody production. J. Exp. Med. 188 9670050 10.1084/jem.188.2.387 PMC2212450 23. Zheng Y Liu Q Goronzy JJ Weyand CM Immune aging—a mechanism in autoimmune disease Semin. Immunol. 2023 69 101814 10.1016/j.smim.2023.101814 37542986 PMC10663095 Zheng, Y., Liu, Q., Goronzy, J. J. & Weyand, C. M. Immune aging—a mechanism in autoimmune disease. Semin. Immunol. 69 37542986 10.1016/j.smim.2023.101814 PMC10663095 24. Groom JR Luster AD CXCR3 in T cell function Exp. Cell Res. 2011 317 620 631 10.1016/j.yexcr.2010.12.017 21376175 PMC3065205 Groom, J. R. & Luster, A. D. CXCR3 in T cell function. Exp. Cell Res. 317 21376175 10.1016/j.yexcr.2010.12.017 PMC3065205 25. Westerterp M Cholesterol accumulation in dendritic cells links the inflammasome to acquired immunity Cell Metab. 2017 25 1294 1304.e1296 10.1016/j.cmet.2017.04.005 28479366 PMC5514787 Westerterp, M. et al. Cholesterol accumulation in dendritic cells links the inflammasome to acquired immunity. Cell Metab. 25 28479366 10.1016/j.cmet.2017.04.005 PMC5514787 26. Theisen DJ WDFY4 is required for cross-presentation in response to viral and tumor antigens Science 2018 362 694 699 10.1126/science.aat5030 30409884 PMC6655551 Theisen, D. J. et al. WDFY4 is required for cross-presentation in response to viral and tumor antigens. Science 362 30409884 10.1126/science.aat5030 PMC6655551 27. Guerriero JL Macrophages: their untold story in T cell activation and function Int. Rev. Cell Mol. Biol. 2019 342 73 93 10.1016/bs.ircmb.2018.07.001 30635094 Guerriero, J. L. Macrophages: their untold story in T cell activation and function. Int. Rev. Cell Mol. Biol. 342 30635094 10.1016/bs.ircmb.2018.07.001 28. Vande Walle L Lamkanfi M Drugging the NLRP3 inflammasome: from signalling mechanisms to therapeutic targets Nat. Rev. Drug Discov. 2024 23 43 66 10.1038/s41573-023-00822-2 38030687 Vande Walle, L. & Lamkanfi, M. Drugging the NLRP3 inflammasome: from signalling mechanisms to therapeutic targets. Nat. Rev. Drug Discov. 23 38030687 10.1038/s41573-023-00822-2 29. Fu J Wu H Structural mechanisms of NLRP3 inflammasome assembly and activation Annu. Rev. Immunol. 2023 41 301 316 10.1146/annurev-immunol-081022-021207 36750315 PMC10159982 Fu, J. & Wu, H. Structural mechanisms of NLRP3 inflammasome assembly and activation. Annu. Rev. Immunol. 41 36750315 10.1146/annurev-immunol-081022-021207 PMC10159982 30. Hoss F Rodriguez-Alcazar JF Latz E Assembly and regulation of ASC specks Cell Mol. Life Sci. 2017 74 1211 1229 10.1007/s00018-016-2396-6 27761594 PMC11107573 Hoss, F., Rodriguez-Alcazar, J. F. & Latz, E. Assembly and regulation of ASC specks. Cell Mol. Life Sci. 74 27761594 10.1007/s00018-016-2396-6 PMC11107573 31. Ben-Sasson SZ Wang K Cohen J Paul WE IL-1β strikingly enhances antigen-driven CD4 and CD8 T-cell responses Cold Spring Harb. Symp. Quant. Biol. 2013 78 117 124 10.1101/sqb.2013.78.021246 24092469 Ben-Sasson, S. Z., Wang, K., Cohen, J. & Paul, W. E. IL-1β strikingly enhances antigen-driven CD4 and CD8 T-cell responses. Cold Spring Harb. Symp. Quant. Biol. 78 24092469 10.1101/sqb.2013.78.021246 32. Peng Y Elkon KB Autoimmunity in MFG-E8-deficient mice is associated with altered trafficking and enhanced cross-presentation of apoptotic cell antigens J. Clin. Investig. 2011 121 2221 2241 10.1172/JCI43254 21537078 PMC3104739 Peng, Y. & Elkon, K. B. Autoimmunity in MFG-E8-deficient mice is associated with altered trafficking and enhanced cross-presentation of apoptotic cell antigens. J. Clin. Investig. 121 21537078 10.1172/JCI43254 PMC3104739 33. Jiang Q Role of Th22 cells in the pathogenesis of autoimmune diseases Front. Immunol. 2021 12 688066 10.3389/fimmu.2021.688066 34295334 PMC8290841 Jiang, Q. et al. Role of Th22 cells in the pathogenesis of autoimmune diseases. Front. Immunol. 12 34295334 10.3389/fimmu.2021.688066 PMC8290841 34. Croce, K. R. et al. A rare genetic variant confers resistance to neurodegeneration across multiple neurological disorders by augmenting selective autophagy. Neuron 10.1016/j.neuron.2025.08.018 PMC12435916 40945514 35. Tang SH Silva FJ Tsark WM Mann JRA Cre/loxP-deleter transgenic line in mouse strain 129S1/SvImJ Genes 2002 32 199 202 10.1002/gene.10030 11892008 Tang, S. H., Silva, F. J., Tsark, W. M. & Mann, J. R. A. Cre/loxP-deleter transgenic line in mouse strain 129S1/SvImJ. Genes 32 10.1002/gene.10030 11892008 36. Peña-Martinez C Rickman AD Heckmann BL Beyond autophagy: LC3-associated phagocytosis and endocytosis Sci. Adv. 2022 8 eabn1702 10.1126/sciadv.abn1702 36288309 PMC9604515 Peña-Martinez, C., Rickman, A. D. & Heckmann, B. L. Beyond autophagy: LC3-associated phagocytosis and endocytosis. Sci. Adv. 8 36288309 10.1126/sciadv.abn1702 PMC9604515 37. Cifone MG Dexamethasone-induced thymocyte apoptosis: apoptotic signal involves the sequential activation of phosphoinositide-specific phospholipase C, acidic sphingomyelinase, and caspases Blood 1999 93 2282 2296 10.1182/blood.V93.7.2282 10090938 Cifone, M. G. et al. Dexamethasone-induced thymocyte apoptosis: apoptotic signal involves the sequential activation of phosphoinositide-specific phospholipase C, acidic sphingomyelinase, and caspases. Blood 93 10090938 38. Schilperoort M The role of efferocytosis-fueled macrophage metabolism in the resolution of inflammation Immunol. Rev. 2023 319 65 80 10.1111/imr.13214 37158427 PMC10615666 Schilperoort, M. et al. The role of efferocytosis-fueled macrophage metabolism in the resolution of inflammation. Immunol. Rev. 319 37158427 10.1111/imr.13214 PMC10615666 39. Yurdagul A Jr ODC (Ornithine Decarboxylase)-Dependent Putrescine Synthesis Maintains MerTK (MER Tyrosine-Protein Kinase) Expression to Drive Resolution Arterioscler. Thromb. Vasc. Biol. 2021 41 e144 e159 10.1161/ATVBAHA.120.315622 33406854 PMC8034502 Yurdagul, A. Jr et al. ODC (Ornithine Decarboxylase)-Dependent Putrescine Synthesis Maintains MerTK (MER Tyrosine-Protein Kinase) Expression to Drive Resolution. Arterioscler. Thromb. Vasc. Biol. 41 33406854 10.1161/ATVBAHA.120.315622 PMC8034502 40. Ampomah PB Macrophages use apoptotic cell-derived methionine and DNMT3A during efferocytosis to promote tissue resolution Nat. Metab. 2022 4 444 457 10.1038/s42255-022-00551-7 35361955 PMC9050866 Ampomah, P. B. et al. Macrophages use apoptotic cell-derived methionine and DNMT3A during efferocytosis to promote tissue resolution. Nat. Metab. 4 35361955 10.1038/s42255-022-00551-7 PMC9050866 41. Ngai D Sukka SR Tabas I Crosstalk between efferocytic myeloid cells and T-cells and its relevance to atherosclerosis Front. Immunol. 2024 15 1403150 10.3389/fimmu.2024.1403150 38873597 PMC11169609 Ngai, D., Sukka, S. R. & Tabas, I. Crosstalk between efferocytic myeloid cells and T-cells and its relevance to atherosclerosis. Front. Immunol. 15 38873597 10.3389/fimmu.2024.1403150 PMC11169609 42. Søreng, K. et al. ALFY localizes to early endosomes and cellular protrusions to facilitate directional cell migration. J. Cell Sci. 135 10.1242/jcs.259138 PMC8919339 35099014 43. Roche PA Furuta K The ins and outs of MHC class II-mediated antigen processing and presentation Nat. Rev. Immunol. 2015 15 203 216 10.1038/nri3818 25720354 PMC6314495 Roche, P. A. & Furuta, K. The ins and outs of MHC class II-mediated antigen processing and presentation. Nat. Rev. Immunol. 15 25720354 10.1038/nri3818 PMC6314495 44. Münz C Autophagy beyond intracellular MHC class II antigen presentation Trends Immunol. 2016 37 755 763 10.1016/j.it.2016.08.017 27667710 Münz, C. Autophagy beyond intracellular MHC class II antigen presentation. Trends Immunol. 37 27667710 10.1016/j.it.2016.08.017 45. Filimonenko M Functional multivesicular bodies are required for autophagic clearance of protein aggregates associated with neurodegenerative disease J. Cell Biol. 2007 179 485 500 10.1083/jcb.200702115 17984323 PMC2064794 Filimonenko, M. et al. Functional multivesicular bodies are required for autophagic clearance of protein aggregates associated with neurodegenerative disease. J. Cell Biol. 179 17984323 10.1083/jcb.200702115 PMC2064794 46. Filimonenko M The selective macroautophagic degradation of aggregated proteins requires the PI3P-binding protein Alfy Mol. Cell 2010 38 265 279 10.1016/j.molcel.2010.04.007 20417604 PMC2867245 Filimonenko, M. et al. The selective macroautophagic degradation of aggregated proteins requires the PI3P-binding protein Alfy. Mol. Cell 38 20417604 10.1016/j.molcel.2010.04.007 PMC2867245 47. Reinhart EF A highly conserved glutamic acid in ALFY inhibits membrane binding to aid in aggregate clearance Traffic (Cph., Den.) 2021 22 23 37 10.1111/tra.12771 PMC7902475 33225481 Reinhart, E. F. et al. A highly conserved glutamic acid in ALFY inhibits membrane binding to aid in aggregate clearance. Traffic (Cph., Den.) 22 10.1111/tra.12771 PMC7902475 33225481 48. Yamamoto A Simonsen A Alfy-dependent elimination of aggregated proteins by macroautophagy: can there be too much of a good thing? Autophagy 2011 7 346 350 10.4161/auto.7.3.14234 21150266 PMC3060415 Yamamoto, A. & Simonsen, A. Alfy-dependent elimination of aggregated proteins by macroautophagy: can there be too much of a good thing?. Autophagy 7 21150266 10.4161/auto.7.3.14234 PMC3060415 49. Poon, I. K. H. & Ravichandran, K. S. Targeting efferocytosis in inflammaging. Annu. Rev. Pharmacol. Toxicol 64 10.1146/annurev-pharmtox-032723-110507 37585658 50. Liebold I Apoptotic cell identity induces distinct functional responses to IL-4 in efferocytic macrophages Science 2024 384 eabo7027 10.1126/science.abo7027 38574142 Liebold, I. et al. Apoptotic cell identity induces distinct functional responses to IL-4 in efferocytic macrophages. Science 384 38574142 10.1126/science.abo7027 51. Better J Cell type-specific efferocytosis determines functional plasticity of alveolar macrophages Sci. Immunol. 2025 10 eadl3852 10.1126/sciimmunol.adl3852 40315300 Better, J. et al. Cell type-specific efferocytosis determines functional plasticity of alveolar macrophages. Sci. Immunol. 10 40315300 10.1126/sciimmunol.adl3852 52. Hogquist KA T cell receptor antagonist peptides induce positive selection Cell 1994 76 17 27 10.1016/0092-8674(94)90169-4 8287475 Hogquist, K. A. et al. T cell receptor antagonist peptides induce positive selection. Cell 76 8287475 10.1016/0092-8674(94)90169-4 53. Barnden MJ Allison J Heath WR Carbone FR Defective TCR expression in transgenic mice constructed using cDNA-based alpha- and beta-chain genes under the control of heterologous regulatory elements Immunol. Cell Biol. 1998 76 34 40 10.1046/j.1440-1711.1998.00709.x 9553774 Barnden, M. J., Allison, J., Heath, W. R. & Carbone, F. R. Defective TCR expression in transgenic mice constructed using cDNA-based alpha- and beta-chain genes under the control of heterologous regulatory elements. Immunol. Cell Biol. 76 9553774 10.1046/j.1440-1711.1998.00709.x 54. Campisi L In vitro antigen-presentation assay for self- and microbial-derived antigens Bio Protoc. 2017 7 e2307 10.21769/BioProtoc.2307 34541075 PMC8410294 Campisi, L. In vitro antigen-presentation assay for self- and microbial-derived antigens. Bio Protoc. 7 34541075 10.21769/BioProtoc.2307 PMC8410294 55. Zhang H Functional analysis and transcriptomic profiling of iPSC-derived macrophages and their application in modeling Mendelian disease Circ. Res. 2015 117 17 28 10.1161/CIRCRESAHA.117.305860 25904599 PMC4565503 Zhang, H. et al. Functional analysis and transcriptomic profiling of iPSC-derived macrophages and their application in modeling Mendelian disease. Circ. Res. 117 25904599 10.1161/CIRCRESAHA.117.305860 PMC4565503 56. Gerlach, B. D. et al. Efferocytosis induces macrophage proliferation to help resolve tissue injury. Cell Metab. 33 10.1016/j.cmet.2021.10.015 PMC8665147 34784501 57. Moon H Crbn modulates calcium influx by regulating Orai1 during efferocytosis Nat. Commun. 2020 11 5489 10.1038/s41467-020-19272-0 33127885 PMC7603501 Moon, H. et al. Crbn modulates calcium influx by regulating Orai1 during efferocytosis. Nat. Commun. 11 33127885 10.1038/s41467-020-19272-0 PMC7603501 58. Wu X Wang Z Tyler S Zhang H Efferocytosis assay to quantify the engulfment and acidification of apoptotic cells by macrophages using flow cytometry STAR Protoc. 2024 5 103215 10.1016/j.xpro.2024.103215 39068649 PMC11338188 Wu, X., Wang, Z., Tyler, S. & Zhang, H. Efferocytosis assay to quantify the engulfment and acidification of apoptotic cells by macrophages using flow cytometry. STAR Protoc. 5 39068649 10.1016/j.xpro.2024.103215 PMC11338188 59. Ravishankar B Tolerance to apoptotic cells is regulated by indoleamine 2,3-dioxygenase Proc. Natl Acad. Sci. USA 2012 109 3909 3914 10.1073/pnas.1117736109 22355111 PMC3309765 Ravishankar, B. et al. Tolerance to apoptotic cells is regulated by indoleamine 2,3-dioxygenase. Proc. Natl Acad. Sci. USA 109 22355111 10.1073/pnas.1117736109 PMC3309765 60. Shi, H. et al. Loss of TIM4-dependent efferocytosis in Kupffer cells promotes liver fibrosis in nonalcoholic steatohepatitis. bioRxiv 61. Trouw LA Anti-C1q autoantibodies deposit in glomeruli but are only pathogenic in combination with glomerular C1q-containing immune complexes J. Clin. Investig. 2004 114 679 688 10.1172/JCI200421075 15343386 PMC514584 Trouw, L. A. et al. Anti-C1q autoantibodies deposit in glomeruli but are only pathogenic in combination with glomerular C1q-containing immune complexes. J. Clin. Investig. 114 15343386 10.1172/JCI21075 PMC514584 62. Moldoveanu Z Experimental evidence of pathogenic role of IgG autoantibodies in IgA nephropathy J. Autoimmun. 2021 118 102593 10.1016/j.jaut.2021.102593 33508637 PMC7997636 Moldoveanu, Z. et al. Experimental evidence of pathogenic role of IgG autoantibodies in IgA nephropathy. J. Autoimmun. 118 33508637 10.1016/j.jaut.2021.102593 PMC7997636 63. Wang X Hepatocyte TAZ/WWTR1 promotes inflammation and fibrosis in nonalcoholic steatohepatitis Cell Metab. 2016 24 848 862 10.1016/j.cmet.2016.09.016 28068223 PMC5226184 Wang, X. et al. Hepatocyte TAZ/WWTR1 promotes inflammation and fibrosis in nonalcoholic steatohepatitis. Cell Metab. 24 28068223 10.1016/j.cmet.2016.09.016 PMC5226184 64. Li S STING-induced regulatory B cells compromise NK function in cancer immunity Nature 2022 610 373 380 10.1038/s41586-022-05254-3 36198789 PMC9875944 Li, S. et al. STING-induced regulatory B cells compromise NK function in cancer immunity. Nature 610 36198789 10.1038/s41586-022-05254-3 PMC9875944 65. Golubovskaya, V. & Wu, L. Different subsets of T cells, memory, effector functions, and CAR-T immunotherapy. Cancers (Basel) 8 10.3390/cancers8030036 PMC4810120 26999211 66. Ghosh M Shapiro LH In vitro Ag cross-presentation and in vivo Ag cross-presentation by dendritic cells in the mouse Bio Protoc. 2012 2 e305 10.21769/BioProtoc.305 27030824 PMC4809020 Ghosh, M. & Shapiro, L. H. In vitro Ag cross-presentation and in vivo Ag cross-presentation by dendritic cells in the mouse. Bio Protoc. 2 27030824 10.21769/bioprotoc.305 PMC4809020 67. Kawasaki T Alveolar macrophages instruct CD8(+) T cell expansion by antigen cross-presentation in lung Cell Rep. 2022 41 111828 10.1016/j.celrep.2022.111828 36516765 Kawasaki, T. et al. Alveolar macrophages instruct CD8(+) T cell expansion by antigen cross-presentation in lung. Cell Rep. 41 36516765 10.1016/j.celrep.2022.111828 68. Rawson PM Cross-presentation of caspase-cleaved apoptotic self antigens in HIV infection Nat. Med. 2007 13 1431 1439 10.1038/nm1679 18026114 Rawson, P. M. et al. Cross-presentation of caspase-cleaved apoptotic self antigens in HIV infection. Nat. Med. 13 18026114 10.1038/nm1679 69. Martinez J Detection of LC3-associated phagocytosis (LAP) Curr. Protoc. Cell Biol. 2020 87 e104 10.1002/cpcb.104 32436654 PMC9285819 Martinez, J. Detection of LC3-associated phagocytosis (LAP). Curr. Protoc. Cell Biol. 87 32436654 10.1002/cpcb.104 PMC9285819 70. Hara H Phosphorylation of the adaptor ASC acts as a molecular switch that controls the formation of speck-like aggregates and inflammasome activity Nat. Immunol. 2013 14 1247 1255 10.1038/ni.2749 24185614 PMC4813763 Hara, H. et al. Phosphorylation of the adaptor ASC acts as a molecular switch that controls the formation of speck-like aggregates and inflammasome activity. Nat. Immunol. 14 24185614 10.1038/ni.2749 PMC4813763 71. Tahtinen S IL-1 and IL-1ra are key regulators of the inflammatory response to RNA vaccines Nat. Immunol. 2022 23 532 542 10.1038/s41590-022-01160-y 35332327 Tahtinen, S. et al. IL-1 and IL-1ra are key regulators of the inflammatory response to RNA vaccines. Nat. Immunol. 23 35332327 10.1038/s41590-022-01160-y 72. Lang C Efferocytosis drives myeloid NLRP3 dependent inflammasome signaling secretion of IL-1β to promote tumor growth Front. Immunol. 2022 13 993771 10.3389/fimmu.2022.993771 36439171 PMC9681818 Lang, C. et al. Efferocytosis drives myeloid NLRP3 dependent inflammasome signaling secretion of IL-1β to promote tumor growth. Front. Immunol. 13 36439171 10.3389/fimmu.2022.993771 PMC9681818 73. Yalcinkaya M BRCC3-mediated NLRP3 deubiquitylation promotes inflammasome activation and atherosclerosis in Tet2 clonal hematopoiesis Circulation 2023 148 1764 1777 10.1161/CIRCULATIONAHA.123.065344 37781816 PMC10872582 Yalcinkaya, M. et al. BRCC3-mediated NLRP3 deubiquitylation promotes inflammasome activation and atherosclerosis in Tet2 clonal hematopoiesis. Circulation 148 37781816 10.1161/CIRCULATIONAHA.123.065344 PMC10872582 ",
  "metadata": {
    "Title of this paper": "BRCC3-mediated NLRP3 deubiquitylation promotes inflammasome activation and atherosclerosis in Tet2 clonal hematopoiesis",
    "Journal it was published in:": "Nature Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484792/"
  }
}