{
  "title": "Paper_295",
  "abstract": "pmc Front Nutr Front Nutr 2731 fnut Front. Nutr. Frontiers in Nutrition 2296-861X Frontiers Media SA PMC12488413 PMC12488413.1 12488413 12488413 10.3389/fnut.2025.1666919 1 Nutrition Original Research Modulation of LPS-induced RAW 264.7 macrophages by Pulsatilla koreana Han Yaxi  1  2 Zhang Xindi  1  2 Zhu Ling  1  2 Wang Kunlun  1  2 Sha Dixin  1  2 Ji Nina  3 Fan Jing  1  2 Chen Qing  1  2 Chen Kaixin  1  2 Zhou Ye  1  2 Yao Xinmiao  1  2 Li Bo  1  2 Guan Lijun  1  2  * 1 Institute of Food Processing, Heilongjiang Academy of Agricultural Sciences Harbin China 2 Key Laboratory of Food Processing of Heilongjiang Province Harbin China 3 Soybean Institute, Heilongjiang Academy of Agricultural Sciences Harbin China Edited by: Iris Joye Reviewed by: Xingyue Xu Mahmood S. Jameel *Correspondence: Lijun Guan, guanlijun1983@gmail.com 18 9 2025 2025 12 480739 1666919 16 7 2025 03 9 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Han, Zhang, Zhu, Wang, Sha, Ji, Fan, Chen, Chen, Zhou, Yao, Li and Guan. 2025 Han, Zhang, Zhu, Wang, Sha, Ji, Fan, Chen, Chen, Zhou, Yao, Li and Guan https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Biosynthesis of gold nanoparticles using medicinal plants has emerged as a promising strategy in nanobiotechnology due to their distinctive therapeutic attributes, including biological specificity, low cytotoxicity, and inherent biocompatibility. This study presents a straightforward phytosynthetic approach that eliminates requirements for additional stabilizing agents, demonstrating exceptional process simplicity and efficiency. The formation of Pk-AuNps was confirmed by UV–Vis spectroscopy with maximum absorbance at 540 nm. Comprehensive characterization through FE-TEM, EDX, and XRD revealed spherical morphology with face-centered cubic crystalline structure, while FTIR identified critical functional groups responsible for biological activity of Pk-AuNps. DPPH radical scavenging, ABTS inhibition, and ferric reducing power analysis further revealed that Pk-AuNps possess strong antioxidant activity. Cytocompatibility evaluations in RAW264.7 and A549 cell lines revealed excellent biosafety characteristics of Pk-AuNps, highlighting their biocompatibility for potential biomedical applications. Furthermore, the anti-inflammatory properties of Pk-AuNps in LPS-stimulated murine macrophages were also investigated. Notably, Pk-AuNps demonstrated potent anti-inflammatory effects in LPS-activated macrophages, significantly attenuating pro-inflammatory mediators through dual mechanisms: (1) Inhibition of NO and PGE2 production, and (2) Downregulation of iNOS and COX-2 gene expression. These findings indicate that Pk-AuNps show promise as functional food ingredients, demonstrating multifunctional bioactive properties to developing anti-inflammatory nutraceuticals. Graphical abstract  Diagram showing the synthesis and analysis of Pk-AuNPs using Pulastilla koreana extract and gold chloride trihydrate. Upper left: Image of the herb and its extract. Center: Microscopic image of synthesized nanoparticles. At the bottom left: Spectroscopy charts for characterization. Upper right: Gold chloride image. Bottom right: Bar graphs displaying the anti-inflammatory effects on RAW264.7 cells, indicating various concentrations and responses. Pulsatilla koreana phytosynthesis gold nanoparticle anti-inflammation functional food The author(s) declare that financial support was received for the research and/or publication of this article. ﻿This research was funded by Central Guidance for Local Science and Technology Development Special Project (Modern Agriculture Provincial Laboratory Project, ZY04JD05-012), and the Agricultural science and technology innovation project of Heilongjiang Academy of Agricultural Sciences (CX25JC54). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Nutrition and Food Science Technology 1 Introduction Pulsatilla koreana 1 2 3 4 5 6 7 P. koreana Critically, the precise mechanism by which the plant extract governs the synthesis of stable metallic nanoparticles has been elucidated. Phytocompounds such as flavonoids, alkaloids, polyphenols, terpenoids, poly-saccharides, amino acids, organic acids, and vitamins could play key roles in reducing metal ions and stabilizing the resulting nanoparticles ( 8 9 10 In light of the growing emphasis on green nutritional supplements, AuNps derived from medicinal plants have gained substantial research interest. Recent studies further highlight the broad potential and applicability of plant-mediated biosynthesis of AuNps ( 11 Hibiscus syriacus 12 To the best of our knowledge, this study is the first to report the use of aqueous root extract from P. koreana 13 14–16 17 18 19 In addition to synthesis, our objective is to create a cost-effective and eco-friendly synthesis method and to investigate the anti-inflammatory mechanisms of these nanoparticles in lipopolysaccharide (LPS)-induced RAW264.7 murine macrophages. Capitalizing on the traditional use of P. koreana in vitro 2 Materials and methods 2.1 Materials Dried root segments of Pulsatilla koreana 4 2 2.2 Preparation of Pulsatilla koreana Segments of the P. koreana 20 2.3 Phytosynthesis of Pk-AuNps The fabrication of gold nanoparticles was achieved through the reduction of HAuCl 4 2 4 2 (v/v) P. koreana 4 2 in vitro 21 22 2.4 Characterization of Pk-AuNps The presence and characteristic optical properties of the synthesized nanoparticles were confirmed using a Ultraviolet–Visible (UV–Vis) spectrophotometer (Ultrospec 2100 Pro, Amersham Biosciences), with the samples being scanned across a wavelength range of 300–800 nm ( 23 24 The crystallite size of the nanoparticles was determined by X-Ray Diffraction Analysis (XRD) technique (D8 Advance, Bruker, Germany) ( 25 D = 0.9 λ β cos θ where D λ θ 26 The hydrodynamic diameter and Polydispersity Index (PDI) of the nanoparticles were assessed using a Particle size analyzer (DLS-Photal, Otsuka Electronics, Japan) ( 27 28 Moreover, the functional groups present on the surface of the eco-friendly synthesized Pk-AuNps were elucidated using a PerkinElmer Spectrum One Fourier Transform Infrared Spectroscopy (FTIR) spectrometer (PerkinElmer Inc., Waltham, MA, United States) covering the wave range of 4,000–450 cm −1 −1 29 2.5 Antioxidant activity of Pk-AuNps The antioxidant activity of Pk-AuNps was assessed utilizing the DPPH radical scavenging assay ( 30 31 32 The percentage of free radical scavenging activity was quantified using the following equation: Inhibition ( % ) = A Control − A Sample A Control × 100 where A Control A Sample The ABTS radical scavenging activity of Pk-Nps was evaluated with slight modifications. 7.4 mmol/L ABTS solution was prepared in 2.5 mmol/L potassium persulfate. Then, the solution was incubated in the dark for 12–18 h at room temperature to obtain a stable oxidative. The stock solution of ABTS was incubated because ABTS and potassium per-sulfate reacted with each other stoichiometrically at a ratio of 0.5:1.0. This ultimately resulted in the incomplete oxidation of ABTS. However, the solution of ABTS oxidized immediately. To attain the maximal absorbance, solution must be elapsed for at least 5–6 h in the dark. Furthermore, the radical becomes stable when it is stored at room temperature in the dark for more than 2 days. To obtain an absorbance of 0.4 at 734 nm, the solution was diluted with sodium-phosphate buffer (10 mmol/L, pH 7.4). Then, 1 mL of Pk-AuNps of various concentrations (100–1,000 ppm) were mixed with the solution of ABTS. This mixed solution was incubated for 60 min in the dark. For the standard, ascorbic acid was used. Standard methanol was used as a blank. All the absorbances were noted for each sample and standard. At the wavelength 734 nm, absorbance was calculated using the same formula as DPPH radical scavenging. 2.6 Reducing power assay For the measurement of the reductive ability, we tested the Fe 3+ 2+ 33 Reducing power ( % ) = A Control − A Sample A Control × 100 where A Control A Sample 2.7 In vitro 2.7.1 Cell culture The RAW264.7 and A549 cell lines were independently cultured in DMEM and RPMI-1640 medium, respectively. Each medium was supplemented with 10% FBS and 1% Penicillin–Streptomycin to enhance cell viability and prevent microbial contamination. The cells were maintained under optimal growth conditions: at 37 °C in a humidified incubator with a 5% CO 2 2.7.2 Cell viability assessment of Pk-AuNps The in vitro 34 4 2.7.3 Measurement of NO, PGE2, and TNF-α production The murine macrophage RAW264.7 cells were co-treated with 1 μg/mL LPS and a dose of Pk-AuNps and then subjected to a 24 h incubation period. The supernatant was collected for further analysis. To detect the level of nitric oxide (NO), an equal volume of Griess reagent was combined with 100 μL of the harvested culture supernatant. This mixture was then assessed using a multi-plate reader, set to a wavelength of 540 nm. The levels of Prostaglandin E2 (PGE2) and Tumer Necrosis Factor-α (TNF-α) were determined through Enzyme-Linked Immunosorbent Assay (ELISA) commercially available kits strictly following the manufacturer’s procedures (R&D Systems, Minneapolis, MN, United States) ( 20 2.7.4 ROS generation The capacity of Pk-AuNps to provoke oxidative stress was gaged using the DCFH-DA assay ( 35 2.7.5 Gene expression studies RAW264.7 macrophages were seeded at a density of 1 × 10 6 Table 1 20 GAPDH 36 Table 1 Primer sequences used for gene expression analysis by qPCR. Primer Sequence  iNOS Forward: 5′-GTG GTG ACA ACG ACA TTT GG-3′ Reverse: 5′-GGC TGG ACT TTT CAC TCT GC-3′  COX-2 Forward: 5′-GGA TGC GCT GAA ACG TGG A-3′ Reverse: 5′-CAG GAA TGA GTA CAC GAA GCC-3′  TNF-α Forward: 5′-AGT CCG GGC AGG TCT ACT TT-3′ Reverse: 5′-GCA CCT CAG GGA AGA GTC TG-3′  GAPDH Forward: 5′-CAA GGT CAT CCA TGA CAA CTT TG-3′ Reverse: 5′-GTC CAC CAC CCT GTT GCT GTA G-3′ 2.7.6 Immunofluorescence staining RAW264.7 cells were cultured overnight on 8-well chamber slides (SPL Life Sciences Co., Ltd., Korea). The cells were pre-conditioned with Pk-AuNps for 2 h to evaluate their potential modulatory effects, followed by a stimulation phase with LPS (1 μg/mL) for an additional 2 h. Subsequently, the cells were meticulously washed with PBS, then fixed with a 3.7% formaldehyde solution to preserve cellular morphology and permeabilized with 0.5% Triton X-100 for 10 min to facilitate antibody penetration. Followed, the slides were incubated overnight at 4 °C with rabbit monoclonal anti-NF-κB p65 antibodies (1:100 dilution; Santa Cruz Biotechnology, Santa Cruz, CA, United States). After thorough washing to remove unbound primary antibodies, the slides were incubated in the dark for 1 h with Alexa Fluor 488-conjugated goat anti-rabbit IgG secondary antibodies (1:200; Cell Signaling Technology, Beverly, MA, United States) to detect the primary antibody binding. For nuclear counterstaining, the slides were performed using DAPI, a fluorescent stain, at a concentration of 10 mg/mL for 15 min, allowing for the visualization of cellular nuclei. Finally, the immunofluorescence-stained slides were examined using an inverted research fluorescence microscope, capturing images that reveal the intracellular localization of NF-κB p65 in response to the experimental treatments ( 37–39 2.8 Statistical analysis Experimental trials were performed in triplicate to ensure their accuracy and reliability. The resultant data are presented as the mean value ± SD value. For the identification of significant differences among groups, the p p 3 Results and discussions 3.1 Phytosynthesis of gold nanoparticles The green synthesis of gold nanoparticles using P. koreana The formation of Pk-AuNps was characterized by a profound visual indicator—a deep purple coloration that emerged almost instantaneously, insets from Figures 1a b 23 P. koreana Figure 1 Time (a) (b) (c) (d,e) (f) (a) UV-visible spectra showing absorbance changes of a solution over time. Inset shows color change from yellowish to dark purple. (b) Similar spectra for different temperatures, with a color change inset. (c) TEM image showing nanoparticles. (d) Electron image indicating nanoparticle morphology. (e) Elemental map highlighting red spots. (f) EDX spectrum displaying peaks for gold (Au). Additionally, following a 30-s incubation period, the UV–Vis spectrum of Pk-AuNPs exhibited a maximum absorption peak at 540 nm ( Figure 1 40 41 Under the standard reaction conditions employing 10% ( v/v P. koreana Furthermore, the biosynthesis of Pk-AuNps was evaluated across a temperature range from 20 to 80 °C ( Figure 1b 3.2 Characterization of Pk-AuNps 3.2.1 FE-TEM analysis Employing FE-TEM, we conducted a comprehensive investigation to elucidate the characteristics and dimensionality of the synthesized nanostructures ( 42 Figures 1c d P. koreana Elemental mapping of the nanoparticles provided a vivid electron imagery, confirming the elemental uniformity across the particles, as depicted in Figures 1d e The purity of these metallic nanoparticles was further authenticated through meticulous examination of the EXD spectra, ensuring the high-quality material needed for advanced nanodevices ( 43 Figure 1f The ability to control the crystallographic facets is pivotal for tailoring the electronic properties of gold nanoparticles, which is an innovative aspect of our methodology, highlighting the potential for their use in nanoscale devices with specific performance criteria. 3.2.2 XRD analysis The XRD pattern of the crystalline Pk-AuNps, with its pronounced and intense diffraction peaks as highlighted in Figure 2a 44 Figure 2 XRD analysis (a) (b) (c) (d) (e) (a) X-ray diffraction (XRD) pattern showing peaks at (111), (200), (220), and (311) angles. (b) Electron diffraction pattern with labeled rings corresponding to (111), (200), (220), and (311) planes. (c) Volume distribution histogram with cumulative curve showing particle diameter in nanometers. (d) Number distribution histogram and cumulative curve showing particle diameter. (e) Intensity distribution histogram and cumulative curve for particle diameter. The four characteristic diffraction peaks, indexed to the [111], [200], [220], and [311] lattice, and primarily composed of [111] orientation, align with Bragg’s law and the reference patterns of the Joint Committee on Powder Diffraction Standards (JCPDS No. 04–0784). This precise peak assignment confirms the face-centered cubic (FCC) structure of the gold nanoparticles and reflects a high degree of crystallographic ordering, essential for their robust physical and chemical properties ( 45 46 47 Figure 2b In addition to the applications in catalysis, sensing, and electronics, the high crystallinity and biocompatibility of these nanoparticles also make them suitable candidates for innovative uses in the food science industry. For instance, the Pk-AuNps could be integrated into active food packaging to enhance the shelf life of perishable goods by preventing microbial contamination. Their inherent antimicrobial properties can be harnessed to create self-sanitizing surfaces that maintain food safety and quality. Furthermore, the gold nanoparticles’ non-toxic nature and ability to withstand high temperatures suggest their potential suitability for use in food processing environments, where they could contribute to thermal management applications. The innovative synthesis method employed in our study ensures the formation of highly crystalline nanoparticles with a narrow size distribution, which is evident from the sharp and intense peaks in the XRD pattern. This controlled synthesis is essential for achieving the uniformity expected in food-grade nanomaterials—a critical prerequisite for any future functional applications. It should be noted, however, that the actual performance and stability of these nanoparticles under realistic food processing conditions—such as exposure to thermal cycling, shear forces, or variable pH—have not been evaluated in this study and warrant further investigation. 3.2.3 Size distribution measurements The size distribution profile of the biosynthesized Pk-AuNps was meticulously characterized using DLS, a technique that assesses particle size with respect to volume, number, and intensity, as depicted in Figures 2c e P. koreana The primary and secondary metabolites of P. koreana 6 48 49 50 Moreover, the FE-TEM images corroborated the DLS findings by revealing a range of sizes within the nanoparticle population, confirming the moderate polydispersity. The acknowledgment of this moderate polydispersity is crucial for applications requiring a tailored size distribution, such as nutrient delivery or sensing applications, where nanoparticle interactions with biological systems are influenced by their size and distribution characteristics ( 51 3.2.4 FTIR spectroscopic analysis Employing FTIR, we characterized the organic molecules on the surface of bio-reduced gold nanoparticles synthesized from P. koreana Figure 3a −1 52 −1 −1 53 −1 −1 P. koreana 54 −1 − −1 55 Figure 3 FTIR spectra of P. koreana (a) (b) (c) (d) (a) FTIR spectra showing transmittance of gold nanoparticles and plant extract with peaks at specific wavenumbers, highlighting O-H, C-H, C=C, and C-O groups. (b) Bar graph illustrating DPPH scavenging inhibition with concentrations of 100 to 1000 micrograms per milliliter for gold nanoparticles and ascorbic acid. (c) Bar graph showing ABTS scavenging inhibition across the same concentrations for both substances. (d) Bar graph depicting reducing power with increasing concentrations. Purple represents gold nanoparticles and green denotes ascorbic acid in graphs (b), (c), and (d). The findings from the FTIR spectra underscore the potential of Pk-AuNps as a nano-carrier platform. The surface composition characterized by FTIR analysis offers a basis for optimizing the biological performance of these nanoparticles ( 56 57 3.3 Assessment of antioxidant ability Free radicals, characterized by an unpaired number of electrons, are highly reactive species that can be generated through the interaction of oxygen with certain molecules ( 58 59 Figures 3b d The DPPH assay is a de facto method for assessing free radical scavenging capacity, providing a straightforward visual and quantitative measure of antioxidant potential. The IC 50 Figure 3b Pulsatilla 57 60 61 The ABTS radical cation decolorization assay, as illustrated in Figure 3c The reducing power assay, as depicted in Figure 3d 62 These findings imply that flavonoids, quinones, and phenols, which form the protective capping layer of Pk-AuNps, appear to be the main sources of the free radical scavenging activity. There have been reports of the antioxidant properties of biosynthetic nanoparticles made from an aqueous extract of the leaves of Hagenia abyssinica Carissa carandas Clerodendrum inerme 19 P. koreana 3.4 In vitro 3.4.1 Cell viability In this current study, RAW264.7 and A549 cells were used as model systems to assess the cytotoxicity of Pk-AuNps. Cell viability was measured in vitro Figure 4a Figure 4b in vitro Figure 4 Evaluation of the cell viability in RAW 264.7 (a) (b) (c) (d) (e) (f) iNOS (g) COX-2 (h) TNF-α (i) ### p p p Nine bar graphs display experimental results on cell viability and various biochemical markers at different concentrations and treatment conditions. Graph (a) and (b) show cell viability percentages over time. Graph (c) illustrates ROS generation. Graphs (d) to (f) present measurements of nitrite, PGE2, and TNF-α production. Graphs (g) to (i) depict mRNA expression levels of iNOS, COX-2, and TNF-α. Each graph compares untreated control with various treatments, including LPS, Pk-AuNPs, and DEX, indicated by color coding and statistical significance markers. 3.4.2 In vitro Macrophages constitute one of the key immune defense mechanisms within the human body endowed with the ability of phagocytosis ( 63 2 64 65 66 ﻿We first verified the antioxidant capacity of Pk-AuNps. As shown in Figure 4c In Figure 4d Figure 4g iNOS Figure 4d COX-2 Figure 4h iNOS COX-2 In previous research, the extract of P. koreana 64 Figure 4e 67 68 17 Figure 4e TNF-α Figures 4f i 69 According to the immunofluorescence staining presented in Figure 5 64 Figure 5 Immunofluorescence staining of NF-κB p65 expression in RAW 264.7 macrophages. Microscopic fluorescence images showing cellular staining with DAPI and NF-kB across three conditions: control, LPS treated, and LPS with 50 micrograms per milliliter of Pk-AuNps. Each row represents different stain views (DAPI, NF-kB, and merged) with a scale of 20 micrometers. Changes in fluorescence indicate variations in cellular responses under different treatments. Within the framework of the immune system, cytokines such as interleukin-1β (IL-1β), interleukin-6 (IL-6), and interferon-γ (IFN-γ) play pivotal roles in regulating inflammatory responses. The major histocompatibility complex (MHC) molecules are indispensable for antigen presentation ( 70 71 72 4 Conclusion The aqueous extract of P. koreana FE-TEM revealed spherical nanoparticles with sizes ranging from 5 to 20 nm (average nanoparticle size: 11.11 ± 3.5 nm). XRD confirmed the crystalline nature of the material. FTIR spectroscopy enabled the identification of the principal functional groups in the plant extract and the synthesized Pk-AuNps. The high stability of nanoparticles in the colloidal solution was verified by DLS characterizations. Biological activities, encompassing antioxidant, as well as in vitro In vitro α P. koreana We would like to appreciate Hanbang Bio Inc., Suwon (Republic of Korea) for supporting the relevant resources. Data availability statement The original contributions presented in the study are included in the article/supplementary material, further inquiries can be directed to the corresponding author. Ethics statement Ethical approval was not required for the studies on humans in accordance with the local legislation and institutional requirements because only commercially available established cell lines were used. Author contributions YH: Methodology, Writing – original draft, Conceptualization, Visualization. XZ: ﻿Methodology, Writing – original draft. LZ: ﻿Formal analysis, Writing – original draft. KW: ﻿Software, Writing – original draft. DS: ﻿Data curation, Writing – original draft. NJ: ﻿Data curation, Writing – original draft. JF: ﻿Investigation, Writing – original draft. QC: ﻿Methodology, Writing – original draft. KC: ﻿Software, Writing – review & editing. YZ: ﻿Validation,Writing – review & editing. XY: Writing – review & editing. BL: ﻿Supervision, Writing – review & editing. LG: Supervision, Funding acquisition, Writing – review & editing, Project administration. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Kang SS Saponins from the roots of Pulsatilla koreana Arch Pharm Res 1989 12 42 7 10.1007/BF02855745 23456692 2. Li W Yan XT Sun YN Ngan TT Shim SH Kim YH Anti-inflammatory and PPAR Transactivational effects of Oleanane-type triterpenoid Saponins from the roots of Pulsatilla koreana Biomol Ther 2014 22 334 40 10.4062/biomolther.2014.047 25143813 PMC4131524 3. Li Y-h Zou M Han Q Deng L-r Weinshilboum RM Therapeutic potential of triterpenoid saponin anemoside B4 from Pulsatilla chinensis Pharmacol Res 2020 160 105079 10.1016/j.phrs.2020.105079 32679180 4. Kim Y Kim S-B You Y-J Ahn B-Z Deoxypodophyllotoxin; the cytotoxic and antiangiogenic component from Pulsatilla koreana Planta Med 2002 68 271 4 10.1055/s-2002-23140 11914969 5. Lee KY Cho YW Park J Lee DY Kim SH Kim YC Quality control of Pulsatilla koreana Phytochem Anal 2010 21 314 21 10.1002/pca.1201 20066731 6. Li W Sun YN Yan XT Yang SY Lee SJ Byun HJ Isolation of nematicidal triterpenoid saponins from Pulsatilla koreana Meloidogyne incognita Molecules 2013 18 5306 16 10.3390/molecules18055306 23698044 PMC6269694 7. Yang H Cho YW Kim SH Kim YC Sung SH Triterpenoidal saponins of Pulsatilla koreana Phytochemistry 2010 71 1892 9 10.1016/j.phytochem.2010.07.013 20800858 8. Amini SM Akbari A Metal nanoparticles synthesis through natural phenolic acids IET Nanobiotechnol 2019 13 771 7 10.1049/iet-nbt.2018.5386 31625516 PMC8676617 9. Sidhu AK Verma N Kaushal P Role of biogenic capping agents in the synthesis of metallic nanoparticles and evaluation of their therapeutic potential Front Nanotechnol 2022 3 801620 10.3389/fnano.2021.801620 10. Cai F Li S Huang H Iqbal J Wang C Jiang X Green synthesis of gold nanoparticles for immune response regulation: mechanisms, applications, and perspectives J Biomed Mater Res A 2022 110 424 42 10.1002/jbm.a.37281 34331516 11. Xu XY Moon S-K Kim J-K Kim WJ Kim Y-J Kim H Structural properties and anti-dermatitis effects of flavonoids-loaded gold nanoparticles prepared by Eupatorium japonicum Front Pharmacol 2022 13 1055378 10.3389/fphar.2022.1055378 36386212 PMC9659597 12. Xu XY Tran THM Perumalsamy H Sanjeevram D Kim Y-J Biosynthetic gold nanoparticles of Hibiscus syriacus Mater Sci Eng C 2021 124 112035 10.1016/j.msec.2021.112035 33947536 13. Si A Pal K Kralj S El-Sayyad GS de Souza FG Narayanan T Sustainable preparation of gold nanoparticles via green chemistry approach for biogenic applications Mater Today Chem 2020 17 100327 10.1016/j.mtchem.2020.100327 14. Morais MG Martins VG Steffens D Pranke P da Costa JAV Biological applications of nanobiotechnology J Nanosci Nanotechnol 2014 14 1007 17 10.1166/jnn.2014.8748 24730317 15. Shahcheraghi N Golchin H Sadri Z Tabari Y Borhanifar F Makani S Nano-biotechnology, an applicable approach for sustainable future 3 Biotech 2022 12 65 10.1007/s13205-021-03108-9 35186662 PMC8828840 16. Whitesides GM The 'right'size in nanobiotechnology Nat Biotechnol 2003 21 1161 5 10.1038/nbt872 14520400 17. Elahi N Kamali M Baghersad MH Recent biomedical applications of gold nanoparticles: a review Talanta 2018 184 537 56 10.1016/j.talanta.2018.02.088 29674080 18. Muddapur UM Alshehri S Ghoneim MM Mahnashi MH Alshahrani MA Khan AA Plant-based synthesis of gold nanoparticles and Theranostic applications: a review Molecules 2022 27 1391 10.3390/molecules27041391 35209180 PMC8875495 19. Hano C Abbasi BH Plant-based green synthesis of nanoparticles: production, characterization and applications Biomolecules 2022 12 31 10.3390/biom12010031 35053179 PMC8773616 20. Kwak G-Y Han Y Baik S Kong B-M Yang D-C Kang S-C Gold nanoparticles green-synthesized by the Suaeda japonica Coatings 2022 12 460 10.3390/coatings12040460 21. Markus J Wang D Kim YJ Ahn S Mathiyalagan R Wang C Biosynthesis, characterization, and bioactivities evaluation of silver and gold nanoparticles mediated by the roots of Chinese herbal Angelica pubescens Nanoscale Res Lett 2017 12 46 10.1186/s11671-017-1833-2 28097599 PMC5241258 22. Kumar I Mondal M Meyappan V Sakthivel N Green one-pot synthesis of gold nanoparticles using Sansevieria roxburghiana Mater Res Bull 2019 117 18 27 10.1016/j.materresbull.2019.04.029 23. Haiss W Thanh NTK Aveyard J Fernig DG Determination of size and concentration of gold Nanoparticles from UV−Vis spectra Anal Chem 2007 79 4215 21 10.1021/ac0702084 17458937 24. Grzelczak M Pérez-Juste J Mulvaney P Liz-Marzán LM Shape control in gold nanoparticle synthesis Chem Soc Rev 2008 37 1783 91 10.1039/b711490g 18762828 25. Fleury B Cortes-Huerto R Taché O Testard F Menguy N Spalla O Gold nanoparticle internal structure and symmetry probed by unified small-angle X-ray scattering and X-ray diffraction coupled with molecular dynamics analysis Nano Lett 2015 15 6088 94 10.1021/acs.nanolett.5b02924 26263393 26. Holzwarth U Gibson N The Scherrer equation versus the 'Debye-Scherrer equation' Nat Nanotechnol 2011 6 534 10.1038/nnano.2011.145 21873991 27. Bhattacharjee S DLS and zeta potential – what they are and what they are not? J Control Release 2016 235 337 51 10.1016/j.jconrel.2016.06.017 27297779 28. Hoo CM Starostin N West P Mecartney ML A comparison of atomic force microscopy (AFM) and dynamic light scattering (DLS) methods to characterize nanoparticle size distributions J Nanopart Res 2008 10 89 96 10.1007/s11051-008-9435-7 29. Guerrero-Pérez MO Patience GS Experimental methods in chemical engineering: Fourier transform infrared spectroscopy—FTIR Can J Chem Eng 2019 98 25 33 10.1002/cjce.23664 30. Gulcin İ Alwasel SH DPPH radical scavenging assay PRO 2023 11 2248 10.3390/pr11082248 31. Kora AJ Tree gum stabilised selenium nanoparticles: characterisation and antioxidant activity IET Nanobiotechnol 2018 12 658 62 10.1049/iet-nbt.2017.0310 30095429 PMC8676560 32. Chen L Huo Y Han YX Li JF Ali H Batjikh I Biosynthesis of gold and silver nanoparticles from Scutellaria baicalensis in vitro Appl Phys A Mater Sci Process 2020 126 1 12 10.1007/s00339-020-03603-5 33. Spiegel M Kapusta K Kołodziejczyk W Saloni J Żbikowska B Hill GA Antioxidant activity of selected phenolic acids-ferric reducing antioxidant power assay and QSAR analysis of the structural features Molecules 2020 25 25 (13) 10.3390/molecules25133088 32645868 PMC7412039 34. van Meerloo J Kaspers GJL Cloos J Cell sensitivity assays: the MTT assay Cree IA Cancer cell culture: Methods and protocols Totowa, NJ Humana Press 2011 237 45 10.1007/978-1-61779-080-5_20 21516412 35. Yu D Zha Y Zhong Z Ruan Y Li Z Sun L Improved detection of reactive oxygen species by DCFH-DA: new insight into self-amplification of fluorescence signal by light irradiation Sensors Actuators B Chem 2021 339 129878 10.1016/j.snb.2021.129878 36. Livak KJ Schmittgen TD Analysis of relative gene expression data using real-time quantitative PCR and the 2 − ΔΔCT Methods 2001 25 402 8 10.1006/meth.2001.1262 11846609 37. Im K Mareninov S Diaz MFP Yong WH An introduction to performing immunofluorescence staining Methods Mol Biol 2019 1897 299 311 10.1007/978-1-4939-8935-5_26 30539454 PMC6918834 38. Donaldson JG Immunofluorescence staining Curr Protoc Cell Biol 2015 69 4.3.1 7 10.1002/0471143030.cb0403s69 26621373 39. Polak JM Van Noorden S Polak DJ Van Noorden S Introduction to immunocytochemistry 3 Garland Science 2023 10.1201/9781003423829 40. Suárez-López R Puntes VF Bastús NG Hervés C Jaime C Nucleation and growth of gold nanoparticles in the presence of different surfactants. A dissipative particle dynamics study Sci Rep 2022 12 13926 10.1038/s41598-022-18155-2 35977997 PMC9385746 41. Elavazhagan T Arunachalam KD Memecylon edule Int J Nanomedicine 2011 6 1265 78 10.2147/IJN.S18347 21753878 PMC3131193 42. Amendola V Meneghetti M Size evaluation of gold nanoparticles by UV−Vis spectroscopy J Phys Chem C 2009 113 4277 85 10.1021/jp8082425 43. Srnová-Šloufová I Vlcková B Bastl Z Hasslett TL Bimetallic (ag) au nanoparticles prepared by the seed growth method: two-dimensional assembling, characterization by energy dispersive X-ray analysis, X-ray photoelectron spectroscopy, and surface enhanced Raman spectroscopy, and proposed mechanism of growth Langmuir 2004 20 3407 15 10.1021/la0302605 15875875 44. Chaturvedi VK Yadav N Rai NK Ellah NHA Bohara RA Rehan IF Pleurotus sajor-caju-mediated synthesis of silver and gold nanoparticles active against Colon Cancer cell lines: a new era of Herbonanoceutics Molecules 2020 25 3091 10.3390/molecules25133091 32645899 PMC7412267 45. Bindhu MR Umadevi M Antibacterial activities of green synthesized gold nanoparticles Mater Lett 2014 120 122 5 10.1016/j.matlet.2014.01.108 46. Gautam P Kumar S Tomar MS Singh R Acharya AP Ritis Shyanti K Biologically synthesized gold nanoparticles using Ocimum sanctum J Cell Sci Ther 2017 8 278 10.4172/2157-7013.1000278 47. Depciuch J Stec M Kandler M Baran J Parlinska-Wojtan M From spherical to bone-shaped gold nanoparticles—time factor in the formation of au NPs, their optical and photothermal properties Photodiagn Photodyn Ther 2020 30 101670 10.1016/j.pdpdt.2020.101670 31988022 48. Khlebtsov BN Khlebtsov NG On the measurement of gold nanoparticle sizes by the dynamic light scattering method Colloid J 2011 73 118 27 10.1134/S1061933X11010078 49. Nickel C Angelstorf J Bienert R Burkart C Gabsch S Giebner S Dynamic light-scattering measurement comparability of nanomaterial suspensions J Nanopart Res 2014 16 2260 10.1007/s11051-014-2260-2 50. Stefanos M Molto PR Kim TNT Characterization techniques for nanoparticles: comparison and complementarity upon studying nanoparticle properties Nanoscale 2018 10 12871 934 10.1039/C8NR02278J 29926865 51. Chavda VP Nanobased Nano Drug Delivery: A Comprehensive Review, in Applications of Targeted Nano Drugs and Delivery Systems Mohapatra SS Ranjan S Dasgupta N Mishra RK Thomas S Elsevier 69 92 10.1016/B978-0-12-814029-1.00004-1 52. Berthomieu C Hienerwadel R Fourier transform infrared (FTIR) spectroscopy Photosynth Res 2009 101 157 70 10.1007/s11120-009-9439-x 19513810 53. Chen Y Mastalerz M Schimmelmann A Characterization of chemical functional groups in macerals across different coal ranks via micro-FTIR spectroscopy Int J Coal Geol 2012 104 22 (none) 33 10.1016/j.coal.2012.09.001 54. Jameel MS Aziz AA Dheyab MA Mehrdel B Khaniabadi PM Rapid sonochemically-assisted green synthesis of highly stable and biocompatible platinum nanoparticles Surf Interface Anal 2020 20 100635 10.1016/j.surfin.2020.100635 55. Santhoshkumar J Rajeshkumar S Venkat Kumar S Phyto-assisted synthesis, characterization and applications of gold nanoparticles – a review Biochem Biophys Rep 2017 11 46 57 10.1016/j.bbrep.2017.06.004 28955767 PMC5614687 56. Folorunso A Akintelu S Oyebamiji AK Ajayi S Abiola B Abdusalam I Biosynthesis, characterization and antimicrobial activity of gold nanoparticles from leaf extracts of Annona muricata J Nanostructure Chem 2019 9 111 7 10.1007/s40097-019-0301-1 57. Zhong J Tan L Chen M He C Pharmacological activities and molecular mechanisms of Pulsatilla Chin Med 2022 17 59 10.1186/s13020-022-00613-8 35606807 PMC9125917 58. Halliwell B Gutteridge ﻿JMC Free radicals in biology and medicine Oxford University Press 2015 10.1093/acprof:oso/9780198717478.001.0001 59. Fang Y-Z Yang S Wu G Free radicals, antioxidants, and nutrition Nutrition 2002 18 872 9 10.1016/S0899-9007(02)00916-4 12361782 60. Seo K-H Jung J-W Thi NN Lee Y-H Baek N-I Flavonoid glycosides from the flowers of Pulsatilla korean Nat Prod Sci 2016 22 41 5 10.20307/nps.2016.22.1.41 61. Li H-B Wong C-C Cheng K-W Chen F Antioxidant properties in vitro LWT-Food Sci Technol 2008 41 385 90 10.1016/j.lwt.2007.03.011 62. Rumpf J Burger R Schulze M Statistical evaluation of DPPH, ABTS, FRAP, and Folin-Ciocalteu assays to assess the antioxidant capacity of lignins Int J Biol Macromol. 2023 233 123470 10.1016/j.ijbiomac.2023.123470 36736974 63. Laskin DL Sunil VR Gardner CR Laskin JD Macrophages and tissue injury: agents of defense or destruction? Annu Rev Pharmacol Toxicol 2011 51 267 88 10.1146/annurev.pharmtox.010909.105812 20887196 PMC3670679 64. Moynagh PN The NF-κB pathway J Cell Sci 2005 118 4589 92 10.1242/jcs.02579 16219681 65. Ma JS Kim WJ Kim JJ Kim TJ Ye SK Song MD Gold nanoparticles attenuate LPS-induced NO production through the inhibition of NF-κB and IFN-β/STAT1 pathways in RAW264.7 cells Nitric Oxide 2010 23 214 9 10.1016/j.niox.2010.06.005 20547236 66. Mc Guire C Prinz M Beyaert R van Loo G Nuclear factor kappa B (NF-κB) in multiple sclerosis pathology Trends Mol Med 2013 19 604 13 10.1016/j.molmed.2013.08.001 24007818 67. Palladino MA Bahjat FR Theodorakis EA Moldawer LL Anti-TNF-α therapies: the next generation Nat Rev Drug Discov 2003 2 736 46 10.1038/nrd1175 12951580 68. Isomäki P Punnonen J Pro-and anti-inflammatory cytokines in rheumatoid arthritis Ann Med 1997 29 499 507 10.3109/07853899709007474 9562516 69. Hasko G Szabó C Németh ZH Kvetan V Pastores S Vizi ES Adenosine receptor agonists differentially regulate IL-10, TNF-alpha, and nitric oxide production in RAW 264.7 macrophages and in endotoxemic mice J Immunol (Baltimore, Md: 1950) 1996 157 4634 40 8906843 70. Liu W Zhang S Wang J IFN-γ, should not be ignored in SLE Front Immunol 2022 13 954706 10.3389/fimmu.2022.954706 36032079 PMC9399831 71. Lo MW Woodruff TM Complement: bridging the innate and adaptive immune systems in sterile inflammation J Leukoc Biol 2020 108 339 51 10.1002/JLB.3MIR0220-270R 32182389 72. Revel M Daugan MV Sautés-Fridman C Fridman WH Roumenina LT Complement system: promoter or suppressor of Cancer progression? Antibodies 2020 9 57 10.3390/antib9040057 33113844 PMC7709131 ",
  "metadata": {
    "Title of this paper": "Complement system: promoter or suppressor of Cancer progression?",
    "Journal it was published in:": "Frontiers in Nutrition",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488413/"
  }
}