{
  "title": "Paper_430",
  "abstract": "pmc Lancet Reg Health Am Lancet Reg Health Am 4381 lrhamers Lancet Regional Health - Americas 2667-193X Elsevier PMC12485534 PMC12485534.1 12485534 12485534 41040536 10.1016/j.lana.2025.101196 S2667-193X(25)00206-6 101196 1 Articles Effectiveness of nirsevimab among infants in their first RSV season in the United States, October 2023–March 2024: a test-negative design analysis Payne Amanda B. bvx2@cdc.gov a ∗ Battan-Wraith Steph b Rowley Elizabeth A.K. b Stockwell Melissa S. c Tartof Sara Y. d e Dascomb Kristin f Irving Stephanie A. g Dixon Brian h i Ball Sarah W. b Tenforde Mark W. a Vazquez-Benitez Gabriela j Stephens Ashley B. c Han Jungmi c Natarajan Karthik c Salas S. Bianca d Bezi Cassandra d Sy Lina S. d Lewin Bruno d Sheffield Tamara f Arndorfer Julie f Bride Daniel f Van Otterloo Josh f Naleway Allison L. g Koppolu Padma D. g Grannis Shaun h k Fadel William h i Rogerson Colin h k Duszynski Tom i Reese Sarah E. b Mitchell Patrick K. b Chickery Sean b Moline Heidi L. a m Najdowski Morgan a l Ciesla Allison Avrich a l Reeves Emily L. a DeSilva Malini j Fleming-Dutra Katherine E. a n Link-Gelles Ruth a m a b c d e f g h i j k l m ∗ bvx2@cdc.gov n The author is currently employed by Sanofi, but had completed her contributions to this manuscript before leaving the Centers for Disease Control and Prevention. The findings and conclusions in this report are those of the authors and do not necessarily represent the views of the Centers for Disease Control and Prevention. 9 2025 06 8 2025 49 493184 101196 18 12 2024 27 6 2025 11 7 2025 06 08 2025 02 10 2025 03 10 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Summary Background In August 2023, the Centers for Disease Control and Prevention recommended nirsevimab, a long-acting monoclonal antibody, for all U.S. infants aged <8 months entering or born during their first respiratory syncytial virus (RSV) season. Our aim was to estimate nirsevimab effectiveness against RSV-associated emergency department (ED) encounters and hospitalisation among U.S. infants during the 2023–2024 RSV season. Methods We conducted a test-negative analysis using electronic health record (EHR) data from 6 healthcare systems, including ED encounters and hospitalizations with a diagnosis of RSV-like illness (RLI) during October 8, 2023–March 31, 2024, among infants aged <8 months as of October 1, 2023, or born during the study period. Nirsevimab effectiveness was estimated by comparing children who received nirsevimab with those who did not among RSV-positive and RSV-negative encounters, adjusting for age, race and ethnicity, sex, calendar day, and geographic region and excluding infants whose mother received RSV vaccination during pregnancy. Findings Among 5039 ED encounters with RLI among infants in their first RSV season, 2045 (41%) were RSV-positive and 446 (9%) received nirsevimab, with a median time since dose of 52 days (interquartile range [IQR]: 27–84 days). Among 1025 hospitalizations with RLI among infants in their first RSV season, 605 (59%) were RSV-positive and 95 (9%) received nirsevimab, with a median time since dose of 48 days (IQR: 24–82 days). Nirsevimab effectiveness was 77% (95% CI: 69%–83%) against RSV-associated ED encounters and 98% (95% CI: 95%–99%) against RSV-associated hospitalisation. Interpretation Nirsevimab was effective in preventing RSV-associated ED encounters and hospitalisation among infants in their first RSV season, with greatest protection against hospitalisation. However, these estimates reflect a short interval from nirsevimab administration to RLI onset. Since nirsevimab is a passive immunization and concentration is expected to wane over time, it is important to continue monitoring effectiveness to assess effectiveness with increased time since dose. Funding This work was supported by the 10.13039/100000030 Centers for Disease Control and Prevention 75D30121D12779 75D30123C18039 Keywords Respiratory syncytial virus Effectiveness Immunization Test negative design Nirsevimab pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Research in context Evidence before this study Respiratory syncytial virus (RSV) causes substantial morbidity and mortality among infants. In 2023 widespread use of RSV immunizations, including nirsevimab, was recommended in the United States to prevent lower respiratory tract disease among infants born during or entering their first RSV season. We searched PubMed on December 1, 2024, using the search terms ((RSV) OR (respiratory syncytial)) AND (nirsevimab) AND (effectiveness) for all available literature regarding nirsevimab effectiveness among infants in their first RSV season published between August 3, 2023 (which was the date nirsevimab was recommended in the USA) and December 1, 2024, with no language restrictions. We found 17 relevant publications, with reported estimates of nirsevimab effectiveness against RSV-associated emergency department (ED) encounters ranging from 17% to 88% and estimates of nirsevimab effectiveness against RSV-associated hospitalization ranging from 70% to 94%. However, most nirsevimab effectiveness data were collected in Spain and France. There are limited data regarding nirsevimab effectiveness from the Americas. To confirm RSV immunization products are working, to inform future immunization policy decisions, and to increase immunization confidence, we sought to estimate effectiveness of nirsevimab among infants during the 2023–2024 respiratory virus season in the United States in the Virtual SARS-CoV-2, Influenza, and Other respiratory viruses Network (VISION). Added value of this study In this multisite analysis of hospitalizations and ED encounters identified in VISION from Oct 1, 2023, to March 31, 2024, among infants born during or entering their first RSV season who presented with RSV-like illness and were clinically tested for RSV, nirsevimab provided protection with effectiveness of 77% against RSV-associated ED encounters and 98% against RSV-associated hospitalization during the first RSV season after nirsevimab was recommended. These findings add to the limited data regarding niresevimab effectiveness against severe RSV disease in the United States and indicate that the immunization has the potential to reduce morbidity and mortality from severe RSV disease among infants. Implications of all the available evidence Nirsevimab was effective against RSV-associated hospitalization and ED encounters among infants during the first season after nirsevimab recommendation. These findings provide additional context regarding the benefit of RSV immunization among infants. Introduction Each year, respiratory syncytial virus (RSV) leads to approximately 1.5 million outpatient visits, 520,000 emergency department (ED) visits, and 58,000–80,000 hospitalisations among children <5 years of age in the United States. 1 , 2 3 4 5 , 6 Since 1998, palivizimab, a monoclonal antibody, has been licensed by the U.S. Food and Drug Administration (FDA) for prevention of severe RSV among infants and young children at increased risk of severe RSV. 7 6 In July 2023, the FDA approved nirsevimab (Beyfortus, Sanofi and AstraZeneca), a long-acting monoclonal antibody, for prevention of RSV-associated lower respiratory tract illness (LRTI) in infants. 8 9 10 In August 2023, the FDA approved maternal RSV vaccine (Abrysvo, Pfizer Inc.) for pregnant women during 32–36 weeks’ gestation for prevention of RSV-associated LRTI in infants aged <6 months. 11 12 10 In October 2023, CDC issued a Health Alert Network (HAN) advisory providing options to protect infants against RSV in the context of limited supply of nirsevimab, with priority given to infants at highest risk for severe RSV, including those <8 months with certain underlying conditions and infants age <6 months without those conditions. 13 14 Nirsevimab was licensed based on clinical trial data. 15 Methods Study population and data sources The Virtual SARS-CoV-2, Influenza, and Other respiratory viruses Network (VISION) is an electronic health record (EHR)-based network in the United States. 16 In this test negative design (TND) investigation, ED encounters or hospitalisations with a diagnosis of RSV-like illness (RLI) and RSV testing occurring during October 8, 2023–March 31, 2024, among infants aged <8 months as of October 1, 2023, or born after that date were included. As the investigation design required testing, ED encounters and hospitalisations were included due to substantial rates of clinician-driven RSV testing in these settings. Dates of eligible encounters corresponded to a period of RSV circulation in most of the continental United States. 17 18 Supplementary Table S1 Study definitions The index date for each encounter was defined as either the date of collection of a respiratory specimen associated with the most recent positive or negative RSV test result before the encounter or the date of the encounter (if testing occurred on or after the encounter date). Test-positive cases were RLI-associated ED encounters or hospitalisations with a positive RSV molecular or antigen test, excluding ED encounters and hospitalisations also testing positive for SARS-CoV-2 or influenza during the 10 days prior to 72 h after the index date for the encounter (i.e., excluding known co-detections with RSV and either SARS-CoV-2 or influenza due to inability to determine if RSV or another co-infecting virus was causing RLI in these cases). Test-negative controls were RLI-associated ED encounters or hospitalisations with a negative RSV molecular test, regardless of SARS-CoV-2 or influenza test result. Encounters with only a negative RSV antigen test and no molecular test performed or only indeterminate RSV test results were excluded. The exposure of interest was nirsevimab immunization, defined as receipt of nirsevimab 7 days or more prior to the index date for the RSV-associated ED encounter or hospitalisation, to exclude infants who received nirsevimab after being infected with RSV. Infant and maternal RSV immunization statuses were documented by EHRs, state and city registries, and insurance claims data (for a subset of sites). ED encounters or hospitalisations were excluded if the immunization history was implausible, i.e., if the nirsevimab dose was administered before October 1, 2023, as nirsevimab was not widely available in the United States prior to this date, or if > 1 dose of nirsevimab was received prior to the encounter. Additionally, to exclude ED encounters and hospitalisations for which the RLI may have started prior to nirsevimab receipt, ED encounters and hospitalisations were excluded if the nirsevimab dose was administered 0–6 days prior to the encounter and, relatedly, if the infant was aged <7 days. To address bias potentially introduced by including infants protected by a different RSV preventive product, ED encounters and hospitalisations among infants with evidence of maternal RSV vaccination or palivizumab use were excluded. Maternal RSV vaccination status was ascertained by linking maternal and infant records using site-specific methods ( Supplementary Table S2 Infant age, race and ethnicity, sex, social vulnerability index (SVI) of residence, 19 20 Supplementary Table S3 6 Supplementary Methods S1 Statistical analysis In univariate comparisons of test-positive cases and test-negative controls and those with and without documented nirsevimab immunization, a standardized mean difference >0.2 was considered a meaningful difference in the distribution of a variable between groups. 21 22 Supplementary Methods S2 and Table S4 Sub-group analyses evaluated nirsevimab effectiveness among infants born preterm and those with underlying medical conditions. Additionally, sensitivity analyses evaluated if any of the following changed effectiveness estimates: 1) varying the dates of eligible encounters based on RSV circulation and/or nirsevimab implementation at each site; 2) restricting cases to RSV molecular-positive; 3) excluding controls testing positive for SARS-CoV-2 or influenza; 4) including infants with evidence of nirsevimab receipt 0–6 days prior to the encounter; 5) excluding infants with immunocompromising conditions; 6) restricting to ARI; 7) excluding sites testing a relatively low proportion of encounters; and 8) varying the time since dose categories ( Supplementary Table S5 All analyses were conducted in SAS software, version 9.4 (SAS Institute) or R software, version 4.4.0 (R Foundation for Statistical Computing). Ethics approval The activity was reviewed by CDC, deemed not research, and was conducted consistent with applicable federal law and CDC policy. o Role of funding source This work was supported by the U.S. Centers for Disease Control and Prevention (CDC) (contracts 75D30121D12779 to Westat and 75D30123C18039 to Kaiser Foundation Hospitals). CDC employees were involved in the design and conduct of the study; collection, management, analysis, and interpretation of the data; preparation, review, and approval of the manuscript; and decision to submit the manuscript for publication. The findings and conclusions in this report are those of the authors and do not necessarily represent the official position of the CDC. Results ED encounters for RLI among infants During October 8, 2023–March 31, 2024, we identified 5039 eligible ED encounters for RLI among infants in their first RSV season (aged <8 months as of or born after October 1, 2023) ( Supplementary Fig. S1 Fig. 1 Table 1 Fig. 1 Encounters for RSV-li ke illness among infants in their first RSV season, VISION, October 1, 2023–March 31, 2024. Table 1 Characteristics of emergency department encounters for RSV-like illness by RSV test result and nirsevimab immunization status, VISION Network, Oct 8, 2023–March 31, 2024. Characteristic All ED encounters, N (column %) RSV test result a SMD b Nirsevimab status c SMD d Negative Positive No nirsevimab Received nirsevimab All ED encounters, N 5039 2994 2045 4593 446 Site A 280 (6) 184 (6) 96 (5) 0.37 249 (89) 31 (11) 0.51 B 524 (10) 342 (11) 182 (9) 480 (92) 44 (8) C 808 (16) 351 (12) 457 (22) 707 (88) 101 (13) D 155 (3) 99 (3) 56 (3) 131 (85) 24 (15) E 2177 (43) 1240 (41) 937 (46) 2075 (95) 102 (5) F 1095 (22) 778 (26) 317 (16) 951 (87) 144 (13) Facility urban-rural classification Large central metro 2857 (57) 1658 (55) 1199 (59) 0.17 2573 (90) 284 (10) 0.22 Large fringe metro 804 (16) 503 (17) 301 (15) 733 (91) 71 (9) Medium metro 307 (6) 210 (7) 97 (5) 288 (94) 19 (6) Small metro 527 (11) 335 (11) 192 (9) 496 (94) 31 (6) Micropolitan 166 (3) 96 (3) 70 (3) 151 (91) 15 (9) Non-core 165 (3) 90 (3) 75 (4) 158 (96) 7 (4) Unknown 213 (4) 102 (3) 111 (5) 194 (91) 19 (9) Month of encounter e October 2023 500 (10) 338 (11) 162 (8) 0.75 498 (100) 2 (0) 0.81 November 2023 996 (20) 465 (16) 531 (26) 968 (97) 28 (3) December 2023 1255 (25) 529 (18) 726 (36) 1165 (93) 90 (7) January 2024 842 (17) 466 (16) 376 (18) 753 (89) 89 (11) February 2024 693 (14) 539 (18) 154 (8) 592 (85) 101 (15) March 2024 748 (15) 652 (22) 96 (5) 612 (82) 136 (18) April 2024 5 (<1) 5 (<1) 0 (<1) 5 (100) 0 (0) Age (months), median [IQR] 5 [3, 8] 6 [3, 8] 5 [2, 7] 0.23 5 [3, 8] 3 [1, 6] 0.57 Born before or on October 1, 2023 3926 (78) 2300 (77) 1626 (80) 0.07 3741 (95) 185 (5) 0.90 Born after October 1, 2023 1113 (22) 694 (23) 419 (20) 852 (77) 261 (23) Female 2221 (44) 1293 (43) 928 (45) 0.04 2046 (92) 175 (8) 0.11 Race and ethnicity f Black or African American, non-Hispanic 611 (12) 395 (13) 216 (11) 0.14 569 (93) 42 (7) 0.29 White, non-Hispanic 1989 (39) 1106 (37) 883 (43) 1857 (93) 132 (7) Hispanic or Latino 1855 (37) 1149 (38) 706 (35) 1646 (89) 209 (11) Other, non-Hispanic 345 (7) 204 (7) 141 (7) 312 (90) 33 (10) Unknown 239 (5) 140 (5) 99 (5) 209 (87) 30 (13) Social Vulnerability Index of residence g Quartile 1 770 (15) 421 (14) 349 (17) 0.21 714 (93) 56 (7) 0.17 Quartile 2 853 (17) 490 (16) 363 (18) 777 (91) 76 (9) Quartile 3 720 (14) 405 (14) 315 (15) 665 (92) 55 (8) Quartile 4 776 (15) 419 (14) 357 (18) 718 (93) 58 (7) Unknown 1920 (38) 1259 (42) 661 (32) 1719 (90) 201 (10) Medicaid coverage h 3015 (60) 2021 (68) 994 (49) 0.45 2743 (91) 272 (9) 0.21 Linkage to maternal RSV vaccination records i 4361 (87) 2561 (86) 1800 (88) 0.07 3934 (90) 427 (10) 0.35 No. of UMC categories j 0 4861 (97) 2870 (96) 1991 (97) 0.10 4444 (91) 417 (9) 0.18 1 158 (3) 107 (4) 51 (3) 136 (86) 22 (14) 2 18 (<1) 15 (<1) 3 (<1) 11 (61) 7 (39) ≥3 2 (<1) 2 (<1) 0 (0) 2 (100) 0 (0) Presence of UMC category Respiratory disease 58 (1) 37 (1) 21 (1) 0.02 49 (84) 9 (16) 0.08 Non-respiratory disease 170 (3) 118 (4) 52 (3) 0.08 138 (81) 32 (19) 0.19 ≥1 high-risk UMC k 121 (2) 80 (3) 41 (2) 0.04 101 (83) 20 (17) 0.13 Chronic lung disease of prematurity 3 (<1) 3 (<1) 0 (0) 0.05 0 (0) 3 (100) 0.12 Congenital heart disease 42 (1) 29 (1) 13 (1) 0.04 34 (81) 8 (19) 0.09 Down syndrome 9 (<1) 7 (<1) 2 (<1) 0.03 7 (78) 2 (22) 0.05 Neuromuscular disease 47 (1) 33 (1) 14 (1) 0.04 38 (81) 9 (19) 0.10 Cystic fibrosis 0 (0) 0 (0) 0 (0) <0.01 0 (0) 0 (0) – Congenital airway abnormality 9 (<1) 7 (<1) 2 (<1) 0.03 7 (78) 2 (22) 0.05 Reactive airway disease 32 (1) 19 (1) 13 (1) <0.01 30 (94) 2 (6) 0.03 Preterm birth l 429 (9) 291 (10) 138 (7) 0.11 359 (84) 70 (16) 0.25 Nirsevimab immunization 446 (9) 383 (13) 63 (3) 0.37 – 446 (100) – Dose 7–59 days prior to encounter 250 (5) 203 (7) 47 (2) 0.37 – 250 (100) – Dose 60–164 days prior to encounter 196 (4) 180 (6) 16 (1) – 196 (100) – Age at immunization (days), median, [IQR] 30 [2, 124] 32 [3, 125] 19 [2, 51] 0.34 – 30 [2, 124] – RSV = respiratory syncytial virus; ED = emergency department; SMD = standardized mean difference; IQR = interquartile range; UMC = underlying medical condition; VISION = Virtual SARS-CoV-2, Influenza, and Other respiratory viruses Network. a RSV test results from tests conducted within 10 days prior to 3 days after date of ED encounter. If multiple tests were conducted, positive results were prioritized over negative results, then the most proximal test to the date of the encounter, and then viral culture test results over molecular assay test results, molecular assay test results over rapid molecular assay test results, rapid molecular assay test results over rapid antigen test results, rapid antigen test results over fluorescent antibody test results, and fluorescent antibody test results over serology test results. One site did not capture fluorescent antibody or serology test results. Test results for all viral culture, molecular, and rapid molecular tests and positive rapid antigen tests were included. Test results for negative rapid antigen tests and fluorescent antibody and serology tests were not included. b The standardized mean difference is the difference between the distribution of RSV-positive encounters and the distribution of RSV-negative encounters. A standardized mean difference >0.2 was considered a meaningful difference between groups. c Encounters were excluded if the infant received >1 nirsevimab dose; received nirsevimab prior to October 1, 2023; received nirsevimab 0–6 days prior to the index date; received another RSV immunization product, or the infant was aged <7 days at the time of the encounter. d The standardized mean difference is the difference between the distribution of unimmunized encounters and the distribution of immunized encounters. A standardized mean difference >0.2 was considered a meaningful difference between groups. e The index date for each encounter was defined as either the date of collection of a respiratory specimen associated with the most recent positive or negative RSV test result before the encounter or the date of the encounter (if testing occurred only after the encounter date). Thus, some ED visits may have occurred after March 31, 2024. f “Non-Hispanic, Other” race includes persons reporting non-Hispanic ethnicity and any of the following for race: American Indian or Alaska Native, Asian, Native Hawaiian or other Pacific Islander, other races not listed, and multiple races; because of small numbers, these categories were combined. “Unknown” includes persons with missing race and ethnicity in their electronic health records. g Reflects the quartiles of the distribution of Social Vulnerability Index (SVI) among encounters included in this analysis. SVI is defined based on the census tract of residence. The CDC/ATSDR SVI uses 16 U.S. census variables to determine social vulnerability for each census tract. Higher SVI values correspond to higher social vulnerability, which refers to the potential negative effects on communities caused by external stresses on human health. h N = 361 with unknown Medicaid coverage status as of encounter date. i Linkage to maternal RSV vaccination records was required for inclusion for all infants born on or before September 22, 2023. j UMC categories included pulmonary, cardiovascular, cerebrovascular, musculoskeletal, neurologic, hematologic, endocrine, renal, and gastrointestinal. k High-risk conditions included International Classification of Disease, 10th Revision (ICD-10) discharge diagnosis codes for: chronic lung disease of prematurity, congenital heart disease, Down Syndrome, neurological and/or musculoskeletal conditions, cystic fibrosis, congenital airway abnormality, and reactive airway disease. l Preterm birth status was derived from ICD-10 discharge diagnosis codes and infant records. If either an ICD-10 code corresponding to preterm birth (P07.∗) was listed among the discharge diagnoses as the time of the RLI encounter or the recorded gestational age at birth was <37 weeks, then the infant was considered to have been born preterm. Gestational age at birth was unknown for 2230 (44%) of RLI ED encounters; for these encounters, preterm birth status was defined based on ICD-10 discharge diagnosis codes. Nirsevimab effectiveness against RSV-associated ED encounters among infants Among 5039 ED encounters for RLI among infants in their first RSV season, 446 had evidence of nirsevimab receipt ≥7 days prior to the encounter, with a median time since dose of 52 days (interquartile range [IQR]: 27–84) ( Table 2 Table 2 Table 2 Supplementary Table S6 Supplementary Tables S7 and S8 Table 2 Nirsevimab effectiveness against RSV-associated ED encounters among infants in their first RSV season, VISION Network, Oct 8, 2023–March 31, 2024. Nirsevimab dosage pattern | time since dose Total ED encounters a RSV-positive ED encounters N (Row %) Median days since dose (IQR) Adjusted PE (95% CI) b No nirsevimab doses 4593 1982 (43) N/A ref Nirsevimab, 7–164 days prior 446 63 (14) 52 (27–84) 77 (69–83) 7–59 days prior 250 47 (19) 29 (18–43) 76 (66–83) 60–164 days prior 196 16 (8) 90 (72–111) 78 (62–87) RSV = respiratory syncytial virus; ED = emergency department; IQR = interquartile range; CI = confidence interval; Ref = reference group; PE = product effectiveness; VISION = Virtual SARS-CoV-2, Influenza, and Other respiratory viruses Network. a ED encounters included those among infants in their first RSV season with a diagnosis of RSV-like illness (RLI), excluding infants with evidence of maternal RSV vaccination and infants who received nirsevimab <7 days prior to the index date for the encounter. RLI was defined as ≥1 International Classification of Disease 10th Revision discharge diagnosis code corresponding to one or more of the following: COVID-19 pneumonia, influenza pneumonia, other viral pneumonia, influenza disease, bacterial pneumonia, acute respiratory distress syndrome, asthma exacerbation, respiratory failure, other acute lower respiratory tract infection, sinusitis, acute upper respiratory tract infections, acute respiratory illness signs and symptoms, viral illness not otherwise specified, sepsis, respiratory failure, irritable/fussy infant, respiratory distress of newborn, congenital pneumonia, interstitial emphysema and related conditions, other respiratory conditions originating in the perinatal period, congenital viral diseases, bacterial sepsis of newborn, or other infections specific to the perinatal period. b PE was calculated as (1—adjusted odds ratio) x 100%, with adjusted odds ratio calculated using logistic regression, adjusting for age, race and ethnicity, sex, calendar day, and geographic region. Hospitalisations with RLI among infants During October 8, 2023–March 31, 2024, we identified 1025 eligible hospitalisations for RLI among infants in their first RSV season ( Supplementary Fig. S2 Fig. 1 Table 3 Table 3 Characteristics of hospitalizations with RSV-like illness by RSV test result and nirsevimab immunization status, VISION Network, Oct 8, 2023–March 31, 2024. Characteristic All Hospitalizations, N (column %) RSV Test Result a SMD b Nirsevimab Status c SMD d Negative Positive No Nirsevimab Received Nirsevimab All hospitalizations, N 1025 420 605 930 95 Site A 16 (2) 5 (1) 11 (2) 0.29 14 (88) 2 (12) 0.63 B 155 (15) 77 (18) 78 (13) 143 (92) 12 (8) C 284 (28) 113 (27) 171 (28) 246 (87) 38 (13) D 15 (1) 8 (2) 7 (1) 10 (67) 5 (33) E 297 (29) 95 (23) 202 (33) 288 (97) 9 (3) F 258 (25) 122 (29) 136 (22) 229 (89) 29 (11) Facility urban-rural classification Large central metro 710 (69) 295 (70) 415 (69) 0.25 641 (90) 69 (10) 0.32 Large fringe metro 150 (15) 59 (14) 91 (15) 133 (89) 17 (11) Medium metro 75 (7) 38 (9) 37 (6) 73 (97) 2 (3) Small metro 53 (5) 21 (5) 32 (5) 48 (91) 5 (9) Micropolitan 6 (1) 2 (<1) 4 (1) 5 (83) 1 (17) Non-core 1 (<1) 1 (<1) 0 (0) 1 (100) 0 (0) Unknown 30 (3) 4 (1) 26 (4) 29 (97) 1 (3) Month of encounter e October 2023 107 (10) 61 (15) 46 (8) 0.69 105 (98) 2 (2) 0.90 November 2023 247 (24) 70 (17) 177 (29) 236 (96) 11 (4) December 2023 257 (25) 70 (17) 187 (31) 245 (95) 12 (5) January 2024 190 (19) 75 (18) 115 (19) 167 (88) 23 (12) February 2024 114 (11) 60 (14) 54 (9) 97 (85) 17 (15) March 2024 106 (10) 81 (19) 25 (4) 76 (72) 30 (28) April 2024 4 (<1) 3 (1) 1 (<1) 4 (100) 0 (0) ICU admission f 240 (23) 104 (25) 136 (22) 0.12 215 (90) 25 (10) 0.08 IMV g 87 (8) 49 (12) 38 (6) 0.21 74 (85) 13 (15) 0.36 In-hospital death 7 (1) 7 (2) 0 (0) 0.18 4 (57) 3 (43) 0.21 Age (months), median [IQR] 4 [1, 7] 4 [1, 7] 3 [1, 6] 0.17 4 [1, 7] 3 [1, 6] 0.16 Born before or on October 1, 2023 694 (68) 275 (66) 419 (69) 0.08 649 (94) 45 (6) 0.47 Born after October 1, 2023 331 (32) 145 (35) 186 (31) 281 (85) 50 (15) Female 434 (42) 162 (39) 272 (45) 0.13 398 (92) 36 (8) 0.10 Race and ethnicity h Black or African American, non-Hispanic 77 (8) 28 (7) 49 (8) 0.19 70 (91) 7 (9) 0.41 White, non-Hispanic 436 (43) 168 (40) 268 (44) 411 (94) 25 (6) Hispanic or Latino 398 (39) 165 (39) 233 (39) 352 (88) 46 (12) Other, non-Hispanic 77 (8) 43 (10) 34 (6) 64 (83) 13 (17) Unknown 37 (4) 16 (4) 21 (3) 33 (89) 4 (11) Social Vulnerability Index of residence i Quartile 1 140 (14) 44 (10) 96 (16) 0.26 135 (96) 5 (4) 0.34 Quartile 2 136 (13) 60 (14) 76 (13) 122 (90) 14 (10) Quartile 3 142 (14) 50 (12) 92 (15) 131 (92) 11 (8) Quartile 4 157 (15) 55 (13) 102 (17) 142 (90) 15 (10) Unknown 450 (44) 211 (50) 239 (40) 400 (89) 50 (11) Medicaid coverage j 508 (50) 216 (51) 292 (48) 0.07 463 (91) 45 (9) 0.12 Linkage to maternal RSV vaccination k m 886 (86) 354 (84) 532 (88) 0.11 799 (90) 87 (10) 0.18 No. of UMC categories l 0 750 (73) 240 (57) 510 (84) 0.66 701 (93) 49 (7) 0.54 1 167 (16) 97 (23) 70 (12) 145 (87) 22 (13) 2 66 (6) 47 (11) 19 (3) 50 (76) 16 (24) ≥3 42 (4) 36 (9) 6 (1) 34 (81) 8 (19) Presence of UMC category Respiratory disease 121 (12) 78 (19) 43 (7) 0.35 98 (81) 23 (19) 0.37 Non-respiratory disease 369 (36) 198 (47) 171 (28) 0.40 320 (87) 49 (13) 0.35 ≥1 high-risk UMC m 227 (22) 150 (36) 77 (13) 0.56 186 (82) 41 (18) 0.51 Chronic lung disease of prematurity 19 (2) 16 (4) 3 (1) 0.23 14 (74) 5 (26) 0.21 Congenital heart disease 123 (12) 87 (21) 36 (6) 0.45 94 (76) 29 (24) 0.53 Down syndrome 16 (2) 15 (4) 1 (<1) 0.25 15 (94) 1 (6) 0.05 Neuromuscular disease 97 (10) 73 (17) 24 (4) 0.45 81 (84) 16 (16) 0.25 Cystic fibrosis 3 (<1) 3 (1) 0 (0) 0.12 1 (33) 2 (67) 0.19 Congenital airway abnormality 32 (3) 22 (5) 10 (2) 0.20 27 (84) 5 (16) 0.12 Reactive airway disease 38 (4) 15 (4) 23 (4) 0.01 34 (89) 4 (11) 0.03 Preterm birth n 145 (14) 83 (20) 62 (10) 0.27 120 (83) 25 (17) 0.34 Nirsevimab immunization 95 (9) 91 (22) 4 (1) 0.71 – 95 (100) – Dose 7–59 days prior to encounter 57 (6) 53 (13) 4 (1) 0.71 – 57 (100) – Dose 60–145 days prior to encounter 38 (4) 38 (9) 0 (0) – 38 (100) – Age at immunization (days), median, [IQR] 34 [3, 124] 34 [3, 124] 33 [4, 73] 0.39 – 34 [3, 124] – RSV = respiratory syncytial virus; ED = emergency department; SMD = standardized mean difference; ICU = intensive care unit; IMV = invasive mechanical ventilation; IQR = interquartile range; UMC = underlying medical condition; VISION = Virtual SARS-CoV-2, Influenza, and Other respiratory viruses Network. a RSV test results from tests conducted within 10 days prior to 3 days after date of hospital admission. If multiple tests were conducted, positive results were prioritized over negative results, then the most proximal test to the date of the encounter, and then viral culture test results over molecular assay test results, molecular assay test results over rapid molecular assay test results, rapid molecular assay test results over rapid antigen test results, rapid antigen test results over fluorescent antibody test results, and fluorescent antibody test results over serology test results. One site did not capture fluorescent antibody or serology test results. Test results for all viral culture, molecular, and rapid molecular tests and positive rapid antigen tests were included. Test results for negative rapid antigen tests and fluorescent antibody and serology tests were not included. b The standardized mean difference is the difference between the distribution of RSV-positive encounters and the distribution of RSV-negative encounters. A standardized mean difference >0.2 was considered a meaningful difference between groups. c Encounters were excluded if the infant received >1 nirsevimab dose; received nirsevimab prior to October 1, 2023; received nirsevimab 0–6 days prior to the index date; received another RSV immunization product, or the infant was aged <7 days at the time of the encounter. d The standardized mean difference is the difference between the distribution of unimmunized encounters and the distribution of immunized encounters. A standardized mean difference >0.2 was considered a meaningful difference between groups. e The index date for each encounter was defined as either the date of collection of a respiratory specimen associated with the most recent positive or negative RSV test result before the encounter or the date of the encounter (if testing occurred only after the encounter date). Thus, some hospital admissions may have occurred after March 31, 2024. f N = 15 missing ICU status. g N = 129 missing IMV status. h “Non-Hispanic, Other” race includes persons reporting non-Hispanic ethnicity and any of the following for race: American Indian or Alaska Native, Asian, Native Hawaiian or other Pacific Islander, other races not listed, and multiple races; because of small numbers, these categories were combined. “Unknown” includes persons with missing race and ethnicity in their electronic health records. i Reflects the quartiles of the distribution of Social Vulnerability Index (SVI) among encounters included in this analysis. SVI is defined based on the census tract of residence. The CDC/ATSDR SVI uses 16 U.S. census variables to determine social vulnerability for each census tract. Higher SVI values correspond to higher social vulnerability, which refers to the potential negative effects on communities caused by external stresses on human health. j N = 23 with unknown Medicaid coverage status as of encounter date. k Linkage to maternal RSV vaccination records was required for inclusion for all infants born on or before September 22, 2023. l UMC categories included pulmonary, cardiovascular, cerebrovascular, musculoskeletal, neurologic, hematologic, endocrine, renal, and gastrointestinal. m High-risk conditions included International Classification of Disease, 10th Revision (ICD-10) discharge diagnosis codes for: chronic lung disease of prematurity, congenital heart disease, Down Syndrome, neurological and/or musculoskeletal conditions, cystic fibrosis, congenital airway abnormality, and reactive airway disease. n Preterm birth status was derived from ICD-10 discharge diagnosis codes and infant records. If either an ICD-10 code corresponding to preterm birth (P07.∗) was listed among the discharge diagnoses as the time of the RLI encounter or the recorded gestational age at birth was <37 weeks, then the infant was considered to have been born preterm. Gestational age at birth was unknown for 381 (37%) of RLI hospitalizations. Nirsevimab effectiveness against RSV-associated hospitalisation among infants Among 1025 hospitalisations with RLI among infants in their first RSV season, 95 had evidence of nirsevimab receipt ≥7 days prior to the index date for the hospitalisation, with a median time since dose of 48 days (IQR: 24–82) ( Table 4 Table 4 Supplementary Table S9 Supplementary Tables S10 and S11 Table 4 Nirsevimab effectiveness against RSV-associated hospitalization among infants in their first RSV season, VISION Network, Oct 8, 2023–March 31, 2024. Nirsevimab dosage pattern | time since dose Total RLI hospitalizations a RSV-positive RLI hospitalizations N (Row %) Median days since dose (IQR) Adjusted PE (95% CI) b No nirsevimab doses 930 601 (65) N/A ref Nirsevimab, 7–145 days prior 95 4 (4) 48 (24–82) 98 (95–99) RSV = respiratory syncytial virus; ED = emergency department; IQR = interquartile range; CI = confidence interval; Ref = reference group; PE = product effectiveness; VISION = Virtual SARS-CoV-2, Influenza, and Other respiratory viruses Network. a Encounters included those among infants in their first RSV season with a diagnosis of RSV-like illness (RLI), excluding infants with evidence of maternal RSV vaccination and infants who received nirsevimab <7 days prior to the index date for the encounter. RLI was defined as ≥1 International Classification of Disease 10th Revision discharge diagnosis code corresponding to one or more of the following: COVID-19 pneumonia, influenza pneumonia, other viral pneumonia, influenza disease, bacterial pneumonia, acute respiratory distress syndrome, asthma exacerbation, respiratory failure, other acute lower respiratory tract infection, sinusitis, acute upper respiratory tract infections, acute respiratory illness signs and symptoms, viral illness not otherwise specified, sepsis, respiratory failure, irritable/fussy infant, respiratory distress of newborn, congenital pneumonia, interstitial emphysema and related conditions, other respiratory conditions originating in the perinatal period, congenital viral diseases, bacterial sepsis of newborn, or other infections specific to the perinatal period. b PE was calculated as (1—adjusted odds ratio) x 100%, with adjusted odds ratio calculated using logistic regression, adjusting for age, race and ethnicity, sex, calendar day, and geographic region. Discussion In this multisite investigation of nirsevimab effectiveness among infants in their first RSV season, we found that nirsevimab was 77% effective against RSV-associated ED encounters and 98% effective against RSV-associated hospitalisation during the first season of nirsevimab availability in the United States, though median time since dosing was only 48–54 days. Our findings are among the first to demonstrate real-world nirsevimab effectiveness against RSV-associated ED encounters and hospitalisations in the United States. Previously published data regarding nirsevimab effectiveness among infants in their first RSV season, largely from Spain and France but also from the New Vaccine Surveillance Network (NVSN) the Yale New Haven Health System, and Alaska’s Yukon-Kuskokwim region in the United States, have shown nirsevimab to be effective against RSV-associated ED encounters and hospitalisation, with estimates of effectiveness against RSV-associated ED encounters ranging from 55% to 88% and estimates of effectiveness against RSV-associated hospitalisation ranging from 70% to 90%. 23 24 25 26 27 28 29 30 31 32 33 34 35 36 13 37 38 37 39 35 , 36 40 41 26 27 28 34 5 , 42 RSV is the leading cause of hospitalisation among infants in the United States. 4 5 , 43 37 44 The strengths of this investigation include the large number of medical encounters in a geographically-diverse network of healthcare and research centres in the United States with integrated medical, laboratory, and immunization data. Integration of medical, laboratory, and immunization data allowed documentation of RSV test results obtained in a variety of settings within a time period around RLI encounters and documentation of immunizations administered in a variety of healthcare settings. Additionally, nirsevimab effectiveness estimates were robust in multiple sensitivity analyses, strengthening confidence in these estimates. Our investigation of nirsevimab effectiveness among infants in their first RSV season is subject to at least six limitations. First, we cannot rule out the possibility that patients with RSV-positive encounters may have had an encounter for reasons other than RSV, which could have lowered nirsevimab effectiveness estimates. However, nirsevimab effectiveness estimates were similar in sensitivity analyses limiting encounters to those meeting the acute respiratory illness definition and in the sensitivity analyses excluding controls testing positive for SARS-CoV-2 or influenza. Second, because immunization registries, EHRs, and medical claims might not identify all nirsevimab, palivizumab, or maternal RSV doses administered, misclassification of RSV immunization status was possible. Under-ascertainment of RSV immunizations would likely result in underestimation of nirsevimab effectiveness. 45 46 47 48 45 13 49 Our analysis of medical encounters during the 2023–2024 RSV season showed nirsevimab was effective against RSV-associated ED encounters and hospitalisation among infants in their first RSV season during the first season after nirsevimab approval and recommendation. However, these estimates reflect a short interval from nirsevimab administration to RLI onset. Since nirsevimab is a passive immunization and concentration is expected to wane over time, it is important to continue monitoring effectiveness to assess effectiveness with increased time since dose. These findings add to the growing body of literature demonstrating the potential of broad nirsevimab uptake among infants to reduce severe RSV. Contributors ABP and RLG conceptualized the assessment. ABP, RLG, and SBW drafted the statistical analysis plan. SBW, EAKR, SER, PKM and SC conceptualized and conducted the statistical analyses. ABP drafted the manuscript with input from HLM, RLG, and KFD. MSS, SYT, KD, SAI, BD, SWB, GVB, and MD were the site primary investigators. ABS, JH, KN, BS, CB, LSS, BL, TS, JA, DB, JVO, ALN, PDK, SJG, WFF, CR, and TD were site investigators. MN, AAC, and ELR managed and analyzed data and assisted with table and figure completion. RLG and MWT served as the CDC principal investigators for the VISION Network and ensured funding and site participation in the network. MSS, SYT, KD, SAI, BD, SWB, GVB, MD, ABS, JH, KN, SBS, CB, LSS, BL, TS, JA, DB, JVO, ALN, PDK, SJG, WFF, CR, and TD had access to their site’s raw data. ABP, SBW, EAKR, PKM, SC, MN, AAC, and ELR had access to and verified the data. ABP had final responsibility for the decision to submit the manuscript. All authors contributed to the interpretation of the findings and reviewed the final manuscript draft. Data sharing statement Data collected for the study are not available. Data sharing agreements between CDC and VISION Network partner institutions prohibit CDC from making this dataset publicly available. Declaration of interests SYT reports contracts from GSK and Pfizer. SYT, SBS, CB, LSS, and BL report institutional support for the VISION project via Contract # 75D30123C18039. MSS reports grants to their institution from CDC and National Institutes of Health and a paid role on the American Academy of Pediatrics, with payment made to their institution. BED, MBD, and WFF report an additional CDC contract for the Vaccine Safety Datalink. GVB reports grant funding from Sanofi for research unrelated to this work. ABS reports honoraria from the American Cancer Society for moderating a session at the New York State HPV Vaccination Summit and presenting for the HPV Vaccine ECHO series, from the University at Albany, State University of New York for a webinar on HPV Vaccine Communication Strategies for Patients and Communities, and from Bronxcare, Staten Island University Hospital for Grand Rounds presentations on HPV vaccine at multiple institutions, is a voluntary co-chair of the NY State HPV Coalition Health Equity Action Team, and a voluntary member of the NY State HPV Coalition Steering Committee. KN reports grants to their institution from National Institutes of Health National Cancer Institute, National Heart Lung, and Blood Institute, and Office of the Director. LSS reports grants to their institution from GSK, Moderna, and Dynavax. BL reports grant funding to their institution from the National Institutes of Health. TS reports unpaid participation as a member of the Advisory Committee on Immunization Practices Influenza Vaccine Work Group, chief of the Utah Adult Immunization Coalition, and as a member of the Utah Department of Health and Human Services Scientific Advisory Committee on Vaccines. SJG reports funding the National Institutes of Health’s National Center for Advancing Translation Sciences and National Institute of Mental Health. SBW, EAKR, SWB, SER, PKM, and SC report payments made to Westat via CDC Contract #75D30121D12779. MSS, SAI, BED, JH, KN, SJG, WFF, CR, and MBD report payments made to their institution by CDC via Westat. MBD reports funding from CDC as a Center for Excellence in Newcomer Health. All other authors declare no competing interests. References 1 Hall C.B. Weinberg G.A. Iwane M.K. The burden of respiratory syncytial virus infection in young children N Engl J Med 360 6 2009 588 598 19196675 10.1056/NEJMoa0804877 PMC4829966 2 McLaughlin J.M. Khan F. Schmitt H.J. Respiratory syncytial virus-associated hospitalisation rates among US infants: a systematic review and meta-analysis J Infect Dis 225 6 2022 1100 1111 33346360 10.1093/infdis/jiaa752 PMC8921994 3 Glezen W.P. Taber L.H. Frank A.L. Kasel J.A. Risk of primary infection and reinfection with respiratory syncytial virus Am J Dis Child 140 6 1986 543 546 3706232 10.1001/archpedi.1986.02140200053026 4 Suh M. Movva N. Jiang X. Respiratory syncytial virus is the leading cause of United States infant hospitalizations, 2009-2019: a study of the national (nationwide) inpatient sample J Infect Dis 226 Suppl 2 2022 S154 S163 35968878 10.1093/infdis/jiac120 PMC9377046 5 McMorrow M.L. Moline H.L. Toepfer A.P. Respiratory syncytial virus-associated hospitalizations in children <5 Years: 2016-2022 Pediatrics 154 1 2024 10.1542/peds.2023-065623 PMC11890375 38841769 6 Caserta M.T. O'Leary S.T. Munoz F.M. Ralston S.L. Committee On Infectious D. Palivizumab prophylaxis in infants and young children at increased risk of hospitalization for respiratory syncytial virus infection Pediatrics 152 1 2023 10.1542/peds.2023-061803 37357729 7 Food and Drug Administration SYNAGIS (palivizumab) product label 1998 US Department of Health and Human Services, Food and Drug Administration Silver Spring, MD https://www.accessdata.fda.gov/drugsatfda_docs/label/2014/103770s5185lbl.pdf 8 Food and Drug Administration Beyfortus (nirsevimab-alip) product label 2023 US Department of Health and Human Services, Food and Drug Administration Silver Spring, MD https://www.accessdata.fda.gov/drugsatfda_docs/label/2023/761328s000lbl.pdf 9 Jones J.M. Fleming-Dutra K.E. Prill M.M. Use of nirsevimab for the prevention of respiratory syncytial virus disease among infants and young children: recommendations of the advisory committee on immunization Practices - United States, 2023 MMWR Morb Mortal Wkly Rep 72 34 2023 920 925 37616235 10.15585/mmwr.mm7234a4 PMC10468217 10 RSV immunization guidance for infants and young children 2024 Centers for Disease Control and Prevention, National Center for Immunization and Respiratory Diseases Atlanta, GA https://www.cdc.gov/rsv/hcp/vaccine-clinical-guidance/infants-young-children.html 11 Food and Drug Administration ABRYSVO package insert 2023 US Department of Health and Human Services, Food and Drug Administration Silver Spring, MD https://www.fda.gov/media/168889/download?attachment 12 Fleming-Dutra K.E. Jones J.M. Roper L.E. Use of the pfizer respiratory syncytial virus vaccine during pregnancy for the prevention of respiratory syncytial virus-associated lower respiratory tract disease in infants: recommendations of the advisory committee on immunization Practices - United States, 2023 MMWR Morb Mortal Wkly Rep 72 41 2023 1115 1122 37824423 10.15585/mmwr.mm7241e1 PMC10578951 13 Limited availability of nirsevimab in the United States—interim CDC recommendations to protect infants from respiratory syncytial virus (RSV) during the 2023–2024 respiratory virus season 2023 Centers for Disease Control and Prevention, Center for Preparedness and Response (CPR) Atlanta, GA https://emergency.cdc.gov/han/2023/han00499.asp 14 Updated guidance for healthcare providers on increased supply of nirsevimab to protect young children from severe respiratory syncytial virus (RSV) during the 2023–2024 respiratory virus season 2024 Centers for Disease Control and Prevention, Office of Readiness and Response Atlanta, GA https://emergency.cdc.gov/newsletters/coca/2024/010524a.html 15 Griffin M.P. Yuan Y. Takas T. Single-dose nirsevimab for prevention of RSV in preterm infants N Engl J Med 383 5 2020 415 425 32726528 10.1056/NEJMoa1913556 16 Thompson M.G. Stenehjem E. Grannis S. Effectiveness of covid-19 vaccines in ambulatory and inpatient care settings N Engl J Med 385 15 2021 1355 1371 34496194 10.1056/NEJMoa2110362 PMC8451184 17 Hamid S. Winn A. Parikh R. Seasonality of respiratory syncytial virus - United States, 2017-2023 MMWR Morb Mortal Wkly Rep 72 14 2023 355 361 37022977 10.15585/mmwr.mm7214a1 PMC10078848 18 Tenforde M.W. Weber Z.A. DeSilva M.B. Vaccine effectiveness against influenza-associated urgent care, emergency department, and hospital encounters during the 2021-2022 season, VISION network J Infect Dis 228 2 2023 185 195 36683410 10.1093/infdis/jiad015 PMC11306092 19 CDC/ATSDR SVI documentation 2020 2022 Agency for Toxic Substances and Disease Registry Atlanta, GA https://www.atsdr.cdc.gov/placeandhealth/svi/documentation/pdf/SVI2020Documentation_08.05.22.pdf 20 NCHS urban-rural classification scheme for counties 2017 National Center for Health Statistics Hyattsville, MD https://www.cdc.gov/nchs/data_access/urban_rural.htm 21 Cohen J. Statistical power analysis in the behavioral sciences 2nd ed. 1988 Routledge New York 22 Firth D. Bias reduction of maximum-likelihood-estimates Biometrika 80 1 1993 27 38 23 Aguera M. Soler-Garcia A. Alejandre C. Nirsevimab immunization’s real-world effectiveness in preventing severe bronchiolitis: a test-negative case-control study Pediatr Allergy Immunol 35 6 2024 e14175 10.1111/pai.14175 38899631 24 Ares-Gomez S. Mallah N. Santiago-Perez M.I. Effectiveness and impact of universal prophylaxis with nirsevimab in infants against hospitalisation for respiratory syncytial virus in Galicia, Spain: initial results of a population-based longitudinal study Lancet Infect Dis 24 8 2024 817 828 38701823 10.1016/S1473-3099(24)00215-9 25 Assad Z. Romain A.S. Aupiais C. Nirsevimab and hospitalization for RSV bronchiolitis N Engl J Med 391 2 2024 144 154 38986058 10.1056/NEJMoa2314885 26 Barbas Del Buey J.F. Inigo Martinez J. Gutierrez Rodriguez M.A. The effectiveness of nirsevimab in reducing the burden of disease due to respiratory syncytial virus (RSV) infection over time in the Madrid region (Spain): a prospective population-based cohort study Front Public Health 12 2024 1441786 10.3389/fpubh.2024.1441786 PMC11361977 39220460 27 Carbajal R. Boelle P.Y. Pham A. Real-world effectiveness of nirsevimab immunisation against bronchiolitis in infants: a case-control study in Paris, France Lancet Child Adolesc Health 8 10 2024 730 739 39208832 10.1016/S2352-4642(24)00171-8 28 Coma E. Martinez-Marcos M. Hermosilla E. Effectiveness of nirsevimab immunoprophylaxis against respiratory syncytial virus-related outcomes in hospital and primary care settings: a retrospective cohort study in infants in Catalonia (Spain) Arch Dis Child 109 9 2024 736 741 38857952 10.1136/archdischild-2024-327153 PMC11347209 29 Estrella-Porter P. Blanco-Calvo C. Lameiras-Azevedo A.S. Effectiveness of nirsevimab introduction against respiratory syncytial virus in the Valencian Community: a preliminary assessment Vaccine 42 22 2024 126030 10.1016/j.vaccine.2024.05.078 38834430 30 Ezpeleta G. Navascues A. Viguria N. Effectiveness of nirsevimab immunoprophylaxis administered at birth to prevent infant hospitalisation for respiratory syncytial virus infection: a population-based cohort study Vaccines (Basel) 12 4 2024 10.3390/vaccines12040383 PMC11054679 38675765 31 Lassoued Y. Levy C. Werner A. Effectiveness of nirsevimab against RSV-bronchiolitis in paediatric ambulatory care: a test-negative case-control study Lancet Reg Health Eur 44 2024 101007 10.1016/j.lanepe.2024.101007 PMC11321316 39139197 32 Lopez-Lacort M. Munoz-Quiles C. Mira-Iglesias A. Early estimates of nirsevimab immunoprophylaxis effectiveness against hospital admission for respiratory syncytial virus lower respiratory tract infections in infants, Spain, October 2023 to January 2024 Euro Surveill 29 6 2024 10.2807/1560-7917.ES.2024.29.6.2400046 PMC10853977 38333937 33 Paireau J. Durand C. Raimbault S. Nirsevimab effectiveness against cases of respiratory syncytial virus bronchiolitis hospitalised in paediatric intensive care units in France, September 2023-January 2024 Influenza Other Respir Viruses 18 6 2024 e13311 10.1111/irv.13311 PMC11154801 38840301 34 Moline H.L. Tannis A. Toepfer A.P. Early estimate of nirsevimab effectiveness for prevention of respiratory syncytial virus-associated hospitalization among infants entering their first respiratory syncytial virus season - New vaccine surveillance network, October 2023-February 2024 MMWR Morb Mortal Wkly Rep 73 9 2024 209 214 38457312 10.15585/mmwr.mm7309a4 PMC10932582 35 Xu H. Aparicio C. Wats A. Estimated effectiveness of nirsevimab against respiratory syncytial virus JAMA Netw Open 8 3 2025 e250380 10.1001/jamanetworkopen.2025.0380 PMC11894488 40063022 36 Lefferts B. Bressler S. Keck J.W. Nirsevimab effectiveness against medically attended respiratory syncytial virus illness and hospitalization among Alaska native children - yukon-kuskokwim delta region, Alaska, October 2023-June 2024 MMWR Morb Mortal Wkly Rep 73 45 2024 1015 1021 39541241 10.15585/mmwr.mm7345a1 PMC11576050 37 Nirsevimab receipt and intent for infants, United States 2024 Centers for Disease Control and Prevention, National Center for Immunization and Respiratory Diseases Atlanta, GA https://www.cdc.gov/vaccines/imz-managers/coverage/rsvvaxview/nirsevimab-coverage.html 38 Martinon-Torres F. Miras-Carballal S. Duran-Parrondo C. Early lessons from the implementation of universal respiratory syncytial virus prophylaxis in infants with long-acting monoclonal antibodies, Galicia, Spain, September and October 2023 Euro Surveill 28 49 2023 10.2807/1560-7917.ES.2023.28.49.2300606 PMC10831408 38062942 39 Hammitt L.L. Dagan R. Yuan Y. Nirsevimab for prevention of RSV in healthy late-preterm and term infants N Engl J Med 386 9 2022 837 846 35235726 10.1056/NEJMoa2110275 40 Orenstein W.A. Bernier R.H. Dondero T.J. Field evaluation of vaccine efficacy Bull World Health Organ 63 6 1985 1055 1068 3879673 PMC2536484 41 Movva N. Suh M. Bylsma L.C. Fryzek J.P. Nelson C.B. Systematic literature review of respiratory syncytial virus laboratory testing Practices and incidence in United States infants and children <5 Years of age J Infect Dis 226 Suppl 2 2022 S213 S224 35968874 10.1093/infdis/jiac203 PMC9377029 42 Curns A.T. Rha B. Lively J.Y. Respiratory syncytial virus-associated hospitalizations among children <5 Years old: 2016 to 2020 Pediatrics 153 3 2024 10.1542/peds.2023-062574 38298053 43 RSV-NET 2024 Centers for Disease Control and Prevention, National Center for Immunization and Respiratory Diseases Atlanta, GA https://www.cdc.gov/rsv/php/surveillance/rsv-net.html 44 Mazagatos C. Mendioroz J. Rumayor M.B. Estimated impact of nirsevimab on the incidence of respiratory syncytial virus infections requiring hospital admission in children < 1 Year, weeks 40, 2023, to 8, 2024, Spain Influenza Other Respir Viruses 18 5 2024 e13294 10.1111/irv.13294 PMC11077568 38716791 45 De Smedt T. Merrall E. Macina D. Perez-Vilar S. Andrews N. Bollaerts K. Bias due to differential and non-differential disease- and exposure misclassification in studies of vaccine effectiveness PLoS One 13 6 2018 e0199180 10.1371/journal.pone.0199180 PMC6003693 29906276 46 Ozasa K. The effect of misclassification on evaluating the effectiveness of influenza vaccines Vaccine 26 50 2008 6462 6465 18573297 10.1016/j.vaccine.2008.06.039 47 Sullivan S.G. Tchetgen Tchetgen E.J. Cowling B.J. Theoretical basis of the test-negative study design for assessment of influenza vaccine effectiveness Am J Epidemiol 184 5 2016 345 353 27587721 10.1093/aje/kww064 PMC5013887 48 Onwuchekwa C. Atwell J. Moreo L.M. Pediatric respiratory syncytial virus diagnostic testing performance: a systematic review and meta-analysis J Infect Dis 228 11 2023 1516 1527 37285396 10.1093/infdis/jiad185 PMC10681870 49 Kemp M. Capriola A. Schauer S. RSV immunization uptake among infants and pregnant persons - Wisconsin, October 1, 2023-March 31, 2024 Vaccine 47 2025 126674 10.1016/j.vaccine.2024.126674 39756214 Appendix A Supplementary data  Supplementary Figs. S1 and S2 and Tables S1–S11 Acknowledgements This work was supported by the 10.13039/100000030 U.S. Centers for Disease Control and Prevention 75D30121D12779 75D30123C18039 Disclaimer: Appendix A Supplementary data related to this article can be found at https://doi.org/10.1016/j.lana.2025.101196 o See e.g., 45 C.F.R. part 46.102(l)(2), 21 C.F.R. part 56; 42 U.S.C. §241(d); 5 U.S.C. §552a; 44 U.S.C. §3501 et seq. ",
  "metadata": {
    "Title of this paper": "RSV immunization uptake among infants and pregnant persons - Wisconsin, October 1, 2023-March 31, 2024",
    "Journal it was published in:": "Lancet Regional Health - Americas",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485534/"
  }
}