{
  "title": "Paper_90",
  "abstract": "pmc J Fish Dis J Fish Dis 379 blackwellopen JFD Journal of Fish Diseases 0140-7775 1365-2761 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12489441 PMC12489441.1 12489441 12489441 40400130 10.1111/jfd.14146 JFD14146 JFD-2025-97.R1 1 Research Article Research Article Ultrastructural Insights Into a Candidatus Cascarano Maria Chiara  1  2 Sevasti Papadogiorgaki  1 Katharios Pantelis https://orcid.org/0000-0001-9905-5068  2 katharios@hcmr.gr   1 University of Crete Heraklion Crete Greece   2 Institute of Marine Biology, Biotechnology and Aquaculture Hellenic Centre for Marine Research Heraklion Crete Greece * Correspondence: katharios@hcmr.gr 21 5 2025 11 2025 48 11 498134 10.1111/jfd.v48.11 e14146 18 4 2025 26 2 2025 07 5 2025 02 10 2025 03 10 2025 03 10 2025 © 2025 The Author(s). Journal of Fish Diseases https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Despite recent genomic studies and increased molecular data, epitheliocystis remains an enigmatic fish disease with no experimental in vitro or in vivo models to aid the advancement of research. In this study, we revert to a classical microscopical approach and screen with the electron microscope the epitheliocystis lesions caused by a Ca Candidatus similchlamydia  Chlamydia trachomatis Candidatus chronic infection Epitheliocystis mucous cells phagoptosis reservoirs Hellenic Foundation for Research and Innovation 10.13039/501100013209 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date November 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:02.10.2025  Funding: 1 Introduction Chlamydial pathogens are highly specialised obligate intracellular Gram‐negative bacteria, widely distributed in diverse environments and affecting more than 400 eukaryotic hosts including higher vertebrates, invertebrates and protists (Moulder 2019 2004 2022 2021 2014 In fish hosts, Chlamydiae have been implicated as causative agents of epitheliocystis disease, a gill and skin infection in which intracellular bacteria cause the distinctive formation of intracellular inclusions (reviewed in (Blandford et al. 2018 Ca Ca Ca 2018 2016 2014 2014 Candidatus Ca Ca 2013c 2017b 2018 2018 2017a Given the current absence of in vitro validation for genomic findings, microscopic observation of the lesions continues to be a crucial tool, albeit limited, to complement the emerging NGS data. One such observation is that lesions associated with Parilichlamydiaceae are observed in different areas of the gill including the filaments and the lamellae, where they seem to cause minimal to no epithelial proliferation in the different fish hosts (Guevara Soto et al. 2016 2017 2015 2013 2013a 2013b 2013c 2017a Ca 2018 2017 2017 Epitheliocystis in Greater Amberjack in Greece has been attributed to two coinfecting bacterial agents, a novel Betaproteobacteria and a Ca Ca 2022 2022 2002 Epitheliocystis infection of mucous cells has been previously described in carp,  Cyprinus carpio 1981 1984 Ca  Seriola lalandi 2013a While the acute infection of interlamellar chloride cells is currently being attributed to a Beta‐proteobacterium (Cascarano M.C. and Katharios P., unpublished data), the chronic infection of mucous cells along the trailing/afferent edge of Greater Amberjack is subject to ultrastructural investigation in the present study. Our aim is to clarify the nature of the infective agent, investigate its intracellular association with the cell organelles, and explore the local cellular immune response to infection. 2 Materials and Methods 2.1 Fish Sampling, Molecular Analysis and Histology Greater amberjack were sacrificed during an experiment where the onset and progression of epitheliocystis were monitored for over 1 year in cage‐reared fish in Souda Bay, Crete, Greece. For extended methods, one can refer to (Cascarano et al. 2022 later In the aforementioned experiment, fish gills were tested with PCR to detect the presence of bacterial pathogens associated with epitheliocystis using primer sets for known gamma‐proteobacteria, beta‐proteobacteria and chlamydial agents (Cascarano et al. 2022 2022 2.2 Electron Microscopy All gill samples in which the distinctive infection of mucous cells along the trailing edge of the filament was observed were retained to select an appropriate sample to process for electron microscopy. To increase the possibility of sectioning infected cells along the thin trailing/afferent edge of the filaments, only samples with abundant cysts were considered. Moreover, gills showing evident coinfection with other bacteria or monogenean parasites were excluded. The chosen sample belonged to a 366 g fish which was sacrificed in December 2018, 4 months after transfer to the sea cages. The gills of this fish were positive for both Ca Ca Gills preserved in 4F:1G were rinsed with Sodium Cacodylate Buffer (SCB) (0.1 M, pH 7.2) for 15 min for three times. Following rinsing, gills were fixed with 1% osmium tetroxide for 2 h at RT and rinsed with 0.1 M SCB buffer for 15 min for three times. The fixed sample was dehydrated by ascending grade ethanol solutions (30, 50, 70, 80, 90, 95 and 100% ethanol for 15 min for each concentration) and treated with 100% dry ethanol for 20 min, followed by immersion into propylene oxide twice for 15 min each. Following dehydration, filaments from different arches were divided into different blocks and treated with increasing mixed solutions of resin embedding media (Durcupan ACM, Sigma Aldrich) and propylene oxide (V:V = 1:3; V:V = 1:1; V:V = 3:1, for 1 h in each solution) and finally in 100% resin embedding media overnight. The recipe for the resin embedding media included: 10 mL of Durcupan single component A, M epoxy resin; 10 mL of Durcupan single component B, hardener 964; 0.3 mL of Durcupan single component C, accelerator 960 and 0.3 mL Durcupan single component D, plasticiser. Afterwards, the sample was dried at 60°C for 48 h. Sections were cut from the embedded gills with cross‐sections of the trailing/afferent edge and of the filament tip, using an ultramicrotome LEICA EM UC7. Sections were stained with toluidine blue and observed with a light microscope to progressively discard tissues and reach a region of interest. Once a lesion or an area of interest was located, up to three 70 nm thick sections were taken and placed on a copper 300‐mesh grid. Samples on the grid were stained with lead citrate and uranyl acetate and observed in the transmission electron microscope JEOL JEM‐2100 (University of Crete) at 80 KV. 3 Results Longitudinal sections of the tip and trailing edge of the filaments showed several infected mucous cells often clustering in infected groups (Figure 1A–C 1D FIGURE 1 Histology of infected gill filaments, polychrome stain. (A) infected mucous cells in the trailing edge of the filament, above the afferent artery (arrow). (B) Illustration of a partial gill arch (modified from Cascarano et al. 2022 Infected mucous cells were hypertrophic and showed a distinct polarisation, with intracellular bacteria always observed in an enclosed compartment at the bottom of the cell above the nucleus, and the apical part of the cell filled with mucin granules (Figure 1A,C 1D 1D,E In comparison with the small (up to 20 μm height and 8 μm width), pear‐shaped, uninfected neighbouring mucous cells, infected cells are hypertrophic and rounder in shape (up to 28 μm in diameter). The cell morphology changes to accommodate the intracellular expanding bacterial inclusion, which was observed in TEM to range between 5 and 25 μm in diameter. The bacterial compartment progressively fills the cytoplasmic space to the detriment of the upper space available to contain the mucin granules (Figure 2A,B FIGURE 2 TEM of infected mucous cells with nucleus (n), cytoplasm (c), bacterial inclusion (i) and mucin granules (g). Surrounding cells include lymphocyte‐like cells (L), other mucous cells (MC), empty mucous cells (EMC), mitochondria‐rich cells (MRC) and migrating macrophage‐like cells (MLC). (A) Longitudinal section of infected mucous cell (epithelium surface on the bottom of the picture marked with black arrowhead). (B) Cross‐section of an infected cell. In the inclusion (i) note a big aberrant bacterial cell (asterisk). We observed the different chlamydial morphological forms in different sizes of inclusion. Within the smallest observed inclusions (Figure 3A–C 3B,C 3B FIGURE 3 Changes in bacteria morphologies with increasing inclusion size. Inclusion of 5 μm (panel A–C), 14 μm (panels D–G) and 20 μm (H, I). (A) Infected mucous cell with cytoplasm (c), nucleus (n) and mucin granules (g), lymphocyte (l). (B) In between granules (g), an inclusion membrane (black arrowhead) displays tightly packed amorphous bacteria (asterisk) and elongated bacteria with an electron‐dense nucleus (white arrowheads). (C) Higher magnification of a reticulate body (RB) above granules (g). (D) Intermediate bodies IB, budding from RB (black arrowhead), intersperse with a dense interbacterial substance (asterisk). Note the presence of few elementary bodies (EB) (multiple arrow). (E) Binary fission between IBs (white arrow). (F) Multiple IBs connected by cytoplasmic bridges (black arrowheads). (G) EB in proximity of IBs (multiple arrow). (H) Several IBs originate from single amorphous polynucleated RB or are connected to each other (black arrowheads). Nucleus (n) of the infected cell. (I) Electron‐dense EBs originate from IBs (white arrows). In the largest inclusions of up to 15 μm (Figure 3D–G 3D 3E 3D 3E 3F 3G 3D In the inclusions above 15 μm (Figure 3H,I 3H,I 3H 3I 3I 2B The electron‐dense inclusion membrane (IM) surrounds the intracellular space occupied by the replicating bacteria, located between the nucleus (Figure 4A,B 4C,D 3B 3B 4B 4B 4C FIGURE 4 The inclusion membrane. (A) Infected cell with nucleus (n), cytoplasm (c), electron‐lucent cytoplasmic vesicles (black arrowhead). (B) Higher magnification of the area in from box A, with cytoplasm (c), and membrane invagination containing electron‐dense granular material (black arrow). Note electron‐lucent vesicles in the cytoplasm (black arrowheads) fusing with the inclusion membrane (multiple arrow). (C) Interface between inclusion (i) and mucin granules (g) separated by the inclusion membrane (multiple arrow), electron‐dense substance in between bacteria (asterisk). (D) Infected cell in the interface between mucin and inclusion; the cytoplasm at the periphery (c) is rich in electron‐lucent empty vesicles (black arrowheads). (E) Area with a high number of interdigitations in the inclusion membrane. (F) Higher magnification of the area in the black box E, indicating the presence of a multivesicular body (black arrow) fusing with the inclusion membrane. Electron‐lucent vesicles in the cytoplasmatic side (black arrowhead). The electron‐dense cytoplasm of the infected cell exhibits numerous electron‐light vesicles, approximately 150–200 nm in diameter. These vesicles are particularly prominent beneath the nucleus of the cell (Figure 4A 4D 3B In other cytoplasmic areas in proximity to the inclusion membrane, we observed multiple membrane stacks/vesicles containing 50–80 nm electron‐dense granules (Figure 4E,F 4F 4F The inspection of the areas surrounding the infected cells revealed the presence of different cell types, including epithelial cells, lymphocytes, mitochondria‐rich cells and migrating macrophages (Figure 2A At least one macrophage with extended pseudopods was observed in proximity to one of the observed infected cells (Figures 2A 5A 5B,C 5C 5C FIGURE 5 Immune cells in proximity of infected mucous cells (asterisk). (A) Macrophage‐like cell (MLC) with extending pseudopods and a phagocytic cell (white arrow) displaying in its cytoplasm a phagocytized cell (pc). (B) Interaction between an infected mucous cell and a macrophage. (C) Higher magnification of the area in box B showing the cytoplasmatic projection of the macrophage adhering to the infected cell (area between arrows) in proximity of the chlamydial inclusion membrane (multiple arrow). (D) Semithin‐section, toluidine blue‐stained area between the infected cell and the afferent artery showing granular cells (arrows). (E) Histology polychrome stain of the area between the infected cell and the afferent artery showing granular cells (arrows). (F) TEM of a granular cell with multiple vesicles containing bacterial‐like electron‐dense peripheral bodies (multiple arrows). (G) Granular cell in proximity of an infected mucous cell, displaying bacteria‐like structures inside phagolysosomes (white arrowheads) and in a vesicle (black box). (H) Higher magnification of an area in the black box G. Autophagosome assembles around a cytoplasmic membrane‐bound structure, a bacterium is observed in a second vesicle. Below the infected cells, in deeper areas of the filament closer to the afferent artery, we observed some peculiar granulocytes, with toluidine blue‐stained basophilic granules (Figure 5D,E 5F 5F 5G 5H Other immune cells were detected in the deeper layer of the trailing/afferent edge of the gills, including a number of phagocytic cells digesting whole cells (Figure 6A–D 6E 6F 6B 6C 6A,B 6B FIGURE 6 Longitudinal section of the deeper layer of the trailing/afferent edge below infected mucous cell. (A) Granular cell with secondary lysosomes containing either bacteria or secretory granules (multiple arrowhead); Phagocytic cell with nucleus (n) and phagocytized cells (pc); cell with elongated cytoplasmic extensions and numerous cytoplasmatic filament bundles (white arrows). (B) Phagocytic cell with nucleus (n) and phagocyted cells (pc). Cytoplasmic projections containing filamentous bundles (white arrow). Nearby a cell resembling the precursor of a mucous cell (PMC). (C) Continuation of the previous picture with filaments in cytoplasmic projection of the phagocytic cell (white arrow), moreover showing another phagocytic cell containing a phagocytized cell (pc) resembling a granular cell or a mucous cell. (D) Degranulating or apoptotic granular cell in proximity of a phagocytic cell with nucleus (n) containing different level of degenerating phagocytized cells (pc). (E) cell resembling a macrophage (PMO). (F) Precursor of eosinophil‐like granulocyte with segmented bilobular nucleus (PELG) and a eosinophil‐like granulocyte (ELG) with long cytoplasmatic projection terminating with several vesicles. 4 Discussion 4.1 The Infecting Agent What we have previously described as chronic stages of epitheliocystis infection (Cascarano et al. 2022 Ca  Seriola lalandi 2013a The infecting Chlamydial agent displays two forms of RBs, one elongated and the second amorphous and multinucleated (Figure 7A Ca Seriola lalandi 2013a 2013a Ca 2017 2017  C. trachomatis 2006 7A Ca 2013a  C. trachomatis 2013 FIGURE 7 Bacterial morphology and proposed Chlamydial infection cycle inside mucous cells. (A) Variation of bacterial forms within lesion. (1) Reticulate bodies (RB) in elongated forms dividing by binary fission, and amorphous multinucleated forms. Bacteria are closely adhering to each other (no interbacterial space) and have electrodense cytoplasm staining with toluidine blue. (2) Amorphous multinucleated bodies from which intermediate bodies (IB) originate by polar budding. (3) IBs can divide and remain connected by cytoplasmic bridges. (4) Rounded electrodense Elementary bodies (EB). (B) Section of the trailing/afferent edge of the gills where infected mucous cells are to be found. (C) Normal mucous cell showing the exo‐endocytic coupling regulating plasma membrane surface balance with endocytic vesicles trafficked to lysosome, Golgi and possibly transcytosis. (D) Early chlamydial inclusion developing above the cell nucleus, possibly redirecting endocytic vesicles to the inclusion. (E) Expansion of the chlamydial inclusion and possible fusion of multivesicular body (MVB) blue vesicle, with inclusion membrane. Note the interaction with the adhering macrophage. (F) Extrusion of the inclusion in the water, as observed in previous studies (Cascarano et al. 2022 2022 We observed a decreasing staining affinity of the chlamydial inclusion with time, with bacteria strongly staining with toluidine blue only at very early stages of infection (small inclusions). In later stages, it might appear that bacteria stain significantly less, while the interbacterial substance inside the inclusion stained blue. We observed that interbacterial material is not observed in small inclusions (densely aggregated RBs only), increases significantly with the appearance of IBs in bigger inclusions and decreases slightly with the appearance of EBs in the biggest inclusion observed. In carp fry obtained from pond farms in Hungary, Molnar and Boros (Molnar and Boros 1981 1981 1984 4.2 Intracellular Infection of Mucous Cells While the study of mucous cells in fish is still in its infancy, we are gathering significant knowledge on their functioning from mammal models. For example, it is now well established that the process of mucus secretion and exocytosis of mucin granules (Burgoyne and Morgan 2003 1990 1991 2003 2021 7C In our study, we did observe the presence of small empty vesicles in the upper cytoplasmic membrane of uninfected mucocytes in proximity to the mucus secretion pore (not shown). Size and shape of such vesicles resemble the numerous small vesicles found in proximity to the IM in infected cells, which seem, at different points, to fuse with the inclusion, forming the characteristic invaginations. We moreover observed that the shape of the IM changes over time, with bigger inclusions displaying an increased number of IM interdigitations, and a lower number of surface mucin granules. While a completely different kind of study is necessary to prove the ability of Chlamydiae to scavenge endocytic vesicles from the exo‐endocytic coupling in our model, it is well known that intracellular bacteria require host cell membrane to expand their intracellular niche during replication (Case et al. 2016 Ca 7D,E Aside from the membrane surface, obligate intracellular bacteria need to scavenge nutrients from the host cell. In other Chlamydial studies, it has been shown that bacterial effectors secreted and inserted in the IM, the inclusion membrane proteins (INCs), can promote nutrient acquisition through redirection of cell nutrient‐rich exocytic vesicles transiting from the Golgi apparatus, or trafficking of multivesicular bodies (MVB) (Elwell et al. 2016 2000 2001  C. trachomatis 2006 2008 2015 2009 1966 Ca  C. trachomatis 7E In the absence of in vivo infection models, it is not possible to state if the extrusion of the whole bacterial inclusion observed in histology (Cascarano et al. 2022 1981 2016  C. trachomatis 2014 2007 2016 4.3 Local Cellular Immune Response to Chlamydial Infection Macrophages, which are known to populate gills mucosal tissue (Koppang et al. 2015  C. trachomatis 2019 2009 2013 1971 2005 2011 2015 2017 2016 7E In proximity to the infected cells and in deeper layers of the filament, we observed several cells that were described as phagocytic cells containing whole cells. Such description was made based on the observation of cells including large phagosomes containing whole degrading cells (resembling mucous cells or granular cells) and, moreover, for similarity to the mononuclear phagocytes engulfing eukaryotic cells described in fish spleen (Dyková et al. 2022 2012 2012 2015 2015 2020 Ca A number of granular cells were observed in the deeper layer of the trailing/afferent edge of the gills, below the layer of infected cells, of which a few displayed some degree of degranulation. In our study, we pointed to the presence of one or two different types of bacteria (based on different electron‐density) inside lysosomal compartments or in endocytic vesicles in cells neighbouring chlamydial‐infected cells. Considering that our screened sample was positive for two different agents, we suggest that one or even both epitheliocystis agents infecting greater amberjack could transit or reside in these cells, with proximity to infected mucous cells mostly supporting this evidence for the chlamydial agent. The presence of non‐replicating bacteria in infected immune cells can cause persistency of the agents in the tissues following the first infection (Hogan et al. 2004 2022 Based on this study and our previous observations in histology (Cascarano et al. 2022 7F–H Author Contributions  Maria Chiara Cascarano: Papadogiorgaki Sevasti: Pantelis Katharios: Conflicts of Interest The authors declare no conflicts of interest. Acknowledgements The study was partially supported by the Hellenic Foundation for Research and Innovation (HFRI) under the HFRI PhD Fellowship grant (Fellowship Number: 253). The authors would like to dedicate it to the late Professor Lloyd Vaughan for his encouragement and passionate support, which contributed to the development of this research. Additionally, our gratitude extends to Dr Ivona Mladineo for her valuable inputs during the initial revisions of this manuscript and to the anonymous reviewers who helped reshape its structure. Data Availability Statement The data supporting this study are available upon reasonable request from the authors. Requests can be made via email to the corresponding author. References Alexander P. R. Evans 1971 Endotoxin and Double Stranded RNA Render Macrophages Cytotoxic Nature: New Biology 232 29 76 78 5285341 10.1038/newbio232076a0 Bavoil P. M. 2014 What's in a Word: The Use, Misuse, and Abuse of the Word “Persistence” in Chlamydia Biology Frontiers in Cellular and Infection Microbiology 4 27 24624366 10.3389/fcimb.2014.00027 PMC3940941 Beatty W. L. 2006 Trafficking From CD63‐Positive Late Endocytic Multivesicular Bodies Is Essential for Intracellular Development of Chlamydia trachomatis Journal of Cell Science 119 2 350 359 10.1242/jcs.02733 16410552 Beatty W. L. 2008 Late Endocytic Multivesicular Bodies Intersect the Chlamydial Inclusion in the Absence of CD63 Infection and Immunity 76 7 2872 2881 18426873 10.1128/IAI.00129-08 PMC2446703 Blandford M. I. A. Taylor‐Brown T. A. Schlacher B. Nowak A. Polkinghorne 2018 Epitheliocystis in Fish: An Emerging Aquaculture Disease With a Global Impact Transboundary and Emerging Diseases 65 1436 1446 10.1111/tbed.12908 29790651 Blume Z. I. J. M. Lambert A. G. Lovel D. M. Mitchell 2020 Microglia in the Developing Retina Couple Phagocytosis With the Progression of Apoptosis via P2RY12 Signaling Developmental Dynamics 249 6 723 740 32072708 10.1002/dvdy.163 PMC8714022 Brown G. C. J. Neher 2012 Eaten Alive! Cell Death by Primary Phagocytosis: ‘Phagoptosis’ Trends in Biochemical Sciences 37 8 325 332 22682109 10.1016/j.tibs.2012.05.002 Brown G. C. A. Vilalta M. Fricker 2015 Phagoptosis‐Cell Death by Phagocytosis‐Plays Central Roles in Physiology, Host Defense and Pathology Current Molecular Medicine 15 9 842 851 26511705 10.2174/156652401509151105130628 Burgoyne R. D. A. Morgan 2003 Secretory Granule Exocytosis Physiological Reviews 83 2 581 632 12663867 10.1152/physrev.00031.2002 Cascarano M. C. M. Ruetten L. Vaughan 2022 Epitheliocystis in Greater Amberjack: Evidence of a Novel Causative Agent, Pathology, Immune Response and Epidemiological Findings Microorganisms 10 3 627 10.3390/microorganisms10030627 35336202 PMC8949381 Case E. D. R. J. A. Smith T. A. Ficht J. E. Samuel P. de Figueiredo 2016 Space: A Final Frontier for Vacuolar Pathogens Traffic 17 5 461 474 26842840 10.1111/tra.12382 PMC6048968 Corthay A. D. K. Skovseth K. U. Lundin 2005 Primary Antitumor Immune Response Mediated by CD4+ T Cells Immunity 22 3 371 383 10.1016/j.immuni.2005.02.003 15780993 Denzer K. M. J. Kleijmeer H. F. Heijnen W. Stoorvogel H. J. Geuze 2000 Exosome: From Internal Vesicle of the Multivesicular Body to Intercellular Signaling Device Journal of Cell Science 113 19 3365 3374 10984428 10.1242/jcs.113.19.3365 Dyková I. J. Žák R. Blažek M. Reichard K. Součková O. Slabý 2022 Histology of Major Organ Systems of Nothobranchius Fishes: Short‐Lived Model Species Journal of Vertebrate Biology 71 21074 21071 21074 10.25225/jvb.21074 Elwell C. K. Mirrashidi J. Engel 2016 Chlamydia Cell Biology and Pathogenesis Nature Reviews Microbiology 14 6 385 400 27108705 10.1038/nrmicro.2016.30 PMC4886739 Esteban M. Á. A. Cuesta E. Chaves‐Pozo J. Meseguer 2015 Phagocytosis in Teleosts. Implications of the New Cells Involved Biology 4 4 907 922 26690236 10.3390/biology4040907 PMC4690022 Gambarte Tudela J. A. Capmany M. Romao 2015 The Late Endocytic Rab39a GTPase Regulates the Interaction Between Multivesicular Bodies and Chlamydial Inclusions Journal of Cell Science 128 16 3068 3081 10.1242/jcs.170092 26163492 Guevara Soto M. B. Vidondo L. Vaughan 2016 The Emergence of Epitheliocystis in the Upper Rhone Region: Evidence for Chlamydiae in Wild and Farmed Salmonid Populations Archives of Microbiology 198 315 324 26802008 10.1007/s00203-016-1192-x Gundelfinger E. D. M. M. Kessels B. Qualmann 2003 Temporal and Spatial Coordination of Exocytosis and Endocytosis Nature Reviews Molecular Cell Biology 4 2 127 139 12563290 10.1038/nrm1016 Gustafsson J. K. J. E. Davis T. Rappai 2021 Intestinal Goblet Cells Sample and Deliver Lumenal Antigens by Regulated Endocytic Uptake and Transcytosis eLife 10 e67292 10.7554/eLife.67292 34677124 PMC8594945 Haabeth O. A. W. K. B. Lorvik C. Hammarström 2011 Inflammation Driven by Tumour‐Specific Th1 Cells Protects Against B‐Cell Cancer Nature Communications 2 1 1 12 10.1038/ncomms1239 PMC3072106 21407206 Herweg J. T. Rudel 2016 Interaction of Chlamydiae With Human Macrophages FEBS Journal 283 4 608 618 26613554 10.1111/febs.13609 Hogan R. J. S. A. Mathews S. Mukhopadhyay J. T. Summersgill P. Timms 2004 Chlamydial Persistence: Beyond the Biphasic Paradigm Infection and Immunity 72 4 1843 1855 15039303 10.1128/IAI.72.4.1843-1855.2004 PMC375192 Hybiske K. R. S. Stephens 2007 Mechanisms of Host Cell Exit by the Intracellular Bacterium Chlamydia Proceedings of the National Academy of Sciences 104 27 11430 11435 10.1073/pnas.0703218104 PMC2040915 17592133 Koppang E. O. A. Kvellestad U. Fischer 2015 Fish Mucosal Immunity: Gill Mucosal Health in Aquaculture Academic Press 10.1016/B978-0-12-417186-2.00005-4 Lambden P. R. M. A. Pickett I. N. Clarke 2006 The Effect of Penicillin on  Chlamydia trachomatis Microbiology 152 9 2573 2578 16946252 10.1099/mic.0.29032-0 Lausen M. G. Christiansen T. B. G. Poulsen S. Birkelund 2019 Immunobiology of Monocytes and Macrophages During Chlamydia trachomatis Microbes and Infection 21 2 73 84 30528899 10.1016/j.micinf.2018.10.007 Mathias J. R. M. E. Dodd K. B. Walters S. K. Yoo E. A. Ranheim A. Huttenlocher 2009 Characterization of Zebrafish Larval Inflammatory Macrophages Developmental & Comparative Immunology 33 11 1212 1217 19619578 10.1016/j.dci.2009.07.003 PMC2742687 Molnar K. G. Boros 1981 A Light and Electron Microscopic Study of the Agent of Carp Mucophilosis Journal of Fish Diseases 4 4 325 334 Moulder J. W. 2019 Characteristics of Chlamydiae Microbiology of Chlamydia J. W. Moulder 3 19 CRC Press Müller E. P. F. Christopoulos S. Halder 2017 Toll‐Like Receptor Ligands and Interferon‐γ Synergize for Induction of Antitumor M1 Macrophages Frontiers in Immunology 8 1383 10.3389/fimmu.2017.01383 29123526 PMC5662546 Neutra M. C. P. Leblond 1966 Synthesis of the Carbohydrate of Mucus in the Golgi Complex as Shown by Electron Microscope Radioautography of Goblet Cells From Rats Injected With Glucose‐H3 Journal of Cell Biology 30 1 119 136 5966171 10.1083/jcb.30.1.119 PMC2106987 Paperna I. A. P. Alves Dematos 1984 The Developmental Cycle of Epitheliocystis in Carp, Cyprinus carpio Journal of Fish Diseases 7 2 137 147 Pawlikowska‐Warych M. W. Deptuła 2016 Characteristics of Chlamydia‐Like Organisms Pathogenic to Fish Journal of Applied Genetics 57 135 141 26160214 10.1007/s13353-015-0303-8 PMC4731428 Pillonel T. C. Bertelli G. Greub 2018 Environmental Metagenomic Assemblies Reveal Seven New Highly Divergent Chlamydial Lineages and Hallmarks of a Conserved Intracellular Lifestyle Frontiers in Microbiology 9 314120 10.3389/fmicb.2018.00079 PMC5826181 29515524 Piper R. C. J. P. Luzio 2001 Late Endosomes: Sorting and Partitioning in Multivesicular Bodies Traffic 2 9 612 621 11555415 10.1034/j.1600-0854.2001.20904.x Porta C. E. Riboldi A. Ippolito A. Sica 2015 Molecular and Epigenetic Basis of Macrophage Polarized Activation Seminars in Immunology 27 237 248 Elsevier 26561250 10.1016/j.smim.2015.10.003 Premachandra N. M. J. A. A. S. Jayaweera 2022   Chlamydia pneumoniae Infectious Agents and Cancer 17 1 11 35317845 10.1186/s13027-022-00425-3 PMC8941765 Robertson D. K. L. Gu R. K. Rowe W. L. Beatty 2009 Inclusion Biogenesis and Reactivation of Persistent  Chlamydia trachomatis PLoS Pathogens 5 11 e1000664 19936056 10.1371/journal.ppat.1000664 PMC2774160 Rougerie P. V. Miskolci D. Cox 2013 Generation of Membrane Structures During Phagocytosis and Chemotaxis of Macrophages: Role and Regulation of the Actin Cytoskeleton Immunological Reviews 256 1 222 239 24117824 10.1111/imr.12118 PMC3806206 Seth‐Smith H. M. B. P. Katharios N. Dourala 2017  Ca Frontiers in Microbiology 8 MAR 1 9 10.3389/fmicb.2017.00508 28424665 PMC5371595 Steigen A. E. Karlsbakk H. Plarre 2015 A New Intracellular Bacterium, Candidatus  Labrus bergylta Archives of Microbiology 197 2 311 318 25416125 10.1007/s00203-014-1061-4 PMC4326665 Steigen A. A. Nylund E. Karlsbakk 2013 Cand. Actinochlamydia Clariae' gen. nov., sp. nov., a Unique Intracellular Bacterium Causing Epitheliocystis in Catfish ( Clarias gariepinus PLoS One 8 6 e66840 10.1371/journal.pone.0066840 23826156 PMC3691252 Stride M. C. A. Polkinghorne T. L. Miller J. M. Groff S. E. LaPatra B. F. Nowak 2013a Molecular Characterization of “ Candidatus  Seriola lalandi Candidatus Applied and Environmental Microbiology 79 5 1590 1597 10.1128/AEM.02899-12 23275507 PMC3591964 Stride M. C. A. Polkinghorne T. L. Miller B. F. Nowak 2013b Molecular Characterization of “ Candidatus Candidatus  Latris lineata Applied and Environmental Microbiology 79 16 4914 4920 23770893 10.1128/AEM.00746-13 PMC3754721 Stride M. C. A. Polkinghorne B. F. Nowak 2014 Chlamydial Infections of Fish: Diverse Pathogens and Emerging Causes of Disease in Aquaculture Species Veterinary Microbiology 171 1–2 258 266 10.1016/j.vetmic.2014.03.022 24932463 Stride M. C. A. Polkinghorne M. D. Powell B. F. Nowak 2013c “ Candidatus  Lates calcarifer PLoS One 8 12 e82889 10.1371/journal.pone.0082889 24349386 PMC3857808 Taylor‐Brown A. T. Pillonel A. Bridle 2017a Culture‐Independent Genomics of a Novel Chlamydial Pathogen of Fish Provides New Insight Into Host‐Specific Adaptations Utilized by These Intracellular Bacteria Environmental Microbiology 19 5 1899 1913 10.1111/1462-2920.13694 28205377 Taylor‐Brown A. T. Pillonel G. Greub L. Vaughan B. Nowak A. Polkinghorne 2018 Metagenomic Analysis of Fish‐Associated Ca Genome Biology and Evolution 10 10 2587 2595 30202970 10.1093/gbe/evy195 PMC6171736 Taylor‐Brown A. L. Spang N. Borel A. Polkinghorne 2017b Culture‐Independent Metagenomics Supports Discovery of Uncultivable Bacteria Within the Genus Chlamydia Scientific Reports 7 1 10661 28878306 10.1038/s41598-017-10757-5 PMC5587560 Verdugo P. 1990 Goblet Cells Secretion and Mucogenesis Annual Review of Physiology 52 1 157 176 10.1146/annurev.ph.52.030190.001105 2184755 Verdugo P. 1991 Mucin Exocytosis1–3 American Review of Respiratory Disease 144 S33 S37 1892323 10.1164/ajrccm/144.3_pt_2.S33 Volceanov L. K. Herbst M. Biniossek 2014 Septins Arrange F‐Actin‐Containing Fibers on the Chlamydia trachomatis MBio 5 5 10 1128 10.1128/mBio.01802-14 PMC4196233 25293760 Wilson J. M. P. Laurent 2002 Fish Gill Morphology: Inside Out Journal of Experimental Zoology 293 3 192 213 12115897 10.1002/jez.10124 Yang X. A. Siddique A. A. Khan 2021  Chlamydia trachomatis Journal of Cancer 12 16 4891 4900 10.7150/jca.58582 34234859 PMC8247366 Zigangirova N. A. Y. P. Rumyantseva E. Y. Morgunova 2013 Detection of C. trachomatis BioMed Research International 2013 489489 23509729 10.1155/2013/489489 PMC3586465 Zuck M. T. Ellis A. Venida K. Hybiske 2016 Extrusions Promote Engulfment and Chlamydia Survival Within Macrophages BioRxiv 19 e12683 10.1111/cmi.12683 27739160 Zuck M. A. Sherrid R. Suchland T. Ellis K. Hybiske 2016 Conservation of Extrusion as an Exit Mechanism for Chlamydia Pathogens and Disease 74 7 ftw093 10.1093/femspd/ftw093 27620201 PMC5985487 ",
  "metadata": {
    "Title of this paper": "Conservation of Extrusion as an Exit Mechanism for Chlamydia",
    "Journal it was published in:": "Journal of Fish Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489441/"
  }
}