{
  "title": "Paper_474",
  "abstract": "pmc Nat Commun Nat Commun 2873 ncomms Nature Communications 2041-1723 Nature Publishing Group PMC12484798 PMC12484798.1 12484798 12484798 41028714 10.1038/s41467-025-64402-1 64402 1 Article Regulation of NSL by TAF4A is critical for genome stability and quiescence of muscle stem cells http://orcid.org/0000-0002-3215-427X Georgieva Angelina M. 1 Sreenivasan Krishna 1 Ding Dong 1 Villeneuve Clementine 2 http://orcid.org/0000-0001-6383-6292 Wickström Sara A. 2 http://orcid.org/0000-0002-5594-4549 Günther Stefan 1 http://orcid.org/0000-0001-8013-5906 Kuenne Carsten 1 Gärtner Ulrich 3 Guo Xinyue 1 Zhou Yonggang 1 http://orcid.org/0000-0002-1080-8973 Yuan Xuejun xuejun.yuan@mpi-bn.mpg.de 1 http://orcid.org/0000-0002-6165-4804 Braun Thomas thomas.braun@mpi-bn.mpg.de 1 4 1 https://ror.org/0165r2y73 grid.418032.c 0000 0004 0491 220X Department of Cardiac Development and Remodeling, Max Planck Institute for Heart and Lung Research, 2 https://ror.org/040djv263 grid.461801.a 0000 0004 0491 9305 Department of Cell and Tissue Dynamics, Max Planck Institute for Molecular Biomedicine, 3 https://ror.org/033eqas34 grid.8664.c 0000 0001 2165 8627 Institute for Anatomy and Cell Biology, University of Giessen, 4 https://ror.org/00q4vv597 grid.24515.37 0000 0004 1937 1450 Division of Life Science, Center for Stem Cell Research, The Hong Kong University of Science and Technology, 30 9 2025 2025 16 478256 8726 8 10 2024 11 9 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Acetylation of lamin A/C by the non-specific lethal complex, containing MOF and KANSL2, is instrumental for maintaining nuclear architecture and genome stability, but the mechanisms controlling expression of its components in different cell types are poorly characterized. Here, we show that TAF4A, primarily known as a subunit of TFIID, forms a complex with the heterotrimeric transcription factor NF-Y and is critical for cell type-specific regulation of Kansl2 Taf4a Kansl2 Kansl2 Taf4a Nuclear architecture depends on proper regulation of lamin A/C modifications. Here, the authors show that TAF4A and NF-Y control Kansl2 expression in muscle stem cells, preserving genome stability and supporting muscle regeneration. Subject terms Muscle stem cells Chromatin structure Acetylation https://doi.org/10.13039/501100001659 Deutsche Forschungsgemeinschaft (German Research Foundation) CPI Excellence Cluster SFB 1231, TP A02 SFB 1213, TP B02 SFB 1531, TP B08 SFB TRR 267, TP A05 Braun Thomas https://doi.org/10.13039/501100003495 Hessisches Ministerium für Wissenschaft und Kunst (Hessen State Ministry of Higher Education, Research and the Arts) LOEWE iCANx Braun Thomas pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction The nuclear lamina, situated below the inner nuclear membrane, is a proteinaceous network of intermediate filaments that forms widespread contacts with chromatin and proteins of the inner nuclear membrane 1 2 3 4 Kmt5b 5 5 7 8 Nuclear lamin genes, including Lmna Lmnb1 Lmnb2 Lmna 9 10 Lmna 11 Lmna 12 Relatively little is known about the regulation of epigenetic modifiers and components of the machinery that connect chromatin to the nuclear lamina and enable heterochromatin formation in the nuclear periphery of MuSCs. Accelerated displacement of nucleosomes in MuSCs due to reduced transcription of Histone 2B 7 Kmt5b 13 14 LMNA 15 Expression of components of the apparatus controlling functions of the nuclear lamina and heterochromatin formation in distinct cell types may not only be controlled by transcription factors but also by co-factors, which interact with core promoter recognition factors, such as TFIID. TFIID is part of the RNA polymerase II preinitiation complex and is composed of TBP and several subunits called TATA-binding protein Associated Factors (TBP-associated factors, or TAFs) 16 17 18 Taf4a 19 Taf4a 20 Taf4a Here, we searched for factors controlling the expression of chromatin modifiers and components of the nuclear lamina, facilitating heterochromatin formation in MuSCs. We found that Taf4a Taf4a Kansl2 Taf4a Results Inactivation of Taf4a We previously discovered that loss of heterochromatin, induced by inactivation of Kmt5b 5 Kmt5b 7 21 22 Taf4a 1a Taf4a 23 Taf4a 1b zsgreen 1c To investigate the role of Taf4a Taf4a ERT flox/flox ERT flox/flox Taf4a sKO Taf4a sKO 2a Taf4a 2b, c Taf4a sKO 2d–f Taf4a sKO 1a 1b Taf4a sKO 1c MyoD Taf4a sKO 1d Taf4a sKO 1e Taf4a 1f Taf4a Taf4a sKO 3a Taf4a 24 1g Taf4a 3b Cdkna1(p21) Bcl2l1 Taf4a sKO 3c Taf4a Fig. 1 Taf4a sKO a Taf4a sKO n n Taf4a sKO t p n b Taf4a sKO t p n c Taf4a sKO n d MyoD Taf4a sKO n m36b4 t p n e n Taf4a n p f n Taf4a n t p g Taf4a sKO n a e f To determine whether the reduction of heterochromatin in Taf4a sKO Taf4a sKO Taf4a sKO 3d Taf4a sKO 3e 3f Taf4a sKO 3g, h Taf4a Deregulation of epigenetic modifiers in Taf4a sKO The substantial loss of heterochromatin in Taf4a sKO Taf4a sKO Taf4a sKO 2a Taf4a sKO 2a 2b Taf4a sKO 2a Mcrs1 Kansl2 2c Smyd5 Suv39h2 2c–e Taf4a sKO 2f, g Taf4a Fig. 2 Inactivation of Taf4a a Taf4a sKO b Taf4a sKO P c Taf4a sKO n d e Suv39h2 d Smyd5 e Taf4a sKO t d p e p n f Taf4a sKO t p n g Taf4a sKO t p n TAF4A forms a complex with NF-Y to regulate Kansl2 To distinguish between direct targets, whose expression depends on the binding of TAF4A to their regulatory regions, and genes with differential expression due to indirect effects, we performed CUT&RUN experiments. We identified 928 gene-annotated peaks in wild-type MuSCs (Fig. 3a 3b 25 3c 3d 26 27 Fig. 3 TAF4A interacts with NF-Y and binds to the promoter of Kansl2. a b c d e Taf4a Nf-Ya t p p n f n g h Taf4a sKO i Kansl2 NF-Y is a ubiquitously expressed heterotrimeric transcription factor (TF) complex, containing NF-YA, NF-YB, and NF-YC subunits. NF-YA has DNA binding and transactivation domains, whereas NF-YB and NF-YC carry histone-fold domains (Supplementary Fig. 4a Nf-ya Taf4a 3e 28 3f 4b Taf4a sKO 4c 4d, e 3g Taf4a sKO 3h Inactivation of Taf4a Taf4a sKO 4f Taf4a Kansl2 4g 4h Taf4a sKO Taf4a Kansl2 Mbd3 Prmt1 Taf4a Kansl2 Kansl2 11 Kansl2 Kansl2 Taf4a Kansl2 3i KANSL2 controls genes involved in chromatin organization of MuSCs KANSL2 is an integral subunit of the NSL chromatin-modifying complex containing the histone acetyltransferase MOF, which catalyzes acetylation of H4K16 for the regulation of transcriptional initiation. MOF also mediates acetylation of lamin A/C, required for stability and maintenance of the nuclear architecture 11 29 4a Taf4a sKO Taf4a Kansl2 Mcrs1 Ogt 4b Kansl2 Mcrs1 Taf4a sKO 4c, d 5a Kansl2 3i Mcrs1 5b 5b Mcrs1 Taf4a sKO Kansl2 Fig. 4 Taf4a Kansl2. a b Taf4a sKO n c d Kansl2 c Mcrs1 d Taf4a sKO t c p d p n e Taf4a sKO t p n f g h Taf4a sKO i Taf4a sKO n j Taf4a sKO Next, we wanted to explore whether the downregulation of Kansl2 Taf4a sKO Taf4a sKO 4e 4f 4g Taf4a sKO 4h Kansl2 Taf4a sKO 4i 5b 4j The TAF4A-NFY-NSL axis safeguards genomic stability of MuSCs In addition to its role as chromatin modifier for regulating transcription, the NSL complex controls stability of the nuclear architecture by acetylating lamin A/C (Fig. 4a 11 Taf4a sKO 5a + Taf4a sKO 5b, c Taf4a sKO 5d, e Kansl2 5c 11 Taf4a sKO 5f Nf-ya 5d Nf-ya Kansl2 Kansl2 5g Nf-ya 5e Nf-ya Mcrs1 Kansl2 5f Nf-ya Kansl2 Mcrs1 5d, g, h NSL Taf4a sKO 5h Kansl2 Taf4a sKO 5i, j Kansl2 Nf-ya 5k, l Kansl2 Fig. 5 Loss of Taf4a a Taf4a sKO p n b Taf4a sKO p n c Taf4a sKO n d Taf4a sKO p n e Taf4a sKO n f Taf4a sKO p n g Kansl2 Nf-ya m36b4 p p n h n n Taf4a n Kansl2 n Nfya n Mcrs1 n p p p i Kansl2 Taf4a sKO Kansl2 Taf4a sKO p p p n j Taf4a sKO Kansl2 Taf4a sKO f p p n k Kansl2 Nf-ya Nf-ya Kansl2 m36b4 p p n l Nf-ya Nf-ya Kansl2 p n a b d f k t g h l i j Inactivation of Taf4a We assumed that premature activation of MuSCs in Taf4a sKO Taf4a Taf4a sKO Taf4a 6a, b Taf4a sKO 6c Taf4a 6a, b Taf4a 6c 6d Taf4a Taf4a 6d Kansl2 6e Taf4a 6f 6g Fig. 6 Inactivation of Taf4a a Taf4a sKO t p n b t p n c Taf4a sKO t p n d n Taf4a sKO n 2 t p e Taf4a sKO t p n f Taf4a sKO n g Taf4a sKO Taf4a sKO t p n h i h i Taf4a sKO n a f g i Loss of heterochromatin resulting in loss of MuSCs quiescence normally reduces the muscle stem cell pool over time 5 Taf4a sKO Taf4a sKO + Taf4a 6d 6e 6f Taf4a sKO Taf4a sKO 6g Taf4a sKO 6g Taf4a sKO 6h Taf4a sKO 6h Taf4a Discussion The ability to maintain quiescence and genomic stability is an essential feature of healthy stem cells. Loss of quiescence but also reduced genomic stability depletes the MuSC pool and eventually incapacitates skeletal muscle regeneration. Loss of quiescence and genomic instability are both connected to reduced heterochromatin formation, which is also a hallmark of aging 8 7 30 31 Taf4a 7 Fig. 7 TAF4A protects genome stability of MuSCs by enabling NSL-dependent acetylation of lamin A/C. TAF4A drives expression of Kansl2 Kansl2 https://BioRender.com/frmva1q We found that multiple epigenetic modifiers are differentially expressed in Taf4a sKO Kansl2 32 Kansl2 Kansl2 Taf4a sKO Taf4a sKO Kansl2 Kansl2 Taf4a sKO 7 Smyd5 Suv39h2 Taf4a sKO Kansl2 Taf4a Taf4a Taf4a sKO Taf4a sKO 11 11 33 34 Taf4a sKO Taf4a sKO 35 We reason that loss of heterochromatin and increased genomic instability work together to drive MuSC out of quiescence after inactivation of Taf4a 36 37 38 Atf3 7 Taf4a sKO TAF4A is best known as a subunit of the basal transcription factor TFIID, composed of the TATA-binding protein (TBP) and 13–14 TBP-associated factors (TAFs), which recruit RNA Polymerase II (RNAPII) to the core promoters of genes 16 39 17 40 25 41 Taf4a The collaboration of TAF4A with NF-Y in MuSCs includes the regulation of Kansl2 Nf-ya Kansl2 Nf-ya 42 Taf4a 42 Taf4a Taf4a 19 43 Taf4a 44 Taf4a sKO The discovery that TAF4A serves a critical role for the proper function of the NSL complex also has important implications for a recently defined group of human pathologies named TAF4-related neuro-developmental disorders (T4NDD). Mutations in Taf4a 45 Kansl2 Methods Animals Taf4a Taf4a Pax7Cre Pax7-zsGreen 46 1 Muscle regeneration assay Mice were anaesthetized intraperitoneally with 10% ketamine (Bela-pharm) and 2% xylazine (WDT eG, Garbsen, Germany) diluted with 0.9% NaCl (100 μl /10 g body weight). To introduce a muscle injury, 50 μl of 0.06 mg/ml cardiotoxin from Naja mossambica mossambica (Sigma, Germany) in 0.9% NaCl was injected into the tibialis anterior of adult mice using an insulin syringe. The needle was inserted deep into the muscle longitudinally towards the knee from the ankle. The anterior tibial muscles were analyzed 14 days after injection. Isolation and cultivation of MuSC Satellite cell isolation and purification were performed according to established methods 47 g o o + + - - - + + Pax7-zsgreen 7 2 Myofiber Isolation and Culture Flexor digitorum brevis (FDB) muscles were dissected from adult mice and digested with 0.2% collagenase P (Roche) in high-glucose DMEM for 1 hour at 37 °C. Following digestion, individual myofibers were released by gentle trituration. Fibers were then transferred to 6-cm culture dishes containing high-glucose DMEM GlutaMAX™ (Gibco) supplemented with 10% horse serum (Gibco) and 1% chick embryo extract (MP Biomedicals Europe), and maintained under floating conditions at 37 °C and 5% CO₂ for 3 days. Gene expression and RT-qPCR Total RNA from FACS-isolated MuSCs was extracted using TRIzol reagent (Invitrogen) following instructions of the manufacturer. 1 μg purified RNA was reverse-transcribed with PrimeScript RT Reagent Kit (TaKaRa) following standard procedures. Real-time PCR was performed using Blue S´Green qPCR Kit (Biozym Blue). Relative quantitation of mRNA gene expression was performed using the ∆CT method. The Ct-values of target genes were normalized to the m36b4 reference target 1 Co-immunoprecipitation C2C12 cells (ATCC #CRL-1772) or primary MuSCs were washed twice with ice-cold PBS, scraped, and pelleted by centrifugation. Cell pellets were lysed in RIPA buffer (50 mM Tris-HCl, pH7.4; 150 mM NaCl; 1% NP-40; 0.1% sodium deoxycholate; complete protease inhibitor cocktail (Roche)) and briefly sonicated. Lysates were pre-cleared by incubation with Protein A/G agarose beads (Sigma Aldrich) for 1 hour at 4 °C with rotation. Pre-cleared lysates were centrifuged at 15,000 g for 10 minutes at 4 °C. The supernatant was collected and incubated with 6 µg anti-TAF4A antibody (Santa Cruz) overnight at 4 °C on a rotating wheel. The next day, 30 µL Dynabeads Protein G (Invitrogen) were added and incubated for 2 hours at 4 °C. Beads were washed three times with RIPA buffer, resuspended in SDS loading buffer, and analyzed by Western blotting. Lamin A/C Immunoprecipitation Cells were washed twice with ice-cold PBS, scraped and pelleted by centrifugation. The cell pellet was resuspended in hypotonic buffer (10 mM HEPES pH 7.9, 10 mM KCl, 1.5 mM MgCl₂, 0.5 mM DTT, and protease inhibitors) and incubated on ice for 5 minutes. Nuclei were isolated by centrifugation at 1,500 × g for 5 minutes at 4 °C. The nuclear pellet was then resuspended in lysis buffer containing 20 mM Tris-HCl (pH7.4), 200 mM NaCl, 2% Triton X-100, benzonase (25–50 U/mL, Sigma-Aldrich), complete protease inhibitor cocktail (Roche) and histone deacetylase inhibitors (1 µM TSA and 5 mM NAM). Samples were briefly sonicated (10 pulses, low intensity) and incubated on a rotating wheel at 4 °C for 2 hours. Lysates were clarified by centrifugation at 15,000 g for 10 minutes at 4 °C and the supernatant was collected. Three micrograms of anti-Lamin A/C antibody (Santa Cruz) was added and incubated overnight at 4 °C a rotating wheel. The next day, 20 µL of Dynabeads Protein G (Invitrogen), pre-washed and equilibrated in lysis buffer, was added for 2 hours at 4 °C. Beads were washed three times with the same lysis buffer (200 mM NaCl, 2% Triton X-100), using a magnetic stand to collect the beads between washes. The flow-through from the first IP was retained, and the immunoprecipitation procedure was repeated once more to improve yield. Beads were finally resuspended in SDS sample buffer for further immunoblot analysis. Western blot analysis Cell pellets from freshly isolated or cultured MuSCs were lysed in cell lysis buffer (20 mM Tris pH 7.5, 400 mM NaCl, 1 mM EDTA, 1 mM EGTA, 1% Triton X-100, 2.5 mM Sodium pyrophosphate, 1 mM β-glycerophosphate, 1 mM Na3VO4, 1 μg/ml Leupeptin). Extracts from MuSCs were resolved by SDS-PAGE, transferred onto nitrocellulose filters or PVDF membranes and probed with antibodies as indicated (Supplementary Table 2 Immunofluorescence and histological analysis Tibialis anterior muscles were dissected and placed with one end in 10% gum tragacanth (Sigma-Aldrich) on a flat piece of cork before freezing in isopentane/liquid nitrogen. Frozen muscle sections (8-10 μm) were fixed in cold acetone or 4% paraformaldehyde. Immunofluorescence and H&E staining were done following standard protocols. Masson’s Trichrome staining was carried out using the ACCUSTAIN® trichrome staining kit (Sigma-Aldrich). Primary antibodies for immunofluorescence staining are listed in (Supplementary Table 2 EdU labeling For in vitro labeling experiments, MuSCs or myofibers were treated with 10 μM 5-ethynyl-2′-deoxyuridine for the last 3 hrs of culture. Cells were fixed 4%PFA, permeabilized, and EdU incorporation was detected using the Click-iT EdU Alexa Fluor 594 Imaging Kit (Life Technologies) according to the manufacturer’s protocol. TUNEL assay Cells were fixed in 4% PFA for 10 min and then subjected to the TUNEL reaction using the TUNEL Assay Apoptosis Detection Kit ( C10246 Lentiviral transduction of MuSCs, mESCs and NIH3T3 FACS-sorted MuSCs were cultured in DMEM medium with 20% FCS and bFGF (5 ng/ml). Before seeding of MuSCs, plates or dishes were coated with matrigel at 37 °C for 1 hour and then air-dried. 1000 cells/well were seeded into a 384-well plate and 2×10 4 Taf4a Kansl2 Mcrs1 Nf-ya Kansl2 3 4 Taf4a 3 Electron microscopy (EM) and heterochromatin quantification Ultrastructure of MuSC in skeletal muscle was analyzed by EM as described before 47 Atomic force microscopy (AFM) AFM-based force indentation spectroscopy was performed on proliferative MuSCs cells, after FAC-sorting and culture for 4 days. AFM measurements were performed using the JPK NanoWizard 4XP (Bruker Nano) atomic force microscope mounted on a Zeiss Axio Observer optical inverted fluorescent microscope and operated via JPK SPM Control Software v.7. Triangular non-conductive Silicon Nitride cantilevers (MLCT, Bruker Daltonics) with a nominal spring constant of 0.07 Nm−1 were used for the nanoindentation experiments of the nucleus. For all indentation experiments, forces of up to 1 nN were applied, and the velocities of cantilever approach and retraction were kept constant at 10 μm s −1 RNA-Seq and data analysis Total RNA was isolated from FACS-sorted MuSCs by the miRNeasy micro kit (Qiagen) together with on-column DNase digestion (DNase-Free DNase Set, Qiagen) to avoid contamination by genomic DNA. RNA and library preparation integrity were verified with LabChip Gx Touch (Perkin Elmer). 10 ng of total RNA was used as input for SMARTer® Stranded Total RNA-Seq Kit v2 - Pico Input Mammalian. Library preparations followed the manufacturer’s protocol (Takara Bio). Sequencing was performed on a NextSeq500 instrument (Illumina) using a P3 flowcell with 75 bp single-end setup, resulting in an average of 30 M reads. Trimmomatic version 0.39 was employed to trim reads after a quality drop below a mean of Q15 in a window of 5 nucleotides and keeping only filtered reads longer than 15 nucleotides 48 49 50 The raw count matrix was normalized with DESeq2 version 1.14.1 51 p CUT&RUN (CnR) and data analysis CnR was performed as described previously 52 6 5 Taf4a sKO 2 DNA was quantified by Qubit and max. 10 ng DNA was used as input for SMARTer® ThruPLEX® DNA-seq Kit following the manufacturer’s protocol (Takara Bio). Sequencing was performed either on the NextSeq500 platform (Illumina) using a P3 flowcell with a 2x38bp single-end setup or on the NextSeq2000 platform (Illumina) using a P3 flowcell with a 2x61bp single-end setup or 2x36bp. The following steps are the same as described previously 13 53 GSE277867 GSE277868 GSE277869 GSE277870 50 51 ATAC-Seq For ATAC library preparation, 50.000 cells were employed, using the Tn5 Transposase from Nextera DNA Sample Preparation Kit (Illumina). Cell pellets were resuspended in 50 µl PBS and mixed with 25 µl TD-Buffer, 2.5 µl Tn5, 0.5 µl 10% NP-40 and 22 µl water. Cell/Tn5 mixture was incubated at 37 °C for 30 min with occasional snap mixing. Transposase treatment was followed by 30 min incubation at 50 °C together with 500 mM EDTA pH8.0 for optimal recovery of digested DNA fragments. 100 µl of 50 mM MgCl2 was added for neutralization of EDTA, followed by purification of DNA fragments by the MinElute PCR Purification Kit (Qiagen). Amplification of the library together with indexing was performed as described elsewhere 54 48 49 http://broadinstitute.github.io/picard 53 50 Statistical analysis For all quantitative analyses, a minimum of three biological replicates were analyzed. Statistical tests were used based on the assumption that sample data are derived from a population following a probability distribution based on a fixed set of parameters. T-tests were used to determine the statistical significance of differences between two groups. One-way ANOVA was used to perform multiple comparisons. The following values were considered to be statistically significant: * P P P P P Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Reporting Summary Transparent Peer Review file Source data  Source data Publisher’s note Supplementary information The online version contains supplementary material available at 10.1038/s41467-025-64402-1. Acknowledgements The authors are sincerely grateful to Prof. Irwin Davidson (Institute for Genetics, Molecular and Cellular Biology, Strasbourg) for providing Taf4a floxed mice. We thank Kikhi Khrievono, Ann Atzberger, and Martin Stehling for support with FACS sorting. We would also like to thank Birgit Spitznagel and Barbara Zimmermann for technical help. This work was supported by the Excellence Cluster Cardio Pulmonary System (CPI), the Deutsche Forschungsgemeinschaft (DFG) Collaborative Research Centre 1213 (TP A02 and B02) and 1531 (TP B08), the DFG Transregional Collaborative Research Center 267 (TP A05), the LOEWE project iCANx. Author contributions A.M.G., X.Y., and T.B. conceived and designed this project. AMG performed most of the experiments, analyzed the data, and prepared figures. K.S. performed knockdown experiments. D.D. helped with CUT&RUN experiments. C.V. and S.A.W. performed atomic force microscopy (AFM) and analyzed the data. S.G. and C.K. analyzed RNA-seq and CUT&RUN data. U.G. performed electron microscopy imaging. X.G. performed co-IP experiments. Y.Z. contributed to data analysis, discussion and advice. A.M.G., X.Y., and T.B. wrote the manuscript. Peer review Peer review information Nature Communications Funding Open Access funding enabled and organized by Projekt DEAL. Data availability Raw and processed CUT&RUN data for TAF4A, NF-YA and KANSL2 in wild type MuSCs, ATAC-seq data, NF-YA CUT&RUN data in control and Taf4a sKO Taf4a sKO GSE277872 GSE103163 GSM2756400 GSM2756401 GSE108040 GSE199487 GSE168984 GSE154017 Source data Competing interests The authors declare no competing interests. References 1. Dobrzynska A Gonzalo S Shanahan C Askjaer P The nuclear lamina in health and disease Nucleus 2016 7 233 248 10.1080/19491034.2016.1183848 27158763 PMC4991244 Dobrzynska, A., Gonzalo, S., Shanahan, C. & Askjaer, P. The nuclear lamina in health and disease. Nucleus 7 27158763 10.1080/19491034.2016.1183848 PMC4991244 2. Bank EM Gruenbaum Y The nuclear lamina and heterochromatin: a complex relationship Biochem Soc. Trans. 2011 39 1705 1709 10.1042/BST20110603 22103511 Bank, E. M. & Gruenbaum, Y. The nuclear lamina and heterochromatin: a complex relationship. Biochem Soc. Trans. 39 22103511 10.1042/BST20110603 3. Miroshnikova, Y. A. & Wickstrom, S. A. Mechanical forces in nuclear organization. Cold Spring Harb Perspect Biol. 14 10.1101/cshperspect.a039685 PMC8725626 34187806 4. Relaix F Perspectives on skeletal muscle stem cells Nat. Commun. 2021 12 692 10.1038/s41467-020-20760-6 33514709 PMC7846784 Relaix, F. et al. Perspectives on skeletal muscle stem cells. Nat. Commun. 12 33514709 10.1038/s41467-020-20760-6 PMC7846784 5. Boonsanay V Regulation of skeletal muscle stem cell quiescence by Suv4-20h1-dependent facultative heterochromatin formation Cell Stem Cell 2016 18 229 242 10.1016/j.stem.2015.11.002 26669898 Boonsanay, V. et al. Regulation of skeletal muscle stem cell quiescence by Suv4-20h1-dependent facultative heterochromatin formation. Cell Stem Cell 18 26669898 10.1016/j.stem.2015.11.002 6. Cheung TH Rando TA Molecular regulation of stem cell quiescence Nat. Rev. Mol. Cell Biol. 2013 14 329 340 10.1038/nrm3591 23698583 PMC3808888 Cheung, T. H. & Rando, T. A. Molecular regulation of stem cell quiescence. Nat. Rev. Mol. Cell Biol. 14 23698583 10.1038/nrm3591 PMC3808888 7. Zhang, S. Y. et al. ATF3 induction prevents precocious activation of skeletal muscle stem cell by regulating H2B expression (vol 14, 4978, 2023). Nat. Commun. 14 10.1038/s41467-023-40465-w PMC10435463 37591871 8. Pal S Tyler JK Epigenetics and aging Sci. Adv. 2016 2 e1600584 10.1126/sciadv.1600584 27482540 PMC4966880 Pal, S. & Tyler, J. K. Epigenetics and aging. Sci. Adv. 2 27482540 10.1126/sciadv.1600584 PMC4966880 9. Liu B Genomic instability in laminopathy-based premature aging Nat. Med 2005 11 780 785 10.1038/nm1266 15980864 Liu, B. et al. Genomic instability in laminopathy-based premature aging. Nat. Med 11 15980864 10.1038/nm1266 10. Worman HJ Bonne G Laminopathies”: a wide spectrum of human diseases Exp. Cell Res. 2007 313 2121 2133 10.1016/j.yexcr.2007.03.028 17467691 PMC2964355 Worman, H. J. & Bonne, G. Laminopathies”: a wide spectrum of human diseases. Exp. Cell Res. 313 17467691 10.1016/j.yexcr.2007.03.028 PMC2964355 11. Karoutas A The NSL complex maintains nuclear architecture stability via lamin A/C acetylation Nat. Cell Biol. 2019 21 1248 10.1038/s41556-019-0397-z 31576060 Karoutas, A. et al. The NSL complex maintains nuclear architecture stability via lamin A/C acetylation. Nat. Cell Biol. 21 31576060 10.1038/s41556-019-0397-z 12. Earle AJ Mutant lamins cause nuclear envelope rupture and DNA damage in skeletal muscle cells Nat. Mater. 2020 19 464 473 10.1038/s41563-019-0563-5 31844279 PMC7102937 Earle, A. J. et al. Mutant lamins cause nuclear envelope rupture and DNA damage in skeletal muscle cells. Nat. Mater. 19 31844279 10.1038/s41563-019-0563-5 PMC7102937 13. Zhang, T. et al. Replication collisions induced by de-repressed S-phase transcription are connected with malignant transformation of adult stem cells. Nat. Commun. 13 10.1038/s41467-022-34577-y PMC9663592 36376321 14. Behrens A van Deursen JM Rudolph KL Schumacher B Impact of genomic damage and ageing on stem cell function Nat. Cell Biol. 2014 16 201 207 10.1038/ncb2928 24576896 PMC4214082 Behrens, A., van Deursen, J. M., Rudolph, K. L. & Schumacher, B. Impact of genomic damage and ageing on stem cell function. Nat. Cell Biol. 16 24576896 10.1038/ncb2928 PMC4214082 15. Gonzalo S Kreienkamp R Askjaer P Hutchinson-Gilford Progeria Syndrome: a premature aging disease caused by LMNA gene mutations Ageing Res Rev. 2017 33 18 29 10.1016/j.arr.2016.06.007 27374873 PMC5195863 Gonzalo, S., Kreienkamp, R. & Askjaer, P. Hutchinson-Gilford Progeria Syndrome: a premature aging disease caused by LMNA gene mutations. Ageing Res Rev. 33 27374873 10.1016/j.arr.2016.06.007 PMC5195863 16. Malik S Roeder RG Regulation of the RNA polymerase II pre-initiation complex by its associated coactivators Nat. Rev. Genet. 2023 24 767 782 10.1038/s41576-023-00630-9 37532915 PMC11088444 Malik, S. & Roeder, R. G. Regulation of the RNA polymerase II pre-initiation complex by its associated coactivators. Nat. Rev. Genet. 24 37532915 10.1038/s41576-023-00630-9 PMC11088444 17. Goodrich JA Tjian R Unexpected roles for core promoter recognition factors in cell-type-specific transcription and gene regulation Nat. Rev. Genet. 2010 11 549 558 10.1038/nrg2847 20628347 PMC2965628 Goodrich, J. A. & Tjian, R. Unexpected roles for core promoter recognition factors in cell-type-specific transcription and gene regulation. Nat. Rev. Genet. 11 20628347 10.1038/nrg2847 PMC2965628 18. Xu YL A TFIID-SAGA perturbation that targets MYB and suppresses acute myeloid leukemia Cancer Cell 2018 33 13 10.1016/j.ccell.2017.12.002 29316427 PMC5764110 Xu, Y. L. et al. A TFIID-SAGA perturbation that targets MYB and suppresses acute myeloid leukemia. Cancer Cell 33 29316427 10.1016/j.ccell.2017.12.002 PMC5764110 19. Langer D Essential role of the TFIID subunit TAF4 in murine embryogenesis and embryonic stem cell differentiation Nat. Commun. 2016 7 11063 10.1038/ncomms11063 27026076 PMC4820908 Langer, D. et al. Essential role of the TFIID subunit TAF4 in murine embryogenesis and embryonic stem cell differentiation. Nat. Commun. 7 27026076 10.1038/ncomms11063 PMC4820908 20. Brunkhorst A A specific role for the TFIID subunit TAF4 and RanBPM in neural progenitor differentiation Mol. Cell Neurosci. 2005 29 250 258 10.1016/j.mcn.2005.02.015 15911349 Brunkhorst, A. et al. A specific role for the TFIID subunit TAF4 and RanBPM in neural progenitor differentiation. Mol. Cell Neurosci. 29 15911349 10.1016/j.mcn.2005.02.015 21. Lizio M Gateways to the FANTOM5 promoter level mammalian expression atlas Genome Biol. 2015 16 22 10.1186/s13059-014-0560-6 25723102 PMC4310165 Lizio, M. et al. Gateways to the FANTOM5 promoter level mammalian expression atlas. Genome Biol. 16 25723102 10.1186/s13059-014-0560-6 PMC4310165 22. Lizio M Update of the FANTOM web resource: expansion to provide additional transcriptome atlases Nucleic Acids Res. 2019 47 D752 D758 10.1093/nar/gky1099 30407557 PMC6323950 Lizio, M. et al. Update of the FANTOM web resource: expansion to provide additional transcriptome atlases. Nucleic Acids Res. 47 30407557 10.1093/nar/gky1099 PMC6323950 23. Georgieva AM Inactivation of Sirt6 ameliorates muscular dystrophy in mdx mice by releasing suppression of utrophin expression Nat. Commun. 2022 13 4184 10.1038/s41467-022-31798-z 35859073 PMC9300598 Georgieva, A. M. et al. Inactivation of Sirt6 ameliorates muscular dystrophy in mdx mice by releasing suppression of utrophin expression. Nat. Commun. 13 35859073 10.1038/s41467-022-31798-z PMC9300598 24. Pietrosemoli N Comparison of multiple transcriptomes exposes unified and divergent features of quiescent and activated skeletal muscle stem cells Skelet. Muscle 2017 7 28 10.1186/s13395-017-0144-8 29273087 PMC5741941 Pietrosemoli, N. et al. Comparison of multiple transcriptomes exposes unified and divergent features of quiescent and activated skeletal muscle stem cells. Skelet. Muscle 7 29273087 10.1186/s13395-017-0144-8 PMC5741941 25. Wright KJ Ii MTM Tjian R TAF4 nucleates a core subcomplex of TFIID and mediates activated transcription from a TATA-less promoter Proc. Natl Acad. Sci. USA 2006 103 12347 12352 10.1073/pnas.0605499103 16895980 PMC1567882 Wright, K. J., Ii, M. T. M. & Tjian, R. TAF4 nucleates a core subcomplex of TFIID and mediates activated transcription from a TATA-less promoter. Proc. Natl Acad. Sci. USA 103 16895980 10.1073/pnas.0605499103 PMC1567882 26. Hibino E Interaction between intrinsically disordered regions in transcription factors Sp1 and TAF4 Protein Sci. 2016 25 2006 2017 10.1002/pro.3013 27515574 PMC5079245 Hibino, E. et al. Interaction between intrinsically disordered regions in transcription factors Sp1 and TAF4. Protein Sci. 25 27515574 10.1002/pro.3013 PMC5079245 27. Suske G NF-Y and SP transcription factors - New insights in a long-standing liaison Biochim. Biophys. Acta Gene Regul. Mech. 2017 1860 590 597 10.1016/j.bbagrm.2016.08.011 27697431 Suske, G. NF-Y and SP transcription factors - New insights in a long-standing liaison. Biochim. Biophys. Acta Gene Regul. Mech. 1860 27697431 10.1016/j.bbagrm.2016.08.011 28. Gurtner A Requirement for down-regulation of the CCAAT-binding activity of the NF-Y transcription factor during skeletal muscle differentiation Mol. Biol. Cell 2003 14 2706 2715 10.1091/mbc.e02-09-0600 12857858 PMC165670 Gurtner, A. et al. Requirement for down-regulation of the CCAAT-binding activity of the NF-Y transcription factor during skeletal muscle differentiation. Mol. Biol. Cell 14 12857858 10.1091/mbc.E02-09-0600 PMC165670 29. Sheikh, B. N., Guhathakurta, S. & Akhtar, A. The non-specific lethal (NSL) complex at the crossroads of transcriptional control and cellular homeostasis. Embo Rep. 20 10.15252/embr.201847630 PMC6607013 31267707 30. Tsurumi A Li WX Global heterochromatin loss: a unifying theory of aging? Epigenetics 2012 7 680 688 10.4161/epi.20540 22647267 PMC3414389 Tsurumi, A. & Li, W. X. Global heterochromatin loss: a unifying theory of aging?. Epigenetics 7 22647267 10.4161/epi.20540 PMC3414389 31. Nava MM Heterochromatin-driven nuclear softening protects the genome against mechanical stress-induced damage Cell 2020 181 800 817.e22 10.1016/j.cell.2020.03.052 32302590 PMC7237863 Nava, M. M. et al. Heterochromatin-driven nuclear softening protects the genome against mechanical stress-induced damage. Cell 181 32302590 10.1016/j.cell.2020.03.052 PMC7237863 32. Dias J Structural analysis of the KANSL1/WDR5/KANSL2 complex reveals that WDR5 is required for efficient assembly and chromatin targeting of the NSL complex Genes Dev. 2014 28 929 942 10.1101/gad.240200.114 24788516 PMC4018492 Dias, J. et al. Structural analysis of the KANSL1/WDR5/KANSL2 complex reveals that WDR5 is required for efficient assembly and chromatin targeting of the NSL complex. Genes Dev. 28 24788516 10.1101/gad.240200.114 PMC4018492 33. Zhang CZ Chromothripsis from DNA damage in micronuclei Nature 2015 522 179 10.1038/nature14493 26017310 PMC4742237 Zhang, C. Z. et al. Chromothripsis from DNA damage in micronuclei. Nature 522 26017310 10.1038/nature14493 PMC4742237 34. Utani, K., Kohno, Y., Okamoto, A. & Shimizu, N. Emergence of micronuclei and their effects on the fate of cells under replication stress. PLoS ONE 5 10.1371/journal.pone.0010089 PMC2851613 20386692 35. Briand N Collas P Laminopathy-causing lamin A mutations reconfigure lamina-associated domains and local spatial chromatin conformation Nucleus 2018 9 216 226 10.1080/19491034.2018.1449498 29517398 PMC5973257 Briand, N. & Collas, P. Laminopathy-causing lamin A mutations reconfigure lamina-associated domains and local spatial chromatin conformation. Nucleus 9 29517398 10.1080/19491034.2018.1449498 PMC5973257 36. Inomata K Genotoxic stress abrogates renewal of melanocyte stem cells by triggering their differentiation Cell 2009 137 1088 1099 10.1016/j.cell.2009.03.037 19524511 Inomata, K. et al. Genotoxic stress abrogates renewal of melanocyte stem cells by triggering their differentiation. Cell 137 19524511 10.1016/j.cell.2009.03.037 37. Mohrin M Hematopoietic stem cell quiescence promotes error-prone DNA repair and mutagenesis Cell Stem Cell 2010 7 174 185 10.1016/j.stem.2010.06.014 20619762 PMC2924905 Mohrin, M. et al. Hematopoietic stem cell quiescence promotes error-prone DNA repair and mutagenesis. Cell Stem Cell 7 20619762 10.1016/j.stem.2010.06.014 PMC2924905 38. Salvi JS ATR activity controls stem cell quiescence via the cyclin F-SCF complex Proc. Natl Acad. Sci. USA 2022 119 e2115638119 10.1073/pnas.2115638119 35476521 PMC9170012 Salvi, J. S. et al. ATR activity controls stem cell quiescence via the cyclin F-SCF complex. Proc. Natl Acad. Sci. USA 119 35476521 10.1073/pnas.2115638119 PMC9170012 39. Wu SY Chiang CM TATA-binding protein-associated factors enhance the recruitment of RNA polymerase II by transcriptional activators J. Biol. Chem. 2001 276 34235 34243 10.1074/jbc.M102463200 11457828 Wu, S. Y. & Chiang, C. M. TATA-binding protein-associated factors enhance the recruitment of RNA polymerase II by transcriptional activators. J. Biol. Chem. 276 11457828 10.1074/jbc.M102463200 40. Hasegawa Y Struhl K Promoter-specific dynamics of TATA-binding protein association with the human genome Genome Res. 2019 29 1939 1950 10.1101/gr.254466.119 31732535 PMC6886507 Hasegawa, Y. & Struhl, K. Promoter-specific dynamics of TATA-binding protein association with the human genome. Genome Res. 29 31732535 10.1101/gr.254466.119 PMC6886507 41. Patel, A. B. et al. Structure of human TFIID and mechanism of TBP loading onto promoter DNA. Science 362 10.1126/science.aau8872 PMC6446905 30442764 42. Rigillo G The transcription factor NF-Y participates to stem cell fate decision and regeneration in adult skeletal muscle Nat. Commun. 2021 12 6013 10.1038/s41467-021-26293-w 34650038 PMC8516959 Rigillo, G. et al. The transcription factor NF-Y participates to stem cell fate decision and regeneration in adult skeletal muscle. Nat. Commun. 12 34650038 10.1038/s41467-021-26293-w PMC8516959 43. Bahat A TAF4b and TAF4 differentially regulate mouse embryonic stem cells maintenance and proliferation Genes Cells 2013 18 225 237 10.1111/gtc.12030 23350932 Bahat, A. et al. TAF4b and TAF4 differentially regulate mouse embryonic stem cells maintenance and proliferation. Genes Cells 18 23350932 10.1111/gtc.12030 44. Saisa-Borreill S General transcription factor TAF4 antagonizes epigenetic silencing by Polycomb to maintain intestine stem cell functions Cell Death Differ. 2023 30 839 853 10.1038/s41418-022-01109-6 36639541 PMC9984434 Saisa-Borreill, S. et al. General transcription factor TAF4 antagonizes epigenetic silencing by Polycomb to maintain intestine stem cell functions. Cell Death Differ. 30 36639541 10.1038/s41418-022-01109-6 PMC9984434 45. Janssen BDE De novo putative loss-of-function variants in TAF4 are associated with a neuro-developmental disorder Hum. Mutat. 2022 43 1844 1851 10.1002/humu.24444 35904126 PMC10087332 Janssen, B. D. E. et al. De novo putative loss-of-function variants in TAF4 are associated with a neuro-developmental disorder. Hum. Mutat. 43 35904126 10.1002/humu.24444 PMC10087332 46. Keller C Alveolar rhabdomyosarcomas in conditional Pax3:Fkhr mice: cooperativity of Ink4a/ARF and Trp53 loss of function Genes Dev. 2004 18 2614 2626 10.1101/gad.1244004 15489287 PMC525542 Keller, C. et al. Alveolar rhabdomyosarcomas in conditional Pax3:Fkhr mice: cooperativity of Ink4a/ARF and Trp53 loss of function. Genes Dev. 18 15489287 10.1101/gad.1244004 PMC525542 47. Gunther S Myf5-positive satellite cells contribute to Pax7-dependent long-term maintenance of adult muscle stem cells Cell Stem Cell 2013 13 590 601 10.1016/j.stem.2013.07.016 23933088 PMC4082715 Gunther, S. et al. Myf5-positive satellite cells contribute to Pax7-dependent long-term maintenance of adult muscle stem cells. Cell Stem Cell 13 23933088 10.1016/j.stem.2013.07.016 PMC4082715 48. Bolger AM Lohse M Usadel B Trimmomatic: a flexible trimmer for Illumina sequence data Bioinformatics 2014 30 2114 2120 10.1093/bioinformatics/btu170 24695404 PMC4103590 Bolger, A. M., Lohse, M. & Usadel, B. Trimmomatic: a flexible trimmer for Illumina sequence data. Bioinformatics 30 24695404 10.1093/bioinformatics/btu170 PMC4103590 49. Dobin A STAR: ultrafast universal RNA-seq aligner Bioinformatics 2013 29 15 21 10.1093/bioinformatics/bts635 23104886 PMC3530905 Dobin, A. et al. STAR: ultrafast universal RNA-seq aligner. Bioinformatics 29 23104886 10.1093/bioinformatics/bts635 PMC3530905 50. Liao Y Smyth GK Shi W featureCounts: an efficient general purpose program for assigning sequence reads to genomic features Bioinformatics 2014 30 923 930 10.1093/bioinformatics/btt656 24227677 Liao, Y., Smyth, G. K. & Shi, W. featureCounts: an efficient general purpose program for assigning sequence reads to genomic features. Bioinformatics 30 24227677 10.1093/bioinformatics/btt656 51. Love MI Huber W Anders S Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2 Genome Biol. 2014 15 550 10.1186/s13059-014-0550-8 25516281 PMC4302049 Love, M. I., Huber, W. & Anders, S. Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2. Genome Biol. 15 25516281 10.1186/s13059-014-0550-8 PMC4302049 52. Meers, M. P., Bryson, T. D., Henikoff, J. G. & Henikoff, S. Improved CUT&RUN chromatin profiling tools. Elife 8 10.7554/eLife.46314 PMC6598765 31232687 53. Zhang Y Model-based analysis of ChIP-Seq (MACS) Genome Biol. 2008 9 R137 10.1186/gb-2008-9-9-r137 18798982 PMC2592715 Zhang, Y. et al. Model-based analysis of ChIP-Seq (MACS). Genome Biol. 9 18798982 10.1186/gb-2008-9-9-r137 PMC2592715 54. Buenrostro, J. D., Giresi, P. G., Zaba, L. C., Chang, H. Y. & Greenleaf, W. J. Transposition of native chromatin for fast and sensitive epigenomic profiling of open chromatin, DNA-binding proteins and nucleosome position. Nat Methods 10 10.1038/nmeth.2688 PMC3959825 24097267 ",
  "metadata": {
    "Title of this paper": "Model-based analysis of ChIP-Seq (MACS)",
    "Journal it was published in:": "Nature Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484798/"
  }
}