{
  "title": "Paper_1198",
  "abstract": "pmc Nutrients Nutrients 1692 nutrients nutrients Nutrients 2072-6643 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472673 PMC12472673.1 12472673 12472673 41010513 10.3390/nu17182988 nutrients-17-02988 1 Article Curcumin Combined with Tryptophan Ameliorates DSS-Induced Ulcerative Colitis via Reducing Inflammation and Oxidative Stress and Regulation of Gut Microbiota Jiang Hedong Conceptualization Writing – original draft 1 2 Li Gonglong Resources Data curation 1 Xie Liuming Writing – review & editing 2 3 https://orcid.org/0000-0002-4733-277X Zhang Nanhai Writing – review & editing 2 3 Huang Yi Writing – review & editing 2 Liang Xinli Investigation Visualization 1 Guo Fanghua Software Resources 2 3 Jiang Qieying Software Supervision 4 Liao Zhenggen Project administration Funding acquisition 1 * Bellenger Jerome Academic Editor 1 20201042@jxutcm.edu.cn ligonglong@jxutcm.edu.cn 20131055@jxutcm.edu.cn 2 xieliuming@jxutcm.edu.cn znh597851323@163.com 20194031@jxutcm.edu.cn guofanghua@jxutcm.edu.cn 3 4 20050857@jxutcm.edu.cn * hdjiang100@163.com 18 9 2025 9 2025 17 18 497660 2988 23 8 2025 14 9 2025 16 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background Methods Results Conclusions Cur–Trp combination therapy DSS-induced colitis model intestinal oxidative balance restoration gut microbiota short-chain fatty acid National Natural Science Foundation of China funded project 81660757 Jiangxi University of Traditional Chinese Medicine—Chinese Medicine Preparation Technology and Equipment-School Innovation Team CXTD22006 Jiangxi University of Traditional Chinese Medicine—Key Laboratory of Jiangxi Province for Improvement and Innovation of Traditional Chinese Medicine 2024SSY07131 Scientific research project of Jiangxi Provincial Drug Administration 2152301216/2003 This project was financially supported by National Natural Science Foundation of China funded project (81660757); Jiangxi University of Traditional Chinese Medicine—Chinese Medicine Preparation Technology and Equipment-School Innovation Team (CXTD22006); Jiangxi University of Traditional Chinese Medicine—Key Laboratory of Jiangxi Province for Improvement and Innovation of Traditional Chinese Medicine (2024SSY07131); Scientific research project of Jiangxi Provincial Drug Administration (2152301216/2003). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The multifactorial pathogenesis of ulcerative colitis (UC), including genetic susceptibility, epithelial barrier defects, immune response dysregulation and intestinal microbiota dysregulation, generates complex interactions that lead to the long-term persistence of chronic inflammation [ 1 2 3 4 5 6 7 8 9 10 11 12 13 Given this complexity, combination therapy has become a reasonable strategy for addressing multiple pathological axes. For example, the SONIC trial demonstrated that compared to 44.4% in the monotherapy group, infliximab combined with azathioprine significantly improved the steroid-free clinical remission rate at week 30 to 56.8%, while also reducing the formation of anti-drug antibodies by 60% [ 14 15 16 17 Curcumin, the main bioactive component of turmeric, is widely consumed in traditional Asian diets and is widely recognized for its powerful anti-inflammatory and antioxidant properties. Extensive in vitro and in vivo studies have shown that curcumin alleviates intestinal inflammation primarily by inhibiting the NF-kB signaling pathway, resulting in reduced expression of pro-inflammatory cytokines such as TNF-α, IL-1β, and IL-6 [ 18 19 20 21 22 Bifidobacterium Lactobacillus 23 24 This study explores the novel value of “food component combination therapy” for UC using curcumin combined with tryptophan, based on the core advantages of high safety and easy access of food-derived ingredients, which distinguish them from traditional single-dose or non-food-derived therapies. We will systematically evaluate the therapeutic effect of this combination on DSS-induced UC in mice, focusing on the improvement of clinical symptoms, repair of histopathological damage, restoration of intestinal barrier function, and maintenance of gut microbiota homeostasis. This work aims to provide an alternative, safe, and sustainable food source strategy for UC therapy and to lay the scientific foundation. 2. Materials and Methods 2.1. Materials and Reagents Curcumin was provided by Yuanye Bio-Technology Co., Ltd. (Shanghai, China). L-Tryptophan and short-chain fatty acids (SCFAs), including acetate, propionate, butyrate, isobutyrate, valerate, and isovalerate, were obtained from Aladdin Biochemical Technology Co., Ltd. (Shanghai, China). Dextran sulfate sodium (DSS, 36~50 kDa) was acquired from Sigma-Aldrich (St. Louis, MO, USA). Assay kits for superoxide dismutase (SOD), myeloperoxidase (MPO), and malondialdehyde (MDA) were supplied by Nanjing Jiancheng Bioengineering Company (Nanjing, China). Enzyme-linked immunosorbent assay (ELISA) kits for IL-1β, TNF-α, IL-4, IL-6, and IL-10 were from Multisciences (Wuhan, China). Antibodies for MUC-2, ZO-1, and occludin were from Sevier Biotechnology Co., Ltd. (Wuhan, China). 2.2. Animal Experimental Seventy-two male Balb/c mice (7 weeks old, 22–24 g) were obtained from Jiangsu GemPharmatech Co., Ltd. (Nanjing, China, SCXK 2023-0009). Following a 7-day acclimatization period in a controlled environment (23 ± 2 °C, 12 h light/dark cycle) with ad libitum access to food and water, the mice were randomly allocated into six groups (n = 12) using the RANDBETWEEN function in Excel, including the control group (NC), model group (Model), curcumin group (Cur), tryptophan group (Trp), and Curcumin combined with tryptophan group (Cur–Trp). From day 8, all groups except the NC group received 2.5% dextran sulfate sodium (DSS) in their drinking water to induce colitis. Treatments were administered daily via gavage at a volume of 0.2 mL/10 g body weight. The whole experimental design is illustrated in Figure 1 2.3. Disease Activity Index (DAI) Assessment The Disease Activity Index (DAI) was assessed daily starting from day 8, adapted from the method of Li et al. [ 25 Table 1 2.4. Intestinal Permeability Analysis Intestinal permeability was assessed using an in vivo FITC-dextran (4 kDa) following the protocol of Han et al. [ 26 v v 2.5. Histological and Immunofluorescence Analyses The histological analysis was determined according to the method of Xu et al. [ 27 Table 2 2.6. Oxidative Stress and Inflammatory Cytokine Colon tissue homogenates were used to assess both oxidative stress markers and inflammatory cytokines. For oxidative stress, the activities of myeloperoxidase (MPO), superoxide dismutase (SOD), and the levels of malondialdehyde (MDA) were measured using corresponding commercial assay kits (Nanjing Jiancheng Bioengineering Institute, Nanjing, China). For inflammation, we quantified the protein concentrations of tumor necrosis factor-alpha (TNF-α), interleukin-6 (IL-6), interleukin-1β (IL-1β), interleukin-4 (IL-4), and interleukin-10 (IL-10). This was performed with enzyme-linked immunosorbent assay (ELISA) kits (MultiSciences (Lianke) Biotech Co., Ltd, Hangzhou, China), strictly adhering to the provided protocols. 2.7. SCFAs Analysis Cecal contents (100 mg) were precisely weighed and homogenized in 1 mL of sterile saline containing stainless steel beads using a tissue lyser (70 Hz, 180 s). The homogenate underwent centrifugation (10,000× g 2 2.8. 16SrRNA Sequencing Cecal content samples were submitted to Novogene Co., Ltd. (Beijing, China) for 16S rRNA gene sequencing. This includes DNA extraction, PCR amplification, magnetic bead purification and recovery, fluorescence quantification, library preparation and high-throughput sequencing. The total genomic DNA of the bacteria was extracted using the E.Z.N.A. ® www.Novogene.com 2.9. Statistical Analysis Data are presented as the mean ± standard deviation (SD). Statistical analyses were performed using SPSS software (version 27.0, IBM, Armonk, NY, USA). Group differences were assessed by one-way analysis of variance (ANOVA) followed by Dunnett’s post-hoc test. A p 3. Results 3.1. Curcumin Combined with Tryptophan Mitigated the Symptoms of UC Continuous administration of 2.5% DSS successfully induced colitis in mice, characterized by clinical signs such as diarrhea, hematochezia, and significant weight loss ( Figure 2 Figure 2 Figure 2 3.2. Curcumin Combined with Tryptophan Relieved Colonic Injury A histology test was used to observe the histopathological status of the colon ( Figure 2 Figure 2 Figure 2 3.3. Curcumin Combined with Tryptophan Protected Oxidative Stress To evaluate the effect of curcumin and tryptophan on oxidative stress in DSS-induced colitis, we measured the levels of MDA, MPO and SOD in the colon ( Figure 3 p 3.4. Curcumin Combined with Tryptophan Improved the Inflammatory Status The content of pro-inflammatory factors (TNF-α, IL-1β and IL-6) increased significantly and two anti-inflammatory cytokines (IL-10 and IL-4) were significantly reduced under DSS induction ( Figure 3 (p 3.5. Curcumin Combined with Tryptophan Improved the Intestinal Barrier Function To evaluate the protective effects of curcumin and tryptophan on the intestinal barrier, we examined the expression of tight junction protein (ZO-1, occludin) and mucin (MUC-2), and measured intestinal permeability. Immunofluorescence results showed that the expression of ZO-1, occludin, and MUC-2 was significantly reduced in the DSS-induced model group compared to the NC group. In contrast, the intervention of Cur, Trp, and especially Cur–Trp effectively reversed this downregulation and restored the expression of these key barrier-related molecules ( Figure 4 Figure 4 p 3.6. Curcumin Combined with Tryptophan Increased SCFA Content Administration of DSS resulted in significant depletion of all six SCFAs compared to the normal control (NC) group. In contrast, supplementation with Cur, Trp, and Cur–Trp restored SCFA levels. Although both curcumin and tryptophan monotherapy partially restored SCFA levels, the synergistic Cur–Trp group showed the strongest effect, significantly increasing all measured SCFA concentrations to levels much higher than those seen in the Cur or Trp groups alone ( p Figure 5 3.7. Curcumin Combined with Tryptophan Altered Gut Microbiota The quality and adequacy of the sequencing data were evaluated to ensure robust downstream analysis ( Figure 6 Figure 6 Figure 6 Figure 6 The gut microbiota is an indispensable component for maintaining the normal physiological functions of the intestine. Gut microbiota dysbiosis is a pivotal factor in the pathogenesis and development of intestinal inflammation [ 28 Figure 7 The Venn diagram showed the distribution of Operational Taxonomic Units (OTUs) across the different groups ( Figure 7 Figure 7 At the phylum level, the gut microbiota was predominantly composed of Bacteroidetes Firmicutes Proteobacteria Verrucomicrobia Proteobacteria Figure 7 Firmicutes Bacteroidetes Figure 7 Firmicutes Bacteroidetes 29 Figure 7 Figure 7 At the genus level, the NC group was dominated by beneficial bacteria such as Lachnospiraceae_NK4A136_group Bacteroides Akkermansia Figure 7 Lachnospiraceae_NK4A136_group To identify specific microbial taxa that were differentially abundant among the groups, we performed Linear Discriminant Analysis Effect Size (LEfSe). This analysis identified 52 discriminative taxa from the phylum to the genus level (LDA score > 3.0) ( Figure 7 Lachnospiraceae_UCG-006 Akkermansia Azospirillum Oscillibacter Intestinimonas Mucispirillum schaedler. p Figure 7 Figure 7 Bacteroides Escherichia-Shigella Blautia Oscillibacter Muribaculum 4. Discussion This study represents the first comprehensive investigation of the synergistic therapeutic effects of curcumin and tryptophan in a DSS-induced model of ulcerative colitis (UC) in mice. Our findings clearly indicate that the combined administration of these two compounds significantly improved the macroscopic symptoms of colitis, including prevention of weight loss, reduction of the disease activity index (DAI), and alleviation of colon shortening, while also effectively restoring intestinal barrier function and profoundly modulating the gut microbiota towards a healthier and more balanced state. These observations collectively highlight a multi-dimensional mechanism of action, which we will discuss in detail, emphasizing the intricate interactions among the host, its microbiota, and the therapeutic components. 4.1. Curcumin and Tryptophan Synergistically Mitigate Inflammation and Oxidative Stress The synergistic anti-inflammatory effects of curcumin combined with tryptophan treatment are manifested at multiple molecular levels. Curcumin, a well-established anti-inflammatory agent, has been widely reported to exert its effects by influencing key inflammatory pathways, including the NF-κB signaling pathway [ 30 31 A significant finding of this study is the notable upregulation of anti-inflammatory cytokines, particularly IL-4 and IL-10, following co-administration of curcumin and tryptophan. The levels of these beneficial cytokines exceeded those observed when either compound was administered alone, suggesting that the two compounds work together to maintain inflammatory homeostasis through different but complementary mechanisms. This observation suggests that curcumin and tryptophan rebalance the inflammatory microenvironment in complementary ways—each component may help regulate distinct but interrelated molecular processes that work together to promote inflammatory homeostasis [ 32 33 4.2. Curcumin and Tryptophan Synergistically Restore Intestinal Barrier Function Intestinal barrier dysfunction is a core pathological feature of UC, encompassing the disruption of tight junction proteins, the mucus layer, and the immune barrier [ 34 35 36 37 4.3. Curcumin and Tryptophan Synergistically Regulate Gut Microbiota Homeostasis Gut microbiota dysbiosis is an important driving factor in the pathogenesis of UC, and therefore the main focus of treatment [ 38 39 This finding implied that combination therapy may have the potential to reverse DSS-induced microbiota dysbiosis more powerfully. Concerning the composition of microbiota, combination therapy significantly enhanced the Firmicutes Bacteroidetes 40 Lachnospiraceae_NK4A136_ Oscillibacter 2 It is therefore reasonable to propose a “component–microbiota–host” interaction model. Specifically, curcumin is hypothesized to directly improve the intestinal microenvironment via its anti-inflammatory and antioxidant properties; this creates favorable conditions for the colonization and proliferation of beneficial bacteria capable of metabolizing tryptophan [ 41 42 43 4.4. Limitations and Future Directions This study systematically investigated the synergistic therapeutic effects of curcumin and tryptophan on DSS-induced UC in mice. Key findings support the efficacy of this combination in alleviating UC and propose a ‘Component–Microbiota–Host’ interaction model that provides a theoretical framework. Given their natural dietary sources and safety advantages, both components also show potential as targeted functional foods for UC. However, this study has notable limitations that need to be addressed, along with corresponding future research directions. First, it relies on an acute DSS colitis model. Although this model helps study acute inflammation, it cannot fully simulate the chronicity and pathological complexity of human UC, limiting the generalizability of the results. Future research should validate the findings in chronic colitis models to assess long-term efficacy and safety. Secondly, although the results suggest the involvement of pathways such as AhR and NF-κB, no direct molecular evidence has been collected, such as the expression of downstream markers IL-22, CYP1A1, p65, and IκBα, which requires in-depth mechanistic studies to clarify. Third, although the composition of the microbiome has changed and the levels of short-chain fatty acids have increased, the direct causal relationship between specific microorganisms and these metabolites remains unconfirmed and requires further analysis. Fourth, the low oral bioavailability of curcumin may hinder its efficacy; it is essential to optimize dosages and develop formulation strategies to improve this. Finally, individual variations in the human gut microbiome may affect treatment outcomes, making it necessary to study personalized intervention strategies for clinical applications. 5. Conclusions In this study, we demonstrated the potential of the combination of curcumin and tryptophan in intervening in DSS-induced ulcerative colitis (UC) in mice. Specifically, this combination alleviated the clinical symptoms of UC, restored intestinal barrier function, reduced oxidative stress and inflammatory responses, and significantly regulated the homeostasis of the gut microbiota, with effects more pronounced than the use of either component alone. This research provides direct experimental evidence for the effectiveness of the curcumin–tryptophan combination in intervening mouse UC, supporting further exploration of its applications in UC intervention. Furthermore, our findings offer new insights for developing dietary ingredient-based UC nutritional combination therapies, which may aid in the application of precise nutritional strategies in the management of inflammatory bowel disease (IBD). Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/nu17182988/s1 Author Contributions Writing—original draft and conceptualization, H.J.; resources and Data curation, G.L.; writing—review & editing, L.X.; writing—review & editing, N.Z.; writing—review & editing, Y.H.; visualization, Investigation, X.L.; resources, software, F.G.; resources, supervision, Q.J.; funding acquisition and Project administration, Z.L. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki, and approved by Animal Ethics Committee of Jiangxi University of Traditional Chinese Medicine (Approval No. JZLLSC20250520, 20 May 2025). Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Material Conflicts of Interest The authors confirm that there are no known competing financial interests or personal connections that might have impacted the work presented in this paper. References 1. Le Berre C. Honap S. Peyrin-Biroulet L. Ulcerative colitis Lancet 2023 402 571 584 10.1016/S0140-6736(23)00966-2 37573077 2. Hodgkinson K. El Abbar F. Dobranowski P. Manoogian J. Butcher J. Figeys D. Mack D. Stintzi A. Butyrate’s role in human health and the current progress towards its clinical application to treat gastrointestinal disease Clin. Nutr. 2023 42 61 75 10.1016/j.clnu.2022.10.024 36502573 3. Gao W.J. Chen F. Wang X. Meng Q.R. Recent advances in processing food powders by using superfine grinding techniques: A review Compr. Rev. Food Sci. Food Saf. 2020 19 2222 2255 10.1111/1541-4337.12580 33337081 4. O’Leary K. Keeping ulcerative colitis in check Nat. Med. 2022 10.1038/d41591-022-00071-7 35710844 5. Yao D. Dai W. Dong M. Dai C. Wu S. MUC2 and related bacterial factors: Therapeutic targets for ulcerative colitis EBioMedicine 2021 74 103751 10.1016/j.ebiom.2021.103751 34902790 PMC8671112 6. Zhang H. Wang X. Zhao L. Zhang K. Cui J. Xu G. Biochanin a ameliorates DSS-induced ulcerative colitis by improving colonic barrier function and protects against the development of spontaneous colitis in the Muc2 deficient mice Chem. Biol. Interact. 2024 395 111014 10.1016/j.cbi.2024.111014 38648921 7. Yeshi K. Jamtsho T. Wangchuk P. Current Treatments, Emerging Therapeutics, and Natural Remedies for Inflammatory Bowel Disease Molecules 2024 29 3954 10.3390/molecules29163954 39203033 PMC11357616 8. Mousa R.S. Invernizzi P. Mousa H.S. Innate immune cells in the pathogenesis of inflammatory bowel disease—From microbial metabolites to immune modulation Front. Gastroenterol. 2024 3 1452430 10.3389/fgstr.2024.1452430 9. Ju L. Suo Z. Lin J. Liu Z. Fecal microbiota and metabolites in the pathogenesis and precision medicine for inflammatory bowel disease Precis. Clin. Med. 2024 7 pbae023 10.1093/pcmedi/pbae023 39381014 PMC11459260 10. Matsuoka K. Fecal microbiota transplantation for ulcerative colitis Immunol. Med. 2021 44 30 34 10.1080/25785826.2020.1792040 32663072 11. Zong Y. Meng J. Mao T. Han Q. Zhang P. Shi L. Repairing the intestinal mucosal barrier of traditional Chinese medicine for ulcerative colitis: A review Front. Pharmacol. 2023 14 1273407 10.3389/fphar.2023.1273407 37942490 PMC10628444 12. Pei L.Y. Ke Y.S. Zhao H.H. Wang L. Jia C. Liu W.Z. Fu Q.H. Shi M.N. Cui J. Li S.C. Role of colonic microbiota in the pathogenesis of ulcerative colitis BMC. Gastroenterol. 2019 19 10 10.1186/s12876-019-0930-3 30642266 PMC6332670 13. Shang K. Zhao Z. Chen H. Bian X. Zhong X. Hu X. Lin X. Wang L. Anti-Inflammatory Potential of Wampee ( Clausena lansium Foods 2025 14 619 40002063 10.3390/foods14040619 PMC11854079 14. Yang Q. Chen L. Feng L. Liu C. Fang L. Liu Z. Sun X. Success of Cyclosporin and Tofacitinib Combination Therapy in a Patient with Severe Steroid-refractory Ulcerative Colitis Inflamm. Bowel Dis. 2021 27 e157 e158 10.1093/ibd/izab181 34398196 15. Xu B. Huang S. Chen Y. Wang Q. Luo S. Li Y. Wang X. Chen J. Luo X. Zhou L. Synergistic effect of combined treatment with baicalin and emodin on DSS-induced colitis in mouse Phytother. Res. 2021 35 5708 5719 10.1002/ptr.7230 34379340 16. Li R. Yang L. Research progress in the combined treatment of ulcerative colitis Rev. Esp. Enferm. Dig. 2025 117 129 135 10.17235/reed.2023.9444/2022 37073706 17. You C. Xing J. Sun J. Zhang D. Yan Y. Dong Y. Anti-Inflammatory and Anti-Oxidant Impacts of Lentinan Combined with Probiotics in Ulcerative Colitis Mol. Biotechnol. 2024 66 2778 2791 10.1007/s12033-023-00878-w 37819465 18. Liczbinski P. Michalowicz J. Bukowska B. Molecular mechanism of curcumin action in signaling pathways: Review of the latest research Phytother. Res. 2020 34 1992 2005 10.1002/ptr.6663 32141677 19. Scazzocchio B. Minghetti L. D’Archivio M. Interaction between Gut Microbiota and Curcumin: A New Key of Understanding for the Health Effects of Curcumin Nutrients 2020 12 2499 10.3390/nu12092499 32824993 PMC7551052 20. Cunha Neto F. Marton L.T. de Marqui S.V. Lima T.A. Barbalho S.M. Curcuminoids from Curcuma Longa Crit. Rev. Food. Sci. Nutr. 2019 59 2136 2143 10.1080/10408398.2018.1456403 29565637 21. Sauk J. Khalili H. Ananthakrishnan A. Lochhead P. Richter J. Chan A.T. Dietary Tryptophan Intake and Risk of Incident Crohn’s Disease and Ulcerative Colitis Gastroenterology 2017 152 S973 10.1016/S0016-5085(17)33299-7 22. Li X. Zhang Z.H. Zabed H.M. Yun J. Zhang G. Qi X. An Insight into the Roles of Dietary Tryptophan and Its Metabolites in Intestinal Inflammation and Inflammatory Bowel Disease Mol. Nutr. Food Res. 2021 65 e2000461 10.1002/mnfr.202000461 33216452 23. Xue C. Li G. Zheng Q. Gu X. Shi Q. Su Y. Chu Q. Yuan X. Bao Z. Lu J. Tryptophan metabolism in health and disease Cell Metab. 2023 35 1304 1326 10.1016/j.cmet.2023.06.004 37352864 24. Scott S.A. Fu J. Chang P.V. Microbial tryptophan metabolites regulate gut barrier function via the aryl hydrocarbon receptor Proc. Natl. Acad. Sci. USA 2020 117 19376 19387 10.1073/pnas.2000047117 32719140 PMC7431026 25. Li Y. Lin Y. Zheng X. Zheng X. Yan M. Wang H. Liu C. Echinacea purpurea Foods 2023 12 4265 10.3390/foods12234265 38231750 PMC10706068 26. Han P. Yu Y. Zhang L. Ruan Z. Citrus peel ameliorates mucus barrier damage in HFD-fed mice J. Nutr. Biochem. 2023 112 109206 10.1016/j.jnutbio.2022.109206 36370925 27. Xu C. Diao J. Feng Y. Zhang S. Sheng Y. Wang C. Mung Bean Peptides Alleviate Dextran-Sulfate-Sodium-Induced Colitis Symptoms in Mice by Protecting the Intestinal Mechanical Barrier and Regulating Gut Microbiota Foods 2025 14 1363 10.3390/foods14081363 40282764 PMC12027464 28. Du C. Zhao Y. Shen F. Qian H. Effect of Brassica rapa L. Polysaccharide on Lewis Lung Cancer Mice by Inflammatory Regulation and Gut Microbiota Modulation Foods 2024 13 3704 10.3390/foods13223704 39594117 PMC11593872 29. Zhang Y. Lin H. Xiong Y. Zhang Z. Zeng L. Liu Z. Fu Brick Tea Protects the Intestinal Barrier and Ameliorates Colitis in Mice by Regulating Gut Microbiota Foods 2025 14 1122 10.3390/foods14071122 40238292 PMC11989102 30. Jin S. Yang H. Jiao Y. Pang Q. Wang Y. Wang M. Shan A. Feng X. Dietary Curcumin Alleviated Acute Ileum Damage of Ducks ( Anas platyrhynchos Foods 2021 10 1370 10.3390/foods10061370 34198498 PMC8231806 31. Islam J. Sato S. Watanabe K. Watanabe T. Ardiansyah Hirahara K. Aoyama Y. Tomita S. Aso H. Komai M. Dietary tryptophan alleviates dextran sodium sulfate-induced colitis through aryl hydrocarbon receptor in mice J. Nutr. Biochem. 2017 42 43 50 28113104 10.1016/j.jnutbio.2016.12.019 32. Li Q. Sun J. Mohammadtursun N. Wu J. Dong J. Li L. Curcumin inhibits cigarette smoke-induced inflammation via modulating the PPARgamma-NF-kappaB signaling pathway Food Funct. 2019 10 7983 7994 10.1039/C9FO02159K 31773117 33. Wang X. Huang S. Zhang M. Su Y. Pan Z. Liang J. Xie X. Wang Q. Chen J. Zhou L. Gegen Qinlian decoction activates AhR/IL-22 to repair intestinal barrier by modulating gut microbiota-related tryptophan metabolism in ulcerative colitis mice J. Ethnopharmacol. 2023 302 115919 10.1016/j.jep.2022.115919 36356716 34. Tu A. Wang X.C. Chen H. Jia X. Wang T. Yi Y. Liu B. Xin W. Lu X. Shan Y. Ovomucin Ameliorates Intestinal Barrier and Intestinal Bacteria to Attenuate DSS-Induced Colitis in Mice J. Agric. Food Chem. 2021 69 5887 5896 10.1021/acs.jafc.1c00865 34013725 35. Cui J. Li H. Zhang T. Lin F. Chen M. Zhang G. Feng Z. Research progress on the mechanism of curcumin anti-oxidative stress based on signaling pathway Front. Pharmacol. 2025 16 1548073 10.3389/fphar.2025.1548073 40260389 PMC12009910 36. Yu M. Wang Q. Ma Y. Li L. Yu K. Zhang Z. Chen G. Li X. Xiao W. Xu P. Aryl Hydrocarbon Receptor Activation Modulates Intestinal Epithelial Barrier Function by Maintaining Tight Junction Integrity Int. J. Biol. Sci. 2018 14 69 77 10.7150/ijbs.22259 29483826 PMC5821050 37. Ma T. Li Y. Yang N. Wang H. Shi X. Liu Y. Jin H. Kwok L.Y. Sun Z. Zhang H. Efficacy of a postbiotic and its components in promoting colonic transit and alleviating chronic constipation in humans and mice Cell Rep. Med. 2025 6 102093 10.1016/j.xcrm.2025.102093 40286792 PMC12147849 38. Ren K. Yong C. Jin Y. Rong S. Xue K. Cao B. Wei H. Unraveling the microbial mysteries: Gut microbiota’s role in ulcerative colitis Front. Nutr. 2025 12 1519974 10.3389/fnut.2025.1519974 39996003 PMC11847676 39. Fassarella M. Blaak E.E. Penders J. Nauta A. Smidt H. Zoetendal E.G. Gut microbiome stability and resilience: Elucidating the response to perturbations in order to modulate gut health Gut 2021 70 595 605 10.1136/gutjnl-2020-321747 33051190 40. Tsai Y.C. Tai W.C. Liang C.M. Wu C.K. Tsai M.C. Hu W.H. Huang P.Y. Chen C.H. Kuo Y.H. Yao C.C. Alternations of the gut microbiota and the Firmicutes/Bacteroidetes ratio after biologic treatment in inflammatory bowel disease J Microbiol. Immunol. Infect. 2025 58 62 69 10.1016/j.jmii.2024.09.006 39393964 41. Xu Z.Y. Zhu W. Xu D. Amevor F.K. Wu Y.H. Ma D.J. Cao X.Q. Wei S. Shu G. Zhao X.L. Supplementation of Curcumin Promotes the Intestinal Structure, Immune Barrier Function and Cecal Microbiota Composition of Laying Hens in Early Laying Period Poult. Sci. 2024 103 104355 10.1016/j.psj.2024.104355 39423789 PMC11532481 42. Chajadine M. Laurans L. Radecke T. Mouttoulingam N. Al-Rifai R. Bacquer E. Delaroque C. Rytter H. Bredon M. Knosp C. Harnessing Intestinal Tryptophan Catabolism to Relieve Atherosclerosis in Mice Nat. Commun. 2024 15 6390 10.1038/s41467-024-50807-x 39080345 PMC11289133 43. He Y.M. Chen X.B. Li Y.C. Liang Y.Y. Hong T. Yang J. Cao Z. Mai H. Yao J. Zhang T. Curcumin Supplementation Alleviates Hepatic Fat Content Associated with Modulation of Gut Microbiota-dependent Bile Acid Metabolism in Patients with Nonalcoholic Simple Fatty Liver Disease: A Randomized Controlled Trial Am. J. Clin. Nutr. 2024 120 66 79 10.1016/j.ajcnut.2024.05.017 38795741 Figure 1 Experimental design and treatment regimen for DSS-induced colitis in mice. Figure 2 Curcumin combined with tryptophan alleviated symptoms in DSS-induced UC mice, alleviating colon injury. ( A B C D E F G H p Figure 3 Curcumin combined with tryptophan ameliorates colonic oxidative stress and inflammation in DSS-induced colitis. ( A B C D E F G H p Figure 4 Curcumin combined with tryptophan restores intestinal barrier integrity in DSS-induced colitis. ( A B C p < Figure 5 SCFAs content in cecal samples. ( A B C D E F p Figure 6 ( A B C Figure 7 Curcumin combined with tryptophan altered gut microbiota. ( A D E F G H I J L M K N O P Q p < nutrients-17-02988-t001_Table 1 Table 1 Scoring system for disease activity index (DAI) in DSS-induced colitis in mice. Score Loss of Body Weight (%) Loose Stools Bloody Stools 0 <1 Olid and granular Negative expression of occult blood 1 1–5 Soft and granular Weakly positive expression of occult blood 2 5–10 Semi-formed loose stool Positive expression of occult blood 3 10–15 Unformed loose stool Strongly positive expression of occult blood 4 ≥15 Had sign of liquid Strongly positive and visible blood nutrients-17-02988-t002_Table 2 Table 2 Histological scoring criteria for colonic injury. Inflammation Depth of Lesion Cryptic Destruction Extent of Disease (%) Score - - - - 0 Mild Mucosal layer 1/2 1–25 1 Moderate Submucosa 2/3 26–50 2 Severe Muscular and serosal layers 100% 51–75 3 - - Destruction of all crypts and intestinal epithelium 76–100 4 ",
  "metadata": {
    "Title of this paper": "Curcumin Supplementation Alleviates Hepatic Fat Content Associated with Modulation of Gut Microbiota-dependent Bile Acid Metabolism in Patients with Nonalcoholic Simple Fatty Liver Disease: A Randomized Controlled Trial",
    "Journal it was published in:": "Nutrients",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472673/"
  }
}