{
  "title": "Paper_997",
  "abstract": "pmc World J Clin Oncol 1494 wjco WJCO World Journal of Clinical Oncology 2218-4333 Baishideng Publishing Group Inc PMC12476613 PMC12476613.1 12476613 12476613 41024839 10.5306/wjco.v16.i9.108955 jWJCO.v16.i9.eid108955 1 Minireviews Neoadjuvant treatment in resectable pancreatic cancer: Why is upfront surgery so hard to be beaten? Uson Junior PLS et al Uson Junior Pedro Luiz Serrano Center for Personalized Medicine, Hospital Israelita Albert Einstein, São Paulo 05651901, Brazil Kadakia Kunal C Department of Oncology, Levine Cancer Institute, Atrium Health, Charlotte, NC 28204, United States Araujo Raphael L C Department of Surgery, Universidade Federal de São Paulo, São Paulo 04024-002, Brazil Department of Surgery, Hepato-pancreato-biliary Service, Carolinas Medical Center, Atrium Health, Charlotte, NC 28204, United States. raphael.l.c.araujo@gmail.com Author contributions: Uson Junior PLS, Kadakia KC, and Araujo RLC contributed to the study conception, data preparation, data interpretation, and critical writing. Corresponding author: Raphael L C Araujo, FACS, MD, PhD, Adjunct Professor, Department of Surgery, Universidade Federal de São Paulo, R. Napoleão de Barros, 715, São Paulo 04024-002, Brazil. raphael.l.c.araujo@gmail.com 24 9 2025 24 9 2025 16 9 497728 108955 27 4 2025 23 5 2025 12 8 2025 24 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ Neoadjuvant treatment is being extensively evaluated in pancreatic ductal adenocarcinoma (PDAC). This interest is appropriate given the dismal long-term prognosis for most patients who undergo upfront surgery. Despite prospective, retrospective and randomized trials supporting the role of neoadjuvant therapy in general for PDAC, the long-term benefit specifically for patients with resectable PDAC remains unclear. The phase III PREOPANC trial showed an improvement in overall survival in borderline resectable PDAC with neoadjuvant gemcitabine-based chemoradiation compared to upfront surgery alone, however, no such benefit was observed in the resectable cohort. Notably, three randomized trials (PANACHE01-PRODIGE 48, NORPACT-1, and PREOPANC-2) failed to show a clear improvement in overall survival with a neoadjuvant approach. The ongoing NeoFOL-R, PREOPANC-3, and the Alliance A021806 will help clarify the role of neoadjuvant therapy in resectable PDAC. In this minireview article we summarize the data surrounding neoadjuvant therapy in resectable pancreatic cancer and discuss future considerations of trials in this subgroup. Pancreas cancer Neoadjuvant treatment Chemotherapy Radiation Therapy Surgery Pancreatectomy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION Pancreatic ductal adenocarcinoma (PDAC) is a lethal disease[ 1 2 2 3 4 1 5 6 7 Adjuvant chemotherapy or neoadjuvant chemotherapy for patients with resectable PDAC are choices that are being evaluated in randomized trials for resected pancreatic cancer, but negative recent trials impose challenges for neoadjuvant treatment in these settings[ 8 9 ADJUVANT TREATMENT Although surgery is still the only curative pathway for most patients with PDAC eligible for surgery, the rate of long-term survivors is only 8%-12% in 5 years, in the absence of adjuvant therapy[ 10 11 10 vs P P vs vs 10 1 Table 1 Studies based on Gemcitabine for adjuvant treatment of resectable pancreatic adenocarcinoma  Ref.  Year  Trial Design  Age (range), years  Intervention   n  Median OS (95%CI), months  OS P  Median DFS (95%CI), months  DFS P  R0 rates (%) CONKO-001[ 10 2007 Ph3 62 (34-82) Gem 179 22.1 (NS) 0.06 13.4 (11.4-15.3) < 0.01 81 61 (36-81) Observation 175 20.2 (NS) 6.9 (6.1-7.8) 85 ESPAC-1[ 11 2004 Two-by-two factorial design 62 (52-68) 5-FU+RDT 145 15.9 (13.7-19.9) 0.05 10.7 (8.8-15.5) 1 0.04 81 2 61 (55-66) No RDT 144 17.9 (14.8-23.6) 15.2 (9.8-22.2) 1 84 2 61 (54-67) 5-FU 147 20.1 (16.5-22.7) 0.009 15.3 (10.5-19.2) 1 0.02 81 2 61 (54-67) No 5-FU 142 15.5 (13.0-17.7) 9.4 (8.4-15.2) 1 84 2 ESPAC-4[ 12 2017 Ph3 65 (37-80) Gem 366 25.5 (22.7–27.9) 0.03 13.1 (11.6–15.3) 3 0.08 40 2 65 (39-81) Gem, Cap 364 28.0 (23.5–31.5) 13.9 (12.1–16.6) 3 39 2 PRODIGE-24[ 13 2018 Ph3 63 (30-79) mFFX 247 54.4 (41.8-NR) 0.003 30.4 (21.7-NR) < 0.001 59.9 64 (30-81) Gem 246 35 (28.7-43.9) 17.7 (14.2-21.5) 54.5 APACT[ 14 2023 Ph3 64 (34-83) Gem, Nab-Pac 432 41.8 (35.5- 47.2) 0.02 16.6 (14.5-19.2) 0.02 76 64 (38-86) Gem 434 37.7 (31.1-40.5) 13.7 (11.2-16.0) 77 JASPAC-1[ 15 2016 Ph3 66 (59–73) Gem 190 25.5 (22.5-29.6) < 0.0001 11.3 (9.7-13.6) 0.0001 86 66 (60–73) S-1 187 46.5 (37.8-63.7) 22.9 (17.4–30.6) 88 1 Time-to-tumor recurrence. 2 Negative margins. 3 Relapse-free survival. Ph3: Phase 3; Gem: Gemcitabine; 5-FU: Fluorouracil; RDT: Radiotherapy; mFFX: Modified FOLFIRINOX; NR: Not-reached; Nab-Pac: Nab-paclitaxel; NS: No specified. ADJUVANT TRIALS After CONKO-001, multiple adjuvant trials were completed (Table 1 11 12 vs P 11 Further investigations addressed whether fluoropyrimidines would have better results if associated with gemcitabine[ 12 vs 12 vs vs P vs 12 The French phase III study PRODIGE 24 randomized 493 resected patients (R0 or R1) to receive adjuvant gemcitabine or mFOLFIRINOX (fluorouracil, irinotecan and oxaliplatin) for 6 months[ 6 vs P 13 vs P P vs 13 The phase III APACT study randomized 866 patients submitted to pancreatic cancer for PDAC, to 6 cycles of adjuvant QT with gemcitabine plus nanoparticulate paclitaxel vs 14 vs P vs P vs P 14 Finally, another important study, the phase III study JASPAC 01, carried out with an exclusively Asian population, demonstrated superiority of adjuvant S-1 over gemcitabine (HR = 0.57; P 15 NEOADJUVANT TREATMENT FOR RESECTABLE DISEASE Neoadjuvant chemotherapy is considered by multiple guidelines for patients with resectable tumors who have high-risk features for systemic disease, including elevated preoperative carbohydrate antigen 19-9 (CA19-9), large primary tumors, enlarged peripancreatic lymph nodes, significant weight loss, or severe pain[ 16 8 8 The phase III PREOPANC-1 study randomized 246 patients with resectable or borderline disease to either surgery or neoadjuvant chemotherapy plus radiotherapy, that consisted of 15 fractions of 2.4 Gy combined with gemcitabine, preceded and followed by a cycle of gemcitabine alone[ 7 P vs P 17 18 2 Table 2 Randomized Clinical trials of neoadjuvant treatment for resectable pancreatic adenocarcinoma  Ref.  Year  Trial design  Age (range), years  Regimen  Intervention   n  Median OS (95%CI), months  OS HR (95%CI)  Median DFS (95%CI), months  DFS HR (95%CI)  R0 rates,% Casadei et al 22 et al 23 2015 Ph2 71.5 (51-78) Neoadjuvant GEM + RDT -> surgery -> GEM 18 24.3 (8.0-40.6)  P 18.03 (2.58-33.48)  P 38.9 67.5 (48-79) Adjuvant Surgery -> GEM 20 21.1 (8.3-33.9) 8.53 (4.47-12.59) 25 Golcher et al 24 2015 Ph2 62.5 (33-76) Neoadjuvant GEM, CDDP + RDT -> surgery > GEM 33 17.4  P — — 52 65.1 (46-73) Adjuvant Surgery -> GEM 33 14.4 — 48 Reni et al 25 2018 Ph2 64 (39-75) Neoadjuvant PEXG -> Surgery -> PEXG 32 38.2 (27.3-49.1) — 16.9 (3.7-28.7) — 63 68 (49-75) Adjuvant Surgery -> PEXG 30 26.4 (15.8-26.7) 12.4 (5.4-19.4) 37 65 (37-74) Adjuvant Surgery > GEM 26 20.4 (14.6-25.8) 4.7 (0.9-8.9) 27 Satoi[ 26 2019 Ph3 Not presented Neoadjuvant GEM + S1 -> surgery- > S1 182 36.7 (28.6-43.3)  P — — — Adjuvant Surgery -> S1 180 26.6 (21-31.3) — — Versteijne et al 7 2022 Ph3 66 (59-71) Neoadjuvant GEM + RDT -> surgery -> GEM 65 14.6 (NS)  P 9.2 0.88 (0.60-1.28), P 66 67 (60-73) Adjuvant Surgery -> GEM 68 15.6 (NS) 9.3 59 Labori et al 20 2024 Ph2 68 (60-72) Neoadjuvant FFX-> Surgery-> Gem, Cap or FFX 77 25.1 (17.2-34.9)  P 11.9 (9.3-15.7)  P 56 66 (57-72) Adjuvant Surgery -> Gem, Cap or FFX 63 38.5 (27.6-NR) 16.2 (10.8-21) 39 PREOPANC-2[ 23 2023 Ph3 66 (NS) Neoadjuvant FFX-> surgery 185 21.9 (17.7-27)  P NS - 61 68 (NS) Neoadjuvant GEM+RDT-> Surgery-> GEM 184 21.3 (16.8-25.5) NS 67 Seufferlein et al 18 2023 Ph2 Not presented Neoadjuvant GEM + NAB-PACL > surgery 59 25.2 (NS) HR: 1.26 (0.80-1.97) 11.5 1.31 (0.86-1.99) 87.8 Adjuvant Surgery > GEM + NAB-PACL 59 16.7 (NS) 5.9 67.4 Ph3: Phase 3; Ph2: Phase 2; Gem: Gemcitabine; 5-FU: Fluorouracil; RDT: Radiotherapy; mFFX: Modified FOLFIRINOX; NR: Not-reached; Nab-Pac: Nab-paclitaxel; NS: No specified; CDDP: Cisplatin; PEXG: Cisplatin, epirubicin, capecitabine, gemcitabine. NEOADJUVANT TRIALS The randomized phase II SWOG S1505 study evaluated 147 patients with resectable pancreatic cancer. The primary goal was to compare two neoadjuvant regimens — modified FOLFIRINOX and gemcitabine plus nanoparticulate paclitaxel — rather than to establish superiority. Both arms demonstrated similar outcomes, with a median OS of 22.4 and 23.6 months, respectively, and an R0 resection rate of 85%. Additionally, 25% of patients in the mFOLFIRINOX arm and 42% in the gemcitabine/nab-paclitaxel arm achieved a significant or complete pathologic response. Relapse-free survival was modest, at 14.2 months vs 17 The S1505 results provide important context when comparing outcomes between neoadjuvant and adjuvant strategies. In PRODIGE 24, patients had already undergone surgery and recovered sufficiently to receive adjuvant therapy, introducing a degree of immortal time bias. In contrast, S1505 enrolled patients at diagnosis, capturing a broader and potentially less selected population. Another important observation was that contrary to expectations based on metastatic disease outcomes, mFOLFIRINOX did not demonstrate clear superiority over gemcitabine/nab-paclitaxel in the neoadjuvant setting. Separately, the German AIO-NEONAX study randomized 127 patients with resectable disease to either perioperative treatment (two cycles preoperatively and four postoperatively) or adjuvant treatment alone with six cycles of gemcitabine plus nanoparticulate paclitaxel. The primary endpoint — 55% PFS at 18 months — was not met in either arm. However, perioperative treatment was associated with higher R0 resection rates (87.8% vs vs vs 18 In the phase II study PANACHE01-PRODIGE 48, 153 patients with resectable tumor were randomized (2:2:1) to 4 cycles of neoadjuvant FOLFIRINOX or FOLFOX (discontinued due to lower efficacy) or surgery followed by adjuvant treatment[ 21 19 The findings from the NORPACT-1 trial and PREOPANC -2 trials are particularly notable in addressing the role of neoadjuvant therapy for resectable PDAC. In the randomized phase II NORPACT-1, 140 patients with resectable tumors (by NCCN criteria) were randomized to perioperative FOLFIRINOX or upfront surgery followed by adjuvant FOLFIRINOX, with the primary objective of demonstrating superiority. Although perioperative chemotherapy resulted in higher rates of R0 resection (56% vs vs P 20 Similarly, the PREOPANC-2 trial evaluated neoadjuvant chemoradiotherapy with either gemcitabine- or FOLFIRINOX-based regimens in patients with resectable or borderline tumors. The majority (60%-70%) of enrolled patients had resectable tumors. Despite high compliance rates, the median survival in both arms was approximately 21 months — relatively lower than observed in other contemporary studies — and thus the data do not support FOLFIRINOX as a standard neoadjuvant approach for resectable PDAC[ 21 Additional studies evaluating neoadjuvant strategies for resectable PDAC are summarized in Table 2 22 26 8 CONCLUSION The rationale for neoadjuvant therapy in potentially resectable pancreatic cancer follows the principles applied in other high-risk malignancies and is summarized in Table 3 Table 3 Rational regarding putative pros cons of neoadjuvant treatment for both resectable and borderline pancreatic adenocarcinoma  Advantages  Disadvantages Delivery of systemic therapy Complications of pre-treatment procedures (biopsy, stents, etc Increased efficacy of radiation Occasional limiting toxicity due the treatment delaying surgical treatment Removal of irradiated tissues Occasional drop out due to either limiting toxicity or tumor progression Increasing in R0 rates No proven benefit for resectable lesions in randomized clinical trials Decreasing of fistula rates In the rare subset of patients with truly radiographically resectable disease — like those included in the PRODIGE cohort — upfront surgery followed by adjuvant therapy remains a valid and evidence-based approach. Long-term survival rates after neoadjuvant FOLFIRINOX remain unacceptably low and do not justify excluding surgery-first pathways. Thus, the current “standard of care” should not be viewed as sufficient; better strategies are urgently needed to improve outcomes. Given the limitations of existing systemic therapies, several groups have explored precision medicine strategies. However, actionability in PDAC remains rare, largely derived from the identification of homologous recombination deficiency[ 27 27 28 30 New molecular subtyping models have also emerged, notably those described in the COMPASS trial, which performed whole genomic sequencing and transcriptomic analysis to identify two dominant subtypes: Classical and basal-like PDAC[ 31 The PASS-1 trial further explored this concept by prospectively conducting upfront multi-omics profiling in patients with advanced PDAC before randomization to FOLFIRINOX or gemcitabine/nab-paclitaxel[ 32 Despite these advances, several ongoing trials, including NCT05529940 NCT04927780 NCT04340141 e.g. NCT03977233 1 Figure 1  Multimodal approach for curative-intent treatment of localized pancreas cancer. Supplementary material https://BioRender.com/hptgk9a Importantly, improving outcomes in resectable PDAC will not solely depend on new drugs but on better biological selection and smarter trial design. Additional strategies must also include: (1) Identifying patients at risk of early relapse through biomarkers such as circulating tumor cells and CA19-9; (2) Refining neoadjuvant regimens beyond current standards; (3) Profiling patients who achieve exceptional long-term survival; and (4) Preserving functional status through supportive care interventions during therapy. Ethical considerations must remain central — systemic therapy should not be reflexively administered to all patients with radiographically resectable disease, especially those lacking high-risk features. Our responsibility as clinicians is to balance toxicity, survival benefit, and quality of life with a patient-centered, evidence-driven approach. Nowadays, accordingly to guidelines including NCCN[ 9 33 34 i.e.  Conflict-of-interest statement:  Provenance and peer review:  Peer-review model:  Corresponding Author's Membership in Professional Societies:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Uson Junior PLS Carvalho L Fernandes MLC Botrus G de Souza Martins R da Silva EF Dos Santos SSMB Taniwaki L Taranto P Dutra ACP de Oliveira Filho JB Araujo SEA Moura F Neoadjuvant chemotherapy or upfront surgery in localized pancreatic cancer: a contemporary analysis Sci Rep 2022 12 13592 35948602 10.1038/s41598-022-17743-6 PMC9365816 2 Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Jemal A Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 229 263 38572751 10.3322/caac.21834 3 Siegel RL Giaquinto AN Jemal A Cancer statistics, 2024 CA Cancer J Clin 2024 74 12 49 38230766 10.3322/caac.21820 4 Gyawali B Booth CM Treatment of metastatic pancreatic cancer: 25 years of innovation with little progress for patients Lancet Oncol 2024 25 167 170 38301687 10.1016/S1470-2045(23)00516-8 5 Park W Chawla A O'Reilly EM Pancreatic Cancer: A Review JAMA 2021 326 851 862 34547082 10.1001/jama.2021.13027 PMC9363152 6 Conroy T Hammel P Hebbar M Ben Abdelghani M Wei AC Raoul JL Choné L Francois E Artru P Biagi JJ Lecomte T Assenat E Faroux R Ychou M Volet J Sauvanet A Breysacher G Di Fiore F Cripps C Kavan P Texereau P Bouhier-Leporrier K Khemissa-Akouz F Legoux JL Juzyna B Gourgou S O'Callaghan CJ Jouffroy-Zeller C Rat P Malka D Castan F Bachet JB Canadian Cancer Trials Group and the Unicancer-GI–PRODIGE Group FOLFIRINOX or Gemcitabine as Adjuvant Therapy for Pancreatic Cancer N Engl J Med 2018 379 2395 2406 30575490 10.1056/NEJMoa1809775 7 Versteijne E van Dam JL Suker M Janssen QP Groothuis K Akkermans-Vogelaar JM Besselink MG Bonsing BA Buijsen J Busch OR Creemers GM van Dam RM Eskens FALM Festen S de Groot JWB Groot Koerkamp B de Hingh IH Homs MYV van Hooft JE Kerver ED Luelmo SAC Neelis KJ Nuyttens J Paardekooper GMRM Patijn GA van der Sangen MJC de Vos-Geelen J Wilmink JW Zwinderman AH Punt CJ van Tienhoven G van Eijck CHJ Dutch Pancreatic Cancer Group Neoadjuvant Chemoradiotherapy Versus Upfront Surgery for Resectable and Borderline Resectable Pancreatic Cancer: Long-Term Results of the Dutch Randomized PREOPANC Trial J Clin Oncol 2022 40 1220 1230 35084987 10.1200/JCO.21.02233 8 Uson Junior PLS Dias E Silva D de Castro NM da Silva Victor E Rother ET Araújo SEA Borad MJ Moura F Does neoadjuvant treatment in resectable pancreatic cancer improve overall survival? A systematic review and meta-analysis of randomized controlled trials ESMO Open 2023 8 100771 36638709 10.1016/j.esmoop.2022.100771 PMC10024142 9 Network NCC Pancreatic Adenocarcinoma (Version 2.2025). Available from: https://www.nccn.org/professionals/physician_gls/pdf/pancreatic.pdf 10 Oettle H Neuhaus P Hochhaus A Hartmann JT Gellert K Ridwelski K Niedergethmann M Zülke C Fahlke J Arning MB Sinn M Hinke A Riess H Adjuvant chemotherapy with gemcitabine and long-term outcomes among patients with resected pancreatic cancer: the CONKO-001 randomized trial JAMA 2013 310 1473 1481 24104372 10.1001/jama.2013.279201 11 Neoptolemos JP Stocken DD Friess H Bassi C Dunn JA Hickey H Beger H Fernandez-Cruz L Dervenis C Lacaine F Falconi M Pederzoli P Pap A Spooner D Kerr DJ Büchler MW European Study Group for Pancreatic Cancer A randomized trial of chemoradiotherapy and chemotherapy after resection of pancreatic cancer N Engl J Med 2004 350 1200 1210 15028824 10.1056/NEJMoa032295 12 Neoptolemos JP Palmer DH Ghaneh P Psarelli EE Valle JW Halloran CM Faluyi O O'Reilly DA Cunningham D Wadsley J Darby S Meyer T Gillmore R Anthoney A Lind P Glimelius B Falk S Izbicki JR Middleton GW Cummins S Ross PJ Wasan H McDonald A Crosby T Ma YT Patel K Sherriff D Soomal R Borg D Sothi S Hammel P Hackert T Jackson R Büchler MW European Study Group for Pancreatic Cancer Comparison of adjuvant gemcitabine and capecitabine with gemcitabine monotherapy in patients with resected pancreatic cancer (ESPAC-4): a multicentre, open-label, randomised, phase 3 trial Lancet 2017 389 1011 1024 28129987 10.1016/S0140-6736(16)32409-6 13 Conroy T Hammel P Turpin A Belletier C Wei A Mitry E Lopez A Francois E Artru P Biagi J Lecomte T Assenat E Faroux R Ychou M Bouche O Lambert A Monard L Rat P Castan F Bachet J LBA57 Unicancer PRODIGE 24/CCTG PA6 trial: Updated results of a multicenter international randomized phase III trial of adjuvant mFOLFIRINOX (mFFX) versus gemcitabine (gem) in patients (pts) with resected pancreatic ductal adenocarcinomas (PDAC) Ann Oncol 2021 32 S1334 14 Tempero MA Pelzer U O'Reilly EM Winter J Oh DY Li CP Tortora G Chang HM Lopez CD Bekaii-Saab T Ko AH Santoro A Park JO Noel MS Frassineti GL Shan YS Dean A Riess H Van Cutsem E Berlin J Philip P Moore M Goldstein D Tabernero J Li M Ferrara S Le Bruchec Y Zhang G Lu B Biankin AV Reni M APACT Investigators Adjuvant nab-Paclitaxel + Gemcitabine in Resected Pancreatic Ductal Adenocarcinoma: Results From a Randomized, Open-Label, Phase III Trial J Clin Oncol 2023 41 2007 2019 36521097 10.1200/JCO.22.01134 PMC10082313 15 Uesaka K Boku N Fukutomi A Okamura Y Konishi M Matsumoto I Kaneoka Y Shimizu Y Nakamori S Sakamoto H Morinaga S Kainuma O Imai K Sata N Hishinuma S Ojima H Yamaguchi R Hirano S Sudo T Ohashi Y JASPAC 01 Study Group Adjuvant chemotherapy of S-1 versus gemcitabine for resected pancreatic cancer: a phase 3, open-label, randomised, non-inferiority trial (JASPAC 01) Lancet 2016 388 248 257 27265347 10.1016/S0140-6736(16)30583-9 16 Luiz Serrano Usón Junior P Montes Santos V Lima Souza I Schvartsman G Cotait Malu F Establishing recurrence indicators and stratifying pancreatic ductal adenocarcinoma based on routine laboratory exams. Is it time to incorporate these parameters in daily clinical practice? J BUON 2020 25 432 447 32277666 17 Sohal DPS Duong M Ahmad SA Gandhi NS Beg MS Wang-Gillam A Wade JL 3rd Chiorean EG Guthrie KA Lowy AM Philip PA Hochster HS Efficacy of Perioperative Chemotherapy for Resectable Pancreatic Adenocarcinoma: A Phase 2 Randomized Clinical Trial JAMA Oncol 2021 7 421 427 33475684 10.1001/jamaoncol.2020.7328 PMC7821078 18 Seufferlein T Uhl W Kornmann M Algül H Friess H König A Ghadimi M Gallmeier E Bartsch DK Lutz MP Metzger R Wille K Gerdes B Schimanski CC Graupe F Kunzmann V Klein I Geissler M Staib L Waldschmidt D Bruns C Wittel U Fichtner-Feigl S Daum S Hinke A Blome L Tannapfel A Kleger A Berger AW Kestler AMR Schuhbaur JS Perkhofer L Tempero M Reinacher-Schick AC Ettrich TJ Perioperative or only adjuvant gemcitabine plus nab-paclitaxel for resectable pancreatic cancer (NEONAX)-a randomized phase II trial of the AIO pancreatic cancer group Ann Oncol 2023 34 91 100 36209981 10.1016/j.annonc.2022.09.161 19 Pinson J Henriques J Beaussire L Sarafan-Vasseur N Sa Cunha A Bachet JB Vernerey D Di Fiore F Schwarz L PANACHE01-PRODIGE48 group New Biomarkers to Define a Biological Borderline Situation for Pancreatic Adenocarcinoma: Results of an Ancillary Study of the PANACHE01-PRODIGE48 Trial Ann Surg 2024 280 734 744 39101207 10.1097/SLA.0000000000006468 20 Labori KJ Bratlie SO Andersson B Angelsen JH Biörserud C Björnsson B Bringeland EA Elander N Garresori H Grønbech JE Haux J Hemmingsson O Liljefors MG Myklebust TÅ Nymo LS Peltola K Pfeiffer P Sallinen V Sandström P Sparrelid E Stenvold H Søreide K Tingstedt B Verbeke C Öhlund D Klint L Dueland S Lassen K Nordic Pancreatic Cancer Trial-1 study group Neoadjuvant FOLFIRINOX versus upfront surgery for resectable pancreatic head cancer (NORPACT-1): a multicentre, randomised, phase 2 trial Lancet Gastroenterol Hepatol 2024 9 205 217 38237621 10.1016/S2468-1253(23)00405-3 21 Groot Koerkamp B Janssen Q van Dam J Bonsing B Bos H Bosscha K Haberkorn B de Hingh I Karsten T Van der Kolk M Liem M Loosveld O Patijn G van Santvoort H J. de vos-Geelen van der Holt B Homs M van Tienhoven G Besselink M Wilmink H LBA83 Neoadjuvant chemotherapy with FOLFIRINOX versus neoadjuvant gemcitabine-based chemoradiotherapy for borderline resectable and resectable pancreatic cancer (PREOPANC-2): A multicenter randomized controlled trial Ann Oncol 2023 34 S1323 22 Casadei R Di Marco M Ricci C Santini D Serra C Calculli L D'Ambra M Guido A Morselli-Labate AM Minni F Neoadjuvant Chemoradiotherapy and Surgery Versus Surgery Alone in Resectable Pancreatic Cancer: A Single-Center Prospective, Randomized, Controlled Trial Which Failed to Achieve Accrual Targets J Gastrointest Surg 2015 19 1802 1812 26224039 10.1007/s11605-015-2890-4 23 Di Marco M Ricci C Brandi G De Lorenzo S Tovoli F Carloni R Palloni A, Abbati F, Grassi E, Guido A, Morganti A G, Nigro M C, Rizzo A, Ricci A D, Alberici L, D'Onofrio M, Minni F Santini D, Casadei R. Neoadjuvant Chemoradiotherapy and Surgery versus Surgery Alone in Resectable Pancreatic Cancer: Long Term Follow-Up Results From a Single-Center Prospective, Randomized, Controlled Trial. AIOM abstracts Tumori 2020 106 1 215 24 Golcher H Brunner TB Witzigmann H Marti L Bechstein WO Bruns C Jungnickel H Schreiber S Grabenbauer GG Meyer T Merkel S Fietkau R Hohenberger W Neoadjuvant chemoradiation therapy with gemcitabine/cisplatin and surgery versus immediate surgery in resectable pancreatic cancer: results of the first prospective randomized phase II trial Strahlenther Onkol 2015 191 7 16 25252602 10.1007/s00066-014-0737-7 PMC4289008 25 Reni M Balzano G Zanon S Zerbi A Rimassa L Castoldi R Pinelli D Mosconi S Doglioni C Chiaravalli M Pircher C Arcidiacono PG Torri V Maggiora P Ceraulo D Falconi M Gianni L Safety and efficacy of preoperative or postoperative chemotherapy for resectable pancreatic adenocarcinoma (PACT-15): a randomised, open-label, phase 2-3 trial Lancet Gastroenterol Hepatol 2018 3 413 423 29625841 10.1016/S2468-1253(18)30081-5 26 Satoi S Unno M Motoi F Matsuyama Y Matsumoto I Aosasa S Shirakawa H Wada K Fujii T Yoshitomi H Takahashi S Sho M Ueno H Yamamoto T Kosuge T The effect of neoadjuvant chemotherapy with gemcitabine and S-1 for resectable pancreatic cancer (randomized phase II/III trial; Prep-02/JSAP-05) JCO 2019 37 4126 4126 27 Uson PLS Jr Samadder NJ Riegert-Johnson D Boardman L Borad MJ Ahn D Sonbol MB Faigel DO Fukami N Pannala R Kunze K Golafshar M Klint M Esplin ED Nussbaum RL Stewart AK Bekaii-Saab T Clinical Impact of Pathogenic Germline Variants in Pancreatic Cancer: Results From a Multicenter, Prospective, Universal Genetic Testing Study Clin Transl Gastroenterol 2021 12 e00414 34620795 10.14309/ctg.0000000000000414 PMC8500569 28 Golan T Sella T O'Reilly EM Katz MH Epelbaum R Kelsen DP Borgida A Maynard H Kindler H Friedmen E Javle M Gallinger S Overall survival and clinical characteristics of BRCA mutation carriers with stage I/II pancreatic cancer Br J Cancer 2017 116 697 702 28183138 10.1038/bjc.2017.19 PMC5355924 29 Momtaz P O'Connor CA Chou JF Capanu M Park W Bandlamudi C Berger MF Kelsen DP Suehnholz SP Chakravarty D Yu KH Varghese AM Zervoudakis A Li J Ku GY Park JS Shcherba M Harding JJ Goldberg Z Abou-Alfa GK Salo-Mullen EE Stadler ZK Iacobuzio-Donahue CA O'Reilly EM Pancreas cancer and BRCA: A critical subset of patients with improving therapeutic outcomes Cancer 2021 127 4393 4402 34351646 10.1002/cncr.33812 PMC9301324 30 O'Reilly EM Lee JW Zalupski M Capanu M Park J Golan T Tahover E Lowery MA Chou JF Sahai V Brenner R Kindler HL Yu KH Zervoudakis A Vemuri S Stadler ZK Do RKG Dhani N Chen AP Kelsen DP Randomized, Multicenter, Phase II Trial of Gemcitabine and Cisplatin With or Without Veliparib in Patients With Pancreas Adenocarcinoma and a Germline BRCA/PALB2 Mutation J Clin Oncol 2020 38 1378 1388 31976786 10.1200/JCO.19.02931 PMC7193749 31 Aung KL Fischer SE Denroche RE Jang GH Dodd A Creighton S Southwood B Liang SB Chadwick D Zhang A O'Kane GM Albaba H Moura S Grant RC Miller JK Mbabaali F Pasternack D Lungu IM Bartlett JMS Ghai S Lemire M Holter S Connor AA Moffitt RA Yeh JJ Timms L Krzyzanowski PM Dhani N Hedley D Notta F Wilson JM Moore MJ Gallinger S Knox JJ Genomics-Driven Precision Medicine for Advanced Pancreatic Cancer: Early Results from the COMPASS Trial Clin Cancer Res 2018 24 1344 1354 29288237 10.1158/1078-0432.CCR-17-2994 PMC5968824 32 Knox JJ Jaffee EM O'kane GM King D Laheru D Yu KH Perez K Habowski AN Grant RC Fischer S Aguirre A Jang RW Devoe CE O'reilly EM Dodd A Wolpin BM Ye XY Notta F Gallinger S Tuveson DA Early results of the PASS-01 trial: Pancreatic adenocarcinoma signature stratification for treatment-01 JCO 2024 42 LBA4004 LBA4004 33 Khorana AA McKernin SE Berlin J Hong TS Maitra A Moravek C Mumber M Schulick R Zeh HJ Katz MHG Potentially Curable Pancreatic Adenocarcinoma: ASCO Clinical Practice Guideline Update J Clin Oncol 2019 37 2082 2088 31180816 10.1200/JCO.19.00946 34 Conroy T Pfeiffer P Vilgrain V Lamarca A Seufferlein T O'Reilly EM Hackert T Golan T Prager G Haustermans K Vogel A Ducreux M ESMO Guidelines Committee Pancreatic cancer: ESMO Clinical Practice Guideline for diagnosis, treatment and follow-up Ann Oncol 2023 34 987 1002 37678671 10.1016/j.annonc.2023.08.009 ",
  "metadata": {
    "Title of this paper": "Pancreatic cancer: ESMO Clinical Practice Guideline for diagnosis, treatment and follow-up",
    "Journal it was published in:": "World Journal of Clinical Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476613/"
  }
}