{
  "title": "Paper_1213",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472381 PMC12472381.1 12472381 12472381 41011478 10.3390/microorganisms13092147 microorganisms-13-02147 1 Review Human Microbiome as an Immunoregulatory Axis: Mechanisms, Dysbiosis, and Therapeutic Modulation https://orcid.org/0009-0007-9113-2189 Cortés Matías 1 2 Olate Paula 1 2 https://orcid.org/0000-0003-0991-5939 Rodriguez Rodrigo 3 https://orcid.org/0000-0002-6209-6728 Diaz Rommy 2 4 Martínez Ailín 2 5 Hernández Genisley 4 https://orcid.org/0000-0001-8321-604X Sepulveda Nestor 2 4 https://orcid.org/0000-0003-4093-7415 Paz Erwin A. 6 https://orcid.org/0000-0002-5353-3084 Quiñones John 2 4 * Di Marco Roberto Academic Editor 1 m.cortes10@ufromail.cl p.olate02@ufromail.cl 2 rommy.diaz@ufrontera.cl a.martinez26@ufromail.cl nestor.sepulveda@ufrontera.cl 3 r.rodriguez09@ufromail.cl 4 genisleyh@gmail.com 5 6 erwin.pazmunoz@uwa.edu.au * john.quinones@ufrontera.cl 14 9 2025 9 2025 13 9 496716 2147 13 7 2025 28 8 2025 08 9 2025 14 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary The microorganisms that live in our body, especially those in the gut, are essential for keeping the immune system balanced and protecting against disease. During the first years of life, these microbes help the immune system to grow and work properly. This review explored how the microbiome communicates with the immune system and the brain, what happens when this balance is disturbed, and which new treatments may help restore it. We found that gut microbes send signals to the immune system through different molecules and produce substances that can reduce inflammation and support health. The intestinal lining also plays an important role as a barrier that protects the body and helps regulate immunity. Promising therapies are being developed to repair imbalances in the microbiome, including the use of beneficial bacteria, stool transplants, and advanced genetic tools. These strategies aim to improve health by restoring a healthy microbial community. Understanding and using this knowledge could help create more personalized treatments for immune-related diseases, offering safer and more effective options for patients while improving overall well-being in society. Abstract The human microbiome plays a central role in modulating the immune system and maintaining immunophysiological homeostasis, contributing to the prevention of immune-mediated diseases. In particular, the gut microbiota is a key ecosystem for immune system maturation, especially in early life. This review aimed to analyze the molecular and cellular mechanisms linking the microbiome to immune and neuronal functions, as well as the impact of dysbiosis and emerging therapeutic strategies targeting the microbiome. The analysis was based on scientific databases, prioritizing studies published since 2000, with special emphasis on the past decade. The microbiome influences immune signaling through microorganism-associated molecular patterns (MAMPs) and pattern recognition receptors (PRRs), including Toll-like receptors (TLRs). Additionally, microbial metabolites—such as short-chain fatty acids (SCFAs), tryptophan derivatives, and secondary bile acids—exert significant immunomodulatory effects. The intestinal epithelial barrier is also described as an active immunological interface contributing to systemic regulation. The literature highlights innovative therapies, including fecal microbiota transplantation (FMT), probiotics, and microbiome editing with CRISPR-Cas technologies. These strategies aim to restore microbial balance and improve immune outcomes. The growing body of evidence positions the microbiome as a valuable clinical and diagnostic target, with significant potential for application in personalized medicine. human microbiome immunomodulation dysbiosis microbiome-based therapies immune homeostasis This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The human body harbors a diverse and complex community of microorganisms known as the microbiome, composed primarily of bacteria but also including viruses, fungi, and archaea. This microbial network colonizes multiple anatomical niches, including the gastrointestinal tract, skin, respiratory tract, urogenital system, and oral cavity, establishing unique ecosystems adapted to each environment [ 1 Among these ecosystems, the gut microbiome has been the most extensively studied due to its high microbial density and its central role in immunological and metabolic processes. Other microbiomes, such as those of the skin, oral cavity, respiratory tract, and urogenital system, also contribute to immune surveillance, immunological tolerance, and infection prevention [ 2 The integrity of the intestinal epithelial barrier, partially modulated by the microbiota, is crucial for preventing bacterial translocation and inappropriate immune activation. Additionally, microbial metabolites such as short-chain fatty acids (SCFAs; including butyrate, propionate, and acetate) exert significant immunomodulatory effects, influencing the differentiation and function of various immune cells [ 3 An imbalance in the composition and function of the microbiome, known as dysbiosis, has been associated with a wide range of diseases. These include inflammatory bowel diseases such as Crohn’s disease and ulcerative colitis [ 4 5 6 7 8 9 10 Of interest is the connection between the microbiome and the central nervous system via the gut–brain axis, which involves neural, immune, and endocrine pathways. The gut microbiota can influence brain function through the production of neurotransmitters and the modulation of systemic inflammation, opening new research avenues in neurological and psychiatric disorders [ 11 Therefore, this review aimed to analyze the molecular and cellular mechanisms linking the microbiome to immune function, as well as the effects of dysbiosis and recent therapeutic strategies aimed at its modulation. 2. Materials and Methods 2.1. Selection Criteria This review was conducted using a systematic and structured approach aimed at ensuring transparency, reproducibility, and methodological rigor. To this end, an exhaustive search was conducted in high-impact biomedical and multidisciplinary databases (PubMed/MEDLINE, Scopus, Web of Science, Embase, ScienceDirect, SpringerLink, Wiley Online Library, and DOAJ) between January 2020 and April 2025, supplemented by specialized repositories in microbiology and immunology, also considering some highly cited previous articles of conceptual relevance. The search strategy was based on MeSH descriptors and combinations of keywords using Boolean operators (e.g., “gut microbiome AND immunity,” “dysbiosis AND inflammation AND chronic diseases,” “microbiome AND autoimmune diseases,” “gut-brain axis AND immunity,” among others). The inclusion criteria covered research articles (clinical, observational, and experimental in humans and animal models), systematic reviews, meta-analyses, and narrative reviews published in Q1–Q2 indexed journals, available in English or Spanish, and explicitly addressing the microbiome-immunity interaction, the effects of dysbiosis, or microbial modulation strategies. Publications not subject to peer review, studies with insufficient samples, duplicate articles, works focused exclusively on microbial taxonomy without an immunological relationship, and editorial-type documents or technical notes without complete data were excluded. The selection process involved identifying 3264 initial records, screening titles and abstracts to leave 587 preselected articles, and reviewing the full text to result in 180 included studies. A standardized template was used to extract information, collecting variables on design, population, microbial alterations, metabolites involved, immunological mechanisms, and main findings. The synthesis of evidence was structured around five thematic areas: microbial signaling and immune recognition; microbial metabolites and immunoregulation; epithelial barrier integrity and immune homeostasis; dysbiosis and its relationship with inflammatory, autoimmune, metabolic, neurological, and infectious diseases; and finally, therapeutic and translational perspectives, including probiotics, prebiotics, postbiotics, fecal transplantation, immunotherapy, and personalized medicine. The organization of the content combined a progressive narrative, comparative tables, and conceptual figures illustrating key mechanisms, while the critical analysis prioritized methodological quality, consistency, and level of evidence of the studies, highlighting convergences, discrepancies, and possible hypotheses for future research. 2.2. Composition and Function of the Human Microbiome The human microbiome is defined as a dynamic community of microorganisms that colonizes various surfaces and cavities of the human body. This complex biological network is composed of bacteria, archaea, fungi, viruses, and certain eukaryotes, which interact symbiotically with the host, establishing relationships that range from mutualism and commensalism to, in some contexts, opportunistic pathogenicity [ 2 12 Current scientific evidence acknowledges its active participation in the maturation and regulation of the immune system, protection against pathogens, maintenance of immune tolerance, and modulation of inflammatory responses [ 13 14 Microbial composition and diversity vary substantially among individuals and are shaped by genetic, dietary, environmental, and behavioral factors [ 15 Maintaining a dynamic balance between these microbial communities and their physiological environment is essential for preserving the overall homeostasis of the organism. Disruptions to this equilibrium, known as dysbiosis, have been associated with a wide range of diseases, including gastrointestinal disorders, autoimmune diseases, metabolic syndromes, and neuropsychiatric conditions [ 16 17 2.3. Main Microbial Niches in the Human Body 2.3.1. Gut Microbiome The human gut harbors the densest and most diverse microbial community in the body, forming a complex ecosystem composed of trillions of microorganisms from thousands of species. Among the most representative bacterial phyla are Firmicutes Bacteroidetes 14 Faecalibacterium Clostridium Lactobacillus Bacteroidetes 18 The functional composition of the gut microbiome is highly plastic and responsive to various influences, with diet being one of the most critical modulatory factors. Changes in fiber intake, macronutrient distribution, or consumption of bioactive compounds can alter the abundance of microbial groups and their associated metabolic pathways [ 18 19 18 2.3.2. Skin Microbiome The skin, as the body’s primary physical barrier to the external environment, hosts microbial communities adapted to diverse microenvironments defined by local factors such as moisture, pH, sebum secretion, temperature, and cellular desquamation. Dominant phyla include Actinobacteria, Firmicutes, Proteobacteria, and Bacteroidetes [ 20 Corynebacterium Staphylococcus Firmicutes Pseudomonas Proteobacteria 21 The skin microbiome not only provides physical protection but also plays a critical immunological role: it competes with pathogens for nutrients and adhesion sites, produces antimicrobial substances, and modulates both innate and adaptive immune responses [ 22 21 2.3.3. Vaginal Microbiome Unlike other microbial niches, the vaginal microbiome is characterized by relatively low microbial diversity but highly specialized and dynamic functions. In healthy women of reproductive age, species from the Lactobacillus L. crispatus L. gasseri L. iners L. jensenii 17 23 Lactobacillus Gardnerella vaginalis 24 2.3.4. Oral Microbiome The oral cavity constitutes one of the most complex ecosystems in the human body, comprising multiple microhabitats, including the tongue, gums, palate, and dental surfaces, that host a rich and diverse microbial community [ 25 Firmicutes Actinobacteria Bacteroidetes Proteobacteria Fusobacteria 15 Streptococcus Actinomyces Prevotella Veillonella A central feature of the oral microbiome is its ability to form structured biofilms, such as dental plaque, where microorganisms coexist in a complex extracellular matrix, engaging in both cooperative and competitive interactions [ 26 27 28 2.3.5. Saliva Saliva plays a crucial role in shaping the oral ecosystem by providing nutrients, antimicrobial enzymes such as lysozyme and lactoperoxidase, and supporting the clearance of non-adherent microorganisms [ 25 − 26 27 2.3.6. Role of the Microbiome in Metabolism, Protective Effects, and Trophic Function The human microbiome performs essential metabolic functions that complement the physiological capabilities of the host. In particular, the gut microbiome stands out for its ability to degrade compounds that escape digestion in the small intestine, such as complex polysaccharides and dietary fiber. Through anaerobic fermentation, these bacteria produce short-chain fatty acids (SCFAs; including butyrate, propionate, and acetate), which serve multiple important functions [ 29 30 The gut microbiome contributes to the biosynthesis of essential micronutrients. Among the most notable are vitamin K (critical for coagulation) and several B-complex vitamins, which play enzymatic roles in energy metabolism and neurological function [ 31 From an immunological perspective, the microbiome provides protective effects against colonization by pathogenic microorganisms. It achieves this through mechanisms such as competition for nutrients and ecological niches, production of antimicrobial compounds (e.g., bacteriocins), and stimulation of local immune responses that strengthen mucosal defenses [ 22 32 33 Due to its metabolic and defensive functions, the microbiome plays a crucial trophic role in the development and maintenance of the gastrointestinal tract. Fermentation products not only nourish epithelial cells but also promote their proliferation, differentiation, and repair, thereby preserving intestinal mucosal integrity [ 14 34 Structural components of the microbiome, such as lipopolysaccharides (LPS) and peptidoglycans, are recognized by innate immune receptors (such as Toll-like receptors), triggering signaling cascades that lead to the production of cytokines and immunological mediators. This constant interaction between the microbiome and local immunity is essential for maintaining a functional equilibrium that supports host protection while preventing inappropriate immune responses [ 2 2.3.7. Development of the Immune System and Its Interaction with the Microbiome The human immune system does not emerge spontaneously or in isolation; rather, its development is a dynamic, sequential, and tightly regulated process. It begins during intrauterine life and continues to mature throughout infancy, adolescence, and even into adulthood. A fundamental player in this process is the microbiome, a complex and diverse ecosystem of microorganisms that colonizes the human body, particularly the gastrointestinal tract, from the earliest stages of life [ 35 36 During the early years of life, this symbiotic interaction shapes the architecture and function of both primary and secondary lymphoid organs, influences the differentiation and activation of multiple immune cell populations, and lays the foundation for robust, adaptable, and long-lasting immunity [ 37 38 Recent scientific evidence has begun to unravel the complexity of this connection, revealing that imbalances in the composition or function of the early microbiome can have lasting repercussions on immune health, increasing susceptibility to inflammatory, allergic, autoimmune, and even metabolic diseases [ 39 A deeper understanding of this molecular dialogue between host and microbiome not only enriches our view of immune development but also opens the door to innovative interventions, such as targeted probiotics, diet-based modulation, and birth or breastfeeding strategies aimed at promoting optimal immune health from the very first days of life. 2.4. Microbial Colonization at Birth Microbial colonization of the new-born marks a fundamental biological event that initiates a complex symbiotic relationship between the human host and microorganisms, with long-lasting implications for immune development and lifelong health [ 40 41 In vaginal deliveries, the newborn is exposed to the maternal birth canal microbiome, predominantly comprising Lactobacillus Prevotella Sneathia 42 43 Neonatal microbiome formation is not a static event but rather a dynamic, ongoing process influenced by several postnatal factors, including mode of delivery, feeding type (exclusive breastfeeding vs. formula), early antibiotic exposure, hygiene conditions, and household environment [ 44 45 Bifidobacterium Lactobacillus 39 This initial colonization process establishes a continuous and bidirectional dialogue with the immature immune system. Microbiome-derived molecular signals guide immune cell differentiation and activation, foster immunological tolerance, and prepare the organism for future responses to external agents [ 35 2.5. Maturation of the Innate and Adaptive Immune System The maturation of the human immune system is profoundly influenced by constant and multifaceted interactions with the microbiome, a symbiotic relationship essential for both innate and adaptive immunity [ 36 46 These interactions activate complex intracellular signaling networks that trigger the production of both pro- and anti-inflammatory cytokines, chemokines, and other effector molecules. In turn, these mediators finally modulate the inflammatory response at both local and systemic levels, ensuring a rapid and effective defense against pathogens while avoiding excessive or chronic inflammation. Structurally, the presence and diversity of the microbiome influence the development and organization of secondary lymphoid organs such as Peyer’s patches and mesenteric lymph nodes—critical sites for the activation and regulation of adaptive immune responses [ 37 47 A key component of this immune machinery is the development of regulatory T cells (Tregs), which are essential for maintaining immune tolerance and preventing autoimmune or uncontrolled inflammatory reactions [ 48 36 Moreover, the microbiome plays a critical role in the induction and maintenance of secretory immunoglobulin A (IgA) in the intestinal mucosa. This immunoglobulin serves as a first-line immune barrier, neutralizing pathogens and selectively shaping the composition of the commensal microbiota, thereby contributing to intestinal homeostasis [ 46 However, disruption of this balance, known as dysbiosis, during the early years of life can significantly impair immune maturation. Various studies have linked early-life dysbiosis to an increased incidence of immune-mediated conditions such as allergies, asthma, inflammatory bowel diseases, and autoimmune disorders [ 47 49 50 The continuous dialogue between the microbiome and the immune system is not only indispensable for establishing effective immunity but also for maintaining the fine regulation required to prevent inappropriate immune responses, safeguarding health from infancy through adulthood. 2.6. Critical Window During Infancy Early childhood represents a critical developmental window during which the microbiome plays a decisive role in the maturation of the immune system, with repercussions that may persist throughout life [ 49 35 During this phase, the composition, diversity, and stability of the emerging gut microbiota not only reflect the child’s immediate environment but also serve as essential modulators of immune development [ 51 6 However, various perinatal and environmental factors can disrupt this initial colonization process and thereby influence the individual’s immunological trajectory. These include caesarean delivery, which limits exposure to the maternal vaginal microbiota; formula feeding, which lacks many of the immunomodulatory components present in breast milk; early use of broad-spectrum antibiotics, which can cause persistent dysbiosis; and reduced contact with beneficial environmental microbes due to overly sanitized lifestyles [ 18 52 Current research is focused on elucidating the molecular and cellular mechanisms through which the microbiome shapes the immune system during this critical developmental window [ 36 Bifidobacterium Lactobacillus 39 Recognition of this period as a critical window for establishing optimal immune health has significant implications for pediatric and perinatal clinical practice. Designing public health policies and early intervention strategies focused on preserving and promoting a healthy microbiome may prove to be a key tool in reducing the incidence of immune-mediated diseases and improving long-term health outcomes across the life course [ 21 Communication Mechanisms Between the Microbiome and the Immune System The relationship between the human microbiome and the immune system is grounded in a highly complex and finely regulated bidirectional communication network that is essential for maintaining host homeostasis. This dynamic interaction not only influences the maturation and functionality of the immune system but also enables precise discrimination between commensal microorganisms and pathogens, allowing for efficient protective responses without compromising tissue integrity or inducing chronic inflammation [ 53 54 From the earliest stages of development, the microbiome plays a fundamental educational role by promoting immune tolerance toward symbionts and harmless environmental antigens, while enhancing the immune system’s ability to recognize and eliminate potential threats. This continuous communication is mediated by specific molecular signals that serve as bridges between microbial components and host immune cells, enabling effective and adaptive immunological regulation [ 34 53 55 34 56 2.7. Microbial Signaling: MAMPs, PRRs, and TLRs The immune system has evolved to recognize and respond effectively to microorganisms through highly conserved mechanisms that detect specific molecular structures. This recognition represents the first link in the complex communication network between the host and its microbiome and is fundamental for maintaining immune homeostasis and preventing uncontrolled inflammatory responses. This communication is based on the recognition of microbe-associated molecular patterns (MAMPs), conserved microbial structures detected by specialized receptors of the innate immune system known as pattern recognition receptors (PRRs). Among these, Toll-like receptors (TLRs) stand out as key components of immune surveillance, with well-documented roles in both physiological and pathological contexts [ 55 MAMPs are highly conserved structural components of bacteria, viruses, and fungi, such as lipopolysaccharides (LPS), peptidoglycans, flagellin, lipoteichoic acids, and microbial nucleic acids. Unlike classical virulence factors, MAMPs do not necessarily indicate an active infection but are enough to trigger immune responses through PRR-mediated recognition by innate immune cells [ 57 PRRs are expressed by immune cells such as macrophages, dendritic cells, epithelial cells, and certain B lymphocytes and are located on the cell membrane, in endosomal compartments, or in the cytoplasm. Among them, TLRs have been extensively studied for their central role in immune surveillance and regulation of tolerance toward the commensal microbiota [ 58 58 TLR activation triggers intracellular signaling cascades that ultimately activate transcription factors such as NF-κB, IRF3, and IRF7, which drive the expression of pro-inflammatory cytokines, type I interferons, and other immune mediators [ 59 60 In the intestinal mucosa, where exposure to MAMPs is continuous, TLRs play diverse roles beyond defense. They promote the production of antimicrobial peptides, enhance epithelial tight junction integrity, and stimulate secretory IgA production, thus reinforcing the intestinal barrier without inducing excessive inflammation [ 61 62 34 To TLRs, NOD1 and NOD2 represent cytoplasmic PRRs with complementary functions. These receptors recognize bacterial peptidoglycan fragments and cooperate with TLRs to modulate immune responses [ 62 63 Together, signaling mediated by MAMPs, PRRs, and TLRs enables the detection and elimination of pathogenic microorganisms while also playing a key role in establishing immune tolerance and maintaining a harmonious relationship with the commensal microbiota. The precision and regulation of these processes largely determine the balance between health and disease within the microbiome–immune axis. 2.7.1. Microbial Metabolites, Tregs and the Intestinal Barrier as Pillars of the Microbiome–Immunity–Homeostasis Axis A growing body of evidence highlights the pivotal role of microbial-derived metabolites as immunomodulatory mediators at the host–microbiota interface. These bioactive compounds, synthesized by commensal bacteria through fermentation and biochemical transformations, influence both innate and adaptive immune pathways. Among the most studied are short-chain fatty acids (SCFAs), indoles, secondary bile acids, and microbial vitamins, each exerting specific effects on immune cells and epithelial function through receptor-mediated signaling or epigenetic modulation [ 64 65 66 Among these metabolites, SCFAs—mainly acetate, propionate, and butyrate—represent the most relevant immunoregulatory molecules. They are end-products of bacterial fermentation of non-digestible dietary fibers and are found in high concentrations in the colon, where they perform multiple functions [ 67 68 69 70 21 71 72 73 74 The importance of SCFAs in immunoregulation also lies in their ability to promote tolerance and homeostasis through cross-talk with other microbial metabolites. Tryptophan-derived indoles, kynurenic acid, and serotonin influence mucosal immunity by engaging the AhR/IL-22 pathway, which is crucial for maintaining epithelial integrity, inducing antimicrobial peptide synthesis, and promoting tissue repair [ 75 76 77 78 79 80 Bifidobacterium adolescentis 81 82 In this context, Tregs emerge as a central component in orchestrating immune tolerance within the microbiome–immunity axis. These cells, crucial for preventing uncontrolled inflammation and autoimmune reactions, are strongly influenced by microbial metabolites such as SCFAs. Butyrate, in particular, enhances Treg differentiation and function via HDAC inhibition and GPR43/GPR109A receptor activation, inducing a transcriptional program that favors the secretion of anti-inflammatory cytokines such as IL-10 and TGF-β [ 69 73 83 84 85 The interplay between microbial metabolites, Tregs, and epithelial barrier integrity is crucial, as the intestinal barrier represents the first line of defense between the host’s internal milieu and the microbiota-rich lumen. This barrier is not only a physical wall preventing pathogen translocation but also an active immunological organ that integrates signals from the microbiome [ 53 84 86 86 87 88 89 SCFAs, particularly butyrate, directly enhance epithelial integrity by upregulating tight junction proteins through the HIF-1α pathway [ 90 21 91 92 Akkermansia muciniphila 93 83 94 95 96 Altogether, the integration of SCFAs, Treg modulation, and epithelial barrier integrity defines the microbiome–immunity–homeostasis axis. This axis functions as a feedback loop: microbial metabolites promote Treg induction and epithelial health, while the immune system and barrier mechanisms shape microbial composition and metabolite production. When this balance is preserved, it ensures tolerance, pathogen defense, and systemic equilibrium. Conversely, its disruption by genetic, dietary, or environmental factors leads to dysbiosis, chronic inflammation, and immune-mediated diseases ranging from IBD and metabolic syndrome to neuropsychiatric and autoimmune disorders [ 84 85 97 98 99 100 101 102 2.7.2. How Microbiome–Immune System Synergy Maintains Physiological Balance? The physiological balance of the human body depends largely on the synergistic interaction between the intestinal microbiome and the host immune system. This symbiotic relationship not only enables constant immune surveillance but also ensures finely tuned responses against pathogens while maintaining tolerance toward commensal microorganisms and dietary antigens. In this way, intestinal homeostasis emerges as the result of a complex, bidirectional molecular dialogue in which the microbiome and immune system co-regulate to preserve epithelial integrity, barrier function, and a balanced immune response. Recent research has shown that the microbiome is not merely a passive barrier against external agents but also an active modulator of immunity. A central element in this interaction is the role of microbial metabolites, particularly short-chain fatty acids (SCFAs). These fermentation products of dietary fibers directly influence the differentiation and function of immune cells, especially regulatory T cells (Tregs), which are key for inducing immune tolerance and preventing exaggerated inflammatory responses [ 103 Moreover, communication between the microbiome and the immune system is mediated by the regulated activation of pattern recognition receptors (PRRs), including Toll-like receptors (TLRs) and NOD-like receptors (NLRs). Their activation enables the immune system to detect specific microbial signals and modulate its responses accordingly. As a result, anti-inflammatory cytokines such as IL-10 and TGF-β are produced, alongside antimicrobial peptides, contributing to intestinal barrier strengthening and limiting local inflammation [ 63 The intestinal epithelium also plays a critical role in this functional synergy. Far from being a passive barrier, epithelial cells actively respond to microbial signals by secreting mucus, renewing the mucosal layer, and producing immunomodulatory factors. Epithelial integrity is essential to prevent bacterial translocation and uncontrolled immune activation, which could lead to systemic inflammatory processes [ 73 Notably, this microbiome–immune cooperation is dynamic and adaptive, particularly during early life. Gut colonization in the first days after birth is crucial for immune system maturation, directly influencing susceptibility to allergic and autoimmune diseases later in life. Early exposure to a diverse microbiome promotes the development of tolerant and functional immunity, as demonstrated in multiple studies on neonates [ 104 Furthermore, this synergy extends beyond the intestine and impacts systemic immunity. Immune cells trained by microbial signals can migrate to other tissues and continue performing immune surveillance functions. This interconnection explains how disruptions in gut microbial composition can trigger distant effects associated with autoimmune, metabolic, and even neurological diseases [ 105 Maintaining physiological balance thus requires a continuous and harmonious dialogue between the microbiome and the immune system. This interaction not only ensures protection against pathogens but also supports immune tolerance, preserves tissue integrity, and regulates inflammation. Loss of this synergy, due to dysbiosis, environmental factors, or genetic predisposition, may result in chronic inflammatory diseases, underscoring the clinical and therapeutic importance of preserving and modulating this interaction [ 106 2.7.3. Response to Pathogens vs. Immune Tolerance The immune system faces a fundamental challenge: it must recognize and eliminate potentially harmful pathogens while avoiding inflammatory responses against commensal microorganisms or harmless dietary antigens. This functional duality is essential for maintaining intestinal and systemic homeostasis, and it relies on a complex network of regulatory mechanisms that allow the immune system to discriminate between real threats and benign stimuli, thus preventing tissue damage and autoimmune disorders. Defense against pathogens begins with the detection of pathogen-associated molecular patterns (PAMPs) through pattern recognition receptors such as TLRs and NLRs. This initial activation triggers intracellular signaling cascades that culminate in the production of pro-inflammatory cytokines (including IL-1β, TNF-α, and IL-6) and the recruitment of innate and adaptive immune cells, such as macrophages, neutrophils, dendritic cells, and effector T cells [ 89 However, the same immune machinery that fights infections must simultaneously maintain tolerance to the resident microbiota, which plays essential roles in digestion, metabolite production, and competitive defense against pathogens. This immune tolerance is primarily mediated by regulatory T cells (Tregs), whose activity is promoted by anti-inflammatory cytokines like IL-10 and TGF-β, creating a controlled immune environment in the intestinal mucosa [ 107 A key player in this regulation is the mucosal dendritic cell, which can present antigens in a context-dependent manner. When sampling commensal or dietary antigens in the absence of danger signals, these cells promote tolerance induction by stimulating Treg expansion and enhancing secretory IgA (sIgA) production. This immunoglobulin acts as a non-inflammatory barrier, limiting direct bacterial–epithelial interaction [ 90 Microbiome-derived metabolites, particularly SCFAs, play a central role in promoting tolerance. Butyrate, for example, enhances Treg suppressive function and helps maintain epithelial barrier integrity, thereby reducing susceptibility to chronic inflammation [ 92 This delicate balance between pro-inflammatory and tolerogenic signals depends heavily on the composition and metabolic activity of the intestinal microbiome. When this equilibrium is disrupted (by dysbiosis, infection, medication, or epithelial damage), the immune system may become inappropriately activated, triggering chronic inflammation that contributes to conditions such as ulcerative colitis, Crohn’s disease, food allergies, and autoimmune disorders [ 91 In these scenarios, uncontrolled immune activation and loss of tolerance fuel an inflammatory cycle that perpetuates local tissue damage and may have systemic consequences. In contrast, while the immune response to pathogens involves the formation of immunological memory for future protection, immune tolerance is an ongoing, adaptable process that must constantly adjust to changes in the microbiota and dietary inputs [ 93 An additional dimension to this regulation has been identified in the neuroimmune interface. The enteric nervous system, through neurotransmitters and neuromodulators, participates in the modulation of intestinal immunity. These signals can influence both epithelial permeability and immune cell activity, demonstrating that immune equilibrium is also subject to cross-talk between the nervous and immune systems [ 94 2.7.4. Dysbiosis and Its Immunological Consequences Dysbiosis is defined as an imbalance in the composition and function of the microbiome, particularly within the gastrointestinal tract, that disrupts the symbiotic relationship between the host and its microbial communities. This phenomenon plays a critical role in immune system dysregulation, affecting both innate and adaptive immunity, and is associated with the onset and perpetuation of numerous inflammatory, autoimmune, and metabolic diseases. Under healthy conditions, the intestinal microbiota performs essential functions in the maturation and regulation of the immune system. These include the induction of immune tolerance toward commensal antigens and protection against pathogens through niche competition and the production of beneficial metabolites. However, when this balance is disrupted, the loss of key bacterial species, alongside the expansion of potentially pathogenic microorganisms, leads to a pro-inflammatory state characteristic of dysbiosis [ 83 One of the most significant consequences of dysbiosis is the compromise of the intestinal epithelial barrier, a key component of immune defense. Disruption of this barrier increases intestinal permeability—commonly referred to as “leaky gut”—which facilitates the translocation of bacteria and microbial products such as lipopolysaccharides (LPS) into the systemic circulation. This in turn triggers a widespread inflammatory response that can impact distant tissues and organs [ 95 On one hand, it alters the proportion and functionality of immune cells, including a reduction in regulatory T cells (Tregs), crucial for maintaining immune tolerance, and an increase in pro-inflammatory Th17 cells, which produce IL-17, a key cytokine in chronic inflammation [ 96 85 Moreover, an impoverished and imbalanced microbiota undermines mucosal immunity, reducing the production of antimicrobial peptides and secretory IgA antibodies, both of which are essential for protecting mucosal surfaces. This increases susceptibility to bacterial, viral, and fungal infections [ 84 The persistent stimulation of pattern recognition receptors (PRRs) by microbial products abnormally activates the innate immune system, perpetuating chronic inflammation. This mechanism has been implicated in a variety of conditions, including inflammatory bowel diseases, metabolic syndrome, and neuroinflammatory disorders such as multiple sclerosis and Alzheimer’s disease, underscoring the systemic immunological consequences of dysbiosis and its role in the gut–brain axis [ 97 Table 1 The composition of the intestinal microbiome has been shown to influence the effectiveness of immune-based therapies, particularly cancer immunotherapy. Specific microbial configurations have been associated with enhanced responses to immune checkpoint inhibitors, opening the door to personalized treatment strategies based on microbiome profiling [ 98 2.7.5. Microbiome Alterations and Inflammatory Diseases Among the most significant clinical manifestations of dysbiosis are inflammatory bowel diseases (IBD), particularly Crohn’s disease (CD) and ulcerative colitis (UC). These chronic disorders are characterized by persistent inflammation of the gastrointestinal tract, with a multifactorial etiology involving genetic, environmental, and immunological components. However, intestinal dysbiosis has emerged as a central factor in their pathogenesis ( Table 1 Genomic and metagenomic sequencing studies have shown that patients with IBD exhibit a marked reduction in bacterial diversity, particularly among beneficial members of the Firmicutes phylum, such as Faecalibacterium prausnitzii, a well-known anti-inflammatory bacterium and butyrate producer, a short-chain fatty acid essential for maintaining intestinal mucosal integrity [ 108 109 These microbial imbalances trigger dysregulated activation of both innate and adaptive immune responses. The abnormal interaction between a disturbed microbiota and pattern recognition receptors (PRRs), including Toll-like receptors (TLRs) and NOD-like receptors (NLRs), promotes excessive secretion of pro-inflammatory cytokines such as IL-1β, TNF-α, and IL-6, along with chemokines, fueling a chronic inflammatory loop that progressively damages the intestinal mucosa [ 110 At the immunological level, there is a clear imbalance in T cell regulation, characterized by a reduction in regulatory T cells (Tregs) (which impairs inflammation control) and an expansion of Th17 cells, which exacerbate inflammation via secretion of IL-17 and other cytokines [ 111 Furthermore, increased intestinal permeability, directly resulting from dysbiosis and epithelial damage, facilitates the translocation of luminal bacteria and antigens into the submucosal tissue. This translocation triggers local and systemic immune responses, further perpetuating disease progression [ 112 The consequences of these alterations are not limited to the gastrointestinal tract. It has been demonstrated that dysbiosis in IBD can contribute to systemic inflammation and affect extraintestinal organs, increasing the risk of arthritis, dermatitis, and hepatic diseases [ 28 In response to this complex scenario, therapeutic strategies aimed at restoring microbial homeostasis, such as fecal microbiota transplantation (FMT) and the use of specific probiotics, have shown promising results in inducing remission and controlling IBD symptoms. Nevertheless, the high interindividual variability of the microbiome and its complex interactions with the immune system demand personalized approaches to optimize therapeutic efficacy [ 113 2.7.6. Dysbiosis and Immune-Mediated, Neurological, and Infectious Diseases Systemic Lupus Erythematosus Systemic Lupus Erythematosus (SLE) is a complex systemic autoimmune disease characterized by the production of autoantibodies and multi-organ damage. SLE is both influenced by and contributes to gut microbiome dysbiosis. Altered microbial composition can trigger immune imbalance, promoting autoantibody production and systemic inflammation, while the chronic inflammation characteristic of SLE further disrupts beneficial microbial communities, creating a feedback loop that sustains disease progression [ 100 Firmicutes Bifidobacterium Faecalibacterium prausnitzii Lactobacillus Ruminococcus gnavus Enterococcus gallinarum 114 115 116 117 From an immunological perspective, the gut microbiota modulates the balance between regulatory T cells (Tregs) and pro-inflammatory T helper 17 (Th17) cells. In SLE, an expansion of Th17 cells and a reduction in Tregs have been reported, possibly influenced by alterations in microbiome composition [ 114 118 Animal studies have demonstrated that fecal microbiota transplantation (FMT) from SLE patients into germ-free mice induces hallmark disease features, including autoantibody production and renal inflammation, supporting a causal role for the microbiome in SLE pathogenesis [ 115 R. gnavus 114 Antiphospholipid Syndrome The antiphospholipid syndrome (APS) may be influenced by the gut microbiome through molecular mimicry, in which commensal bacteria activate autoreactive cells that induce the production of antiphospholipid autoantibodies [ 63 119 63 73 104 63 73 104 103 105 106 Multiple Sclerosis Multiple Sclerosis (MS) is an autoimmune disease of the central nervous system characterized by demyelination and chronic inflammation. Multiple sclerosis (MS) is both influenced by and contributes to gut microbiome dysbiosis. Altered microbial composition can trigger immune imbalance, promoting Th17-cell differentiation and inhibiting regulatory T cells (Tregs), while chronic inflammation characteristic of MS further disrupts beneficial microbial communities, creating a feedback loop that sustains disease progression. Recent studies have confirmed these interactions, highlighting the critical role of the gut microbiome in MS pathogenesis and suggesting potential therapeutic avenues targeting microbial modulation [ 120 103 121 122 Furthermore, the gut–brain axis plays a crucial role in the bidirectional communication between the intestine and central nervous system, influencing neuroinflammation through immune, hormonal, and neural signaling pathways [ 123 121 124 Rheumatoid Arthritis Rheumatoid arthritis (RA) is a chronic autoimmune disease primarily affecting the joints. Several studies have reported gut dysbiosis in RA patients, characterized by an increased abundance of bacteria such as Prevotella copri 125 126 127 82 128 129 Colorectal Cancer The gut microbiota is implicated in the progression of colorectal cancer (CRC) through its influence on inflammation and antitumor immune responses [ 130 131 84 132 While total microbial diversity may not significantly change, shifts in the abundance of major phyla—such as increased Bacteroidetes, Firmicutes, and Fusobacteria, and decreased Proteobacteria—have been observed [ 84 133 134 135 108 130 103 Allergic Diseases (Asthma and Atopic Dermatitis) Allergic diseases, including asthma and atopic dermatitis, are influenced by gut microbiome composition. Dysbiosis of the early-life gut microbiome predisposes individuals to allergic diseases by impairing immune maturation and SCFA production, while allergic inflammation and Th2 skewing further disrupt beneficial microbial communities, reinforcing the atopic phenotype [ 136 96 Bifidobacterium Faecalibacterium 137 87 Alzheimer’s Disease Alzheimer’s disease (AD), the leading cause of dementia, is characterized by β-amyloid plaques and tau neurofibrillary tangles in the brain. Gut dysbiosis promotes neuroinflammation, amyloid and tau pathology, and blood–brain barrier disruption in Alzheimer’s disease, while AD-related neurodegeneration further worsens microbial imbalance, establishing a bidirectional feedback loop [ 138 Escherichia Shigella Bifidobacterium Faecalibacterium prausnitzii 102 139 82 140 141 142 Parkinson’s Disease (PD) Parkinson’s Disease (PD) is a neurodegenerative disorder marked by progressive loss of dopaminergic neurons in the substantia nigra. The gut microbiota of PD patients exhibits significant alterations, including a reduction in butyrate-producing bacteria such as Faecalibacterium prausnitzii 134 143 108 144 145 143 Autism Spectrum Disorder Numerous studies have shown that children with ASD present a distinct gut microbiota, characterized by a reduction in beneficial genera such as Prevotella Coprococcus 134 137 143 103 143 108 144 139 145 146 108 137 102 145 Attention Deficit Hyperactivity Disorder (ADHD) Children with Attention Deficit Hyperactivity Disorder (ADHD) have been shown to exhibit an altered gut microbial composition compared to healthy individuals, suggesting a dysbiosis state with pathophysiological implications. A notable reduction in Faecalibacterium 127 142 147 148 149 150 Bifidobacterium 148 149 125 128 129 Schizophrenia Schizophrenia is associated with gut microbiome alterations, including reduced microbial diversity and a distinct bacterial profile compared to healthy controls [ 99 100 101 102 102 151 103 Depression Recent studies indicate that individuals with depression exhibit alterations in the gut microbiota, with a reduction in anti-inflammatory bacteria and an increase in pro-inflammatory species [ 101 102 152 Faecalibacterium prausnitzii Bifidobacterium 103 153 Escherichia Shigella 101 152 153 154 155 156 157 Lactobacillus Bifidobacterium 152 153 Anxiety The gut microbiota also plays a role in anxiety disorders. Dysbiosis, such as that induced by antibiotic use, may promote the growth of bacteria like Klebsiella oxytoca 158 159 63 160 161 162 163 164 165 Lactobacillus helveticus Bifidobacterium longum 165 166 167 168 Infectious Diseases The microbiota acts as a protective barrier by competing for ecological niches and nutrients and producing antimicrobial metabolites. However, dysbiosis weakens this defense, facilitating colonization by opportunistic pathogens. For instance, in recurrent Clostridioides difficile 103 109 110 148 111 156 Tuberculosis Alterations in both the pulmonary and intestinal microbiota play a key role in pulmonary tuberculosis (TB). Respiratory tract dysbiosis is associated with active TB and impacts host immune responses [ 28 112 113 Streptococcus Veillonella 28 102 139 114 115 114 116 117 139 115 116 117 Human Immunodeficiency Virus (HIV) HIV infection profoundly alters the gut microbiota, with increased microbial diversity and predominance of genera such as Prevotella 82 140 141 106 142 169 170 Faecalibacterium prausnitzii 171 73 140 106 microorganisms-13-02147-t001_Table 1 Table 1 Relationship between microbial dysbiosis and chronic diseases: Experimental and observational evidence. Disease Type of Study Microbial Alterations Immunological or Systemic Effects Reference  Alzheimer’s Disease Experimental, systematic review, and observational Decrease in Firmicutes Proteobacteria Bacteroidetes Increased β-amyloid plaques, activation of γ-secretase, systemic inflammation; blood biomarkers [ 109 110 111 112  Parkinson’s Disease Systematic, narrative, experimental, and human studies ↑ Lactobacillus Akkermansia Bifidobacterium Lachnospiraceae Faecalibacterium Neuroinflammation, gut–brain axis dysfunction, motor symptoms linked to dysbiosis [ 28 113 114 115  Colorectal Cancer Review and observational Decrease in Bacteroidetes Firmicutes Promotes invasion, metastasis, tumor inflammation, and response to chemotherapy [ 123 124  Autism Spectrum Disorder (ASD) Observational, metagenomic, functional, and reviews ↑ Lachnospiraceae Clostridiales Veillonella Alistipes Candida Faecalibacterium Prevotella Coprococcus Dysbiosis associated with GI and neurological symptoms; diagnostic prediction via microbiome [ 155 156 158 159  HIV/AIDS Observational, review, experimental ↑ Proteobacteria Prevotella Bacteroides Firmicutes Chronic immune activation, Th17 cell loss, GALT disruption, systemic inflammation [ 162 163 164 165  Schizophrenia Case-control, cross-sectional, cohort ↑ Collinsella Lactobacillus Faecalibacterium Anaerostipes Microbiota alteration associated with symptoms and metabolic syndrome; potential biomarker [ 142 169 170  Tuberculosis Observational, experimental, review ↓ Firmicutes Bifidobacterium Lactobacillus Proteobacteria Enterobacteriaceae Intestinal and pulmonary dysbiosis associated with inflammation, disease progression, and severity [ 130 131 168  Anxiety Experimental, review, clinical ↓ Lactobacillus Bifidobacterium Prevotella Proteobacteria Dysbiosis alters neurotransmitters like GABA, triggers inflammation and anxiety; improves with probiotics [ 152 153 171  Antiphospholipid Syndrome (APS) Experimental, observational, review ↓ Lactobacillus Firmicutes Enterobacteriaceae Bacteroides Immune activation, production of antiphospholipid antibodies, thrombosis [ 63 160 161 165 167  Asthma/Eczema Experimental, observational, review Dysbiosis in Firmicutes Bacteroidetes Proteobacteria S. aureus Prevotella Lactobacillus Associated with respiratory and dermal inflammation; severity modulated by microbiota [ 84 133 154  Systemic Lupus Erythematosus (SLE) Observational, experimental, systematic reviews ↓ Firmicutes Lactobacillus Clostridiales Bacteroidetes Proteobacteria Ruminococcus gnavus Enterococcus B and T cell activation, ↑ IL-6, IFN-γ, TNF-α, loss of immune tolerance, multi-organ damage [ 82 102 139 140 141 145  Crohn’s Disease/Ulcerative Colitis (IBD) Clinical, experimental, and systematic review studies ↓ Faecalibacterium prausnitzii Akkermansia Escherichia coli Clostridium leptum Reduced SCFA, increased pro-inflammatory cytokines, intestinal barrier disruption, exacerbated immune response [ 108 134 143 144  Irritable Bowel Syndrome (IBS) Clinical studies and reviews ↓ Lactobacillus Bifidobacterium Enterobacteriaceae Visceral hypersensitivity; low-grade inflammation [ 129  COPD (Chronic Obstructive Pulmonary Disease) Clinical and review ↓ Diversity; ↑ Haemophilus Moraxella Chronic inflammation; activation of macrophages and neutrophils [ 137 ↑ ↓ 2.7.7. Role of the Microbiome in Chronic Diseases: Obesity, Diabetes, and Cancer In recent years, growing evidence has positioned the gut microbiome as a central player in the pathophysiology of various non-communicable chronic diseases, including obesity, type 2 diabetes, and different types of cancer. These conditions share a common background characterized by low-grade chronic inflammation, in which dysbiosis plays a key role in perpetuating inflammatory and dysregulated metabolic processes. In this context, the study of microbiota-immune system interactions emerges as a crucial axis for understanding the biological basis of these diseases and for designing more effective therapeutic strategies. In obesity, numerous studies have documented substantial differences in the composition and function of the gut microbiome between overweight individuals and those with a normal body mass index. Notably, a decrease in microbial diversity and a relative increase in the Firmicutes-to-Bacteroidetes ratio have been observed. This imbalance favors enhanced energy harvest from the diet and promotes lipid storage, thus contributing to the development and maintenance of the obesogenic state [ 121 103 In type 2 diabetes, the gut microbiota has been shown to influence not only chronic inflammation but also the regulation of incretin hormones and the function of insulin-producing pancreatic cells. Importantly, diabetic patients exhibit a lower abundance of butyrate-producing bacteria, short-chain fatty acids with anti-inflammatory and immune-modulating properties, which further exacerbates existing metabolic dysfunction [ 122 The relationship between the microbiome and cancer is more complex and multifactorial. Current evidence suggests that certain bacterial communities may promote carcinogenesis through mechanisms such as chronic inflammation, production of genotoxic metabolites, and alteration of the tumor microenvironment. A paradigmatic example is colorectal cancer, where an overabundance of Fusobacterium nucleatum has been identified. This bacterium enhances local inflammation, disrupts cellular apoptosis, and stimulates tumor cell proliferation [ 123 124 126 Collectively, these findings highlight the relevance of the microbiome as a systemic modulator of metabolic and immune health. Therefore, studying the microbiome not only deepens our understanding of chronic diseases but also offers a promising platform for the development of personalized interventions, such as therapeutic diets, probiotics, prebiotics, or even fecal microbiota transplantation, that could significantly improve the prevention and treatment of these conditions. 3. Therapeutic Perspectives 3.1. Microbiome Profiles and Personalized Medicine Microbial profiling represents a fundamental tool in precision medicine, enabling the understanding of how microbiome composition and function influence a patient’s response to various treatments. This perspective is particularly valuable in immunological diseases, certain types of cancer, and metabolic disorders [ 82 In oncology, for instance, it has been observed that the response to immunotherapies, such as immune checkpoint inhibitors, varies significantly depending on the gut microbiome. Species such as Akkermansia muciniphila Faecalibacterium prausnitzii 169 170 3.2. Current Challenges and Future Research Directions The interaction between the human microbiome and the immune system has emerged as one of the most transformative discoveries in 21st-century biology, profoundly transforming our understanding of human physiology and the origin of numerous diseases, with evidence showing that the gut microbiota performs fundamental roles in immune regulation, maintenance of epithelial integrity, and systemic homeostasis, while dysbiosis can trigger clinically relevant consequences in infectious, chronic, autoimmune, oncological, and neurological diseases [ 41 158 140 141 167 168 142 168 Clostridioides difficile 167 168 blaNDM-1 mcr-1 63 160 161 Bacteroides 124 126 Escherichia coli 172 173 174 162 163 164 159 165 166 84 133 108 135 152 153 156 152 153 4. Conclusions The human microbiome has been established as an essential regulator of immunity, epithelial integrity, and systemic homeostasis. Its balance is fundamental to host health, while its dysbiosis has been linked to inflammatory, autoimmune, metabolic, and neurodegenerative diseases. This review reaffirms the microbiome as a functional organ, capable of modulating immune responses, generating bioactive metabolites, emitting molecular signals, and maintaining the integrity of the intestinal mucosal barrier. Recent advances in technologies, including CRISPR-Cas and omics platforms, have enabled more specific interventions, paving the way for precision microbiology with a therapeutic focus. Microbiome-based strategies, including symbiotic, FMT, probiotics, and microbial metabolites, represent promising avenues for personalized therapeutic approaches. The identification of microbial profiles as diagnostic and prognostic biomarkers further strengthens personalized strategies, allowing anticipation of disease progression and optimization of treatment responses, including immunotherapies and gut–brain axis interventions. Nevertheless, gaps remain in understanding interactions between the microbiota, host genetics, diet, and environment, as well as in standardization of clinical protocols and ethical and regulatory frameworks. Full integration of the microbiome into medicine requires overcoming these challenges through interdisciplinary, longitudinal, and personalized approaches, ultimately enabling predictive, preventive medicine grounded in the ecological and molecular complexity of the human being. Acknowledgments Ailín Martínez would like to thank the Doctoral Program in Science major in Applied Cellular and Molecular Biology, Universidad de La Frontera, and National Doctoral Scholarship ANID N° 21231033. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.C., A.M. and E.A.P.; research, M.C., P.O., A.M. and G.H.; methodology, J.Q., R.D. and R.R.; resources, J.Q. and R.D.; supervision, J.Q., R.D. and N.S.; writing—original draft, M.C., A.M., R.R. and J.Q.; writing—review and editing, M.C., J.Q., R.R., P.O., A.M., R.D., E.A.P. and N.S. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations TLR Toll-like receptor SCFA Short-chain fatty acid PRR Pattern recognition receptor AMP Microbe-associated molecular pattern References 1. Hill C.J. Lynch D.B. Murphy K. Ulaszewska M. Jeffery I.B. O’Shea C.A. Watkins C. Dempsey E. Mattivi F. Tuohy K. Evolution of gut microbiota composition from birth to 24 weeks in the INFANTMET Cohort Microbiome 2017 5 4 10.1186/s40168-016-0213-y 28095889 PMC5240274 2. Gotschlich E.C. Colbert R.A. Gill T. Methods in microbiome research: Past, present, and future Best Pract. Res. Clin. Rheumatol. 2019 33 101498 10.1016/j.berh.2020.101498 32340923 PMC7299794 3. Smith C.H. Complex regulatory effects of gut microbial short-chain fatty acids on immune tolerance and autoimmunity Cell. Mol. Immunol. 2023 20 341 350 10.1038/s41423-023-00987-1 36854801 PMC10066346 4. Gutierrez-Arcelus M. Rich S.S. Raychaudhuri S. Autoimmune diseases—Connecting risk alleles with molecular traits of the immune system Nat. Rev. Genet. 2016 17 160 174 10.1038/nrg.2015.33 26907721 PMC4896831 5. Nurgaziyev M. Issilbayeva A. Bersimbaev R. Ilderbayev O. Vinogradova E. Jarmukhanov Z. Nurgozhina A. Sergazy S. Kozhabergen N. Akhmetova Z. Gut microbiome-immune interactions and their role in rheumatoid arthritis development PeerJ 2024 12 e17477 10.7717/peerj.17477 39006008 PMC11246623 6. Stefanski A.-L. Dörner T. Immune checkpoints and the multiple faces of B cells in systemic lupus erythematosus Curr. Opin. Rheumatol. 2021 33 592 597 10.1097/BOR.0000000000000825 34402453 7. Van Mourik D.J.M. Salet D.M. Middeldorp S. Nieuwdorp M. van Mens T.E. The role of the intestinal microbiome in antiphospholipid syndrome Front. Immunol. 2022 13 954764 10.3389/fimmu.2022.954764 36505427 PMC9732728 8. Pant A. Das B. Arimbasseri G.A. Host microbiome in tuberculosis: Disease, treatment, and immunity perspectives Front. Microbiol. 2023 14 10.3389/fmicb.2023.1236348 37808315 PMC10559974 9. Ishizaka A. Koga M. Mizutani T. Parbie P.K. Prawisuda D. Yusa N. Sedohara A. Kikuchi T. Ikeuchi K. Adachi E. Unique Gut Microbiome in HIV Patients on Antiretroviral Therapy (ART) Suggests Association with Chronic Inflammation Microbiol. Spectr. 2021 9 e0070821 10.1128/Spectrum.00708-21 34378948 PMC8552706 10. Cryan J.F. O’Riordan K.J. Cowan C.S.M. Sandhu K.V. Bastiaanssen T.F.S. Boehme M. Codagnone M.G. Cussotto S. Fulling C. Golubeva A.V. The Microbiota-Gut-Brain Axis Physiol. Rev. 2019 99 1877 2013 10.1152/physrev.00018.2018 31460832 11. Liu A.T. Chen S. Jena P.K. Sheng L. Hu Y.Y. Wan Y.-J.Y. Probiotics Improve Gastrointestinal Function and Life Quality in Pregnancy Nutrients 2021 13 3931 10.3390/nu13113931 34836186 PMC8624890 12. Afzaal M. Saeed F. Shah Y.A. Hussain M. Rabail R. Socol C.T. Hassoun A. Pateiro M. Lorenzo J.M. Rusu A.V. Human gut microbiota in health and disease: Unveiling the relationship Front. Microbiol. 2022 13 999001 10.3389/fmicb.2022.999001 36225386 PMC9549250 13. Lloyd-Price J. Arze C. Ananthakrishnan A.N. Schirmer M. Avila-Pacheco J. Poon T.W. Andrews E. Ajami N.J. Bonham K.S. Brislawn C.J. Multi-omics of the gut microbial ecosystem in inflammatory bowel diseases Nature 2019 569 655 662 10.1038/s41586-019-1237-9 31142855 PMC6650278 14. Huttenhower C. Gevers D. Knight R. Abubucker S. Badger J.H. Chinwalla A.T. Human Microbiome Project Consortium Structure, function and diversity of the healthy human microbiome Nature 2020 486 207 214 10.1038/nature11234 PMC3564958 22699609 15. Logan A.C. Jacka F.N. Craig J.M. Prescott S.L. The Microbiome and Mental Health: Looking Back, Moving Forward with Lessons from Allergic Diseases Clin. Psychopharmacol. Neurosci. Off. Sci. J. Korean Coll. Neuropsychopharmacol. 2016 14 131 147 10.9758/cpn.2016.14.2.131 27121424 PMC4857870 16. Lewis J.D. Chen E.Z. Baldassano R.N. Otley A.R. Griffiths A.M. Lee D. Bittinger K. Bailey A. Friedman E.S. Hoffmann C. Inflammation, Antibiotics, and Diet as Environmental Stressors of the Gut Microbiome in Pediatric Crohn’s Disease Cell Host Microbe 2015 18 489 500 10.1016/j.chom.2015.09.008 26468751 PMC4633303 17. Paul J.K. Azmal M. Haque A.S.N.B. Meem M. Talukder O.F. Ghosh A. Unlocking the secrets of the human gut microbiota: Comprehensive review on its role in different diseases World J. Gastroenterol. 2025 31 99913 10.3748/wjg.v31.i5.99913 39926224 PMC11718612 18. Langdon A. Crook N. Dantas G. The effects of antibiotics on the microbiome throughout development and alternative approaches for therapeutic modulation Genome Med. 2016 8 39 10.1186/s13073-016-0294-z 27074706 PMC4831151 19. Grice E.A. Segre J.A. The skin microbiome Nat. Rev. Microbiol. 2011 9 244 253 10.1038/nrmicro2537 21407241 PMC3535073 20. Zhang X.E. Zheng P. Ye S.Z. Ma X. Liu E. Pang Y.B. He Q.Y. Zhang Y.X. Li W.Q. Zeng J.H. Microbiome: Role in Inflammatory Skin Diseases J. Inflamm. Res. 2024 17 1057 1082 10.2147/JIR.S441100 38375021 PMC10876011 21. Mauro D. Nakamura A. Haroon N. Ciccia F. The gut-enthesis axis and the pathogenesis of Spondyloarthritis Semin. Immunol. 2021 58 101607 10.1016/j.smim.2022.101607 35850909 22. Ojala T. Kankainen M. Castro J. Cerca N. Edelman S. Westerlund-Wikström B. Paulin L. Holm L. Auvinen P. Comparative genomics of Lactobacillus crispatus suggests novel mechanisms for the competitive exclusion of Gardnerella vaginalis BMC Genom. 2014 15 1070 10.1186/1471-2164-15-1070 PMC4300991 25480015 23. Han Y. Liu Z. Chen T. Role of Vaginal Microbiota Dysbiosis in Gynecological Diseases and the Potential Interventions Front. Microbiol. 2021 12 643422 10.3389/fmicb.2021.643422 34220737 PMC8249587 24. Lamont R.J. Koo H. Hajishengallis G. The oral microbiota: Dynamic communities and host interactions Nat. Rev. Microbiol. 2018 16 745 759 10.1038/s41579-018-0089-x 30301974 PMC6278837 25. Bowen W.H. Burne R.A. Wu H. Koo H. Oral Biofilms: Pathogens, Matrix, and Polymicrobial Interactions in Microenvironments Trends Microbiol. 2018 26 229 242 10.1016/j.tim.2017.09.008 29097091 PMC5834367 26. Zhang Y. Wang X. Li H. Ni C. Du Z. Yan F. Human oral microbiota and its modulation for oral health Biomed. Pharmacother. = Biomed. Pharmacother. 2018 99 883 893 10.1016/j.biopha.2018.01.146 29710488 27. Peng X. Cheng L. You Y. Tang C. Ren B. Li Y. Xu X. Microbiota oral en enfermedades sistémicas humanas Int. J. Oral Sci. 2022 14 14 10.1038/s41368-022-00163-7 35236828 PMC8891310 28. Kandalai S. Li H. Zhang N. Peng H. Zheng Q. The human microbiome and cancer: A diagnostic and therapeutic perspective Cancer Biol. Ther. 2023 24 2240084 10.1080/15384047.2023.2240084 37498047 PMC10376920 29. den Besten G. van Eunen K. Groen A.K. Venema K. Reijngoud D.J. Bakker B.M. The role of short-chain fatty acids in the interplay between diet, gut microbiota, and host energy metabolism J. Lipid Res. 2013 54 2325 2340 10.1194/jlr.R036012 23821742 PMC3735932 30. Tarracchini C. Lugli G.A. Mancabelli L. van Sinderen D. Turroni F. Ventura M. Milani C. Exploring the vitamin biosynthesis landscape of the human gut microbiota mSystems 2024 9 e0092924 10.1128/msystems.00929-24 39287373 PMC11494892 31. Sanford J.A. Gallo R.L. Functions of the skin microbiota in health and disease Semin. Immunol. 2013 25 370 377 10.1016/j.smim.2013.09.005 24268438 PMC4219649 32. Martens E.C. Neumann M. Desai M.S. Interactions of commensal and pathogenic microorganisms with the intestinal mucosal barrier Nat. Rev. Microbiol. 2018 16 457 470 10.1038/s41579-018-0036-x 29904082 33. Gustafsson J.K. Johansson M.E.V. The role of goblet cells and mucus in intestinal homeostasis Nat. Rev. Gastroenterol. Hepatol. 2022 19 785 803 10.1038/s41575-022-00675-x 36097076 34. Belkaid Y. Hand T.W. Role of the microbiota in immunity and inflammation Cell 2014 157 121 141 10.1016/j.cell.2014.03.011 24679531 PMC4056765 35. Aggarwal N. Kitano S. Puah G.R.Y. Kittelmann S. Hwang I.Y. Chang M.W. Microbiome and Human Health: Current Understanding, Engineering, and Enabling Technologies Chem. Rev. 2023 123 31 72 10.1021/acs.chemrev.2c00431 36317983 PMC9837825 36. Peroni D.G. Campoy C. Verduci E. Editorial: Role of early life nutrition in immunomodulation and microbiota development Front. Nutr. 2023 10 1266725 10.3389/fnut.2023.1266725 37908303 PMC10614016 37. Reynolds H.M. Bettini M.L. Early-life microbiota-immune homeostasis Front. Immunol. 2023 14 1266876 10.3389/fimmu.2023.1266876 37936686 PMC10627000 38. Lubin J.B. Green J. Maddux S. Denu L. Duranova T. Lanza M. Wynosky-Dolfi M. Flores J.N. Grimes L.P. Brodsky I.E. Arresting microbiome development limits immune system maturation and resistance to infection in mice Cell Host Microbe 2023 31 554 570.e7 10.1016/j.chom.2023.03.006 36996818 PMC10935632 39. Watkinson R.L. Looi K. Laing I.A. Cianferoni A. Kicic A. Viral Induced Effects on a Vulnerable Epithelium; Lessons Learned From Paediatric Asthma and Eosinophilic Oesophagitis Front. Immunol. 2021 12 773600 10.3389/fimmu.2021.773600 34912343 PMC8666438 40. Francis A.P. Dominguez-Bello M.G. Early-Life Microbiota Perturbations and Behavioral Effects Trends Microbiol. 2019 27 567 569 10.1016/j.tim.2019.04.004 31103277 41. Dominguez-Bello M.G. Costello E.K. Contreras M. Magris M. Hidalgo G. Fierer N. Knight R. Delivery mode shapes the acquisition and structure of the initial microbiota across multiple body habitats in newborns Proc. Natl. Acad. Sci. 2010 107 11971 11975 10.1073/pnas.1002601107 20566857 PMC2900693 42. Tamburini S. Shen N. Wu H.C. Clemente J.C. The microbiome in early life: Implications for health outcomes Nat. Med. 2016 22 713 722 10.1038/nm.4142 27387886 43. Ho N.T. Li F. Lee-Sarwar K.A. Tun H.M. Brown B.P. Pannaraj P.S. Bender J.M. Azad M.B. Thompson A.L. Weiss S.T. Meta-analysis of effects of exclusive breastfeeding on infant gut microbiota across populations Nat. Commun. 2018 9 4169 10.1038/s41467-018-06473-x 30301893 PMC6177445 44. Vatanen T. Kostic A.D. D’Hennezel E. Siljander H. Franzosa E.A. Yassour M. Kolde R. Vlamakis H. Arthur T.D. Hämäläinen A. Variation in Microbiome LPS Immunogenicity Contributes to Autoimmunity in Humans Cell 2016 165 842 853 10.1016/j.cell.2016.04.007 27133167 PMC4950857 45. Wopereis H. Oozeer R. Knipping K. Belzer C. Knol J. The first thousand days—Intestinal microbiology of early life: Establishing a symbiosis Pediatr. Allergy Immunol. 2014 25 428 438 10.1111/pai.12232 24899389 46. Slater A.S. Hickey R.M. Davey G.P. Interactions of human milk oligosaccharides with the immune system Front. Immunol. 2025 15 1523829 10.3389/fimmu.2024.1523829 39877362 PMC11772441 47. Corona L. Lussu A. Bosco A. Pintus R. Cesare Marincola F. Fanos V. Dessì A. Human Milk Oligosaccharides: A Comprehensive Review towards Metabolomics Children 2021 8 804 10.3390/children8090804 34572236 PMC8465502 48. Sanidad K.Z. Zeng M.Y. Neonatal gut microbiome and immunity Curr. Opin. Microbiol. 2020 56 30 37 10.1016/j.mib.2020.05.011 32634598 PMC8729197 49. Zeng J. He Z. Wang G. Ma Y. Zhang F. Interaction Between Microbiota and Immunity: Molecular Mechanisms, Biological Functions, Diseases, and New Therapeutic Opportunities MedComm 2025 6 e70265 10.1002/mco2.70265 40547945 PMC12179415 50. Zhao L. Niu J. Feng D. Wang X. Zhang R. Immune functions of pattern recognition receptors in Lepidoptera Front. Immunol. 2023 14 1203061 10.3389/fimmu.2023.1203061 37398667 PMC10312389 51. Tibbs T.N. Lopez L.R. Arthur J.C. The influence of the microbiota on immune development, chronic inflammation, and cancer in the context of aging Microb. Cell 2019 6 324 334 10.15698/mic2019.08.685 31403049 PMC6685047 52. Hou K. Wu Z.X. Chen X.Y. Wang J.-Q. Zhang D. Xiao C. Zhu D. Koya J.B. Wei L. Li J. Microbiota en la salud y la enfermedad Signal Transduct. Target. Ther. 2022 7 135 10.1038/s41392-022-00974-4 35461318 PMC9034083 53. Takeuchi T. Nakanishi Y. Ohno H. Microbial Metabolites and Gut Immunology Annu. Rev. Immunol. 2024 42 153 178 10.1146/annurev-immunol-090222-102035 38941602 54. Shen Y. Fan N. Ma S.X. Cheng X. Yang X. Wang G. Gut Microbiota Dysbiosis: Pathogenesis, Diseases, Prevention, and Therapy MedComm 2025 6 e70168 10.1002/mco2.70168 40255918 PMC12006732 55. Yao Y. Cai X. Ye Y. Wang F. Chen F. Zheng C. The Role of Microbiota in Infant Health: From Early Life to Adulthood Front. Immunol. 2021 12 708472 10.3389/fimmu.2021.708472 34691021 PMC8529064 56. Augustine T. Kumar M. Al Khodor S. van Panhuys N. Microbial Dysbiosis Tunes the Immune Response Towards Allergic Disease Outcomes Clin. Rev. Allergy Immunol. 2023 65 43 71 10.1007/s12016-022-08939-9 35648372 PMC10326151 57. Bhutta N.K. Xu X. Jian C. Wang Y. Liu Y. Sun J. Han B. Wu S. Javeed A. Gut microbiota mediated T cells regulation and autoimmune diseases Front. Microbiol. 2024 15 1477187 10.3389/fmicb.2024.1477187 39749132 PMC11694513 58. Hoang D.M. Levy E.I. Vandenplas Y. The impact of Caesarean section on the infant gut microbiome Acta Paediatr. 2021 110 60 67 10.1111/apa.15501 33405258 59. Dera N. Kosińska-Kaczyńska K. Żeber-Lubecka N. Brawura-Biskupski-Samaha R. Massalska D. Szymusik I. Dera K. Ciebiera M. Impact of Early-Life Microbiota on Immune System Development and Allergic Disorders Biomedicines 2025 13 121 10.3390/biomedicines13010121 39857705 PMC11762082 60. Mindt B.C. DiGiandomenico A. Microbiome Modulation as a Novel Strategy to Treat and Prevent Respiratory Infections Antibiotics 2022 11 474 10.3390/antibiotics11040474 35453224 PMC9029693 61. Maynard C.L. The Microbiota in Immunity and Inflammation En Elsevier eBooks Amsterdam, The Netherlands 2019 207 219.e1 10.1016/b978-0-7020-6896-6.00014-4 62. O’Toole P.W. Marchesi J.R. Hill C. Next-generation probiotics: The spectrum from probiotics to live biotherapeutics Nat. Microbiol. 2017 2 17057 10.1038/nmicrobiol.2017.57 28440276 63. Thaiss C. Zmora N. Levy M. Elinav E. El microbioma y la inmunidad innata Nature 2016 535 65 74 10.1038/nature18847 27383981 64. Wastyk H.C. Fragiadakis G.K. Perelman D. Dahan D. Merrill B.D. Yu F.B. Topf M. Gonzalez C.G. Van Treuren W. Han S. Gut-microbiota-targeted diets modulate human immune status Cell 2021 184 4137 4153.e14 10.1016/j.cell.2021.06.019 34256014 PMC9020749 65. Fiebiger U. Bereswill S. Heimesaat M.M. Dissecting the Interplay Between Intestinal Microbiota and Host Immunity in Health and Disease: Lessons Learned from Germfree and Gnotobiotic Animal Models Eur. J. Microbiol. Immunol. 2016 6 253 271 10.1556/1886.2016.00036 PMC5146645 27980855 66. Lavelle E.C. Murphy C. O’Neill L.A.J. Creagh E.M. The role of TLRs, NLRs, and RLRs in mucosal innate immunity and homeostasis Mucosal Immunol. 2020 3 17 28 10.1038/mi.2009.124 19890268 PMC3428627 67. Zhou Y. Yu S. Zhang W. NOD-like Receptor Signaling Pathway in Gastrointestinal Inflammatory Diseases and Cancers Int. J. Mol. Sci. 2023 24 14511 10.3390/ijms241914511 37833958 PMC10572711 68. Couturier-Maillard A. Secher T. Rehman A. Normand S. De Arcangelis A. Haesler R. Huot L. Grandjean T. Bressenot A. Delanoye-Crespin A. NOD2-mediated dysbiosis predisposes mice to transmissible colitis and colorectal cancer J. Clin. Investig. 2013 123 700 711 10.1172/JCI62236 23281400 PMC3561825 69. Li D. Wu M. Receptores de reconocimiento de patrones en la salud y la enfermedad Signal Transduct. Target. Ther. 2021 6 291 10.1038/s41392-021-00687-0 34344870 PMC8333067 70. Kawasaki T. Kawai T. Toll-like receptor signaling pathways Front. Immunol. 2014 5 461 10.3389/fimmu.2014.00461 25309543 PMC4174766 71. Qiu P. Ishimoto T. Fu L. Zhang J. Zhang Z. Liu Y. The Gut Microbiota in Inflammatory Bowel Disease Front. Cell. Infect. Microbiol. 2022 12 733992 10.3389/fcimb.2022.733992 35273921 PMC8902753 72. Dheer R. Santaolalla R. Davies J.M. Lang J.K. Phillips M.C. Pastorini C. Vazquez-Pertejo M.T. Abreu M.T. Intestinal Epithelial Toll-Like Receptor 4 Signaling Affects Epithelial Function and Colonic Microbiota and Promotes a Risk for Transmissible Colitis Infect. Immun. 2016 84 798 810 10.1128/IAI.01374-15 26755160 PMC4771346 73. Takeuchi O. Akira S. Pattern recognition receptors and inflammation Cell 2010 140 805 820 10.1016/j.cell.2010.01.022 20303872 74. Ali M. Benfante V. Di Raimondo D. Laudicella R. Tuttolomondo A. Comelli A. A Review of Advances in Molecular Imaging of Rheumatoid Arthritis: From In Vitro to Clinic Applications Using Radiolabeled Targeting Vectors with Technetium-99m Life 2024 14 751 10.3390/life14060751 38929734 PMC11204982 75. Liu X.F. Shao J.H. Liao Y.T. Wang L.N. Jia Y. Dong P.J. Liu Z.Z. He D.D. Li C. Zhang X. Regulation of short-chain fatty acids in the immune system Front. Immunol. 2023 14 1186892 10.3389/fimmu.2023.1186892 37215145 PMC10196242 76. Tang Y. Fu A. Wang L. Ge Q. Microbiota-dependent metabolites—New engine for T cell warriors Gut Microbes 2025 17 2523815 10.1080/19490976.2025.2523815 40583522 PMC12218545 77. Silva Y.P. Bernardi A. Frozza R.L. The role of short-chain fatty acids from gut microbiota in gut-brain communication Front. Endocrinol. 2020 11 25 10.3389/fendo.2020.00025 PMC7005631 32082260 78. Krsek A. Baticic L. Neutrófilos en el foco: Impacto en la dinámica neuroinmune y el eje intestino-cerebro Gastrointest. Disord. 2024 6 557 606 10.3390/gidisord6030039 79. Sun M. Wu W. Liu Z. Cong Y. Microbiota metabolite short chain fatty acids, GPCR, and inflammatory bowel diseases J. Gastroenterol. 2017 52 1 8 10.1007/s00535-016-1242-9 27448578 PMC5215992 80. Arpaia N. Campbell C. Fan X. Dikiy S. van der Veeken J. deRoos P. Liu H. Cross J.R. Pfeffer K. Coffer P.J. Metabolites produced by commensal bacteria promote peripheral regulatory T-cell generation Nature 2013 504 451 455 10.1038/nature12726 24226773 PMC3869884 81. Sinha S.R. Haileselassie Y. Nguyen L.P. Tropini C. Wang M. Becker L.S. Sim D. Jarr K. Spear E.T. Singh G. Dysbiosis-Induced Secondary Bile Acid Deficiency Promotes Intestinal Inflammation Cell Host Microbe 2020 27 659 670.e5 10.1016/j.chom.2020.01.021 32101703 PMC8172352 82. Blander J.M. Longman R.S. Iliev I.D. Sonnenberg G.F. Artis D. Regulation of inflammation by microbiota interactions with the host Nat. Immunol. 2017 18 851 860 10.1038/ni.3780 28722709 PMC5800875 83. Kobayashi N. Takahashi D. Takano S. Kimura S. Hase K. The Roles of Peyer’s Patches and Microfold Cells in the Gut Immune System: Relevance to Autoimmune Diseases Front. Immunol. 2019 10 2345 10.3389/fimmu.2019.02345 31649668 PMC6794464 84. Wang X. Yuan W. Yang C. Wang Z. Zhang J. Xu D. Sun X. Sun W. Emerging role of gut microbiota in autoimmune diseases Front. Immunol. 2024 15 1365554 10.3389/fimmu.2024.1365554 38765017 PMC11099291 85. Torow N. Marsland B.J. Hornef M.W. Gollwitzer E.S. Neonatal mucosal immunology Mucosal Immunol. 2017 10 5 17 10.1038/mi.2016.81 27649929 86. Kaisar M.M.M. Pelgrom L.R. van der Ham A.J. Yazdanbakhsh M. Everts B. Butyrate Conditions Human Dendritic Cells to Prime Type 1 Regulatory T Cells via both Histone Deacetylase Inhibition and G Protein-Coupled Receptor 109A Signaling Front. Immunol. 2017 8 1429 10.3389/fimmu.2017.01429 29163504 PMC5670331 87. Fachi J.L. Felipe J.S. Pral L.P. da Silva B.K. Corrêa R.O. de Andrade M.C.P. da Fonseca D.M. Basso P.J. Câmara N.O.S. de Sales ESouza É.L. Butyrate Protects Mice from Clostridium difficile-Induced Colitis through an HIF-1-Dependent Mechanism Cell Rep. 2019 27 750 761.e7 10.1016/j.celrep.2019.03.054 30995474 88. Fadlallah J. El Kafsi H. Sterlin D. Juste C. Parizot C. Dorgham K. Autaa G. Gouas D. Almeida M. Lepage P. Microbial ecology perturbation in human IgA deficiency Sci. Transl. Med. 2018 10 eaan1217 10.1126/scitranslmed.aan1217 29720448 89. Rios-Arce N.D. Collins F.L. Schepper J.D. Steury M.D. Raehtz S. Mallin H. Schoenherr D.T. Parameswaran N. McCabe L.R. Epithelial Barrier Function in Gut-Bone Signaling Adv. Exp. Med. Biol. 2017 1033 151 183 10.1007/978-3-319-66653-2_8 29101655 PMC5742533 90. Chiang H.Y. Lu H.H. Sudhakar J.N. Chen Y.W. Shih N.S. Weng Y.T. Shui J.W. IL-22 initiates an IL-18-dependent epithelial response circuit to enforce intestinal host defence Nat. Commun. 2022 13 874 10.1038/s41467-022-28478-3 35169117 PMC8847568 91. Lueschow S.R. McElroy S.J. The Paneth Cell: The Curator and Defender of the Immature Small Intestine Front. Immunol. 2020 11 587 10.3389/fimmu.2020.00587 32308658 PMC7145889 92. Luissint A.C. Parkos C.A. Nusrat A. Inflammation and the Intestinal Barrier: Leukocyte-Epithelial Cell Interactions, Cell Junction Remodeling, and Mucosal Repair Gastroenterology 2016 151 616 632 10.1053/j.gastro.2016.07.008 27436072 PMC5317033 93. Paray B.A. Albeshr M.F. Jan A.T. Rather I.A. Leaky Gut and Autoimmunity: An Intricate Balance in Individuals Health and the Diseased State Int. J. Mol. Sci. 2020 21 9770 10.3390/ijms21249770 33371435 PMC7767453 94. Cineus R. Luo Y. Saliutina M. Manna S. Cancino C.A. Blázquez L.V. Wang L. Bösel D. Abdelrahman A. Klementowicz J.E. El eje IL-22-oncostatina M promueve la inflamación intestinal y la tumorogénesis Nat. Immunol. 2025 26 837 853 10.1038/s41590-025-02149-z 40447860 PMC12133592 95. Keir M. Yi Y. Lu T. Ghilardi N. The role of IL-22 in intestinal health and disease J. Exp. Med. 2020 217 e20192195 10.1084/jem.20192195 32997932 PMC7062536 96. Dunleavy K.A. Raffals L.E. Camilleri M. Intestinal Barrier Dysfunction in Inflammatory Bowel Disease: Underpinning Pathogenesis and Therapeutics Dig. Dis. Sci. 2023 68 4306 4320 10.1007/s10620-023-08122-w 37773554 PMC10798146 97. Bauché D. Marie J.C. Transforming growth factor β: A master regulator of the gut microbiota and immune cell interactions Clin. Transl. Immunol. 2017 6 e136 10.1038/cti.2017.9 PMC5418590 28523126 98. Belkaid Y. Harrison O.J. Homeostatic Immunity and the Microbiota Immunity 2017 46 562 576 10.1016/j.immuni.2017.04.008 28423337 PMC5604871 99. Bankole T. Li Y. The early-life gut microbiome in common pediatric diseases: Roles and therapeutic implications Front. Nutr. 2025 12 10.3389/fnut.2025.1597206 PMC12158737 40510495 100. Zheng D. Liwinski T. Elinav E. Interacción entre la microbiota y la inmunidad en la salud y la enfermedad Cell Res. 2020 30 492 506 10.1038/s41422-020-0332-7 32433595 PMC7264227 101. Groschwitz K.R. Hogan S.P. Intestinal barrier function: Molecular regulation and disease pathogenesis J. Allergy Clin. Immunol. 2021 124 3 20 10.1016/j.jaci.2009.05.038 19560575 PMC4266989 102. Honda K. Littman D.R. The microbiota in adaptive immune homeostasis and disease Nature 2016 535 75 84 10.1038/nature18848 27383982 103. Smith P.M. Howitt M.R. Panikov N. Michaud M. Gallini C.A. Bohlooly-Y M. Garrett W.S. The microbial metabolites, short-chain fatty acids, regulate colonic Treg cell homeostasis Science 2013 341 569 573 10.1126/science.1241165 23828891 PMC3807819 104. Josefowicz S.Z. Lu L.F. Rudensky A.Y. Regulatory T cells: Mechanisms of differentiation and function Annu. Rev. Immunol. 2020 30 531 564 10.1146/annurev.immunol.25.022106.141623 PMC6066374 22224781 105. Pabst O. Mowat A. Tolerancia oral a las proteínas alimentarias Mucosal Immunol. 2012 5 232 239 10.1038/mi.2012.4 22318493 PMC3328017 106. Furusawa Y. Obata Y. Fukuda S. Endo T.A. Nakato G. Takahashi D. Nakanishi Y. Uetake C. Kato K. Kato T. Commensal microbe-derived butyrate induces the differentiation of colonic regulatory T cells Nature 2020 504 446 450 10.1038/nature12721 24226770 107. Alam A. Neish A. Role of gut microbiota in intestinal wound healing and barrier function Tissue Barriers 2018 6 1539595 10.1080/21688370.2018.1539595 30404570 PMC6389125 108. Ullah H. Arbab S. Tian Y. Chen Y. Liu C.Q. Li Q. Li K. Crosstalk between gut microbiota and host immune system and its response to traumatic injury Front. Immunol. 2024 15 1413485 10.3389/fimmu.2024.1413485 39144142 PMC11321976 109. Morton E.R. Lynch J. Froment A. Lafosse S. Heyer E. Przeworski M. Blekhman R. Ségurel L. Variation in Rural African Gut Microbiota Is Strongly Correlated with Colonization by Entamoeba and Subsistence PLoS Genet. 2015 11 e1005658 10.1371/journal.pgen.1005658 26619199 PMC4664238 110. Wiertsema S.P. van Bergenhenegouwen J. Garssen J. Knippels L.M.J. The Interplay between the Gut Microbiome and the Immune System in the Context of Infectious Diseases throughout Life and the Role of Nutrition in Optimizing Treatment Strategies Nutrients 2021 13 886 10.3390/nu13030886 33803407 PMC8001875 111. Vujkovic-Cvijin I. Sklar J. Jiang L. Natarajan L. Knight R. Belkaid Y. Las variables del huésped confunden los estudios de la microbiota intestinal en enfermedades humanas Nature 2020 587 448 454 10.1038/s41586-020-2881-9 33149306 PMC7677204 112. Barin J.G. Tobias L.D. Peterson D.A. The microbiome and autoimmune disease: Report from a Noel R. Rose Colloquium Clin. Immunol. 2015 159 183 188 10.1016/j.clim.2015.05.009 26003843 113. Cani P.D. Amar J. Iglesias M.A. Poggi M. Knauf C. Bastelica D. Neyrinck A.M. Fava F. Tuohy K.M. Chabo C. Metabolic endotoxemia initiates obesity and insulin resistance Diabetes 2007 56 1761 1772 10.2337/db06-1491 17456850 114. Matson V. Fessler J. Bao R. Chongsuwat T. Zha Y. Alegre M.-L. Luke J.J. Gajewski T.F. The commensal microbiome is associated with anti–PD-1 efficacy in metastatic melanoma patients Science 2018 359 104 108 10.1126/science.aao3290 29302014 PMC6707353 115. Karlsson F.H. Tremaroli V. Nookaew I. Bergström G. Behre C.J. Fagerberg B. Bäckhed F. Gut metagenome in European women with normal, impaired and diabetic glucose control Nature 2020 498 99 103 10.1038/nature12198 23719380 116. Żółkiewicz J. Marzec A. Ruszczyński M. Feleszko W. Postbiotics-A Step Beyond Pre- and Probiotics Nutrients 2020 12 2189 10.3390/nu12082189 32717965 PMC7468815 117. Kostic A.D. Chun E. Robertson L. Glickman J.N. Gallini C.A. Michaud M. Clancy T.E. Chung D.C. Lochhead P. Hold G.L. Fusobacterium nucleatum potentiates intestinal tumorigenesis and modulates the tumor-immune microenvironment Cell Host Microbe 2013 14 207 215 10.1016/j.chom.2013.07.007 23954159 PMC3772512 118. Liu Y. Alookaran J.J. Rhoads J.M. Probiotics in Autoimmune and Inflammatory Disorders Nutrients 2018 10 1537 10.3390/nu10101537 30340338 PMC6213508 119. Ruff W.E. Vieira S.M. Kriegel M.A. The role of the gut microbiota in the pathogenesis of antiphospholipid syndrome Curr. Rheumatol. Rep. 2015 17 472 10.1007/s11926-014-0472-1 25475595 PMC4394866 120. Noto D. Miyake S. Gut dysbiosis and multiple sclerosis Clin. Immunol. 2022 235 108380 10.1016/j.clim.2020.108380 32169440 121. Petrof E.O. Gloor G.B. Vanner S.J. Weese S.J. Carter D. Daigneault M.C. Brown E.M. Schroeter K. Allen-Vercoe E. Stool substitute transplant therapy for the eradication of Clostridium difficile infection: ‘RePOOPulating’ the gut Microbiome 2013 1 3 10.1186/2049-2618-1-3 24467987 PMC3869191 122. Taur Y. Xavier J.B. Lipuma L. Ubeda C. Goldberg J. Gobourne A. Pamer E.G. Intestinal domination and the risk of bacteremia in patients undergoing allogeneic hematopoietic stem cell transplantation Clin. Infect. Dis. 2021 55 905 914 10.1093/cid/cis580 PMC3657523 22718773 123. Turnbaugh P.J. Ley R.E. Mahowald M.A. Magrini V. Mardis E.R. Gordon J.I. An obesity-associated gut microbiome with increased capacity for energy harvest Nature 2020 444 1027 1031 10.1038/nature05414 17183312 124. Liang J. Tan Y. Highly efficient CRISPR-mediated base editing for the gut Bacteroides spp. with pnCasBS-CBE Biotechnol. J. 2023 18 2200504 10.1002/biot.202200504 37010073 125. Fung T.C. Olson C.A. Hsiao E.Y. Interactions between the microbiota, immune and nervous systems in health and disease Nat. Neurosci. 2020 20 145 155 10.1038/nn.4476 PMC6960010 28092661 126. Zheng L. Tan Y. Hu Y. Shen J. Qu Z. Chen X. Ho C.L. Leung E.L. Zhao W. Dai L. CRISPR/Cas-based genome editing for human gut commensal Bacteroides species ACS Synth. Biol. 2022 11 464 472 10.1021/acssynbio.1c00543 34990118 127. Zheng Y. Valdez P.A. Danilenko D.M. Hu Y. Sa S.M. Gong Q. Abbas A.R. Modrusan Z. Ghilardi N. de Sauvage F.J. Interleukin-22 mediates early host defense against attaching and effacing bacterial pathogens Nat. Med. 2008 14 282 289 10.1038/nm1720 18264109 128. Gopalakrishnan V. Spencer C.N. Nezi L. Reuben A. Andrews M.C. Karpinets T.V. Prieto P.A. Vicente D. Hoffman K. Wei S.C. Gut microbiome modulates response to anti-PD-1 immunotherapy in melanoma patients Science 2017 359 97 103 10.1126/science.aan4236 29097493 PMC5827966 129. Yang L. Li H. Tang M. He L. Yang L. Circular RNAs in inflammatory bowel disease: A review of mechanisms, biomarkers and therapeutic potential Front. Immunol. 2025 16 1540768 10.3389/fimmu.2025.1540768 40342413 PMC12058709 130. Müller L. Di Benedetto S. Bridging the brain and gut: Neuroimmune mechanisms of neuroinflammation and therapeutic insights Front. Cell. Neurosci. 2025 19 1590002 10.3389/fncel.2025.1590002 40584220 PMC12202344 131. Sampson T.R. Debelius J.W. Thron T. Janssen S. Shastri G.G. Ilhan Z.E. Challis C. Schretter C.E. Rocha S. Gradinaru V. Gut microbiota regulate motor deficits and neuroinflammation in a model of Parkinson’s disease Cell 2016 167 1469 1480.e12 10.1016/j.cell.2016.11.018 27912057 PMC5718049 132. Kang Z. Jiang S. Fang J.-Y. Chen H. Intestinal dysbiosis and colorectal cancer Chin. Med. J. 2025 138 1266 1287 10.1097/CM9.0000000000003617 40387510 PMC12150945 133. Chen J. Wright K. Davis J.M. Jeraldo P. Marietta E.V. Murray J. Nelson H. Matteson E.L. Taneja V. An expansion of rare lineage intestinal microbes characterizes rheumatoid arthritis Genome Med. 2016 8 43 10.1186/s13073-016-0299-7 27102666 PMC4840970 134. Biedermann L. Kreienbühl A. Rogler G. Microbiota Therapy in Inflammatory Bowel Disease Visc. Med. 2024 40 92 101 10.1159/000536254 38584861 PMC10995964 135. Heidari M. Vareki S.M. Yaghobi R. Karimi M.H. Microbiota activation and regulation of adaptive immunity Front. Immunol. 2024 15 1429436 10.3389/fimmu.2024.1429436 39445008 PMC11496076 136. Aslam R. Herrles L. Aoun R. Pioskowik A. Pietrzyk A. Link between gut microbiota dysbiosis and childhood asthma: Insights from a systematic review J. Allergy Clin. Immunol. Glob. 2024 3 100289 10.1016/j.jacig.2024.100289 39105129 PMC11298874 137. Forbes J.D. Van Domselaar G. Bernstein C.N. The Gut Microbiota in Immune-Mediated Inflammatory Diseases Front. Microbiol. 2016 7 1081 10.3389/fmicb.2016.01081 27462309 PMC4939298 138. Jemimah S. Chabib C.M.M. Hadjileontiadis L. AlShehhi A. Gut microbiome dysbiosis in Alzheimer’s disease and mild cognitive impairment: A systematic review and meta-analysis PLoS ONE 2023 18 e0285346 10.1371/journal.pone.0285346 37224131 PMC10208513 139. Alshehri D. Saadah O. Mosli M. Edris S. Alhindi R. Bahieldin A. Dysbiosis of gut microbiota in inflammatory bowel disease: Current therapies and potential for microbiota-modulating therapeutic approaches Bosn. J. Basic Med. Sci. 2021 21 270 283 10.17305/bjbms.2020.5016 33052081 PMC8112554 140. Donaldson G.P. Lee S.M. Mazmanian S.K. Gut biogeography of the bacterial microbiota Nat. Rev. Microbiol. 2016 14 20 32 10.1038/nrmicro3552 26499895 PMC4837114 141. Hold G.L. Smith M. Grange C. Watt E.R. El-Omar E.M. Mukhopadhya I. Role of the gut microbiota in inflammatory bowel disease pathogenesis: What have we learnt in the past 10 years? World J. Gastroenterol. 2014 20 1192 1210 10.3748/wjg.v20.i5.1192 24574795 PMC3921503 142. Kamada N. Seo S.U. Chen GYy Núñez G. Rol de la microbiota intestinal en la inmunidad y la enfermedad inflamatoria Nat. Rev. Immunol. 2013 13 321 335 10.1038/nri3430 23618829 143. Haberman Y. Tickle T.L. Dexheimer P.J. Kim M.O. Tang D. Karns R. Baldassano R.N. Noe J.D. Rosh J. Markowitz J. Pediatric Crohn disease patients exhibit specific ileal transcriptome and microbiome signature J. Clin. Investig. 2014 124 3617 3633 10.1172/JCI75436 25003194 PMC4109533 144. Ni J. Wu G.D. Albenberg L. Tomov V.T. Gut microbiota and IBD: Causation or correlation? Nat. Rev. Gastroenterol. Hepatol. 2017 14 573 584 10.1038/nrgastro.2017.88 28743984 PMC5880536 145. Mousa R.S. Invernizzi P. Mousa H.S. Innate immune cells in the pathogenesis of inflammatory bowel disease—From microbial metabolites to immune modulation Front. Gastroenterol. 2024 3 1452430 10.3389/fgstr.2024.1452430 146. Jiang B. Gut-brain axis dynamics: Elucidating bidirectional interactions between gut microbiota composition and autism spectrum disorder pathogenesis Theor. Nat. Sci. 2025 113 219 226 10.54254/2753-8818/2025.AU24415 147. Osadchiy V. Martin C.R. Mayer E.A. The Gut-Brain Axis and the Microbiome: Mechanisms and Clinical Implications Clin. Gastroenterol. Hepatol. Off. Clin. Pract. J. Am. Gastroenterol. Assoc. 2019 17 322 332 10.1016/j.cgh.2018.10.002 30292888 PMC6999848 148. Lloyd-Price J. Abu-Ali G. Huttenhower C. El microbioma humano saludable Genome Med. 2016 8 51 10.1186/s13073-016-0307-y 27122046 PMC4848870 149. Vancamelbeke M. Vermeire S. The intestinal barrier: A fundamental role in health and disease Expert Rev. Gastroenterol. Hepatol. 2017 11 821 834 10.1080/17474124.2017.1343143 28650209 PMC6104804 150. Parada Venegas D. De la Fuente M.K. Landskron G. González M.J. Quera R. Dijkstra G. Harmsen H.J.M. Faber K.N. Hermoso M.A. Short chain fatty acids (SCFAs)–mediated gut epithelial and immune regulation and its relevance for inflammatory bowel diseases Front. Immunol. 2019 10 277 10.3389/fimmu.2019.00277 30915065 PMC6421268 151. Zhou K. Baranova A. Cao H. Sun J. Zhang F. Gut microbiome and schizophrenia: Insights from two-sample Mendelian randomization Schizophrenia 2024 10 75 10.1038/s41537-024-00497-7 39223235 PMC11369294 152. Lynch S.V. Pedersen O. The human intestinal microbiome in health and disease New Engl. J. Med. 2016 375 2369 2379 10.1056/NEJMra1600266 27974040 153. Macpherson A.J. Harris N.L. Interactions between commensal intestinal bacteria and the immune system Nat. Rev. Immunol. 2004 4 478 485 10.1038/nri1373 15173836 154. O’Neill L.A. Pearce E.J. Immunometabolism governs dendritic cell and macrophage function J. Exp. Med. 2016 213 15 23 10.1084/jem.20151570 26694970 PMC4710204 155. Round J.L. Mazmanian S.K. The gut microbiota shapes intestinal immune responses during health and disease Nat. Rev. Immunol. 2009 9 313 323 10.1038/nri2515 19343057 PMC4095778 156. Rooks M.G. Garrett W.S. Gut microbiota, metabolites and host immunity Nat. Rev. Immunol. 2016 16 341 352 10.1038/nri.2016.42 27231050 PMC5541232 157. Liu L. Wang H. Chen X. Zhang Y. Zhang H. Xie P. Gut microbiota and its metabolites in depression: From pathogenesis to treatment EBioMedicine 2023 90 104527 10.1016/j.ebiom.2023.104527 36963238 PMC10051028 158. Schirmer M. Smeekens S.P. Vlamakis H. Jaeger M. Oosting M. Franzosa E.A. Ter Horst R. Jansen T. Jacobs L. Bonder M.J. Linking the human gut microbiome to inflammatory cytokine production capacity Cell 2016 167 1125 1136.e8 10.1016/j.cell.2016.10.020 27814509 PMC5131922 159. Segata N. Haake S.K. Mannon P. Lemon K.P. Waldron L. Gevers D. Miropolsky L. Garrett W.S. Huttenhower C. Composition of the adult digestive tract bacterial microbiome based on seven mouth surfaces, tonsils, throat and stool samples Genome Biol. 2012 13 R42 10.1186/gb-2012-13-6-r42 22698087 PMC3446314 160. Shreiner A.B. Kao J.Y. Young V.B. The gut microbiome in health and in disease Curr. Opin. Gastroenterol. 2015 31 69 75 10.1097/MOG.0000000000000139 25394236 PMC4290017 161. Weng M. Walker W.A. The role of gut microbiota in programming the immune phenotype J. Dev. Orig. Health Dis. 2013 4 203 214 10.1017/S2040174412000712 24353893 PMC3864895 162. Zeng M.Y. Inohara N. Nuñez G. Mechanisms of inflammation-driven bacterial dysbiosis in the gut Mucosal Immunol. 2017 10 18 26 10.1038/mi.2016.75 27554295 PMC5788567 163. Zhernakova A. Kurilshikov A. Bonder M.J. Tigchelaar E.F. Schirmer M. Vatanen T. Mujagic Z. Vila A.V. Falony G. Vieira-Silva S. Population-based metagenomics analysis reveals markers for gut microbiome composition and diversity Science 2016 352 565 569 10.1126/science.aad3369 27126040 PMC5240844 164. Harach T. Marungruang N. Duthilleul N. Cheatham V. Mc Coy K.D. Frisoni G. Neher J.J. Fåk F. Jucker M. Lasser T. Reduction of Abeta amyloid pathology in APPPS1 transgenic mice in the absence of gut microbiota Sci. Rep. 2017 7 41802 10.1038/srep41802 28176819 PMC5297247 165. De Luca F. Shoenfeld Y. The microbiome in autoimmune diseases Clin. Exp. Immunol. 2019 195 74 85 10.1111/cei.13158 29920643 PMC6300652 166. Yoon J.H. Do J.S. Velankanni P. Lee C.G. Kwon H.K. Gut Microbial Metabolites on Host Immune Responses in Health and Disease Immune Netw. 2023 23 e6 10.4110/in.2023.23.e6 36911800 PMC9995988 167. Katz-Agranov N. Zandman-Goddard G. The microbiome and systemic lupus erythematosus Immunol. Res. 2017 65 432 437 10.1007/s12026-017-8906-2 28233089 168. Romano K.A. Vivas E.I. Amador-Noguez D. Rey F.E. Intestinal microbiota composition modulates choline bioavailability from diet and accumulation of the proatherogenic metabolite trimethylamine-N-oxide mBio 2015 6 e02481 10.1128/mBio.02481-14 25784704 PMC4453578 169. Kelly C.J. Zheng L. Campbell E.L. Saeedi B. Scholz C.C. Bayless A.J. Wilson K.E. Glover L.E. Kominsky D.J. Magnuson A. Crosstalk between microbiota-derived short-chain fatty acids and intestinal epithelial HIF augments tissue barrier function Cell Host Microbe 2015 17 662 671 10.1016/j.chom.2015.03.005 25865369 PMC4433427 170. Koh A. De Vadder F. Kovatcheva-Datchary P. Bäckhed F. From dietary fiber to host physiology: Short-chain fatty acids as key bacterial metabolites Cell 2016 165 1332 1345 10.1016/j.cell.2016.05.041 27259147 171. Levy M. Kolodziejczyk A.A. Thaiss C.A. Elinav E. Dysbiosis and the immune system Nat. Rev. Immunol. 2017 17 219 232 10.1038/nri.2017.7 28260787 172. Lam K.N. Spanogiannopoulos P. Soto-Perez P. Alexander M. Nalley M.J. Bisanz J.E. Nayak R.R. Weakley A.M. Yu F.B. Turnbaugh P.J. Phage-delivered CRISPR-Cas9 for strain-specific depletion and genomic deletions in the gut microbiome Cell Rep. 2021 37 109930 10.1016/j.celrep.2021.109930 34731631 PMC8591988 173. Yeh T.K. Jean S.S. Lee Y.L. Lu M.C. Ko W.C. Lin H.J. Liu P.Y. Hsueh P.R. Phage delivered CRISPR-Cas system to combat multidrug-resistant pathogens in gut microbiome Biomed. Pharmacother. 2022 151 113122 10.1016/j.biopha.2022.113122 35594718 174. Lee C.K. Lee H.J. Jeong S.H. Lee S.J. Precision targeting of genetic variations in mixed bacterial cultures using CRISPR-Cas12a-programmed λ phages Front. Microbiol. 2025 16 1575339 10.3389/fmicb.2025.1575339 40529587 PMC12171280 ",
  "metadata": {
    "Title of this paper": "Precision targeting of genetic variations in mixed bacterial cultures using CRISPR-Cas12a-programmed λ phages",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472381/"
  }
}