{
  "title": "Paper_948",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12476991 PMC12476991.1 12476991 12476991 41030439 10.3389/fimmu.2025.1672072 1 Immunology Mini Review Metabolic regulation of Th9 cell differentiation: insights for IL-9-driven diseases Peesari Swetha McAleer Jeremy P.  *  Department of Pharmaceutical Sciences, Marshall University School of Pharmacy Huntington, WV United States Edited by: Gareth S. D. Purvis Reviewed by: Suyasha Roy *Correspondence: Jeremy P. McAleer, mcaleer@marshall.edu 15 9 2025 2025 16 480569 1672072 23 7 2025 01 9 2025 15 09 2025 30 09 2025 01 10 2025 Copyright © 2025 Peesari and McAleer. 2025 Peesari and McAleer https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Th9 cells are a CD4 T cell subset that produces interleukin-9 (IL-9), a pleiotropic cytokine implicated in allergies, autoimmunity and cancer. Defining the cellular effects of IL-9 and factors regulating its expression are essential for fully understanding its roles in immunity and disease. IL-9 acts on a variety of immune and non-immune cells through a heterodimeric receptor composed of IL-9Rα and the common gamma chain. In CD4 T cells, IL-9 promotes mTOR activation, aerobic glycolysis, proliferation and reinforces its own expression. Additional cellular effects include mast cell activation, B cell antibody production and anti-tumor immunity. These biological activities are complemented by recent studies that expand our understanding of Th9 differentiation beyond canonical cytokine and transcription factor pathways. Notably, glycolytic reprogramming and fatty acid metabolism have emerged as key regulators of IL-9 production, mediated through the activities of mTOR, PPAR-γ and acetyl-CoA carboxylase 1 (ACC1). mTOR-driven aerobic glycolysis is essential for Th9 cell differentiation, supporting survival, proliferation, and IL9 expression through HIF-1α activation. In contrast, ACC1 suppresses IL-9 through fatty acid synthesis, which enhances RARα-mediated transcriptional repression. PPAR-γ appears to have dual functions: it promotes IL-9 production by increasing glucose uptake and activating mTOR, but reduces IL-9 in response to synthetic agonists that may increase fatty acid uptake. Overall, these findings highlight critical roles for metabolic regulators in Th9 responses and suggest that targeting these pathways may offer new therapeutic strategies for IL-9-driven diseases. Th9 cells interleukin-9 (IL-9) allergies autoimmunity cancer MTOR activation PPAR-gamma ACC1 The author(s) declare financial support was received for the research and/or publication of this article. Costs for this publication were provided by Marshall University School of Pharmacy. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Inflammation Introduction IL-9 was identified in 1988 as a T helper cell growth factor produced in mitogen-stimulated cultures ( 1 2 3 4 In vitro + 1 5 6 + 7 In vivo 8 10 Cytokine regulation of Th9 cell differentiation CD4 T cells are the best characterized cell type that produces IL-9, although other cells including mast cells and NKT cells are also capable ( 11 12 13 14 13 13 15 7 16 7 17 18 19 7 14 15 18 20 Cellular effects of IL-9 IL-9 signals through a heterodimeric receptor composed of IL-9 receptor alpha (IL-9Rα) and the common gamma chain (γc), the latter of which is shared with receptors for IL-2, IL-4, IL-7, IL-15 and IL-21. Thus, IL-9 responsiveness is restricted to cells expressing both subunits, including lymphocyte subsets and mast cells. Inflammatory conditions can broaden IL-9 responsiveness in other populations (e.g. antigen presenting cells and epithelial cells) by upregulating IL-9Rα or γc ( 21 22 22 Originally identified as a CD4 T cell growth factor ( 1 18 14 23 24 18 Beyond T cells, IL-9 influences several hematopoietic and non-hematopoietic populations. In mast cells, IL-9 enhances proliferation, survival, and activation, leading to increased production of cytokines such as IL-1β, IL-5, IL-6 and IL-13 ( 5 11 25 26 27 28 29 30 31 32 in vivo  Figure 1 Figure 1 IL-9 receptor signaling and cellular targets. Th9 cells are the primary source of IL-9, although other T cell subsets, including Th17 and Tregs, are also capable of IL-9 production. The IL-9 receptor is a heterodimer composed of IL-9Rα and the common gamma chain (γc). Ligand binding activates three major intracellular signaling pathways. The JAK/STAT pathway promotes Th9 differentiation and IL-9 production. The PI3K/Akt pathway contributes to mTOR activation, resulting in aerobic glycolysis, survival and macromolecule synthesis required for cell growth. The MAP kinase cascade facilitates the transcription of genes involved in effector T cell proliferation. In addition to Th9 cells, IL-9 targets a range of hematopoietic and sometimes non-hematopoietic cells. Among CD4 T cell subsets and B cells, IL-9 enhances proliferation, differentiation and effector function. In mast cells, IL-9 promotes activation, cytokine secretion and survival. Keratinocytes can also respond to IL-9 when they express the receptor complex, leading to pro-inflammatory cytokine production. In cancer, IL-9 plays dual roles through promoting proliferation and survival in lymphomas, while inducing apoptosis in melanoma. The responsiveness of non-hematopoietic populations to IL-9 occurs through the upregulation of IL-9R components in inflammatory settings. Altogether, these pathways and target cell responses contribute to the pleiotropic roles of IL-9 in immunity, inflammation and disease. Diagram illustrating the role of IL-9 in immune cell differentiation and function. Key signaling pathways activated by the IL-9 receptor complex include JAK/STAT, PI3K/Akt/mTOR, and ERK/MAPK. T cells are the major cellular targets of IL-9, resulting in their differentiation, proliferation, and effector functions. IL-9 can also stimulate B cells, mast cells, keratinocytes and tumor cells, although some tumors are sensitive to apoptotic effects of IL-9. Role of IL-9 in diseases IL-9 contributes to inflammatory reactions in the skin, intestine and lungs, as well as cancer and autoimmunity. While not typically the dominant cytokine, IL-9 modulates disease progression through its diverse effects on immune and non-immune populations ( 21 33 19 34 35 36 37 38 17 39 40 42 40 41 43 44 46 In cancer, IL-9 plays dual roles acting as either a tumor suppressor or promoter depending on the tumor type ( 30 32 47 49 47 50 51 49 52 53 54 30 30 55 57 + 58 59 Interleukin-9 also has complex roles in autoimmune diseases. Rheumatoid arthritis and psoriatic arthritis patients have elevated IL-9 in synovial fluid and tissues ( 60 61 62 63 64 65 66 67 68 69 18 Metabolic regulation of IL-9 production As with other CD4 T cell subsets, metabolism plays a central role in the differentiation and function of Th9 cells. Several metabolic products, including lipids, amino acids and TCA cycle intermediates, have been shown to directly affect IL-9 production and/or Th9 differentiation ( 50 70 73 74 75 mTOR T cell activation induces profound metabolic changes to support the energy production and biomass accumulation required for clonal expansion and effector cell differentiation. This has been well characterized for glucose metabolism, with Akt and mTOR playing critical roles in driving aerobic glycolysis ( 76 77 77 80 77 78 77 81 82 83 50 84 23 85 PPAR-γ Peroxisome proliferator-activated receptor-γ (PPAR-γ) is a member of a nuclear receptor superfamily of transcription factors activated by fatty acids ( 86 86 88 89 90 In vivo 91 93 94 98 98 The role of PPAR-γ in Th9 cell differentiation has recently become elucidated. Human Th9 cells were characterized as a subpopulation of Th2 cells expressing high levels of PPAR-γ ( 19 + + + 99 19 23 23 89 100 101 in vitro 91 102 104 Acetyl-CoA carboxylase 1 T cell activation increases cellular demands for fatty acids, leading to the upregulation of enzymes and transcription factors involved in fatty acid biosynthesis ( 76 89 105 106 107 108 111 112 113 114 Recent studies identified a suppressive role for ACC1 in Th9 differentiation. Culturing Th9 cells with ACC1 inhibitors or under fatty acid-free conditions substantially increases IL-9 production ( 100 115 de novo 115 116 115 117 in vitro 115 + - 100 118 119 + - in vitro 100 + - 107 100 + Conclusions Recent insights into the metabolic regulation of Th9 cells have expanded our understanding beyond canonical cytokine signaling and transcription factor pathways (  Figure 2 120 100 115 121 123 + 107 124 100 86 + Figure 2 Metabolic regulation of Th9 differentiation. (A) (B) (C) (D) Diagram with four panels illustrating roles for metabolic regulators in Th9 cell differentiation. Panel A shows how different cytokine receptor pathways regulate transcription factors in Th9 cells. Panel B highlights the central role of mTOR in aerobic glycolysis and IL-9 expression, along with stimuli that activate mTOR. Panel C depicts PPAR-gamma’s dual roles in IL-9 upregulation through mTOR, and downregulation through fatty acid uptake. Panel D shows the mechanism of ACC1-mediated IL-9 suppression: fatty acid synthesis leading to the upregulation of RARalpha and decreased signaling through the TGF-beta receptor. Inhibiting ACC1 increases IL-9 production via histone acetylation. Author contributions SP: Writing – original draft, Investigation. JM: Conceptualization, Investigation, Funding acquisition, Writing – review & editing, Writing – original draft, Formal Analysis. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. The author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Uyttenhove C Simpson RJ Van Snick J Functional and structural characterization of P40, a mouse glycoprotein with T-cell growth factor activity Proc Natl Acad Sci U.S.A 1988 85 6934–8 10.1073/pnas.85.18.6934 3137580 PMC282093 2 Simpson RJ Moritz RL Rubira MR Gorman JJ Van Snick J Complete amino acid sequence of a new murine T-cell growth factor P40 Eur J Biochem 1989 183 715–22 10.1111/j.1432-1033.1989.tb21103.x 2528451 3 Van Snick J Goethals A Renauld JC Van Roost E Uyttenhove C Rubira MR Cloning and characterization of a cDNA for a new mouse T cell growth factor (P40) J Exp Med 1989 169 363–8 10.1084/jem.169.1.363 2521242 PMC2189178 4 Yang YC Ricciardi S Ciarletta A Calvetti J Kelleher K Clark SC Expression cloning of cDNA encoding a novel human hematopoietic growth factor: human homologue of murine T-cell growth factor P40 Blood 1989 74 1880–4 10.1182/blood.V74.6.1880.1880 2508790 5 Hultner L Druez C Moeller J Uyttenhove C Schmitt E Rude E Mast cell growth-enhancing activity (MEA) is structurally related and functionally identical to the novel mouse T cell growth factor P40/TCGFIII (interleukin 9) Eur J Immunol 1990 20 1413–6 10.1002/eji.1830200632 2115002 6 Schmitt E Van Brandwijk R Van Snick J Siebold B Rude E TCGF III/P40 is produced by naive murine CD4+ T cells but is not a general T cell growth factor Eur J Immunol 1989 19 2167–70 10.1002/eji.1830191130 2574683 7 Goswami R Kaplan MH A brief history of IL-9 J Immunol 2011 186 3283–8 10.4049/jimmunol.1003049 21368237 PMC3074408 8 Angkasekwinai P Th9 cells in allergic disease Curr Allergy Asthma Rep 2019 19 29 10.1007/s11882-019-0860-8 30915580 9 Gessner A Blum H Rollinghoff M Differential regulation of IL-9-expression after infection with Leishmania major in susceptible and resistant mice Immunobiology 1993 189 419–35 10.1016/S0171-2985(11)80414-6 8125519 10 Seumois G Ramirez-Suastegui C Schmiedel BJ Liang S Peters B Sette A Single-cell transcriptomic analysis of allergen-specific T cells in allergy and asthma Sci Immunol 2020 5 eaba6087 10.1126/sciimmunol.aba6087 32532832 PMC7372639 11 Noelle RJ Nowak EC Cellular sources and immune functions of interleukin-9 Nat Rev Immunol 2010 10 683–7 10.1038/nri2848 20847745 PMC3828627 12 Schmitt E Germann T Goedert S Hoehn P Huels C Koelsch S IL-9 production of naive CD4+ T cells depends on IL-2, is synergistically enhanced by a combination of TGF-beta and IL-4, and is inhibited by IFN-gamma J Immunol 1994 153 3989–96 10.4049/jimmunol.153.9.3989 7930607 13 Dardalhon V Awasthi A Kwon H Galileos G Gao W Sobel RA IL-4 inhibits TGF-beta-induced Foxp3+ T cells and, together with TGF-beta, generates IL-9+ IL-10+ Foxp3(-) effector T cells Nat Immunol 2008 9 1347–55 10.1038/ni.1677 18997793 PMC2999006 14 Veldhoen M Uyttenhove C van Snick J Helmby H Westendorf A Buer J Transforming growth factor-beta ‘reprograms’ the differentiation of T helper 2 cells and promotes an interleukin 9-producing subset Nat Immunol 2008 9 1341–6 10.1038/ni.1659 18931678 15 Wong MT Ye JJ Alonso MN Landrigan A Cheung RK Engleman E Regulation of human Th9 differentiation by type I interferons and IL-21 Immunol Cell Biol 2010 88 624–31 10.1038/icb.2010.53 20421880 PMC3090036 16 Chang HC Sehra S Goswami R Yao W Yu Q Stritesky GL The transcription factor PU.1 is required for the development of IL-9-producing T cells and allergic inflammation Nat Immunol 2010 11 527–34 10.1038/ni.1867 20431622 PMC3136246 17 Staudt V Bothur E Klein M Lingnau K Reuter S Grebe N Interferon-regulatory factor 4 is essential for the developmental program of T helper 9 cells Immunity 2010 33 192 202 10.1016/j.immuni.2010.07.014 20674401 18 Elyaman W Bradshaw EM Uyttenhove C Dardalhon V Awasthi A Imitola J IL-9 induces differentiation of TH17 cells and enhances function of FoxP3+ natural regulatory T cells Proc Natl Acad Sci U.S.A 2009 106 12885–90 10.1073/pnas.0812530106 19433802 PMC2722314 19 Micosse C von Meyenn L Steck O Kipfer E Adam C Simillion C Human “T(H)9” cells are a subpopulation of PPAR-gamma(+) T(H)2 cells Sci Immunol 2019 4 eaat5943 10.1126/sciimmunol.aat5943 30658968 20 Lu LF Lind EF Gondek DC Bennett KA Gleeson MW Pino-Lagos K Mast cells are essential intermediaries in regulatory T-cell tolerance Nature 2006 442 997 1002 10.1038/nature05010 16921386 21 Pajulas A Zhang J Kaplan MH The world according to IL-9 J Immunol 2023 211 7 14 10.4049/jimmunol.2300094 37339404 PMC10287031 22 Chakraborty S Kubatzky KF Mitra DK An update on interleukin-9: from its cellular source and signal transduction to its role in immunopathogenesis Int J Mol Sci 2019 20 2113 10.3390/ijms20092113 31035677 PMC6522352 23 Bertschi NL Steck O Luther F Bazzini C von Meyenn L Scharli S PPAR-gamma regulates the effector function of human T helper 9 cells by promoting glycolysis Nat Commun 2023 14 2471 10.1038/s41467-023-38233-x 37120582 PMC10148883 24 Poulin LF Habran C Stordeur P Goldman M McKenzie A Van Snick J Interleukin-9 stimulates the production of interleukin-5 in CD4+ T cells Eur Cytokine Netw 2005 16 233–9 16266865 25 Vink A Warnier G Brombacher F Renauld JC Interleukin 9-induced in vivo J Exp Med 1999 189 1413–23 10.1084/jem.189.9.1413 10224281 PMC2193070 26 Pilette C Ouadrhiri Y Van Snick J Renauld JC Staquet P Vaerman JP IL-9 inhibits oxidative burst and TNF-alpha release in lipopolysaccharide-stimulated human monocytes through TGF-beta J Immunol 2002 168 4103–11 10.4049/jimmunol.168.8.4103 11937570 27 Wu B Huang C Kato-Maeda M Hopewell PC Daley CL Krensky AM IL-9 is associated with an impaired Th1 immune response in patients with tuberculosis Clin Immunol 2008 126 202–10 10.1016/j.clim.2007.09.009 18032114 28 Williams DE Morrissey PJ Mochizuki DY de Vries P Anderson D Cosman D T-cell growth factor P40 promotes the proliferation of myeloid cell lines and enhances erythroid burst formation by normal murine bone marrow cells in vitro Blood 1990 76 906–11 10.1182/blood.V76.5.906.906 2118397 29 Hong CH Chang KL Wang HJ Yu HS Lee CH IL-9 induces IL-8 production via STIM1 activation and ERK phosphorylation in epidermal keratinocytes: A plausible mechanism of IL-9R in atopic dermatitis J Dermatol Sci 2015 78 206–14 10.1016/j.jdermsci.2015.03.004 25840641 30 Bick F Blanchetot C Lambrecht BN Schuijs MJ A reappraisal of IL-9 in inflammation and cancer Mucosal Immunol 2025 18 1 15 10.1016/j.mucimm.2024.10.003 39389468 31 Lv X Feng L Ge X Lu K Wang X Interleukin-9 promotes cell survival and drug resistance in diffuse large B-cell lymphoma J Exp Clin Cancer Res 2016 35 106 10.1186/s13046-016-0374-3 27364124 PMC4929715 32 Fang Y Chen X Bai Q Qin C Mohamud AO Zhu Z IL-9 inhibits HTB-72 melanoma cell growth through upregulation of p21 and TRAIL J Surg Oncol 2015 111 969–74 10.1002/jso.23930 25988864 33 Wong MT Ong DE Lim FS Teng KW McGovern N Narayanan S A high-dimensional atlas of human T cell diversity reveals tissue-specific trafficking and cytokine signatures Immunity 2016 45 442–56 10.1016/j.immuni.2016.07.007 27521270 34 Sismanopoulos N Delivanis DA Alysandratos KD Angelidou A Vasiadi M Therianou A IL-9 induces VEGF secretion from human mast cells and IL-9/IL-9 receptor genes are overexpressed in atopic dermatitis PloS One 2012 7 e33271 10.1371/journal.pone.0033271 22413008 PMC3297631 35 Ma L Xue HB Guan XH Shu CM Zhang JH Yu J Possible pathogenic role of T helper type 9 cells and interleukin (IL)-9 in atopic dermatitis Clin Exp Immunol 2014 175 25 31 10.1111/cei.12198 24032555 PMC3898551 36 Makita S Takatori H Matsuki A Kawashima H Iwata A Tanaka S T-bet and STAT6 coordinately suppress the development of IL-9-mediated atopic dermatitis-like skin inflammation in mice J Invest Dermatol 2021 141 1274 1285 e5 10.1016/j.jid.2020.08.029 33068596 37 Clark RA Schlapbach C T(H)9 cells in skin disorders Semin Immunopathol 2017 39 47 54 10.1007/s00281-016-0607-8 27896634 PMC5471354 38 Nicolaides NC Holroyd KJ Ewart SL Eleff SM Kiser MB Dragwa CR Interleukin 9: a candidate gene for asthma Proc Natl Acad Sci U.S.A 1997 94 13175–80 10.1073/pnas.94.24.13175 9371819 PMC24282 39 Temann UA Geba GP Rankin JA Flavell RA Expression of interleukin 9 in the lungs of transgenic mice causes airway inflammation, mast cell hyperplasia, and bronchial hyperresponsiveness J Exp Med 1998 188 1307–20 10.1084/jem.188.7.1307 9763610 PMC2212487 40 Gerlach K Hwang Y Nikolaev A Atreya R Dornhoff H Steiner S TH9 cells that express the transcription factor PU.1 drive T cell-mediated colitis via IL-9 receptor signaling in intestinal epithelial cells Nat Immunol 2014 15 676–86 10.1038/ni.2920 24908389 41 Nalleweg N Chiriac MT Podstawa E Lehmann C Rau TT Atreya R IL-9 and its receptor are predominantly involved in the pathogenesis of UC Gut 2015 64 743–55 10.1136/gutjnl-2013-305947 24957265 42 Yuan A Yang H Qi H Cui J Hua W Li C IL-9 antibody injection suppresses the inflammation in colitis mice Biochem Biophys Res Commun 2015 468 921–6 10.1016/j.bbrc.2015.11.057 26603936 43 Gerlach K McKenzie AN Neurath MF Weigmann B IL-9 regulates intestinal barrier function in experimental T cell-mediated colitis Tissue Barriers 2015 3 e983777 10.4161/21688370.2014.983777 25838986 PMC4372018 44 Faulkner H Humphreys N Renauld JC Van Snick J Grencis R Interleukin-9 is involved in host protective immunity to intestinal nematode infection Eur J Immunol 1997 27 2536–40 10.1002/eji.1830271011 9368607 45 Faulkner H Renauld JC Van Snick J Grencis RK Interleukin-9 enhances resistance to the intestinal nematode Trichuris muris Infect Immun 1998 66 3832–40 10.1128/IAI.66.8.3832-3840.1998 9673269 PMC108429 46 Licona-Limon P Henao-Mejia J Temann AU Gagliani N Licona-Limon I Ishigame H Th9 cells drive host immunity against gastrointestinal worm infection Immunity 2013 39 744–57 10.1016/j.immuni.2013.07.020 24138883 PMC3881610 47 Purwar R Schlapbach C Xiao S Kang HS Elyaman W Jiang X Robust tumor immunity to melanoma mediated by interleukin-9-producing T cells Nat Med 2012 18 1248–53 10.1038/nm.2856 22772464 PMC3518666 48 Wan J Wu Y Huang L Tian Y Ji X Abdelaziz MH ILC2-derived IL-9 inhibits colorectal cancer progression by activating CD8(+) T cells Cancer Lett 2021 502 34 43 10.1016/j.canlet.2021.01.002 33429004 49 You FP Zhang J Cui T Zhu R Lv CQ Tang HT Th9 cells promote antitumor immunity via IL-9 and IL-21 and demonstrate atypical cytokine expression in breast cancer Int Immunopharmacol 2017 52 163–7 10.1016/j.intimp.2017.08.031 28918288 50 Roy S Rizvi ZA Clarke AJ Macdonald F Pandey A Zaiss DMW EGFR-HIF1alpha signaling positively regulates the differentiation of IL-9 producing T helper cells Nat Commun 2021 12 3182 10.1038/s41467-021-23042-x 34075041 PMC8169867 51 Lu Y Wang Q Xue G Bi E Ma X Wang A Th9 cells represent a unique subset of CD4(+) T cells endowed with the ability to eradicate advanced tumors Cancer Cell 2018 33 1048 1060 e7 10.1016/j.ccell.2018.05.004 29894691 PMC6072282 52 Chen J Zhang Y Zhang H Zhang M Dong H Qin T IL-24 is the key effector of Th9 cell-mediated tumor immunotherapy iScience 2023 26 107531 10.1016/j.isci.2023.107531 37680459 PMC10480301 53 Vegran F Berger H Boidot R Mignot G Bruchard M Dosset M The transcription factor IRF1 dictates the IL-21-dependent anticancer functions of TH9 cells Nat Immunol 2014 15 758–66 10.1038/ni.2925 24973819 54 Fang H Li R Gu Y Fei Y Jin K Chen Y Intratumoral interleukin-9 delineates a distinct immunogenic class of gastric cancer patients with better prognosis and adjuvant chemotherapeutic response Oncoimmunology 2020 9 1856468 10.1080/2162402X.2020.1856468 33354409 PMC7738302 55 Gruss HJ Brach MA Drexler HG Bross KJ Herrmann F Interleukin 9 is expressed by primary and cultured Hodgkin and Reed-Sternberg cells Cancer Res 1992 52 1026–31 1737332 56 Hu B Qiu-Lan H Lei RE Shi C Jiang HX Qin SY Interleukin-9 Promotes Pancreatic Cancer Cells Proliferation and Migration via the miR-200a/Beta-Catenin Axis BioMed Res Int 2017 2017 2831056 10.1155/2017/2831056 28349057 PMC5352879 57 Ye ZJ Zhou Q Yin W Yuan ML Yang WB Xiong XZ Differentiation and immune regulation of IL-9-producing CD4+ T cells in Malignant pleural effusion Am J Respir Crit Care Med 2012 186 1168–79 10.1164/rccm.201207-1307OC 23065014 58 Boncompagni G Tatangelo V Lopresti L Ulivieri C Capitani N Tangredi C Leukemic cell-secreted interleukin-9 suppresses cytotoxic T cell-mediated killing in chronic lymphocytic leukemia Cell Death Dis 2024 15 144 10.1038/s41419-024-06528-6 38360867 PMC10869739 59 Feng LL Gao JM Li PP Wang X IL-9 contributes to immunosuppression mediated by regulatory T cells and mast cells in B-cell non-hodgkin’s lymphoma J Clin Immunol 2011 31 1084–94 10.1007/s10875-011-9584-9 21898141 60 Ciccia F Guggino G Rizzo A Manzo A Vitolo B La Manna MP Potential involvement of IL-9 and Th9 cells in the pathogenesis of rheumatoid arthritis Rheumatol (Oxford) 2015 54 2264–72 10.1093/rheumatology/kev252 26178600 61 Kundu-Raychaudhuri S Abria C Raychaudhuri SP IL-9, a local growth factor for synovial T cells in inflammatory arthritis Cytokine 2016 79 45 51 10.1016/j.cyto.2015.12.020 26751012 62 Rauber S Luber M Weber S Maul L Soare A Wohlfahrt T Resolution of inflammation by interleukin-9-producing type 2 innate lymphoid cells Nat Med 2017 23 938–44 10.1038/nm.4373 28714991 PMC5575995 63 Dantas AT Marques CD da Rocha Junior LF Cavalcanti MB Goncalves SM Cardoso PR Increased serum interleukin-9 levels in rheumatoid arthritis and systemic lupus erythematosus: pathogenic role or just an epiphenomenon Dis Markers 2015 2015 519638 10.1155/2015/519638 26078482 PMC4452366 64 Ouyang H Shi Y Liu Z Feng S Li L Su N Increased interleukin−9 and CD4+IL-9+ T cells in patients with systemic lupus erythematosus Mol Med Rep 2013 7 1031–7 10.3892/mmr.2013.1258 23291628 65 Yang J Li Q Yang X Li M Interleukin-9 is associated with elevated anti-double-stranded DNA antibodies in lupus-prone mice Mol Med 2015 21 364–70 10.2119/molmed.2014.00237 25902303 PMC4534470 66 Jager A Dardalhon V Sobel RA Bettelli E Kuchroo VK Th1, Th17, and Th9 effector cells induce experimental autoimmune encephalomyelitis with different pathological phenotypes J Immunol 2009 183 7169–77 10.4049/jimmunol.0901906 19890056 PMC2921715 67 Li H Nourbakhsh B Cullimore M Zhang GX Rostami A IL-9 is important for T-cell activation and differentiation in autoimmune inflammation of the central nervous system Eur J Immunol 2011 41 2197–206 10.1002/eji.201041125 21674475 PMC3517123 68 Nowak EC Weaver CT Turner H Begum-Haque S Becher B Schreiner B IL-9 as a mediator of Th17-driven inflammatory disease J Exp Med 2009 206 1653–60 10.1084/jem.20090246 19596803 PMC2722185 69 Yoshimura S Thome R Konno S Mari ER Rasouli J Hwang D IL-9 controls central nervous system autoimmunity by suppressing GM-CSF production J Immunol 2020 204 531–9 10.4049/jimmunol.1801113 31852750 PMC7197375 70 Bazzini C Bertschi NL Steck O Luther F Scharli S Rolfes ED Human T helper 9 cells rely on peroxisome proliferator-activated receptor-gamma-mediated cystine uptake to prevent lipid peroxidation and bioenergetic failure J Invest Dermatol 2025 145 1693 1705 e2 10.1016/j.jid.2024.10.616 39725162 71 Ma X Bi E Huang C Lu Y Xue G Guo X Cholesterol negatively regulates IL-9-producing CD8(+) T cell differentiation and antitumor activity J Exp Med 2018 215 1555–69 10.1084/jem.20171576 29743292 PMC5987919 72 Rampal R Awasthi A Ahuja V Retinoic acid-primed human dendritic cells inhibit Th9 cells and induce Th1/Th17 cell differentiation J Leukoc Biol 2016 100 111–20 10.1189/jlb.3VMA1015-476R 26980802 73 Reilly NA Sonnet F Dekkers KF Kwekkeboom JC Sinke L Hilt S Oleic acid triggers metabolic rewiring of T cells poising them for T helper 9 differentiation iScience 2024 27 109496 10.1016/j.isci.2024.109496 38558932 PMC10981094 74 Kanno T Nakano K Endo Y Cellular metabolism in Th9, Th17, and Treg cell differentiation Int Immunol 2025 37 dxaf032 10.1093/intimm/dxaf032 40489251 75 Xu WD Chen YY Li YW Yang J Huang AF Targeting Th9 cells in autoimmune diseases: a narrative review Front Immunol 2025 16 1615611 10.3389/fimmu.2025.1615611 40771819 PMC12325201 76 Buck MD O’Sullivan D Pearce EL T cell metabolism drives immunity J Exp Med 2015 212 1345–60 10.1084/jem.20151159 26261266 PMC4548052 77 Wang Y Bi Y Chen X Li C Li Y Zhang Z Histone deacetylase SIRT1 negatively regulates the differentiation of interleukin-9-producing CD4(+) T cells Immunity 2016 44 1337–49 10.1016/j.immuni.2016.05.009 27317260 78 Bi E Ma X Lu Y Yang M Wang Q Xue G Foxo1 and Foxp1 play opposing roles in regulating the differentiation and antitumor activity of T(H)9 cells programmed by IL-7 Sci Signal 2017 10 eaak9741 10.1126/scisignal.aak9741 29018172 PMC5961737 79 Buttrick TS Wang W Yung C Trieu KG Patel K Khoury SJ Foxo1 promotes th9 cell differentiation and airway allergy Sci Rep 2018 8 818 10.1038/s41598-018-19315-z 29339772 PMC5770389 80 Fu Y Wang J Panangipalli G Ulrich BJ Koh B Xu C STAT5 promotes accessibility and is required for BATF-mediated plasticity at the Il9 locus Nat Commun 2020 11 4882 10.1038/s41467-020-18648-6 32985505 PMC7523001 81 Yamaki K Yoshino S Preventive and therapeutic effects of rapamycin, a mammalian target of rapamycin inhibitor, on food allergy in mice Allergy 2012 67 1259–70 10.1111/all.12000 22913509 82 Chen H Zhang L Wang P Su H Wang W Chu Z mTORC2 controls Th9 polarization and allergic airway inflammation Allergy 2017 72 1510–20 10.1111/all.13152 28273354 83 Roy S Awasthi A ATP Triggers Human Th9 Cell Differentiation via Nitric Oxide-Mediated mTOR-HIF1alpha Pathway Front Immunol 2019 10 1120 10.3389/fimmu.2019.01120 31164892 PMC6536008 84 Benoit-Lizon I Jacquin E Rivera Vargas T Richard C Roussey A Dal Zuffo L CD4 T cell-intrinsic STING signaling controls the differentiation and effector functions of T(H)1 and T(H)9 cells J Immunother Cancer 2022 10 e003459 10.1136/jitc-2021-003459 35091453 PMC8804688 85 Huang YY Jiang HX Shi QY Qiu X Wei X Zhang XL miR-145 inhibits th9 cell differentiation by suppressing activation of the PI3K/akt/mTOR/p70S6K/HIF-1alpha pathway in Malignant ascites from liver cancer Onco Targets Ther 2020 13 3789–800 10.2147/OTT.S245346 32440147 PMC7211301 86 Ahmadian M Suh JM Hah N Liddle C Atkins AR Downes M PPARgamma signaling and metabolism: the good, the bad and the future Nat Med 2013 19 557–66 10.1038/nm.3159 23652116 PMC3870016 87 Kliewer SA Forman BM Blumberg B Ong ES Borgmeyer U Mangelsdorf DJ Differential expression and activation of a family of murine peroxisome proliferator-activated receptors Proc Natl Acad Sci U.S.A 1994 91 7355–9 10.1073/pnas.91.15.7355 8041794 PMC44398 88 Mangelsdorf DJ Evans RM The RXR heterodimers and orphan receptors Cell 1995 83 841–50 10.1016/0092-8674(95)90200-7 8521508 89 Angela M Endo Y Asou HK Yamamoto T Tumes DJ Tokuyama H Fatty acid metabolic reprogramming via mTOR-mediated inductions of PPARgamma directs early activation of T cells Nat Commun 2016 7 13683 10.1038/ncomms13683 27901044 PMC5141517 90 Stark JM Tibbitt CA Coquet JM The metabolic requirements of th2 cell differentiation Front Immunol 2019 10 2318 10.3389/fimmu.2019.02318 31611881 PMC6776632 91 Bapat SP Whitty C Mowery CT Liang Y Yoo A Jiang Z Obesity alters pathology and treatment response in inflammatory disease Nature 2022 604 337–42 10.1038/s41586-022-04536-0 35355021 PMC9165753 92 Chen T Tibbitt CA Feng X Stark JM Rohrbeck L Rausch L PPAR-gamma promotes type 2 immune responses in allergy and nematode infection Sci Immunol 2017 2 eaal5196 10.1126/sciimmunol.aal5196 28783701 93 Saubermann LJ Nakajima A Wada K Zhao S Terauchi Y Kadowaki T Peroxisome proliferator-activated receptor gamma agonist ligands stimulate a Th2 cytokine response and prevent acute colitis Inflammation Bowel Dis 2002 8 330–9 10.1097/00054725-200209000-00004 12479648 94 Cipolletta D Feuerer M Li A Kamei N Lee J Shoelson SE PPAR-gamma is a major driver of the accumulation and phenotype of adipose tissue Treg cells Nature 2012 486 549–53 10.1038/nature11132 22722857 PMC3387339 95 Guri AJ Mohapatra SK Horne WT 2nd Hontecillas R Bassaganya-Riera J The role of T cell PPAR gamma in mice with experimental inflammatory bowel disease BMC Gastroenterol 2010 10 60 10.1186/1471-230X-10-60 20537136 PMC2891618 96 Hontecillas R Bassaganya-Riera J Peroxisome proliferator-activated receptor gamma is required for regulatory CD4+ T cell-mediated protection against colitis J Immunol 2007 178 2940–9 10.4049/jimmunol.178.5.2940 17312139 97 Sivasami P Elkins C Diaz-Saldana PP Goss K Peng A M.t. Hamersky J Obesity-induced dysregulation of skin-resident PPARgamma(+) Treg cells promotes IL-17A-mediated psoriatic inflammation Immunity 2023 56 1844 1861 e6 10.1016/j.immuni.2023.06.021 37478855 PMC10527179 98 Wohlfert EA Nichols FC Nevius E Clark RB Peroxisome proliferator-activated receptor gamma (PPARgamma) and immunoregulation: enhancement of regulatory T cells through PPARgamma-dependent and -independent mechanisms J Immunol 2007 178 4129–35 10.4049/jimmunol.178.7.4129 17371968 99 Khokhar M Purohit P Gadwal A Tomo S Bajpai NK Shukla R The differentially expressed genes responsible for the development of T helper 9 cells from T helper 2 cells in various disease states: immuno-interactomics study JMIR Bioinform Biotechnol 2023 4 e42421 10.2196/42421 38935935 PMC11135241 100 Peesari S McAleer JP Regulation of human Th9 cell differentiation by lipid modulators targeting PPAR-gamma and acetyl-CoA-carboxylase 1 Front Immunol 2024 15 1509408 10.3389/fimmu.2024.1509408 39763655 PMC11700990 101 Dang YF Jiang XN Gong FL Guo XL New insights into molecular mechanisms of rosiglitazone in monotherapy or combination therapy against cancers Chem Biol Interact 2018 296 162–70 10.1016/j.cbi.2018.09.019 30278161 102 Ellis CN Varani J Fisher GJ Zeigler ME Pershadsingh HA Benson SC Troglitazone improves psoriasis and normalizes models of proliferative skin disease: ligands for peroxisome proliferator-activated receptor-gamma inhibit keratinocyte proliferation Arch Dermatol 2000 136 609–16 10.1001/archderm.136.5.609 10815854 103 McAleer JP Obesity and the microbiome in atopic dermatitis: Therapeutic implications for PPAR-gamma agonists Front Allergy 2023 4 1167800 10.3389/falgy.2023.1167800 37051264 PMC10083318 104 Tachibana M Wada K Katayama K Kamisaki Y Maeyama K Kadowaki T Activation of peroxisome proliferator-activated receptor gamma suppresses mast cell maturation involved in allergic diseases Allergy 2008 63 1136–47 10.1111/j.1398-9995.2008.01677.x 18547288 PMC4023568 105 Wang Y Yu W Li S Guo D He J Wang Y Acetyl-coA carboxylases and diseases Front Oncol 2022 12 836058 10.3389/fonc.2022.836058 35359351 PMC8963101 106 Endo Y Asou HK Matsugae N Hirahara K Shinoda K Tumes DJ Obesity drives th17 cell differentiation by inducing the lipid metabolic kinase, ACC1 Cell Rep 2015 12 1042–55 10.1016/j.celrep.2015.07.014 26235623 107 Berod L Friedrich C Nandan A Freitag J Hagemann S Harmrolfs K  De novo Nat Med 2014 20 1327–33 10.1038/nm.3704 25282359 108 Kao YS Mamareli P Dhillon-LaBrooy A Stuve P Godoy GJ Velasquez LN Targeting ACC1 in T cells ameliorates psoriatic skin inflammation J Mol Med (Berl) 2023 101 1153–66 10.1007/s00109-023-02349-w 37594540 PMC10482807 109 Koh J Woo YD Yoo HJ Choi JP Kim SH Chang YS  De novo Elife 2023 12 RP87536 10.7554/eLife.87536 37917548 PMC10622147 110 Mamareli P Kruse F Lu CW Guderian M Floess S Rox K Targeting cellular fatty acid synthesis limits T helper and innate lymphoid cell function during intestinal inflammation and infection Mucosal Immunol 2021 14 164–76 10.1038/s41385-020-0285-7 32355319 111 Stuve P Minarrieta L Erdmann H Arnold-Schrauf C Swallow M Guderian M  De novo Front Immunol 2018 9 495 10.3389/fimmu.2018.00495 29675017 PMC5895737 112 Nakajima T Kanno T Yokoyama S Sasamoto S Asou HK Tumes DJ ACC1-expressing pathogenic T helper 2 cell populations facilitate lung and skin inflammation in mice J Exp Med 2021 218 e20210639 10.1084/jem.20210639 34813654 PMC8614157 113 Endo Y Onodera A Obata-Ninomiya K Koyama-Nasu R Asou HK Ito T ACC1 determines memory potential of individual CD4(+) T cells by regulating de novo Nat Metab 2019 1 261–75 10.1038/s42255-018-0025-4 32694782 114 Ibitokou SA Dillon BE Sinha M Szczesny B Delgadillo A Reda Abdelrahman D Early inhibition of fatty acid synthesis reduces generation of memory precursor effector T cells in chronic infection J Immunol 2018 200 643–56 10.4049/jimmunol.1602110 29237780 PMC5760294 115 Nakajima T Kanno T Ueda Y Miyako K Endo T Yoshida S Fatty acid metabolism constrains Th9 cell differentiation and antitumor immunity via the modulation of retinoic acid receptor signaling Cell Mol Immunol 2024 21 1266–81 10.1038/s41423-024-01209-y 39187636 PMC11528006 116 Galdieri L Vancura A Acetyl-CoA carboxylase regulates global histone acetylation J Biol Chem 2012 287 23865–76 10.1074/jbc.M112.380519 22580297 PMC3390662 117 Schwartz DM Farley TK Richoz N Yao C Shih HY Petermann F Retinoic acid receptor alpha represses a th9 transcriptional and epigenomic program to reduce allergic pathology Immunity 2019 50 106 120.e10 10.1016/j.immuni.2018.12.014 30650370 PMC6338086 118 Mantel PY Ouaked N Ruckert B Karagiannidis C Welz R Blaser K Molecular mechanisms underlying FOXP3 induction in human T cells J Immunol 2006 176 3593–602 10.4049/jimmunol.176.6.3593 16517728 119 Tran DQ Ramsey H Shevach EM Induction of FOXP3 expression in naive human CD4+FOXP3 T cells by T-cell receptor stimulation is transforming growth factor-beta dependent but does not confer a regulatory phenotype Blood 2007 110 2983–90 10.1182/blood-2007-06-094656 17644734 PMC2018674 120 Oh CK Leigh R McLaurin KK Kim K Hultquist M Molfino NA A randomized, controlled trial to evaluate the effect of an anti-interleukin-9 monoclonal antibody in adults with uncontrolled asthma Respir Res 2013 14 93 10.1186/1465-9921-14-93 24050312 PMC3848834 121 Guseva NV Rokhlin OW Glover RA Cohen MB TOFA (5-tetradecyl-oxy-2-furoic acid) reduces fatty acid synthesis, inhibits expression of AR, neuropilin-1 and Mcl-1 and kills prostate cancer cells independent of p53 status Cancer Biol Ther 2011 12 80–5 10.4161/cbt.12.1.15721 21525791 122 He D Sun X Yang H Li X Yang D TOFA induces cell cycle arrest and apoptosis in ACHN and 786-O cells through inhibiting PI3K/Akt/mTOR pathway J Cancer 2018 9 2734–42 10.7150/jca.26374 30087714 PMC6072807 123 Nishi K Suzuki K Sawamoto J Tokizawa Y Iwase Y Yumita N Inhibition of fatty acid synthesis induces apoptosis of human pancreatic cancer cells Anticancer Res 2016 36 4655–60 10.21873/anticanres.11016 27630308 124 Kim CW Addy C Kusunoki J Anderson NN Deja S Fu X Acetyl coA carboxylase inhibition reduces hepatic steatosis but elevates plasma triglycerides in mice and humans: A bedside to bench investigation Cell Metab 2017 26 394 406.e6 10.1016/j.cmet.2017.07.009 28768177 PMC5603267 ",
  "metadata": {
    "Title of this paper": "Acetyl coA carboxylase inhibition reduces hepatic steatosis but elevates plasma triglycerides in mice and humans: A bedside to bench investigation",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476991/"
  }
}