{
  "title": "Paper_439",
  "abstract": "pmc Clin Cancer Res Clin Cancer Res 4147 aacrsd Clinical Cancer Research 1078-0432 1557-3265 pmc-is-collection-domain yes pmc-collection-title AACR Open Access PMC12485378 PMC12485378.1 12485378 12485378 40705098 10.1158/1078-0432.CCR-25-1248 CCR-25-1248 1 Version of Record Dna Damage And Repair Liquid Biopsy Translational Cancer Mechanisms and Therapy Genomic and Epigenomic ctDNA Profiling in Liquid Biopsies from Heavily Pretreated Patients with DNA Damage Response–Deficient Tumors Epigenomic and Genomic ctDNA Profiling in DDR Patients https://orcid.org/0000-0003-3819-6726 Silverman Ian M. 1  # https://orcid.org/0000-0002-5860-5040 Schonhoft Joseph D. 1  # https://orcid.org/0000-0002-3253-3106 Herzberg Benjamin 2 https://orcid.org/0000-0001-6339-4519 Yablonovitch Arielle 3 https://orcid.org/0009-0000-5373-8533 Lagow Errin 3 https://orcid.org/0000-0001-9614-7370 Fiaux Patrick C. 3 https://orcid.org/0009-0007-7852-5893 Safabakhsh Pegah 3 https://orcid.org/0000-0003-2636-5983 Sethuraman Sunantha 1 https://orcid.org/0009-0001-7754-9224 Ulanet Danielle 1 https://orcid.org/0009-0001-7189-6946 Yang Julia 1 https://orcid.org/0009-0008-1153-9403 Kim Insil 1 https://orcid.org/0009-0008-1095-3514 Basciano Paul 1 https://orcid.org/0000-0003-3504-0128 Cecchini Michael 4 https://orcid.org/0000-0001-7533-7853 Lee Elizabeth 5 https://orcid.org/0000-0003-4405-5890 Lheureux Stephanie 6 https://orcid.org/0000-0002-4991-9355 Fontana Elisa 7 https://orcid.org/0000-0002-5468-1126 Carneiro Benedito A. 8 https://orcid.org/0000-0003-2969-3173 Reis-Filho Jorge S. 9 https://orcid.org/0000-0002-2154-3309 Yap Timothy A. 10 https://orcid.org/0009-0002-1394-2032 Zinda Michael 1 https://orcid.org/0000-0002-5289-1541 Rosen Ezra Y. 11  ‡ https://orcid.org/0000-0003-4263-2009 Rimkunas Victoria 1 *  1  2  3  4  5  6  7  8  9  10  11 * Corresponding Author: vrimkunas@reparerx.com Clin Cancer Res 2025;31:4136–49 # I.M. Silverman and J.D. Schonhoft are co-first authors of this article. ‡ E.Y. Rosen is co-last author of this article. 01 10 2025 24 7 2025 31 19 498054 4136 4149 14 4 2025 12 6 2025 17 7 2025 01 10 2025 02 10 2025 03 10 2025 ©2025 The Authors; Published by the American Association for Cancer Research 2025 American Association for Cancer Research https://creativecommons.org/licenses/by-nc-nd/4.0/ This open access article is distributed under the Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International (CC BY-NC-ND 4.0) license. Abstract Purpose: The development of DNA damage response (DDR)-directed therapies is a major area of clinical investigation; however, to date, PARP inhibitors (PARPi) remain the only approved therapy in this space. Major challenges to DDR-targeted therapies in the post-PARPi therapy era are the context dependency of DDR alterations and the presence of preexisting resistance in this heavily pretreated population. Blood samples from patients with tumors harboring defects in DDR genes were used to evaluate the feasibility of a liquid biopsy platform to detect complex genomic events such as BRCA1/2 Experimental Design: Pretreatment ctDNA samples from 173 patients enrolled in two phase 1/2 clinical trials (TRESR; NCT04497116 NCT04972110 Results: In a phase I heavily pretreated patient population with DDR defects, complex genomic alterations (HRD, biallelic loss, and complex reversions) that historically require tumor tissue biopsies could be detected in ctDNA. Within the cohort of BRCA-associated tumor types previously treated with PARPi or platinum therapy, HRD reversions were detected in 44% of evaluable patients and included large genomic rearrangements leading to deletion of whole or partial exons which have been underrepresented in the literature because of technological limitations. Conclusions: This study showcases the genomic complexity of DDR-altered tumors as revealed through baseline ctDNA profiling, an understanding of which is crucial for the future clinical development of novel DDR-directed therapies and combinations. Repare Therapeutics Rimkunas V. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Translational Relevance Patient populations enrolled in early-phase clinical trials are often heavily pretreated and genetically heterogeneous, even in studies that utilize prospective biomarker selection. As a result, drug developers frequently face the challenge of interpreting the clinical efficacy of new agents without a comprehensive understanding of the contemporaneous tumor genomics. Technological advances in liquid biopsies have enabled researchers to assess the pretreatment genomic profiles and ctDNA fractions in this heavily pretreated, pan-cancer population, in which mechanisms of resistance to prior therapies may be at play. In this study, we aimed to evaluate the feasibility of a liquid biopsy platform to detect complex biomarkers, such as homologous recombination deficiency, biallelic loss-of-function alterations, and resistance mutations arising through large genomic rearrangements. Our findings support the use of liquid biopsy for real-time genomic assessment, particularly for complex biomarkers that could serve as predictors of synthetic lethal therapies targeting DNA damage response pathways, such as ATR, PARP1, and POL-θ. Introduction Homologous recombination deficiency (HRD) is commonly observed in BRCA-associated tumors (ovarian, breast, prostate, and pancreatic) typically harboring biallelic loss-of-function (LoF) of HRD-associated genes: BRCA1 BRCA2 PALB2 RAD51 RAD51B/C/D RAD51 PARP1 1 3 Among these mechanisms, reversion mutations, which restore HR activity, are the most well-characterized source of resistance to PARPi/platinum therapies ( 4 10 6 7 11 12 4 5 8 13 BRCA1/2 PALB2 RAD51p 4 10 4 5 8 13 15 BRCA2 16 Most previously characterized reversions are short variants that restore the coding sequences with minimal changes. However, larger, more complex genomic rearrangements significantly altering the amino acid sequence and domain structures in BRCA1/2 4 5 13 17 Gaining a better understanding of the spectrum and development of reversion mutations is critical for future therapeutic strategies to address PARPi/platinum therapy resistance. Without an understanding of a patient’s contemporaneous HR status, clinical trial efficacy results may be misinterpreted, and useful therapies may be underdeveloped due to a perceived lack of activity. A deeper understanding of the functional consequences of reversions may lead to more personalized therapies, including rechallenge with alternative or next-generation DNA damage response (DDR)-targeted agents in the appropriate clinical setting. Obtaining temporally matched tissue biospecimens to accurately assess HR status in these patients with advanced cancers has been challenging. Next-generation sequencing (NGS) of postprogression biopsies is rarely performed, and when it is, sampling biases can limit the detection of heterogeneous, polyclonal resistance. Conversely, ctDNA assays can detect diverse resistance mutations without sampling biases. Historically, ctDNA assays have been narrowly focused on exons and consequently lacked the ability to detect most large genomic rearrangements (LGR), and there is a high risk of false negative results for patients with low ctDNA burden ( 18 Therefore, we conducted a comprehensive analysis of ctDNA samples collected from patients enrolled in two phase 1/2 clinical trials evaluating the ataxia telangiectasia and RAD3-related kinase (ATR) inhibitor, camonsertib. We used this large cohort of molecularly selected patients consisting of BRCA-associated and other tumor types to evaluate the performance of a contemporary genomic and epigenomic ctDNA assay with enhanced gene coverage (including introns) for detecting reversions, HRD signatures, PV allele status, presence of clonal hematopoiesis (CH), and differentially methylated regions for accurate quantitation of TF. Materials and Methods Cohort and sample collection Between March 25th, 2021, and July 17th, 2023, blood was collected from subjects enrolled into two phase 1/2 clinical trials (TRESR; NCT04497116 NCT04972110 ATM ATRIP BRCA1 BRCA2 CDK12 CHTF8 FZR1 MRE11 NBN PALB2 RAD17 RAD51B/C/D REV3L RNASEH2A RNASEH2B SETD2 The study was conducted in accordance with the Declaration of Helsinki and Council for International Organizations of Medical Sciences International Ethical Guidelines, applicable International Conference on Harmonization guidelines, Good Clinical Practice guidelines, and applicable laws and regulations. All patients provided written informed consent to adhere to the clinical protocol and provided serial blood samples and tumor tissues. The protocol was approved by the Institutional Review Board or Ethics Committee at each participating institution (Supplementary Table S1). Blood for retrospective analysis was collected in two 10 mL K2-EDTA tubes before treatment and at one timepoint during each 21- or 28-day cycle. Plasma and buffy coats were isolated immediately following phlebotomy by centrifugation, frozen at −80°C, and bio-banked. Plasma and buffy coat aliquots were processed and analyzed in batches at Guardant Health. Cell-free and matched normal DNA sequencing Upon receipt of frozen plasma, cell-free DNA was extracted and sequenced at Guardant Health using the Guardant360 assay for genotyping and Guardant Reveal assay for sample-level ctDNA detection and TF quantification, both powered by the Guardant Infinity platform (Guardant Health, Inc.; ref. 19 Methylation-based ctDNA detection and TF quantification Methylation-based ctDNA detection was determined by Guardant Health using a logistic regression–based model trained on samples from multiple tumor types and cancer-free samples. TF quantification was determined using a model trained on samples from multiple solid tumor types, including breast, lung, colorectal, and bladder, to establish differentially methylated regions ( 20 Variant-based TF estimation Mean variant allelic frequency (mVAF) and CH-filtered mVAF (CH-mVAF) were used as additional proxies for detection of ctDNA and quantification of TF for comparison with methylation-based TF (methyl-TF). Detection and quantification of variants were performed by Guardant Health as described previously ( 13 21 21 CH prediction and CH detection For CH detection from paired plasma and buffy coat, a bioinformatics pipeline was used by Guardant Health to predict tumor or CH origin of nongermline variants by comparison of molecular support in each of the analytes. Variants with higher allele frequency in buffy coat and variants without statistically significant enrichment in plasma were predicted to be of CH origin, whereas all other variants detected in plasma were predicted to be of tumor origin. For CH prediction in plasma, a boosted tree model was trained on more than 200 plasma samples from cancer-free individuals ( N N 22 Loss of heterozygosity, ctDNA-based HRD, and allelic status determination in plasma Loss of heterozygosity (LOH) and HomDel calling in plasma was determined by Guardant Health using genomic coverage quantification and segmentation ( 23 24 26 27 predict BRCA1 BRCA2 28 29 Reversion detection Reversions were identified by the Guardant Health automated pipeline and by manual review. Reversion mutations in HRD-associated genes were defined and detected as previously described ( 11 30 31 Secondary variants were determined to be class I reversions if they met any of the following: I. Overlapped with the PV and reestablished the coding frame with minimal changes to the coding sequence. II. Were nonoverlapping but reestablished the coding frame with minimal changes to the coding sequence. Secondary variants were classified as class II reversions if they met any of the following: I. Abolished a splice-site in or proximal to the PV containing exon resulting in alternative, in-frame splicing. II. Excised exons containing the PV and the adjacent exons were in-frame. III. Adjusted the frame of an out-of-frame splicing event leading to productive, alternative, in-frame splicing. Exon splicing enhance/silencer analysis Intra-exon deletions were queried with Alamut Visual Plus v1.6.1 (Sophia Genetics). The EX-SKIP function was utilized to compare mutant and wild-type alleles to determine the likelihood of exon skipping ( 32 Tumor NGS Archival or contemporaneous tumor formalin-fixed paraffin-embedded samples were retrospectively sequenced using SNiPDx, a novel targeted sequencing panel capable of distinguishing monoallelic and biallelic LoF alterations in select DDR genes as previously described ( 33 34 35 33 34 35 Genome-wide major and minor copy numbers were inferred by FACETS ( 36 2 2 2 36 Tumor allelic status determination Tissue-based enrollment PV allelic status was determined by SNiPDx, whole-genome sequencing, or local NGS (where available). Enrollment genes were considered to have biallelic LoF if one of the following criteria was met: (i) HomDel; (ii) compound heterozygous mutation; (iii) mutation and LOH; or (iv) mutation and nonoverlapping loss. Enrollment genes were considered to have monoallelic loss if the following criteria were met: (i) mutation without LOH or (ii) heterozygous loss; genes were considered to have no loss if no mutation or copy-number loss was detected. Subclonal alterations were those in which the enrollment alteration was detectable at lower-than-expected VAF, upon adjustment for tumor purity, ploidy, and local copy number, or present only in some tumor biopsies. If central results were not available and local testing could detect any of the above events leading to biallelic loss, the gene was considered to have biallelic loss. If no result could be determined, the allelic status was labeled as unknown. Tumor HRD scoring Tumor HRD scores were derived using allele-specific copy-number data generated from the SNiPDx panel using ovaHRDscar ( 37 Data availability To minimize the risk of patient reidentification, data will only be shared upon reasonable request. For eligible studies, qualified researchers may request access to individual patient-level clinical data and additional raw biomarker data by emailing Repare Therapeutics, Inc ( info@reparerx.com Guardant Health ctDNA analysis methods are proprietary. No additional custom algorithms were used for the analysis. Figure generation was performed using R (v4.1) and tidyverse (v2.0.0.0.9). Results Cohort description and baseline genomic analysis Blood samples were obtained from patients participating in the phase 1/2 clinical trials TRESR ( NCT04497116 NCT04972110 Fig. 1A Table 1 BRCA1/2 Fig. 1B Figure 1. Study overview. A, B, RAD51p RAD51 RAD51B RAD51C RAD51D Table 1. Patient demographics. Characteristic Overall N Reversion evaluable N Trial, n ​ ​ TRESR ( NCT04497116 84 (49) 35 (47) ATTACC ( NCT04972110 89 (51) 40 (53) Age, median (minimum, maximum) 59 (25, 94) 60 (30, 94) Time since diagnosis; years median (IQR) 3.8 (2.5, 7.1) 4.1 (2.9, 7.4) Primary tumor, n ​ ​ Ovarian a 51 (29) 36 (48) Breast a 31 (18) 14 (19) Pancreatic a 20 (12) 14 (19) Prostate a 23 (13) 11 (15) Other 48 (27.7) 0 (0) Prior platinum or PARPi treatment, n ​ ​ PARPi/platinum 65 (38) 47 (63) PARPi only 20 (12) 18 (24) Platinum only 64 (37) 10 (13) Neither 24 (13) 0 (0) Enrollment gene, n ​ ​  BRCA1 b 45 (26) 33 (44)  BRCA2 b 54 (31) 32 (43)  PALB2 b 10 (6) 8 (10)  RAD51p b 5 (3) 2 (3)  ATM 43 (25) 0 (0)  CDK12 8 (5) 0 (0) Other 8 (5) 0 (0) Enrollment alteration origin, n ​ ​ Germline 107 (62) 62 (83) Somatic 56 (32) 13 (17) IHC 3 (2) 0 (0) Unknown 7 (4) 0 (0) Enrollment gene allele status, n ​ ​ Biallelic 86 (50) 44 (59) Not biallelic 23 (13) 4 (6) Unknown 64 (37) 27 (36) Reversion evaluable: BRCA-associated tumors with prior PARPi/platinum therapy and revertible HRD-associated enrollment genes. Other genes included RNASEH2 n SETD2 n IDH1 NBN RAD50 n TRESR ( NCT04497116 ATTACC ( NCT04972110 Abbreviations: N n a BRCA-associated tumors: breast, ovarian, pancreatic, and prostate cancers. b HRD-associated genes: BRCA1 BRCA2 PALB2 RAD51p Baseline ctDNA TF and correlation with disease burden ctDNA was detected by methylation-based analysis in 94% of baseline plasma samples [158/168; 5 failed methylation quality control (QC)] with a median methyl-TF of 6.2% (IQR: 24.7%; Fig. 2A R P r P Fig. 2B R P R P Figure 2. Baseline characterization of plasma samples. A, B, C, D, E, F, BRCA1 BRCA2 PALB2 RAD51p Detection of enrollment PV, allelic status, and HR status in ctDNA The enrollment PV (i.e., the BRCA1/2 or other DDR gene alteration on which patient entry into the trial population was based) was confirmed in baseline ctDNA from 142/166 evaluable patients (86%, 3 excluded for IHC enrollment and 4 excluded for QC failures; Fig. 2C P Fig. 2D P Biallelic LoF of DDR genes is thought to be a molecular determinant of response to synthetic lethal targeted therapies such as PARPi therapy ( 38 n n n P BRCA2 BRCA2 BRCA2 Genomic signatures of HRD are another complex biomarker typically restricted to tumor tissue analysis and are predictive of response to PARPis ( 39 BRCA1 BRCA2 PALB2 RAD51p Fig. 2E BRCA2 ATM n R P Fig. 2F Reversion detection in patients with HRD-associated tumors and genes To characterize reversion alterations and define the reversion evaluable cohort ( n Fig. 1B n n Fig. 3A Fig. 3B BRCA2 BRCA1 PALB2 RAD51 Fig. 3C Figure 3. Reversion detection in patients with BRCA-associated tumors and HRD PVs. A, B, C D, E, F, G, The median methyl-TF was not significantly different in patients with detected reversions (8.6%) compared with those with no reversions detected (7.7%: P Fig. 3D Deletions were the most common reversion alteration type, accounting for 76% (52/68) of all reversions and comprising 32 short deletions and 20 LGRs ( Fig. 3E n n n BRCA1 BRCA2 PALB2 Fig. 3A BRCA2 In HR-deficient tumors, microhomology-mediated end joining (MMEJ) is active and results in error-prone DNA repair leading to short deletions with microhomology, which has been reported to be a common characteristic of reversions ( 5 40 Fig. 3F P Reversion classification by impact on coding sequence Within our dataset, we observed two distinct classes of reversions, differentiated by the extent of their impact on protein sequence ( Fig. 3G n In contrast, class II ( n Fig. 4A–C 13 Fig. 3A BRCA2 Figure 4. Class II reversion impact on protein structure. A–C, A BRCA1 B BRCA2 C PALB2 D, BRCA1 E, BRCA1 The complexity of reversions can be highlighted by specific cases. A patient with castration-resistant prostate cancer harbored a somatic biallelic BRCA1 Fig. 4D BRCA1 Fig. 4E Alternative resistance to platinum and PARPi therapies In addition to reversion mutations in BRCA1/2 TP53BP1 SHLD1/2 PARP1 RIF1 LIG4 XRCC4 13 41 44 Fig. 3A TP53BP1 BRCA1 LIG4 RIF1 PARP1 BRCA1 BRCA2 n n BRCA1 TP53BP1 TP53BP1 RIF1 Detection of novel reversions in two patients with somatic ATM alterations Prior to this study, reversions were reported in only select HRD-associated genes (e.g., BRCA1/2 PALB2 RAD51 ATM Fig. 5 Table 2 Fig. 5A Fig. 5B Fig. 5B ATM. Figure 5. Discovery of ATM A, ATM B, ATM Table 2. Reversion alterations detected in two patients with somatic biallelic ATM alterations. Tumor type Gene Prior lines Prior platinum Primary Reversion cDNA (%VAF) AA Secondary cDNA (%VAF) Combined AA Breast  ATM 8 Carboplatin c.748C>T (77.93%) p.R250* c.749G>C (11.99%) p.R250S c.748_749delCGinsGT (0.64%) p.R250V CRC  ATM 4 Oxaliplatin c.2413C>T (29.35%) p.R805* c.2415A>C (3.23%) p.R805C c.2414G>C (0.45%) p.R805S Abbreviations: AA, amino acid; cDNA, coding DNA; CRC, colorectal cancer. Discussion Herein, we present a comprehensive set of ctDNA-based analyses in a pan-tumor cohort of patients with DDR alterations pretreated with PARPi and/or platinum-based chemotherapy. We report on the landscape of ctDNA detection of PVs, methyl-TF, cHRD calling, and the impact of CH filtering. Using our pipeline, we describe the largest pan-tumor set of mechanisms of resistance to PARPi/platinum therapies and the biological variety and breadth of reversions. We classify these reversions into two groups: class I, with minimal impact on protein sequence, and class II, with significant effects on protein sequence and domain structure. A significant proportion of these class II reversions may have gone undetected by earlier-generation ctDNA-based assays with limited intron coverage of DDR or other putative resistance genes. We show several key findings related to the utility of ctDNA testing in this context. First, the high confirmation rate reported here for DDR and HR-associated PVs is encouraging; and we extend these data showing that tumor shedding as measured by methyl-TF is a key factor in the identification of somatic PVs, particularly for LGRs. Second, whereas variant-based estimates of TF are commonly used, they often overestimate TF due to the small number of variants sampled, and this TF estimate can be greatly affected by copy-number changes or erroneous annotation of CH variants. Whereas most CH variants arise in CH-associated genes, relevant tumor driver genes such as TP53 ATM 45 48 ATM The detection rate (44%) of reversion alterations across BRCA-associated tumor types with revertible alterations, along with the high frequency of deletions and LGRs, suggests that the true prevalence of reversions after PARPi/platinum therapy is higher than previously reported using tumor NGS or earlier generations of ctDNA panels ( 4 8 11 15 4 8 11 15 13 49 50 Whereas reversions are the most frequently described resistance mechanism, we also identified putative resistance alterations in TP53BP1 PARP1 RIF1 LIG4 41 PARP1 42 43 44 13 This work has several implications for early-phase DDR clinical trial design. Multiple DDR-directed therapies are in development against targets such as ATR, ATM, DNA-PK, DNA polymerase θ, alone or in combination with PARPis, chemotherapy, or other agents ( 2 51 This study has several limitations. First, whereas modest correlations were observed between baseline methyl-TF and radiographic measurements, nontarget lesions were not included in the quantification, and therefore the total tumor burden may not accurately be reflected. In prior analysis, when total volume of discrete and nondiscrete lesions was considered in a study of patients with HRD-positive metastatic breast cancer, methyl-TF closely mirrored radiologic assessment of tumor volume over time ( 13 52 53 54 55 BRCA1 BRCA2 13 17 in vitro in vitro 1 3 This analysis highlights the potential utility of comprehensive genomic and epigenomic ctDNA profiling and the complexity of acquired resistance to standard-of-care targeted agents in this heterogeneous group of patients. In an era of mechanism-based therapies, future success of DDR therapies will be predicated on the intelligent use of similar data to guide and develop future clinical trials. Supplementary Material Supplementary Methods S1 Supplemental methods Supplementary Table S1 Study representation Supplementary Table S2 Details of reversion alterations in reversion evaluable patients Supplementary Figure S1 Relationship between genomic and epigenomic measures of tumor fraction. Supplementary Figure S2 Relationship between TF measures and clinical disease burden. Supplementary Figure S3 ctDNA-based enrollment PV detection and allelic status calls. Supplementary Figure S4 cHRD scores based on tumor type, genotype and tumor or ctDNA-derived allelic status. Supplementary Figure S5 Reversion detection by clinical and genomic characteristics. Supplementary Figure S6 a, b) Lollipop plot of the a) TP53BP1 and b) RIF1 mutations identified in a patient with BRCA1-altered pancreatic cancer. Supplementary Figure S7 IGV screenshots for two patients with ATM reversions. Acknowledgments We thank all the patients and families for their participation in clinical research and thank Parham Nejad, Ayat Alsaraby, and Deepa Parthasarathy (Repare Therapeutics) for ensuring quality biobanking and data acquisition. We thank Adrienne Johnson (Repare Therapeutics) for implementing the ovaHRDScar pipeline and Brooke Overstreet (Guardant Health) for critical manuscript review. Figure preparation and submission support were provided by Allison Alwan TerBush, PhD, and Rosie Henderson, MSc, of Onyx (a division of Prime, London, United Kingdom). This work was funded by Repare Therapeutics, Inc., and Guardant Health, Inc.  Note: http://clincancerres.aacrjournals.org/ Authors’ Disclosures I.M. Silverman reports personal fees from Repare Therapeutics during the conduct of the study and outside the submitted work. J.D. Schonoft reports personal fees from Repare Therapeutics during the conduct of the study. B. Herzberg reports grants from the NIH during the conduct of the study, as well as grants and personal fees from Amgen, Astellas, Ideaya Therapeutics, Monte Rosa Therapeutics, Eli Lilly, AstraZeneca, Daiichi Sankyo, and Revolution Medicines and grants from Nested Therapeutics, Repare Therapeutics, Prelude Therapeutics, and Roche/Genentech outside the submitted work. A. Yablonovitch reports other support from Guardant Health outside the submitted work; in addition, A. Yablonovitch has a patent for “Homologous recombination repair deficiency detection\" pending. E. Lagow reports other support from Guardant Health, Inc., during the conduct of the study and outside the submitted work. P.C. Fiaux reports other support from Guardant Health during the conduct of the study and outside the submitted work. P. Safabakhsh reports a patent for “Methods and compositions for homologous recombination deficiency detection” pending to Guardant Health. D. Ulanet was an employee of and holds stock in Repare Therapeutics. J. Yang reports employment by Repare Therapeutics and holds stock and stock options in Repare Therapeutics. I. Kim reports other support from Repare Therapeutics during the conduct of the study and outside the submitted work. M. Cecchini reports other support from Repare Therapeutics during the conduct of the study, as well as personal fees from Seattle Genetics, Taiho Pharmaceutical, Regeneron, Incendia Therapeutics, Agenus, Elevate Oncology, Loxo@Lilly, AstraZeneca, Daiichi Sankyo, BeiGene, Arcus, Modifi Bio, Incyte, AbbVie, Parabalis Medicines, and Wren Therapeutics and grants from the NIH (1K08CA255465-01A1) outside the submitted work. E. Lee reports personal fees from OnCusp Therapeutics, Genmab, OncLive, and Aadi Bioscience and other support from the GOG Foundation, Aadi Bioscience, Oncusp Therapeutics, KSQ Therapeutics, Roche, Merck, Seagen, Repare Therapeutics, and Profound Bio/Genmab outside the submitted work. S. Lheureux reports grants from Repare Therapeutics during the conduct of the study, as well as grants and personal fees from AstraZeneca and GSK, personal fees from AbbVie, Gilead, and Merck, and grants from Schrodinger and Roche outside the submitted work. E. Fontana reports grants from Acerta Pharma, ADC Therapeutics, Amgen, Arcus Biosciences, Array BioPharma, Artios Pharma, Astellas Pharma, AstraZeneca, Basilea, Bayer, BeiGene, BicycleTx, BioNTech, Blueprint Medicines, Boehringer Ingelheim, Calithera Biosciences, Carrick Therapeutics, Casi Pharmaceuticals, Clovis Oncology, Crescendo Biologics, CytomX Therapeutics, Daiichi Sankyo, Deciphera, Eli Lilly, Ellipses, Erasca, Exelixis, F. Hoffmann-La Roche, Fore Biotherapeutics, G1 Therapeutics, Genentech, GSK, H3 Biomedicine, Hutchinson, MediPharma, Immunocore, Immunomedics, Incyte, Instil Bio, Iovance, Janssen, Jiangsu Hengrui, Kronos Bio, Lupin, MacroGenics, Menarini, Merck KGaA, Mereo BioPharma, Merus, Millennium, MSD, Nerviano Medical, Nurix Therapeautics, Oncologie, Oxford Vacmedix, Pfizer, Plexxikon, QED Therapeutics, Relay Therapeutics, Repare Therapeutics, Ribon Therapeutics, Sapience, Seagen, Servier, Stemline, Synthon Biopharmaceuticals, Taiho, Tesaro, Turning Point, PMV Pharma, and Takeda during the conduct of the study, as well as personal fees from Astellas, Pfizer, BicycleTx, Bristol Myers Squibb, Repare Therapeutics, CARIS Life Sciences, Seagen, Sapience, and Erasca outside the submitted work and association with the European Organization for Research and Treatment of Cancer (EORTC), acting as GITCG secretary (2021–2023), and participating in the ASCO Annual Meeting Scientific Program Committee GI cancers, Colorectal and Anal Track (2024–2026). B.A. Carneiro reports other support from Repare Therapeutics during the conduct of the study and other support from AstraZeneca, AbbVie, Actuate Therapeutics, Agenus, Astellas, Bayer, Daiichi Sankyo, Dragonfly Therapeutics, Mink Therapeutics, Pfizer, Pyxis Oncology, Regeneron, AbbVie, Eisai, and ADC Therapeutics outside the submitted work. J.S. Reis-Filho reports personal fees and other support from AstraZeneca and personal fees from Saga Diagnostics, Personalis, Volition Rx, Goldman Sachs, Oncoclinicas, Paige.AI, and Repare Therapeutics outside the submitted work. T.A. Yap reports other support from the University of Texas MD Anderson Cancer Center, AbbVie, Acrivon, Adagene, Aeneid Therapeutics, Almac, Alterome Therapeutics, Aduro, Amgen, Amphista, Astex, Atavistik, Athena, Atrin, Avenzo, Avoro, Axiom, Baptist Health Systems, Bicycle, BioCity Pharma, Bloom Burton, Boxer, Bristol Myers Squibb, C4 Therapeutics, Calithera, Cancer Research Horizons/Cancer Research UK, Carrick Therapeutics, Clasp, Cybrexa, Daiichi Sankyo, DAiNA, Dark Blue Therapeutics, Dawn Manco, Debiopharm, Diffusion, Duke Street Bio, EcoR1 Capital, Eikon, Ellipses Pharma, Entos, Flagship Pioneering, Forbion, FoRx Therapeutics AG, Genesis Therapeutics, Genmab, Glenmark, GLG, Globe Life Sciences, Gray Wolf Therapeutics, GSK, Guardant, Guidepoint, Idience, Ignyta, I-Mab, Impact Therapeutics, Institut Gustave Roussy, Intellisphere, Jansen, Jazz Pharma, the Joint Scientific Committee for Phase I Trials in Hong Kong, Kyn, Lumanity, MEI Pharma, Mereo, Merck, Merit, Monte Rosa Therapeutics, Natera, Nested Therapeutics, Nexus Pharmaceuticals, Nimbus, Novocure, Odyssey Therapeutics, OHSU, OncoSec, Ono Pharma, Onxeo, Piper-Sandler, Plexium, Prolynx, Protai Bio, PSIM, Radiopharma Theranostics, resTORbio, Ryvu Therapeutics, SAKK, Schrodinger, Servier, Stablix, Synthis Therapeutics, TCG Crossover, TD2, Techspert.io, Terremoto Biosciences, Tessellate Bio, Theragnostics, Terns Pharmaceuticals, Thryv Therapeutics, Tolremo, Tome Biosciences, Trevarx Biomedical, Varian, Veeva, Versant, Vibliome Therapeutics, Voronoi, Xinthera, and Zai Labs, grants and personal fees from Artios, AstraZeneca, Bayer, BeiGene, Blueprint, Bluestar Bio, BridGene Biosciences, Circle Pharma, Clovis, 858 Therapeutics, EMD Serono, F-Star, Ideaya Biosciences, ImmuneSensor, Kyowa Kirin, Pfizer, Pliant Therapeutics, Prelude Therapeutics, Repare Therapeutics, Roche, Sanofi, Synnovation, Tango, and Vivace, and grants from Accent, Aprea Therapeutics, BioNTech, Bristol Myers Squibb, Boundless Bio, Constellation, CPRIT, Cyteir, the Department of Defense, Eisbach Bio, Eli Lilly, Exelixis, Forbius, Gilead, GSK, Genentech, Golfers Against Cancer, Haihe, Insilico Medicine, Ionis, Ipsen, Jounce, Karyopharm, KSQ, Loxo Oncology, Mirati, Novartis, NIH/NCI, Ribon Therapeutics, Regeneron, Rubius, Scholar Rock, Seattle Genetics, SpringWorks, Tesaro, V Foundation, Zenith, and Zentalis outside the submitted work. M. Zinda reports personal fees and other support from Repare Therapeutics during the conduct of the study. No disclosures were reported by the other authors. Authors’ Contributions  I.M. Silverman: J.D. Schonoft: B. Herzberg: A. Yablonovitch: E. Lagow: P.C. Fiaux: P. Safabakhsh: S. Sethuraman: D. Ulanet: J. Yang: I. Kim: P. Basciano: M. Cecchini: E. Lee: S. Lheureux: E. Fontana: B.A. Carneiro: J.S. Reis-Filho: T.A. Yap: M. Zinda: E.Y. Rosen: V. Rimkunas: Disclaimer The Editor-in-Chief of Clinical Cancer Research Clinical Cancer Research References 1. D’Andrea AD Mechanisms of PARP inhibitor sensitivity and resistance DNA Repair 2018 71 172 6 30177437 10.1016/j.dnarep.2018.08.021 2. Bhamidipati D Haro-Silerio JI Yap TA Ngoi N PARP inhibitors: enhancing efficacy through rational combinations Br J Cancer 2023 129 904 16 37430137 10.1038/s41416-023-02326-7 PMC10491787 3. Baxter JS Zatreanu D Pettitt SJ Lord CJ Resistance to DNA repair inhibitors in cancer Mol Oncol 2022 16 3811 27 35567571 10.1002/1878-0261.13224 PMC9627783 4. Tobalina L Armenia J Irving E O’Connor MJ Forment JV A meta-analysis of reversion mutations in BRCA genes identifies signatures of DNA end-joining repair mechanisms driving therapy resistance Ann Oncol 2021 32 103 12 33091561 10.1016/j.annonc.2020.10.470 5. Pettitt SJ Frankum JR Punta M Lise S Alexander J Chen Y Clinical BRCA1/2 reversion analysis identifies hotspot mutations and predicted neoantigens associated with therapy resistance Cancer Discov 2020 10 1475 88 32699032 10.1158/2159-8290.CD-19-1485 PMC7611203 6. Norquist B Wurz KA Pennil CC Garcia R Gross J Sakai W Secondary somatic mutations restoring BRCA1/2 predict chemotherapy resistance in hereditary ovarian carcinomas J Clin Oncol 2011 29 3008 15 21709188 10.1200/JCO.2010.34.2980 PMC3157963 7. Patch A Christie EL Etemadmoghadam D Garsed DW George J Fereday S Whole-genome characterization of chemoresistant ovarian cancer Nature 2015 521 489 94 26017449 10.1038/nature14410 8. Loehr A Hussain A Patnaik A Bryce AH Castellano D Font A Emergence of BRCA reversion mutations in patients with metastatic castration-resistant prostate cancer after treatment with rucaparib Eur Urol 2023 83 200 9 36243543 10.1016/j.eururo.2022.09.010 PMC10398818 9. Kristeleit R Lisyanskaya A Fedenko A Dvorkin M de Melo AC Shparyk Y Rucaparib versus standard-of-care chemotherapy in patients with relapsed ovarian cancer and a deleterious BRCA1 or BRCA2 mutation (ARIEL4): an international, open-label, randomised, phase 3 trial Lancet Oncol 2022 23 465 78 35298906 10.1016/S1470-2045(22)00122-X 10. Goodall J Mateo J Yuan W Mossop H Porta N Miranda S Circulating cell-free DNA to guide prostate cancer treatment with PARP inhibition Cancer Discov 2017 7 1006 17 28450425 10.1158/2159-8290.CD-17-0261 PMC6143169 11. Sakai W Swisher EM Karlan BY Agarwal MK Higgins J Friedman C Secondary mutations as a mechanism of cisplatin resistance in BRCA2-mutated cancers Nature 2008 451 1116 20 18264087 10.1038/nature06633 PMC2577037 12. Edwards SL Brough R Lord CJ Natrajan R Vatcheva R Levine DA Resistance to therapy caused by intragenic deletion in BRCA2 Nature 2008 451 1111 5 18264088 10.1038/nature06548 13. Harvey-Jones E Raghunandan M Robbez-Masson L Magraner-Pardo L Alaguthurai T Yablonovitch A Longitudinal profiling identifies co-occurring BRCA1/2 reversions, TP53BP1, RIF1 and PAXIP1 mutations in PARP inhibitor-resistant advanced breast cancer Ann Oncol 2024 35 364 80 38244928 10.1016/j.annonc.2024.01.003 14. Vidula N Rich TA Sartor O Yen J Hardin A Nance T Routine plasma-based genotyping to comprehensively detect germline, somatic, and reversion BRCA mutations among patients with advanced solid tumors Clin Cancer Res 2020 26 2546 55 32034076 10.1158/1078-0432.CCR-19-2933 15. Carneiro BA Collier KA Nagy RJ Pamarthy S Sagar V Fairclough S Acquired resistance to poly (ADP-ribose) polymerase inhibitor olaparib in BRCA2-associated prostate cancer resulting from biallelic BRCA2 reversion mutations restores both germline and somatic loss-of-function mutations JCO Precis Oncol 2018 2 1 8 10.1200/PO.17.00176 PMC6732782 31501807 16. Carreira S Porta N Arce-Gallego S Seed G Llop-Guevara A Bianchini D Biomarkers associating with PARP inhibitor benefit in prostate cancer in the TOPARP-B trial Cancer Discov 2021 11 2812 27 34045297 10.1158/2159-8290.CD-21-0007 PMC9414325 17. Nesic K Krais JJ Wang Y Vandenberg CJ Patel P Cai KQ BRCA1 secondary splice-site mutations drive exon-skipping and PARP inhibitor resistance Mol Cancer 2024 23 158 39103848 10.1186/s12943-024-02048-1 PMC11299415 18. Husain H Pavlick DC Fendler BJ Madison RW Decker B Gjoerup O Tumor fraction correlates with detection of actionable variants across > 23,000 circulating tumor DNA samples JCO Precis Oncol 2022 6 e2200261 36265119 10.1200/PO.22.00261 PMC9616642 19. Jiang T Wu I Kim Y Alla N Tran G Ma D Abstract 6601: analytical validation of a robust integrated genomic and epigenomic liquid biopsy for biomarker discovery, therapy selection, and response monitoring Cancer Res 2023 83 6601 20. Gross A Zhao J Quinn K Chen S Chang K Barbacioru C Abstract 5936: landscape of epigenomic tumor fraction in large pan-cancer cfDNA cohort Cancer Res 2025 85 5936 21. Odegaard JI Vincent JJ Mortimer S Vowles JV Ulrich BC Banks KC Validation of a plasma-based comprehensive cancer genotyping assay utilizing orthogonal tissue- and plasma-based methodologies Clin Cancer Res 2018 24 3539 49 29691297 10.1158/1078-0432.CCR-17-3831 22. Fiaux PC Cai M Safabakhsh P Werbin JL Lee CY Quinn K Abstract 6603: analytical validation of a new plasma-only bioinformatics classifier to identify variants from clonal hematopoiesis (CH) in cfDNA liquid biopsy assays Cancer Res 2025 85 6603 23. Olshen AB Venkatraman ES Lucito R Wigler M Circular binary segmentation for the analysis of array-based DNA copy number data Biostatistics 2004 5 557 72 15475419 10.1093/biostatistics/kxh008 24. Carter SL Cibulskis K Helman E McKenna A Shen H Zack T Absolute quantification of somatic DNA alterations in human cancer Nat Biotechnol 2012 30 413 21 22544022 10.1038/nbt.2203 PMC4383288 25. Riester M Singh AP Brannon AR Yu K Campbell CD Chiang DY PureCN: copy number calling and SNV classification using targeted short read sequencing Source Code Biol Med 2016 11 13 27999612 10.1186/s13029-016-0060-z PMC5157099 26. Van Loo P Nordgard SH Lingjærde OC Russnes HG Rye IH Sun W Allele-specific copy number analysis of tumors Proc Natl Acad Sci U S A 2010 107 16910 5 20837533 10.1073/pnas.1009843107 PMC2947907 27. Gross A Wang H Tolkunov D Jenkins C Wienke S Barbacioru C Abstract 406: characterization of whole genome duplication in a genomic cohort of over 14000 cell free DNA samples Cancer Res 2024 84 406 28. Safabakhsh P Tolkunov D Overstreet B Jenkins C Barbacioru C Zhang S HRD status prediction in patients with advanced breast, prostate, ovarian and pancreatic cancers in a liquid biopsy assay JCO 2025 43 3074 29. Overstreet B Safabakhsh P Espenschied CR Tsai J Barbacioru C Lin B Association between epigenomic biomarkers and baseline clinical characteristics in patients with mCRPC treated with rucaparib in TRITON2 JCO 2025 43 5086 30. Brown TJ Yablonovitch A Till JE Yen J Kiedrowski LA Hood R The clinical implications of reversions in patients with advanced pancreatic cancer and pathogenic variants in BRCA1, BRCA2, or PALB2 after progression on rucaparib Clin Cancer Res 2023 29 5207 16 37486343 10.1158/1078-0432.CCR-23-1467 PMC10806928 31. Lin KK Harrell MI Oza AM Oaknin A Ray-Coquard I Tinker AV BRCA reversion mutations in circulating tumor DNA predict primary and acquired resistance to the PARP inhibitor rucaparib in high-grade ovarian carcinoma Cancer Discov 2019 9 210 19 30425037 10.1158/2159-8290.CD-18-0715 32. Raponi M Kralovicova J Copson E Divina P Eccles D Johnson P Prediction of single-nucleotide substitutions that result in exon skipping: identification of a splicing silencer in BRCA1 exon 6 Hum Mutat 2011 32 436 44 21309043 10.1002/humu.21458 33. Glodzik D Selenica P Rogge RA Silverman IM Mandelker D Harris S Detection of biallelic loss of DNA repair genes in formalin-fixed, paraffin-embedded tumor samples using a novel tumor-only sequencing panel J Mol Diagn 2023 25 295 310 36944408 10.1016/j.jmoldx.2023.02.004 PMC10340082 34. Yap TA Fontana E Lee EK Spigel DR Højgaard M Lheureux S Camonsertib in DNA damage response-deficient advanced solid tumors: phase 1 trial results Nat Med 2023 29 1400 11 37277454 10.1038/s41591-023-02399-0 PMC10287555 35. Zheng Z Liebers M Zhelyazkova B Cao Y Panditi D Lynch KD Anchored multiplex PCR for targeted next-generation sequencing Nat Med 2014 20 1479 84 25384085 10.1038/nm.3729 36. Shen R Seshan VE FACETS: allele-specific copy number and clonal heterogeneity analysis tool for high-throughput DNA sequencing Nucleic Acids Res 2016 44 e131 27270079 10.1093/nar/gkw520 PMC5027494 37. Perez-Villatoro F Oikkonen J Casado J Chernenko A Gulhan DC Tumiati M Optimized detection of homologous recombination deficiency improves the prediction of clinical outcomes in cancer NPJ Precis Onc 2022 6 96 10.1038/s41698-022-00339-8 PMC9800569 36581696 38. Setton J Zinda M Riaz N Durocher D Zimmermann M Koehler M Synthetic lethality in cancer therapeutics: the next generation Cancer Discov 2021 11 1626 35 33795234 10.1158/2159-8290.CD-20-1503 PMC8295179 39. Miller RE Leary A Scott CL Serra V Lord CJ Bowtell D ESMO recommendations on predictive biomarker testing for homologous recombination deficiency and PARP inhibitor benefit in ovarian cancer Ann Oncol 2020 31 1606 22 33004253 10.1016/j.annonc.2020.08.2102 40. Ceccaldi R Liu JC Amunugama R Hajdu I Primack B Petalcorin MIR Homologous-recombination-deficient tumours are dependent on Polθ-mediated repair Nature 2015 518 258 62 25642963 10.1038/nature14184 PMC4415602 41. Panier S Boulton SJ Double-strand break repair: 53BP1 comes into focus Nat Rev Mol Cell Biol 2014 15 7 18 24326623 10.1038/nrm3719 42. Noordermeer SM Adam S Setiaputra D Barazas M Pettitt SJ Ling AK The shieldin complex mediates 53BP1-dependent DNA repair Nature 2018 560 117 21 30022168 10.1038/s41586-018-0340-7 PMC6141009 43. Conlin MP Reid DA Small GW Chang HH Watanabe G Lieber MR DNA ligase IV guides end-processing choice during nonhomologous end joining Cell Rep 2017 20 2810 19 28930678 10.1016/j.celrep.2017.08.091 PMC5649367 44. Zhao B Rothenberg E Ramsden DA Lieber MR The molecular basis and disease relevance of non-homologous DNA end joining Nat Rev Mol Cell Biol 2020 21 765 81 33077885 10.1038/s41580-020-00297-8 PMC8063501 45. Hu Y Ulrich BC Supplee J Kuang Y Lizotte PH Feeney NB False-positive plasma genotyping due to clonal hematopoiesis Clin Cancer Res 2018 24 4437 43 29567812 10.1158/1078-0432.CCR-18-0143 46. Kar SP Quiros PM Gu M Jiang T Mitchell J Langdon R Genome-wide analyses of 200,453 individuals yield new insights into the causes and consequences of clonal hematopoiesis Nat Genet 2022 54 1155 66 35835912 10.1038/s41588-022-01121-z PMC9355874 47. Bick AG Weinstock JS Nandakumar SK Fulco CP Bao EL Zekavat SM Inherited causes of clonal haematopoiesis in 97,691 whole genomes Nature 2020 586 763 8 33057201 10.1038/s41586-020-2819-2 PMC7944936 48. Fabre MA de Almeida JG Fiorillo E Mitchell E Damaskou A Rak J The longitudinal dynamics and natural history of clonal haematopoiesis Nature 2022 606 335 42 35650444 10.1038/s41586-022-04785-z PMC9177423 49. Setton J Reis-Filho JS Powell SN Homologous recombination deficiency: how genomic signatures are generated Curr Opin Genet Dev 2021 66 93 100 33477018 10.1016/j.gde.2021.01.002 PMC8377996 50. Setton J Hadi K Choo ZN Kuchin KS Tian H Da Cruz Paula A Long-molecule scars of backup DNA repair in BRCA1- and BRCA2-deficient cancers Nature 2023 621 129 37 37587346 10.1038/s41586-023-06461-2 PMC10482687 51. Ngoi NYL Westin SN Yap TA Targeting the DNA damage response beyond poly(ADP-ribose) polymerase inhibitors: novel agents and rational combinations Curr Opin Oncol 2022 34 559 69 35787597 10.1097/CCO.0000000000000867 PMC9371461 52. Tjokrowidjaja A Friedlander ML Ledermann JA Coleman RL Mirza MR Matulonis UA Poor concordance between cancer antigen-125 and RECIST assessment for progression in patients with platinum-sensitive relapsed ovarian cancer on maintenance therapy with a poly(ADP-ribose) polymerase inhibitor J Clin Oncol 2024 42 1301 10 38215359 10.1200/JCO.23.01182 53. Matsas A Stefanoudakis D Troupis T Kontzoglou K Eleftheriades M Christopoulos P Tumor markers and their diagnostic significance in ovarian cancer Life 2023 13 1689 37629546 10.3390/life13081689 PMC10455076 54. Vicini FA Vargas C Abner A Kestin L Horwitz E Martinez A Limitations in the use of serum prostate specific antigen levels to monitor patients after treatment for prostate cancer J Urol 2005 173 1456 62 15821460 10.1097/01.ju.0000157323.55611.23 55. Fleming MT Morris MJ Heller G Scher HI Post-therapy changes in PSA as an outcome measure in prostate cancer clinical trials Nat Clin Pract Oncol 2006 3 658 67 17139317 10.1038/ncponc0664 ",
  "metadata": {
    "Title of this paper": "Post-therapy changes in PSA as an outcome measure in prostate cancer clinical trials",
    "Journal it was published in:": "Clinical Cancer Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485378/"
  }
}