{
  "title": "Paper_1154",
  "abstract": "pmc Toxics Toxics 3287 toxics toxics Toxics 2305-6304 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473478 PMC12473478.1 12473478 12473478 41012343 10.3390/toxics13090722 toxics-13-00722 1 Article DALYs-Based Health Risk Assessment and Key Influencing Factors of PM 2.5 Zhao Ting 1 Qu Kai 2 Ma Fenghua 3 Liang Yuhan 1 Wang Ziquan 1 Liu Jieyu 1 Liang Hao 1 Wei Min 3 Liu Houfeng 3 * https://orcid.org/0000-0002-9861-3731 Wang Pingping 1 * Larcombe Alexander N. Academic Editor 1 202200222003@mail.sdu.edu.cn 2 3 * 110027@sdnu.edu.cn mwangdp@sdu.edu.cn 28 8 2025 9 2025 13 9 497672 722 18 7 2025 14 8 2025 27 8 2025 28 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The health risks of PM 2.5 2.5 2.5 3 3 2.5 PM 2.5 health risk assessment disease burden XGBoost National Natural Science Foundation of China 22106178 National Key Research and Development Program of China 2023YFC3710200 This work was supported by the National Natural Science Foundation of China [Grant No. 22106178] and by the National Key Research and Development Program of China [Grant No. 2023YFC3710200]. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Atmospheric fine particulate matter (PM 2.5 2.5 1 2 3 Given the varying toxicity and mechanisms of action of metals in PM 2.5 https://www.gov.cn/zwgk/2013-09/12/content_2486773.htm 2.5 4 5 6 2.5 2.5 7 8 9 2.5 2.5 10 11 12 2.5 Traditional health risk assessments usually evaluate carcinogenic and non-carcinogenic risks separately, lacking a unified metric that hinders comprehensive comparisons across metals and sources. Disability-adjusted life years (DALYs) integrate years lost due to premature death, years lived with disability, and morbidity, providing a comprehensive metric to assess the complex toxic effects of metals. The DALYs method supports source analysis, detailed disease-level studies, and systematic assessments of environmental pollution’s burden on public health, offering policymakers intuitive and quantifiable socio-economic impact data for more effective public health policies. DALYs have been used to estimate the health burden of pollutants like PM 2.5 13 14 15 16 2.5 2.5 This study conducted continuous hourly monitoring of PM 2.5 2.5 2.5 2. Methods 2.1. Environmental Sampling and Monitoring Analysis The observation points for this study cover 15 cities in Shandong Province ( Figure S1 2.5 2.5 ® 2.5 Table S1 2.5 2.2. PMF Analysis This study conducted quantitative source apportionment using the EPA PMF 5.0 (USEPA) method, following the user guide of EPA PMF 5.0 [ 17 (1) X i j = ∑ k = 1 p  g i k f k j + e i j i j k X ij j i g ik k i f kj j k e ij Q Q (2) Q = ∑ i = 1 n  ∑ j = 1 m  ( e i j u i j ) 2 n m u ij j i 18 (3) u i j = 5 / 6 × M D L When the concentration is above the MDL (Equation (4)): (4) U i j = ( E r r o r f r a c t i o n × c o n c e n t r a t i o n ) 2 + ( 0.5 × M D L ) 2 The error fraction is typically set at 5% [ 19 2.3. Burden of Disease Assessment This study uses disability-adjusted life years (DALY) as a metric to evaluate the disease burden caused by pollutants and quantify the cumulative health effects of air pollutants. DALY refers to the total years of healthy life lost due to illness or death, including years of life lost (YLL) due to premature death and years lived with disability (YLD) due to disability. The calculation formula is shown in Equations (5)–(8), and the specific weight parameters are sourced from the Global Burden of Disease Study 2021 (GBD 2021), available at the database ( https://vizhub.healthdata.org/gbd-results/ Table S2 (5) D A L Y = Y L L + Y L D (6) Y L L i n d = Y L L / N (7) Y L D i n d = Y L D / P (8) D A L Y i n d = Y L L i n d + Y L D i n d In the equation, YLL ind ind ind This study selects major sub-chronic and chronic toxic effects and disease manifestations as evaluation endpoints. Inhalation is the primary route for PM 2.5 20 Tables S3 and S4 21 (9) N O A E L = L O A E L / 3.81 (10) B M C 10 = 1.96 × N O A E L (11) I U R = 0.10 / B M C 10 In this context, NOAEL LOAEL 3 Next, the average exposure concentration (EC) is calculated using Equations (12) and (13). It is important to note that the EC calculation process considers age-sensitive differences in carcinogenic effects. The exposed population is divided into three physiological stages: infants (<2 years old), children (2–16 years old), and adults (>16 years old). The formulas for calculating carcinogenic and non-carcinogenic exposure concentrations (ng/m 3 (12) E C c = C × E F × [ ( E D | < 2 | × A D A F | < 2 | ) + ( E D | 2 ∼ 16 | × A D A F | 2 ∼ 16 | ) + ( E D | > 16 | × A D A F | > 16 | ) ] L T (13) E C n c = C × E F × E D A T C 3 EF 22 ED 23 ADAF ADAF ADAF ADAF 24 AT LT The excess number of cases for each disease is calculated by multiplying the pollutant EC IUR http://tjj.shandong.gov.cn (14) N P n c = E C n c , j × T P × I U R i (15) N P c = E C c , j × T P × I U R i The total burden of disease ( BOD (16) ∑ B O D = ∑ i = 1 n  N P n c × D A L Y i n d , i A + ∑ j = 1 m  N P c × D A L Y i n d , j A 2.4. XGBoost Regression Model This study employs an XGBoost (eXtreme Gradient Boosting) regression framework to model the factors potentially influencing heavy metal concentrations [ 25 2.5 2 Table 1 2 26 2.5. SHAP-Based Model Interpretation To elucidate the outputs of the XGBoost regression model, we employed SHAP (SHapley Additive exPlanations), a game-theory-inspired framework that quantifies the marginal contribution of each feature to individual predictions. Grounded in Shapley values from cooperative game theory, SHAP systematically evaluates the incremental effect of every feature under all possible coalitions, thereby assigning a precise, additive contribution score to each variable for any given prediction. 2.6. Data Statistical Analysis The Shapiro–Wilk test and Levene’s test were used to assess data normality and homogeneity of variance, respectively. For two groups of normally distributed data with homogeneous variances, an independent samples t p 3. Results and Discussion 3.1. Spatial Distribution of PM 2.5 During 2022–2024, the concentrations of 17 metals in PM 2.5 2.5 Figures S2–S5 p −5 p p p Figure S3 p Figure S4 27 Figure S5 2.5 Additionally, among all observed elements, Ca and K had the highest annual average concentrations, ranging from 20 ng/m 3 3 3 3 Figure S2, Table S5 3 3 Figure S2, Table S5 3 3 3 3 3 3 3 3 3 3 3 28 Figure S2, Table S5 The composition characteristics of PM 2.5 2.5 Figure 1 3.2. Temporal Distribution of PM 2.5 This study compares the annual average variations in PM 2.5 Figure 2 29 Figure 2 30 During the observation period, the temporal characteristics of the concentration proportions of PM 2.5 3.3. Source Apportionment of PM 2.5 Based on a comprehensive evaluation of the physical meanings of the factors identified by the PMF model, the Q values and the coefficients of determination (R 2 31 32 33 34 35 36 37 38 39 40 41 42 43 The emission source composition of 17 PM 2.5 Figure 3 Figure S6 44 The concentration of metal pollution from coal combustion sources is higher in inland areas than in coastal regions. Additionally, there are differences in primary metal emissions from industrial sources between inland and coastal cities. Specifically, the coastal region of eastern Shandong has a more developed electronics and information industry [ 45 46 Figure S7 Figure 3 3.4. Disease Burden Attributed to PM 2.5 From 2022 to 2024, the health burden caused by PM 2.5 Table 2 Table 1 Figure 4 2.5 Figure S2, Table S5 Chronic kidney disease (CKD), interstitial lung disease, and chronic respiratory diseases were identified as the top three contributors to the disease burden caused by PM 2.5 Figure 4 Table S2 2.5 Figure S5 47 2.5 48 2.5 2.5 Figure 4 There are significant differences in disease burden across gender and age groups ( Figure 4 There are significant differences in disease burden associated with various emission sources in urban areas of Shandong Province. In 2022, the disease burden was ranked as follows: industrial emissions > fuel oil combustion > vehicle emissions > coal and biomass burning> dust sources. In 2023 and 2024, the disease burden from emission sources was ranked as follows: industrial emissions > coal and biomass burning > fuel oil combustion > vehicle emissions > dust sources ( Figure 4 Figure S8 Figure 4 Figure 4 Figure S8 The emission concentration from industrial sources is relatively low (around 10%), yet the disease burden is highest. We further conducted individual health risk assessments for various metals in industrial emissions to develop more effective and targeted control measures. Overall, the disease burden from elements such as Pb, Cd, and Cr in industrial emissions is relatively higher in all cities ( Figure 4 Figure S7 This study evaluated the disease burden of metal elements carried by PM 2.5 2.5 49 2.5 2.5 3.5. Relative Importance Analysis for Three Prioritized PM 2.5 An XGBoost model was constructed to explore the relationships between PM 2.5 Figure 5 2.5 Figure 5 Figure 5 2.5 2.5 2.5 Figures S9 and S10 Furthermore, the XGBoost model revealed that an increase in fractional vegetation cover may lead to a reduction in PM 2.5 2.5 The study results suggested that the health risks posed by toxic heavy metals should not be underestimated, even at low concentrations. Therefore, it is both urgent and essential to implement appropriate policies to control the emissions of PM 2.5 2.5 Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/toxics13090722/s1 2.5 p p p 2.5 2.5 3 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 Author Contributions T.Z. conceived, designed, performed the experiments, conducted the statistical analysis, and took the lead in drafting the manuscript and interpreting the results. K.Q. and F.M. performed the conceived, designed, performed the experiments. Z.W., M.W. and H.L. (Hao Liang) participated in the design of the models and codes for this study. Y.L. and J.L. provided substantial scientific input in interpreting the results and the revision of the submitted version of the manuscript. H.L. (Houfeng Liu) and P.W. designed, conceived and wrote the article, and made a critical revision of the manuscript. All authors have read and agreed to the published version of the manuscript. Data Availability Statement The data presented in this study are available on request from the corresponding author. Conflicts of Interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1. Li X. Liu X. Effects of PM2.5 on Chronic Airway Diseases: A Review of Research Progress Atmosphere 2021 12 1068 10.3390/atmos12081068 2. Han X. Liu Y. Gao H. Ma J. Mao X. Wang Y. Ma X. Forecasting PM2.5 induced male lung cancer morbidity in China using satellite retrieved PM2.5 and spatial analysis Sci. Total Environ. 2017 607–608 1009 1017 10.1016/j.scitotenv.2017.07.061 28724219 3. Li R. Jiang N. Liu Q. Huang J. Guo X. Liu F. Gao Z. Impact of Air Pollutants on Outpatient Visits for Acute Respiratory Outcomes Int. J. Environ. Res. Public Health 2017 14 47 10.3390/ijerph14010047 28067786 PMC5295298 4. MEE Communiqués on the Ecological Environment Available online: http://www.mee.gov.cn/hjzl/sthjzk/zghjzkgb/ (accessed on 22 April 2025) 5. Zhang Q. Zheng Y. Tong D. Shao M. Wang S. Zhang Y. Xu X. Wang J. He H. Liu W. Drivers of improved PM(2.5) air quality in China from 2013 to 2017 Proc. Natl. Acad. Sci. USA 2019 116 24463 24469 10.1073/pnas.1907956116 31740599 PMC6900509 6. Tian H.Z. Wang Y. Xue Z.G. Cheng K. Qu Y.P. Chai F.H. Hao J.M. Trend and characteristics of atmospheric emissions of Hg, As, and Se from coal combustion in China, 1980–2007 Atmos. Meas. Tech. 2010 10 11905 11919 10.5194/acp-10-11905-2010 7. Li Y. Chang M. Ding S. Wang S. Ni D. Hu H. Monitoring and source apportionment of trace elements in PM2.5: Implications for local air quality management J. Environ. Manag. 2017 196 16 25 10.1016/j.jenvman.2017.02.059 28284133 8. Mai D. Xu C. Lin W. Yue D. Fu S. Lin J. Yuan L. Zhao Y. Zhai Y. Mai H. Association of abnormal-glucose tolerance during pregnancy with exposure to PM2.5 components and sources Environ. Pollut. 2022 292 118468 10.1016/j.envpol.2021.118468 34748887 9. Fan M.-Y. Zhang Y.-L. Lin Y.-C. Cao F. Sun Y. Qiu Y. Xing G. Dao X. Fu P. Specific sources of health risks induced by metallic elements in PM2.5 during the wintertime in Beijing, China Atmos. Environ. 2021 246 118112 10.1016/j.atmosenv.2020.118112 10. Cui Y. Ji D. He J. Kong S. Wang Y. In situ continuous observation of hourly elements in PM2.5 in urban beijing, China: Occurrence levels, temporal variation, potential source regions and health risks Atmos. Environ. 2020 222 117164 10.1016/j.atmosenv.2019.117164 11. Huang R.-J. Cheng R. Jing M. Yang L. Li Y. Chen Q. Chen Y. Yan J. Lin C. Wu Y. Source-Specific Health Risk Analysis on Particulate Trace Elements: Coal Combustion and Traffic Emission As Major Contributors in Wintertime Beijing Environ. Sci. Technol. 2018 52 10967 10974 10.1021/acs.est.8b02091 30185022 12. Guo Q. Li L. Zhao X. Yin B. Liu Y. Wang X. Yang W. Geng C. Wang X. Bai Z. Source Apportionment and Health Risk Assessment of Metal Elements in PM2.5 in Central Liaoning’s Urban Agglomeration Atmosphere 2021 12 667 10.3390/atmos12060667 13. Liu N. Liu W. Deng F. Liu Y. Gao X. Fang L. Chen Z. Tang H. Hong S. Pan M. The burden of disease attributable to indoor air pollutants in China from 2000 to 2017 Lancet Planet. Health 2023 7 e900 e911 10.1016/S2542-5196(23)00215-2 37940210 14. Chen Y. Liu J. Cao H. Zhang A. Zhou A. Zhou X. Determining priority sources of PM2.5-bound polycyclic aromatic hydrocarbons by their contribution to disability adjusted life years Atmos. Environ. 2021 248 118202 10.1016/j.atmosenv.2021.118202 15. Gao T. Wang X.C. Chen R. Ngo H.H. Guo W. Disability adjusted life year (DALY): A useful tool for quantitative assessment of environmental pollution Sci. Total Environ. 2015 511 268 287 10.1016/j.scitotenv.2014.11.048 25549348 16. Guan Y. Xiao Y. Zhang N. Chu C. Tracking short-term health impacts attributed to ambient PM2.5 and ozone pollution in Chinese cities: An assessment integrates daily population Environ. Sci. Pollut. Res. 2022 29 91176 91189 10.1007/s11356-022-22067-z PMC9315092 35881283 17. Norris G. Duvall R. Brown S. Bai S. EPA Positive Matrix Factorization (PMF) 5.0 Fundamentals and User Guide Environmental Protection Agency Washington, DC, USA 2014 18. Yuan J. Zuo H. Jiang Y. Zhang P. Wang Z. Guo C. Wang Z. Wen Q. Chen Y. Wei Y. Exploring Sources and Health Risks in Beijing PM2.5 in 2019 and 2020 Atmosphere 2023 14 1060 10.3390/atmos14071060 19. Li K. Talifu D. Gao B. Zhang X. Wang W. Abulizi A. Wang X. Ding X. Liu H. Zhang Y. Temporal Distribution and Source Apportionment of Composition of Ambient PM2.5 in Urumqi, North-West China Atmosphere 2022 13 781 10.3390/atmos13050781 20. Wang S. Kaur M. Li T. Pan F. Effect of Different Pollution Parameters and Chemical Components of PM2.5 on Health of Residents of Xinxiang City, China Int. J. Environ. Res. Public Health 2021 18 6821 10.3390/ijerph18136821 34202054 PMC8297198 21. Wignall J.A. Shapiro A.J. Wright F.A. Woodruff T.J. Chiu W.A. Guyton K.Z. Rusyn I. Standardizing benchmark dose calculations to improve science-based decisions in human health assessments Environ. Health Perspect. 2014 122 499 505 10.1289/ehp.1307539 24569956 PMC4014768 22. Hu X. Zhang Y. Ding Z. Wang T. Lian H. Sun Y. Wu J. Bioaccessibility and health risk of arsenic and heavy metals (Cd, Co, Cr, Cu, Ni, Pb, Zn and Mn) in TSP and PM2.5 in Nanjing, China Atmos. Environ. 2012 57 146 152 10.1016/j.atmosenv.2012.04.056 23. Etchie T.O. Sivanesan S. Etchie A.T. Adewuyi G.O. Krishnamurthi K. George K. Rao P.S. The burden of disease attributable to ambient PM2.5-bound PAHs exposure in Nagpur, India Chemosphere 2018 204 277 289 10.1016/j.chemosphere.2018.04.054 29665530 24. U.S.EPA Supplemental Guidance for Assessing Susceptibility from Early-Life Exposure to Carcinogens EPA/630/R-03/003F U.S. Environmental Protection Agency Washington, DC, USA 2005 25. Chen T. Guestrin C. XGBoost: A scalable tree boosting system Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining San Francisco, CA, USA 13–17 August 2016 Association for Computing Machinery New York, NY, USA 2016 785 794 26. Zhou L. Hu F. Wang B. Wei C. Sun D. Wang S. Relationship between urban landscape structure and land surface temperature: Spatial hierarchy and interaction effects Sustain. Cities Soc. 2022 80 103795 10.1016/j.scs.2022.103795 27. Xie X. Wang Y. Evaluating the Efficacy of Government Spending on Air Pollution Control: A Case Study from Beijing Int. J. Environ. Res. Public Health 2018 16 45 10.3390/ijerph16010045 30585219 PMC6339178 28. Cai A. Zhang H. Wang L. Wang Q. Wu X. Source Apportionment and Health Risk Assessment of Heavy Metals in PM2.5 in Handan: A Typical Heavily Polluted City in North China Atmosphere 2021 12 1232 10.3390/atmos12101232 29. Li L. Meng R. Lei Y. Wu S. Jiang Y. Human health risk assessment of heavy metals from PM(2.5) in China’s 29 provincial capital cities Environ. Sci. Pollut. Res. Int. 2022 29 63028 63040 10.1007/s11356-022-20229-7 35449325 30. Zhang X. Zhang X. Yang H. Cheng X. Zhu Y.G. Ma J. Cui D. Zhang Z. Spatial and temporal changes of air quality in Shandong Province from 2016 to 2022 and model prediction J. Hazard. Mater. 2024 477 135408 10.1016/j.jhazmat.2024.135408 39096641 31. Hulskotte J. Roskam G. van der Gon H.D. Elemental composition of current automotive braking materials and derived air emission factors Atmos. Environ. 2014 99 436 445 10.1016/j.atmosenv.2014.10.007 32. Gietl J.K. Lawrence R. Thorpe A.J. Harrison R.M. Identification of brake wear particles and derivation of a quantitative tracer for brake dust at a major road Atmos. Environ. 2010 44 141 146 10.1016/j.atmosenv.2009.10.016 33. Councell T.B. Duckenfield K.U. Landa E.R. Callender E. Tire-Wear Particles as a Source of Zinc to the Environment Environ. Sci. Technol. 2004 38 4206 4214 10.1021/es034631f 15352462 34. Yan R.H. Peng X. Lin W. He L.Y. Wei F.H. Tang M.X. Huang X.F. Trends and Challenges Regarding the Source-Specific Health Risk of PM(2.5)-Bound Metals in a Chinese Megacity from 2014 to 2020 Environ. Sci. Technol. 2022 56 6996 7005 10.1021/acs.est.1c06948 35050611 35. Zhang Y. Yang X. Brown R. Yang L. Morawska L. Ristovski Z. Fu Q. Huang C. Shipping emissions and their impacts on air quality in China Sci. Total Environ. 2017 581–582 186 198 10.1016/j.scitotenv.2016.12.098 28062109 36. Li Z. Li C. Ye X. Fu H. Wang L. Yang X. Wang X. Zhao Z. Kan H. Mellouki A. Air quality in the middle and lower reaches of the Yangtze River channel: A cruise campaign Atmos. Meas. Tech. 2018 18 14445 14464 10.5194/acp-18-14445-2018 37. Nriagu J.O. Global inventory of natural and anthropogenic emissions of trace metals to the atmosphere Nature 1979 279 409 411 10.1038/279409a0 16068169 38. Nriagu J.O. Pacyna J.M. Quantitative assessment of worldwide contamination of air, water and soils by trace metals Nature 1988 333 134 139 10.1038/333134a0 3285219 39. Li X. Yan C. Wang C. Ma J. Li W. Liu J. Liu Y. PM(2.5)-bound elements in Hebei Province, China: Pollution levels, source apportionment and health risks Sci. Total Environ. 2022 806 Pt 1 150440 10.1016/j.scitotenv.2021.150440 34844311 40. Liu Y. Xing J. Wang S. Fu X. Zheng H. Source-specific speciation profiles of PM2.5 for heavy metals and their anthropogenic emissions in China Environ. Pollut. 2018 239 544 553 10.1016/j.envpol.2018.04.047 29684881 41. Rai P. Furger M. Slowik J.G. Zhong H. Tong Y. Wang L. Duan J. Gu Y. Qi L. Huang R.-J. Characteristics and sources of hourly elements in PM10 and PM2.5 during wintertime in Beijing Environ. Pollut. 2021 278 116865 10.1016/j.envpol.2021.116865 33714061 42. Streets D. Hao J. Wu Y. Jiang J. Chan M. Tian H. Feng X. Anthropogenic mercury emissions in China Atmos. Environ. 2005 39 7789 7806 10.1016/j.atmosenv.2005.08.029 43. Andreae M.O. Soot Carbon and Excess Fine Potassium: Long-Range Transport of Combustion-Derived Aerosols Science 1983 220 1148 1151 10.1126/science.220.4602.1148 17818494 44. Li W. Achal V. Environmental and health impacts due to e-waste disposal in China—A review Sci. Total Environ. 2020 737 139745 10.1016/j.scitotenv.2020.139745 32516663 45. Zhang J. Zhou X. Wang Z. Yang L. Wang J. Wang W. Trace elements in PM2.5 in Shandong Province: Source identification and health risk assessment Sci. Total Environ. 2018 621 558 577 10.1016/j.scitotenv.2017.11.292 29195204 46. Majewski A.J. Dhir A. Application of silver in microtubular solid oxide fuel cells Mater. Renew. Sustain. Energy 2018 7 16 10.1007/s40243-018-0123-y 47. Luyckx V.A. Tonelli M. Stanifer J.W. The global burden of kidney disease and the sustainable development goals Bull. World Health Organ. 2018 96 414D 422D 10.2471/BLT.17.206441 29904224 PMC5996218 48. Wu M.-Y. Lo W.-C. Chao C.-T. Wu M.-S. Chiang C.-K. Association between air pollutants and development of chronic kidney disease: A systematic review and meta-analysis Sci. Total Environ. 2020 706 135522 10.1016/j.scitotenv.2019.135522 31864998 49. Gao Y. Lyu T. Zhang W. Zhou X. Zhang R. Tang Y. Jiang Y. Cao H. Control priority based on source-specific DALYs of PM2.5-bound heavy metals by PMF-PSCF-IsoSource model in urban and suburban Beijing J. Environ. Manag. 2024 352 120016 10.1016/j.jenvman.2024.120016 38232599 50. Brown C.C. Chu K.C. A new method for the analysis of cohort studies-implications of the multistage theory of carcinogenesis applied to occupational arsenic exposure Environ. Health Perspect. 1983 50 293 308 10.1289/ehp.8350293 6873020 PMC1569231 51. Feldstein A.L. Arsenic and respiratory cancer in humans: Follow-up of copper smelter employees in Montana JNCI J. Natl. Cancer Inst. 1983 70 601 609 10.1093/jnci/70.4.601 6572748 52. Enterline P.E. Marsh G.M. Cancer among workers exposed to arsenic and other substances in a copper smelter Am. J. Epidemiol. 1982 116 895 911 10.1093/oxfordjournals.aje.a113492 7148816 53. Dunlap L.G. Perforations of the nasal septum due to inhalation of arsenous oxide J. Am. Med. Assoc. 1921 76 568 569 54. Morton W.E. Caron G.A. Encephalopathy: An uncommon manifestation of workplace arsenic poisoning? Am. J. Ind. Med. 1989 15 1 5 10.1002/ajim.4700150102 2929604 55. Pinto S.S. McGill C.M. Arsenic trioxide exposure in industry Ind. Med. Surg. 1953 22 281 287 13061080 56. Enterline P.E. Day R. Marsh G.M. Cancers related to exposure to arsenic at a copper smelter Occup. Environ. Med. 1995 52 28 32 10.1136/oem.52.1.28 7697137 PMC1128146 57. Welch K. Higgins I. Oh M. Burchfiel C. Arsenic exposure, smoking, and respiratory cancer in copper smelter workers Arch. Environ. Health Int. J. 1982 37 325 335 10.1080/00039896.1982.10667586 7181533 58. Perry K. Bowler R.G. Studies in the incidence of cancer in a factory handling inorganic compounds of arsenic; clinical and environmental investigations Br. J. Ind. Med. 1948 5 6 15 18904000 PMC1035982 59. Cohen S.R. David D.M. Kramkowski R.S. Clinical manifestations of chromic acid toxicity: Nasal lesions in electroplate workers Cutis 1974 13 558 568 60. Hanslian L. Navratil J. Jurak J. Damage to the upper respiratory tract by a chromic acid aerosol Pr. Lek. 1967 19 294 298 (In Czechoslovakian) 61. Lindberg E. Hedenstierna G. Chrome plating: Symptoms, findings in the upper airways, and effects on lung function Arch. Environ. Health 1983 38 367 374 10.1080/00039896.1983.10545822 6667038 62. Nemery B. Casier P. Roosels D. Lahaye D. Demedts M. Survey of cobalt exposure and Respiratory health in diamond polishers Am. Rev. Respir. Dis. 1992 145 610 616 10.1164/ajrccm/145.3.610 1312313 63. Sprince N.L. Oliver L.C. Eisen E.A. Greene R.E. Chamberlin R.I. Cobalt exposure and lung disease in tungsten carbide production: A cross-sectional study of current workers Am. Rev. Respir. Dis. 1988 138 1220 1226 10.1164/ajrccm/138.5.1220 3264482 64. Wehner A.P. Busch R.H. Olson R.J. Chronic inhalation of cobalt oxide and cigarette smoke by hamsters Am. Ind. Hyg. Assoc. J. 1977 38 338 346 10.1080/0002889778507627 900017 65. Shirakawa T. Kusaka Y. Fujimura N. Goto S. Morimoto K. The existence of specific antibodies to cobalt in hard metal asthma Clin. Exp. Allergy 1988 18 451 460 10.1111/j.1365-2222.1988.tb02895.x 3233723 66. Swennen B. Buchet J.P. Stanescu D. Lison D. Lauwerys R. Epidemiological survey of workers exposed to cobalt oxides, cobalt salts, and cobalt metal Occup. Environ. Med. 1993 50 835 842 10.1136/oem.50.9.835 PMC1061317 8398878 67. Enterline P.E. Marsh G.M. Mortality among workers in a nickel refinery and alloy manufacturing plant in West virginia JNCI J. Natl. Cancer Inst. 1982 68 925 933 10.1093/jnci/68.6.925 6953273 68. Chovil A. Sutherland R.B. Halliday M. Respiratory cancer in a cohort of sinter plant workers Occup. Environ. Med. 1981 38 327 333 10.1136/oem.38.4.327 PMC1069282 7317295 69. Peto J. Cuckle H. Doll R. Hermon C. Morgan L.G. Respiratory cancer mortality of Welsh nickel refinery workers Nickel in the Human Environment: Proceedings of a Joint Symposium, March, 1983. IARC Scientific Publications No. 53 International Agency for Research on Cancer Lyon, France 1984 36 46 6532988 70. Magnus K. Andersen A. Høgetveit A.C. Cancer of respiratory organs among workers at a nickel refinery in Norway second report Int. J. Cancer 1982 30 681 685 10.1002/ijc.2910300602 7160938 71. NTP Toxicology and Carcinogenesis Studies of Nickel Oxide (CAS No. 1313-99-1) in F344/N Rats and B6C3F1 Mice (Inhalation Studies) Natl. Toxicol. Program Tech. Rep. Ser. 1996 451 1 381 12594524 72. NTP Toxicology and Carcinogenesis Studies of Nickel Subsulfide (CAS No. 12035-72-2) in F344/N Rats and B6C3F1 Mice (Inhalation Studies) Natl. Toxicol. Program Tech. Rep. Ser. 1996 453 1 365 12594522 73. NTP Toxicology and Carcinogenesis Studies of Nickel Sulfate Hexahydrate (CAS No. 10101-97-0) in F344/N Rats and B6C3F1 Mice (Inhalation Studies) Natl. Toxicol. Program Tech. Rep. Ser. 1996 454 1 380 12587012 74. Ottolenghi A.D. Haseman J.K. Payne W.W. Falk H.L. MacFarland H.N. Inhalation studies of nickel sulfide in pulmonary carcinogenesis of rats JNCI J. Natl. Cancer Inst. 1975 54 1165 1172 10.1093/jnci/54.5.1165 165308 75. Thun M.J. Schnorr T.M. Smith A.B. Halperin W.E. Mortality among a cohort of U.S. cadmium production workers: An update J. Natl. Cancer Inst. 1985 74 325 333 3856046 76. Takenaka S. Oldiges H. König H. Hochrainer D. Oberdoerster G. Carcinogenicity of cadmium aerosols in Wistar rats J. Natl. Cancer Inst. 1983 70 367 373 6571943 77. Gidlow D.A. Lead toxicity Occup. Med. 2015 65 348 356 10.1093/occmed/kqv018 26187801 78. Glenn B.S. Stewart W.F. Links J.M. Todd A.C. Schwartz B.S. The longitudinal association of lead with blood pressure Epidemiology 2003 14 30 36 10.1097/00001648-200301000-00011 12500043 79. Liu J. Chen Y. Cao H. Zhang A. Burden of typical diseases attributed to the sources of PM2.5-bound toxic metals in Beijing: An integrated approach to source apportionment and QALYs Environ. Int. 2019 131 105041 10.1016/j.envint.2019.105041 31377599 80. A Roels H. Ghyselen P. Buchet J.P. Ceulemans E. Lauwerys R.R. Assessment of the permissible exposure level to manganese in workers exposed to manganese dioxide dust Occup. Environ. Med. 1992 49 25 34 10.1136/oem.49.1.25 1733453 PMC1039229 81. Watt W.D. Chronic Inhalation Toxicity of Antimony Trioxide: Validation of the Threshold Limit Value Wayne State University Detroit, MI, USA 1983 1 135 Figure 1 Spatial distribution of the three-year average concentrations of five PM 2.5 a 2.5 b Figure 2 Variation curves of the annual absolute concentration of total metals (ng/m 3 2.5 a b Figure 3 Source apportionment of PM 2.5 a b 2.5 c d Figure 4 Multidimensional analysis of disease burden in Shandong Province during 2022 to 2024. ( a 2.5 b c d 2.5 Figure 5 The SHAP summary plots display the relative importance of various potential influencing factors on the combined concentration of PM 2.5 a b c d e f toxics-13-00722-t001_Table 1 Table 1 Model evaluation. Models N RMSE MAE R 2 Cr-coastal region 96,870 0.52 0.31 0.66 Cr-inland region 147,852 0.66 0.48 0.86 Cd-coastal region 96,859 0.62 0.36 0.75 Cd-inland region 146,519 0.71 0.48 0.79 Pb-coastal region 96,883 0.47 0.89 0.87 Pb-inland region 150,609 0.48 0.32 0.83 toxics-13-00722-t002_Table 2 Table 2 The disease burden (DALYs per 1000 people) caused by PM 2.5 Site Year 2022 2023 2024 Zibo 3.60 3.55 4.19 Zaozhuang 2.31 1.78 1.52 Jinan 1.01 3.57 9.44 Linyi 1.05 1.31 0.92 Heze 0.62 0.95 0.78 Dongying 0.80 1.00 0.81 Binzhou 2.15 1.46 2.64 Liaocheng 0.93 0.95 1.00 Weifang 2.44 3.52 NA Taian NA 1.80 1.44 Rizhao NA 3.01 2.58 Qingdao NA 1.55 2.58 Dezhou 1.75 1.96 NA Weihai NA NA 1.05 Yantai NA NA 0.82 average 1.67 2.03 2.29 NA represents missing data. ",
  "metadata": {
    "Title of this paper": "Assessment of the permissible exposure level to manganese in workers exposed to manganese dioxide dust",
    "Journal it was published in:": "Toxics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473478/"
  }
}