{
  "title": "Paper_538",
  "abstract": "J Pediatr Surg J Pediatr Surg 319 nihpa Journal of pediatric surgery 0022-3468 1531-5037 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12483763 PMC12483763.1 12483763 12483763 NIHMS2107028 40812407 10.1016/j.jpedsurg.2025.162525 NIHMS2107028 NIHPA2107028 1 Article ’When I walk away and wonder, did I make the best decision?’: A Decisional Needs Assessment Among Providers Involved in Pediatric Extracorporeal Cardiopulmonary Resuscitation Diaz-Miron Jose MD, MSCS 1 Reedy Julia MA 2 Bennet Tellen D. MD, MS 3 4 Ross DeCamp Lisa MD, MSPH 2 5 1 2 3 4 5 Corresponding Author: jose.diaz-miron@childrenscolorado.org 12 8 2025 498036 162525 162525 25 09 2025 01 10 2025 01 10 2025 01 10 2025 Purpose: Extracorporeal cardiopulmonary resuscitation (ECPR) is an advanced resuscitation therapy for cardiopulmonary arrest refractory to standard CPR. ECPR treatment recommendations are not supported by strong evidence, and institutional criteria for its application are rare, challenging decision-making. We performed a decisional needs assessment among providers engaged in ECPR decisions at a quaternary children’s hospital. Methods: We conducted 21 semi-structured 1-hour interviews with providers from pediatric surgery, cardiothoracic surgery, pediatric, cardiac, and neonatal intensive care, interventional cardiology, and emergency medicine. Interviews were guided by the Ottawa Decision Support Framework, exploring provider ECPR experiences and their assessment of the decision-making process. Transcripts were consensus method coded with both deductive and emergent codes. Themes were analyzed to characterize the decision-making process and areas for improvement. Results: Three overarching themes (subthemes) emerged: 1) ECPR characteristics lead to difficulties in decision-making (emergent and high stakes scenarios, emotional burden on care teams, uncertain/poor prognosis of patients); 2) differing perspectives and processes across units (cardiac vs. non-cardiac providers, variability in perspective on what constitutes a “good outcome”); 3) quality of ECPR decisions informed by (standardization, preemptive decision-making, and collaborative decisions). Conclusion: Common experiences were identified in ECPR decision-making related to uncertain effectiveness and the gravity of the decision. Decision complexity stemmed from ECPR characteristics, different perspectives and unit-specific care processes, lack of standardization, and challenges establishing timely collaborative and preemptive discussions. ECPR decision quality may be improved through standardization and multidisciplinary collaboration for both preemptive and acute decision-making processes and through the creation of tailored decision support tools. Graphical Abstract:  Pediatric extracorporeal cardiopulmonary resuscitation (ECPR) Pediatric extracorporeal membrane oxygenation (ECMO) Decision support Decisional needs assessment pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf yes pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "’When I walk away and wonder, did I make the best decision?’: A Decisional Needs Assessment Among Providers Involved in Pediatric Extracorporeal Cardiopulmonary Resuscitation",
    "Journal it was published in:": "Journal of pediatric surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483763/"
  }
}