{
  "title": "Paper_367",
  "abstract": "pmc J Exp Clin Cancer Res J Exp Clin Cancer Res 618 jeccr Journal of Experimental & Clinical Cancer Research : CR 0392-9078 1756-9966 BMC PMC12487002 PMC12487002.1 12487002 12487002 41029459 10.1186/s13046-025-03530-4 3530 1 Research PSMA-targeted theranostic nanoplatform achieves spatiotemporally precise therapy and triggers ferroptosis in prostate cancer treatment Zhang Linxue 1 Sun Qi 1 Zheng Dongxin 2 Huang Xiang 2 Yu Zhong 1 Lan Zhongwen 1 Xiong Wei 37033013@qq.com 2 Sun Ke ksun@uestc.edu.cn 1 Liu Ruiji liuruiji66Dr@163.com 2 1 https://ror.org/04qr3zq92 grid.54549.39 0000 0004 0369 4060 School of Materials and Energy, University of Electronic Science and Technology of China, 2 https://ror.org/04qr3zq92 grid.54549.39 0000 0004 0369 4060 Department of Urology, School of Medicine, Sichuan Provincial People’s Hospital, University of Electronic Science and Technology of China, 30 9 2025 2025 44 478191 272 21 5 2025 22 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ Background Ferroptosis, an iron-dependent form of regulated cell death, is crucial for the fate of tumors such as prostate cancer (PCa) under conditions of metabolic and oxidative stress. Consequently, the disruption of ferroptosis defense mechanisms could be lethal to these cancer cells, while sparing normal cells. Despite this potential, the development of effective and controlled in vivo therapies targeting ferroptosis remains underexplored. Methods In this study, liposomes modified with Glu-urea-Lys (GUL) encapsulating Mn 0.6 0.4 2 4 2 Results The engineered GUL@LsiYY1@MZ nanosystem exploits the specific binding affinity of GUL for the prostate membrane-specific antigen (PSMA), facilitating targeted delivery and accumulation. Upon exposure to alternating magnetic fields (AMF), this system enables the precision-controlled release of siRNA into the cell, leading to the knockdown of YY1 expression. This downregulation subsequently affects the expression of the SLC7A11, thereby disrupting glutathione metabolism. Additionally, the introduction of excess Fe 2+ 2 Conclusion The GUL@LsiYY1@MZ nanosystem utilizes AMF-triggered release to downregulate SLC7A11, inducing ferroptosis and contributing to enhanced anti-tumor efficacy. Graphical abstract  Supplementary Information The online version contains supplementary material available at 10.1186/s13046-025-03530-4. Keywords Theranostics Magnetic hyperthermia therapy PSMA targeting, SiRNA delivery Ferroptosis https://doi.org/10.13039/501100001809 National Natural Science Foundation of China No. 82404007 Liu Ruiji pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Italian National Cancer Institute ‘Regina Elena’ 2025 Introduction Prostate cancer (PCa) remains the most prevalent malignancy in men worldwide, with an estimated 299,010 new cases and 35,250 deaths projected in the United States for 2024 [ 1 2 3 Ferroptosis is an iron-dependent form of regulated cell death characterized by the toxic accumulation of lipid peroxides on the cell membrane, resulting in impaired plasma membrane permeability and ultimately cell demise [ 4 5 6 7 8 9 YY1, a multifunctional transcription factor regulating ∼ 10% of human genes [ 10 11 12 13 14 However, siRNA delivery faces critical barriers: poor cellular uptake, enzymatic degradation, and inefficient endosomal escape. Liposomes nanoparticles (LNPs) have emerged as promising siRNA carriers due to their biocompatibility, high loading capacity, and endosomal escape capabilities [ 15 16 17 To overcome these challenges, we have designed GUL@LsiYY1@MZ - a temperature-sensitive magnetic lipid nanohybrid that combines Mn 0.6 0.4 2 4 18 2 19 20 Materials and methods Bioinformatics analysis of scRNA-seq data The scRNA-seq data of enzalutamide-resistant prostate cancer ( GSE168668 https://www.ncbi.nlm.nih.gov/geo/ 21 22 Materials Zinc acetylacetonate (Zn(acac) 2 2 3 2000 Synthesis of GUL@LsiYY1@MZ nanohybrids Synthesis of ultrasmall Mn x 1–x Monodisperse Mn x 1–x 23 2 2 3 2 S1 x 1–x x 1–x 0.6 0.4 Preparation of liposomes Liposomes were prepared using the typically thin-film hydration method, followed by extrusion for refinement [ 24 2000 Synthesis of thermosensitivity LsiYY1@MZ MZ NPs and siRNA were co-encapsulated into liposomes. First, MZ NPs were modified by DSPE-PEG 2000 25 Next, siRNA solution (50 nM) was prepared and dissolved in DEPC. The siRNA and MnZn ferrite were gradually added to the liposome precursor solution, with gentle mixing to ensure even distribution. Then the mixed solution was placed in ultrasound to promote the formation of liposomes. The unencapsulated components were removed by ultrafiltration to obtain the purified liposome hybrids. After the reaction, part of the solvent was evaporated under reduced pressure at room temperature, and the remaining concentrated solution was sucked into a centrifuge tube, and an appropriate amount of cyclohexane was added for centrifugation. The supernatant was discarded, and the operation was repeated twice. The solid obtained by centrifugation was placed at 35 ◦C for 30 min under reduced pressure to obtain target product LsiYY1@MZ. The product was dispersed in 3 mL of DEPC solution. The obtained LsiYY1@MZ nanohybrids were kept at 4 °C. Construction of GUL@LsiYY1@MZ hybrids LsiYY1@MZ nanoparticles (10 mg) were added to 2 mL of DEPC solution. Then, 1 mL of freshly prepared 10 mM EDC solution was added, and the mixture was thoroughly mixed for 30 min. Next, 1 mL of freshly prepared 10 mM NHS solution and 1 mg of Glu-urea-Lys were added. After ensuring uniform mixing, 1 mL of 0.8 mM ethylenediamine was introduced. The reaction was carried out on a shaker at room temperature for 8 h. The GUL@LsiYY1@MZ product was dialyzed for 72 h using a 3 kDa dialysis membrane to remove unreacted small molecules. Characterization of MZ nanoparticles and GUL@LsiYY1@MZ The morphology and size distribution of Mn x 1–x Temperature-Dependent SiRNA release from GUL@LsiYY1@MZ A 1.0 mg/mL aqueous suspension of GUL@LsiYY1@MZ at different temperatures (treated with 37, 39, 41, and 43 ℃) was centrifuged at 15,000 rpm for 10 min, and the supernatant was analyzed for absorbance at 260 nm. The siRNA release percentage was determined by comparing the released siRNA amount to the total encapsulated siRNA. Cell culture and cellular uptake The Human prostate cancer cell lines LNCaP, C4-2 and PC3 were purchased from American Type Culture Collection (Manassas, VA, USA), and cultured in RPMI 1640 (Gibco) containing 10% FBS (Gibco) and penicillin-streptomycin (2%) at 37 ℃ with 5% CO 2 5 Cell viability assay LNCaP and C4-2 cells were cultured in six-well plates until reaching a confluence of 60–70%. At this point, various nanoparticles were introduced, and the cells were incubated for an additional 6 h. This was followed by a 15-minute exposure to an AMF with parameters set at 324 Oe and 270 kHz. Subsequently, the culture dishes were rinsed with PBS and replenished with fresh culture medium, allowing for further incubation over an 18-hour period. Cells were then harvested and reseeded into 96-well plates. After a 24-hour incubation period, cell viability was evaluated using the Cell Counting Kit-8 (CCK-8, Beyotime). Absorbance at 450 nm was measured to quantify cell viability [ 26 n Detection of in vitro ROS, LPO and Fe 2+ The cells were seeded into confocal dishes (biosharp) (density: 3 × 10 5 2+ 5 2+ n Western blotting assay of related proteins Western blot analysis involved lysing the treated cells with RIPA buffer (Yamei, China), and then in a cell crusher to further shatter the cells (on ice). The lysates were obtained by centrifuging at 15,000 rpm for 30 min at 4 °C. After the protein content is determined by BCA method, the protein sample is put into the protein boiler after loading adjustment (100 °C, 5 min). The protein was then subjected to SDS-PAGE gels and transferred onto PVDF membranes. SLC7A11 polyclonal antibody (Thermo Fisher, USA, 1:1000) and YY1 polyclonal antibody (CST, USA, 1:4000) incubated overnight at 4 °C. Following an additional incubation with goat anti-Rabbit IgG cross-adsorbed secondary antibody (Thermo Fisher, USA, 1:5000) for 1 h at room temperature. The bands were visualized using the Imaging system (Bio-Rad). MR imaging performance MRI was performed by a clinical 3T MR imaging device (Discovery MR758, 3.0T) in which the tubes were vertically placed inside an animal coil. T 1 2 27 1 I 2 1 2 1 2 7 3 In vivo tumor growth Inhibition study The mice were randomly divided into five groups ( n 3 Statistical analysis In this research, all experimental data come from at least three independent experiments. The data are expressed as mean ± standard deviation (SD) and were analyzed utilizing GraphPad Prism 10 software. For comparisons between two groups, the Student’s t-test was employed, while One-way ANOVA with Tukey’s post-hoc test was used for multi-group comparisons. Significance levels: * p p p p Results and discussion Single-cell sequencing analysis suggested that reactive oxygen species level was up regulated in enzalutamide-resistant prostate cancer Following the application of the UMAP method for cell grouping, cell populations were annotated using marker genes (Fig. 1 1 1 28 1 29  Fig. 1 Analyses of the scRNA-seq on the relationship between YY1 expression and enzalutamide-resistance. ( a-b GSE168668 c-d e Characterization and magnetothermal efficiency of Mn x 1−x Transmission electron microscope (TEM) images of the representative Mn x 1– x 2 4 x 1−x x S1 x 1−x x 1−x x 1−x S1 2 x 1−x x 1−x 2 x 1– x x 2 2+ 2+ 30 x 2 x 1−x 31  Fig. 2 Characterization of nanoparticles with various Mn / x 1– x x a b c-d e-f g s To evaluate the potential of Mn x 1−x 2 s x 1−x x s s x 20 2 x 1−x x 1−x 0.6 0.4 2 4 s x 1−x 3 x x 1−x 3 x x x SAR 0.6 0.4 2 4  Fig. 3 Magnetothermal performance of Mn x 1– x a b c d e f-g Characterization and property of GUL@LsiYY1@MZ nanohybrids To improve targeting performance for prostate cancer and avoid the rapid clearance of nanoparticles from the body, MZ and siRNA were encapsulated within thermosensitive liposomes. Additionally, the small molecule GUL, which targets PSMA, was conjugated to the exterior, resulting in the formation of efficient, spherical nanoparticles designated as GUL@LsiYY1@MZ (Fig. 3 S2 3 3 32 33 3 3 Magnetic properties of GUL@LsiYY1@MZ were also evaluated (Figure S2 s S2 S3 S4 To evaluate the temperature-responsive release capabilities of GUL@LsiYY1@MZ, the hybrids were exposed to AMF. As shown in Fig. 3 S5 S6 In vitro cell uptake and cytotoxicity assays After 4 h of incubation, the Cy5-labeled GUL@LsiYY1@MZ nanomaterials were effectively internalized into PSMA positive LNCaP and C4-2 cells, as demonstrated in Fig. 4 4 S7 4 4  Fig. 4 Cell viability of PCa cell lines treated with different nanoparticles. ( a b c d n p p p p GUL@LsiYY1@MZ under AMF trigger ferroptosis in prostate cancer therapy In the subsequent phase of our study, we sought to ascertain whether GUL@LsiYY1@MZ could induce ferroptosis in the context of prostate cancer therapy. The endoperoxide linkages are capable of reacting with ferrous ions, resulting in the accumulation of substantial amounts of reactive oxygen species (ROS) through a Fenton-like reaction, thereby causing oxidative damage to cells. The production of ROS in PCa cells was subsequently assessed using DCFH-DA. In comparison to the negative control, PCa cells treated with MZ exhibited only minimal fluorescence intensity (Fig. 5 5  Fig. 5 GUL@LsiYY1@MZ Nanomaterials combined with AMF trigger ferroptosis in prostate cancer therapy. CLSM images of LNCaP and C4-2 cells stained with ( a b c d e f g h i 2+ n p p p p Upon excessive accumulation of ROS within cells, a portion is converted into lipid peroxidation (LPO), a critical marker of ferroptosis [ 34 5 5 Intracellular ferrous ion levels were evaluated using FerroOrange. As illustrated in Fig. 5 5 35 7 Furthermore, to further explore whether the observed reduction in cell viability was mediated through ferroptosis, cells were treated with the ferroptosis inhibitor Fer-1 and the iron chelator DFO to assess the recovery of cell viability. The results demonstrated that Fer-1 was able to partially restore cell viability in the GUL@LsiYY1@MZ + AMF, MZ + AMF, and GUL@LsiYY1@MZ groups to varying extents. DFO restored cell viability in the GUL@LsiYY1@MZ + AMF and MZ + AMF groups. However, cell viability in the MZ group could not be restored by either Fer-1 or DFO (Figure S8 7 Oxidized lipidomics analyses Ferroptosis is a cell death mechanism characterized by iron-dependent peroxidation of phospholipids (PL) [ 36 6 6 6 6 37 6 38 39 6  Fig. 6 Oxidized lipidomics analyses. ( a b c d e f g Transcriptomic analyses We analyzed the effects of various nanoparticles on gene expression in LNCaP cells using RNA sequencing and pairwise comparisons. Volcano plots (Fig. 7  Fig. 7 Transcriptomic analyses of PCa cells after different treatments. ( a 2 b c 2 d e 2 f g h i n p p p p Glutathione (GSH) and GPX4 play a pivotal role in the antioxidant defense system. The impairment of this intracellular antioxidant mechanism, attributable to various factors, leads to the accumulation of lipid peroxides, which ultimately induces ferroptosis [ 40 7 Subsequently, we determined the intersection of DEGs across the three groups, culminating in the identification of 1,841 genes (Fig. 7 41 7 S9 In vivo antitumor efficacy The in vivo anti-tumor efficacy and MRI characteristics of GUL@LsiYY1@MZ nanohybrids were evaluated using the LNCaP subcutaneous tumor model (Fig. 8 2 S10 2 2 S10 2 − 1 − 1 S10 2 1 S10 42 2 2 2 8 2 43 44 8 8 2  Fig. 8 In vivo antitumor efficacy. ( a b 2 c n d e-h n f n g n h i j p p p p To assess the anti-tumor effects, LNCaP tumor-bearing male nude mice were randomly assigned to five groups ( n 8 8 8 8 Study limitations Our study investigated the GUL@LsiYY1@MZ nanoplatform that uses MHT to induce ferroptosis in PCa via YY1 silencing and SLC7A11 disruption. While preclinical models show effective tumor-specific siRNA delivery and ferroptosis activation, clinical translation is challenged by PCa heterogeneity. Key variables include interpatient differences in genetic/epigenetic profiles, PSMA expression, YY1 dependency, and redox homeostasis that impact efficacy. Current models cannot replicate this complexity. Bridging this gap requires systematic evaluation in clinically relevant systems, personalized strategies targeting heterogeneous biomarkers, and combinatorial approaches incorporating patient-specific biology for safe clinical implementation. Conclusion The GUL@LsiYY1@MZ platform targets PSMA-positive prostate cancer cells and exhibits cascaded magnetoresponsive activity, facilitating magnetothermal-triggered siYY1 release and cellular entry. This platform integrates MRI-guided tumor localization with ferroptosis induction, achieved through SLC7A11 downregulation, which reduces glutathione synthesis, amplifying lipid peroxidation and iron-dependent cell death. Demonstrated in vivo efficacy in tumor suppression with minimal toxicity supports the potential development of integrated theranostic strategies for prostate cancer monitoring and treatment. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions RJL designed this study. RJL, LXZ conducted data extraction, analysis. RJL, LXZ, QS, DXZ, XH, ZY, ZWL, KS and WX wrote the manuscript. RJL, LXZ, KS and WX reviewed and revised the manuscript. Funding This study was supported by The National Natural Science Foundation of China (No. 82404007); Sichuan Science and Technology Program (2025ZNSFSC1887); Health Science Research Project of Sichuan Province (2025 − 204); Research Fund of Sichuan Academy of Medical Sciences and Sichuan Provincial People’s Hospital (No.2023BH13). Data availability On reasonable request, the corresponding author will provide raw data analyzed in this study. Declarations Conflict of interest All authors have no conflict of interest. Ethics approval and consent to participate This study was approved by the Clinical Ethics Committee of Sichuan Provincial People’s Hospital and the Animal Experimental Ethical Inspection of the University of Electronic Science and Technology of China. The animals were housed in a controlled environment with a temperature of 22 ± 2 °C, relative humidity of 50 ± 10%, and a 12-hour light/dark cycle, with standard laboratory chow and water provided ad libitum. They were acclimatized to the housing conditions for at least 7 days before the initiation of the experiments. Since the magnetic hyperthermia treatment was non-invasive and did not induce pain or significant distress, no analgesia was administered during the procedure. Euthanasia was performed humanely at the end of the study using an overdose of anesthetic agents, and all efforts were made to minimize animal suffering. The study adhered to ethical standards for animal research. Consent for publication All authors have read and approved the final manuscript for publication. References 1. Siegel R Giaquinto A Jemal A Cancer statistics, 2024 CA Cancer J Clin 2024 74 1 12 49 38230766 10.3322/caac.21820 Siegel R, Giaquinto A, Jemal A. Cancer statistics, 2024. CA Cancer J Clin. 2024;74(1):12–49. 38230766 10.3322/caac.21820 2. Costello AJ Considering the role of radical prostatectomy in 21st century prostate cancer care Nat Rev Urol 2020 17 3 177 88 10.1038/s41585-020-0287-y 32086498 Costello AJ. Considering the role of radical prostatectomy in 21st century prostate cancer care. Nat Rev Urol. 2020;17(3):177–88. 32086498 10.1038/s41585-020-0287-y 3. Nuhn P De Bono JS Antonarakis ES Update on systemic prostate cancer therapies: management of metastatic Castration-resistant prostate cancer in the era of precision oncology Eur Urol 2019 75 1 88 99 10.1016/j.eururo.2018.03.028 29673712 Nuhn P, De Bono JS, Antonarakis ES. Update on systemic prostate cancer therapies: management of metastatic Castration-resistant prostate cancer in the era of precision oncology. Eur Urol. 2019;75(1):88–99. 29673712 10.1016/j.eururo.2018.03.028 4. Angeli JPF Krysko DV Conrad MJNRC Ferroptosis at the crossroads of cancer-acquired drug resistance and immune evasion Nat Rev Cancer 2019 19 7 405 14 10.1038/s41568-019-0149-1 31101865 Angeli JPF, Krysko DV, Conrad MJNRC. Ferroptosis at the crossroads of cancer-acquired drug resistance and immune evasion. Nat Rev Cancer. 2019;19(7):405–14. 31101865 10.1038/s41568-019-0149-1 5. Lei G LiZhuang BJNrC Gan Targeting ferroptosis as a vulnerability in cancer Nat Rev Cancer 2022 7 7 381 96 10.1038/s41568-022-00459-0 PMC10243716 35338310 Lei G, LiZhuang BJNrC, Gan. Targeting ferroptosis as a vulnerability in cancer. Nat Rev Cancer. 2022;7(7):381–96. 10.1038/s41568-022-00459-0 PMC10243716 35338310 6. Yi J Zhu J Wu J Thompson CB Jiang XJ Oncogenic activation of PI3K-AKT-mTOR signaling suppresses ferroptosis via SREBP-mediated lipogenesis Proc Natl Acad Sci U S 2020 117 49 31189 97 10.1073/pnas.2017152117 PMC7733797 33229547 Yi J, Zhu J, Wu J, Thompson CB, Jiang XJ. Oncogenic activation of PI3K-AKT-mTOR signaling suppresses ferroptosis via SREBP-mediated lipogenesis. Proc Natl Acad Sci U S. 2020;117(49):31189–97. 10.1073/pnas.2017152117 PMC7733797 33229547 7. Minami JK Morrow DH Bayley NA Fernández E Salinas JJ Tse C Zhu H Su B Plawat R A.E.J.C.c. Jones, CDKN2A deletion remodels lipid metabolism to prime glioblastoma for ferroptosis Cancer Cell 2023 41 6 1048 60 10.1016/j.ccell.2023.05.001 37236196 PMC10330677 Minami JK, Morrow DH, Bayley NA, Fernández E, Salinas JJ, Tse C, Zhu H, Su B, Plawat R. A.E.J.C.c. Jones, CDKN2A deletion remodels lipid metabolism to prime glioblastoma for ferroptosis. Cancer Cell. 2023;41(6):1048–60. 37236196 10.1016/j.ccell.2023.05.001 PMC10330677 8. Zou Y Henry WS Ricq EL Graham ET Schreiber SLJN Plasticity of ether lipids promotes ferroptosis susceptibility and evasion Nature 2020 585 7826 1 6 10.1038/s41586-020-2732-8 PMC8051864 32939090 Zou Y, Henry WS, Ricq EL, Graham ET, Schreiber SLJN. Plasticity of ether lipids promotes ferroptosis susceptibility and evasion. Nature. 2020;585(7826):1–6. 10.1038/s41586-020-2732-8 PMC8051864 32939090 9. Eliot B Karla BP Antje N Lorenzo B Denisa B Wei Y Yunpeng G Collin G Alec P Suzanne CJO Critical role of antioxidant programs in enzalutamide-resistant prostate cancer Oncogene 2023 42 30 2347 59 10.1038/s41388-023-02756-w 37355762 PMC10752496 Eliot B, Karla BP, Antje N, Lorenzo B, Denisa B, Wei Y, Yunpeng G, Collin G, Alec P, Suzanne CJO. Critical role of antioxidant programs in enzalutamide-resistant prostate cancer. Oncogene. 2023;42(30):2347–59. 37355762 10.1038/s41388-023-02756-w PMC10752496 10. Hays E Bonavida B YY1 regulates cancer cell immune resistance by modulating PD-L1 expression Drug Resist Updat 2019 43 10 28 10.1016/j.drup.2019.04.001 31005030 Hays E, Bonavida B. YY1 regulates cancer cell immune resistance by modulating PD-L1 expression. Drug Resist Updat. 2019;43:10–28. 31005030 10.1016/j.drup.2019.04.001 11. Meliala ITS Hosea R Kasim V Wu S The biological implications of Yin Yang 1 in the hallmarks of cancer Theranostics 2020 10 9 4183 200 10.7150/thno.43481 32226547 PMC7086370 Meliala ITS, Hosea R, Kasim V, Wu S. The biological implications of Yin Yang 1 in the hallmarks of cancer. Theranostics. 2020;10(9):4183–200. 32226547 10.7150/thno.43481 PMC7086370 12. Liu RJ Pu XZ Huang X Xu B Chen M Yin Yang 1 promotes the neuroendocrine differentiation of prostate cancer cells via the non-canonical WNT pathway (FYN/STAT3) Clin Transl Med 2023 13 10 1422 31 10.1002/ctm2.1422 PMC10539684 37771187 Liu RJ, Pu XZ, Huang X, Xu B, Chen M. Yin Yang 1 promotes the neuroendocrine differentiation of prostate cancer cells via the non-canonical WNT pathway (FYN/STAT3). Clin Transl Med. 2023;13(10):1422–31. 10.1002/ctm2.1422 PMC10539684 37771187 13. Li Y Li J Li Z Wei M Zhao H Miyagishi M Wu S Kasim V Homeostasis imbalance of YY2 and YY1 promotes tumor growth by manipulating ferroptosis Adv Sci 2022 9 13 2104836 49 10.1002/advs.202104836 PMC9069185 35246964 Li Y, Li J, Li Z, Wei M, Zhao H, Miyagishi M, Wu S, Kasim V. Homeostasis imbalance of YY2 and YY1 promotes tumor growth by manipulating ferroptosis. Adv Sci. 2022;9(13):2104836–49. 10.1002/advs.202104836 PMC9069185 35246964 14. Zhao M, Lu T, Bi G, Hu Z, Liang J, Bian Y, Feng M, Zhan CJB. Pharmacotherapy, PLK1 regulating chemoradiotherapy sensitivity of esophageal squamous cell carcinoma through Pentose phosphate pathway/ferroptosis, 168 (2023) 115711–23. 10.1016/j.biopha.2023.115711 37879213 15. Moukhtari SHE Garbayo E Amundarain A Pascual-Gil S Carrasco-León A Prosper F Agirre X Blanco-Prieto, lipid nanoparticles for SiRNA delivery in cancer treatment J Control Release 2023 36 130 46 10.1016/j.jconrel.2023.07.054 37532145 Moukhtari SHE, Garbayo E, Amundarain A, Pascual-Gil S, Carrasco-León A, Prosper F, Agirre X. Blanco-Prieto, lipid nanoparticles for SiRNA delivery in cancer treatment. J Control Release. 2023;36:130–46. 10.1016/j.jconrel.2023.07.054 37532145 16. Wang Y Chen Z Li J Wen Y Li J Lv Y Pei Z Pei Y A paramagnetic metal-organic framework enhances mild magnetic hyperthermia therapy by downregulating heat shock proteins and promoting ferroptosis via aggravation of two-way regulated redox dyshomeostasis Adv Sci 2024 11 2306178 10.1002/advs.202306178 PMC10953551 38161219 Wang Y, Chen Z, Li J, Wen Y, Li J, Lv Y, Pei Z, Pei Y. A paramagnetic metal-organic framework enhances mild magnetic hyperthermia therapy by downregulating heat shock proteins and promoting ferroptosis via aggravation of two-way regulated redox dyshomeostasis. Adv Sci. 2024;11:2306178. 10.1002/advs.202306178 PMC10953551 38161219 17. Wang S Wang Z Yu G Zhou Z Jacobson O Liu Y Ma Y Zhang F Chen ZY Chen X Tumor-specific drug release and reactive oxygen species generation for cancer chemo/chemodynamic combination therapy Adv Sci 2019 6 1801986 10.1002/advs.201801986 PMC6402284 30886808 Wang S, Wang Z, Yu G, Zhou Z, Jacobson O, Liu Y, Ma Y, Zhang F, Chen ZY, Chen X. Tumor-specific drug release and reactive oxygen species generation for cancer chemo/chemodynamic combination therapy. Adv Sci. 2019;6:1801986. 10.1002/advs.201801986 PMC6402284 30886808 18. Baranski AC, Schäfer M, Bauder-Wüst U, Roscher M, Schmidt J, Stenau E, Simpfendörfer T, Teber D, Maier-Hein L, B.J.J., Hadaschik M. PSMA-11-derived dual-labeled PSMA inhibitors for preoperative PET imaging and precise fluorescence-guided surgery of prostate cancer, 59(4) (2018) 639–45. 10.2967/jnumed.117.201293 29191856 19. Song S Wang Q Xie J Dai J Ouyang D Huang G Guo Y Chen C Wu M Huang T Dual-responsive turn-on T 1 Adv Healthc Mater 2023 12 28 2301437 10.1002/adhm.202301437 37379009 Song S, Wang Q, Xie J, Dai J, Ouyang D, Huang G, Guo Y, Chen C, Wu M, Huang T. Dual-responsive turn-on T 1 10.1002/adhm.202301437 37379009 20. Hou X Feng J Liu X Ren Y Zhang M Magnetic and high rate adsorption properties of porous Mn (1-x) (x) 2 4 J Colloid Interface Sci 2011 353 2 524 9 10.1016/j.jcis.2010.09.050 20974474 Hou X, Feng J, Liu X, Ren Y, Zhang M. Magnetic and high rate adsorption properties of porous Mn (1-x) (x) 2 4 20974474 10.1016/j.jcis.2010.09.050 21. Taavitsainen S Engedal N Cao S Handle F Erickson A Mills IG Attard G Wang W Nykter M Urbanucci A Single-cell ATAC and RNA sequencing reveal pre-existing and persistent cells associated with prostate cancer relapse Nat Commun 2021 12 1 5307 10.1038/s41467-021-25624-1 34489465 PMC8421417 Taavitsainen S, Engedal N, Cao S, Handle F, Erickson A, Mills IG, Attard G, Wang W, Nykter M, Urbanucci A. Single-cell ATAC and RNA sequencing reveal pre-existing and persistent cells associated with prostate cancer relapse. Nat Commun. 2021;12(1):5307. 34489465 10.1038/s41467-021-25624-1 PMC8421417 22. Liu X Jin S Hu S Li R Pan H Liu Y Lai P Xu D Sun J Liu Z Gao Y Zhao Y Liu F Xiao Y Li Y Wen Y Chen Z Xu B Lin Y Ran M Li Q Yang S Li H Tu P Haniffa M Teichmann S Bai F Wang Y Single-cell transcriptomics links malignant T cells to the tumor immune landscape in cutaneous T cell lymphoma Nat Commun 2022 13 1 1158 10.1038/s41467-022-28799-3 35241665 PMC8894386 Liu X, Jin S, Hu S, Li R, Pan H, Liu Y, Lai P, Xu D, Sun J, Liu Z, Gao Y, Zhao Y, Liu F, Xiao Y, Li Y, Wen Y, Chen Z, Xu B, Lin Y, Ran M, Li Q, Yang S, Li H, Tu P, Haniffa M, Teichmann S, Bai F, Wang Y. Single-cell transcriptomics links malignant T cells to the tumor immune landscape in cutaneous T cell lymphoma. Nat Commun. 2022;13(1):1158. 35241665 10.1038/s41467-022-28799-3 PMC8894386 23. Wang H, Guan Y, Li C, Chen J, Yue S, Qian J, Dai B, Jiang C, Wen C, Wen L. PEGylated manganese-zinc ferrite nanocrystals combined with intratumoral implantation of micromagnets enabled synergetic prostate cancer therapy via ferroptotic and Immunogenic cell death. Small 19(22) (2023). 10.1002/smll.202207077 36861297 24. Sun R Wang M Zeng T Chen H Yoshitomi T Takeguchi M Kawazoe N Yang Y Chen G Scaffolds functionalized with matrix metalloproteinase-responsive release of MiRNA for synergistic magnetic hyperthermia and sensitizing chemotherapy of drug-tolerant breast cancer Bioact Mater 2025 44 205 19 39502841 10.1016/j.bioactmat.2024.10.011 PMC11535879 Sun R, Wang M, Zeng T, Chen H, Yoshitomi T, Takeguchi M, Kawazoe N, Yang Y, Chen G. Scaffolds functionalized with matrix metalloproteinase-responsive release of MiRNA for synergistic magnetic hyperthermia and sensitizing chemotherapy of drug-tolerant breast cancer. Bioact Mater. 2025;44:205–19. 39502841 10.1016/j.bioactmat.2024.10.011 PMC11535879 25. Xie J Zhang Y Yan C Song L Wen S Zang F Chen G Ding Q Yan C Gu N High-performance pegylated Mn-Zn ferrite nanocrystals as a passive-targeted agent for magnetically induced cancer theranostics Biomaterials 2014 35 33 9126 36 10.1016/j.biomaterials.2014.07.019 25106772 Xie J, Zhang Y, Yan C, Song L, Wen S, Zang F, Chen G, Ding Q, Yan C, Gu N. High-performance pegylated Mn-Zn ferrite nanocrystals as a passive-targeted agent for magnetically induced cancer theranostics. Biomaterials. 2014;35(33):9126–36. 25106772 10.1016/j.biomaterials.2014.07.019 26. Tang Q Wang Y Yan B Zhang J Wang T Fang Y Ye Z Zhang N Zhang N Wu Z Fan H Lyu Y Liu X Wu R Intracellular magnetic hyperthermia sensitizes Sorafenib to orthotopic hepatocellular carcinoma via amplified ferroptosis ACS Nano 2024 18 43 29804 19 10.1021/acsnano.4c09500 39431335 Tang Q, Wang Y, Yan B, Zhang J, Wang T, Fang Y, Ye Z, Zhang N, Zhang N, Wu Z, Fan H, Lyu Y, Liu X, Wu R. Intracellular magnetic hyperthermia sensitizes Sorafenib to orthotopic hepatocellular carcinoma via amplified ferroptosis. ACS Nano. 2024;18(43):29804–19. 39431335 10.1021/acsnano.4c09500 27. Chen ZY Peng YT Xie XX Feng Y Li TT Li S Qin X Yang H Wu CH Zheng C Zhu J You FM Liu YY Dendrimer-functionalized superparamagnetic nanobeacons for real-time detection and depletion of HSP90α mRNA and MR imaging Theranostics 2019 9 20 5784 96 10.7150/thno.36545 31534519 PMC6735378 Chen ZY, Peng YT, Xie XX, Feng Y, Li TT, Li S, Qin X, Yang H, Wu CH, Zheng C, Zhu J, You FM, Liu YY. Dendrimer-functionalized superparamagnetic nanobeacons for real-time detection and depletion of HSP90α mRNA and MR imaging. Theranostics. 2019;9(20):5784–96. 31534519 10.7150/thno.36545 PMC6735378 28. Blatt E Parra K Neeb A Buroni L Bogdan D Yuan W Gao Y Gilbreath C Paschalis A Carreira S DeBerardinis R Mani R de Bono JS Raj G Critical role of antioxidant programs in enzalutamide-resistant prostate cancer Oncogene 2023 42 30 2347 59 10.1038/s41388-023-02756-w 37355762 PMC10752496 Blatt E, Parra K, Neeb A, Buroni L, Bogdan D, Yuan W, Gao Y, Gilbreath C, Paschalis A, Carreira S, DeBerardinis R, Mani R, de Bono JS, Raj G. Critical role of antioxidant programs in enzalutamide-resistant prostate cancer. Oncogene. 2023;42(30):2347–59. 37355762 10.1038/s41388-023-02756-w PMC10752496 29. Zou Y Henry WS Ricq EL Graham E Phadnis V Maretich P Paradkar S Boehnke N Deik AA Reinhardt F Eaton J Hammond P Boyer LA Weinberg R Schreiber S Plasticity of ether lipids promotes ferroptosis susceptibility and evasion Nature 2020 585 7826 603 8 10.1038/s41586-020-2732-8 32939090 PMC8051864 Zou Y, Henry WS, Ricq EL, Graham E, Phadnis V, Maretich P, Paradkar S, Boehnke N, Deik AA, Reinhardt F, Eaton J, Hammond P, Boyer LA, Weinberg R, Schreiber S. Plasticity of ether lipids promotes ferroptosis susceptibility and evasion. Nature. 2020;585(7826):603–8. 32939090 10.1038/s41586-020-2732-8 PMC8051864 30. Zhang L Zong Y Li Z Huang K Sun Y Lan Y Wu H Li X Zheng X Design of spinous Ni/N-GN nanocomposites as novel magnetic/dielectric microwave absorbents with high-efficiency absorption performance and thin thickness J Mater Sci 2018 53 9034 45 10.1007/s10853-018-2200-0 Zhang L, Zong Y, Li Z, Huang K, Sun Y, Lan Y, Wu H, Li X, Zheng X. Design of spinous Ni/N-GN nanocomposites as novel magnetic/dielectric microwave absorbents with high-efficiency absorption performance and thin thickness. J Mater Sci. 2018;53:9034–45. 31. Zhang L Li Q Liu J Deng Z Zhang X Alifu N Zhang X Yu Z Liu Y Lan Z Recent advances in functionalized ferrite nanoparticles: from fundamentals to magnetic hyperthermia cancer therapy Colloids Surf B 2024 234 113754 10.1016/j.colsurfb.2024.113754 38241891 Zhang L, Li Q, Liu J, Deng Z, Zhang X, Alifu N, Zhang X, Yu Z, Liu Y, Lan Z. Recent advances in functionalized ferrite nanoparticles: from fundamentals to magnetic hyperthermia cancer therapy. Colloids Surf B. 2024;234:113754. 10.1016/j.colsurfb.2024.113754 38241891 32. Mehrotra S Lee I Chan C Multilayer mediated forward and patterned SiRNA transfection using linear-PEI at extended N/P ratios Acta Biomater 2009 5 5 1474 88 10.1016/j.actbio.2009.01.004 19217360 PMC2677632 Mehrotra S, Lee I, Chan C. Multilayer mediated forward and patterned SiRNA transfection using linear-PEI at extended N/P ratios. Acta Biomater. 2009;5(5):1474–88. 19217360 10.1016/j.actbio.2009.01.004 PMC2677632 33. Ghorbani F, Irajirad R, Emami F, Vaziri Nezamdoust F, Montazerabadi AJAN. Specified iron oxide nanoparticles by PSMA-11 as a promising nanomolecular imaging probe for early detection of prostate cancer, 12(8) (2022) 2291–304. 34. Reed JC Pellecchia M Ironing out cell death mechanisms Cell 2012 149 5 963 5 10.1016/j.cell.2012.05.009 22632964 Reed JC, Pellecchia M. Ironing out cell death mechanisms. Cell. 2012;149(5):963–5. 22632964 10.1016/j.cell.2012.05.009 35. Tang Q, Wang Y, Yan B, Zhang J, Wang T, Fang Y, Ye Z, Zhang N, Zhang N. Z.J.A.n. Wu, intracellular magnetic hyperthermia sensitizes Sorafenib to orthotopic hepatocellular carcinoma via amplified ferroptosis, 18(43) (2024) 29804–19. 10.1021/acsnano.4c09500 39431335 36. Jiang X Stockwell B Conrad M Ferroptosis: mechanisms, biology and role in disease Nat Rev Mol Cell Biol 2021 22 4 266 82 10.1038/s41580-020-00324-8 33495651 PMC8142022 Jiang X, Stockwell B, Conrad M. Ferroptosis: mechanisms, biology and role in disease. Nat Rev Mol Cell Biol. 2021;22(4):266–82. 33495651 10.1038/s41580-020-00324-8 PMC8142022 37. Liang D Minikes AM Jiang X Ferroptosis at the intersection of lipid metabolism and cellular signaling Mol Cell 2022 82 12 2215 27 10.1016/j.molcel.2022.03.022 35390277 PMC9233073 Liang D, Minikes AM, Jiang X. Ferroptosis at the intersection of lipid metabolism and cellular signaling. Mol Cell. 2022;82(12):2215–27. 35390277 10.1016/j.molcel.2022.03.022 PMC9233073 38. Kagan VE Mao G Qu F Angeli JP Doll S Croix CS Dar HH Liu B Tyurin VA Ritov VB Klein-Seetharaman J Conrad M Bayir H Oxidized arachidonic and adrenic PEs navigate cells to ferroptosis Nat Chem Biol 2017 13 1 81 90 10.1038/nchembio.2238 27842066 PMC5506843 Kagan VE, Mao G, Qu F, Angeli JP, Doll S, Croix CS, Dar HH, Liu B, Tyurin VA, Ritov VB, Klein-Seetharaman J, Conrad M, Bayir H. Oxidized arachidonic and adrenic PEs navigate cells to ferroptosis. Nat Chem Biol. 2017;13(1):81–90. 27842066 10.1038/nchembio.2238 PMC5506843 39. Chen J Zaal EA Berkers CR Ruijtenbeek R Garssen J Redegeld F Omega-3 fatty acids DHA and EPA reduce bortezomib resistance in multiple myeloma cells by promoting glutathione degradation Cells 2021 10 9 2287 10.3390/cells10092287 34571936 PMC8465636 Chen J, Zaal EA, Berkers CR, Ruijtenbeek R, Garssen J, Redegeld F. Omega-3 fatty acids DHA and EPA reduce bortezomib resistance in multiple myeloma cells by promoting glutathione degradation. Cells. 2021;10(9):2287. 34571936 10.3390/cells10092287 PMC8465636 40. Chen X Li J Kang R Klionsky D Tang D Ferroptosis: Mach Regul Autophagy 2021 17 9 2054 81 10.1080/15548627.2020.1810918 PMC8496712 32804006 Chen X, Li J, Kang R, Klionsky D, Tang D. Ferroptosis: Mach Regul Autophagy. 2021;17(9):2054–81. 10.1080/15548627.2020.1810918 PMC8496712 32804006 41. Jiang L Kon N Li T Wang SJ Su T Hibshoosh H Baer R Gu W Ferroptosis as a p53-mediated activity during tumour suppression Nature 2015 520 7545 57 62 10.1038/nature14344 25799988 PMC4455927 Jiang L, Kon N, Li T, Wang SJ, Su T, Hibshoosh H, Baer R, Gu W. Ferroptosis as a p53-mediated activity during tumour suppression. Nature. 2015;520(7545):57–62. 25799988 10.1038/nature14344 PMC4455927 42. Carregal-Romero S Miguel-Coello AB Martínez-Parra L Martí-Mateo Y Hernansanz-Agustín P Fernández-Afonso Y Plaza-García S Gutiérrez L Muñoz-Hernández MM Carrillo-Romero J Piñol-Cancer M Lecante P Blasco-Iturri Z Fadón L Almansa-García AC Möller M Otaegui D Enríquez JA Groult H Ruíz-Cabello, ultrasmall manganese ferrites for in vivo catalase mimicking activity and multimodal bioimaging Small 2022 18 2106570 3106587 10.1002/smll.202106570 35263020 Carregal-Romero S, Miguel-Coello AB, Martínez-Parra L, Martí-Mateo Y, Hernansanz-Agustín P, Fernández-Afonso Y, Plaza-García S, Gutiérrez L, Muñoz-Hernández MM, Carrillo-Romero J, Piñol-Cancer M, Lecante P, Blasco-Iturri Z, Fadón L, Almansa-García AC, Möller M, Otaegui D, Enríquez JA, Groult H. Ruíz-Cabello, ultrasmall manganese ferrites for in vivo catalase mimicking activity and multimodal bioimaging. Small. 2022;18:2106570–3106587. 10.1002/smll.202106570 35263020 43. Liang M Zhou W Zhang H Zheng J Lin J Tumor microenvironment responsive T 1 2 3 4 J Mater Chem B 2023 11 19 4203 10 10.1039/D3TB00068K 37114335 Liang M, Zhou W, Zhang H, Zheng J, Lin J. Tumor microenvironment responsive T 1 2 3 4 37114335 10.1039/d3tb00068k 44. Yang W Deng C Shi X Xu Y Dai C Wang H Bian K Cui T Zhang B Structural and molecular fusion MRI nanoprobe for differential diagnosis of malignant tumors and follow-up chemodynamic therapy ACS Nano 2023 17 4 4009 22 10.1021/acsnano.2c12874 36757738 Yang W, Deng C, Shi X, Xu Y, Dai C, Wang H, Bian K, Cui T, Zhang B. Structural and molecular fusion MRI nanoprobe for differential diagnosis of malignant tumors and follow-up chemodynamic therapy. ACS Nano. 2023;17(4):4009–22. 36757738 10.1021/acsnano.2c12874 ",
  "metadata": {
    "Title of this paper": "Structural and molecular fusion MRI nanoprobe for differential diagnosis of malignant tumors and follow-up chemodynamic therapy",
    "Journal it was published in:": "Journal of Experimental & Clinical Cancer Research : CR",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487002/"
  }
}