{
  "title": "Paper_1237",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471920 PMC12471920.1 12471920 12471920 41011313 10.3390/microorganisms13091982 microorganisms-13-01982 1 Article Deciphering Bacterial Community Succession and Pathogen Dynamics in ICU Ventilator Circuits Through Full-Length 16S rRNA Sequencing for Mitigating the Risk of Nosocomial Infections Tsai Hsin-Chi Conceptualization Methodology Investigation Resources Data curation Writing – review & editing Supervision 1 2 https://orcid.org/0000-0003-3187-9479 Chen Jung-Sheng Conceptualization Methodology Investigation Data curation Visualization 3 Hsu Gwo-Jong Conceptualization Methodology Investigation Data curation Supervision 4 † https://orcid.org/0000-0003-4881-7872 Hussain Bashir Conceptualization Software Formal analysis Writing – original draft Writing – review & editing Visualization 5 https://orcid.org/0000-0002-1418-4977 Lin I-Ching Methodology Investigation Data curation Supervision 6 7 Hsu Tsui-Kang Methodology Investigation Data curation 8 9 * Han Jing Conceptualization Resources 10 https://orcid.org/0000-0002-2410-5320 Huang Shih-Wei Investigation Data curation 11 12 https://orcid.org/0000-0002-6499-1072 Wu Chin-Chia Conceptualization Methodology 13 14 15 † https://orcid.org/0000-0002-2988-8408 Hsu Bing-Mu Conceptualization Methodology Investigation Resources Data curation Writing – review & editing Supervision Funding acquisition 5 * Chen Jonathan Hon-kwan Academic Editor 1 cssbmw45@gmail.com 2 3 4 5 6 7 8 9 10 11 12 13 14 15 * jackym076@yahoo.com.tw bmhsu@ccu.edu.tw † Equally contributed to the first author. 25 8 2025 9 2025 13 9 496716 1982 11 6 2025 13 8 2025 21 8 2025 25 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The rapid evolution of ventilators and their circuits, coupled with varying maximum usage durations set by different hospitals globally, poses a significant risk for the proliferation and transmission of nosocomial infections in intensive care settings. This study investigated temporal changes in bacterial community structure and predicted metabolic functions in ventilator circuits over a three-week period, with a specific focus on ESKAPE pathogens. The results of full-length 16S rRNA sequencing revealed dynamic shifts in bacterial communities, with an increased bacterial diversity and unique species prevalence in week-2 compared to week-1 and week-3. However, a marked emergence of pathogenic bacteria, including Serratia marcescens Chryseobacterium indologenes Klebsiella pneumoniae Acinetobacter baumannii Pseudomonas aeruginosa K. pneumoniae nosocomial infection ventilator circuit ESKAPE pathogen ventilator associated-pneumonia full-length 16S rRNA genes the National Science and Technology Council, Taiwan NSTC 111-2116-M-194-010 Hualien Tzu-Chi General Hospital, Dalin Tzu-Chi Hospital, and Ditmanson Medical Foundation Chiayi Christian Hospital-National Chung Cheng University Joint Research Program CYCH-CCU-2022-033 This research was supported by the National Science and Technology Council, Taiwan (NSTC 111-2116-M-194-010), Hualien Tzu-Chi General Hospital, Dalin Tzu-Chi Hospital, and Ditmanson Medical Foundation Chiayi Christian Hospital-National Chung Cheng University Joint Research Program (CYCH-CCU-2022-033). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Hospital-acquired infections (HAIs) or nosocomial infections are a significant global public health concern, particularly in intensive care units (ICUs). These infections often arise independently of the primary reason for hospitalization and can manifest even after the patient has been discharged [ 1 1 2 Enterococcus Staphylococcus aureus Klebsiella Acinetobacter Pseudomonas aeruginosa Enterobacteriaceae 3 4 5 6 7 8 9 4 In ICUs, mechanical ventilators are essential for supporting patients with severe respiratory conditions. Despite their critical role, these systems can serve as potential reservoirs for nosocomial pathogens, particularly those caused by ESKAPE pathogens [ 10 11 12 13 13 14 15 In this context, comprehensive microbial monitoring is necessary to reveal how bacterial communities evolve within ventilator systems over time. Traditional culture-based methods often miss slow-growing or unculturable organisms [ 16 17 18 2. Materials and Methods 2.1. Sample Collection A total of 16 ventilator circuit samples were collected from a cohort consisting of 8 male and 8 female patients, ranging in age from 34 to 94 years. The majority of these patients were suffering from respiratory illnesses and were all receiving mechanical ventilation, as shown in Table S1 2.2. DNA Extraction and Sequencing The extraction of genomic DNA from ventilator tube samples was carried out using the Quick-DNA™ Fungal/Bacterial Miniprep Kit (Zymo Research, Irvine, CA, USA), strictly following the manufacturer’s protocol. The purity and quantity of the extracted gDNA were analyzed using a Nanodrop ® 19 20 21 22 2.3. Detection of ESKAPE Pathogens All the ventilator tube samples were assessed to confirm the presence/absence of ESKAPE pathogens by targeting their specific genes using PCR. Intergenic spacer (ITS) PCR was employed to confirm the A. baumannii K. pneumoniae P. aeruginosa Staphylococcus aureus Enterococcus faecium Enterococcus faecalis sodA ddI Table S2 3. Results 3.1. Variations in Bacterial Community Structure and Potential Health Risks Associated with Prolonged Use of Ventilator Tubes The bacterial diversity associated with increasing durations of ventilator tube usage was explored using Shannon and Simpson alpha diversity metrics ( Figure 1 p p p Figure 1 p 3.2. Variation in Bacterial Community Composition and Potential Health Risks Associated with Prolonged Use of Ventilator Tubes PacBio sequencing targeting the full-length 16S rRNA revealed a total of 262 classifiable species found in the samples collected from ventilator tubes utilized over the three-week period. PCA analysis was utilized to determine the variation in the bacterial community among the samples based on the duration of ventilator tube usage. In the top scatter plot (PC1 vs. PC2), all three groups overlap significantly along the PC1 axis (which explains 23.1% of the variance) but show some separation along the PC2 axis (15.5% of variance), as shown in Figure 2 Top 10 species results showed that Eschericatella adiacens Corynebacterium striatum Streptococcus peroris ATCC 700780 Prevotella jejuni Figure 3 Serratia marcescens subsp. marcescens ATCC 13880 Stenotrophomonas pavanii Muribaculum intestinale Chryseobacterium indologenes NBRC 14944 Chryseobacterium indologenes NBRC 14944 Stenotrophomonas pavanii Pseudomonas tolaasii Klebsiella pneumoniae 3.3. Variation in Pathogenic Bacterial Community Composition and Potential Health Risk Associated with the Prolonged Use of Ventilator Tube A diverse group of pathogenic bacteria exhibited varying patterns of abundance in the ventilator tube samples over three weeks. Most pathogens were highly abundant in week-1, followed by a decline in week-2 and week-3 ( Figure 4 Escherichia fergusonii ATCC 35469 Corynebacterium striatum Figure 4 Serratia marcescens ATCC 13880 Eggerthella lenta Streptococcus agalactiae ATCC 13813, K. pneumoniae Acinetobacter baumannii Chryseobacterium indologenes NBRC 14944 K. pneumoniae Acinetobacter baumannii PCR analysis further confirmed an increased detection rate of ESKAPE pathogens with prolonged ventilator tube use. P. aeruginosa S. aureus K. pneumoniae Table 1 A. baumannii E. faecium E. faecalis 3.4. Variation in Bacterial Community Metabolic Functions Associated with the Prolonged Use of Ventilator Tubes The PCA analysis indicated significant overlap in the annotated functions of the bacterial communities over the duration of three weeks of ventilator usage ( Figure 5 Figure 5 4. Discussion The rapid changes in ventilators and their circuits in ICUs are not well-defined, posing significant risks of nosocomial infections, which lead to increased morbidity, mortality, and economic burdens [ 23 15 24 Additionally, this study also observed a shift in the dominant bacterial species of ventilator circuits, with E. adiacens C. striatum S. marcescens C. indologenes S. pavanii K. pneumoniae 12 E. adiacens C. striatum E. adiacens C. striatum 25 C. striatum 26 S. maltophilia 27 K. pneumoniae 28 29 K. pneumoniae 30 PCR analysis revealed varying prevalence of ESKAPE pathogens associated with ventilator circuits over time, with P. aeruginosa P. aeruginosa 31 32 S. aureus K. pneumoniae S. aureus S. aureus 33 34 35 K. pneumoniae Similarly, functions related to specific pathogens, such as pneumonia, nosocomial, and septicemia, were highly abundant in week-3 compared to the other two weeks based on FAPROTAX analysis. This suggests a shift toward metabolic functions associated with increased virulence or opportunism, further emphasizing the critical need for continuous monitoring to understand the implications of these microbial community shifts on patient health and safety. These functional trends were consistent with the taxonomic enrichment of known nosocomial pathogens such as Klebsiella pneumoniae Acinetobacter baumannii 5. Conclusions This study provides crucial insights into the dynamic changes in microbial communities and their metabolic functions associated with ventilator circuits over time, emphasizing the risks of prolonged use in intensive care settings. The findings revealed that while microbial diversity initially increased, extended usage led to the emergence of more virulent pathogens, such as Klebsiella pneumoniae Acinetobacter baumannii Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/microorganisms13091982/s1 36 37 38 39 40 41 Author Contributions H.-C.T.: Conceptualization, Methodology, Data curation, Resources, Supervision, Investigation, Writing—review and editing. J.-S.C.: Conceptualization, Methodology, Data curation, Investigation, Visualization. G.-J.H.: Conceptualization, Methodology, Data curation, Investigation, Supervision. B.H.: Conceptualization, Formal analysis, Software, Visualization, Writing—original draft. Writing—review and editing. I.-C.L.: Methodology, Data curation, Supervision, Investigation. T.-K.H.: Methodology, Data curation, Investigation. J.H.: Conceptualization, Resources. S.-W.H.: Data curation, Investigation. C.-C.W.: Conceptualization, Methodology. B.-M.H.: Conceptualization, Methodology, Data curation, Resources, Supervision, Investigation, Funding acquisition, Writing—review and editing. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was approved by the Institutional Ethics Committee of Chia-Yi Christian Hospital (IRB2022033, 3 April 2023), and all participants provided written informed consent. Informed Consent Statement Written informed consent has been obtained from the patient(s) to publish this paper. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Material Conflicts of Interest The authors declare no conflicts of interest. References 1. Divatia J. Pulinilkunnathil J.G. Myatra S.N. Nosocomial infections and ventilator-associated pneumonia in cancer patients Oncologic Critical Care Springer Cham, Switzerland 2020 1419 1439 10.1007/978-3-319-74588-6_125 2. Vincent J.-L. Rello J. Marshall J. Silva E. Anzueto A. Martin C.D. Moreno R. Lipman J. Gomersall C. Sakr Y. International study of the prevalence and outcomes of infection in intensive care units Jama 2009 302 2323 2329 10.1001/jama.2009.1754 19952319 3. Oni O. Orok E. Lawal Z. Ojo T. Oluwadare T. Bamitale T. Jaiyesimi B. Akinjisola A. Apara T. Knowledge and perception of nosocomial infections among patients in a Nigerian hospital Sci. Rep. 2023 13 20204 10.1038/s41598-023-47661-0 37980389 PMC10657427 4. Ribeiro L.F. Lopes E.M. Kishi L.T. Ribeiro L.F.C. Menegueti M.G. Gaspar G.G. Silva-Rocha R. Guazzaroni M.-E. Microbial Community Profiling in Intensive Care Units Expose Limitations in Current Sanitary Standards Front. Public Health 2019 7 240 10.3389/fpubh.2019.00240 31555629 PMC6724580 5. Yasir M. Subahi A.M. Shukri H.A. Bibi F. Sohrab S.S. Alawi M. Sindi A.A. Jiman-Fatani A.A. Azhar E.I. Bacterial Community and Genomic Analysis of Carbapenem-Resistant Acinetobacter baumannii Isolates from the Environment of a Health Care Facility in the Western Region of Saudi Arabia Pharmaceuticals 2022 15 611 10.3390/ph15050611 35631436 PMC9145440 6. Santajit S. Indrawattana N. Mechanisms of Antimicrobial Resistance in ESKAPE Pathogens Biomed. Res. Int. 2016 2016 2475067 10.1155/2016/2475067 27274985 PMC4871955 7. Abban M.K. Ayerakwa E.A. Mosi L. Isawumi A. The burden of hospital acquired infections and antimicrobial resistance Heliyon 2023 9 e20561 10.1016/j.heliyon.2023.e20561 37818001 PMC10560788 8. Venkateswaran P. Vasudevan S. David H. Shaktivel A. Shanmugam K. Neelakantan P. Solomon A.P. Revisiting ESKAPE Pathogens: Virulence, resistance, and combating strategies focusing on quorum sensing Front. Cell. Infect. Microbiol. 2023 13 1159798 10.3389/fcimb.2023.1159798 37457962 PMC10339816 9. Allegranzi B. Nejad S.B. Combescure C. Graafmans W. Attar H. Donaldson L. Pittet D. Burden of endemic health-care-associated infection in developing countries: Systematic review and meta-analysis Lancet 2011 377 228 241 10.1016/S0140-6736(10)61458-4 21146207 10. Cavalcanti M. Valencia M. Torres A. Respiratory nosocomial infections in the medical intensive care unit Microbes Infect. 2005 7 292 301 10.1016/j.micinf.2004.12.001 15733530 11. Craven D.E. Goularte T.A. Make B.J. Contaminated condensate in mechanical ventilator circuits. A risk factor for nosocomial pneumonia? Am. Rev. Respir. Dis. 1984 129 625 628 6585160 12. Pen D.L. Yan G.F. He L.Y. Yan W.L. Chen W.M. Liu J. Ying J.Y. Wang C.Q. Lu G.P. The role of bacterial colonization of ventilator circuit in development of ventilator-associated pneumonia: A prospective observational cohort study Clin. Microbiol. Infect. 2021 27 e461 e467 10.1016/j.cmi.2020.04.008 32305671 13. Alp E. Voss A. Ventilator associated pneumonia and infection control Ann. Clin. Microbiol. Antimicrob. 2006 5 7 10.1186/1476-0711-5-7 16600048 PMC1540438 14. Semet C. The ongoing challenge of ventilator-associated pneumonia: Epidemiology, prevention, and risk factors for mortality in a secondary care hospital intensive care unit Infect. Prev. Pract. 2023 5 100320 10.1016/j.infpip.2023.100320 38028359 PMC10663678 15. Li Y.-C. Lin H.-L. Liao F.-C. Wang S.-S. Chang H.-C. Hsu H.-F. Chen S.-H. Wan G.-H. Potential risk for bacterial contamination in conventional reused ventilator systems and disposable closed ventilator-suction systems PLoS ONE 2018 13 e0194246 10.1371/journal.pone.0194246 29547638 PMC5856346 16. Bodor A. Bounedjoum N. Vincze G.E. Erdeiné Kis Á. Laczi K. Bende G. Szilágyi Á. Kovács T. Perei K. Rákhely G. Challenges of unculturable bacteria: Environmental perspectives Rev. Environ. Sci. Bio/Technol. 2020 19 1 22 10.1007/s11157-020-09522-4 17. Eamsakulrat P. Santanirand P. Phuphuakrat A. Diagnostic Yield and Impact on Antimicrobial Management of 16S rRNA Testing of Clinical Specimens Microbiol. Spectr. 2022 10 e02094-22 10.1128/spectrum.02094-22 36374024 PMC9769669 18. Rampini S.K. Bloemberg G.V. Keller P.M. Büchler A.C. Dollenmaier G. Speck R.F. Böttger E.C. Broad-Range 16S rRNA Gene Polymerase Chain Reaction for Diagnosis of Culture-Negative Bacterial Infections Clin. Infect. Dis. 2011 53 1245 1251 10.1093/cid/cir692 21976460 19. Schloss P.D. Jenior M.L. Koumpouras C.C. Westcott S.L. Highlander S.K. Sequencing 16S rRNA gene fragments using the PacBio SMRT DNA sequencing system PeerJ 2016 4 e1869 10.7717/peerj.1869 27069806 PMC4824876 20. Huang S.-W. Hussain B. Chen J.-S. Asif A. Hsu B.-M. Evaluating groundwater ecosystem dynamics in response to post in-situ remediation of mixed chlorinated volatile organic compounds (CVOCs): An insight into microbial community resilience, adaptability, and metabolic functionality for sustainable remediation and ecosystem restoration Sci. Total Environ. 2024 920 170874 10.1016/j.scitotenv.2024.170874 38350560 21. Hussain B. Chen J.-S. Huang S.-W. Tsai I.S. Rathod J. Hsu B.-M. Underpinning the ecological response of mixed chlorinated volatile organic compounds (CVOCs) associated with contaminated and bioremediated groundwaters: A potential nexus of microbial community structure and function for strategizing efficient bioremediation Environ. Pollut. 2023 334 122215 10.1016/j.envpol.2023.122215 37473850 22. Hussain B. Wu C.-C. Tsai H.-C. Chen J.-S. Asif A. Cheng M.-C. Jou Y.C. Hsu B.-M. Species-level characterization of gut microbiota and their metabolic role in kidney stone formation using full-length 16S rRNA sequencing Urolithiasis 2024 52 115 10.1007/s00240-024-01610-2 39126448 23. Morehead R.S. Pinto S.J. Ventilator-Associated Pneumonia Arch. Intern. Med. 2000 160 1926 1936 10.1001/archinte.160.13.1926 10888967 24. Hübner N.O. Daeschlein G. Lehmann C. Musatkin S. Kohlheim U. Gibb A. Assadian O. Kobayashi H. Microbiological safety and cost-effectiveness of weekly breathing circuit changes in combination with heat moisture exchange filters: A prospective longitudinal clinical survey GMS Krankenhhyg Interdiszip 2011 6 Doc15 10.3205/dgkh000172 22242096 PMC3252668 25. Leyton B. Ramos J.N. Baio P.V.P. Veras J.F.C. Souza C. Burkovski A. Mattos-Guaraldi A.L. Vieira V.V. Abanto Marin M. Treat Me Well or Will Resist: Uptake of Mobile Genetic Elements Determine the Resistome of Corynebacterium striatum Int. J. Mol. Sci. 2021 22 7499 10.3390/ijms22147499 34299116 PMC8304765 26. Milosavljevic M.N. Milosavljevic J.Z. Kocovic A.G. Stefanovic S.M. Jankovic S.M. Djesevic M. Milentijevic M.N. Antimicrobial treatment of Corynebacterium striatum invasive infections: A systematic review Rev. Inst. Med. Trop. Sao Paulo 2021 63 e49 10.1590/s1678-9946202163049 34161555 PMC8216692 27. Samonis G. Karageorgopoulos D.E. Maraki S. Levis P. Dimopoulou D. Spernovasilis N.A. Kofteridis D.P. Falagas M.E. Stenotrophomonas maltophilia Infections in a General Hospital: Patient Characteristics, Antimicrobial Susceptibility, and Treatment Outcome PLoS ONE 2012 7 e37375 10.1371/journal.pone.0037375 22624022 PMC3356252 28. Guo S. Xu J. Wei Y. Xu J. Li Y. Xue R. Clinical and molecular characteristics of Klebsiella pneumoniae ventilator-associated pneumonia in mainland China BMC Infect. Dis. 2016 16 608 10.1186/s12879-016-1942-z 27782809 PMC5080764 29. Maurici M. D’Alò G.L. Fontana C. Santoro V. Gaziano R. Ciotti M. Cicciarella Modica D. De Filippis P. Sarmati L. De Carolis G. Microbiology and Clinical Outcome of Hospital-Acquired Respiratory Infections in an Italian Teaching Hospital: A Retrospective Study Healthcare 2022 10 2271 10.3390/healthcare10112271 36421594 PMC9691183 30. Ostria-Hernandez M.L. Juárez-de la Rosa K.C. Arzate-Barbosa P. Lara-Hernández A. Sakai F. Ibarra J.A. Castro-Escarpulli G. Vidal J.E. Nosocomial, Multidrug-Resistant Klebsiella pneumoniae Strains Isolated from Mexico City Produce Robust Biofilms on Abiotic Surfaces but Not on Human Lung Cells Microb. Drug Resist. 2018 24 422 433 10.1089/mdr.2017.0073 28915364 PMC5946738 31. Bhagirath A.Y. Li Y. Somayajula D. Dadashi M. Badr S. Duan K. Cystic fibrosis lung environment and Pseudomonas aeruginosa infection BMC Pulm. Med. 2016 16 174 10.1186/s12890-016-0339-5 27919253 PMC5139081 32. Reyne N. McCarron A. Cmielewski P. Parsons D. Donnelley M. To bead or not to bead: A review of Pseudomonas aeruginosa lung infection models for cystic fibrosis Front. Physiol. 2023 14 1104856 10.3389/fphys.2023.1104856 36824474 PMC9942929 33. Burnham J.P. Kollef M.H. Prevention of Staphylococcus aureus Ventilator-Associated Pneumonia: Conventional Antibiotics Won’t Cut It Clin. Infect. Dis. 2017 64 1089 1091 10.1093/cid/cix060 28158521 PMC5850453 34. Li H. Bai R. Zhao Z. Tao L. Ma M. Ji Z. Jian M. Ding Z. Dai X. Bao F. Application of droplet digital pcr to detect the pathogens of infectious diseases Biosci. Rep. 2018 38 BSR20181170 10.1042/BSR20181170 30341241 PMC6240714 35. Hussain B. Chen J.-S. Hsu B.-M. Chu I.-T. Koner S. Chen T.-H. Rathod J. Chan M.W.Y. Deciphering bacterial community structure, functional prediction and food safety assessment in fermented fruits using next-generation 16s rrna amplicon sequencing Microorganisms 2021 9 1574 10.3390/microorganisms9081574 34442653 PMC8401261 36. Chen T.-L. Sin L.-K. Wu R.-C. Shaio M.-F. Huang L.-Y. Fung C.-P. Lee C.-M. Cho W.-L. Comparison of one-tube multiplex PCR, automated ribotyping and intergenic spacer (ITS) sequencing for rapid identification of Acinetobacter baumannii Clin. Microbiol. Infect. 2007 13 801 806 10.1111/j.1469-0691.2007.01744.x 17488329 37. Spilker T. Coenye T. Vandamme P. LiPuma J.J. PCR-based assay for differentiation of Pseudomonas aeruginosa from other Pseudomonas species recovered from cystic fibrosis patients J. Clin. Microbiol. 2004 42 2074 2079 10.1128/JCM.42.5.2074-2079.2004 15131172 PMC404678 38. Turton J.F. Perry C. Elgohari S. Hampton C.V. PCR characterization and typing of Klebsiella pneumoniae using capsular type-specific, variable number tandem repeat and virulence gene targets J. Med. Microbiol. 2010 59 541 547 10.1099/jmm.0.015198-0 20110386 39. Banada P.P. Chakravorty S. Shah D. Burday M. Mazzella F.M. Alland D. Highly sensitive detection of Staphylococcus aureus directly from patient blood PLoS ONE 2012 7 e31126 10.1371/journal.pone.0031126 22363564 PMC3281916 40. Depardieu F. Perichon B. Courvalin P. Detection of the van alphabet and identification of enterococci and staphylococci at the species level by multiplex PCR J. Clin. Microbiol. 2004 42 5857 5860 10.1128/JCM.42.12.5857-5860.2004 15583325 PMC535300 41. Kasimoglu-Dogru A. Gencay Y.E. Ayaz N.D. Prevalence and antibiotic resistance profiles of Enterococcus species in chicken at slaughter level; absence of vanA and vanB genes in E. faecalis E. faecium Res. Vet. Sci. 2010 89 153 158 10.1016/j.rvsc.2010.02.005 20189617 Figure 1 Impact of prolonged use of ventilator tubes on bacterial community structure. Alpha diversity indices ( A B C Figure 2 Variation in the bacterial community species composition associated with prolonged use of ventilator tube. PCA analysis ( A B Figure 3 Variation in the composition and abundance of top 10 species associated with the prolonged use of ventilator tube over the period of three weeks. Figure 4 Variation in the composition and abundance of pathogenic bacteria at the species level associated with the prolonged usage of ventilator tube. Heatmap ( A B Figure 5 Variation in the composition and abundance of bacterial community functions associated with the prolonged usage period of ventilator tube. PCA analysis ( A B microorganisms-13-01982-t001_Table 1 Table 1 Prevalence of ESKAPE pathogens associated with the prolonged use of ventilator tubes using PCR. Pathogen Week-1 ( n Week-2 ( n Week-3 ( n  P. aeruginosa 1/6 = 16.6% 1/5 = 20% 3/5 = 60%  A. baumannii 0/6 = 0% 0/6 = 0% 0/6 = 0%  S. aureus 1/6 = 16.6% 1/5 = 20% 1/5 = 20%  E. faecium 0/6 = 0% 0/6 = 0% 0/6 = 0%  E. faecalis 0/6 = 0% 0/6 = 0% 0/6 = 0%  K. pneumoniae 1/6 = 16.6% 0/6 = 0% 1/5 = 20% ",
  "metadata": {
    "Title of this paper": "Prevalence and antibiotic resistance profiles of Enterococcus species in chicken at slaughter level; absence of vanA and vanB genes in ",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471920/"
  }
}