{
  "title": "Paper_913",
  "abstract": "pmc Clin Transl Sci Clin Transl Sci 2996 cts CTS Clinical and Translational Science 1752-8054 1752-8062 Wiley PMC12477543 PMC12477543.1 12477543 12477543 41017748 10.1111/cts.70371 CTS70371 CTS-2025-0183 1 Brief Report Brief Report Risk and Association of Specific HLA Mocci Stefano https://orcid.org/0000-0001-8736-7240  1  2 Littera Roberto https://orcid.org/0000-0003-3143-3792  3 Deidda Silvia https://orcid.org/0009-0004-6879-2400  4 Perra Andrea https://orcid.org/0000-0002-8098-899X  5 Floris Matteo https://orcid.org/0000-0003-4385-9336  6 matteo.floris@gmail.com Giglio Sabrina https://orcid.org/0000-0002-3954-326X  1  2  3   1 Medical Genetics, Department of Medical Sciences and Public Health University of Cagliari Cagliari Italy   2 Centre for Research University Services (CeSAR, Centro Servizi di Ateneo per la Ricerca) University of Cagliari Cagliari Italy   3 Medical Genetics R. Binaghi Hospital Cagliari Italy   4 Pneumology Unit R. Binaghi Hospital Cagliari Italy   5 Oncology and Molecular Pathology Unit, Department of Biomedical Sciences University of Cagliari Cagliari Italy   6 Department of Biomedical Sciences University of Sassari Sassari Sardinia Italy * Correspondence: matteo.floris@gmail.com 29 9 2025 10 2025 18 10 497490 10.1111/cts.v18.10 e70371 19 8 2025 26 3 2025 15 9 2025 29 09 2025 30 09 2025 30 09 2025 © 2025 The Author(s). Clinical and Translational Science https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Idiopathic Pulmonary Fibrosis (IPF) is a progressive and fatal lung disease with limited treatment options. Nintedanib pirfenidone HLA‐C*06:02 nintedanib p p adverse drug effects nintedanib pharmacogenetics e.INS—Ecosystem of Innovation for Next Generation Sardinia ECS 00000038 Italian Ministry for Research and Education (MUR) 10.13039/501100021856 National Recovery and Resilience Plan (NRRP) University of Cagliari 10.13039/100013003 CUP F53C22000430001 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  S. Mocci R. Littera S. Deidda A. Perra M. Floris S. Giglio Risk and Association of Specific HLA Clinical and Translational Science 18 10 2025 e70371 10.1111/cts.70371  Funding: Stefano Mocci and Roberto Littera contributed equally to this work.  Study Highlights  What is the current knowledge on the topic? ○ The current knowledge regarding pharmacogenetic factors influencing the toxicity and efficacy of antifibrotic drugs nintedanib pirfenidone DSP CYP1A2 TOLLIP What question did this study address? ○ Is it possible to predict the risk of toxicity and efficacy of antifibrotic drugs nintedanib pirfenidone What does this study add to our knowledge? ○ This study presents novel findings regarding the association between HLA alleles and drug‐related AEs in a cohort of Italian Idiopathic Pulmonary Fibrosis (IPF) patients: specifically, HLA‐C*06:02 nintedanib How might this change clinical pharmacology or translational science? ○ This exploratory study suggests a precise target for further studies aimed at discovering genetic factors involved in the response and toxicity of antifibrotic drugs. 1 Introduction Idiopathic pulmonary fibrosis (IPF) is a progressive and life‐threatening interstitial lung disease characterized by irreversible scarring of the lung tissue, leading to a progressive decline in respiratory function. Given its poor prognosis and limited treatment options, investigating the efficacy and tolerability of available therapies is essential for optimizing patient outcomes [ 1 At present, there is no definitive cure for IPF, and only a few therapeutic interventions are available to alleviate symptoms and mitigate disease progression. Currently, two antifibrotic drugs are approved by both FDA and EMA: nintedanib pirfenidone Nintedanib fibroblast growth factor receptor vascular endothelial growth factor receptor platelet‐derived growth factor receptor colony‐stimulating factor‐1 receptor Fms‐like tyrosine kinase‐3 nintedanib 2 On the other hand, pirfenidone transforming growth factor beta 1 3 Although both drugs individually caused adverse effects, their effectiveness showed minimal differences [ 4 pirfenidone nintedanib 5 For both drugs, a personalized therapeutic approach is essential, emphasizing the importance of pharmacogenetic tools to assist clinicians in stratifying patients based on their risk of toxic effects. Despite this need, current pharmacogenetic knowledge regarding the toxicity and efficacy of these drugs remains quite limited. A study involving 210 IPF patients investigated the association between common profibrotic polymorphisms in mucin 5B desmoplakin 6 rs2076295 nintedanib p nintedanib In the case of pirfenidone rs762551 p 4 rs5743890 p 5 The human leukocyte antigen (HLA) complex, a group of genes located on chromosome 6, encodes cell surface proteins that are crucial for immune system function. These proteins are expressed in almost all cells and play a fundamental role in presenting peptides to immune cells. HLA 6 Although the role of MHC genes in drug‐induced toxicity has been established for some medications, their potential involvement in nintedanib‐ pirfenidone 2 Methods 2.1 Cohort Description We evaluated a cohort of 149 unrelated patients with IPF. To minimize bias in assessing drug efficacy, we excluded 27 patients receiving immunosuppressive therapy (corticosteroids or azathioprine) or those with pulmonary comorbidities (lung cancer or chronic obstructive pulmonary disease). Among the remaining 122 patients, 78 (63.93%) were treated with nintedanib pirfenidone The toxicity of antifibrotic drugs nintedanib pirfenidone At the time of diagnosis, the two treatment groups had no significant differences in baseline characteristics. The age at diagnosis was 69.4 ± 8.1 years for the nintedanib pirfenidone t p Tolerability rates did not differ significantly between the two drugs (Fisher's exact test, two‐tailed, p nintedanib pirfenidone Nine patients experienced adverse events related to pirfenidone, most commonly presenting with erythema (7/9), followed in some cases by photosensitivity (2/9) and headache (1/9). In contrast, among the 16 patients with adverse effects caused by nintedanib Although no significant differences in drug tolerability were observed, we explored whether individual genetic factors might influence the risk of AEs. To investigate this, we analyzed existing high‐resolution HLA unpublished results HLA‐A, ‐B, ‐C, ‐F, ‐G, ‐H, ‐E, DRB1/3/4/5, ‐DQA1, ‐DQB1, ‐DPA1, ‐DPB1, MICA MICB 2.2 Statistical Analysis The association between HLA 7 nintedanib nintedanib HLA p HLA p HLA‐C*06:02 p 3 Results Our findings revealed five alleles ( HLA‐G*01:06, −A*01:01, C*06:02, G*01:01, A*11:01 N N nintedanib pirfenidone S1 In particular, the HLA‐G*01:06, ‐A*01:01, C*06:02 and A*11:01 HLA‐G*01:01 pirfenidone N In contrast, when considering the 78 patients treated with nintedanib HLA‐C*06:02 p 1 nintedanib TABLE 1 Association between HLA Nintendanib nintedanib Nintendanib  HLA AE ( N No AE ( N  p  a OR 95% CI 2 N % 2 N %  C*06:02 7 21.88 7 5.65  0.0043  b 6.54 1.80 23.75  G*01:06 5 15.62 4 3.23  0.0328  b 4.47 1.13 17.70  G*01:01 16 50 86 69.35 0.0592 0.46 0.20 1.03  A*01:01 5 15.62 6 4.92 0.0681 3.20 0.92 11.13  A*11:01 5 15.62 8 6.56 0.115 2.86 0.77 10.57  Note: N Abbreviations: AE, patients with adverse effects; No AE, patients without adverse effects.  a  p 8  b Bold values indicate nominal associations with p In addition, the HLA‐G*01:06 nintedanib N N p 1 The most common adverse effect of nintedanib HLA‐C*06:02 N nintedanib N p 2 TABLE 2 Association between HLA alleles and Nintendanib nintedanib Nintendanib  HLA Adverse reaction ( E N No reaction ( F N  E F 2 N % 2 N %  p  a OR 95% CI  C*06:02 7 29.17 7 5.3  0.0005  b 11.86 2.95 47.71  G*01:06 4 16.67 5 3.79  0.0445  b 4.14 1.04 16.56  G*01:01 11 45.83 91 68.94  0.0382  b 0.38 0.15 0.95  A*01:01 4 16.67 7 5.38 0.0853 3.11 0.85 11.31  A*11:01 3 12.5 10 7.69 0.4237 1.83 0.42 8.01  Note: N  a  p 8  b Bold values indicate nominal associations with p Additionally, the HLA‐G*01:06 N N p HLA‐C*06:02 or HLA‐G*01:06— Conversely, the HLA‐G*01:01 N N p 2 4 Discussion We identified five HLA alleles associated with adverse effects of antifibrotic drugs. HLA‐G*01:06, ‐A*01:01, ‐C*06:02 A*11:01 HLA‐G*01:01 pirfenidone HLA‐C*06:02 nintedanib p nintedanib carried HLA‐C*06:02 p The exact mechanism of nintedanib 9 9 nintedanib 9 HLA‐C*06:02 This allele has already been correlated to drug toxicity and efficacy in other pharmacogenetic studies across multiple populations [ 10 sulfamethoxazole/trimethoprim 11 Moreover, another inflammatory condition, psoriatic arthritis (PsA), highlights the importance of this allele [ 12 HLA‐C*06:02 8 8 12 Additionally, HLA‐C*06:02 Ustekinumab 13 10 Based on this, if nintedanib HLA‐C*06:02‐ This mechanism suggests a hypothesis that could explain the increased susceptibility of HLA‐C*06:02 nintedanib‐driven Although the sample size is small (but in any case, twice as large as other studies [ 6 7 9 HLA‐C*06:02 nintedanib HLA Our findings underscore the need for rigorous dose‐finding studies that incorporate pharmacogenetic data, even in the context of dose‐sparing approaches that have been recently proposed. The idea of dose‐sparing combination therapy—for example, halving the standard doses of nintedanib and pirfenidone and administering them together—is indeed an attractive hypothesis. Given the distinct yet partially complementary mechanisms of action and nonoverlapping toxicity profiles of the two drugs, such an approach could, in theory, preserve efficacy while mitigating individual drug‐related adverse events. However, current data on combination therapy raise some concerns. Notably, the incidence of certain adverse events, particularly diarrhea, appears to be higher when the two drugs are used together, even at adjusted doses [ 14 15 With regard to the other findings, although only marginally significant, the HLA‐G 01:06 G 01:01 HLA‐G, through its tolerogenic properties, exerts potent immunomodulatory and anti‐inflammatory effects. Its expression is tightly regulated by genetic polymorphisms in coding, 3′ untranslated regions (UTRs) and modulated by cytokine signaling, particularly IL‐10 and IFN‐γ, in response to inflammation or infection [ 16 At the protein level, the main difference between HLA‐G* 01:06 HLA‐G*01:01 17 18 19 HLA‐G*01:06 19 Furthermore, HLA‐G 20 HLA‐G*01:06 HLA‐G*01:01 21 These UTR haplotypes differ at several functional regulatory sites, including the 14‐bp insertion/deletion +3142C>G 14‐bp insertion, +3142G, and 21 22 23 24 This study is the first to propose a key role of HLA‐C*06:02 nintedanib HLA‐G 01:06 G*01:01 HLA Author Contributions S.M., R.L. and M.F. wrote the manuscript; S.D., A.P. and S.G. designed the research, S.M., R.L. and M.F. performed the research S.M. and M.F. analyzed the data. Ethics Statement Patients were recruited and enrolled in the study protocol at the Department of Biomedical Sciences and Public Health of the University of Cagliari, the Department of Pneumology of Binaghi Hospital of the Sardinian Regional Company for the Protection of Health (ASL Cagliari). Written informed consent was obtained from all patients and controls in accordance with the ethical standards (institutional and national) of the local human research committee. The study protocol, including informed consent procedures, conforms to the ethical guidelines of the Declaration of Helsinki and was approved by the responsible ethics committee (Ethics Committee of the Cagliari University Hospital; date of approval: May 27, 2020; protocol number GT/2020/10894). Records of written informed consent are kept on file and are included in the clinical record of each patient. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Table S1: Acknowledgments This research was made possible through the collaboration of the volunteers of the non‐profit organization Associazione per l'Avanzamento della Ricerca per i Trapianti (AART‐ODV), supported by Fondazione di Sardegna (grant #40974–2024.0015), and by the Project PE_00000019 “HEAL ITALIA”, funded by the Italian Ministry of University and Research under the National Recovery and Resilience Plan (PNRR), CUP F53C22000750006, University of Cagliari. Open access publishing facilitated by Università degli Studi di Sassari, as part of the Wiley—CRUI‐CARE agreement. Data Availability Statement The datasets generated during and/or analyzed during the current study are available from the corresponding author on reasonable request. References 1 G. Raghu An Official ATS/ERS/JRS/ALAT Statement: Idiopathic Pulmonary Fibrosis: Evidence‐Based Guidelines for Diagnosis and Management American Journal of Respiratory and Critical Care Medicine 183 2011 788 824 21471066 10.1164/rccm.2009-040GL PMC5450933 2 L. Wollin E. Wex A. Pautsch Mode of Action of Nintedanib in the Treatment of Idiopathic Pulmonary Fibrosis European Respiratory Journal 45 5 2015 1434 1445 25745043 10.1183/09031936.00174914 PMC4416110 3 S. M. Ruwanpura B. J. Thomas P. G. Bardin Pirfenidone: Molecular Mechanisms and Potential Clinical Applications in Lung Disease American Journal of Respiratory Cell and Molecular Biology 62 4 2020 413 422 31967851 10.1165/rcmb.2019-0328TR 4 X. Yang J. Wei Y. Yang CYP1A2 Polymorphism and Drug co‐Administration Affect the Blood Levels and Adverse Effects of Pirfenidone Therapeutic Drug Monitoring 46 6 2024 797 803 38723157 10.1097/FTD.0000000000001208 PMC11554246 5 A. Kubbara W. H. Amundson A. Herman A. M. Lee J. R. Bishop H. J. Kim Genetic Variations in Idiopathic Pulmonary Fibrosis and Patient Response to Pirfenidone Heliyon 9 8 2023 e18573 37560683 10.1016/j.heliyon.2023.e18573 PMC10407116 6 W. L. Fan M. S. Shiao R. C. Y. Hui HLA Association With Drug‐Induced Adverse Reactions Journal of Immunology Research 2017 2017 3186328 29333460 10.1155/2017/3186328 PMC5733150 7 Y. Fan Y. Q. Song PyHLA: Tests for the Association Between HLA Alleles and Diseases BMC Bioinformatics 18 1 2017 90 28166716 10.1186/s12859-017-1496-0 PMC5292802 8 N. Dand M. Duckworth D. Baudry HLA‐C*06:02 Genotype Is a Predictive Biomarker of Biologic Treatment Response in Psoriasis Journal of Allergy and Clinical Immunology 143 6 2019 2120 2130 30578879 10.1016/j.jaci.2018.11.038 9 M. Kato S. Sasaki T. Nakamura Gastrointestinal Adverse Effects of Nintedanib and the Associated Risk Factors in Patients With Idiopathic Pulmonary Fibrosis Scientific Reports 9 1 2019 12062 31427707 10.1038/s41598-019-48593-4 PMC6700168 10 H. Schmitt M. F. Neurath R. Atreya Role of the IL23/IL17 Pathway in Crohn's Disease Frontiers in Immunology 12 2021 622934 33859636 10.3389/fimmu.2021.622934 PMC8042267 11 T. Kongpan S. Mahasirimongkol P. Konyoung Candidate HLA Genes for Prediction of Co‐Trimoxazole‐Induced Severe Cutaneous Reactions Pharmacogenetics and Genomics 25 8 2015 402 411 26086150 10.1097/FPC.0000000000000153 12 W. Owczarek The Role of HLA‐Cw6 in Psoriasis and Psoriatic Arthritis Reumatologia/Rheumatology 60 5 2022 303 305 36381203 10.5114/reum.2022.120752 PMC9661405 13 K. Li C. C. Huang B. Randazzo HLA‐C*06:02 Allele and Response to IL‐12/23 Inhibition: Results From the Ustekinumab Phase 3 Psoriasis Program Journal of Investigative Dermatology 136 12 2016 2364 2371 27476722 10.1016/j.jid.2016.06.631 14 Y. Yang X. Wang J. Zhang Pirfenidone and Nintedanib Attenuate Pulmonary Fibrosis in Mice by Inhibiting the Expression of JAK2 Journal of Thoracic Disease 16 2 2024 1128 1140 38505034 10.21037/jtd-23-1057 PMC10944717 15 J. Y. Huh J. H. Lee J. W. Song Efficacy and Safety of Combined Use of Pirfenidone and Nintedanib in Patients With Idiopathic Pulmonary Fibrosis European Respiratory Journal 58 suppl 65 2021 PA468 https://publications.ersnet.org/content/erj/58/suppl_65/PA468 16 P. Contini G. Murdaca F. Puppo S. Negrini HLA‐G Expressing Immune Cells in Immune Mediated Diseases Frontiers in Immunology 11 2020 1613 10.3389/fimmu.2020.01613 32983083 PMC7484697 17 J. Robinson J. A. Halliwell H. McWilliam R. Lopez P. Parham S. G. E. Marsh The IMGT/HLA Database Nucleic Acids Research 41 2013 D1222 D1227 23080122 10.1093/nar/gks949 PMC3531221 18 K. Y. HoWangYin M. Loustau J. Wu Multimeric Structures of HLA‐G Isoforms Function Through Differential Binding to LILRB Receptors Cellular and Molecular Life Sciences 69 23 2012 4041 4049 22802125 10.1007/s00018-012-1069-3 PMC3884069 19 J. Di Cristofaro M. Reynaud‐Gaubert F. Carlini HLA‐G*01:04∼UTR3 Recipient Correlates With Lower Survival and Higher Frequency of Chronic Rejection After Lung Transplantation American Journal of Transplantation 15 9 2015 2413 2420 25989360 10.1111/ajt.13305 20 E. C. Castelli J. Ramalho I. O. P. Porto Insights Into HLA‐G Genetics Provided by Worldwide Haplotype Diversity Frontiers in Immunology 5 2014 476 10.3389/fimmu.2014.00476 25339953 PMC4186343 21 E. C. Castelli B. S. de Almeida Y. C. N. Muniz HLA‐G Genetic Diversity and Evolutive Aspects in Worldwide Populations Scientific Reports 11 1 2021 23070 34845256 10.1038/s41598-021-02106-4 PMC8629979 22 E. C. Castelli C. T. Mendes‐Junior N. H. S. Deghaide The Genetic Structure of 3′untranslated Region of the HLA‐G Gene: Polymorphisms and Haplotypes Genes and Immunity 11 2 2010 134 141 19798077 10.1038/gene.2009.74 23 I. O. P. Porto C. T. Mendes‐Junior L. P. Felício MicroRNAs Targeting the Immunomodulatory HLA‐G Gene: A New Survey Searching for microRNAs With Potential to Regulate HLA‐G Molecular Immunology 65 2 2015 230 241 25700346 10.1016/j.molimm.2015.01.030 24 S. M. Yie L. H. Li R. Xiao C. L. Librach A Single Base‐Pair Mutation in the 3′‐Untranslated Region of HLA‐G mRNA Is Associated With Pre‐Eclampsia Molecular Human Reproduction 14 11 2008 649 653 18952696 10.1093/molehr/gan059 ",
  "metadata": {
    "Title of this paper": "A Single Base‐Pair Mutation in the 3′‐Untranslated Region of HLA‐G mRNA Is Associated With Pre‐Eclampsia",
    "Journal it was published in:": "Clinical and Translational Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477543/"
  }
}