{
  "title": "Paper_962",
  "abstract": "pmc Korean J Community Nutr Korean J Community Nutr 4771 kjcn KJCN Korean Journal of Community Nutrition 2951-3146 Korean Society of Community Nutrition and the Korean Nutrition Society PMC12269001 PMC12269001.1 12269001 12269001 41030245 10.5720/kjcn.2024.29.3.212 kjcn-2024-29-3-212 1 Research Article Serum branch chain amino acids and aromatic amino acids ratio and metabolic risks in Koreans with normal-weight or obesity: a cross-sectional study http://orcid.org/0000-0002-6945-9552 Park Ji-Sook  1 http://orcid.org/0000-0002-5603-8935 Ahmed Kainat  2 http://orcid.org/0000-0001-8344-1386 Yim Jung-Eun  3  4  †  1 Korea  2 Korea  3 Korea  4 Korea † jeyim@changwon.ac.kr 6 2024 30 6 2024 29 3 493155 212 221 6 3 2024 18 4 2024 26 4 2024 01 06 2024 30 09 2025 01 10 2025 © 2024 The Korean Society of Community Nutrition 2024 https://creativecommons.org/licenses/by-nc/3.0/ This is an Open-Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( http://creativecommons.org/licenses/by-nc/3.0 Objectives Metabolic disease is strongly associated with future insulin resistance, and its prevalence is increasing worldwide. Thus, identifying early biomarkers of metabolic-related disease based on serum profiling is useful to control future metabolic disease. Our study aimed to assess the association of serum branched chain amino acids (BCAAs) and aromatic amino acids (AAAs) ratio and metabolic disease according to body mass index (BMI) status among Korean adults. Methods This cross-sectional study included 78 adults aged 20–59 years in Korea. We compared serum amino acid (AA) levels between adults with normal-weight and adults with obesity and investigated biomarkers of metabolic disease. We examined serum AA levels, blood profile, and body composition. We also evaluated the association between serum AAs and metabolic-related disease. Results The height, weight, BMI, waist circumference, hip circumference, waist-hip-ratio, body fat mass, body fat percent, skeletal muscle mass, systolic blood pressure, and diastolic blood pressure were higher in the group with obesity compared to normal weight group. The group with obesity showed significantly higher levels of BCAA, AAA, and BCAA and AAA ratio. Further, BCAA and AAA ratio were significantly positively correlated with triglyceride, body weight, and skeletal muscle mass. The evaluation of metabolic disease risks revealed an association between the ratios of BCAAs and AAAs, hypertension, and metabolic syndrome. Conclusions Our study is showed the associations between BCAA and AAA ratio, obesity, and obesity-related diseases using various analytical approaches. The elevated BCAA and AAA ratio could be early biomarkers for predicting future metabolic diseases in Korean population. branched chain amino acid aromatic amino acid obesity hypertension metabolic syndrome pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Metabolic diseases known as pathophysiological disorders that include diabetes mellitus (DM), hypertension, dyslipidemia, and metabolic syndrome often result in cardiovascular disease or stroke [ 1 2 3 Amino acids (AAs) are the structural units of proteins with important roles in gene expression, cell signaling, reproduction, metabolism, and oxidative stress [ 4 5 4 6 7 8 9 10 11 12 Previous studies reported the potential of serum free AAs for the diagnosis of type 2 diabetes mellitus (T2DM) [ 13 14 15 A prospective cohort study showed significant relationship of increased serum BCAA and AAA with a higher risk of developing insulin resistance [ 16 11 17 18 Therefore, this study aimed to assess the association of BCAA and AAA ratio and various metabolic disease according to BMI status among Korean adults. We hypothesize that there is a significant relationship of serum BCAA and AAA and these ratio with the BMI status, and that the relationship of AA with metabolic risks is more pronounced among individuals with obesity than among normal-weight individuals. METHODS Ethics statement The research was carried out in compliance with the ethical guidelines of the Declaration of Helsinki and was approved by the Institutional Review Boards of Changwon National University (approval No. 104027-201706-HR-008) and Changwon Fatima Hospital (approval No. 17-04). Informed consent was obtained from all participants. 1. Participants This study was conducted from April 2017 to July 2018 at Changwon, South Korea. The cross-sectional study included 78 participants who were recruited from Changwon National University and Changwon Fatima Hospital. The 78 participants were self-enrolled in this study; their age ranged between 20 and 59 years. Posters, blogs, and social media networks were among the offline and online mediums use to accomplish recruitment. Potential participants performed phone screening before eligibility was established during a screening visit. We excluded participants with a history of cardiac disease, renal disease, hepatic infections; those with thyroid function, or malignancies, consumptive disease; or pregnant and lactating patients. We included adults aged 20 to 59 years without any disease that met the exclusion criteria. 2. Anthropometric measurement Anthropometric measurements were obtained using bioelectrical impedance analysis (InBody 720 Body Composition Analyzer; Bio Space Co., Seoul, Korea). The participants were measured in the biped position, after a rest for approximately 3 minutes. The participants were wearing loose clothes without footwear prior to measurement. Height and weight were measured, and BMI was calculated. The participants’ arms were spread wide while they stood for the measurements of their waist and hip circumferences. All circumferences were obtained with a measuring tape. Anthropometric measurements were taken twice, and the average results were recorded with a precision of 2 decimal places. 3. Measurement of metabolic variables and serum AAs Blood samples were collected from the participants after an 8-hour fast. Blood samples were centrifuged for 15 minutes at 1,500 rpm to separate serum. Serum samples were stored at −80°C until analysis. Serum levels of triglyceride (TG), total cholesterol (To-C), low-density lipoprotein cholesterol (LDL-C), and high-density lipoprotein cholesterol (HDL-C) were measured enzymatically. Fasting glucose was measured with the hexokinase method, and insulin was determined using the chemiluminescence immunoassay. Serum glutamate oxaloacetate transaminase (GOT), glutamate pyruvate transaminase (GPT) levels were measured following the method of Reitman and Frankel using assay kit (Asan Corp., Seoul, Korea). Serum AAs were measured by high-performance liquid chromatography-mass spectrometry. Analysis was performed by using the AA analyzer (SYKAM Corp., Seoul, Korea). We targeted 3 BCAA (isoleucine, leucine, and valine) and 2 AAAs (phenylalanine, tyrosine), referred to the BCAA and AAA ratio literature [ 19 20 4. Clinical assessments In this study, metabolic syndrome was determined according to the following Korean diagnostic criteria: at least 3 of the following 5 components: (1) abdominal obesity (waist ≥ 90 cm in males and ≥ 80 cm in females); (2) HDL-C < 40 mg/dL in males and HDL-C < 50 mg/dL in females; (3) TG ≥ 150 mg/dL, or the use of medication for dyslipidemia; (4) fasting glucose ≥ 100 mg/dL or the use of medication for DM; and (5) blood pressure ≥ 130/85 mmHg or the use of antihypertensive medication [ 16 T2DM was diagnosed in patients with a fasting glucose level of 126 mg/dL or higher, a hemoglobin A1c level of 6.5% or higher or taking medication for DM [ 17 18 19 5. Statistical analysis The results are expressed as mean ± standard deviation for continuous data. IBM SPSS Statistics for Windows, version 25 (IBM Corporation, Armonk, NY, USA) was used for the analysis of the data. We compared the characteristics between anthropometrics and blood samples using χ2 tests for categorical variables and t-tests for continuous variables. Multiple linear regression analysis was used to evaluate correlations of serum AAs with each metabolic variable. Correlation covariance value (β) and adjusted coefficient determination (r 2 P RESULTS 1. Demographic and clinical characteristics The numbers of participants and their baseline characteristics are presented in Table 1 P P P P 2. Serum BCAA and AAA Serum AA concentrations for the study participants are presented in Table 2 P P 3. Correlation between BCAA and AAA ratio and metabolic variables We examined the association between metabolic variables and BCAA and AAA ratio measured in this study ( Table 3 4. ORs for evaluating metabolic disease according to BCAA and AAA ratio We examined the influence of BCAA and AAA ratio on the risk of metabolic syndrome, hypertension, and dyslipidemia in Table 4 P P P P DISCUSSION Over the past few decades, there has been a dramatic increase in the prevalence of metabolic diseases and obesity. Two of the major worldwide health problems are obesity and metabolic diseases [ 21 22 The participants were classified based on their BMI into 2 groups, as follows: normal weight group and group with obesity. The serum BCAA, AAA, as well as BCAA and AAA ratio in the group with obesity were significantly higher than those in the normal weight group. Consistently, in a prospective study of middle-aged Japanese workers, significant differences were noted in the associations between serum concentrations of isoleucine, valine, and tyrosine and insulin resistance, particularly between those with and without overweight/obesity. Only the individuals who were obese or overweight showed a significant association [ 23 14 Increased serum BCAA and AAA in obese individuals may be related to high-protein diets, altered protein turnover, or altered AA catabolism [ 24 4 25 7 24 26 We investigated the associations of BCAA and AAA ratios with other metabolite factors in the normal-weight and obesity group. The correlation analyses showed positive associations of BCAA and AAA ratio and body weight, TG, and skeletal muscle mass in multivariate linear regression analysis. Further, we evaluated the association of BCAA and AAA ratio with metabolic disease and found a high level of association, with an OR of 5.22 and 3.87 for BCAA and AAA ratio, in hypertension and metabolic syndrome, respectively. BCAA consist of about 40% of the free essential AAs in human blood. It has been proposed that the common large neutral amino acid transporter (LAT1) transports BCAA and AAA in competition for into mammalian cells [ 27 28 29 19 30 31 32 Although the precise mechanisms for the interaction between AA, obesity, and insulin resistance are unknown, it has been proposed that AA—in particular, BCAA—synergize with hyperlipidemia to accelerate the onset of insulin resistance [ 33 25 34 35 Limitations of this study include the following. First, the sample size of this study was small, the study design was cross-sectional, and it was conducted in the Korean population only, which therefore limits the application of our results. Second, we did not include serum insulin resistance results and data associated with the lifestyle factors such as exercise and dietary habit, which may have impacted the serum AA profiles. However, this study’s strength is that it examined the associations between BCAA and AAA ratio, obesity, and obesityrelated diseases using various analytical approaches. CONCLUSIONS Our study suggested the usefulness of BCAA and AAA ratio as biomarkers for evaluating the risks of metabolic diseases, including obesity, metabolic syndrome, and hypertension in the Korean population. Future studies would require larger sample size and cutoff value analysis to characterize changes in the serum levels of AA in patients with metabolic disease, as diagnostic biomarkers. Moreover, a clinical trial to evaluate lower BCAA and AAA ratio is important to determine whether this could be a new strategy in the treatment of metabolic diseases, including obesity.  Conflict of Interest There are no financial or other issues that might lead to conflict of interest.  Funding This research was supported by Changwon National University in 2023–2024.  Data Availability The data that support the findings of this study will be made available upon request to the corresponding author. REFERENCES 1 Tenenbaum A Motro M Schwammenthal E Fisman EZ Macrovascular complications of metabolic syndrome: an early intervention is imperative Int J Cardiol 2004 97 2 167 172 15458679 10.1016/j.ijcard.2003.07.033 2 Ma RC Chan JC Type 2 diabetes in East Asians: similarities and differences with populations in Europe and the United States Ann N Y Acad Sci 2013 1281 1 64 91 23551121 10.1111/nyas.12098 PMC3708105 3 Boenzi S Diodato D Biomarkers for mitochondrial energy metabolism diseases Essays Biochem 2018 62 3 443 454 29980631 10.1042/EBC20170111 4 Al-Abbasi FA The effect of glycemic status on the serum amino acid profile of diabetic Saudi patients J Drug Metab Toxicol 2013 4 4 157 5 Al-Abbasi FA Trend analysis of the correlation of amino acid plasma profile with glycemic status in Saudi diabetic patients J Adv Res 2012 3 4 305 313 6 Zhao X Han Q Liu Y Sun C Gang X Wang G The relationship between branched-chain amino acid related metabolomic signature and insulin resistance: a systematic review J Diabetes Res 2016 2016 2794591 27642608 10.1155/2016/2794591 PMC5014958 7 Yamada C Kondo M Kishimoto N Shibata T Nagai Y Imanishi T Association between insulin resistance and plasma amino acid profile in non-diabetic Japanese subjects J Diabetes Investig 2015 6 4 408 415 10.1111/jdi.12323 PMC4511300 26221519 8 Ishihara T Iwasa M Tanaka H Kaito M Ikoma J Shibata T Effect of branched-chain amino acids in patients receiving intervention for hepatocellular carcinoma World J Gastroenterol 2014 20 10 2673 2680 24627603 10.3748/wjg.v20.i10.2673 PMC3949276 9 Tsien C Davuluri G Singh D Allawy A Ten Have GA Thapaliya S Metabolic and molecular responses to leucine-enriched branched chain amino acid supplementation in the skeletal muscle of alcoholic cirrhosis Hepatology 2015 61 6 2018 2029 25613922 10.1002/hep.27717 PMC4441611 10 Yamaguchi N Mahbub MH Takahashi H Hase R Ishimaru Y Sunagawa H Plasma free amino acid profiles evaluate risk of metabolic syndrome, diabetes, dyslipidemia, and hypertension in a large Asian population Environ Health Prev Med 2017 22 1 35 29165132 10.1186/s12199-017-0642-7 PMC5664911 11 Stancáková A Civelek M Saleem NK Soininen P Kangas AJ Cederberg H Hyperglycemia and a common variant of GCKR are associated with the levels of eight amino acids in 9,369 Finnish men Diabetes 2012 61 7 1895 1902 22553379 10.2337/db11-1378 PMC3379649 12 Würtz P Mäkinen VP Soininen P Kangas AJ Tukiainen T Kettunen J Metabolic signatures of insulin resistance in 7,098 young adults Diabetes 2012 61 6 1372 1380 22511205 10.2337/db11-1355 PMC3357275 13 Badoud F Lam KP DiBattista A Perreault M Zulyniak MA Cattrysse B Serum and adipose tissue amino acid homeostasis in the metabolically healthy obese J Proteome Res 2014 13 7 3455 3466 24933025 10.1021/pr500416v 14 Kugimiya A Fukada R Chemiluminescence detection of serine, proline, glycine, asparagine, leucine, and histidine by using corresponding aminoacyl-tRNA synthetases as recognition elements Appl Biochem Biotechnol 2015 176 4 1195 1202 25935222 10.1007/s12010-015-1639-6 15 Würtz P Soininen P Kangas AJ Rönnemaa T Lehtimäki T Kähönen M Branched-chain and aromatic amino acids are predictors of insulin resistance in young adults Diabetes Care 2013 36 3 648 655 23129134 10.2337/dc12-0895 PMC3579331 16 Grundy SM Cleeman JI Daniels SR Donato KA Eckel RH Franklin BA Diagnosis and management of the metabolic syndrome: an American Heart Association/National Heart, Lung, and Blood Institute scientific statement Circulation 2005 112 17 2735 2752 16157765 10.1161/CIRCULATIONAHA.105.169404 17 Tillin T Hughes AD Wang Q Würtz P Ala-Korpela M Sattar N Diabetes risk and amino acid profiles: cross-sectional and prospective analyses of ethnicity, amino acids and diabetes in a South Asian and European cohort from the SABRE (Southall And Brent REvisited) Study Diabetologia 2015 58 5 968 979 25693751 10.1007/s00125-015-3517-8 PMC4392114 18 Poggiogalle E Fontana M Giusti AM Pinto A Iannucci G Lenzi A Amino acids and hypertension in adults Nutrients 2019 11 7 1459 31252583 10.3390/nu11071459 PMC6683075 19 Hiraiwa H Okumura T Kondo T Kato T Kazama S Ishihara T Usefulness of the plasma branchedchain amino acid/aromatic amino acid ratio for predicting future cardiac events in patients with heart failure J Cardiol 2020 75 6 689 696 32001073 10.1016/j.jjcc.2019.12.016 20 Holecek M Ammonia and amino acid profiles in liver cirrhosis: effects of variables leading to hepatic encephalopathy Nutrition 2015 31 1 14 20 25220875 10.1016/j.nut.2014.03.016 21 Chew NW Ng CH Tan DJ Kong G Lin C Chin YH The global burden of metabolic disease: data from 2000 to 2019 Cell Metab 2023 35 3 414 428.e3 36889281 10.1016/j.cmet.2023.02.003 22 Ministry of Health and Welfare (KR) Korea Disease Control and Prevention Agency (KDCA) Korea health statistics 2020: Korea National Health and Nutrition Examination Survey (KNHANES VIII-2) Seoul KDCA 2022 23 Chen S Miki T Fukunaga A Eguchi M Kochi T Nanri A Associations of serum amino acids with insulin resistance among people with and without overweight or obesity: a prospective study in Japan Clin Nutr 2022 41 8 1827 1833 35839544 10.1016/j.clnu.2022.06.039 24 Nagata C Nakamura K Wada K Tsuji M Tamai Y Kawachi T Branched-chain amino acid intake and the risk of diabetes in a Japanese community: the Takayama study Am J Epidemiol 2013 178 8 1226 1232 24008908 10.1093/aje/kwt112 25 Lynch CJ Adams SH Branched-chain amino acids in metabolic signalling and insulin resistance Nat Rev Endocrinol 2014 10 12 723 736 25287287 10.1038/nrendo.2014.171 PMC4424797 26 Stone KP Wanders D Orgeron M Cortez CC Gettys TW Mechanisms of increased in vivo insulin sensitivity by dietary methionine restriction in mice Diabetes 2014 63 11 3721 3733 24947368 10.2337/db14-0464 PMC4207389 27 Fernstrom JD Branched-chain amino acids and brain function J Nutr 2005 135 6 Suppl 1539S 1546S 15930466 10.1093/jn/135.6.1539S 28 Shah SH Crosslin DR Haynes CS Nelson S Turer CB Stevens RD Branched-chain amino acid levels are associated with improvement in insulin resistance with weight loss Diabetologia 2012 55 2 321 330 22065088 10.1007/s00125-011-2356-5 PMC3667157 29 Kinny-Köster B Bartels M Becker S Scholz M Thiery J Ceglarek U Plasma amino acid concentrations predict mortality in patients with end-stage liver disease PLoS One 2016 11 7 e0159205 27410482 10.1371/journal.pone.0159205 PMC4943589 30 Mahbub MH Yamaguchi N Hase R Takahashi H Ishimaru Y Watanabe R Plasma branched-chain and aromatic amino acids in relation to hypertension Nutrients 2020 12 12 3791 33322015 10.3390/nu12123791 PMC7764357 31 Wang M Ou Y Yuan XL Zhu XF Niu B Kang Z Heterogeneously elevated branched-chain/ aromatic amino acids among new-onset type-2 diabetes mellitus patients are potentially skewed diabetes predictors World J Diabetes 2024 15 1 53 71 38313852 10.4239/wjd.v15.i1.53 PMC10835491 32 Siomkajło M Rybka J Mierzchała-Pasierb M Gamian A Stankiewicz-Olczyk J Bolanowski M Specific plasma amino acid disturbances associated with metabolic syndrome Endocrine 2017 58 3 553 562 29075976 10.1007/s12020-017-1460-9 PMC5693976 33 Yoon MS The emerging role of branched-chain amino acids in insulin resistance and metabolism Nutrients 2016 8 7 405 27376324 10.3390/nu8070405 PMC4963881 34 Adams SH Emerging perspectives on essential amino acid metabolism in obesity and the insulinresistant state Adv Nutr 2011 2 6 445 456 22332087 10.3945/an.111.000737 PMC3226382 35 Newgard CB Interplay between lipids and branched-chain amino acids in development of insulin resistance Cell Metab 2012 15 5 606 614 22560213 10.1016/j.cmet.2012.01.024 PMC3695706 Table 1. Demographic and clinical characteristics of the participants Variables Total (n = 78) Normal weight group (n = 41) Obese group (n = 37) P Age (years) 39.36 ± 11.91 41.07 ± 12.56 37.46 ± 11.00 0.129 Sex Male 42 (100.0) 17 (40.5) 25 (66.7) 0.021 Female 36 (100.0) 24 (58.5) 12 (33.3) 5.333 1) Height (cm) 166.99 ± 7.89 165.44 ± 7.10 168.71 ± 8.46 0.026 Weight (kg) 71.12 ± 16.92 60.52 ± 9.93 82.87 ± 15.28 0.000 Body mass index (kg/m 2 25.36 ± 4.75 22.03 ± 2.35 29.06 ± 3.93 0.000 Waist circumference (cm) 84.86 ± 13.71 75.76 ± 9.80 94.95 ± 9.81 0.000 Hip circumference (cm) 97.34 ± 9.13 92.02 ± 6.52 103.24 ± 7.96 0.000 Waist-hip-ratio 0.87 ± 0.09 0.82 ± 0.10 0.92 ± 0.07 0.000 Body fat mass (kg) 20.91 ± 9.55 15.34 ± 4.03 27.08 ± 10.05 0.000 Body fat percent (%) 28.64 ± 7.45 25.47 ± 5.83 32.16 ± 7.55 0.000 Skeletal muscle mass (kg) 27.92 ± 6.43 24.90 ± 5.54 31.26 ± 5.71 0.000 Systolic blood pressure (mmHg) 123.50 ± 15.23 118.46 ± 14.94 128.81 ± 13.83 0.001 Diastolic blood pressure (mmHg) 76.61 ± 11.96 72.13 ± 12.10 81.32 ± 9.95 0.001 Glucose (mg/dL) 102.42 ± 32.19 99.01 ± 31.77 106.22 ± 32.67 0.289 Triglyceride (mg/dL) 128.71 ± 86.35 109.85 ± 99.22 149.61 ± 64.48 0.000 HDL-C (mg/dL) 36.74 ± 10.56 39.51 ± 10.44 33.67 ± 9.96 0.011 LDL-C (mg/dL) 75.95 ± 40.46 80.43 ± 46.35 70.61 ± 32.19 0.287 GPT (IU/L) 13.28 ± 15.97 10.50 ± 6.55 16.38 ± 21.91 0.017 GOT(IU/L) 19.35 ± 14.76 16.83 ± 14.01 22.16 ± 15.26 0.088 Abdominal obesity 32 (41.0) 5 (12.2) 27 (73.0) 0.000 (29.694) 1) Diabetes 36 (46.2) 18 (43.9) 18 (48.6) 0.675 (0.176) Hypertension 15 (19.7) 4 (10.3) 11 (29.7) 0.045 (4.545) Metabolic syndrome 30 (38.5) 7 (17.1) 23 (62.2) 0.000 (16.705) Dyslipidemia 54 (69.2) 23 (56.1) 31 (83.8) 0.013 (6.998) n (%) or Mean ± SD. HDL-C, high-density lipoprotein cholesterol; LDL-C, low-density lipoprotein cholesterol; GPT, glutamate pyruvate transaminase; GOT, glutamate oxaloacetate transaminase. 1) χ 2 Table 2. Serum amino acids according of the participant category Variables Total (n = 78) Normal weight group (n = 41) Obese group (n = 37) P BCAAs Isoleucine (mg/100 g) 0.95 ± 0.29 0.83 ± 0.26 1.08 ± 0.27 0.000 Leucine (mg/100 g) 1.88 ± 0.50 1.71 ± 0.46 2.06 ± 0.48 0.002 Valine (mg/100 g) 2.96 ± 0.71 2.71 ± 0.68 3.23 ± 0.63 0.002 AAAs Phenylalanine (mg/100 g) 1.05 ± 0.46 1.00 ± 0.59 1.09 ± 0.24 0.001 Tyrosine (mg/100 g) 1.34 ± 0.43 1.28 ± 0.48 1.40 ± 0.36 0.017 BCAA/AAA ratio 6.42 ± 1.29 5.97 ± 1.27 6.91 ± 1.12 0.000 Mean ± SD. BCAA, branched chain amino acid; AAA, aromatic amino acid. Table 3. Multiple linear regression analysis of BCAA/AAA ratio and variables Model Variables B Standard error P Regression coefficient (β) F ( P Normal weight group Constant 3.926 1.034 0.003 0.326 9.183 (0.001) Body weight 0.035 0.018 0.060 Triglyceride 0.004 0.002 0.016 Obese group Constant 4.080 1.076 0.001 0.310 9.095 (0.001) HDL-C −0.025 0.017 0.147 Skeletal muscle mass 0.119 0.029 0.000 BCAA, branched chain amino acid; AAA, aromatic amino acid; HDL-C, high-density lipoprotein cholesterol. Table 4. The ORs for evaluating metabolic disease according to BCAA/AAA ratio Metabolic disease Variables Tertile 1) OR (95% CI) P Hypertension BCAA/AAA ratio T1 1.00 0.123 T2 2.19 (0.38–12.71) 0.380 T3 5.22 (0.96–28.21) 0.055 Abdominal obesity 1.78 (0.53–5.18) 0.349 Dyslipidemia BCAA/AAA ratio T1 1.00 0.693 T2 1.66 (0.49–5.60) 0.411 T3 1.47 (0.40–5.35) 0.558 Obesity 3.62 (1.20–10.99) 0.023 Metabolic syndrome BCAA/AAA ratio T1 1.00 0.129 T2 2.02 (0.58–7.08) 0.269 T3 3.87 (1.04–14.36) 0.043 Body fat percentage 1.11 (1.02–1.20) 0.010 OR, odds ratio; CI, confidence interval; BCAA, branched chain amino acid; AAA, aromatic amino acid. 1) T1: < 5.90 mg/100 g; T2: 5.90 ≤ T2 ≤ 6.75 mg/100 g; T3: > 6.75 mg/100 g. ",
  "metadata": {
    "Title of this paper": "Interplay between lipids and branched-chain amino acids in development of insulin resistance",
    "Journal it was published in:": "Korean Journal of Community Nutrition",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12269001/"
  }
}