{
  "title": "Paper_442",
  "abstract": "pmc Clin Cancer Res Clin Cancer Res 4147 aacrsd Clinical Cancer Research 1078-0432 1557-3265 pmc-is-collection-domain yes pmc-collection-title AACR Open Access PMC12485369 PMC12485369.1 12485369 12485369 40522300 10.1158/1078-0432.CCR-25-1178 CCR-25-1178 1 Version of Record Biomarkers Genitourinary Cancers Prostate Cancer Precision Medicine Precision Medicine and Imaging Association of Homologous Recombination Repair Alterations with Outcomes in Patients with Metastatic Hormone-Sensitive Prostate Cancer Association of HRR Alterations with Outcomes in mHSPC https://orcid.org/0009-0008-6735-5777 Hage Chehade Chadi 1  # https://orcid.org/0000-0002-8065-4148 Graf Ryon P. 2  # https://orcid.org/0000-0002-4827-9042 Ozay Zeynep Irem 1 https://orcid.org/0009-0000-5807-5468 Gebrael Georges 1 https://orcid.org/0000-0003-1924-8148 Sayegh Nicolas 1 3 https://orcid.org/0000-0002-5617-6262 Li Gerald 2 https://orcid.org/0000-0002-0010-8551 Maughan Benjamin L. 1 https://orcid.org/0000-0003-0031-9655 Antonarakis Emmanuel S. 4 https://orcid.org/0000-0002-0581-7963 McKay Rana R. 5 https://orcid.org/0000-0003-1076-0428 Agarwal Neeraj 1 * https://orcid.org/0000-0003-3518-0411 Swami Umang 1 *  1  2  3  4  5 * Corresponding Authors: Neeraj.Agarwal@hci.utah.edu Umang.Swami@hci.utah.edu Clin Cancer Res 2025;31:4101–9 # C. Hage Chehade and R.P. Graf contributed equally to this article. 01 10 2025 16 6 2025 31 19 498054 4101 4109 31 3 2025 27 5 2025 12 6 2025 01 10 2025 02 10 2025 03 10 2025 ©2025 The Authors; Published by the American Association for Cancer Research 2025 American Association for Cancer Research https://creativecommons.org/licenses/by-nc-nd/4.0/ This open access article is distributed under the Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International (CC BY-NC-ND 4.0) license. Abstract Purpose: Homologous recombination/DNA damage repair (HRR) alterations (HRRalt) are found in around 30% of patients with advanced prostate cancer and have been associated with worse prognosis in the metastatic castrate-resistant setting. However, there are limited data with regard to their association with outcomes of patients with metastatic hormone-sensitive prostate cancer (mHSPC). Experimental Design: This study used a de-identified nationwide (U.S.-based) prostate cancer clinico-genomic database. Patients with de novo Results: Of 637 eligible patients included in our analysis, 181 harbored HRRalt (28.4%). Compared with patients with non-altered HRR, those with HRRalt had less favorable TTCR when treated with an ARPI [adjusted HR (aHR) = 1.58; 95% confidence interval (CI), 1.17–2.14] or a taxane (aHR = 1.77; 95% CI, 1.3–2.4). Additionally, OS was directionally less favorable in patients with HRRalt (ARPI: aHR = 1.12; 95% CI, 0.80–1.57 and taxane: aHR = 1.23; 95% CI, 0.88–1.72). Conclusions: To date, this is the largest real-world natural history study evaluating the association of HRRalt with outcomes in the mHSPC setting. These data may inform future clinical trial design and counseling of these patients.   See related commentary by Graham and Yu, p. 4001 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Translational Relevance The presence of homologous recombination/DNA damage repair (HRR) alterations has been associated with a poor prognosis in patients with metastatic castrate-resistant prostate cancer; however, limited data exist with regard to their correlation with outcomes of patients with metastatic hormone-sensitive prostate cancer (mHSPC). Currently, multiple clinical trials are assessing the addition of a PARP inhibitor to androgen deprivation therapy plus an androgen receptor pathway inhibitor in patients with mHSPC harboring these alterations. In this hypothesis-driven, real-world study, patients with mHSPC and HRR alterations had a less favorable time to castrate resistance and a directionally less favorable overall survival when treated with androgen deprivation therapy combined with an androgen receptor pathway inhibitor or a taxane compared with those with non-altered HRR. These findings may inform future clinical trial design and guide patient counseling. Introduction Homologous recombination is a major pathway that plays a key role in maintaining genomic stability ( 1 2 3 4 BRCA1 BRCA2 5 6 7 8 BRCA1/2 7 9 10 In recent work, Olmos and colleagues have shown that the presence of HRR alterations (HRRalt) in patients with metastatic castrate-resistant prostate cancer (mCRPC) was associated with worse survival outcomes on an androgen receptor pathway inhibitor (ARPI) or a taxane in the first-line setting ( 11 BRCA1/2 BRCA 11 BRCA1/2 12 13 BRCA1/2 14 16 17 18 7 9 19 BRCA1/2 The treatment landscape of patients with metastatic hormone-sensitive prostate cancer (mHSPC) has rapidly evolved with the approval of different combinatorial regimens of androgen deprivation therapy (ADT) plus ARPI with or without docetaxel ( 20 21 Materials and Methods Study design and patient selection This retrospective study was approved by the institutional review board at the University of Utah, and all research activities were conducted in compliance with applicable ethical standards, including the Declaration of Helsinki. For the study, informed consent was waived because of the use of retrospective data. The study fully complied with the US patient confidentiality regulations, including adherence to the Health Insurance Portability and Accountability Act of 1996. The study cohort comprised patients with a confirmed diagnosis of de novo The de-identified data were gathered from around 280 US cancer clinics, encompassing ∼800 care sites. Retrospective longitudinal clinical data were derived from electronic health records, including both structured and unstructured patient-level data. These were curated through technology-enabled abstraction of clinical notes and radiology/pathology reports and were then linked to CGP data using de-identified, deterministic matching ( 22 23 22 24 25 The patient inclusion criteria were as follows: a metastatic disease diagnosis within 30 days of the initial prostate cancer diagnosis to confirm de novo Fig. 1A B Figure 1. Schematic representation of the cohort selection. A, B, CGP The FoundationOne or FoundationOneCDx hybrid capture-based next-generation sequencing assays were conducted on tumor tissue biopsies (i.e., primary prostate or metastatic site) in a Clinical Laboratory Improvement Amendments–certified and College of American Pathologists–accredited laboratory (Foundation Medicine). The samples were analyzed for alterations as previously described ( 26 27 BRCA1 BRCA2 ATM BRIP1 BARD1 CDK12 CHEK1 CHEK2 FANCL PALB2 RAD51B RAD51C RAD51D RAD54L Statistical analysis and outcome measures A prespecified statistical analysis plan was developed according to the International Society for Pharmacoeconomics and Outcomes Research (ISPOR) guidelines ( 28 de novo Differences between cohorts in categorical and continuous variables were assessed using χ 2 29 30 Pre-therapy prognostic factors, including Eastern Cooperative Oncology Group performance status, Gleason score, PSA levels, age, alkaline phosphatase, albumin, and hemoglobin, associated with the risk of CRPC or OS were incorporated into multivariable models. The sum of the resulting coefficients was used to generate a risk score, which was applied as an adjustment factor in all Cox proportional hazards models, as previously described ( 31 32 Data availability The data supporting the findings of this study originated from Flatiron Health and Foundation Medicine, which have restrictions prohibiting the authors from making the dataset publicly available. Requests for data sharing by license or by permission for the specific purpose of replicating results in this article can be submitted to PublicationsDataaccess@flatiron.com cgdb-fmi@flatiron.com Results Patient population Of 5,524 patients who underwent CGP with available clinical-pathologic features and survival outcomes in the Flatiron Health-FMI CGDB, 637 had de novo n n Figure 1 n Baseline characteristics of both treatment cohorts (ADT plus ARPI and ADT plus taxane) are shown in Table 1 P P Table 1 Table 1. Clinical features and laboratory parameters of patients by treatment assignment. ​ ARPI ( N Taxane ( N Total ( N  P HRR status ​ ​ ​ 0.942 HRRalt 107 (28.3%) 74 (28.6%) 181 (28.4%) ​ Non-altered HRR 271 (71.7%) 185 (71.4%) 456 (71.6%) ​  BRCA1/2 ​ ​ ​ 0.989 Altered 41 (10.8%) 28 (10.8%) 69 (10.8%) ​ Not altered 337 (89.2%) 231 (89.2%) 568 (89.2%) ​  ATM ​ ​ ​ 0.428 Altered 18 (4.8%) 9 (3.5%) 27 (4.2%) ​ Not altered 360 (95.2%) 250 (96.5%) 610 (95.8%) ​  CDK12 ​ ​ ​ 0.973 Altered 28 (7.4%) 19 (7.3%) 47 (7.4%) ​ Not altered 350 (92.6%) 240 (92.7%) 590 (92.6%) ​  PALB2 ​ ​ ​ 0.377 Altered 2 (0.5%) 3 (1.2%) 5 (0.8%) ​ Not altered 376 (99.5%) 256 (98.8%) 632 (99.2%) ​ Year of treatment initiation ​ ​ ​ <0.001 2014 0 (0.0%) 9 (3.5%) 9 (1.4%) ​ 2015 0 (0.0%) 21 (8.1%) 21 (3.3%) ​ 2016 0 (0.0%) 26 (10.0%) 26 (4.1%) ​ 2017 11 (2.9%) 38 (14.7%) 49 (7.7%) ​ 2018 29 (7.7%) 35 (13.5%) 64 (10.0%) ​ 2019 65 (17.2%) 39 (15.1%) 104 (16.3%) ​ 2020 73 (19.3%) 39 (15.1%) 112 (17.6%) ​ 2021 83 (22.0%) 30 (11.6%) 113 (17.7%) ​ 2022 59 (15.6%) 16 (6.2%) 75 (11.8%) ​ 2023 51 (13.5%) 6 (2.3%) 57 (8.9%) ​ Age ​ ​ ​ <0.001 Median (Q1, Q3), years 70.0 (62.0, 77.0) 66.0 (58.0, 71.0) 68.0 (61.0, 75.0) ​ ECOG ​ ​ ​ 0.03 0 133 (47.8%) 130 (55.8%) 263 (51.5%) ​ 1 107 (38.5%) 89 (38.2%) 196 (38.4%) ​ 2 31 (11.2%) 12 (5.2%) 43 (8.4%) ​ 3 7 (2.5%) 2 (0.9%) 9 (1.8%) ​ Missing observations 100 26 126 ​ Gleason ​ ​ ​ 0.519 6 or less 2 (0.5%) 0 (0.0%) 2 (0.3%) ​ 7–8 75 (19.8%) 48 (18.5%) 123 (19.3%) ​ 9–10 208 (55.0%) 153 (59.1%) 361 (56.7%) ​ Unknown/not documented 93 (24.6%) 58 (22.4%) 151 (23.7%) ​ PSA at metastatic diagnosis (μg/L) ​ ​ ​ 0.128 Median (Q1, Q3) 113.0 (28.0, 446.0) 158.9 (40.3, 617.0) 133.7 (33.6, 525.5) ​ Missing observations 37 10 47 ​ Alkaline phosphatase ​ ​ ​ 0.061 Above ULN 177 (55.0%) 149 (62.9%) 326 (58.3%) ​ Normal 145 (45.0%) 88 (37.1%) 233 (41.7%) ​ Missing observations 56 22 78 ​ Albumin ​ ​ ​ 0.046 Below LLN 30 (9.2%) 12 (4.8%) 42 (7.3%) ​ Normal 297 (90.8%) 237 (95.2%) 534 (92.7%) ​ Missing observations 51 10 61 ​ Hemoglobin ​ ​ ​ 0.181 Below LLN 169 (50.6%) 141 (56.2%) 310 (53.0%) ​ Normal 165 (49.4%) 110 (43.8%) 275 (47.0%) ​ Missing observations 44 8 52 ​ Practice type ​ ​ ​ 0.294 Academic 75 (19.9%) 43 (16.6%) 118 (18.6%) ​ Community 302 (80.1%) 216 (83.4%) 518 (81.4%) ​ Missing observations 1 0 1 ​ Treatment received in mHSPC ​ ​ ​ <0.001 Abiraterone 205 (54.2%) 0 (0.0%) 205 (32.2%) ​ Apalutamide 39 (10.3%) 0 (0.0%) 39 (6.1%) ​ Apalutamide and enzalutamide 1 (0.3%) 0 (0.0%) 1 (0.2%) ​ Cabazitaxel 0 (0.0%) 1 (0.4%) 1 (0.2%) ​ Darolutamide 16 (4.2%) 0 (0.0%) 16 (2.5%) ​ Docetaxel 0 (0.0%) 257 (99.2%) 257 (40.3%) ​ Enzalutamide 117 (31.0%) 0 (0.0%) 117 (18.4%) ​ Paclitaxel 0 (0.0%) 1 (0.4%) 1 (0.2%) ​ Tissue sequencing site ​ ​ ​ 0.044 Bladder 6 (1.6%) 7 (2.7%) 13 (2.0%) ​ Bone 52 (13.8%) 21 (8.1%) 73 (11.5%) ​ Liver 4 (1.1%) 7 (2.7%) 11 (1.7%) ​ Lymph node 37 (9.8%) 34 (13.1%) 71 (11.1%) ​ Other 21 (5.6%) 22 (8.5%) 43 (6.8%) ​ Prostate 258 (68.3%) 168 (64.9%) 426 (66.9%) ​ Development of CRPC ​ ​ ​ <0.001 No 195 (51.6%) 55 (21.2%) 250 (39.2%) ​ Yes 183 (48.4%) 204 (78.8%) 387 (60.8%) ​ Death events ​ ​ ​ <0.001 Alive 220 (58.2%) 98 (37.8%) 318 (49.9%) ​ Deceased 158 (41.8%) 161 (62.2%) 319 (50.1%) ​ Subsequent platinum ​ ​ ​ 0.014 No 357 (94.4%) 231 (89.2%) 588 (92.3%) ​ Yes 21 (5.6%) 28 (10.8%) 49 (7.7%) ​ Subsequent PARPi ​ ​ ​ 0.171 No 354 (93.7%) 235 (90.7%) 589 (92.5%) ​ Yes 24 (6.3%) 24 (9.3%) 48 (7.5%) ​ Abbreviations: ECOG, Eastern Cooperative Oncology Group; LLN, lower limit of normal; PARPi, PARP inhibitor; ULN, upper limit of normal. Homologous recombination/DNA damage repair gene alterations detected and association with other genomic alterations The most frequent HRR gene alterations in the ADT plus ARPI group were BRCA1/2 CDK12 ATM Patients with HRRalts ( n PTEN P TP53 P n RB1 P Outcomes by genomic biomarker status in the overall cohort Compared with patients with non-altered HRR, those harboring HRRalts had significantly shorter TTCR in both ADT plus ARPI [median 17.2 vs. 33.4 months, adjusted HR (aHR) = 1.58; 95% confidence interval (CI), 1.17–2.14] and ADT plus taxane (median 11.8 vs. 18.3 months, aHR = 1.77; 95% CI, 1.3–2.4) cohorts ( Fig. 2 Figure 2. Outcomes on ARPI or taxane by HRRalt status. Outcomes for HRRalts versus no HRRalts are shown on ADT + ARPI for ( A C B D When dissecting outcomes by the type of HRR gene alteration, patients with BRCA1/2 BRCA1/2 CDK12 CDK12 Figure 3A B BRCA1/2 ATM CDK12 Figure 3. Forest plots showing the risk-adjusted outcomes for patients by genomic biomarkers by drug class for ( A B C D Outcomes by genomic biomarker status in the HRR-deficient cohort When dissecting outcomes by the type of HRR gene alteration among the subset of patients with HRRalts, patients harboring CDK12 CDK12 BRCA1/2 ATM BRCA1/2 ATM Figure 3C D BRCA1/2 ATM CDK12 Discussion This study is the largest to evaluate the natural history of patients with mHSPC receiving intensified ADT and harboring HRRalts compared with those with proficient HRR status. Our findings also suggest a negative prognostic role of CDK12 Multiple studies have previously evaluated the role of alterations in the HRR pathway, particularly in BRCA1/2 13 33 BRCA1/2 34 BRCA2 35 de novo BRCA2 35 BRCA1/2 11 BRCA2 36 37 n 38 The role of HRRalts has acquired growing importance in recent years following the approval of PARP inhibitors, which can target this pathway. These novel agents have improved the survival outcomes of patients harboring these alterations. For instance, in cohort 1 of the TALAPRO-2 trial that assessed the combination of talazoparib plus enzalutamide in the first-line mCRPC setting, this regimen significantly reduced the risk of death by 20% in an all-comer patient population compared with enzalutamide alone and by 45% in patients with HRRalts ( 39 n 40 BRCA2 41 NCT04821622 42 NCT04497844 NCT06120491 Another pertinent finding in our study is the association of CDK12 43 44 CDK12 45 11 45 46 CDK12 43 45 47 CDK12 BRCA2 CDK12 BRCA2 CDK12 CDK12 48 CDK12 NCT04104893 NCT04751929 CDK12 The limitations of our study include its nonrandomized retrospective design, a limited follow-up duration (58.2% and 37.8% of patients in the ADT plus ARPI and ADT plus taxane cohorts were alive at the time of the analysis, respectively), and potential unknown imbalances, such as the development of neuroendocrine differentiation, or prognostic factors such as the presence of visceral metastases, which we could not adjust for. Despite these caveats, our study is the largest to date to show a significant association between HRRalts and less favorable outcomes in patients with mHSPC receiving intensified ADT. These findings are crucial in light of ongoing clinical trials designed to target the HRR pathway with PARP inhibitors in the hormone-sensitive setting. Our data also support additional validity of genomic profiling in the management of patients with advanced prostate cancer. Supplementary Material Supplementary Figure S1 Outcomes on ARPI or taxane by BRCAalt status. Outcomes for BRCAalt vs. no BRCAalt are shown on ADT + ARPI for (A) TTCR and (C) OS. Outcomes for BRCAalt vs. no BRCAalt are shown on ADT + taxane for (B) TTCR and (D) OS. Abbreviations: aHR, adjusted hazard ratio; alt, alteration; ARPI, androgen receptor pathway inhibitor; CI, confidence interval; CRPC, castrate-resistant prostate cancer; doce, docetaxel; TTCR, time to castrate-resistance; OS, overall survival. Supplementary Figure S2 Outcomes on ARPI or taxane by ATMalt status. Outcomes for ATMalt vs. no ATMalt are shown on ADT + ARPI for (A) TTCR and (C) OS. Outcomes for ATMalt vs. no ATMalt are shown on ADT + taxane for (B) TTCR and (D) OS. Abbreviations: aHR, adjusted hazard ratio; alt, alteration; ARPI, androgen receptor pathway inhibitor; CI, confidence interval; CRPC, castrate-resistant prostate cancer; doce, docetaxel; TTCR, time to castrate-resistance; OS, overall survival. Supplementary Figure S3 Outcomes on ARPI or taxane by CDK12alt status. Outcomes for CDK12alt vs. no CDK12alt are shown on ADT + ARPI for (A) TTCRPC and (C) OS. Outcomes for CDK12alt vs. no CDK12alt are shown on ADT + taxane for (B) TTCR and (D) OS. Abbreviations: aHR, adjusted hazard ratio; alt, alteration; ARPI, androgen receptor pathway inhibitor; CI, confidence interval; CRPC, castrate-resistant prostate cancer; doce, docetaxel; TTCR, time to castrate-resistance; OS, overall survival.  Note: http://clincancerres.aacrjournals.org/ Authors’ Disclosures R.P. Graf reports other support from Foundation Medicine, Inc during the conduct of the study as well as other support from Roche outside the submitted work; in addition, R.P. Graf is an employee of Foundation Medicine, a wholly owned subsidiary of Roche, and has equity ownership of Roche stock. G. Li reports personal fees from Foundation Medicine and other support from Roche outside the submitted work; in addition, G. Li is an employee of Foundation Medicine, a wholly owned subsidiary of Roche, and has equity ownership of Roche stock. B.L. Maughan reports personal fees from AbbVie, Astellas, AVEO, Bayer Oncology, DAVA Oncology, Eisai, Janssen, Eli Lilly and Company, Peloton Therapeutics, Pfizer, Sanofi, Tempus, Telix, Xencor, and Bavarian Nordic; grants and personal fees from Bristol Myers Squibb, Clovis, Exelixis, and Merck; and grants from Genetech during the conduct of the study. E.S. Antonarakis reports grants and personal fees from Janssen, Sanofi, Bayer, Bristol Myers Squibb, Curium, MacroGenics, Merck, Pfizer, AstraZeneca, and Clovis Oncology; personal fees from Aadi Bioscience, Aikido Pharma, Astellas, Amgen, Blue Earth, Corcept Therapeutics, Boundless Bio, Hookipa Pharma, Invitae, Eli Lilly and Company, Foundation Medicine, Menarini-Silicon, Tango Therapeutics, Tempus, Z-alpha, and Exact Sciences; and grants from Celgene, Orion, and Novartis outside the submitted work. In addition, E.S. Antonarakis reports a patent for an AR-V7 biomarker technology issued and licensed to Qiagen. R.R. McKay reports other support (consulting or advisory role) from Pfizer, Janssen, Novartis, Tempus, Pfizer, Astellas Medivation, Dendreon, Bayer, Sanofi, Vividion, Calithera, Caris Life Sciences, Sorrento Therapeutics, AVEO, Seattle Genetics, Telix, Eli Lilly and Company, Blue Earth Diagnostics, Ambrx, Sumitomo Pharma Oncology, Eisai, NeoMorph, Arcus Biosciences, Daiichi Sankyo, Exelixis, Bristol Myers Squibb, Merck, AstraZeneca, and Myovant. N. Agarwal reports other support (research funding to the institution) from Arnivas, Astellas, AstraZeneca, Bavarian Nordic, Bayer, Bristol Myers Squibb, Calithera, Celldex, Clovis, CRISPR Therapeutics, Eisai, Eli Lilly and Company, EMD Serono, Exelixis, Genentech, Gilead Sciences, GlaxoSmithKline, Immunomedics, Janssen, Lava, Medivation, Merck, Nektar, Neoleukin, New Link Genetics, Novartis, Oric, Pfizer, Prometheus, Rexahn, Roche, Sanofi, Seattle Genetics, Takeda, and Tracon. U. Swami reports personal fees from Astellas, Exelixis, Seattle Genetics, Imvax, Sanofi, AstraZeneca, Gilead Sciences, Pfizer, Adaptimmune, Janssen, and Flatiron Health and other support from Janssen, Exelixis, and Astellas/Seattle Genetics outside the submitted work. No disclosures were reported by the other authors. Disclaimer Foundation Medicine, a wholly owned subsidiary of Roche, is a for-profit company and producer of FDA-regulated molecular diagnostics. Authors employed by Foundation Medicine were involved in the design and conduct of the study, analysis, interpretation of the data, preparation, review, and approval of the article. Authors’ Contributions  C. Hage Chehade: R.P. Graf: Z.I. Ozay: G. Gebrael: N. Sayegh: G. Li: B.L. Maughan: E.S. Antonarakis: R.R. McKay: N. Agarwal: U. Swami: References 1. Thompson LH Schild D Homologous recombinational repair of DNA ensures mammalian chromosome stability Mutat Res 2001 477 131 53 11376695 10.1016/s0027-5107(01)00115-4 2. Scully R Panday A Elango R Willis NA DNA double-strand break repair-pathway choice in somatic mammalian cells Nat Rev Mol Cell Biol 2019 20 698 714 31263220 10.1038/s41580-019-0152-0 PMC7315405 3. Jasin M Rothstein R Repair of strand breaks by homologous recombination Cold Spring Harb Perspect Biol 2013 5 a012740 24097900 10.1101/cshperspect.a012740 PMC3809576 4. Mateo J Lord CJ Serra V Tutt A Balmaña J Castroviejo-Bermejo M A decade of clinical development of PARP inhibitors in perspective Ann Oncol 2019 30 1437 47 31218365 10.1093/annonc/mdz192 PMC6771225 5. Gorodetska I Kozeretska I Dubrovska A BRCA genes: the role in genome stability, cancer stemness and therapy resistance J Cancer 2019 10 2109 27 31205572 10.7150/jca.30410 PMC6548160 6. Siegel RL Kratzer TB Giaquinto AN Sung H Jemal A Cancer statistics, 2025 CA Cancer J Clin 2025 75 10 45 39817679 10.3322/caac.21871 PMC11745215 7. Clarke NW Armstrong AJ Thiery-Vuillemin A Oya M Shore N Loredo E Abiraterone and olaparib for metastatic castration-resistant prostate cancer NEJM Evid 2022 1 EVIDoa2200043 38319800 10.1056/EVIDoa2200043 8. Chung JH Dewal N Sokol E Mathew P Whitehead R Millis SZ Prospective comprehensive genomic profiling of primary and metastatic prostate tumors JCO Precis Oncol 2019 3 PO.18.00283 31218271 10.1200/PO.18.00283 PMC6583915 9. Agarwal N Azad AA Carles J Fay AP Matsubara N Heinrich D Talazoparib plus enzalutamide in men with first-line metastatic castration-resistant prostate cancer (TALAPRO-2): a randomised, placebo-controlled, phase 3 trial Lancet 2023 402 291 303 37285865 10.1016/S0140-6736(23)01055-3 10. Pritchard CC Mateo J Walsh MF De Sarkar N Abida W Beltran H Inherited DNA-repair gene mutations in men with metastatic prostate cancer N Engl J Med 2016 375 443 53 27433846 10.1056/NEJMoa1603144 PMC4986616 11. Olmos D Lorente D Alameda D Cattrini C Romero-Laorden N Lozano R Treatment patterns and outcomes in metastatic castration-resistant prostate cancer patients with and without somatic or germline alterations in homologous recombination repair genes Ann Oncol 2024 35 458 72 38417742 10.1016/j.annonc.2024.01.011 12. Fettke H Dai C Kwan EM Zheng T Du P Ng N BRCA-deficient metastatic prostate cancer has an adverse prognosis and distinct genomic phenotype EBioMedicine 2023 95 104738 37549632 10.1016/j.ebiom.2023.104738 PMC10412463 13. Annala M Struss WJ Warner EW Beja K Vandekerkhove G Wong A Treatment outcomes and tumor loss of heterozygosity in germline DNA repair–deficient prostate cancer Eur Urol 2017 72 34 42 28259476 10.1016/j.eururo.2017.02.023 14. Lord CJ Ashworth A PARP inhibitors: synthetic lethality in the clinic Science 2017 355 1152 8 28302823 10.1126/science.aam7344 PMC6175050 15. Bryant HE Schultz N Thomas HD Parker KM Flower D Lopez E Specific killing of BRCA2-deficient tumours with inhibitors of poly(ADP-ribose) polymerase Nature 2005 434 913 7 15829966 10.1038/nature03443 16. Al-Akhras A Hage Chehade C Narang A Swami U PARP inhibitors in metastatic castration-resistant prostate cancer: unraveling the therapeutic landscape Life (Basel) 2024 14 198 38398706 10.3390/life14020198 PMC10890352 17. Hussain M Mateo J Fizazi K Saad F Shore N Sandhu S Survival with olaparib in metastatic castration-resistant prostate cancer N Engl J Med 2020 383 2345 57 32955174 10.1056/NEJMoa2022485 18. Fizazi K Piulats JM Reaume MN Ostler P McDermott R Gingerich JR Rucaparib or physician’s choice in metastatic prostate cancer N Engl J Med 2023 388 719 32 36795891 10.1056/NEJMoa2214676 PMC10064172 19. Chi KN Rathkopf D Smith MR Efstathiou E Attard G Olmos D Niraparib and abiraterone acetate for metastatic castration-resistant prostate cancer J Clin Oncol 2023 41 3339 51 36952634 10.1200/JCO.22.01649 PMC10431499 20. Gebrael G Fortuna GG Sayegh N Swami U Agarwal N Advances in the treatment of metastatic prostate cancer Trends Cancer 2023 9 840 54 37442702 10.1016/j.trecan.2023.06.009 21. Kohli M Tan W Zheng T Wang A Montesinos C Wong C Clinical and genomic insights into circulating tumor DNA-based alterations across the spectrum of metastatic hormone-sensitive and castrate-resistant prostate cancer EBioMedicine 2020 Apr 54 102728 32268276 10.1016/j.ebiom.2020.102728 PMC7186589 22. Singal G Miller PG Agarwala V Li G Kaushik G Backenroth D Association of patient characteristics and tumor genomics with clinical outcomes among patients with non–small cell lung cancer using a clinicogenomic database JAMA 2019 321 1391 9 30964529 10.1001/jama.2019.3241 PMC6459115 23. Zhang Q Gossai A Monroe S Nussbaum NC Parrinello CM Validation analysis of a composite real-world mortality endpoint for patients with cancer in the United States Health Serv Res 2021 56 1281 7 33998685 10.1111/1475-6773.13669 PMC8586476 24. Graf RP Fisher V Huang RSP Hamdani O Gjoerup OV Stanke J Tumor mutational burden as a predictor of first-line immune checkpoint inhibitor versus carboplatin benefit in cisplatin-unfit patients with urothelial carcinoma JCO Precis Oncol 2022 6 e2200121 35977348 10.1200/PO.22.00121 25. Graf RP Fisher V Mateo J Gjoerup OV Madison RW Raskina K Predictive genomic biomarkers of hormonal therapy versus chemotherapy benefit in metastatic castration-resistant prostate cancer Eur Urol 2022 Jan 1 81 37 47 34716049 10.1016/j.eururo.2021.09.030 26. Frampton GM Fichtenholtz A Otto GA Wang K Downing SR He J Development and validation of a clinical cancer genomic profiling test based on massively parallel DNA sequencing Nat Biotechnol 2013 31 1023 31 24142049 10.1038/nbt.2696 PMC5710001 27. FDA approves olaparib for HRR gene-mutated metastatic castration-resistant prostate cancer FDA [Internet] 2021 [cited 2024 Apr 2]. Available from: https://www.fda.gov/drugs/resources-information-approved-drugs/fda-approves-olaparib-hrr-gene-mutated-metastatic-castration-resistant-prostate-cancer 28. Berger ML Mamdani M Atkins D Johnson ML Good research practices for comparative effectiveness research: defining, reporting and interpreting nonrandomized studies of treatment effects using secondary data sources: the ISPOR Good Research Practices for Retrospective Database Analysis Task Force Report--Part I Value Health 2009 12 1044 52 19793072 10.1111/j.1524-4733.2009.00600.x 29. McGough SF Incerti D Lyalina S Copping R Narasimhan B Tibshirani R Penalized regression for left-truncated and right-censored survival data Stat Med 2021 40 5487 500 34302373 10.1002/sim.9136 PMC9290657 30. Brown S Lavery JA Shen R Martin AS Kehl KL Sweeney SM Implications of selection bias due to delayed study entry in clinical genomic studies JAMA Oncol 2022 8 287 91 34734967 10.1001/jamaoncol.2021.5153 PMC9190030 31. Arbogast PG Ray WA Performance of disease risk scores, propensity scores, and traditional multivariable outcome regression in the presence of multiple confounders Am J Epidemiol 2011 174 613 20 21749976 10.1093/aje/kwr143 32. Graf RP Hullings M Barnett ES Carbone E Dittamore R Scher HI Clinical utility of the nuclear-localized AR-V7 biomarker in circulating tumor cells in improving physician treatment choice in castration-resistant prostate cancer Eur Urol 2020 77 170 7 31648903 10.1016/j.eururo.2019.08.020 PMC7472426 33. Castro E Romero-Laorden N Del Pozo A Lozano R Medina A Puente J PROREPAIR-B: a prospective cohort study of the impact of germline DNA repair mutations on the outcomes of patients with metastatic castration-resistant prostate cancer J Clin Oncol 2019 Feb 20 37 490 503 30625039 10.1200/JCO.18.00358 34. Castro E Goh C Olmos D Saunders E Leongamornlert D Tymrakiewicz M Germline BRCA mutations are associated with higher risk of nodal involvement, distant metastasis, and poor survival outcomes in prostate cancer J Clin Oncol 2013 31 1748 57 23569316 10.1200/JCO.2012.43.1882 PMC3641696 35. Stopsack KH Vijai J Conry M Berchuck JE Kemel Y Vasselman SE Germline DNA damage repair variants and prognosis of patients with high-risk or metastatic prostate cancer Clin Cancer Res 2024 31 122 9 10.1158/1078-0432.CCR-24-2483 PMC12407385 39450704 36. Gebrael G Sayegh N Hage Chehade C Jo Y Narang A Chigarira B Genomic biomarkers of survival in patients with metastatic hormone-sensitive prostate cancer undergoing intensified androgen deprivation therapy Prostate Cancer Prostatic Dis 2025 Jan 31 Epub ahead of print 10.1038/s41391-025-00936-1 39885371 37. Lee AM Saidian A Shaya J Nonato T Cabal A Randall JM The prognostic significance of homologous recombination repair pathway alterations in metastatic hormone sensitive prostate cancer Clin Genitourin Cancer 2022 20 515 23 35871039 10.1016/j.clgc.2022.06.016 PMC10257153 38. Hage Chehade C Jo Y Gebrael G Tripathi N Sayegh N Chigarira B Trends and disparities in next-generation sequencing in metastatic prostate and urothelial cancers JAMA Netw Open 2024 7 e2423186 39023888 10.1001/jamanetworkopen.2024.23186 PMC11258596 39. Agarwal N Azad A Carles J Fay AP Matsubara N Szczylik C Final overall survival (OS) with talazoparib (TALA) + enzalutamide (ENZA) as first-line treatment in unselected patients with metastatic castration-resistant prostate cancer (mCRPC) in the phase 3 TALAPRO-2 trial J Clin Oncol 2025 43 suppl LBA18 40. Marshall CH Teply BA Lu J Oliveira L Wang H Mao SS Olaparib without androgen deprivation for high-risk biochemically recurrent prostate cancer following prostatectomy: a nonrandomized controlled trial JAMA Oncol 2024 22 e243074 10.1001/jamaoncol.2024.3074 PMC11342218 39172479 41. Hage Chehade C Gebrael G Sayegh N Ozay ZI Narang A Crispino T A pan-tumor review of the role of poly(adenosine diphosphate ribose) polymerase inhibitors CA Cancer J Clin 2025 75 141 67 39791278 10.3322/caac.21870 PMC11929130 42. Agarwal N Saad F Azad AA Mateo J Matsubara N Shore ND TALAPRO-3 clinical trial protocol: phase III study of talazoparib plus enzalutamide in metastatic castration-sensitive prostate cancer Future Oncol 2024 20 493 505 37882449 10.2217/fon-2023-0526 43. Wu YM Cieślik M Lonigro RJ Vats P Reimers MA Cao X Inactivation of CDK12 delineates a distinct immunogenic class of advanced prostate cancer Cell 2018 173 1770 82.e14 29906450 10.1016/j.cell.2018.04.034 PMC6084431 44. Abida W Armenia J Gopalan A Brennan R Walsh M Barron D Prospective genomic profiling of prostate cancer across disease states reveals germline and somatic alterations that may affect clinical decision making JCO Precis Oncol 2017 2017 PO.17.00029 28825054 10.1200/PO.17.00029 PMC5558263 45. Antonarakis ES Isaacsson Velho P Fu W Wang H Agarwal N Sacristan Santos V CDK12-Altered prostate cancer: clinical features and therapeutic outcomes to standard systemic therapies, poly (ADP-Ribose) polymerase inhibitors, and PD-1 inhibitors JCO Precis Oncol 2020 4 370 81 32462107 10.1200/PO.19.00399 PMC7252221 46. Hage Chehade C Gebrael G Srivastava A Tripathi N Sayegh N Mathew Thomas V Disease characteristics, survival outcomes, and tumor molecular landscape in patients (pts) with metastatic hormone-sensitive prostate cancer (mHSPC) harboring CDK12 alterations (CDK12a) receiving intensified androgen deprivation therapy (ADTi) J Clin Oncol 2024 42 suppl 189 47. van Wilpe S Kloots ISH Slootbeek PHJ Brok M den Westdorp H Franken MD Ipilimumab with Nivolumab in molecular-Selected patients with castration-resistant PRostate cancer: primary analysis of the phase 2 INSPIRE trial Ann Oncol 2024 35 1126 37 39293514 10.1016/j.annonc.2024.09.004 48. Nguyen CB Reimers MA Perera C Abida W Chou J Feng FY Evaluating immune checkpoint blockade in metastatic castration-resistant prostate cancers with deleterious CDK12 alterations in the phase 2 IMPACT trial Clin Cancer Res 2024 30 3200 10 38787530 10.1158/1078-0432.CCR-24-0400 PMC11293970 ",
  "metadata": {
    "Title of this paper": "Evaluating immune checkpoint blockade in metastatic castration-resistant prostate cancers with deleterious CDK12 alterations in the phase 2 IMPACT trial",
    "Journal it was published in:": "Clinical Cancer Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485369/"
  }
}