{
  "title": "Paper_896",
  "abstract": "pmc Cell Rep Cell Rep 319 nihpa Cell reports 2211-1247 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12477701 PMC12477701.1 12477701 12477701 NIHMS2107284 40802510 10.1016/j.celrep.2025.116140 NIHMS2107284 NIHPA2107284 1 Article Targeting CDK2 for cancer therapy Knudsen Erik S. 1 5 * Witkiewicz Agnieszka K. 1 2 5 * Sanidas Ioannis 3 5 * Rubin Seth M. 4 5 * 1 2 3 4 5 AUTHOR CONTRIBUTIONS All of the authors on this manuscript are independent investigators and serve as corresponding authors. The manuscript was jointly written by all authors with equivalent intellectual participation and drafting of the document and figures. * erik.knudsen@roswellpark.org agnieszka.witkiewicz@roswellpark.org isanidas@mgh.harvard.edu srubin@ucsc.edu 26 8 2025 12 8 2025 44 8 497744 116140 116140 13 09 2025 29 09 2025 30 09 2025 30 09 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article under the CC BY-NC license ( https://creativecommons.org/licenses/by-nc/4.0/ SUMMARY Targeting cell-cycle regulatory processes by inhibiting cyclin-dependent kinases (CDKs) has long been considered a significant therapeutic strategy for oncology. Recent studies have highlighted the complexity of targeting CDK2 for cancer therapy. Unlike CDK4/6 inhibitors, CDK2 inhibitors can impact different phases of the cell cycle by modulating distinct effector pathways, and the response to CDK2 inhibitors is controlled by the genetic and epigenetic makeup of the tumor. Biomarkers have emerged that can inform the effective use of these drugs and include cyclin E and p16INK4A. Work across several different tumor types indicates that CDK2 inhibitors can be combined effectively with various drug classes. However, more investigation is needed to understand the potential limitations and drug toxicities of existing CDK2 inhibitors and those in development. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION TO CDK-CYCLINS AND CDK INHIBITORS The drivers of eukaryotic cell division have been known for over 25 years to encompass specialized cyclin-dependent kinases (CDKs) that act with their cognate cyclins to drive cell-cycle transitions. Initially defined in model organisms, CDK-cyclins are critical for the division of all mammalian cells. 1 2 3 4 5 7 In mammalian cells, different CDK-cyclins have been thought to be critical for different transitions through the cell cycle. Historically, CDK4 or CDK6 in complex with D-type cyclins (cyclins D1, D2, and D3) were considered the focal point of coupling mitogenic signaling pathways to the initiation of the cell cycle in early G1 8 Figure 1 9 10 11 12 15 7 16 18 Figure 1A 19 20 Figure 1 5 While CDK inhibitors were first deployed clinically ~25 years ago, toxicity of early broad-acting inhibitors such as flavopiridol or dinaciclib limited drug development. 21 22 4 21 23 24 25 4 26 4 27 Complex rationale for targeting CDK2 in cancer therapy Our understanding of the biology of CDK2 and its stock as a therapeutic target for cancer has varied dramatically over the last 20 years. Initially, it was suspected that CDK2 is universally required for mammalian cells to divide. This supposition was based on key roles of CDK2 in the inactivation of RB by hyperphosphorylation, initiation and progression of DNA replication, and features of the G2/M transition. 5 20 28 29 CDK2 30 32 CDK2 CDK2 33 34 30 35 36 Several recent findings expanded the significance of CDK2 as a cancer target. First, deregulation of CDK2 is considered one of the key mechanisms through which cells acquire resistance to CDK4/6 inhibitors. 4 37 39 38 40 5 39 41 AMBRA1 42 43 33 37 41 Figure 1B CCNE1 3 44 CCNE1 45 46 CDK2 CCNE1 CCNE1 Figure 1C Chemical strategies for CDK2 inhibition The most widely pursued strategy for CDK2 inhibition has been the development of type I competitive kinase inhibitors that target the ATP-binding site of the active CDK2-cyclin E heterodimeric enzyme. 47 48 49 48 49 Figure 2 50 52 in silico 53 54 47 51 49 48 54 The underlying challenge to developing type I inhibitors has been the high homology between CDK2 and CDK1. The two enzymes are ~65% identical and contain the same set of amino acids forming the ATP binding site ( Figure 2 48 50 55 56 58 Two other chemical strategies toward CDK2 inhibition include the use of allosteric inhibitors and proteolysis-targeting chimeras (PROTACs). An allosteric pocket in CDK2, which was originally identified through interaction of CDK2 with the dye molecule and promiscuous protein ligand ANS, sits adjacent to the orthosteric ATP site in the N-lobe of the kinase domain. 36 59 60 61 62 62 47 63 64 63 64 CDK2 catalytic inhibitor mechanism of action and distinction from genetic dependencies Relatively few cancer cells harbor a genetic dependency for CDK2 CCNE1 CCNA2 33 CDK2 CCNE1 48 50 52 65 Figure 3A 66 CCND1 48 50 52 65 CCNE1 5 48 50 in vivo 5 48 50 52 65 CCNE1 50 62 Surprisingly, many cell models that are not particularly dependent on CDK2 48 65 67 67 Figure 3A CCNE1 48 65 CDK2 65 CDK2 65 68 CDK2 Figure 3B A key question remains: what is the exact nature of the G2 inhibition ( Figure 3B 69 CCNA2 50 65 70 71 65 12 72 Irrespective of the precise mechanism, it seems that networks that control G2/M represent key mediators of response to CDK2 inhibitors in the majority of cancer cells, as observed through CRISPR screens in which deletion of G2/M drivers is associated with improved response to catalytic CDK2 inhibitors. 65 CDK2 Biomarkers related to different stages of cell-cycle arrest with CDK2 inhibitors The dramatic differences in response to CDK2 inhibitors underscore the importance of biomarkers to direct their use. Initially, CCNE1 Table 1 CCNE1 CDK2 33 14 73 A key complementary biomarker that emerged from preclinical studies and assessment of DepMap data is the CDK4/6 inhibitor p16INK4A, encoded by CDKN2A 33 50 52 65 66 74 75 Figure 2C CDKN2A 75 76 CCNE1 CDKN2A high high + 50 65 66 77 78 The role of RB as a biomarker for response to CDK2 inhibitors is complex. In DepMap, RB1 CDK2 52 50 50 52 RB1 50 65 RB1 50 RB1 62 Combinatorial strategies One of the features of CDK4/6 inhibitors is their broad ability to combine with other agents, most notably endocrine therapies and specific pathway inhibitors, which have spawned multiple clinical trials. 26 41 79 CCNE1 80 80 CCNE1 RB1 52 Several studies support the role of dual CDK2 and CDK4/6 inhibition in delaying resistance and enforcing sustained cell-cycle exit in HR+/HER2− breast cancer. 67 81 82 83 84 82 81 65 50 Beyond combinations with other selective CDK inhibitors, CDK2 inhibitors have shown potential when combined with chemotherapy and DNA damage response inhibitors. For example, BLU-222 acts as a chemosensitizer to carboplatin and paclitaxel in CCNE1 CCNE1 CCNE1 RB1 CDKN2A 52 CCNE1 85 86 Active clinical trials and preliminary outcomes Several drugs that have the capacity to inhibit CDK2 have been interrogated clinically. Older clinical studies with flavopiridol, roscovitine, AT-7519, and dinaciclib were conducted in the absence of a biomarker strategy and generally had modest efficacy relative to their toxicity profiles. 87 89 90 92 As discussed above, one mechanism to enhance the durability of CDK4/6 inhibitors would be to utilize molecules that coordinately inhibit CDK2, as exemplified by the CDK2/4/6 inhibitor PF-06873600. Other drugs in this class that entered the clinic include NUV-422. The clinical data on PF-06873600 that were recently published indicated substantial toxicity with relatively modest clinical benefit, 93 Multiple CDK2-selective inhibitors are being tested in clinical trials (summarized in Table 1 CCNE1 CCNE1 94 The reported clinical data with CDK2-selective inhibitors to this point are relatively limited and solely present in abstract form as summarized in Table 1 Table 1 CCNE1 Table 1 Concluding remarks Over the last several years, there has been immense progress in targeting CDK2 for cancer therapy. Pharmaceutical strategies have emerged very rapidly that include conventional catalytic inhibitors as well as mechanisms of inhibiting or depleting CDK2. Preclinical studies have illustrated complex mechanisms through which CDK2 inhibitors act in multiple phases of the cell cycle. Biomarkers for exceptional responses to CDK2 inhibitors have been described and are partially incorporated into current clinical design. Early stage clinical trials are ongoing that should address monotherapy and combinatorial efficacy of CDK2 inhibition in multiple indications. Despite this progress, key questions remain. Will monotherapy with CDK2 inhibitors be effective? While CDK2 inhibition can have robust monotherapy in CCNE1 Are there more determinants of response to CDK2 inhibitors? While it appears CCNE1 Will CDK2 + CDK4/6 inhibition combination be effective or hampered by toxicity? The development of highly selective CDK2 inhibitors has reduced toxicity compared to earlier compounds, enabling their clinical evaluation in combination with CDK4/6- or CDK4-selective inhibitors. It remains to be determined how tolerable these combinations are and how efficacious this approach will be, particularly in the context of patients who have already progressed on a CDK4/6 inhibitor-based therapy for metastatic HR+/HER2− breast cancer. Are there ways to achieve better CDK2 selectivity over CDK1? It may be that the shortcomings of recent clinical trials have been due to CDK1 toxicity, which results from insufficient CDK2 selectivity of the current type 1 ATP competitive inhibitors. Additional publicly available structural information may inspire more medicinal chemistry campaigns. More exploration of the selectivity, efficacy, and biological effects of allosteric inhibitors and degraders is needed. Other combination therapies? Currently, the clinical evaluation of CDK2 inhibitor-based combination therapies, particularly with CDK4/6- or CDK4-selective inhibitors, remains limited. However, the diverse molecular mechanisms of CDK2 inhibition across tumor types and genetic backgrounds provide opportunities for additional combinations. For instance, in RB-deficient tumors in which the G1/S checkpoint is compromised, targeting cyclin A/CDK2 activity may synergize with agents that impair DNA replication or repair, such as PARP inhibitors or chemotherapy. Moreover, CDK2 inhibition may enhance the efficacy of macrocyclic cyclin A/B inhibitors, which drive E2F hyperactivation and apoptosis in small cell lung cancer. As these questions and others are addressed in preclinical models and clinical trials, it is likely that CDK2-selective inhibitors will join the growing armamentarium of targeted cancer drugs. ACKNOWLEDGMENTS The authors are grateful for discussion with their colleagues in the field as well as those in their respective research teams. We aimed to ensure a broad and balanced article and apologize for any omissions. The authors receive funding from the NIH: E.S.K. and A.K.W. (R01 CA275081, R01 CA247362, R01 CA267467, and R01 CA247362-S1) and S.M.R. (R35 GM145255 and P01 CA254867). DECLARATION OF INTERESTS I.S. received research funding from Novartis. E.S.K. received research funding from Blueprint Medicines, Bristol Myers Squibb, and Aleksia Therapeutics and consults through Cancer Cell Cycles-LLC. A.K.W. received research funding from Blueprint Medicines, Bristol Myers Squibb, and Aleksia Therapeutics. REFERENCES 1. Nurse P 2012 Finding CDK: linking yeast with humans Nat. Cell Biol 14 776 10.1038/ncb2547 22854809 2. Sherr CJ 1996 Cancer cell cycles Science 274 1672 1677 8939849 10.1126/science.274.5293.1672 3. Suski JM Braun M Strmiska V Sicinski P 2021 Targeting cell-cycle machinery in cancer Cancer Cell 39 759 778 10.1016/j.ccell.2021.03.010 33891890 PMC8206013 4. Alvarez-Fernandez M Malumbres M 2020 Mechanisms of Sensitivity and Resistance to CDK4/6 Inhibition Cancer Cell 37 514 529 10.1016/j.ccell.2020.03.010 32289274 5. Knudsen ES Witkiewicz AK Rubin SM 2024 Cancer takes many paths through G1/S Trends Cell Biol 34 636 645 10.1016/j.tcb.2023.10.007 37953123 PMC11082069 6. Sherr CJ Beach D Shapiro GI 2016 Targeting CDK4 and CDK6: From Discovery to Therapy Cancer Discov 6 353 367 10.1158/2159-8290.CD-15-0894 26658964 PMC4821753 7. Sherr CJ 2016 A New Cell-Cycle Target in Cancer - Inhibiting Cyclin D-Dependent Kinases 4 and 6 N. Engl. J. Med 375 1920 1923 10.1056/NEJMp1612343 27959598 8. Sherr CJ 1995 D-type cyclins Trends Biochem. Sci 20 187 190 7610482 10.1016/s0968-0004(00)89005-2 9. Matsushime H Quelle DE Shurtleff SA Shibuya M Sherr CJ Kato JY 1994 D-type cyclin-dependent kinase activity in mammalian cells Mol. Cell Biol 14 2066 2076 8114738 10.1128/mcb.14.3.2066 PMC358567 10. Kato J Matsushime H Hiebert SW Ewen ME Sherr CJ 1993 Direct binding of cyclin D to the retinoblastoma gene product (pRb) and pRb phosphorylation by the cyclin D-dependent kinase CDK4 Genes Dev 7 331 342 8449399 10.1101/gad.7.3.331 11. Nevins JR 2001 The Rb/E2F pathway and cancer Hum. Mol. Genet 10 699 703 11257102 10.1093/hmg/10.7.699 12. Fischer M Schade AE Branigan TB Müller GA DeCaprio JA 2022 Coordinating gene expression during the cell cycle Trends Biochem. Sci 47 1009 1022 10.1016/j.tibs.2022.06.007 35835684 13. Markey MP Angus SP Strobeck MW Williams SL Gunawardena RW Aronow BJ Knudsen ES 2002 Unbiased analysis of RB-mediated transcriptional repression identifies novel targets and distinctions from E2F action Cancer Res 62 6587 6597 12438254 14. DeGregori J Kowalik T Nevins JR 1995 Cellular targets for activation by the E2F1 transcription factor include DNA synthesis- and G1/S-regulatory genes Mol. Cell Biol 15 4215 4224 7623816 10.1128/mcb.15.8.4215 PMC230660 15. Ren B Cam H Takahashi Y Volkert T Terragni J Young RA Dynlacht BD 2002 E2F integrates cell cycle progression with DNA repair, replication, and G(2)/M checkpoints Genes Dev 16 245 256 11799067 10.1101/gad.949802 PMC155321 16. Herrera RE Sah VP Williams BO Mäkelä TP Weinberg RA Jacks T 1996 Altered cell cycle kinetics, gene expression, and G1 restriction point regulation in Rb-deficient fibroblasts Mol. Cell Biol 16 2402 2407 8628308 10.1128/mcb.16.5.2402 PMC231229 17. Moroy T Geisen C 2004 Cyclin E Int. J. Biochem. Cell Biol 36 1424 1439 10.1016/j.biocel.2003.12.005 15147722 18. Angus SP Fribourg AF Markey MP Williams SL Horn HF DeGregori J Kowalik TF Fukasawa K Knudsen ES 2002 Active RB elicits late G1/S inhibition Exp. Cell Res 276 201 213 12027450 10.1006/excr.2002.5510 19. Chi Y Carter JH Swanger J Mazin AV Moritz RL Clurman BE 2020 A novel landscape of nuclear human CDK2 substrates revealed by in situ phosphorylation Sci. Adv 6 eaaz9899 10.1126/sciadv.aaz9899 32494624 PMC7164936 20. Fagundes R Teixeira LK 2021 Cyclin E/CDK2: DNA Replication, Replication Stress and Genomic Instability Front. Cell Dev. Biol 9 774845 10.3389/fcell.2021.774845 34901021 PMC8652076 21. Asghar U Witkiewicz AK Turner NC Knudsen ES 2015 The history and future of targeting cyclin-dependent kinases in cancer therapy Nat. Rev. Drug Discov 14 130 146 10.1038/nrd4504 25633797 PMC4480421 22. Senderowicz AM 2003 Small-molecule cyclin-dependent kinase modulators Oncogene 22 6609 6620 14528286 10.1038/sj.onc.1206954 23. O’Leary B Finn RS Turner NC 2016 Treating cancer with selective CDK4/6 inhibitors Nat. Rev. Clin. Oncol 13 417 430 10.1038/nrclinonc.2016.26 27030077 24. Cristofanilli M Turner NC Bondarenko I Ro J Im SA Masuda N Colleoni M DeMichele A Loi S Verma S 2016 Fulvestrant plus palbociclib versus fulvestrant plus placebo for treatment of hormone-receptor-positive, HER2-negative metastatic breast cancer that progressed on previous endocrine therapy (PALOMA-3): final analysis of the multicentre, double-blind, phase 3 randomised controlled trial Lancet Oncol 17 425 439 10.1016/S1470-2045(15)00613-0 26947331 25. Turner NC Ro J Andre F Loi S Verma S Iwata H Harbeck N Loibl S Huang Bartlett C Zhang K 2015 Palbociclib in Hormone-Receptor-Positive Advanced Breast Cancer N. Engl. J. Med 373 209 219 10.1056/NEJMoa1505270 26030518 26. Witkiewicz AK Kumarasamy V Sanidas I Knudsen ES 2022 Cancer cell cycle dystopia: heterogeneity, plasticity, and therapy Trends Cancer 8 711 725 10.1016/j.trecan.2022.04.006 35599231 PMC9388619 27. Clark AS Hong F Finn RS DeMichele AM Mitchell EP Zwiebel J Arnaldez FI Gray RJ Wang V McShane LM 2023 Phase II Study of Palbociclib (PD-0332991) in CCND1, 2, or 3 Amplification: Results from the NCI-MATCH ECOG-ACRIN Trial (EAY131) Subprotocol Z1B Clin. Cancer Res 29 1477 1483 10.1158/1078-0432.CCR-22-2150 36853016 PMC10102836 28. Coverley D Laman H Laskey RA 2002 Distinct roles for cyclins E and A during DNA replication complex assembly and activation Nat. Cell Biol 4 523 528 12080347 10.1038/ncb813 29. Mailand N Diffley JFX 2005 CDKs promote DNA replication origin licensing in human cells by protecting Cdc6 from APC/C-dependent proteolysis Cell 122 915 926 16153703 10.1016/j.cell.2005.08.013 30. Berthet C Aleem E Coppola V Tessarollo L Kaldis P 2003 Cdk2 knockout mice are viable Curr. Biol 13 1775 1785 10.1016/j.cub.2003.09.024 14561402 31. Aleem E Berthet C Kaldis P 2004 Cdk2 as a master of S phase entry: fact or fake? Cell Cycle 3 35 37 14657662 32. Tetsu O McCormick F 2003 Proliferation of cancer cells despite CDK2 inhibition Cancer Cell 3 233 245 10.1016/s1535-6108(03)00053-9 12676582 33. Knudsen ES Kumarasamy V Nambiar R Pearson JD Vail P Rosenheck H Wang J Eng K Bremner R Schramek D 2022 CDK/cyclin dependencies define extreme cancer cell-cycle heterogeneity and collateral vulnerabilities Cell Rep 38 110448 10.1016/j.celrep.2022.110448 35235778 PMC9022184 34. Zhang Z Golomb L Meyerson M 2022 Functional Genomic Analysis of CDK4 and CDK6 Gene Dependency across Human Cancer Cell Lines Cancer Res 82 2171 2184 10.1158/0008-5472.CAN-21-2428 35395071 PMC9618034 35. Giarolla J Holdaway KA Nazari M Aiad L Sarkar B Georg GI 2025 Targeting cyclin-dependent kinase 2 (CDK2) interactions with cyclins and Speedy 1 (Spy1) for cancer and male contraception Future Med. Chem 17 607 627 10.1080/17568919.2025.2463868 40034037 PMC11901406 36. Faber EB Sun L Tang J Roberts E Ganeshkumar S Wang N Rasmussen D Majumdar A Hirsch LE John K 2023 Development of allosteric and selective CDK2 inhibitors for contraception with negative cooperativity to cyclin binding Nat. Commun 14 3213 10.1038/s41467-023-38732-x 37270540 PMC10239507 37. Kumarasamy V Vail P Nambiar R Witkiewicz AK Knudsen ES 2021 Functional Determinants of Cell Cycle Plasticity and Sensitivity to CDK4/6 Inhibition Cancer Res 81 1347 1360 10.1158/0008-5472.CAN-20-2275 33323381 PMC8026500 38. Turner NC Liu Y Zhu Z Loi S Colleoni M Loibl S DeMichele A Harbeck N André F Bayar MA 2019 Cyclin E1 Expression and Palbociclib Efficacy in Previously Treated Hormone Receptor-Positive Metastatic Breast Cancer J. Clin. Oncol 37 1169 1178 10.1200/JCO.18.00925 30807234 PMC6506420 39. Herrera-Abreu MT Palafox M Asghar U Rivas MA Cutts RJ Garcia-Murillas I Pearson A Guzman M Rodriguez O Grueso J 2016 Early Adaptation and Acquired Resistance to CDK4/6 Inhibition in Estrogen Receptor-Positive Breast Cancer Cancer Res 76 2301 2313 10.1158/0008-5472.CAN-15-0728 27020857 PMC5426059 40. Guerrero-Zotano Á Belli S Zielinski C Gil-Gil M Fernandez-Serra A Ruiz-Borrego M Ciruelos Gil EM Pascual J Muñoz-Mateu M Bermejo B 2023 CCNE1 and PLK1 mediates resistance to palbociclib in HR+/HER2− metastatic breast cancer Clin. Cancer Res 29 1557 1568 10.1158/1078-0432.CCR-22-2206 36749874 PMC10102847 41. Goodwin CM Waters AM Klomp JE Javaid S Bryant KL Stalnecker CA Drizyte-Miller K Papke B Yang R Amparo AM 2023 Combination Therapies with CDK4/6 Inhibitors to Treat KRAS-Mutant Pancreatic Cancer Cancer Res 83 141 157 10.1158/0008-5472.CAN-22-0391 36346366 PMC9812941 42. Chaikovsky AC Li C Jeng EE Loebell S Lee MC Murray CW Cheng R Demeter J Swaney DL Chen SH 2021 The AMBRA1 E3 ligase adaptor regulates the stability of cyclin D Nature 592 794 798 10.1038/s41586-021-03474-7 33854239 PMC8246597 43. Simoneschi D Rona G Zhou N Jeong YT Jiang S Milletti G Arbini AA O’Sullivan A Wang AA Nithikasem S 2021 CRL4 (AMBRA1) is a master regulator of D-type cyclins Nature 592 789 793 10.1038/s41586-021-03445-y 33854235 PMC8875297 44. Hwang HC Clurman BE 2005 Cyclin E in normal and neoplastic cell cycles Oncogene 24 2776 2786 10.1038/sj.onc.1208613 15838514 45. Etemadmoghadam D deFazio A Beroukhim R Mermel C George J Getz G Tothill R Okamoto A Raeder MB Harnett P 2009 Integrated genome-wide DNA copy number and expression analysis identifies distinct mechanisms of primary chemoresistance in ovarian carcinomas Clin. Cancer Res 15 1417 1427 10.1158/1078-0432.CCR-08-1564 19193619 PMC2670486 46. Rustgi N Wu S Samec T Walker P Xiu J Lou E Goel S Saeed A Moy RH 2024 Molecular Landscape and Clinical Implication of CCNE1-amplified Esophagogastric Cancer Cancer Res. Commun 4 1399 1409 10.1158/2767-9764.CRC-23-0496 38717153 PMC11146286 47. Zeng Y Ren X Jin P Fan Z Liu M Zhang Y Li L Zhuo M Wang J Li Z Wu M 2024 Inhibitors and PROTACs of CDK2: challenges and opportunities Expet Opin. Drug Discov 19 1125 1148 10.1080/17460441.2024.2376655 38994606 48. Dietrich C Trub A Ahn A Taylor M Ambani K Chan KT Lu KH Mahendra CA Blyth C Coulson R 2024 INX-315, a Selective CDK2 Inhibitor, Induces Cell Cycle Arrest and Senescence in Solid Tumors Cancer Discov 14 446 467 10.1158/2159-8290.CD-23-0954 38047585 PMC10905675 49. Freeman-Cook KD Hoffman RL Behenna DC Boras B Carelli J Diehl W Ferre RA He YA Hui A Huang B 2021 Discovery of PF-06873600, a CDK2/4/6 Inhibitor for the Treatment of Cancer J. Med. Chem 64 9056 9077 10.1021/acs.jmedchem.1c00159 34110834 50. Dommer AP Kumarasamy V Wang J O’Connor TN Roti M Mahan S McLean K Knudsen ES Witkiewicz AK 2025 Tumor Suppressors Condition Differential Responses to the Selective CDK2 Inhibitor BLU-222 Cancer Res 85 1310 1326 10.1158/0008-5472.CAN-24-2244 39945638 PMC11977231 51. Hummel JR Xiao KJ Yang JC Epling LB Mukai K Ye Q Xu M Qian D Huo L Weber M 2024 Discovery of (4-Pyrazolyl)-2-aminopyrimidines as Potent and Selective Inhibitors of Cyclin-Dependent Kinase 2 J. Med. Chem 67 3112 3126 10.1021/acs.jmedchem.3c02287 38325398 52. House NC Brown VE Chen M Yuan L Moore SL Guo J Choi YJ Muthuswamy L Ribich S Ramsden P Faia KL 2025 Profiling the Activity of the Potent and Highly Selective CDK2 Inhibitor BLU-222 Reveals Determinants of Response in CCNE1-Aberrant Ovarian and Endometrial Tumors Cancer Res 85 1297 1309 10.1158/0008-5472.CAN-24-2360 39945650 PMC11967718 53. Chen W Zhuang X Chen Y Shen L Yang H Wang M Pan G Tan J Pan X Feng S 2025 Discovery of potent and selective CDK2 inhibitors with high safety and favorable bioavailability for the treatment of cancer Eur. J. Med. Chem 290 117503 10.1016/j.ejmech.2025.117503 40107208 54. Yu Y Huang J He H Han J Ye G Xu T Sun X Chen X Ren X Li C 2023 Accelerated Discovery of Macrocyclic CDK2 Inhibitor QR-6401 by Generative Models and Structure-Based Drug Design ACS Med. Chem. Lett 14 297 304 10.1021/acsmedchemlett.2c00515 36923916 PMC10009793 55. Wood DJ Korolchuk S Tatum NJ Wang LZ Endicott JA Noble MEM Martin MP 2019 Differences in the Conformational Energy Landscape of CDK1 and CDK2 Suggest a Mechanism for Achieving Selective CDK Inhibition Cell Chem. Biol 26 121 130.e5 10.1016/j.chembiol.2018.10.015 30472117 PMC6344228 56. Alexander LT Möbitz H Drueckes P Savitsky P Fedorov O Elkins JM Deane CM Cowan-Jacob SW Knapp 2015 Type II Inhibitors Targeting CDK2 ACS Chem. Biol 10 2116 2125 10.1021/acschembio.5b00398 26158339 57. Deng Y Shipps GW Jr. Zhao L Siddiqui MA Popovici-Muller J Curran PJ Duca JS Hruza AW Fischmann TO Madison VS 2014 Modulating the interaction between CDK2 and cyclin A with a quinoline-based inhibitor Bioorg. Med. Chem. Lett 24 199 203 10.1016/j.bmcl.2013.11.041 24332088 58. Tambo CS Tripathi S Perera BGK Maly DJ Bridges AJ Kiss G Rubin SM 2023 Biolayer Interferometry Assay for Cyclin-Dependent Kinase-Cyclin Association Reveals Diverse Effects of Cdk2 Inhibitors on Cyclin Binding Kinetics ACS Chem. Biol 18 431 440 10.1021/acschembio.3c00015 36724382 PMC10029018 59. Betzi S Alam R Martin M Lubbers DJ Han H Jakkaraj SR Georg GI Schönbrunn E 2011 Discovery of a potential allosteric ligand binding site in CDK2 ACS Chem. Biol 6 492 501 10.1021/cb100410m 21291269 PMC3098941 60. Zhang Y Liu Z Hirschi M Brodsky O Johnson E Won SJ Nagata A Bezwada D Petroski MD Majmudar JD 2025 An allosteric cyclin E-CDK2 site mapped by paralog hopping with covalent probes Nat. Chem. Biol 21 420 431 10.1038/s41589-024-01738-7 39294320 PMC11867888 61. Castanedo G Clark K Wang S Tsui V Wong M Nicholas J Wickramasinghe D Marsters JC Jr. Sutherlin D 2006 CDK2/cyclinA inhibitors: targeting the cyclinA recruitment site with small molecules derived from peptide leads Bioorg. Med. Chem. Lett 16 1716 1720 10.1016/j.bmcl.2005.12.004 16384702 62. Singh S Gleason CE Fang M Laimon YN Khivansara V Xie S Durmaz YT Sarkar A Ngo K Savla V 2024 Cyclin A/B RxL Macrocyclic Inhibitors to Treat Cancers with High E2F Activity bioRxiv 10.1101/2024.08.01.605889 63. Kwiatkowski N Liang T Sha Z Collier PN Yang A Sathappa M Paul A Su L Zheng X Aversa R 2025 CDK2 heterobifunctional degraders co-degrade CDK2 and cyclin E resulting in efficacy in CCNE1-amplified and overexpressed cancers Cell Chem. Biol 32 556 569.e24 10.1016/j.chembiol.2025.03.006 40250405 64. Wang L Shao X Zhong T Wu Y Xu A Sun X Gao H Liu Y Lan T Tong Y 2021 Discovery of a first-in-class CDK2 selective degrader for AML differentiation therapy Nat. Chem. Biol 17 567 575 10.1038/s41589-021-00742-5 33664520 65. Kumarasamy V Wang J Roti M Wan Y Dommer AP Rosenheck H Putta S Trub A Bisi J Strum J 2025 Discrete vulnerability to pharmacological CDK2 inhibition is governed by heterogeneity of the cancer cell cycle Nat. Commun 16 1476 10.1038/s41467-025-56674-4 39924553 PMC11808123 66. Sine C Watts L Fernandez B Wang J Knudsen E Witkiewicz A Spencer SL 2025 p16 expression confers sensitivity to CDK2 inhibitors bioRxiv 10.1101/2025.02.10.637344 67. Arora M Moser J Hoffman TE Watts LP Min M Musteanu M Rong Y Ill CR Nangia V Schneider J 2023 Rapid adaptation to CDK2 inhibition exposes intrinsic cell-cycle plasticity Cell 186 2628 2643.e21 10.1016/j.cell.2023.05.013 37267950 68. Hu B Mitra J van den Heuvel S Enders GH 2001 S and G2 phase roles for Cdk2 revealed by inducible expression of a dominant-negative mutant in human cells Mol. Cell Biol 21 2755 2766 10.1128/MCB.21.8.2755-2766.2001 11283255 PMC86906 69. Vigneron S Sundermann L Labbe JC Pintard L Radulescu O Castro A Lorca T 2018 Cyclin A-cdk1-Dependent Phosphorylation of Bora Is the Triggering Factor Promoting Mitotic Entry Dev. Cell 45 637 650.e637 10.1016/j.devcel.2018.05.005 29870721 70. Armstrong C Passanisi VJ Ashraf HM Spencer SL 2023 Cyclin E/CDK2 and feedback from soluble histone protein regulate the S phase burst of histone biosynthesis bioRxiv 10.1101/2023.03.17.533218 PMC10440735 37428633 71. Gunesdogan U Jackle H Herzig A 2014 Histone supply regulates S phase timing and cell cycle progression eLife 3 e02443 10.7554/eLife.02443 25205668 PMC4157229 72. Sadasivam S DeCaprio JA 2013 The DREAM complex: master coordinator of cell cycle-dependent gene expression Nat. Rev. Cancer 13 585 595 10.1038/nrc3556 23842645 PMC3986830 73. Koepp DM Schaefer LK Ye X Keyomarsi K Chu C Harper JW Elledge SJ 2001 Phosphorylation-dependent ubiquitination of cyclin E by the SCFFbw7 ubiquitin ligase Science 294 173 177 10.1126/science.1065203 11533444 74. Serrano M Hannon GJ Beach D 1993 A new regulatory motif in cell-cycle control causing specific inhibition of cyclin D/CDK4 Nature 366 704 707 8259215 10.1038/366704a0 75. Witkiewicz AK Knudsen KE Dicker AP Knudsen ES 2011 The meaning of p16(ink4a) expression in tumors: functional significance, clinical associations and future developments Cell Cycle 10 2497 2503 21775818 10.4161/cc.10.15.16776 PMC3685613 76. Aagaard L Lukas J Bartkova J Kjerulff AA Strauss M Bartek J 1995 Aberrations of p16Ink4 and retinoblastoma tumour-suppressor genes occur in distinct sub-sets of human cancer cell lines Int. J. Cancer 61 115 120 7705923 10.1002/ijc.2910610120 77. Palafox M Monserrat L Bellet M Villacampa G Gonzalez-Perez A Oliveira M Brasó-Maristany F Ibrahimi N Kannan S Mina L 2022 High p16 expression and heterozygous RB1 loss are biomarkers for CDK4/6 inhibitor resistance in ER(+) breast cancer Nat. Commun 13 5258 10.1038/s41467-022-32828-6 36071033 PMC9452562 78. Li Q Jiang B Guo J Shao H Del Priore IS Chang Q Kudo R Li Z Razavi P Liu B 2022 INK4 Tumor Suppressor Proteins Mediate Resistance to CDK4/6 Kinase Inhibitors Cancer Discov 12 356 371 10.1158/2159-8290.CD-20-1726 34544752 PMC8831444 79. Rampioni Vinciguerra GL Sonego M Segatto I Dall’Acqua A Vecchione A Baldassarre G Belletti B 2022 CDK4/6 Inhibitors in Combination Therapies: Better in Company Than Alone: A Mini Review Front. Oncol 12 891580 10.3389/fonc.2022.891580 35712501 PMC9197541 80. Palmer CL Boras B Pascual B Li N Li D Garza S Huser N Yuan JT Cianfrogna JA Sung T 2025 CDK4 selective inhibition improves preclinical anti-tumor efficacy and safety Cancer Cell 43 464 481.e14 10.1016/j.ccell.2025.02.006 40068598 81. Dietrich C Trub A Ahn A Taylor M Ambani K Chan KT Lu KH Mahendra CA Blyth C Coulson R 2024 INX-315, a selective CDK2 inhibitor, induces cell cycle arrest and senescence in solid tumors Cancer Discov 14 446 467 10.1158/2159-8290.CD-23-0954 38047585 PMC10905675 82. Kudo R Safonov A Jones C Moiso E Dry JR Shao H Nag S da Silva EM Yildirim SY Li Q 2024 Long-term breast cancer response to CDK4/6 inhibition defined by TP53-mediated geroconversion Cancer Cell 42 1919 1935.e9 10.1016/j.ccell.2024.09.009 39393354 83. Al-Qasem AJ Alves CL Ehmsen S Tuttolomondo M Terp MG Johansen LE Vever H Hoeg LVA Elias D Bak M Ditzel HJ 2022 Co-targeting CDK2 and CDK4/6 overcomes resistance to aromatase and CDK4/6 inhibitors in ER+ breast cancer. npj Precis Oncol 6 68 10.1038/s41698-022-00311-6 PMC9509389 36153348 84. Armand J Kim S Kim K Son E Kim M Yang HW 2024 Therapeutic benefits of maintaining CDK4/6 inhibitors and incorporating CDK2 inhibitors beyond progression in breast cancer bioRxiv 10.1101/2024.11.11.623139 85. Brown VE Moore SL Chen M House N Ramsden P Wu HJ Ribich S Grassian AR Choi YJ 2023 CDK2 regulates collapsed replication fork repair in CCNE1-amplified ovarian cancer cells via homologous recombination NAR Cancer 5 zcad039 10.1093/narcan/zcad039 37519629 PMC10373114 86. Tyutyunyk-Massey L Chen Z Liu X Kawakami M Harned A Ng Y Luke B Okpechi SC Ogunlade B Alfaro Y 2025 CDK2 Inhibition Produces a Persistent Population of Polyploid Cancer Cells JCI Insight 10 e189901 10.1172/jci.insight.189901 40232858 PMC12128980 87. Whittaker SR Mallinger A Workman P Clarke PA 2017 Inhibitors of cyclin-dependent kinases as cancer therapeutics Pharmacol. Ther 173 83 105 10.1016/j.pharmthera.2017.02.008 28174091 PMC6141011 88. Mughal MJ Bhadresha K Kwok HF 2023 CDK inhibitors from past to present: A new wave of cancer therapy Semin. Cancer Biol 88 106 122 10.1016/j.semcancer.2022.12.006 36565895 89. Mounika P Gurupadayya B Kumar HY Namitha B 2023 An Overview of CDK Enzyme Inhibitors in Cancer Therapy Curr. Cancer Drug Targets 23 603 619 10.2174/1568009623666230320144713 36959160 90. Chen R Chen Y Xiong P Zheleva D Blake D Keating MJ Wierda WG Plunkett W 2022 Cyclin-dependent kinase inhibitor fadraciclib (CYC065) depletes anti-apoptotic protein and synergizes with venetoclax in primary chronic lymphocytic leukemia cells Leukemia 36 1596 1608 10.1038/s41375-022-01553-w 35383271 PMC9162916 91. Poon E Liang T Jamin Y Walz S Kwok C Hakkert A Barker K Urban Z Thway K Zeid R 2020 Orally bioavailable CDK9/2 inhibitor shows mechanism-based therapeutic potential in MYCN-driven neuroblastoma J. Clin. Investig 130 5875 5892 10.1172/JCI134132 33016930 PMC7598076 92. Frame S Saladino C MacKay C Atrash B Sheldrake P McDonald E Clarke PA Workman P Blake D Zheleva D 2020 Fadraciclib (CYC065), a novel CDK inhibitor, targets key pro-survival and oncogenic pathways in cancer PLoS One 15 e0234103 10.1371/journal.pone.0234103 32645016 PMC7347136 93. Yap TA Goldman JW Vinayak S Tomova A Hamilton E Naito Y Giordano A Bondarenko I Yamashita T Zhou L 2025 First-In-Human Phase 1/2a Study of the First-In-Class CDK2/4/6 Inhibitor PF-06873600 Alone or with Endocrine Therapy in Patients with Breast Cancer Clin. Cancer Res 31 2899 2909 10.1158/1078-0432.CCR-24-2740 40243688 PMC12260505 94. Sivakumar S Moore JA Montesion M Sharaf R Lin DI Colón CI Fleishmann Z Ebot EM Newberg JY Mills JM 2023 Integrative Analysis of a Large Real-World Cohort of Small Cell Lung Cancer Identifies Distinct Genetic Subtypes and Insights into Histologic Transformation Cancer Discov 13 1572 1591 10.1158/2159-8290.CD-22-0620 37062002 PMC10326603 Figure 1. Distinct cell cycles under different conditions (A) The conventional depiction of the cell cycle with initiation occurring with coordinated phosphorylation of RB and related proteins by CDK4/6 and CDK2 complexes. This event releases E2F activity to promote further activation of CDK2 and progression through G1/S and additional phases of the cell cycle. (B) In the context of resistance to CDK4/6 inhibitors, the activity of CDK2 either in complex with cyclin E or cyclin D1 can bypass the requirement for CDK4 or CDK6 activity. (C) In the context of tumors with high expression of p16INK4A, the transition through G1/S is more dependent on CDK2. This dependence can be apparent in both RB-proficient and RB-deficient tumor models. Figure 2. Structural comparison of CDKs bound to type I ATP-competitive inhibitors (Left) Crystal structure of CDK2 bound to PF-06873600 (PDB: 7kjs). (Middle) Structural model of palbociclib bound to CDK4 created by overlaying the position of the drug in the palbociclib-CDK6 crystal structure (PDB: 5l2i) with the position of CDK4 in the abemaciclib-CDK4-cyclin D3 crystal structure (PDB: 7sj3). One approach to engineering CDK2 potency has been replacement of the palbociclib piperazine-pyridine ring system with a group that contacts CDK2-specific residues near the hinge region of the kinase. For example, the aminopiperidine sulfonamide group in PF-06873600 makes a hydrophobic contact with F82 in the CDK2 hinge, which corresponds to H95 in CDK4, and forms a hydrogen bond with K89 in the CDK2 helix proximal to the hinge (T102 in CDK4). (Right) Structural overlay of PF-06873600 and CDK1 in the CDK1-cyclin B-Cks2 crystal structure (PDB: 4yc3). Notably, all the sidechains around the ATP binding pocket are identical in CDK1 and CDK2, so the origins of the modest selectivity of this compound and other CDK2 specific inhibitors remain uncertain. Figure 3. Distinct mechanisms through which CDK2 catalytic inhibitors can suppress cell cycle progression (A) (Left) In tumors that express high levels of p16INK4A and cyclin E, the catalytic inhibitors prevent the phosphorylation of substrates including RB and nucleolin and suppress the phosphorylation of sensors for CDK activity. These molecular events lead to the repression of E2F and suppression of cyclin A, which are associated with a G1 arrest. (Right) In tumors that do not express p16INK4A, the treatment with catalytic CDK2 inhibitors does not inhibit RB phosphorylation or other molecular events. In this condition, the catalytic inhibitor induces an enrichment of cells with a 4N DNA content. The inclusion of a CDK4/6 inhibitor with the CDK2 catalytic inhibitor can phenocopy features of p16INK4A expression and lead to RB dephosphorylation and other molecular effects. (B) Comparison between genetic depletion and catalytic inhibition of CDK2. While many cells tolerate CDK2 depletion by relying on cyclin A/CDK1 for G2/M progression, catalytic inhibitors maintain inactive CDK2-cyclin complexes, resulting in the accumulation of cells with 4N DNA content. The exact nature of this arrest remains under investigation and could be related to multiple functions of CDK2 in cell biology. Table 1. Summary of trials with CDK2-selective inhibitors Study Summary from Clinicaltrials.gov Reported clinical findings  Study of AVZO-021 in Patients With Advanced Solid Tumors ( NCT05867251 phase 1/2 study of AVZO-021 for advanced/metastatic cancers that have progressed on standard therapy including HR+/HER2− breast cancer and CCNE1-altered malignancies. Monotherapy of AVZO-021 is being interrogated as well as combinations with endocrine therapy (fulvestrant and letrozole), CDK4/6 inhibitors (ribociclib and abemaciclib), the antibody-drug conjugate sacituzumab govitecan-hziy, and carboplatin. Estimated participants: 430 no results available Study to Evaluate the Safety, Tolerability, PK, and Efficacy of INX-315 in Patients With Advanced Cancer ( NCT05735080 phase 1/2 study of INX-315 for advanced/metastatic cancers that have progressed on standard therapy, including ovarian cancer with CCNE1 amplification and HR+/HER2− breast cancer. Monotherapy of INX-315 is being tested as well as combinations with fulvestrant and the CDK4/6 inhibitor abemaciclib. Estimated participants: 150 SABCS, 2024 a N PF-07104091 as a Single Agent and in Combination Therapy ( NCT04553133 phase 1/2 study of PF-07104091 for advanced/metastatic cancers that have progressed on standard therapy including small cell lung cancer, ovarian cancer, triple-negative breast cancer, HR+/HER2− breast cancer, and non-small cell lung cancer. Monotherapy of PF-07104091 as well as combinations with endocrine therapy (letrozole and fulvestrant) and the CDK4/6 inhibitor palbociclib are being tested. Estimated participants: 154 ASCO 2023 b N (VELA) Study of BLU-222 in Advanced Solid Tumors ( NCT05252416 phase 1/2 study of BLU-222 for advanced/metastatic cancers that have progressed on standard therapy including HR+/HER2− breast cancer and CCNE1-amplified tumors (ovarian, uterine, and gastric). Monotherapy of BLU-222 as well as combination therapies with carboplatin, fulvestrant, and the CDK4/6 inhibitor ribociclib are being tested. Estimated participants: 366 ASCO 2024 c N A Study with NKT3964 for Adults with Advanced/Metastatic Solid Tumors ( NCT06586957 phase 1/2 of study of NKT3964 for advanced/metastatic cancers that have progressed on standard therapy including ovarian cancer, endometrial cancer, gastric cancer, gastroesophageal junction esophageal adenocarcinoma, and other solid tumors with CCNE1 amplification; small cell lung cancer; triple negative breast cancer; and HR+/HER2− breast cancer. Monotherapy of the NKT3964 is being tested. Estimated participants: 90 no results available A Study with NKT3447 for Adults with Advanced/Metastatic Solid Tumors ( NCT06264921 phase 1/2 study of NKT3447 for advanced/metastatic cancers that have progressed on standard therapy including ovarian cancer, endometrial cancer, gastric cancer, gastroesophageal junction cancer, or other solid tumors with CCNE1 amplification; small cell lung cancer; triple negative breast cancer; HR+/HER2− breast cancer. Monotherapy of NKT3447 is being tested. Estimated participants: 90 no results available A Study to Examine the Safety of Different Doses of BG-68501 Given to Participants With Advanced-Stage Tumors ( NCT06257264 phase 1/2 study of BG-68501 for advanced/metastatic HR+/HER2− breast cancer that has progressed on standard therapy. The study assesses BG-68501 as monotherapy and in combination with fulvestrant and the CDK4-selective inhibitor BG-43395. Estimated participants: 138 ASCO 2025 d N Study to Evaluate the Safety, and Tolerability of AZD8421 Alone or in Combination in Participants With Selected Advanced or Metastatic Solid Tumors ( NCT06188520 phase 1/2 study of AZD8421 for advanced/metastatic cancers that have progressed on standard therapy including ovarian cancer and HR+/HER2− breast cancer. Monotherapy of AZD8421 as well as combinations with endocrine therapy (camizestrant) and CDK4/6 inhibitors (abemaciclib, ribociclib, or palbociclib) are being tested. Estimated participants: 204 no results available Study of ECI830 Single Agent or in Combination in Patients With Advanced HR+/HER2− Breast Cancer and Other Advanced Solid Tumors ( NCT06726148 phase 1/2 study of ECI830 for advanced/metastatic cancers that have progressed on standard therapy including HR+/HER2− breast cancer and solid tumors harboring CCNE1 amplification. Monotherapy of ECI830 as well as combinations with ribociclib and fulvestrant are being tested. Estimated participants: 280 no results available Study of INCB123667 in Participants With Platinum-Resistant Ovarian Cancer With Cyclin E1 Overexpression ( NCT07023627 phase 1/2 study for platinum-resistant ovarian cancer with CCNE1 overexpression. Monotherapy of INCB123667 is being tested. Estimated participants: 160 ASCO 2025 e N Study PF-07220060 in Combination With PF-07104091 in Participants With Breast Cancer and Solid Tumors ( NCT05262400 phase 1/2 study for advanced/metastatic cancers that have progressed on standard including HER2−, HR+/HER2+, and HR +/HER2− breast cancer. Combination of PF-07220060 and PF-07104091 with endocrine therapy (letrozole or fulvestrant). Estimated participants: 192 ESMO 2024 f N Summary of active clinical trials with CDK2-selective inhibitors on clinicaltrials.gov clinicaltrials.gov a INX-315, SABCS, 2024: https://doi.org/10.1158/1557-3265.SABCS24-P4-10-16 b PF-07104091, ASCO 2023: https://doi.org/10.1200/JCO.2023.41.16_suppl.3010 c BLU-222, ASCO 2024: https://doi.org/10.1200/JCO.2024.42.16_suppl.1056 d BG-68501, ASCO 2025: https://doi.org/10.1200/JCO.2025.43.16_suppl.3115 e INCB123667, ASCO 2025: https://doi.org/10.1200/JCO.2025.43.16_suppl.5514 f PF-07220060 with PF-07104091, ESMO 2024: https://doi.org/10.1016/j.annonc.2024.08.685 ",
  "metadata": {
    "Title of this paper": "Integrative Analysis of a Large Real-World Cohort of Small Cell Lung Cancer Identifies Distinct Genetic Subtypes and Insights into Histologic Transformation",
    "Journal it was published in:": "Cell reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477701/"
  }
}