{
  "title": "Paper_710",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12480027 PMC12480027.1 12480027 12480027 41022979 10.1038/s41598-025-18030-w 18030 1 Article Sugemalimab plus chemotherapy versus chemotherapy for advanced gastric cancer in China: a cost-effectiveness analysis Lin Xiaojie 1 Zhu Huide 2 Zheng Zhiwei zhiweizheng@126.com 2 1 https://ror.org/035rs9v13 grid.452836.e 0000 0004 1798 1271 Department of Pharmacy, The Second Affiliated Hospital of Shantou University Medical College, 2 https://ror.org/00a53nq42 grid.411917.b Department of Pharmacy, Cancer Hospital of Shantou University Medical College, 29 9 2025 2025 15 478255 33529 13 6 2025 28 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ This study aimed to evaluate the cost-effectiveness of sugemalimab plus chemotherapy compared to chemotherapy in the treatment of advanced gastric cancer in China. A Markov model of partitioned survival was developed based on the GEMSTONE-303 Phase III clinical trial evaluating sugemalimab in combination with chemotherapy for advanced gastric cancer. The model incorporates three distinct health states: progression-free survival, disease progression, and death.The transition probabilities between these states and drug treatment and adverse reaction datas were derived from the clinical trial.Direct medical costs were obtained from local sources, and utility values were derived from published literature. Costs and outcomes were projected over a lifetime horizon and discounted at an annual rate of 5%. Quality-adjusted life years (QALY) were utilized as a measure of health outcomes, with the incremental cost-effectiveness ratio (ICER) serving as the principal economic assessment parameter. The threshold for willingness to pay (WTP) was set at $40,343.68 USD per QALY. Sensitivity analysis was conducted to assess the robustness and reliability of the model. The base-case analysis revealed that the ICER for sugemalimab plus chemotherapy compared to chemotherapy alone was $80,573.50 per QALY for patients with programmed death-ligand 1 (PD-L1) combined positive score (CPS) ≥ 5, and $64,428.81 per QALY gained for those with PD-L1 CPS ≥ 10. Both ICERs exceeded the willingness-to-pay (WTP) threshold of $40,343.68 per QALY.Probabilistic sensitivity analysis demonstrated that the probability of sugemalimab plus chemotherapy being cost-effective at the WTP threshold was 0% and 1.5% for the PD-L1 CPS ≥ 5 and CPS ≥ 10 subgroups, respectively.Sensitivity analyses showed that the results were robust to parameter variations. The findings suggest that sugemalimab plus chemotherapy was not a cost-effective treatment option for advanced gastric cancer compared to chemotherapy alone in China. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-18030-w. Keywords Cost-effectiveness analysis Sugemalimab Chemotherapy Incremental cost-effectiveness ratios Advanced gastric cancer Subject terms Cancer Gastrointestinal cancer Health care economics Immunotherapy The medical science research project of Beijing Medical Health Foundation YWJKJJHKYJJ-LCYX25002 Zheng Zhiwei pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Gastric cancer is an important global health concern and is ranked as the fifth most commonly diagnosed cancer and the fifth leading cause of cancer-related deaths worldwide 1 2 3 4 5 6 7 8 8 The GEMSTONE-303 Phase III clinical trial has exhibited promising results in the treatment of advanced gastric cancer using sugemalimab. However, it is essential to consider the cost-effectiveness of incorporating sugemalimab into current standard chemotherapy protocols.Performing a cost-effectiveness analysis can offer valuable insights to healthcare providers and policymakers, aiding in the decision-making process regarding treatment options 9 Methods Model and study design We have developed a partitioned survival model to assess the cost-effectiveness of two treatment strategies for advanced gastric cancer based on the findings from the GEMSTONE-303 Phase III trial. The model incorporates three distinct health states: progression-free survival, disease progression, and death. These states are mutually exclusive, meaning that patients can only be in one state at a time. To capture the long-term outcomes of the treatment strategies, we have set the total time horizon of the model to 10 years. At the start of the simulation, all patients are assumed to be in a state of progression-free survival. Throughout each treatment cycle, patients have the potential to transition to different health states based on the transition probabilities from the clinical trial. Additionally, they receive the treatment regimen assigned to them.The model structure, as illustrated in Fig. 1  Fig. 1 The partitioned survival model structure. All costs in this study were converted from Renminbi (RMB) to United States dollars (USD) using the average exchange rate provided by the Bank of China, which was RMB 7.12 to USD 1 in 2024 10 10 11 Clinical parameters input Our study focused on a population consistent with the GEMSTONE-303 Phase III clinical trial population.Inclusion criteria for the study population included patients who were between the ages of 18 and 75, had unresectable, locally advanced, or metastatic gastric cancer, had a confirmed diagnosis of adenocarcinoma. Additionally, patients needed to have adequate tumor tissue available for PD-L1 assessment and a PD-L1 CPS score of 5 or higher at baseline. Lastly, patients were required to have at least one measurable or evaluable lesion according to the Response Evaluation Criteria in Solid Tumors (RECIST). The patients in this study were administered sugemalimab intravenously at a dosage of 1200 mg every 21 daysor placebo. In addition, they received CAPOX therapy, which consisted of oral capecitabine at a dosage of 1000 mg/m 2 Clinical transfer probability and inputs The transition probabilities used in this model were derived from data extracted and reconstructed from the GEMSTONE-303 Phase III trial. The GetData Graph Digitizer software (version 2.25) was employed to extract data from the survival curves of the trial. Subsequently, a new survival curve was reconstructed and simulated using various distribution models, including weibull, log-logistic, gompertz, gamma, exponential and log-normal 12 13 1 1 2 After comprehensive analysis, it was determined that the log-logistic distribution was the most suitable fit for the observed survival curves.Survival and transition probabilities were directly obtained from the reconstructed survival curve during the follow-up period. Once the follow-up period was completed, the log-logistic distribution was used to estimate the survival rates and transition probabilities.The calculation of the survival function followed the equation S(t) = 1/(1 + λt γ 13 1  Table 1 The parameters of log-logistic distribution. Subgroup Group OS survival curve PFS survival curve shape (γ) scale (λ) shape (γ) scale (λ) PD-L1 CPS ≥ 5 Sugemalimab group 1.94 0.0048 2.03 0.016 Chemotherapy group 1.84 0.0095 2.11 0.025 PD-L1 CPS ≥ 10 Sugemalimab group 1.88 0.0049 2.01 0.014 Chemotherapy group 1.62 0.018 1.97 0.036 Costs and utility input parameters  According to our research perspective and the China guidelines for pharmacoeconomic evaluation (2020), the costs collected in this study primarily consist of direct medical costs. These costs include sugemalimab and chemotherapy drug costs, expenses associated with treatment-related adverse events(TEAE), costs for best supportive care, and follow-up care costs. Drug costs were obtained from China’s public data platform Yaozhi, with drug prices represented by the median bid prices of drugs in different provinces. To calculate the dose of chemotherapy drugs, assumptions were made regarding patient weight, with an average weight of 69.6 kg for males and 59.0 kg for females, and a body surface area of 1.72 m [2 14 Health-related quality of life is a crucial metric for assessing the impact of an individual’s health. It is typically quantified using utility values on a scale from 0 to 1, where 0 represents the worst health status and 1 represents the best health status. However, as utility values were not available from the GEMSTONE-303 Phase III trial, utility values sourced from literature are utilized in this analysis.The utility scores for PFS and PD in the analysis were determined to be 0.80 and 0.58, respectively, based on responses from the European Five Dimensions Health Scale (EQ-5D) questionnaire of the trastuzumab for gastric cancer(ToGA) trial 15 16 Sensitivity analyses will be conducted to rigorously assess the robustness and reliability of these input parameters. The cost and utility values utilized in this study are presented in Table 2  Table 2 The parameters input of the model. Parameters Baseline Range Distribution Source Value Minimum Maximum TEAE rate of sugemalimab group [No. (%)] Anaemia 26(10.79) – - Beta 8 Decreased White blood cell count 16(6.64) – – Beta 8 Decreased platelet count 10(4.15) – – Beta 8 Decreased neutrophil count 34(14.11) – – Beta 8 TEAE rate of Chemotherapy group [No. (%)] Anaemia 17(7.17) – – Beta 8 Decreased White blood cell count 7(2.95) – – Beta 8 Decreased platelet count 8(3.38) – – Beta 8 Decreased neutrophil count 34(14.35) – – Beta 8 Drug costs ($) Sugemalimab(600 mg) 1738.06 1390.45 2085.67 Gamma 17 Capecitabine(500 mg) 0.32 0.26 0.39 Gamma 17 Oxaliplatin(50 mg) 7.56 6.05 9.07 Gamma 17 Paclitaxel(30 mg) 7.54 6.03 9.05 Gamma 17 Cisplatin(10 mg) 1.31 1.05 1.57 Gamma 17 Cost of TEAE per cycle($) Anaemia 608.35 486.68 730.02 Gamma 18 Decreased White blood cell count 528.02 422.42 633.62 Gamma 18 Decreased platelet count 1054.22 843.38 1265.06 Gamma 19 Decreased neutrophil count 544.19 435.35 653.03 Gamma 19 Subsequenttherapy in per cycle ($) 184.44 147.55 221.33 Gamma 17 Best supportive care($) 248.00 198.40 297.60 Gamma 20 Follow-up cost per cycle($) 55.60 44.48 66.72 Gamma 20 Laboratory examinations per cycle 28.99 23.19 34.79 Gamma 21 Abdominal CT per cycle 289.73 231.78 347.68 Gamma 21 Utility Progression-free disease 0.80 0.64 0.96 Beta 15 Progressive disease 0.58 0.46 0.70 Beta 15 Anaemia 0.07 0.06 0.08 Beta 19 Decreased White blood cell count 0.11 0.09 0.13 Beta 19 Decreased platelet count 0.20 0.16 0.24 Beta 19 Decreased neutrophil count 0.10 0.08 0.12 Beta 19 Body surface area(m 2 1.72 1.38 2.06 Beta 20 Discount rate 5% 0 8% Beta 11 Sensitivity analysis In this study, the impact of each input parameter in the model on the incremental cost-effectiveness ratio (ICER) was assessed using both one-way sensitivity analysis and probabilistic sensitivity analysis (PSA). In the one-way sensitivity analysis, we varied each input parameter in the model by ± 20% to observe the effect of these variations on ICER.We used discount rate of 5% per year for analysis, and sensitivity analysis was performed on discount rate between 0% and 8%.The results of this analysis are represented by a tornado diagram. In the PSA, we applied monte carlo simulation technique for 10,000 iterations to synthesize the uncertainty of the parameters. By introducing probability distributions of the parameters in the simulation, the PSA is able to comprehensively assess the potential impact of the stochastic nature of the input parameters on the ICER. Specifically, the cost parameters are assumed to obey a gamma distribution, while the utility parameters are modeled using a beta distribution. The final results are presented through scatter plots. Results The results of base case In the group with PD-L1 CPS ≥ 5, the total cost for the sugemalimab regimen was $44,907.87, whereas the chemotherapy regimen cost $15,901.41. Treatment with sugemalimab resulted in an increase of 0.36 QALYs compared to chemotherapy, at an incremental cost of $29,006.46.The ICER for this subgroup was $80,573.50 per QALY gained. For the PD-L1 CPS ≥ 10 subgroup, the total cost for the sugemalimab group was $45,679.79, while the chemotherapy group incurred a cost of $14,753.96. Treatment with sugemalimab led to a substantial increase of 0.48 QALYs compared to chemotherapy, with an incremental cost of $30,925.83. The ICER for this subgroup was $64,428.81 per QALY gained. The calculated ICERs for both subgroups exceeded the WTP threshold of $40,343.68,indicating that the use of sugemalimab is not considered cost-effective from the perspective of the Chinese healthcare system. The results of the base case analysis are presented in Table 3  Table 3 The base case results. Subgroup Group Cost ($) QALYs Incremental cost ($) Incremental QALY ICER ($/QALY) PD-L1 CPS ≥ 5 Sugemalimab group 44,907.87 2.43 29,006.46 0.36 80,573.50 Chemotherapy group 15,901.41 2.07 – – – PD-L1 CPS ≥ 10 Sugemalimab group 45,679.79 2.41 30,925.83 0.48 64,428.81 Chemotherapy group 14,753.96 1.93 – – – The result of sensitivity analyses The results of the one-way sensitivity analysis are presented in Figs. 2 3  Fig. 2 The results of the one-way sensitivity analysis for the PD-L1 CPS ≥ 5 populations.  Fig. 3 The results of the one-way sensitivity analysis for the PD-L1 CPS ≥ 10 populations. The results of the PSA are represented in Figs. 4 5 4 5  Fig. 4 The results of the PSA for the PD-L1 CPS ≥ 5 populations.  Fig. 5 The results of the PSA for the PD-L1 CPS ≥ 10 populations. Discussion Gastric cancer is a highly aggressive malignancy and a leading cause of cancer-related mortality globally. The prevalence of Gastric cancer is particularly pronounced in Eastern Asia, with approximately half of all cases and deaths occurring in China 22 23 24 25 In this study, the group treated with sugemalimab demonstrated improvements in QALYs compared to the chemotherapy group in both the PD-L1 CPS ≥ 5 and PD-L1 CPS ≥ 10 subgroups. The ICERs for the PD-L1 CPS ≥ 5 and PD-L1 CPS ≥ 10 subgroups were $80,573.50 per QALY and $64,428.81 per QALY, respectively.Notably, the subgroup analysis revealed that the PD-L1 CPS ≥ 10 group had the lowest ICER. However, it is essential to highlight that even within this subgroup, the ICER remained above the WTP threshold. Therefore, based on the findings of this study, sugemalimab does not appear to be a cost-effective treatment option from the Chinese healthcare system. . Further sensitivity analysis also shows the robustness of our results. Our analysis has identified critical factors that influence the ICER in this study. Among these factors, the cost of sugemalimab emerges as a significant determinant of the ICER. A higher drug cost directly impacts the economic viability of the treatment, leading to higher ICER values. Furthermore, the utility values of progressive disease and progression-free disease also play a crucial role. These values reflect the preference or quality of life associated with different health states. Lower utility values for progressive disease or progression-free disease can lead to higher ICERs.However, sensitivity analyses revealed that even when various parameters and input variables were adjusted within a range of ± 20%, the resulting ICER values consistently exceeded the WTP threshold of $40,343.68. This stability in ICER outcomes suggests that manipulating these parameters did not yield substantial changes in the cost-effectiveness of the intervention, reinforcing the conclusions drawn from the base case analysis. While our study does not show cost-effectiveness of sugemalimab compared to current treatments, it is important to note that cost-effectiveness analysis should not be used as a basis for limiting access to sugemalimab. Sugemalimab has demonstrated clinical efficacy as a treatment for cancer.Therefore, decisions regarding the administration of sugemalimab should not be limited by economic considerations alone.We recommend utilizing the findings of our cost-effectiveness analyses to guide policy decisions and leveraging the results of our studies to investigate strategies for enhancing the economic viability and accessibility of sugemalimab. In the one-way sensitivity analysis, it was found that when the price of sugemalimab was reduced by 40% to $1,042.84 per 600 mg, the ICER of $41,000.04 per QALY was obtained in the PD-L1 CPS ≥ 10 subgroup. Notably, this ICER value is close to the WTP threshold of $40,343.68 per QALY. With this price reduction, PSA found that at a WTP threshold of $40,343.68 per QALY, sugemalimab had a 48% probability of being a more cost-effective option than chemotherapy in the PD-L1 CPS ≥ 10 subgroup.These findings suggest that by lowering the price, sugemalimab may become an attractive treatment option in specific patient subgroups, leading to better cost-effectiveness. Moreover, our study also observed that the ICER values were lower in the PD-L1 CPS ≥ 10 subgroup as compared to the PD-L1 CPS ≥ 1 subgroup. This finding underscores the potential value of exploring biomarkers that can accurately predict response to sugemalimab treatment, thereby facilitating personalized therapeutic approaches for patients. The significance of baseline PD-L1 expression in predicting treatment response to anti-PD-1 and anti-PD-L1 therapies is widely recognized 26 27 There were some studies have explored the cost-effectiveness of sugemalimab in conjunction with chemotherapy for the treatment of cancers. For instance, Tang et al. conducted a study to evaluate the cost-effectiveness of sugemalimab combination therapy for advanced gastric cancer 28 29 30 31 32 There are several limitations to this study.Firstly, as part of the partitioned survival model model development process, it is essential to apply statistical distribution fitting methods to the survival data in order to extrapolate survival outcomes beyond the time frame of the original clinical trial. If the fitting function is not chosen judiciously or if the data itself is heterogeneous, the extrapolated results may diverge from the actual survival trajectory, particularly in long-term survival projections where errors could be magnified 33 34 Conclusion The addition of sugemalimab to standard treatment regimens was found to not be a highly cost-effective strategy for first-line therapy in advanced gastric cancer. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions Xiaojie Lin and Zhiwei Zheng drafted the manuscript. Huide Zhu collected the data. Zhiwei Zheng operated the software. Zhiwei Zheng reviewed the manuscript and approved it for submission. Finally, all authors thoroughly evaluated and consented to the final rendition of the manuscript. Funding This study was funded by the medical science research project of Beijing Medical Health Foundation (YWJKJJHKYJJ-LCYX25002). Data availability The data used in this research can be provided upon reasonable request to the corresponding author for academic purposes. Declarations Competing interests The authors declare no competing interests. Ethics approval This study does not involve the use of human or animal. Ethical considerations are not applicable to this study. References 1. International Agency for Research on Cancer.Stomach fact sheet. Accessed 28 April 2025. (2022). https://gco.iarc.who.int/media/globocan/factsheets/cancers/7-stomachfact-sheet.pdf 2. Bray F Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 3 229 263 10.3322/caac.21834 38572751 Bray, F. et al. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J. Clin. 74 38572751 10.3322/caac.21834 3. Han B Cancer incidence and mortality in china, 2022 J. Natl. Cancer Cent. 2024 4 1 47 53 10.1016/j.jncc.2024.01.006 39036382 PMC11256708 Han, B. et al. Cancer incidence and mortality in China. J. Natl. Cancer Cent. 4 39036382 10.1016/j.jncc.2024.01.006 PMC11256708 4. Wang FH The Chinese society of clinical oncology (CSCO): clinical guidelines for the diagnosis and treatment of gastric cancer, 2023 Cancer Commun. (Lond) 2024 44 1 127 172 10.1002/cac2.12516 38160327 PMC10794017 Wang, F. H. et al. The Chinese society of clinical oncology (CSCO): Clinical guidelines for the diagnosis and treatment of gastric cancer, 2023. Cancer Commun. (Lond) 44 38160327 10.1002/cac2.12516 PMC10794017 5. Wu YX Application of immune checkpoint inhibitors in immunotherapy for gastric cancer Immunotherapy 2023 15 2 101 115 10.2217/imt-2022-0080 36597704 Wu, Y. X. et al. Application of immune checkpoint inhibitors in immunotherapy for gastric cancer. Immunotherapy 15 36597704 10.2217/imt-2022-0080 6. Rha SY Pembrolizumab plus chemotherapy versus placebo plus chemotherapy for HER2-negative advanced gastric cancer (KEYNOTE-859): a multicentre, randomised, double-blind, phase 3 trial Lancet Oncol. 2023 24 11 1181 1195 10.1016/S1470-2045(23)00515-6 37875143 Rha, S. Y. et al. Pembrolizumab plus chemotherapy versus placebo plus chemotherapy for HER2-negative advanced gastric cancer (KEYNOTE-859): A multicentre, randomised, double-blind, phase 3 trial. Lancet Oncol. 24 37875143 10.1016/S1470-2045(23)00515-6 7. Janjigian YY First-line nivolumab plus chemotherapy versus chemotherapy alone for advanced gastric, gastro-oesophageal junction, and oesophageal adenocarcinoma (CheckMate 649): a randomised, open-label, phase 3 trial Lancet 2021 398 10294 27 40 10.1016/S0140-6736(21)00797-2 34102137 PMC8436782 Janjigian, Y. Y. et al. First-line nivolumab plus chemotherapy versus chemotherapy alone for advanced gastric, gastro-oesophageal junction, and oesophageal adenocarcinoma (CheckMate 649): A randomised, open-label, phase 3 trial. Lancet 398 34102137 10.1016/S0140-6736(21)00797-2 PMC8436782 8. Zhang X First-Line Sugemalimab plus chemotherapy for advanced gastric cancer: the GEMSTONE-303 randomized clinical trial JAMA 2025 333 15 1305 1314 10.1001/jama.2024.28463 39992668 PMC11851304 Zhang, X. et al. First-Line Sugemalimab plus chemotherapy for advanced gastric cancer: The GEMSTONE-303 randomized clinical trial. JAMA 333 39992668 10.1001/jama.2024.28463 PMC11851304 9. Michelly Gonçalves Brandão S Brunner-La Rocca HP Pedroso de Lima AC Alcides Bocchi E A review of cost-effectiveness analysis: from theory to clinical practice Med. (Baltim). 2023 102 42 e35614 10.1097/MD.0000000000035614 PMC10589545 37861539 Michelly Gonçalves Brandão, S., Brunner-La Rocca, H. P., Pedroso de Lima, A. C. & Alcides Bocchi, E. A review of cost-effectiveness analysis: From theory to clinical practice. Med. (Baltim). 102 10.1097/MD.0000000000035614 PMC10589545 37861539 10. National Bureau of statistic. (2024). https://data.stats.gov.cn/english/easyquery.htm?cn=C01 11. Liu, G. et al. The China Guidelines for Phaumacoeconomic Evaluation (2020 English Edition) 12. Williams C Lewsey JD Mackay DF Briggs AH Estimation of survival probabilities for use in Cost-effectiveness analyses: A comparison of a Multi-state modeling survival analysis approach with partitioned survival and Markov Decision-Analytic modeling Med. Decis. Mak. 2017 37 4 427 439 10.1177/0272989X16670617 PMC5424853 27698003 Williams, C., Lewsey, J. D., Mackay, D. F. & Briggs, A. H. Estimation of survival probabilities for use in cost-effectiveness analyses: A comparison of a Multi-state modeling survival analysis approach with partitioned survival and Markov Decision-Analytic modeling. Med. Decis. Mak. 37 10.1177/0272989X16670617 PMC5424853 27698003 13. Diaby V Adunlin G Montero AJ Survival modeling for the Estimation of transition probabilities in model-based economic evaluations in the absence of individual patient data: a tutorial Pharmacoeconomics 2014 32 2 101 108 10.1007/s40273-013-0123-9 24338265 Diaby, V., Adunlin, G. & Montero, A. J. Survival modeling for the Estimation of transition probabilities in model-based economic evaluations in the absence of individual patient data: A tutorial. Pharmacoeconomics 32 24338265 10.1007/s40273-013-0123-9 14. Central People’s Government of the People’s Republic of China. The State Council Office of the People’s Republic of China held a press conference on the Report on the Nutrition and Chronic Disease Status of Chinese Residents (2020). Accessed on April 28, (2025). https://www.gov.cn/xinwen/2020-12/23/content_5572785.htm 15. Tsuchiya A Estimating an EQ-5D population value set: the case of Japan Health Econ. 2002 11 341 353 12007165 10.1002/hec.673 Tsuchiya, A. et al. Estimating an EQ-5D population value set: The case of Japan. Health Econ. 11 12007165 10.1002/hec.673 16. Bang YJ Trastuzumab in combination with chemotherapy versus chemotherapy alone for treatment of HER2-positive advanced gastric or gastro-oesophageal junction cancer (ToGA): a phase 3, open-label, randomised controlled trial Lancet 2010 376 687 697 20728210 10.1016/S0140-6736(10)61121-X Bang, Y. J. et al. Trastuzumab in combination with chemotherapy versus chemotherapy alone for treatment of HER2-positive advanced gastric or gastro-oesophageal junction cancer (ToGA): A phase 3, open-label, randomised controlled trial. Lancet 376 20728210 10.1016/S0140-6736(10)61121-X 17. YaoZH. Drug Pice. (2025). Available at: https://data.yaozh.com/ 18. Lang Y Lin Y Li D Liu J Liu X Pembrolizumab alone or in combination with chemotherapy versus chemotherapy for advanced gastric cancer: A cost-effectiveness analysis Cancer Med. 2023 12 18 18447 18459 10.1002/cam4.6389 37706223 PMC10557869 Lang, Y., Lin, Y., Li, D., Liu, J. & Liu, X. Pembrolizumab alone or in combination with chemotherapy versus chemotherapy for advanced gastric cancer: A cost-effectiveness analysis. Cancer Med. 12 37706223 10.1002/cam4.6389 PMC10557869 19. Lang W Cost-effectiveness analysis of Tislelizumab plus chemotherapy versus placebo plus chemotherapy as first-line treatment for advanced gastric or gastroesophageal junction adenocarcinoma: perspectives from the united States and China Front. Pharmacol. 2024 15 1461571 10.3389/fphar.2024.1461571 39635432 PMC11614636 Lang, W. et al. Cost-effectiveness analysis of Tislelizumab plus chemotherapy versus placebo plus chemotherapy as first-line treatment for advanced gastric or gastroesophageal junction adenocarcinoma: Perspectives from the united States and China. Front. Pharmacol. 15 39635432 10.3389/fphar.2024.1461571 PMC11614636 20. Zheng Z Song X Cai H Zhu H Pembrolizumab combined with chemotherapy versus placebo combined with chemotherapy for HER2-negative advanced gastric cancer in china: a cost-effectiveness analysis Expert Rev. Pharmacoecon Outcomes Res. 2024 24 8 1017 1025 10.1080/14737167.2024.2378986 38979829 Zheng, Z., Song, X., Cai, H. & Zhu, H. Pembrolizumab combined with chemotherapy versus placebo combined with chemotherapy for HER2-negative advanced gastric cancer in China: A cost-effectiveness analysis. Expert Rev. Pharmacoecon Outcomes Res. 24 38979829 10.1080/14737167.2024.2378986 21. Zhang PF Shi XQ Li Q Nivolumab plus chemotherapy versus chemotherapy alone as first-line treatment for advanced gastric, gastroesophageal junction, and esophageal adenocarcinoma: a cost-effectiveness analysis Cost Eff. Resour. Alloc 2023 21 1 65 10.1186/s12962-023-00476-2 37705023 PMC10500934 Zhang, P. F., Shi, X. Q. & Li, Q. Nivolumab plus chemotherapy versus chemotherapy alone as first-line treatment for advanced gastric, gastroesophageal junction, and esophageal adenocarcinoma: A cost-effectiveness analysis. Cost Eff. Resour. Alloc 21 37705023 10.1186/s12962-023-00476-2 PMC10500934 22. Nie Y A global burden of gastric cancer: the major impact of China Expert Rev. Gastroenterol. Hepatol. 2017 11 7 651 661 10.1080/17474124.2017.1312342 28351219 Nie, Y. et al. A global burden of gastric cancer: The major impact of China. Expert Rev. Gastroenterol. Hepatol. 11 28351219 10.1080/17474124.2017.1312342 23. American Cancer Society [https://www.cancer.org/cancer/stomach-cancer/detection-diagnosis-staging/ survival-rates.html] Date Accessed April 28 24. Casamayor M Morlock R Maeda H Ajani J Targeted literature review of the global burden of gastric cancer Ecancermedicalscience 2018 12 883 10.3332/ecancer.2018.883 30679950 PMC6345079 Casamayor, M., Morlock, R., Maeda, H. & Ajani, J. Targeted literature review of the global burden of gastric cancer. Ecancermedicalscience 12 30679950 10.3332/ecancer.2018.883 PMC6345079 25. Baio G Russo P A decision-theoretic framework for the application of cost-effectiveness analysis in regulatory processes Pharmacoeconomics 2009 27 8 645 655 10.2165/11310250-000000000-00000 19712008 Baio, G. & Russo, P. A decision-theoretic framework for the application of cost-effectiveness analysis in regulatory processes. Pharmacoeconomics 27 19712008 10.2165/11310250-000000000-00000 26. Xu Y The association of PD-L1 expression with the efficacy of anti-PD-1/PD-L1 immunotherapy and survival of non-small cell lung cancer patients: a meta-analysis of randomized controlled trials Transl Lung Cancer Res. 2019 8 4 413 428 10.21037/tlcr.2019.08.09 31555516 PMC6749123 Xu, Y. et al. The association of PD-L1 expression with the efficacy of anti-PD-1/PD-L1 immunotherapy and survival of non-small cell lung cancer patients: A meta-analysis of randomized controlled trials. Transl Lung Cancer Res. 8 31555516 10.21037/tlcr.2019.08.09 PMC6749123 27. Yang Y The predictive value of PD-L1 expression in patients with advanced hepatocellular carcinoma treated with PD-1/PD-L1 inhibitors: A systematic review and meta-analysis Cancer Med. 2023 12 8 9282 9292 10.1002/cam4.5676 36965092 PMC10166972 Yang, Y. et al. The predictive value of PD-L1 expression in patients with advanced hepatocellular carcinoma treated with PD-1/PD-L1 inhibitors: A systematic review and meta-analysis. Cancer Med. 12 36965092 10.1002/cam4.5676 PMC10166972 28. Tang L Zhu L Zhan S Chen Y Feng PF Cost-effectiveness analysis of Sugemalimab combined with chemotherapy as first-line treatment for advanced gastric cancer Front. Public. Health 2025 13 1620663 40823252 10.3389/fpubh.2025.1620663 PMC12350318 Tang, L., Zhu, L., Zhan, S., Chen, Y. & Feng, P. F. Cost-effectiveness analysis of Sugemalimab combined with chemotherapy as first-line treatment for advanced gastric cancer. Front. Public. Health 13 40823252 10.3389/fpubh.2025.1620663 PMC12350318 29. Cheng R Zhou Z Liu Q The Cost-Effectiveness of Sugemalimab plus chemotherapy as First-Line treatment for metastatic squamous and Non-squamous NSCLC in China Adv. Ther. 2023 40 10 4298 4309 10.1007/s12325-023-02594-y 37453992 Cheng, R., Zhou, Z. & Liu, Q. The cost-effectiveness of sugemalimab plus chemotherapy as first-line treatment for metastatic squamous and non-squamous NSCLC in China. Adv. Ther. 40 37453992 10.1007/s12325-023-02594-y 30. Cai H Fang L Zheng Z Sugemalimab combined with chemotherapy for the treatment of advanced esophageal squamous cell carcinoma: a cost-effectiveness analysis Front. Pharmacol. 2024 15 1396761 10.3389/fphar.2024.1396761 39005941 PMC11239512 Cai, H., Fang, L. & Zheng, Z. Sugemalimab combined with chemotherapy for the treatment of advanced esophageal squamous cell carcinoma: A cost-effectiveness analysis. Front. Pharmacol. 15 39005941 10.3389/fphar.2024.1396761 PMC11239512 31. Cao X First-line nivolumab plus chemotherapy versus chemotherapy alone for advanced gastric cancer, gastroesophageal junction cancer, and esophageal adenocarcinoma: a cost-effectiveness analysis Ther. Adv. Med. Oncol. 2023 15 17588359231171038 10.1177/17588359231171038 37223263 PMC10201153 Cao, X. et al. First-line nivolumab plus chemotherapy versus chemotherapy alone for advanced gastric cancer, gastroesophageal junction cancer, and esophageal adenocarcinoma: A cost-effectiveness analysis. Ther. Adv. Med. Oncol. 15 37223263 10.1177/17588359231171038 PMC10201153 32. Lang W Deng L Lu M Ouyang M Cost-effectiveness analysis of pembrolizumab plus chemotherapy versus placebo plus chemotherapy for HER2-negative advanced gastric/gastroesophageal junction cancer in the Chinese healthcare system Expert Rev. Pharmacoecon Outcomes Res. 2024 24 8 1027 1042 10.1080/14737167.2024.2378983 38979910 Lang, W., Deng, L., Lu, M. & Ouyang, M. Cost-effectiveness analysis of pembrolizumab plus chemotherapy versus placebo plus chemotherapy for HER2-negative advanced gastric/gastroesophageal junction cancer in the Chinese healthcare system. Expert Rev. Pharmacoecon Outcomes Res. 24 38979910 10.1080/14737167.2024.2378983 33. Woods BS Sideris E Palmer S Latimer N Soares M Partitioned survival and state transition models for healthcare decision making in oncology: where are we now Value Health 2020 23 1613 1621 33248517 10.1016/j.jval.2020.08.2094 Woods, B. S., Sideris, E., Palmer, S., Latimer, N. & Soares, M. Partitioned survival and state transition models for healthcare decision making in oncology: Where are we now. Value Health 23 33248517 10.1016/j.jval.2020.08.2094 34. Mudumba R Nieva JJ Padula WV First-Line alectinib, brigatinib, and lorlatinib for advanced anaplastic lymphoma Kinase-Positive Non-Small cell lung cancer: A Cost-Effectiveness analysis Value Health 2025 28 1018 1028 40222406 10.1016/j.jval.2025.03.014 Mudumba, R., Nieva, J. J. & Padula, W. V. First-Line alectinib, brigatinib, and lorlatinib for advanced anaplastic lymphoma kinase-positive non-small cell lung cancer: A cost-effectiveness analysis. Value Health 28 40222406 10.1016/j.jval.2025.03.014 ",
  "metadata": {
    "Title of this paper": "First-Line alectinib, brigatinib, and lorlatinib for advanced anaplastic lymphoma Kinase-Positive Non-Small cell lung cancer: A Cost-Effectiveness analysis",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480027/"
  }
}