{
  "title": "Paper_1010",
  "abstract": "Am J Pathol Am J Pathol 319 nihpa The American journal of pathology 0002-9440 1525-2191 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12405924 PMC12405924.2 12405924 12476592 NIHMS2107101 40316215 10.1016/j.ajpath.2025.04.010 NIHMS2107101 NIHPA2107101 2 Article Phosphatidylinositol 3-Kinase Signaling Enhances Intestinal Crypt Epithelial Cell Recovery after Radiation Lynch Evan B. * † ‡ Kapur Neeraj ‡ § Goretsky Tatiana ‡ § Bradford Emily M. ‡ § Vekaria Hemendra § ¶ Bhogoju Sarayu ‡ Hassan Syed A. ‡ § Pauw Emily ‖ Avdiushko Margarita G. ‡ § Lee Goo ** Gao Tianyan †† Sullivan Patrick G. § ¶ Barrett Terrence A. ‡ § * ¶ †† † ‡ ‖ § ** E.B.L. and N.K. contributed equally to this work. Portions of this work contributed to the doctoral dissertation of E.B.L. Author Contributions E.B.L., T.Go., and N.K. acquired, compiled, interpreted, and analyzed the data, and wrote the manuscript with assistance from E.M.B.; T.Ga. and T.A.B. obtained funding, conceptualized and designed the study, and edited the manuscript; H.V. and P.G.S. generated and compiled the mitochondrial data; S.B. and T.Go. performed Western blots and densitometry analysis; E.P. processed the tissue; S.A.H., N.K., S.B., and G.L. performed the histologic analysis; and M.G.A. performed animal husbandry and provided administrative support. Address correspondence to Terrence A. Barrett, M.D., Division of Digestive Diseases and Nutrition, Department of Internal Medicine, University of Kentucky, 800 Rose St., Lexington, KY 40536. t.barrett@uky.edu 8 2025 30 4 2025 195 8 497723 1411 1427 07 09 2025 28 09 2025 29 09 2025 29 09 2025 12405924 10.1016/j.ajpath.2025.04.010 1 30 04 2025 30 04 2026 12476592 10.1016/j.ajpath.2025.04.010 NIHMS2107101 2 30 04 2025 Intestinal stem cell (ISC) signaling maintains the balance of self-renewal and differentiation. Herein, the role of phosphatidylinositol 3-kinase (PI3K) signaling in ISC responses to radiation was interrogated using Villin-Cre pik3r1 lox/lox ΔIEC ΔIEC Ser473 Ser552 In situ Lgr5 + Axin2 + ASCL2 HES1 ATOH1 MATH1 GFI1 SPDEF Δp85 Graphical Abstract  pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Phosphatidylinositol 3-Kinase Signaling Enhances Intestinal Crypt Epithelial Cell Recovery after Radiation",
    "Journal it was published in:": "The American journal of pathology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12405924/"
  }
}