{
  "title": "Paper_830",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12478981 PMC12478981.1 12478981 12478981 41030506 10.7759/cureus.93427 1 Radiology Oncology Pulmonology PET/CT vs PET/MRI in Lung Cancer: A Narrative Review of Diagnostic Performance, Practical Trade-offs, and Clinical Impact Muacevic Alexander Adler John R Tomalieh Basel T 1 Torres Luna Jessica D 2 Murugesan Karthika 3 Kabir Areeba 4 Rebellow Delvy 5 6 Kasagga Alousious 7 Anwar Summayya 8 9  1  2  3  4  5  6  7  8  9 Basel T. Tomalieh btomalieh@gmail.com 28 9 2025 9 2025 17 9 495976 e93427 28 9 2025 28 09 2025 30 09 2025 01 10 2025 Copyright © 2025, Tomalieh et al. 2025 Tomalieh et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/413346-petct-vs-petmri-in-lung-cancer-a-narrative-review-of-diagnostic-performance-practical-trade-offs-and-clinical-impact Lung cancer remains the leading cause of cancer death worldwide. Accurate initial staging is central to treatment selection and prognosis. Hybrid imaging with 18 In NSCLC, PET-MRI achieves overall staging performance comparable to PET-CT and improves confidence for pleural, chest-wall and mediastinal invasion, particularly when diffusion-weighted imaging (DWI) and cine/free-breathing radial T1-weighted MRI at 3 T (a higher-field MRI strength than 1.5 T). PET-CT retains an advantage for sub-centimetre and subsolid pulmonary nodules; MRI-led pathways should therefore mandate a contemporaneous thin-slice diagnostic chest CT when such nodules could change intent. Nodal staging is broadly similar between hybrids; where results would alter management, selective invasive confirmation remains appropriate, with combined endobronchial and endoscopic ultrasound (EBUS-EUS) improving the sampling efficiency. For distant disease, PET-CT is an efficient whole-body screen at baseline, while PET-MRI adds value for brain and liver problem-solving. In SCLC, a prospective cohort reported higher T-category and overall TNM accuracy with whole-body MRI and coregistered PET-MRI than with PET-CT. Quantitatively, standardised uptake values (SUVs) correlate between platforms but are not interchangeable; centres should harmonise using European Association of Nuclear Medicine Research Ltd (EARL) and Quantitative Imaging Biomarkers Alliance (QIBA) guidance and document MRI attenuation-correction choices (e.g., Dixon vs ultrashort/zero echo time (UTE/ZTE)). Operationally, PET-MRI reduces anatomic radiation but typically requires longer slots and specialised workflow; PET-CT is faster, widely available, and linked to fewer futile thoracotomies and favourable cost-effectiveness. Overall, PET-CT should remain the default hybrid, with PET-MRI deployed selectively, particularly for complex local invasion, integrated brain-to-body staging, or dose reduction, while safeguarding small-nodule detection. Priorities include multicentre trials with harmonised protocols, management-impact endpoints, and explicit rules for integrating chest CT into MRI-led pathways. lung cancer staging non-small cell lung carcinoma (nsclc) pet ct scan pet mri small cell lung cancer (sclc) whole-body mri pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction and background Lung cancer is the leading cause of cancer death worldwide. In 2020, there were approximately 2.2 million new lung cancer cases (Figure 1 1 2 3 4 British Medical Journal 5 Figure 1 Global lung cancer incidence and mortality in 2020 (millions): GLOBOCAN estimate Source: Ref. [ 1 For the last two decades, 18 6 7 3 4 PET-CT still has limits. The CT part adds ionising radiation; soft-tissue contrast can be modest for questions such as chest-wall or mediastinal invasion and for liver or marrow assessment; and small brain metastases usually need a dedicated brain MRI [ 4 8 8 9 10 Head-to-head studies in non-small cell lung cancer (NSCLC) report that PET-MRI achieves overall staging performance similar to PET-CT, and MRI-based protocols can improve assessment of local soft-tissue invasion at the pleura, chest wall and mediastinum [ 11 15 16 17 18 This review compares PET-CT and PET-MRI in lung cancer. We focus on diagnostic performance across T, N and M categories, practical trade-offs (radiation, protocol design, scan duration and availability), and what these findings mean for multidisciplinary decisions. We place results in the context of UK guidance and international consensus, and we rely on prospective head-to-head studies in NSCLC and SCLC to show where PET-MRI can complement or, in selected settings, substitute for PET-CT without loss of diagnostic quality [ 3 9 11 18 Review Summary of evidence and scope PET-CT and PET-MRI are central imaging options for lung cancer staging. PET-CT remains the guideline standard, while PET-MRI offers higher soft-tissue contrast with lower anatomic radiation dose, supported by consensus recommendations [ 3 4 8 9 11 15 16 17 18 T-staging: local tumour extent and soft-tissue planes Prospective NSCLC comparisons show that PET-MRI matches PET-CT overall and can improve confidence when assessing pleural, chest-wall, or mediastinal invasion. Studies by Huellner et al., Lee et al., Heusch et al., and Kirchner et al. reported broadly similar patient-level TNM accuracy, with MRI-containing protocols often helping at T3-T4 thresholds where tissue planes matter [ 11 14 American Journal of Roentgenology 15 19 The SCLC cohort showed the same direction of effect for local staging. Whole-body MRI and coregistered PET-MRI achieved 94.9% accuracy for T, higher than PET-CT (85.7%), and this carried through to overall TNM accuracy (88.8% and 86.7% vs 77.6%) [ 18 18 3 4 Beyond aggregate accuracy, protocol-dependent MRI techniques sharpen T-category assessment at key interfaces. Contemporary thoracic PET-MRI protocols using diffusion-weighted imaging, dynamic contrast and cine or free-breathing radial T1, often at 3 T, can reduce equivocal calls for visceral pleural and chest-wall invasion, with the greatest gains when T3-T4 thresholds hinge on tissue planes [ 20 21 20 22 22 N-staging: mediastinal and hilar nodes Because FDG uptake drives a large part of nodal assessment in both hybrids, prospective NSCLC studies usually show similar N-staging performance for PET-MRI and PET-CT when appropriate reference standards are used [ 11 14 23 24 26 3 27 28 29 30 31 Taken together, nodal performance is modality-balanced between PET-MRI and PET-CT when robust reference standards are used, but management-level specificity is best preserved by a strategy that channels PET-positive or equivocal stations to targeted EBUS+EUS rather than routine systematic sampling [ 23 29 31 M-staging: brain, liver, bone and adrenal MRI performs well in the brain, liver and bone marrow, where soft-tissue contrast and diffusion-weighted imaging aid detection and characterisation. For the brain, dedicated MRI remains the reference standard for detecting micrometastases and for treatment planning, outperforming CT-based components in hybrid protocols [ 32 33 11 12 15 34 A meta-analysis across malignancies likewise suggests comparable or improved detection of distant disease with PET-MRI relative to PET-CT in appropriate contexts [ 35 36 18 32 33 36 Outside lung cancer, multiple cohorts report that PET-MRI can improve soft-tissue lesion conspicuity and inform management in the head and neck, gynaecologic, colorectal, breast, and for intracranial masses [ 37 41 42 43 Detecting small pulmonary nodules A consistent limitation of thoracic MRI is reduced visibility for sub-centimetre nodules. Paired studies show nodules visible on CT or PET-CT but not on MRI or PET-MRI; a minority later prove malignant and can affect staging. Sawicki and colleagues reported outcomes of nodules missed on PET-MRI that were seen on PET-CT, quantifying the small but relevant risk of upstaging from very small lesions [ 16 44 17 45 3 4 16 17 44 45 Quantitative metrics and technical factors Standardised uptake value (SUV) measurements on PET-MRI and PET-CT correlate well, but they are not interchangeable. Differences in MRI-based attenuation correction (AC), scatter modelling, timing and time-of-flight (TOF)/point-spread function (PSF) availability can cause small but systematic offsets, so PET-CT cut-offs should not be applied directly to PET-MRI without local validation [ 11 14 46 47 48 49 50 51 12 15 18 In practice, ensuring transportable SUVs requires harmonised acquisition and reconstruction (EARL) and adherence to quantitative profiles (QIBA) so that thresholds and longitudinal changes are interpretable across platforms and time [ 48 49 51 Radiation, workflow and patient experience Replacing CT with MRI removes the anatomic CT dose, which is helpful for younger patients and those needing repeated restaging. Consensus and review articles highlight this advantage but also point to longer acquisition times and more complex workflows that can affect throughput and access [ 8 9 47 52 18 Impact on clinical management The strong role of PET-CT in lung cancer rests on outcomes as well as accuracy. A landmark randomised trial showed that adding PET-CT to conventional preoperative staging reduced futile thoracotomies, establishing PET-CT as standard practice for surgical candidates [ 7 6 53 54 52 3 4 27 28 Patient subgroups and practical use A tailored approach is sensible. PET-CT should remain the default hybrid in most NSCLC pathways because it is widely available, fast, and backed by management and economic evidence [ 3 4 6 7 3 4 8 13 18 44 45 Table 1 Hybrid PET Imaging and Clinical Implications for Lung Cancer Staging - Study Designs, Key Findings, and Practice Takeaways PET: Positron emission tomography; CT: computed tomography; MRI: magnetic resonance imaging; PET/CT: PET with CT; PET/MRI: PET with MRI; WB-MRI: whole-body MRI; NSCLC: non-small cell lung cancer; SCLC: small cell lung cancer; TNM: tumour-node-metastasis; DWI: diffusion-weighted imaging; SUV: standardised uptake value; AC: attenuation correction; MDT: multidisciplinary team; EBUS/EUS: endobronchial/endoscopic ultrasound. Clinical Question Study (Reference) Design & Comparison Main Finding Practical Takeaway Overall NSCLC staging: PET/MRI vs PET/CT Huellner et al. 2016 [ 11 Prospective head-to-head NSCLC; PET/MRI vs PET/CT Comparable overall TNM staging performance PET/MRI can substitute for PET/CT where protocols and expertise are robust  Lee et al. 2016 [ 12 Prospective pre-op NSCLC; PET/MRI vs PET/CT Similar staging performance; MRI helpful for local invasion in selected cases Consider PET/MRI when local invasion detail is pivotal pre-op  Heusch et al. 2014 [ 13 Prospective NSCLC; PET/MRI vs PET/CT Similar thoracic staging performance Either hybrid acceptable for thoracic staging  Kirchner et al. 2019 [ 14 Prospective NSCLC; PET/MRI vs PET/CT Comparable T/N/M accuracy Supports practical interchangeability Local invasion (T3–T4 interfaces) Ohno et al. 2020 AJR (three-way) [ 15 WB-MRI & coreg PET/MRI (1.5/3T) vs PET/CT MRI-containing pathways ≥ comparable overall; better depiction of complex soft-tissue invasion in selected cases Use MRI-containing protocols when pleura/chest-wall/mediastinal planes determine resectability  Ohno et al. 2019 AJR (MPM) [ 19 Mesothelioma; WB-MRI/PET-MRI vs PET/CT MRI better captures pleural/chest-wall extent Cross-thoracic signal reinforces MRI’s soft-tissue edge  Ohno et al. 2023 [ 20 State-of-the-art MR review for lung cancer TNM Protocol-dependent gains for pleural/chest-wall/mediastinal invasion (DWI, cine, 3 T) Optimise MRI sequences/field strength when T3–T4 thresholds hinge on tissue planes  Zhang et al. 2021 (KJR) [ 21 CT vs contrast-enhanced radial T1 3-T MRI for VPI assessment. Improved characterisation of visceral pleural/chest-wall invasion with radial/cine MRI Use targeted MRI when VPI or chest-wall abutment is equivocal SCLC initial staging Ohno et al. 2022 AJR [ 18 Prospective; conventional tests vs PET/CT vs WB-MRI vs coreg PET/MRI WB-MRI & PET/MRI higher T and overall TNM accuracy than PET/CT; all advanced tests > conventional Integrate MRI at baseline SCLC staging to optimise T and TNM Nodal staging Ceylan et al. 2012 [ 26 Contrast-enhanced CT vs PET/CT (pre-op NSCLC) PET/CT superior to contrast-enhanced CT for N staging PET/CT remains backbone for mediastinum; confirm invasively if management changes  Darling et al. 2011 (ELPET) [ 27 PET/CT vs invasive mediastinal staging PET/CT improves over CT alone but does not obviate invasive confirmation Combine PET/CT with EBUS/EUS when results alter intent  Zhang et al. 2024 [ 23 NSCLC; PET/MRI vs PET/CT for nodal metastasis PET/MRI ≈ PET/CT for N staging on pooled analysis Supports modality balance; choose based on logistics/expertise  Liu et al. 2022 (Front Med) [ 29 Systematic review/meta-analysis of combined EBUS+EUS Combined endosonography > either alone for mediastinal staging Target PET-positive/equivocal stations for selective invasive confirmation  Hockmann et al. 2023 (SCLC) [ 31 Limited-disease SCLC; PET/CT nodal staging accuracy Useful but imperfect mediastinal N staging; sampling still needed when results change fields Retain selective invasive nodal confirmation in SCLC pathways Distant metastases (brain/liver/bone) Sommer et al. 2012 [ 34 WB-DWI-MRI vs PET/CT (pre-op NSCLC) Comparable pre-op staging; potential advantages at soft-tissue sites MRI-containing protocols helpful where liver/marrow detail matters  Zhang et al. 2023 [ 35 Mixed-oncology PET/MRI vs PET/CT Comparable or improved distant-met detection context-dependently PET/MRI acceptable for M-staging in selected settings  Derks et al. 2022 (Br J Radiol) [ 32 Review of brain metastasis imaging MRI is reference standard for micrometastases and planning Use dedicated brain MRI/MRI-led pathways when brain disease is plausible  Maino et al. 2023 (World J Radiol) [ 33 Review of liver metastasis imaging MRI (DWI ± hepatobiliary contrast) improves sub-cm detection and reduces indeterminates Leverage MRI for liver problem-solving within hybrid pathways  Yu et al. 2018 (Cancer Manag Res) [ 36 NSCLC meta-analysis of PET/CT for distant metastases High whole-body performance (AUC ≈ 0.97; high specificity) Keep PET/CT as default rapid whole-body screen at baseline Small pulmonary nodules Sawicki et al. 2016 (outcomes) [ 16 Nodules missed on PET/MRI vs seen on PET/CT A minority of missed sub-cm nodules were malignant → occasional upstaging If sub-cm disease could change intent, add/review diagnostic chest CT with PET/MRI  Sawicki et al. 2016 (detection) [ 44 PET/MRI vs PET/CT CT better for small parenchymal nodules Protect small-nodule sensitivity with CT  Stolzmann et al. 2013 [ 17 Trimodality PET/CT-MR: low-dose CT vs Dixon-MR Low-dose CT detects more and smaller nodules than MR Do not rely on MR alone for micro-nodules  Rauscher et al. 2014 [ 45 PET/MR vs PET/CT (pulmonary lesions) Confirms CT’s edge for tiny nodules; technical notes Pair PET/MRI with recent chest CT when relevant Quantitation (SUVs) Al-Nabhani et al. 2014 [ 46 Clinical PET/CT vs PET/MR (qual/quant) SUVs correlate but are not interchangeable Avoid copying PET/CT cut-offs to PET/MR without local validation  Drzezga et al. 2012 [ 47 Early integrated PET/MR vs PET/CT Broad comparability; early quantitation caveats Anticipate small systematic SUV offsets  Aide et al. 2017 (EANM EARL) [ 48 Quantification harmonisation framework Standardises acquisition/reconstruction to improve comparability Adopt EARL protocols when thresholds/longitudinal changes guide care  Kinahan et al. 2020 QIBA FDG Profile [ 49 Quantitative imaging profile for FDG PET/CT Defines precision claims and standard operating steps Use QIBA-aligned workflows in trials and quantitative clinical pathways  Krokos et al. 2023 Review (EJNMMI Phys) [ 51 MR-based AC methods (Dixon, UTE/ZTE, atlas/ML) AC choice can shift SUVs; vendor/site heterogeneity persists Document and locally validate AC approach before applying PET/CT-derived thresholds Tracers / sequences (caution) Qin et al. 2022 (FAPI vs FDG) [ 50 FAPI-PET/MR vs FDG PET/CT (gastric) Different tracer behaviour Validate thresholds per tracer & platform Workflow, dose, management impact Mayerhoefer et al. 2020 [ 52 Prospective 330 exams; PET/MRI vs PET/CT Management impact comparable; operational/cost considerations PET/MRI feasible; plan for slot time/workflow  Schaarschmidt et al. 2017 [ 54 NSCLC; PET/MR vs PET/CT Therapy plans rarely changed by swapping modalities Practical equivalence in real-world MDTs Health-economic and outcome anchors Fischer et al. 2009 NEJM [ 7 RCT: add PET/CT to conventional pre-op staging Fewer futile thoracotomies PET/CT as standard pre-radical checkpoint  Søgaard et al. 2011 [ 6 Cost-effectiveness alongside RCT PET/CT staging pathway cost-effective Economic rationale for default PET/CT  Manoharan et al. 2019 (CONVERT) [ 53 SCLC chemoradiation RCT analysis PET/CT supports accurate staging/planning Reinforces PET/CT role in SCLC pathways Brief appraisal of study quality Overall, the lung-specific head-to-head evidence is moderate in quality. Strengths include prospective, within-patient designs, explicit T/N/M endpoints, and the use of histology or composite clinical standards in several cohorts [ 11 15 18 19 11 15 18 20 46 49 51 47 52 55 23 27 6 7 48 49 Limitations of this review (search and selection) We performed a narrative search of PubMed for human, English-language studies published from 2008 to 2025. PubMed filters applied: Clinical Study, Comparative Study, Journal Article; Species: Humans; Language: English; Publication dates: 2008-2025. Core inclusion criteria were prospective or retrospective clinical studies evaluating PET-CT, PET-MRI, or whole-body MRI for lung cancer (NSCLC or SCLC) staging, with preference for within-patient head-to-head designs. In addition, where directly relevant to staging performance, quantitation, or workflow, we considered recent systematic reviews/meta-analyses and technical or consensus reviews to contextualise protocol choices and management impact. We excluded case reports, paediatric or animal studies, editorials, and non-comparative technical notes. Representative queries included: (“PET/MRI” OR “PET-MR”) AND (lung OR NSCLC) AND (staging OR TNM); (“PET/CT” OR “PET-CT”) AND (lung OR NSCLC) AND (staging OR TNM); and (“PET/MRI” OR “PET-MR”) AND (“PET/CT” OR “PET-CT”) AND (cancer OR tumour) to capture cross-oncology operational data. We also used targeted terms for nodal staging (including SCLC), small pulmonary nodules, brain and liver metastases, management impact and cost-effectiveness, and quantitative/technical topics such as attenuation correction and harmonisation. Last search: September 4, 2025. Conclusions In conclusion, this review clarifies how PET-CT and PET-MRI fit into lung cancer staging. PET-CT remains the default because it is fast, widely available, and linked to better surgical selection and cost-effectiveness. PET-MRI achieves similar overall staging performance while offering higher soft-tissue contrast and integrated brain-to-body assessment; its value is greatest for suspected pleural, chest-wall, or mediastinal invasion and for brain or liver problem-solving. A consistent limitation is reduced sensitivity for very small or subsolid pulmonary nodules, so MRI-led pathways should be paired with a contemporaneous diagnostic-quality chest CT whenever sub-centimetre disease could change intent. Practically, use PET-CT as the standard pre-radical staging test and deploy PET-MRI selectively where its advantages matter most or dose reduction is a priority, while safeguarding small-nodule detection. Nodal staging performance is broadly comparable between hybrids; invasive confirmation remains important when results will alter management, with combined EBUS/EUS a sensible targeted strategy. In SCLC, whole-body MRI and PET-MRI can improve T category and overall TNM accuracy at baseline, but selective invasive nodal confirmation is still appropriate when findings would change chemoradiotherapy fields. Quantitatively, centres should avoid transplanting PET-CT thresholds to PET-MRI without local validation, adopt harmonised protocols, and document attenuation-correction choices to ensure interpretable SUVs. Priorities now are multicentre trials with harmonised protocols and management-impact endpoints, clearer rules for integrating chest CT into MRI-led pathways, and realistic modelling of throughput and access. Disclosures Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Supervision: References 1 Global Cancer Statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Bray F 209 249 71 2021 33538338 10.3322/caac.21660 2 IASLC Lung Cancer Staging Project: the new database to inform revisions in the ninth edition of the TNM Classification of Lung Cancer J Thorac Oncol Asamura H Nishimura KK Giroux DJ Chansky K Hoering A Rusch V Rami-Porta R 564 575 18 2023 36773775 10.1016/j.jtho.2023.01.088 3 National Institute for Health and Care Excellence. Overview | Lung cancer: diagnosis and management | Guidance | NICE [Internet]. Nice.org.uk. NICE 2019 https://www.nice.org.uk/guidance/ng122 4 Recommendations for cross-sectional imaging in cancer management, Third edition | The Royal College of Radiologists [Internet]. www.rcr.ac.uk 2022 https://www.rcr.ac.uk/our-services/all-our-publications/clinical-radiology-publications/recommendations-for-cross-sectional-imaging-in-cancer-management-third-edition/ 5 Lung cancer: diagnosis and management: summary of updated NICE guidance BMJ Maconachie R Mercer T Navani N McVeigh G 0 364 2019 10.1136/bmj.l1049 30923038 6 Preoperative staging of lung cancer with PET/CT: cost-effectiveness evaluation alongside a randomized controlled trial Eur J Nucl Med Mol Imaging Søgaard R Fischer BM Mortensen J Højgaard L Lassen U 802 809 38 2011 21210111 10.1007/s00259-010-1703-y 7 Preoperative staging of lung cancer with combined PET-CT N Engl J Med Fischer B Lassen U Mortensen J 32 39 361 2009 19571281 10.1056/NEJMoa0900043 8 The lung cancers: staging and response, CT, (18)F-FDG PET/CT, MRI, DWI: review and new perspectives Br J Radiol Owens C Hindocha S Lee R Millard T Sharma B 20220339 96 2023 37097296 10.1259/bjr.20220339 PMC10392646 9 International EANM-SNMMI-ISMRM consensus recommendation for PET/MRI in oncology Eur J Nucl Med Mol Imaging Veit-Haibach P Ahlström H Boellaard R 3513 3537 50 2023 37624384 10.1007/s00259-023-06406-x PMC10547645 10 Whole-body MRI for lung cancer staging: a step in the right direction Lancet Respir Med Meyer M Budjan J 471 472 7 2019 31080131 10.1016/S2213-2600(19)30081-5 11 TNM staging of non-small cell lung cancer: comparison of PET/MR and PET/CT J Nucl Med Huellner MW de Galiza Barbosa F Husmann L 21 26 57 2016 26471696 10.2967/jnumed.115.162040 12 Preoperative staging of non-small cell lung cancer: prospective comparison of PET/MR and PET/CT Eur Radiol Lee SM Goo JM Park CM 3850 3857 26 2016 26883332 10.1007/s00330-016-4255-0 13 Thoracic staging in lung cancer: prospective comparison of 18F-FDG PET/MR imaging and 18F-FDG PET/CT J Nucl Med Heusch P Buchbender C Köhler J 373 378 55 2014 24504054 10.2967/jnumed.113.129825 14 Prospective comparison of (18)F-FDG PET/MRI and (18)F-FDG PET/CT for thoracic staging of non-small cell lung cancer Eur J Nucl Med Mol Imaging Kirchner J Sawicki LM Nensa F 437 445 46 2019 30074073 10.1007/s00259-018-4109-x 15 Comparison of diagnostic accuracy for TNM stage among whole-body MRI and coregistered PET/MRI using 1.5-T and 3-T MRI systems and integrated PET/CT for non-small cell lung cancer AJR Am J Roentgenol Ohno Y Takeshi Y Takenaka D Koyama H Aoyagi K Yui M 1191 1198 215 2020 32960670 10.2214/AJR.19.22565 16 Evaluation of the Outcome of Lung Nodules Missed on 18F-FDG PET/MRI Compared with 18F-FDG PET/CT in Patients with Known Malignancies J Nucl Med Sawicki LM Grueneisen J Buchbender C 15 20 57 2016 26514173 10.2967/jnumed.115.162966 17 Detection rate, location, and size of pulmonary nodules in trimodality PET/CT-MR: comparison of low-dose CT and Dixon-based MR imaging Invest Radiol Stolzmann P Veit-Haibach P Chuck N 241 246 48 2013 23070096 10.1097/RLI.0b013e31826f2de9 18 Small Cell Lung Cancer Staging: Prospective Comparison of Conventional Staging Tests, FDG PET/CT, Whole-Body MRI, and Coregistered FDG PET/MRI AJR Am J Roentgenol Ohno Y Yoshikawa T Takenaka D 899 908 218 2022 34877872 10.2214/AJR.21.26868 19 Whole-body MRI: comparison of its capability for TNM staging of malignant pleural mesothelioma with that of coregistered PET/MRI, integrated FDG PET/CT, and conventional imaging AJR Am J Roentgenol Ohno Y Yui M Aoyagi K Kishida Y Seki S Koyama H Yoshikawa T 311 319 212 2019 30512992 10.2214/AJR.18.20111 20 State of the art MR imaging for lung cancer TNM stage evaluation Cancers (Basel) Ohno Y Ozawa Y Koyama H 950 15 2023 36765907 10.3390/cancers15030950 PMC9913625 21 Imaging assessment of visceral pleural surface invasion by lung cancer: comparison of CT and contrast-enhanced radial T1-weighted gradient echo 3-Tesla MRI Korean J Radiol Zhang Y Kwon W Lee HY 829 839 22 2021 33686817 10.3348/kjr.2020.0955 PMC8076827 22 Pearls and pitfalls in lung cancer staging BJR Open Beer L Jajodia A Prosch H 20200019 2 2020 33178978 10.1259/bjro.20200019 PMC7594898 23 Head-to-head comparison of (18)F-FDG PET/CT and (18)F-FDG PET/MRI for lymph node metastasis staging in non-small cell lung cancer: a meta-analysis Diagn Interv Radiol Zhang M Liu Z Yuan Y Yang W Cao X Ma M Han B 99 106 30 2024 38291975 10.4274/dir.2023.232280 PMC10916527 24 Positron emission tomography/computed tomography (PET/CT) and CT for N staging of non-small cell lung cancer Med Glas (Zenica) Vegar Zubović S Kristić S Hadžihasanović B 199 203 14 2017 28698537 10.17392/899-17 25 Integrated PET/CT in non small cell lung cancer staging - clinical and pathological agreement (in English, Portuguese) Rev Port Pneumol Vaz AP Fernandes G Souto Moura C Bastos P Queiroga H Hespanhol V 109 114 18 2012 22405953 10.1016/j.rppneu.2012.01.004 26 Contrast enhanced CT versus integrated PET-CT in pre-operative nodal staging of non-small cell lung cancer Diagn Interv Radiol Ceylan N Doğan S Kocaçelebi K Savaş R Çakan A Çağrici U 435 440 18 2012 22374706 10.4261/1305-3825.DIR.5100-11.2 27 Positron emission tomography-computed tomography compared with invasive mediastinal staging in non-small cell lung cancer: results of mediastinal staging in the early lung positron emission tomography trial J Thorac Oncol Darling GE Maziak DE Inculet RI 1367 1372 6 2011 21587082 10.1097/JTO.0b013e318220c912 28 Multimodality approach to mediastinal staging in non-small cell lung cancer. Faults and benefits of PET-CT: a randomised trial Thorax Fischer BM Mortensen J Hansen H 294 300 66 2011 21169287 10.1136/thx.2010.154476 29 Mediastinal nodal staging performance of combined endobronchial and esophageal endosonography in lung cancer cases: a systematic review and meta-analysis Front Surg Liu X Yang K Guo W Ye M Liu S 890993 9 2022 35677749 10.3389/fsurg.2022.890993 PMC9168235 30 PET/CT in the staging of the non-small-cell lung cancer J Biomed Biotechnol Chao F Zhang H 783739 2012 2012 22577296 10.1155/2012/783739 PMC3346692 31 Accuracy of nodal staging by 18F-FDG-PET/CT in limited disease small-cell lung cancer Asian Cardiovasc Thorac Ann Hockmann J Hautzel H Darwiche K 506 511 31 2023 37438928 10.1177/02184923231187279 PMC10363929 32 Brain metastases: the role of clinical imaging Br J Radiol Derks SH van der Veldt AA Smits M 20210944 95 2022 34808072 10.1259/bjr.20210944 PMC8822566 33 Liver metastases: the role of magnetic resonance imaging World J Gastroenterol Maino C Vernuccio F Cannella R 5180 5197 29 2023 37901445 10.3748/wjg.v29.i36.5180 PMC10600959 34 Preoperative staging of non-small-cell lung cancer: comparison of whole-body diffusion-weighted magnetic resonance imaging and 18F-fluorodeoxyglucose-positron emission tomography/computed tomography Eur Radiol Sommer G Wiese M Winter L 2859 2867 22 2012 22772365 10.1007/s00330-012-2542-y 35 Comparison of whole-body 18F-FDG PET/CT and PET/MRI for distant metastases in patients with malignant tumors: a meta-analysis BMC Cancer Zhang C Liang Z Liu W Zeng X Mo Y 37 23 2023 36624425 10.1186/s12885-022-10493-8 PMC9830828 36 Clinical usefulness of (18)F-FDG PET/CT for the detection of distant metastases in patients with non-small cell lung cancer at initial staging: a meta-analysis Cancer Manag Res Yu B Zhu X Liang Z Sun Y Zhao W Chen K 1859 1864 10 2018 30013392 10.2147/CMAR.S155542 PMC6037269 37 PET/MRI and PET/CT in follow-up of head and neck cancer patients Eur J Nucl Med Mol Imaging Queiroz MA Hüllner M Kuhn F 1066 1075 41 2014 24577950 10.1007/s00259-014-2707-9 38 PET/MRI and PET/CT in advanced gynaecological tumours: initial experience and comparison Eur Radiol Queiroz MA Kubik-Huch RA Hauser N Freiwald-Chilla B von Schulthess G Froehlich JM Veit-Haibach P 2222 2230 25 2015 26017734 10.1007/s00330-015-3657-8 39 Comparison of hybrid FDG PET/MRI compared with PET/CT in colorectal cancer staging and restaging: a pilot study Abdom Imaging Paspulati RM Partovi S Herrmann KA Krishnamurthi S Delaney CP Nguyen NC 1415 1425 40 2015 26112492 10.1007/s00261-015-0474-0 40 What is the diagnostic performance of 18-FDG-PET/MR compared to PET/CT for the N- and M- staging of breast cancer? Eur Radiol Botsikas D Bagetakos I Picarra M 1787 1798 29 2019 30267154 10.1007/s00330-018-5720-8 41 Hybrid PET/MRI of intracranial masses: initial experiences and comparison to PET/CT J Nucl Med Boss A Bisdas S Kolb A 1198 1205 51 2010 20660388 10.2967/jnumed.110.074773 42 [(18)F]FDG PET/CT outperforms [(18)F]FDG PET/MRI in differentiated thyroid cancer Eur J Nucl Med Mol Imaging Vrachimis A Burg MC Wenning C Allkemper T Weckesser M Schäfers M Stegger L 212 220 43 2016 26419851 10.1007/s00259-015-3195-2 43 Comparison of PET/CT and MRI in the diagnosis of bone metastasis in prostate cancer patients: a network analysis of diagnostic studies Front Oncol Liu F Dong J Shen Y 736654 11 2021 34671558 10.3389/fonc.2021.736654 PMC8522477 44 Comparative performance of ¹⁸F-FDG PET/MRI and ¹⁸F-FDG PET/CT in detection and characterization of pulmonary lesions in 121 oncologic patients J Nucl Med Sawicki LM Grueneisen J Buchbender C 582 586 57 2016 26742715 10.2967/jnumed.115.167486 45 PET/MR imaging in the detection and characterization of pulmonary lesions: technical and diagnostic evaluation in comparison to PET/CT J Nucl Med Rauscher I Eiber M Fürst S 724 729 55 2014 24652827 10.2967/jnumed.113.129247 46 Qualitative and quantitative comparison of PET/CT and PET/MR imaging in clinical practice J Nucl Med Al-Nabhani KZ Syed R Michopoulou S 88 94 55 2014 24337608 10.2967/jnumed.113.123547 47 First clinical experience with integrated whole-body PET/MR: comparison to PET/CT in patients with oncologic diagnoses J Nucl Med Drzezga A Souvatzoglou M Eiber M 845 855 53 2012 22534830 10.2967/jnumed.111.098608 48 EANM/EARL harmonization strategies in PET quantification: from daily practice to multicentre oncological studies Eur J Nucl Med Mol Imaging Aide N Lasnon C Veit-Haibach P Sera T Sattler B Boellaard R 17 31 44 2017 10.1007/s00259-017-3740-2 PMC5541084 28623376 49 The QIBA profile for FDG PET/CT as an imaging biomarker measuring response to cancer therapy Radiology Kinahan PE Perlman ES Sunderland JJ 647 657 294 2020 31909700 10.1148/radiol.2019191882 PMC7053216 50 (68)Ga-DOTA-FAPI-04 PET/MR in the evaluation of gastric carcinomas: comparison with (18)F-FDG PET/CT J Nucl Med Qin C Shao F Gai Y 81 88 63 2022 33863819 10.2967/jnumed.120.258467 PMC8717186 51 A review of PET attenuation correction methods for PET-MR EJNMMI Phys Krokos G MacKewn J Dunn J Marsden P 52 10 2023 37695384 10.1186/s40658-023-00569-0 PMC10495310 52 PET/MRI versus PET/CT in oncology: a prospective single-center study of 330 examinations focusing on implications for patient management and cost considerations Eur J Nucl Med Mol Imaging Mayerhoefer ME Prosch H Beer L 51 60 47 2020 31410538 10.1007/s00259-019-04452-y PMC6885019 53 (18)F-Fludeoxyglucose PET/CT in SCLC: analysis of the CONVERT randomized controlled trial J Thorac Oncol Manoharan P Salem A Mistry H 1296 1305 14 2019 31002954 10.1016/j.jtho.2019.03.023 PMC6616906 54 Thoracic staging with (18)F-FDG PET/MR in non-small cell lung cancer - does it change therapeutic decisions in comparison to (18)F-FDG PET/CT? Eur Radiol Schaarschmidt BM Grueneisen J Metzenmacher M 681 688 27 2017 27180186 10.1007/s00330-016-4397-0 55 18F-FDG PET/CT and PET/MRI perform equally well in cancer: evidence from studies on more than 2,300 patients J Nucl Med Spick C Herrmann K Czernin J 420 430 57 2016 26742709 10.2967/jnumed.115.158808 PMC5003572 ",
  "metadata": {
    "Title of this paper": "18F-FDG PET/CT and PET/MRI perform equally well in cancer: evidence from studies on more than 2,300 patients",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478981/"
  }
}