{
  "title": "Paper_652",
  "abstract": "pmc Int J Nanomedicine Int J Nanomedicine 616 intjnano ijn International Journal of Nanomedicine 1176-9114 1178-2013 Dove Press PMC12481445 PMC12481445.1 12481445 12481445 41036223 10.2147/IJN.S534976 534976 1 Review Targeting Glucose Transporter 1 (GLUT1) in Cancer: Molecular Mechanisms and Nanomedicine Applications Ren et al Ren et al http://orcid.org/0009-0009-2492-7410 Ren Zhen  1  2 * Zhao Jingyuan  1 * http://orcid.org/0000-0002-3492-7176 Li Shuai  1 Yuan Hong  1 1 Central Hospital of Dalian University of Technology Dalian Liaoning People’s Republic of China 2 Faculty of Medicine, Dalian University of Technology Dalian Liaoning People’s Republic of China Correspondence: Shuai Li, The First Affiliated Hospital of Dalian Medical University Dalian People’s Republic of China Hong Yuan, Central Hospital of Dalian University of Technology, Clinical Laboratory Center Dalian People’s Republic of China * These authors contributed equally to this paper 25 9 2025 2025 20 478586 11859 11879 17 4 2025 12 9 2025 25 09 2025 01 10 2025 02 10 2025 © 2025 Ren et al. 2025 Ren et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Abstract Glucose transporter 1 (GLUT1), a central orchestrator of tumor metabolic reprogramming, sustains malignant progression by enforcing glycolytic dependency and conferring therapeutic resistance. While conventional GLUT1-targeted small-molecule inhibitors demonstrate preclinical efficacy through glucose transport blockade and chemo-radiosensitization, their clinical translation is impeded by intrinsic limitations. Emerging nanomedicine paradigms have redefined GLUT1-targeted interventions through multifunctional platforms that synergistically unify precision therapeutics, imaging guidance, and immunometabolic modulation. Meanwhile, advanced formulations further exploit GLUT1-mediated endocytosis to achieve blood-brain barrier penetration, thus potentially addressing key challenges in the treatment of CNS malignancies. Notably, combinatorial nanoarchitectures simultaneously disrupt metabolic pathways and reprogram immunosuppressive niches via dual-targeting strategies, thereby counteracting tumor adaptation mechanisms. These innovations transcend conventional therapeutic boundaries by establishing metabolic-immune interplay regulation and barrier-defying delivery systems. This review systematically analyses the evolving landscape of GLUT1-targeted nanomedicine, evaluating both traditional molecular inhibitors and next-generation nanoplatforms that harness GLUT1 through diverse modalities. By dissecting molecular mechanisms and translational applications, we elucidate the diagnostic and therapeutic value of GLUT1-targeted nano-strategies in precision oncology while outlining future directions for clinical implementation. Keywords GLUT1 nanomedicine precision oncology metabolic reprogramming Liaoning Provincial Key R&D Project Dalian Major Scientific and Technological Innovation Program Project This review was supported by Liaoning Provincial Key R&D Project (2024JH2/10250004), Dalian Major Scientific and Technological Innovation Program Project (2023JJ11CG005), Liaoning Provincial Science and Technology Program Joint Project (2024JH2/102600013) and Dalian City Life and Health Field Guidance Program Project (2023YGZD02). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Glucose transporter (GLUT) is a key protein facilitating glucose transport across cell membranes, playing a crucial role in maintaining cellular metabolic homeostasis and energy balance. Glucose transporter 1 (GLUT1), a member of the glucose transporter family, features a 12-transmembrane domain structure characteristic of transmembrane proteins. 1 2 3 1 4 K m 2 5 6 7 8–10 11 12 13 14 15 Tumor cells upregulate GLUT1 expression to enhance glucose uptake, a function that becomes particularly critical under hypoxic conditions. 16 17 18 19 20 21 Figure 1 Figure 1 The main Mechanism of Action of GLUT1 Related Nanomaterials. Created in BioRender. Y, N . (2025) https://BioRender.com/bkhkfpn GLUT1 Inhibitors in Tumor Therapy GLUT1 facilitates glucose transport into cells by alternating the substrate cavity’s exposure to each side of the membrane. GLUT inhibitors interfere with this transport by disrupting the conformational cycling between the outward-facing (substrate cavity exposed to extracellular space) and inward-facing states (substrate cavity exposed to the cytosol) or by blocking glucose passage in one or both conformational states. 22 23 Table 1 Table 1 Effects of Natural Compound GLUT Inhibitors Against Various Cancers Compound Molecular Structure Cancer Type Effect Ref. Apigenin Laryngeal ↓PI3K/AKT [ 24 25 Curcumin Laryngeal ↑Autophagy [ 26 Trehalose Melanoma ↑Autophagic [ 27 28 LH-20-15 – Esophageal ↓PI3K/Akt [ 29 Abbreviations Apigenin was found to increase the radiosensitivity of laryngeal cancer xenografts by reducing GLUT1 expression via the PI3K/Akt signaling pathway. In a nude mouse model, combining apigenin with X-ray radiation significantly suppressed tumor growth, with the combined treatment group displaying reduced tumor volume. 24 25 26 27 28 Gekko japonicus 29 Synthetic GLUT inhibitors encompass compounds such as indinavir, ritonavir, 6-benzylthioinosine (6-BT), WZB117, WZB27, WZB115, 18 23 Table 2 Table 2 Effects of Combination Treatments of Synthetic Small Molecule GLUT Inhibitors Against Various Cancers Compound Molecular Structure Cancer Type Effect Ref. WZB117 Breast ↑AMPK [ 30–32 CG-5 Pancreatic ↓Chemotherapy Resistance [ 33 6-BT Leukemia ↓Glycolytic Flux [ 34 2-DG Breast ↓HIF-1α [ 35–39 19 Cervical ↑Apoptosis [ 40 Palbociclib Breast ↓Glucose Uptake [ 41 Compound H Nasopharyngeal ↓ATP [ 42 Spautin-1 Prostate ↑Apoptosis [ 43 Abbreviations GLUT1 overexpression is closely associated with chemoresistance. For example, WZB117 overcomes doxorubicin resistance in MCF7 breast cancer cells by activating BAX translocation, AMPK activation, and mTOR pathway suppression. 30 31 32 33 34 35 36 37 19 19 40 18 18 44 38 39 41 42 43 With further advancements in screening methods for GLUT1 inhibitors, clinical applications continue to face significant challenges, including limited specificity and potential toxicity. Due to the ubiquitous expression of GLUT1 in normal tissues, nonspecific inhibition may induce severe side effects or poor therapeutic efficacy. For example, silibinin—a flavonoid derived from milk thistle—demonstrates preclinical antitumor activity by targeting GLUT and suppressing glucose uptake. 45 46 47 48 GLUT1-Related Nanomaterials and Tumor Treatment Directly using GLUT1 inhibitors to intervene in tumor metabolic reprogramming presents several challenges, including poor drug selectivity, significant side effects, and inconsistent therapeutic efficacy. These limitations have driven the exploration of alternative therapeutic strategies. The emergence of targeted nanomaterials offers a promising solution to these challenges. Precisely engineered nanoparticles enable scientists to efficiently target specific sites in tumor cells, thereby regulating GLUT1 expression and function to inhibit tumor growth. Nanomaterials possess unique physicochemical properties, such as small size, large surface area, excellent biocompatibility, and tunable surface functionalities, making them highly promising for targeted drug delivery and therapy. These nanomaterials enable researchers to not only precisely regulate glucose metabolism in tumor cells through receptor-mediated precise targeting, but also serve as a medium for blood-brain barrier penetration, as well as indirectly modulate tumor immunity by regulating immune cells in the tumor microenvironment, thereby paving the way for novel cancer treatment approaches. Nanomedicine Related to Inhibiting GLUT1 to Block Energy Metabolism for Anti-Tumor Effects Rapidly proliferating cancer cells rely on excessive glucose uptake to meet their high energy demands, driven primarily by GLUT1 overexpression. GLUT1 facilitates glucose uptake and plays a central role in the altered energy metabolism of many malignant tumors. Some researchers have explored direct strategies to inhibit GLUT1 ( Figure 2 49 50 Figure 2A 51 Figure 2B 52 53 Figure 2C 54 55 56 57 Figure 2D 58 Figure 2E 59 Figure 2 Nanomaterials that directly inhibit GLUT1. ( A 51 B 52 C 54 D 58 E 59 Metal-ion-based nanomaterials, owing to their unique physicochemical properties and broad biological activities, have become a critical area of research in nanomedicine, demonstrating significant potential in cancer therapy. Metal ions, such as zinc (Zn 2+ 2+ 2+ 3+ Figure 3 Figure 3A 60 2+ 2+ Figure 3B 61 Figure 3C 62 Figure 3D 63 64 Figure 3 Metal ion-based Nanomaterials Related to GLUT1. ( A 60 B 61 C 62 D 63 Additionally, inhibitors targeting the respiratory or metabolic chain can alter GLUT1 expression or suppress its function due to pathway interference. 65 Figure 4 + 66 Figure 4A 67 2 2 2 Figure 4B 68 2 Figure 4C 69 70 71 Figure 4 GLUT1-related Nanomaterials Targeting the Respiratory chain or Metabolic chain. ( A Int J Nanomed 67 B 2 68 C 2 J Control Release. 69 Targeting GLUT1 to Enhance the Tissue Selectivity and Transmembrane Efficacy of Nanodrugs GLUT1, a critical membrane receptor, is highly expressed in tumor cells due to their metabolism closely linked to the Warburg effect, particularly during active tumor growth, with expression levels significantly exceeding those in normal cells. This selective expression characteristic provides a crucial target for precise tumor localization, leading to extensive research employing GLUT1 for targeted tumor diagnosis and therapy. Furthermore, GLUT1 functions not only as a molecular marker but also as a glucose transporter with well-defined transmembrane transport capabilities. Leveraging this feature, certain nanomaterials have been designed to enter tumor cells via GLUT1-mediated transport mechanisms ( Figure 5 72 73 Figure 5A 74 75 76 77 Figure 5B 76 78 79 Figure 5C 80 Figure 5D 81 82 Figure 5 Related Nanomaterials for GLUT1-mediated Transport Mechanisms. ( A 74 Acta pharmaceutica Sinica B B 76 C J Nanobiotechnol 80 D Nanoscale 81 Additionally, the high expression of GLUT1 in tumors is considered a promising biological target in tumor imaging and imaging enhancement technologies. Several researchers have designed GLUT1-targeted nanomaterials to enhance tumor imaging quality and detection sensitivity. These nanomaterials can precisely label tumor tissues by recognizing the high expression of GLUT1 on the surface of tumor cells, thereby improving lesion resolution and localization accuracy during imaging ( Figure 6 Figure 6A 83 69 Figure 6B 84 2 3 2 3 2 3 2 3 85 Figure 6C 86 Figure 6 GLUT1-related Nanomaterials for tumor Imaging and Imaging Enhancement Technologies. ( A PLoS One. 83 B J Control Release 84 C Biomaterials 86 Targeting GLUT1 Enhances the Ability of Nanomaterials to Cross the Blood-Brain Barrier The blood-brain barrier (BBB), as a highly selective barrier, protects brain tissue from harmful substances while significantly limiting the effective delivery of drugs to the brain. 87 4 Figure 7 Figure 7A 88 89 90 91 92 93 Figure 7B 93 Figure 7C 94 95 96 Figure 7 GLUT1-related Nanomaterials for the BBB Penetration. ( A Nature Nanotechnol 88 B ACS Nano 93 C ACS Appl Mater Interfaces 94 GLUT1-Related Nanomedicines and Tumor Immunotherapy In recent years, tumor immunotherapy has become a revolutionary breakthrough in cancer treatment, owing to its unique mechanism of stimulating the body’s immune system to fight tumors. However, the high complexity and immunosuppressive nature of the tumor microenvironment (TME) pose significant challenges to the effectiveness of traditional immunotherapy. Overexpression of GLUT1 not only plays a key role in the energy metabolism of tumor cells but also influences the metabolic activity and functional status of immune cells, 97–99 100 Figure 8 Figure 8A 101 102 103 Figure 8B 104 105 Figure 8 GLUT1-related Nanomaterials for tumor Immunotherapy. ( A 101 B 104 Future Perspectives As a key glucose transporter protein, GLUT1 has emerged as a prominent focus in current anticancer therapeutic research owing to its central role in tumor energy metabolism. In the realm of clinical translation, several GLUT1-targeted clinical trials for malignant tumors have achieved preliminary breakthrough outcomes. For example, the novel bioreductive prodrug AQ4N significantly modulates GLUT1 expression by regulating the hypoxic tumor microenvironment; 106 107 108 109–111 112 113 15 114 115 116 However, despite numerous breakthroughs, GLUT1-related nanomaterials continue to confront significant challenges and limitations in cancer therapy. Firstly, the broad expression of GLUT1 is not confined to tumor cells but extends to normal tissues, potentially leading to off-target effects that induce side effects and toxicity concerns. Secondly, the heterogeneity in GLUT1 expression levels and functionality across diverse tumor types may result in substantial variability in therapeutic efficacy among patients. Furthermore, many GLUT1-based nanomaterials remain at the laboratory research stage, with clinical translation hindered by complexities in drug delivery systems, stability issues, and long-term biosafety uncertainties. Specifically, formulation complexity arises from the need for precise control over particle size, surface charge, targeting ligand density, and drug loading efficiency—factors critical for targeting accuracy and release kinetics but escalating synthesis difficulty and costs. Scalability challenges are evident in difficulties maintaining batch consistency, purity, and stability during scale-up from laboratory to industrial production, potentially yielding unpredictable therapeutic outcomes and restricting clinical applicability. Immune response risks involve potential activation of the complement system or induction of inflammatory factor release, triggering non-specific immune responses that exacerbate adverse events such as fever or allergies, thereby narrowing the therapeutic window. Long-term biosafety concerns stem from nanoparticle accumulation, slow biodegradation rates, metabolite toxicity, and chronic organ impacts, necessitating further assessment through extended in vivo models and epidemiological studies. Therefore, in the short term, single-cell sequencing and multi-omics analyses can be combined to elucidate the dynamic expression and functional changes of GLUT1 in the tumor microenvironment, screen for more specific targets and targeting strategies, and improve the specificity and biosafety of nanomaterials. Combining the synergistic effects of immunotherapy and gene editing technology can realize the in vivo verification of dual-targeted nanocarriers or the conduct of metabolic-immunotherapy combined therapy trials. Conclusion GLUT1 represents a promising target in tumor metabolic reprogramming, yet its therapeutic strategies must overcome critical challenges such as specificity and heterogeneity. Although nanomedicine offers versatile platforms to address these issues, translational hurdles—including bioavailability and safety concerns—persist. GLUT1-targeted nanomaterials demonstrate unique advantages in cancer therapy, opening new avenues for treatment; however, achieving broad clinical application still requires overcoming numerous technical and scientific barriers. With continuous advances in nanotechnology, tumor biology, and precision medicine, GLUT1-directed nanomaterials are poised to become a cornerstone in oncology therapeutics, providing patients with more efficient and safer treatment options. Author Contributions All authors made a significant contribution to the work reported, whether that is in the conception, study design, execution, acquisition of data, analysis and interpretation, or in all these areas; took part in drafting, revising or critically reviewing the article; gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work. Disclosure Zhen Ren and Jingyuan Zhao are co-first authors for this study. The authors declare no competing interests in this work. References 1. Wu WZ Bai YP Endothelial GLUTs and vascular biology Biomed Pharmacother 2023 158 114151 10.1016/j.biopha.2022.114151 36565587 2. Barron CC Bilan PJ Tsakiridis T Tsiani E Facilitative glucose transporters: implications for cancer detection, prognosis and treatment Metab Clin Exp 2016 65 2 124 139 10.1016/j.metabol.2015.10.007 26773935 3. Joost H-G Thorens B The extended GLUT-family of sugar/polyol transport facilitators: nomenclature, sequence characteristics, and potential function of its novel members Molecular Membrane Biology 2001 18 4 247 256 10.1080/09687680110090456 11780753 4. Han L Jiang C Evolution of blood-brain barrier in brain diseases and related systemic nanoscale brain-targeting drug delivery strategies Acta pharmaceutica Sinica B 2021 11 8 2306 2325 10.1016/j.apsb.2020.11.023 34522589 PMC8424230 5. Samec M Liskova A Koklesova L Flavonoids against the Warburg phenotype-concepts of predictive, preventive and personalised medicine to cut the Gordian knot of cancer cell metabolism EPMA J 2020 11 3 377 398 10.1007/s13167-020-00217-y 32843908 PMC7429635 6. Reid MA Allen AE Liu S Serine synthesis through PHGDH coordinates nucleotide levels by maintaining central carbon metabolism Nat Commun 2018 9 1 5442 10.1038/s41467-018-07868-6 30575741 PMC6303315 7. Zambrano A Molt M Uribe E Salas M Glut 1 in cancer cells and the inhibitory action of resveratrol as A potential therapeutic strategy Int J Mol Sci 2019 20 13 3374 10.3390/ijms20133374 31324056 PMC6651361 8. Ancey PB Contat C Boivin G GLUT1 expression in tumor-associated neutrophils promotes lung Cancer growth and resistance to radiotherapy Cancer Res 2021 81 9 2345 2357 10.1158/0008-5472.CAN-20-2870 33753374 PMC8137580 9. Meziou S Ringuette Goulet C Hovington H GLUT1 expression in high-risk prostate cancer: correlation with (18)F-FDG-PET/CT and clinical outcome Prostate Cancer Prostatic Dis 2020 23 3 441 448 10.1038/s41391-020-0202-x 31932660 10. Yan S Wang Y Chen M Li G Fan J Deregulated SLC2A1 promotes tumor cell proliferation and metastasis in gastric cancer Int J Mol Sci 2015 16 7 16144 16157 10.3390/ijms160716144 26193257 PMC4519943 11. Wong KK Engelman JA Cantley LC Targeting the PI3K signaling pathway in cancer Curr Opin Genet Dev 2010 20 1 87 90 10.1016/j.gde.2009.11.002 20006486 PMC2822054 12. Hayashi M Sakata M Takeda T Induction of glucose transporter 1 expression through hypoxia-inducible factor 1alpha under hypoxic conditions in trophoblast-derived cells J Endocrinol 2004 183 1 145 154 10.1677/joe.1.05599 15525582 13. Yun J Rago C Cheong I Glucose deprivation contributes to the development of KRAS pathway mutations in tumor cells Science 2009 325 5947 1555 1559 10.1126/science.1174229 19661383 PMC2820374 14. Osthus RC Shim H Kim S Deregulation of glucose transporter 1 and glycolytic gene expression by c-Myc J Biol Chem 2000 275 29 21797 21800 10.1074/jbc.C000023200 10823814 15. Schwartzenberg-Bar-Yoseph F Armoni M Karnieli E The tumor suppressor p53 down-regulates glucose transporters GLUT1 and GLUT4 gene expression Cancer Res 2004 64 7 2627 2633 10.1158/0008-5472.CAN-03-0846 15059920 16. Ferrer CM Lynch TP Sodi VL O-GlcNAcylation regulates cancer metabolism and survival stress signaling via regulation of the HIF-1 pathway Molecular Cell 2014 54 5 820 831 10.1016/j.molcel.2014.04.026 24857547 PMC4104413 17. Mano Y Aishima S Kubo Y Correlation between biological marker expression and fluorine-18 fluorodeoxyglucose uptake in hepatocellular carcinoma Am J Clin Pathol 2014 142 3 391 397 10.1309/AJCPG8AFJ5NRKLLM 25125631 18. Yu M Yongzhi H Chen S The prognostic value of GLUT1 in cancers: a systematic review and meta-analysis Oncotarget 2017 8 26 43356 43367 10.18632/oncotarget.17445 28498810 PMC5522151 19. Pliszka M Szablewski L Glucose transporters as a target for anticancer therapy Cancers 2021 13 16 4184 10.3390/cancers13164184 34439338 PMC8394807 20. Huang XQ Chen X Xie XX Co-expression of CD147 and GLUT-1 indicates radiation resistance and poor prognosis in cervical squamous cell carcinoma Int J Clin Exp Pathol 2014 7 4 1651 1666 24817962 PMC4014246 21. Tiemin P Peng X Qingfu L Dysregulation of the miR-148a-GLUT1 axis promotes the progression and chemoresistance of human intrahepatic cholangiocarcinoma Oncogenesis 2020 9 2 19 32054829 10.1038/s41389-020-0207-2 PMC7018977 22. Mueckler M Thorens B The SLC2 (GLUT) family of membrane transporters Mol Aspect Med 2013 34 2–3 121 138 10.1016/j.mam.2012.07.001 PMC4104978 23506862 23. Tilekar K Upadhyay N Iancu CV Pokrovsky V Choe JY Ramaa CS Power of two: combination of therapeutic approaches involving glucose transporter (GLUT) inhibitors to combat cancer Biochim Biophys Acta Rev Cancer 2020 1874 2 188457 10.1016/j.bbcan.2020.188457 33096154 PMC7704680 24. Bao YY Zhou SH Lu ZJ Fan J Huang YP Inhibiting GLUT-1 expression and PI3K/Akt signaling using apigenin improves the radiosensitivity of laryngeal carcinoma in vivo Oncol Rep 2015 34 4 1805 1814 10.3892/or.2015.4158 26238658 25. Xu YY Wu TT Zhou SH Apigenin suppresses GLUT-1 and p-AKT expression to enhance the chemosensitivity to cisplatin of laryngeal carcinoma Hep-2 cells: an in vitro study Int J Clin Exp Pathol 2014 7 7 3938 3947 25120770 PMC4129005 26. Dai LB Yu Q Zhou SH Effect of combination of curcumin and GLUT-1 AS-ODN on radiosensitivity of laryngeal carcinoma through regulating autophagy Head Neck 2020 42 9 2287 2297 10.1002/hed.26180 32314842 27. DeBosch BJ Heitmeier MR Mayer AL Trehalose inhibits solute carrier 2A (SLC2A) proteins to induce autophagy and prevent hepatic steatosis Sci Signaling 2016 9 416 ra21 10.1126/scisignal.aac5472 PMC4816640 26905426 28. Allavena G Del Bello B Tini P Trehalose inhibits cell proliferation and amplifies long-term temozolomide- and radiation-induced cytotoxicity in melanoma cells: a role for autophagy and premature senescence J Cell Physiol 2019 234 7 11708 11721 10.1002/jcp.27838 30488547 29. Lv X Li R Li Z Wang J Purification of gekko small peptide fraction and its effect of inducing apoptosis of EC 9706 esophageal cancer cells by inhibiting PI3K/Akt/GLUT1 signaling pathway Chem amp 2021 18 3 e2000720 10.1002/cbdv.202000720 33534194 30. Chen Q Meng YQ Xu XF Gu J Blockade of GLUT1 by WZB117 resensitizes breast cancer cells to Adriamycin Anti-Cancer Drugs 2017 28 8 880 887 10.1097/CAD.0000000000000529 28609310 31. Li YL Weng HC Hsu JL Lin SW Guh JH Hsu LC The combination of MK-2206 and WZB117 exerts a synergistic cytotoxic effect against breast cancer cells Front Pharmacol 2019 10 1311 10.3389/fphar.2019.01311 31780937 PMC6856645 32. Zhao F Ming J Zhou Y Fan L Inhibition of Glut1 by WZB117 sensitizes radioresistant breast cancer cells to irradiation Cancer Chemother Pharmacol 2016 77 5 963 972 10.1007/s00280-016-3007-9 27011212 33. Davis-Yadley AH Abbott AM Pimiento JM Chen DT Malafa MP Increased expression of the glucose transporter type 1 gene is associated with worse Overall survival in resected pancreatic adenocarcinoma Pancreas 2016 45 7 974 979 10.1097/MPA.0000000000000580 26692443 PMC4912950 34. Sabnis HS Bradley HL Tripathi S Synergistic cell death in FLT3-ITD positive acute myeloid leukemia by combined treatment with metformin and 6-benzylthioinosine Leukemia Res 2016 50 132 140 10.1016/j.leukres.2016.10.004 27760406 PMC5083204 35. Hayes C Donohoe CL Davern M Donlon NE The oncogenic and clinical implications of lactate induced immunosuppression in the tumour microenvironment Cancer Lett 2021 500 75 86 10.1016/j.canlet.2020.12.021 33347908 36. Lee SJ Park BN Roh JH An YS Hur H Yoon JK Enhancing the therapeutic efficacy of 2-deoxyglucose in breast Cancer cells using cell-cycle synchronization Anticancer Res 2016 36 11 5975 5980 10.21873/anticanres.11185 27793923 37. Goldberg L Israeli R Kloog Y FTS and 2-DG induce pancreatic cancer cell death and tumor shrinkage in mice Cell Death Dis 2012 3 3 e284 10.1038/cddis.2012.24 22419113 PMC3317504 38. Reyes R Wani NA Ghoshal K Jacob ST Motiwala T Sorafenib and 2-deoxyglucose synergistically inhibit proliferation of both sorafenib-sensitive and-resistant HCC cells by inhibiting ATP production Gene Expression 2016 17 2 129 10.3727/105221616X693855 27938509 PMC5296238 39. Bizjak M Malavašič P Dolinar K Pohar J Pirkmajer S Pavlin M Combined treatment with Metformin and 2-deoxy glucose induces detachment of viable MDA-MB-231 breast cancer cells in vitro Scientific Rep 2017 7 1 1761 10.1038/s41598-017-01801-5 PMC5431940 28496098 40. Niccoli S Boreham DR Phenix CP Lees SJ Non-radioactive 2-deoxy-2-fluoro-D-glucose inhibits glucose uptake in xenograft tumours and sensitizes HeLa cells to doxorubicin in vitro PLoS One 2017 12 11 e0187584 10.1371/journal.pone.0187584 29095925 PMC5667878 41. Cretella D Ravelli A Fumarola C The anti-tumor efficacy of CDK4/6 inhibition is enhanced by the combination with PI3K/AKT/mTOR inhibitors through impairment of glucose metabolism in TNBC cells J Exp Clin Cancer Res 2018 37 1 72 10.1186/s13046-018-0741-3 29587820 PMC5872523 42. Wang C Li Z Zhai H Targeted blocking of EGFR and GLUT1 by compound H reveals a new strategy for treatment of triple-negative breast cancer and nasopharyngeal carcinoma Eur J Pharm Sci 2024 198 106789 10.1016/j.ejps.2024.106789 38710335 43. Liao Y Guo Z Xia X Inhibition of EGFR signaling with Spautin-1 represents a novel therapeutics for prostate cancer J Exp Clin Cancer Res 2019 38 1 157 10.1186/s13046-019-1165-4 30975171 PMC6460657 44. Cullinane C Dorow DS Jackson S Differential (18)F-FDG and 3’-deoxy-3’-(18)F-fluorothymidine PET responses to pharmacologic inhibition of the c-MET receptor in preclinical tumor models J Nucl Med 2011 52 8 1261 1267 10.2967/jnumed.110.086967 21764800 45. Zhan T Digel M Küch EM Stremmel W Füllekrug J Silybin and dehydrosilybin decrease glucose uptake by inhibiting GLUT proteins J Cell Biochem 2011 112 3 849 859 10.1002/jcb.22984 21328458 46. Flaig TW Glodé M Gustafson D A study of high-dose oral silybin-phytosome followed by prostatectomy in patients with localized prostate cancer Prostate 2010 70 8 848 855 10.1002/pros.21118 20127732 47. Siegel AB Narayan R Rodriguez R A phase I dose-finding study of silybin phosphatidylcholine (milk thistle) in patients with advanced hepatocellular carcinoma Integr Cancer Ther 2014 13 1 46 53 10.1177/1534735413490798 23757319 PMC3866213 48. Temre MK Kumar A Singh SM An appraisal of the current status of inhibition of glucose transporters as an emerging antineoplastic approach: promising potential of new pan-GLUT inhibitors Front Pharmacol 2022 13 1035510 10.3389/fphar.2022.1035510 36386187 PMC9663470 49. De A Wadhwani A Sauraj Roychowdhury P Kang JH Ko YT Kuppusamy G WZB117 decorated metformin-carboxymethyl chitosan nanoparticles for targeting breast cancer metabolism Polymers 2023 15 4 10.3390/polym15040976 PMC9962472 36850263 50. Abolhasani A Biria D Abolhasani H Zarrabi A Komeili T Investigation of the role of glucose decorated chitosan and PLGA nanoparticles as blocking agents to glucose transporters of tumor cells Int J Nanomed 2019 14 9535 9546 10.2147/IJN.S228652 PMC6900274 31824149 51. Wang X Ding B Liu W Dual starvations induce pyroptosis for orthotopic pancreatic cancer therapy through simultaneous deprivation of glucose and glutamine J Am Chem Soc 2024 146 26 17854 17865 10.1021/jacs.4c03478 38776361 52. Jiang W Luo X Wei L The sustainability of energy conversion inhibition for tumor ferroptosis therapy and chemotherapy Small 2021 17 38 e2102695 10.1002/smll.202102695 34350694 53. Alhozeel B Pandey SK Shteinfer-Kuzmine A Santhanam M Shoshan-Barmatz V Silencing the mitochondrial gatekeeper VDAC1 as a potential treatment for bladder cancer Cells 2024 13 7 627 10.3390/cells13070627 38607066 PMC11012128 54. Wang D-W Ren X-H Ma Y-J Dual-template epitope imprinted nanoparticles for anti-glycolytic tumor-targeted treatment J Colloid Interface Sci 2025 683 890 905 10.1016/j.jcis.2024.12.227 39755015 55. Wang K Dai X Yu A Feng C Liu K Huang L Peptide-based PROTAC degrader of FOXM1 suppresses cancer and decreases GLUT1 and PD-L1 expression J Exp Clin Cancer Res 2022 41 1 289 10.1186/s13046-022-02483-2 36171633 PMC9520815 56. Tian J Guo F Chen Y Li Y Yu B Li Y Nanoliposomal formulation encapsulating celecoxib and genistein inhibiting COX-2 pathway and Glut-1 receptors to prevent prostate cancer cell proliferation Cancer Lett 2019 448 1 10 10.1016/j.canlet.2019.01.002 30673592 57. Song Y-Y Yuan Y Shi X Che Y-Y Improved drug delivery and anti-tumor efficacy of combinatorial liposomal formulation of genistein and plumbagin by targeting Glut1 and Akt3 proteins in mice bearing prostate tumor Colloids Surf B 2020 190 110966 10.1016/j.colsurfb.2020.110966 32199263 58. Lee SY Park J-H Ko S-H Shim J-S Kim -D-D Cho H-J Mussel-inspired hyaluronic acid derivative nanostructures for improved tumor targeting and penetration ACS Appl Mater Interfaces 2017 9 27 22308 22320 10.1021/acsami.7b06582 28621523 59. Jagdale S Narwade M Sheikh A GLUT1 transporter-facilitated solid lipid nanoparticles loaded with anti-cancer therapeutics for ovarian cancer targeting Int J Pharm 2023 637 122894 10.1016/j.ijpharm.2023.122894 36990168 60. Wu S Zhang K Liang Y Nano-enabled tumor systematic energy exhaustion via zinc (II) interference mediated glycolysis inhibition and specific GLUT1 depletion Adv Sci 2022 9 7 e2103534 10.1002/advs.202103534 PMC8895132 34913610 61. Zhang X Tian H Chen Y A metal-organic nanoframework for efficient colorectal cancer immunotherapy by the cGAS-STING pathway activation and immune checkpoint blockade J Nanobiotechnol 2024 22 1 592 10.1186/s12951-024-02836-3 PMC11441132 39343911 62. Li J Yu J Fang Q Du Y Zhang X Gold nanoparticle delivery of Glut1 SiRNA facilitates glucose starvation therapy in lung cancer Chembiochem 2024 25 12 e202400239 10.1002/cbic.202400239 38623847 63. Sun L Liu Y Yang N Gold nanoparticles inhibit tumor growth via targeting the Warburg effect in a c-Myc-dependent way Acta Biomater 2023 158 583 598 10.1016/j.actbio.2022.12.054 36586500 64. Yi Y Kim HJ Zheng M Glucose-linked sub-50-nm unimer polyion complex-assembled gold nanoparticles for targeted siRNA delivery to glucose transporter 1-overexpressing breast cancer stem-like cells J Control Release 2019 295 268 277 10.1016/j.jconrel.2019.01.006 30639386 65. Bonelli M Terenziani R Zoppi S Dual Inhibition of CDK4/6 and PI3K/AKT/mTOR signaling impairs energy metabolism in MPM cancer cells Int J Mol Sci 2020 21 14 5165 10.3390/ijms21145165 32708306 PMC7403976 66. Yang H Lu W-L Huang T Chen Q-Y Gao J Zhao Y An aptamer-Fe3+ modified nanoparticle for lactate oxidation and tumor photodynamic therapy Colloids Surfaces B 2018 164 192 200 10.1016/j.colsurfb.2018.01.045 29413596 67. Yang T Yao Q Cao F Liu Q Liu B Wang XH Silver nanoparticles inhibit the function of hypoxia-inducible factor-1 and target genes: insight into the cytotoxicity and antiangiogenesis Int J Nanomed 2016 11 6679 6692 10.2147/IJN.S109695 PMC5154724 27994464 68. Ruan S Yin W Chang J Acidic and hypoxic tumor microenvironment regulation by CaO(2)-loaded polydopamine nanoparticles J Nanobiotechnol 2022 20 1 544 10.1186/s12951-022-01752-8 PMC9798656 36577992 69. Ren G Wang X Yang Z TME-responsive nanoplatform for multimodal imaging-guided synergistic precision therapy of esophageal cancer via inhibiting HIF-1α signal pathway J Control Release 2024 376 518 529 10.1016/j.jconrel.2024.10.030 39424105 70. Li Z Cheng G Zhang Q PX478-loaded silk fibroin nanoparticles reverse multidrug resistance by inhibiting the hypoxia-inducible factor Int J Biol Macromol 2022 222 2309 2317 10.1016/j.ijbiomac.2022.10.018 36228812 71. Wang J-W Chen Q-W Luo G-F Interference of glucose bioavailability of tumor by engineered biohybrids for potentiating targeting and uptake of antitumor nanodrugs Nano Lett 2022 22 21 8735 8743 10.1021/acs.nanolett.2c03608 36286590 72. Barbaro D Di Bari L Gandin V Glucose-coated superparamagnetic iron oxide nanoparticles prepared by metal vapor synthesis can target GLUT1 overexpressing tumors: in vitro tests and in vivo preliminary assessment PLoS One 2022 17 6 e0269603 10.1371/journal.pone.0269603 35704647 PMC9200296 73. Wang X Yang Y Wang P Oxygen self-supplying nanoradiosensitizer activates cGAS-STING pathway to enhance radioimmunotherapy of triple negative breast cancer J Control Release 2024 376 794 805 10.1016/j.jconrel.2024.10.049 39490535 74. Guo Q Li C Zhou W GLUT1-mediated effective anti-miRNA21 pompon for cancer therapy Acta pharmaceutica Sinica B 2019 9 4 832 842 10.1016/j.apsb.2019.01.012 31384542 PMC6663942 75. Fu J Zhang K Lu L Improved therapeutic efficacy of CBD with good tolerance in the treatment of breast cancer through nanoencapsulation and in combination with 20(S)-protopanaxadiol (PPD) Pharmaceutics 2022 14 8 1533 10.3390/pharmaceutics14081533 35893789 PMC9332327 76. Cheng X Xu Y Zhang Y Glucose-targeted hydroxyapatite/indocyanine green hybrid nanoparticles for collaborative tumor therapy ACS Appl Mater Interfaces 2021 13 31 37665 37679 10.1021/acsami.1c09852 34342216 77. Wei G Chen J Jing Z Glucose transporter 1 (GLUT1)-targeting and hypoxia-activated mitochondria-specific chemo-thermal therapy via a glycosylated poly(amido amine)/celastrol (PAMAM/Cel) complex J Colloid Interface Sci 2022 608 1355 1365 10.1016/j.jcis.2021.10.129 34742058 78. Rajeshkumar RR Pavadai P Panneerselvam T Glucose-conjugated glutenin nanoparticles for selective targeting and delivery of camptothecin into breast cancer cells Naunyn-Schmiedeberg’s Arch Pharmacol 2023 396 10 2571 2586 10.1007/s00210-023-02480-y 37022437 79. Zhu Y Wang A Zhang S Paclitaxel-loaded ginsenoside Rg3 liposomes for drug-resistant cancer therapy by dual targeting of the tumor microenvironment and cancer cells J Adv Res 2023 49 159 173 10.1016/j.jare.2022.09.007 36167294 PMC10334248 80. Xia J Zhang S Zhang R Targeting therapy and tumor microenvironment remodeling of triple-negative breast cancer by ginsenoside Rg3 based liposomes J Nanobiotechnol 2022 20 1 414 10.1186/s12951-022-01623-2 PMC9479350 36109762 81. Shen S Du M Liu Q Development of GLUT1-targeting alkyl glucoside-modified dihydroartemisinin liposomes for cancer therapy Nanoscale 2020 12 42 21901 21912 10.1039/D0NR05138A 33108431 82. Ding N Xu S Zheng S “Sweet tooth”-oriented SN38 prodrug delivery nanoplatform for targeted gastric cancer therapy J Mat Chem B 2021 9 12 2816 2830 10.1039/D0TB02787A 33690741 83. Pereira PM Silva S Cavaleiro JA Ribeiro CA Tomé JP Fernandes R Galactodendritic phthalocyanine targets carbohydrate-binding proteins enhancing photodynamic therapy PLoS One 2014 9 4 e95529 10.1371/journal.pone.0095529 24763311 PMC3999036 84. Li Y Hong W Zhang H Photothermally triggered cytosolic drug delivery of glucose functionalized polydopamine nanoparticles in response to tumor microenvironment for the GLUT1-targeting chemo-phototherapy J Control Release 2020 317 232 245 10.1016/j.jconrel.2019.11.031 31783048 85. Shan XH Hu H Xiong F Targeting Glut1-overexpressing MDA-MB-231 cells with 2-deoxy-D-g1ucose modified SPIOs Eur J Radiol 2012 81 1 95 99 10.1016/j.ejrad.2011.03.013 21440393 86. Xing X Zhang B Wang X Liu F Shi D Cheng Y An “imaging-biopsy” strategy for colorectal tumor reconfirmation by multipurpose paramagnetic quantum dots Biomaterials 2015 48 16 25 10.1016/j.biomaterials.2015.01.011 25701028 87. Agrawal M Tripathi DK Recent advancements in liposomes targeting strategies to cross blood-brain barrier (BBB) for the treatment of Alzheimer’s disease J Control Release 2017 260 61 77 10.1016/j.jconrel.2017.05.019 28549949 88. Xue J Zhao Z Zhang L Neutrophil-mediated anticancer drug delivery for suppression of postoperative malignant glioma recurrence Nature Nanotechnol 2017 12 7 692 700 10.1038/nnano.2017.54 28650441 89. Arvanitis CD Ferraro GB Jain RK The blood-brain barrier and blood-tumour barrier in brain tumours and metastases Nat Rev Cancer 2020 20 1 26 41 10.1038/s41568-019-0205-x 31601988 PMC8246629 90. Tiwary S Morales JE Kwiatkowski SC Lang FF Rao G McCarty JH Metastatic brain tumors disrupt the blood-brain barrier and alter lipid metabolism by inhibiting expression of the endothelial cell fatty acid transporter Mfsd2a Sci Rep 2018 8 1 8267 10.1038/s41598-018-26636-6 29844613 PMC5974340 91. Yonemori K Tsuta K Ono M Disruption of the blood brain barrier by brain metastases of triple-negative and basal-type breast cancer but not HER2/neu-positive breast cancer Cancer 2010 116 2 302 308 10.1002/cncr.24735 19937674 92. Caro C Paez-Muñoz JM Pernía Leal M Carayol M Feijoo-Cuaresma M García-Martín ML Metabolically-driven active targeting of magnetic nanoparticles functionalized with glucuronic acid to glioblastoma: application to MRI-tracked magnetic hyperthermia therapy Adv Healthcare Mater 2024 14 3 e2404391 10.1002/adhm.202404391 39578332 93. Shao K Ding N Huang S Smart nanodevice combined tumor-specific vector with cellular microenvironment-triggered property for highly effective antiglioma therapy ACS Nano 2014 8 2 1191 1203 10.1021/nn406285x 24397286 94. Guo Y Zhang Y Li J Cell microenvironment-controlled antitumor drug releasing-nanomicelles for GLUT1-targeting hepatocellular carcinoma therapy ACS Appl Mater Interfaces 2015 7 9 5444 5453 10.1021/am5091462 25686400 95. Jiang X Xin H Ren Q Nanoparticles of 2-deoxy-D-glucose functionalized poly(ethylene glycol)-co-poly(trimethylene carbonate) for dual-targeted drug delivery in glioma treatment Biomaterials 2014 35 1 518 529 10.1016/j.biomaterials.2013.09.094 24125772 96. Zhang Y Ren Y Xu H Cascade-responsive 2-DG nanocapsules encapsulate aV-siCPT1C conjugates to inhibit glioblastoma through multiple inhibition of energy metabolism ACS Appl Mater Interfaces 2023 15 8 10356 10370 10.1021/acsami.2c19285 36787514 97. Marchesi F Vignali D Manini B Rigamonti A Monti P Manipulation of glucose availability to boost cancer immunotherapies Cancers 2020 12 10 2940 10.3390/cancers12102940 33053779 PMC7650629 98. Peng Z Zhang Y Ma X Brd4 regulates the homeostasis of CD8(+) T-Lymphocytes and their proliferation in response to antigen stimulation Front Immunol 2021 12 728082 10.3389/fimmu.2021.728082 34512660 PMC8427756 99. Huang Y Zou Y Jiao Y Targeting glycolysis in alloreactive T cells to prevent acute graft-versus-host disease while preserving Graft-Versus-Leukemia effect Front Immunol 2022 13 751296 10.3389/fimmu.2022.751296 35296079 PMC8920494 100. Caro-Maldonado A Wang R Nichols AG Metabolic reprogramming is required for antibody production that is suppressed in anergic but exaggerated in chronically BAFF-Exposed B cells J Immunol 2014 192 8 3626 3636 10.4049/jimmunol.1302062 24616478 PMC3984038 101. Li T Xu D Ruan Z Metabolism/immunity dual-regulation thermogels potentiating immunotherapy of glioblastoma through lactate-excretion inhibition and PD-1/PD-L1 blockade Adv Sci 2024 11 18 e2310163 10.1002/advs.202310163 PMC11095231 38460167 102. Duarte-Sanmiguel S Salazar-Puerta AI Panic A ICAM-1-decorated extracellular vesicles loaded with miR-146a and Glut1 drive immunomodulation and hinder tumor progression in a murine model of breast cancer Biomater Sci 2023 11 20 6834 6847 10.1039/D3BM00573A 37646133 PMC10591940 103. Liu J Cui Y Cabral H Glucosylated nanovaccines for dendritic Cell-Targeted antigen delivery and amplified cancer immunotherapy ACS Nano 2024 18 37 25826 25840 10.1021/acsnano.4c09053 39196858 104. Chen W-H Luo G-F Lei Q Overcoming the heat endurance of tumor cells by interfering with the anaerobic glycolysis metabolism for improved photothermal therapy ACS Nano 2017 11 2 1419 1431 10.1021/acsnano.6b06658 28107631 105. Jiang C Tang M Su Y Nanomedicine-driven tumor glucose metabolic reprogramming for enhanced cancer immunotherapy Acta Pharmaceutica Sinica B 2025 15 6 2845 2866 10.1016/j.apsb.2025.04.002 40654336 PMC12254754 106. Albertella MR Loadman PM Jones PH Hypoxia-selective targeting by the bioreductive prodrug AQ4N in patients with solid tumors: results of a phase I study Clin Cancer Res 2008 14 4 1096 1104 10.1158/1078-0432.CCR-07-4020 18281542 107. Kummar S Raffeld M Juwara L Multihistology, target-driven pilot trial of oral topotecan as an inhibitor of hypoxia-inducible factor-1α in advanced solid tumors Clin Cancer Res 2011 17 15 5123 5131 10.1158/1078-0432.CCR-11-0682 21673063 PMC3149769 108. Yang X Cheng Y Zhou J Targeting cancer metabolism plasticity with JX06 nanoparticles via inhibiting PDK1 combined with metformin for endometrial cancer patients with diabetes Advanc Sci 2022 9 8 2104472 10.1002/advs.202104472 PMC8922133 35064767 109. Vaz CV Marques R Alves MG Androgens enhance the glycolytic metabolism and lactate export in prostate cancer cells by modulating the expression of GLUT1, GLUT3, PFK, LDH and MCT4 genes J Cancer Res Clin Oncol 2016 142 1 5 16 10.1007/s00432-015-1992-4 26048031 PMC11819079 110. Conde VR Oliveira PF Nunes AR The progression from a lower to a higher invasive stage of bladder cancer is associated with severe alterations in glucose and pyruvate metabolism Exp Cell Res 2015 335 1 91 98 10.1016/j.yexcr.2015.04.007 25907297 111. Suzawa N Ito M Qiao S Assessment of factors influencing FDG uptake in non-small cell lung cancer on PET/CT by investigating histological differences in expression of glucose transporters 1 and 3 and tumour size Lung Cancer 2011 72 2 191 198 10.1016/j.lungcan.2010.08.017 20884076 112. Nagamatsu S Sawa H Wakizaka A Hoshino T Expression of facilitative glucose transporter isoforms in human brain tumors J Neurochem 1993 61 6 2048 2053 10.1111/j.1471-4159.1993.tb07441.x 8245960 113. Ito T Noguchi Y Satoh S Hayashi H Inayama Y Kitamura H Expression of facilitative glucose transporter isoforms in lung carcinomas: its relation to histologic type, differentiation grade, and tumor stage Mod Pathol 1998 11 5 437 443 9619596 114. Olszewski K Barsotti A Feng XJ Inhibition of glucose transport synergizes with chemical or genetic disruption of mitochondrial metabolism and suppresses TCA cycle-deficient tumors Cell Chem Biol 2022 29 3 423 435.e410 10.1016/j.chembiol.2021.10.007 34715056 115. Temre MK Yadav S Goel Y Pandey SK Kumar A Singh SM Glutor, a glucose transporter inhibitor, exerts antineoplastic action on tumor cells of thymic origin: implication of modulated metabolism, survival, oxidative stress, mitochondrial membrane potential, pH homeostasis, and chemosensitivity Front Oncol 2022 12 925666 10.3389/fonc.2022.925666 35847943 PMC9279700 116. Yadav S Pandey SK Goel Y Temre MK Singh SM Diverse stakeholders of tumor metabolism: an appraisal of the emerging approach of multifaceted metabolic targeting by 3-Bromopyruvate Front Pharmacol 2019 10 728 10.3389/fphar.2019.00728 31333455 PMC6620530 ",
  "metadata": {
    "Title of this paper": "Diverse stakeholders of tumor metabolism: an appraisal of the emerging approach of multifaceted metabolic targeting by 3-Bromopyruvate",
    "Journal it was published in:": "International Journal of Nanomedicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481445/"
  }
}