{
  "title": "Paper_861",
  "abstract": "pmc JHEP Rep JHEP Rep 3793 jhepr JHEP Reports 2589-5559 Elsevier PMC12478254 PMC12478254.1 12478254 12478254 41030651 10.1016/j.jhepr.2025.101519 S2589-5559(25)00197-1 101519 1 Research Article Elevated FBXO45 promotes TFG ubiquitination and drives lung metastasis of hepatocellular carcinoma Zhu Zhen-Bao † Wu Di † Mao Cui † Gu Yong-Peng † Zhang Jie Fang Lei Zhang Lei-Da 2518569931@qq.com ⁎ Lin Xiao-Tong 18766312033@163.com ⁎ Xie Chuan-Ming cmxie@tmmu.edu.cn ⁎ Institute of Hepatobiliary Surgery, Southwest Hospital, Third Military Medical University (Army Medical University), Chongqing, China ⁎ 2518569931@qq.com 18766312033@163.com cmxie@tmmu.edu.cn † These authors contributed equally. 10 2025 09 7 2025 7 10 496240 101519 17 1 2025 25 6 2025 4 7 2025 09 07 2025 30 09 2025 01 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Background & Aims Elevated F-box/SPRY domain protein 1 (FBXO45) expression is associated with human hepatocellular carcinoma (HCC). While TP53 mutations represent a common genetic alteration in HCC, the potential regulatory interplay between TP53 and FBXO45 in modulating HCC progression remains unclear. Methods We analyzed the relationship between TP53 and FBXO45 in patients with HCC. A series of assays were also performed to explore the effect of FBXO45 on invasion and metastasis in TP53-mutated HCC cell lines and mouse models. These experimental findings were further validated in clinical samples. Results FBXO45 expression was upregulated in 78.3% (83/106) of patients with HCC with TP53 mutation, marking an aggressive subtype. Overexpression of FBXO45 significantly enhanced HCC cell migration and invasion capacity ( p p In vivo p = Conclusions Our results provide new mechanistic insight into the role of FBXO45 in driving HCC invasion and metastasis. Therefore, targeting the TP53–FBXO45–TFG–ATF2–NF-κB axis represents a promising therapeutic approach for treating aggressive HCC with TP53 mutations. Impact and implications This study highlights that FBXO45 is highly expressed in patients with HCC with TP53 mutations. FBXO45 promotes HCC lung metastasis by activating the TFG–ATF2–NF-κB–epithelial–mesenchymal transition signaling axis. In addition, we found that targeting the TP53–FBXO45–TFG–ATF2–NF-κB axis could be a novel approach for the treatment of metastatic HCC. Graphical abstract Image 1 Highlights • TP53 mutation leads to high FBXO45 expression and promotes HCC metastasis. • FBXO45 promotes cellular invasion and migration via the ubiquitination of TFG and activation of ATF2–NF-κB–epithelial–mesenchymal transition signaling. • TFG knockdown significantly inhibited FBXO45-driven HCC lung metastasis in mice. • FBXO45 labels an aggressive subtype of patients with TP53-mutated HCC. Keywords TP53 mutation FBXO45 TFG Ubiquitination EMT NF-κB HCC pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Primary liver cancer is the sixth most common malignancy and the third leading cause of cancer-related death worldwide, with hepatocellular carcinoma (HCC) accounting for >80% of all liver cancer cases. 1 2 Ubiquitination is a common post-translational modification of proteins and comprises a three-enzyme cascade reaction mediated by ubiquitin-activating enzyme (E1), ubiquitin-conjugating enzyme (E2), and ubiquitin ligase (E3). Ubiquitination results in monoubiquitin or polyubiquitin chain modification of substrate proteins and regulates the stability and activity of substrates, thus participating in a variety of physiological cellular processes, including protein localization, cell survival and apoptosis, cellular differentiation, and DNA damage. 3 , 4 5 , 6 [7] [8] [9] [10] 11 Trk-fused gene (TFG) protein is a three-part protein comprising an N-terminal Phox and Bem1p homology (PB1) domain, a coiled-coil domain, and a proline- and glutamine-rich region, and is located at the exit site of the endoplasmic reticulum in the cytoplasm. 12 [13] [14] [15] [16] [17] [18] [19] 20 In this study, we demonstrated that FBXO45 promotes the invasion and metastasis of TP53-mutated HCC and promotes lung metastasis of HCC in mice. Mechanistically, mutant TP53 results in high expression of FBXO45. Subsequently, FBXO45 specifically binds to TFG, promotes TFG polyubiquitination, and maintains its stability; TFG then activates the nuclear factor-kappa B (NF-κB) pathway to mediate HCC invasion and metastasis via the epithelial–mesenchymal transition (EMT) pathway. Together, our findings could provide a new therapeutic strategy for patients with aggressive HCC with high FBXO45 expression. Materials and methods Patients and tissue specimens HCC tissues were obtained from the Department of Hepatobiliary Surgery, Southwest Hospital of Chongqing, China. The samples were confirmed histologically, fixed in paraformaldehyde solution, and embedded in paraffin for additional histological analysis. This study protocol conformed to the ethical guidelines of the 1975 Declaration of Helsinki and was approved by the Ethics Committee of Southwest Hospital (KY2020127). Informed consent was obtained from all patients, and detailed clinical and pathological data were obtained for each patient. Cell culture studies The human HCC cell line HCCLM3 was obtained from BeiNa Culture Collection (Beijing, China). The Huh7 cell line was obtained from Cell Bank of Type Culture Collection of Fudan University (Shanghai, China). HEK-293T, HepG2, and SK-Hep-1 were obtained from ATCC. Mycoplasma contamination was not detected in any of the cell lines, which were then cultured at 37 °C, 5% CO 2 Animal studies and orthotopic xenograft model in nude mice BALB/c nude mice (4–5-weeks old, males, n = 9 per group) were obtained from GemPharmatech Co. Ltd (Chengdu, China) and were fed under specific pathogen-free conditions. Nude mice were divided into four groups and anesthetized with isoflurane by inhalation. The skin was then incised along the middle of the abdomen to expose the left lobe of the liver. Nude mice were injected with HCCLM3 cells expressing stable transitions (2 × 10 6 In vivo To examine the ubiquitination of TFG by FBXO45, HEK293T cells were transfected with His-Ub and Flag-FBXO45 with HA-TFG or its mutant HA-TFG (K103A). After 72 h of transfection, the cells were treated with 10 μM MG132 for 4–6 h before harvest for an in vivo 21 2 4 2 4 2 4 2 4 2 4 2 4 Statistical analysis All data are presented as means ± SEMs. Comparisons between two groups were performed with a two-tailed unpaired t post hoc p Results TP53 loss causes high FBXO45 expression in HCC FBXO45 is highly expressed in HCC tissues and promotes HCC development, but the underlying mechanism remains unknown. 11 Fig. 1 Fig. 1 p p Fig. 1 Fig. S1A Table S1 FBXO45 Fig. S1B and C Fig. 1 TP53 loss causes high FBXO45 expression in HCC. (A) mRNA expression of FBXO45 t 2 p p Fig. 1 Next, we used IHC staining to measure TP53 and FBXO45 expression in 141 pairs of HCC tissues. The results revealed a negative correlation between TP53 and FBXO45 in HCC tissues ( Fig. 1 Fig. S1D Fig. 1 Previous research showed that most tumor-derived TP53 mutations occur in the region of the TP53 DNA-binding domain. 22 Fig. S1E–G We previously reported that TP53 insufficiency increased mammalian target of rapamycin (mTOR) signaling, which promoted HCC tumorigenesis and lung metastasis. 23 Fig. 1 FBXO45 promotes cell migration and invasion via the EMT pathway in TP53-mutated HCC cells Metastasis of HCC is the main cause of poor patient prognosis, but whether FBXO45 overexpression is an independent risk factor for metastatic HCC is unclear. To investigate the association between FBXO45 and HCC metastasis, we analyzed clinical specimens from 60 patients with HCC with TP53 mutations and found that FBXO45 was positively correlated with HCC metastasis, histological grade, recurrence, and TNM stage ( Fig. 2 Table S2 Fig. 2 Fig. 2 ICAM1 uPA CCL2 MMP9 Fig. 2 Fig. 2 Fig. 2 FBXO45 promotes HCC metastasis and EMT. (A) FBXO45 expression was associated with metastasis and TNM stage in 60 patients with HCC with TP53 mutations. (B–E) HCCLM3 and Huh7 cells were transfected with Flag-FBXO45 alone or with an siRNA targeting FBXO45 (siFBXO45) for 48 h. A portion of the cells was harvested for Western blotting (B,C). Other portions were reseeded into Transwell plates for migration and invasion assays (D,E). (F–I) HCCLM3 and Huh7 cells were transfected with Flag-FBXO45 alone or with an siRNA targeting FBXO45 (siFBXO45) for 48 h, followed by qRT-PCR with the indicated primers (F,G) or Western blotting with the indicated antibodies (H,I). Scale bar: 100 μm. Data are means ± SEMs, n = 3 (D–G), biological replicates, analyzed with unpaired t 2 p p p p Fig. 2 EMT, which mainly involves the transient dedifferentiation of epithelial cells into cells with mesenchymal phenotypes, is a major trigger for cancer metastasis and invasion. 24 Fig. 2 FBXO45 promotes TFG K103 polyubiquitination and stability FBXO45, an atypical E3 ubiquitin ligase, binds to substrates to perform various functions. We used proteomics, ubiquitomics, and co-immunoprecipitation (Co-IP) mass spectrometry to screen FBXO45 substrates. In all, 713 proteins were upregulated, and 615 proteins were upregulated at ubiquitin sites in HCC cells with high expression of FBXO45. In addition, an anti-FBXO45 antibody pulled down 46 proteins as candidate proteins. We generated Venn diagrams from these data and identified two overlapping proteins: TFG and ribosomal protein S27A (RPS27A). FBXO45 overexpression in HCC cells did not significantly affect the mRNA levels of TFG and RPS27A ( Fig. S2A Fig. 3 [16] [17] [18] [19] Fig. S2B and C Fig. S2D and E Fig. 3 FBXO45 promotes TFG K103 polyubiquitination and extends its half-life. (A) Venn diagram of the number of upregulated proteins (blue) (score >10) and ubiquitinated sites (red) in FBXO45-overexpressing cells and the proteins that bind to FBXO45 (green) in HCCLM3 cells. (B,C) Interaction between FBXO45 and endogenous TFG. HCCLM3 and Huh7 cells were transfected with Flag-FBXO45 plasmids for 48 h and then lysed. The cell lysates were incubated with the indicated antibodies and Protein A/G PLUS-Agarose, followed by Western blotting. (D) K103 in TFG is evolutionarily conserved in various species. (E) TFG was ubiquitinated by FBXO45, while the K103A mutation partially blocked this effect. HEK293T cells were transfected with the indicated plasmids, followed by pull-down using Ni-NTA beads or direct Western blotting with the indicated antibodies. (F) FBXO45 overexpression extended the half-life of TFG. HCCLM3 and Huh7 cells were transfected with Flag-FBXO45 plasmids for 48 h, followed by release after treatment with CHX (100 μg/ml) for various time intervals. (G,H) HCCLM3 and Huh7 cells were transfected with HA-TFG or HA-TFG (K103A) for 48 h. A portion of the cells was harvested for Western blotting (G). Other portions were reseeded into Transwell plates for migration assays (H). Scale bar: 100 μm. Data are means ± SEMs; n = 3 (H), biological replicates; proteomics/ubiquitomics: n = 1; analyzed with unpaired t p p Fig. 3 To confirm the interaction between FBXO45 and TFG, we examined the binding of these two proteins via a pull-down assay. The results revealed that endogenous and exogenous TFG was precipitated by FBXO45 but not by a FBXO45 domain deletion mutant (FBXO45Δ F Fig. 3 Fig. S3A and B Fig. 3 Fig. 3 In vivo Fig. 3 Fig. S3C A ubiquitination assay was performed to investigate whether TFG ubiquitylation was dependent on SKP1 and PAM activity. Knockdown of either SKP1 or PAM significantly blocked FBXO45-mediated TFG ubiquitination ( Fig. S3D Fig. 3 Fig. S3E To confirm that TFG K103 ubiquitination affects HCC cell migration, we transfected HA-TFG or its mutant HA-TFG (K103A) into Huh7 and HCCLM3 cells. TFG significantly promoted the migration of TP53-mutated HCC cells, whereas its K103A mutant form did not ( Fig. 3 FBXO45 promotes HCC metastasis and EMT via TFG In lymphoma and thyroid carcinoma, TFG usually leads to tumorigenesis directly through the formation of fusion genes. 17 , 18 Fig. 4 Fig. 4 Fig. 4 Fig. S4A Fig. 4 Fig. 4 FBXO45-mediated HCC metastasis and EMT are dependent on TFG. (A,B) HCCLM3 and Huh7 cells were transfected with HA-TFG for 48 h. A portion of the cells was harvested for Western blotting (A). Other portions were reseeded into Transwell plates for migration and invasion assays (B). (C) HCCLM3 cells were transfected with siRNA targeting TFG (siTFG) for 48 h, followed by Western blotting with the indicated antibodies. (D–G) HCCLM3 and Huh7 cells were transfected with Flag-FBXO45 with or without siTFG for 48 h. A portion of the cells was reseeded into Transwell plates for migration and invasion assays (D,E). Other portions were harvested for Western blotting (F,G). Scale bar: 100 μm. Data are means ± SEMs; n = 3 (B–E), biological replicates; analyzed with unpaired t p p p Fig. 4 TFG regulates the ATF2/NF-κB pathway to promote HCC metastasis Previous studies reported that TFG promotes tumorigenesis via fusion with oncogenes, 16 , 25 [26] [27] [28] Fig. 5 [29] [30] [31] [32] Fig. S4B and C Fig. 5 FBXO45 promotes HCC metastasis via TFG–ATF2–NF-κB p65 axis. (A,B) HCCLM3 cells were transfected with siRNA targeting TFG (siTFG) for 48 h, followed by qRT-PCR with the indicated primers (A) or Western blotting with the indicated antibodies (B). (C–E) HCCLM3 and Huh7 cells were transfected with HA-TFG with or without siRNA targeting NF-κB p65 (siNF-κB p65) for 48 h. A portion of the cells was reseeded into Transwell plates for migration and invasion assays (C). Other portions were harvested for Western blotting (D,E). Scale bar: 100 μm. Data are means ± SEMs; n = 3 (C), biological replicates, analyzed with unpaired t p p Fig. 5 To investigate whether TFG-mediated HCC cell migration and invasion depend on the NF-κB pathway, HCCLM3 and Huh7 cells were subsequently transfected with TFG plasmids and siRNAs targeting NF-κB p65. NF-κB p65 silencing not only significantly attenuated the TFG-mediated migration of HCC cells, but also downregulated the TFG-mediated increase in the expression of N-cadherin and Snail ( Fig. 5 Knockdown of TFG blocks FBXO45-driven HCC tumorigenesis and lung metastasis in mice We demonstrated that FBXO45 promotes the migration and invasion of TP53-mutated HCC cells through the ubiquitination and increased stability of TFG. To further confirm the role of FBXO45 and TFG in HCC lung metastasis, we established an orthotopic xenograft model in nude mice. Four groups of lentivirus-transfected HCCLM3 cell lines (vector, FBXO45, shTFG, and FBXO45+shTFG) were injected into the livers of the mice in situ Fig. 6 Fig. 6 Fig. S4D Fig. 6 Fig. 6 Fig. 6 TFG knockdown blocks FBXO45-drsiven HCC tumorigenesis and lung metastasis in mice. (A) Schematic showing the established orthotopic HCC model in nude mice. (B–E) Images of whole livers with orthotopic tumors and isolated tumors (B) from the vector, FBXO45, shTFG, and FBXO45+shTFG groups. (C) Tumor volume. (D) Tumor weight. (E) Largest tumor size. The tumor volume was calculated using the formula: tumor volume = π/6xaxb 2 p p p p Fig. 6 Positive association between FBXO45 and TFG in patients with TP53-mutated HCC, leading to poor prognosis A human TP53-mutated HCC cohort (60 paired HCC tissues and adjacent normal tissues) was used to evaluate the expression level of TFG. IHC staining revealed that TFG was highly expressed in HCC tissues ( Fig. 7 p Fig. 7 Fig. 7 Table S3 p Fig. 7 Fig. S5A Fig. 7 Positive association between FBXO45 and TFG in patients with TP53-mutated HCC. (A) Expression of TFG in TP53-mutated HCC tissue samples was evaluated by IHC staining using an anti-TFG antibody. (B) Association between TFG expression and OS of patients with TP53-mutated HCC (TFG expression cut-off: 30%). (C–E) Relationships between TFG protein expression and (C) largest tumor size, (D) tumor metastasis, and (E) TNM stage. (F) Expression of TP53, TFG, and FBXO45 in HCC tissue samples determined by IHC staining. (G) Spearman correlation analysis between the protein levels of FBXO45 and TFG in 60 patients with P53-mutated HCC. (H) Patients with high co-expression of FBXO45 and TFG exhibited worse OS compared with those with low expression of these two proteins (TFG expression cut-off: 30%, FBXO45 expression cut-off: 20%). Data are means ± SEMs; analyzed with the log-rank test (B,H), unpaired t 2 p Fig. 7 To further determine the importance of FBXO45 and TFG in metastasis, we evaluated the expression of FBXO45 and TFG in primary tumors of patients with HCC with and without metastasis. The results suggest that FBXO45 and TFG are more highly expressed in patients with metastasis ( Fig. S5B and C Fig. 7 Fig. S5D–G Fig. 8 Fig. 8 Model of FBXO45-driven HCC metastasis. Under physiological conditions, wild-type TP53 maintains FBXO45 at a low expression level via the mTOR signaling pathway, which leads to low TFG levels and normal hepatocyte growth. When TP53 is mutated, mTOR signaling is activated, and FBXO45 expression is upregulated, which promotes TFG polyubiquitination and stability. Subsequently, TFG binds the transcription factor ATF2 to upregulate NF-κB p65 expression, which then activates the NF-κB pathway, leading to HCC EMT and metastasis. ATF2, activating transcription factor 2; EMT, epithelial–mesenchymal transition; FBXO45, F-box/SPRY domain protein 1; HCC, hepatocellular carcinoma; mTOR, mammalian target of rapamycin; NF-κB, nuclear factor-kappa B; TFG, Trk-fused gene. Fig. 8 Discussion Most patients with HCC have a poor prognosis because of tumor metastasis, but the precise mechanisms underlying this metastasis are not well understood. Previous studies showed that aberrant expression of E3 ubiquitin ligases is closely associated with HCC and can mediate the development of HCC through ubiquitination, leading to the activation of some proto-oncogenes or the degradation of oncogenes. 33 , 34 in vivo FBXO45, an atypical E3 ubiquitin ligase, is incompatible with the scaffold protein Cullin1 because of a point mutation in the F-box functional domain, but its F-box motif specifically binds to SKP1. Members of the PAM–Highwire–RPM-1 (PHR) protein family are recruited to replace Cullin1 and continue to function as E3 ubiquitin ligases. 35 36 37 38 , 39 11 TFG is located at the exit site of the endoplasmic reticulum in the cytoplasm and is involved in a variety of biological functions. In thyroid cancer, TFG fuses with the 3' end of NTRK1 to produce the TRK-T3 fusion gene, which can cause cancer. 18 40 26 , 27 25 16 ATF2, a member of the ATF/CREB family of basic leucine zipper proteins, is ubiquitously expressed 41 42 , 43 29 [30] [31] [32] Overall, our study demonstrated that FBXO45 is abnormally overexpressed in patients with HCC with TP53 mutations. A high level of FBXO45 recognizes and binds TFG and promotes ubiquitination at the lysine 103 residue of TFG, which promotes the stability of TFG and maintains high levels of the TFG protein. In turn, this activates the NF-κB signaling pathway and mediates HCC metastasis via EMT. These results emphasize that targeting the TP53–FBXO45–TFG–ATF2–NF-κB axis may be a novel approach for the treatment of metastatic HCC. Abbreviations ATF2, activating transcription factor 2; CCL2, C–C motif chemokine ligand 2; CHX, cycloheximide; Co-IP, co-immunoprecipitation; Co-IP, co-immunoprecipitation; COPII, coat protein complex II; E1, ubiquitin-activating enzyme; E2, ubiquitin-conjugating enzyme; E3, ubiquitin ligase; EMT, epithelial–mesenchymal transition; FBXO45, F-box/SPRY domain protein 1; GGNBP2, gametogenetin binding protein 2; HCC, Hepatocellular carcinoma; ICAM1, intercellular adhesion molecule; IGF2BP1, insulin-like growth factor 2 mRNA-binding protein 1; IHC, immunohistochemistry; LIPC, hepatic lipase type C.MMP9, matrix metallopeptidase 9; mTOR, mammalian target of rapamycin; NEMO, NF-κB essential modulator; NF-κB, nuclear factor-kappa B; Ni-NTA, nickel-nitrilotriacetic acid; OS, overall survival; Par-4, prostate apoptosis response protein 4; PB1, Phox and Bem1p homology; PHR, PAM–Highwire–RPM-1; RPS27A, ribosomal protein S27a; SIAH-1, seven in absentia homolog; siRNA, small interfering RNA; SYVN1, synoviolin; TANK, TRAF family member-associated NF-κB activator; TCGA, The Cancer Genome Atlas; TFG, Trk-fused gene; TNM, tumor–node–metastasis; uPA, urokinase-type plasminogen activator; USP49, ubiquitin-specific peptidase 49; WCE, whole-cell extracts; WT, wild type. Financial support This work was supported by the 10.13039/501100001809 National Natural Science Foundation of China 10.13039/501100001809 NSFC 10.13039/501100001809 National Natural Science Foundation of China 10.13039/501100001809 NSFC 10.13039/501100005230 Natural Science Foundation of Chongqing Authors’ contribution Supervised the project and designed the study: C-MX, X-TL. Performed the experiments: Z-BZ, X-TL, DW. Performed animal experiments: Z-BZ, CM, Y-PG. Contributed to acquisition of data: JZ, CM. Analyzed the data and wrote the first draft of the manuscript: Z-BZ, X-TL. Revised the manuscript: C-MX. Provided financial support: X-TL, C-MX, L-DZ. Approved the manuscript: all authors. Data availability All data are available from the corresponding authors upon reasonable request. Conflicts of interest The authors declare no competing interests. Please refer to the accompanying ICMJE disclosure forms for further details. References 1 Sung H. Ferlay J. Siegel R.L. Global Cancer Statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 71 2021 209 249 33538338 10.3322/caac.21660 2 Brown Z.J. Tsilimigras D.I. Ruff S.M. Management of hepatocellular carcinoma: a review JAMA Surg 158 2023 410 420 36790767 10.1001/jamasurg.2022.7989 3 Meyer-Schwesinger C. The ubiquitin-proteasome system in kidney physiology and disease Nat Rev Nephrol 15 2019 393 411 31036905 10.1038/s41581-019-0148-1 4 Teixeira L.K. Reed S.I. Ubiquitin ligases and cell cycle control Annu Rev Biochem 82 2013 387 414 23495935 10.1146/annurev-biochem-060410-105307 5 Duan S. Pagano M. Ubiquitin ligases in cancer: functions and clinical potentials Cell Chem Biol 28 2021 918 933 33974914 10.1016/j.chembiol.2021.04.008 PMC8286310 6 Deng L. Meng T. Chen L. The role of ubiquitination in tumorigenesis and targeted drug discovery Signal Transduct Target Ther 5 2020 11 32296023 10.1038/s41392-020-0107-0 PMC7048745 7 Brauckhoff A. Malz M. Tschaharganeh D. Nuclear expression of the ubiquitin ligase seven in absentia homolog (SIAH)-1 induces proliferation and migration of liver cancer cells J Hepatol 55 2011 1049 1057 21356256 10.1016/j.jhep.2011.02.019 8 Liu M. Jiang K. Lin G. Ajuba inhibits hepatocellular carcinoma cell growth via targeting of beta-catenin and YAP signaling and is regulated by E3 ligase Hakai through neddylation J Exp Clini Cancer Res 37 2018 165 10.1186/s13046-018-0806-3 PMC6057013 30041665 9 Luo Y.D. Zhang J. Fang L. FBXW10 promotes hepatocarcinogenesis in male patients and mice Carcinogenesis 41 2020 689 698 31400758 10.1093/carcin/bgz138 10 Ji F. Zhou M. Sun Z. Integrative proteomics reveals the role of E3 ubiquitin ligase SYVN1 in hepatocellular carcinoma metastasis Cancer Commun 41 2021 1007 1023 10.1002/cac2.12192 PMC8504139 34196494 11 Lin X.T. Yu H.Q. Fang L. Elevated FBXO45 promotes liver tumorigenesis through enhancing IGF2BP1 ubiquitination and subsequent PLK1 upregulation eLife 10 2021 e70715 10.7554/eLife.70715 PMC8641947 34779401 12 Steinmetz T.D. Schlotzer-Schrehardt U. Hearne A. TFG is required for autophagy flux and to prevent endoplasmic reticulum stress in CH12 B lymphoma cells Autophagy 17 2021 2238 2256 32910713 10.1080/15548627.2020.1821546 PMC8496724 13 Khan K.A. Marineau A. Doyon P. TRK-Fused Gene (TFG), a protein involved in protein secretion pathways, is an essential component of the antiviral innate immune response Plos Pathog 17 2021 e1009111 10.1371/journal.ppat.1009111 PMC7790228 33411856 14 Shi J.H. Ling C. Wang T.T. TRK-fused gene (TFG) regulates ULK1 stability via TRAF3-mediated ubiquitination and protects macrophages from LPS-induced pyroptosis Cell Death Dis 13 2022 93 35091545 10.1038/s41419-022-04539-9 PMC8795729 15 Carinci M. Testa B. Bordi M. TFG binds LC3C to regulate ULK1 localization and autophagosome formation EMBO J 40 2021 e103563 10.15252/embj.2019103563 PMC8126910 33932238 16 Endoh K. Nishi M. Ishiguro H. Identification of phosphorylated proteins involved in the oncogenesis of prostate cancer via Pin1-proteomic analysis Prostate 72 2012 626 637 21809350 10.1002/pros.21466 17 Cao Z. Gao Q. Fu M. Anaplastic lymphoma kinase fusions: roles in cancer and therapeutic perspectives Oncol Lett 17 2019 2020 2030 30675269 10.3892/ol.2018.9856 PMC6341817 18 Greco A. Mariani C. Miranda C. The DNA rearrangement that generates the TRK-T3 oncogene involves a novel gene on chromosome 3 whose product has a potential coiled-coil domain Mol Cell Biol 15 1995 6118 6127 7565764 10.1128/mcb.15.11.6118 PMC230863 19 Mencinger M. Panagopoulos I. Andreasson P. Characterization and chromosomal mapping of the human TFG gene involved in thyroid carcinoma Genomics 41 1997 327 331 9169129 10.1006/geno.1997.4625 20 Chen Y. Tseng S.H. Targeting tropomyosin-receptor kinase fused gene in cancer Anticancer Res 34 2014 1595 1600 24692687 21 Zhang J. Lin X.T. Yu H.Q. Elevated FBXL6 expression in hepatocytes activates VRK2-transketolase-ROS-mTOR-mediated immune evasion and liver cancer metastasis in mice Exp Mol Med 55 2023 2162 2176 37653031 10.1038/s12276-023-01060-7 PMC10618235 22 Kastenhuber E.R. Lowe S.W. Putting p53 in context Cell 170 2017 1062 1078 28886379 10.1016/j.cell.2017.08.028 PMC5743327 23 Li X. Zhang C.C. Lin X.T. Elevated expression of WSB2 degrades p53 and activates the IGFBP3-AKT-mTOR-dependent pathway to drive hepatocellular carcinoma Exp Mol Med 56 2024 177 191 38177295 10.1038/s12276-023-01142-6 PMC10834962 24 Jia L. Li J. Li P. Site-specific glycoproteomic analysis revealing increased core-fucosylation on FOLR1 enhances folate uptake capacity of HCC cells to promote EMT Theranostics 11 2021 6905 6921 34093861 10.7150/thno.56882 PMC8171077 25 Miranda C. Roccato E. Raho G. The TFG protein, involved in oncogenic rearrangements, interacts with TANK and NEMO, two proteins involved in the NF-kappaB pathway J Cell Physiol 208 2006 154 160 16547966 10.1002/jcp.20644 26 Zhang Y. Ni W. Qin L. RUFY3 promotes the progression of hepatocellular carcinoma through activating NF-κB-mediated epithelial-mesenchymal transition Aging 13 2021 21283 21293 34510031 10.18632/aging.203444 PMC8457573 27 Liu J. Wu Z. Han D. Mesencephalic astrocyte-derived neurotrophic factor inhibits liver cancer through small ubiquitin-related modifier (SUMO)ylation-related suppression of NF-kappaB/Snail Signaling pathway and epithelial-mesenchymal transition Hepatology 71 2020 1262 1278 31469428 10.1002/hep.30917 PMC7187412 28 Zhu W. Zhao Y. Zhou J. Monoacylglycerol lipase promotes progression of hepatocellular carcinoma via NF-kappaB-mediated epithelial-mesenchymal transition J Hematol Oncol 9 2016 127 27884159 10.1186/s13045-016-0361-3 PMC5123220 29 Cuhlmann S. Van der Heiden K. Saliba D. Disturbed blood flow induces RelA expression via c-Jun N-terminal kinase 1 Circ Res 108 2011 950 959 21350211 10.1161/CIRCRESAHA.110.233841 30 Bao Z.M. Yao D. Qian X. Activating transcription factor 2 promotes the progression of hepatocellular carcinoma by inducing the activation of the WHSC1-mediated TOP2A/PI3K/AKT axis Kaohsiung J Med Sci 38 2022 662 674 35394699 10.1002/kjm2.12536 PMC11896258 31 Li Z.J. Zhang J.P. Li D.Y. ATF2 accelerates the invasion and metastasis of hepatocellular carcinoma through targeting the miR-548p/TUFT1 axis Hepatol Res 52 2022 281 297 34904343 10.1111/hepr.13740 32 Sun J. Dong Z. Chang Z. MARCH6 promotes hepatocellular carcinoma development through up-regulation of ATF2 BMC Cancer 21 2021 827 34273954 10.1186/s12885-021-08540-x PMC8285810 33 Wang F. Zhang Y. Shen J. The ubiquitin E3 ligase TRIM21 promotes hepatocarcinogenesis by suppressing the p62-Keap1-Nrf2 antioxidant pathway Cell Mol Gastroenterol Hepatol 11 2021 1369 1385 33482392 10.1016/j.jcmgh.2021.01.007 PMC8024979 34 Li X. Yuan J. Song C. Deubiquitinase USP39 and E3 ligase TRIM26 balance the level of ZEB1 ubiquitination and thereby determine the progression of hepatocellular carcinoma Cell Death Differ 28 2021 2315 2332 33649471 10.1038/s41418-021-00754-7 PMC8329202 35 Desbois M. Crawley O. Evans P.R. PAM forms an atypical SCF ubiquitin ligase complex that ubiquitinates and degrades NMNAT2 J Biol Chem 293 2018 13897 13909 29997255 10.1074/jbc.RA118.002176 PMC6130950 36 Chen X. Sahasrabuddhe A.A. Szankasi P. Fbxo45-mediated degradation of the tumor-suppressor Par-4 regulates cancer cell survival Cell Death Differ 21 2014 1535 1545 24992930 10.1038/cdd.2014.92 PMC4158693 37 Cao T. Cui Y. Wang Y. CACNA1C-AS2 inhibits cell proliferation and suppresses cell migration and invasion via targeting FBXO45 and PI3K/AKT/mTOR pathways in glioma Apoptosis 27 2022 979 991 36038736 10.1007/s10495-022-01764-7 38 Wang Q. Wu L. Cao R. Fbxo45 promotes the malignant development of esophageal squamous cell carcinoma by targeting GGNBP2 for ubiquitination and degradation Oncogene 41 2022 4795 4807 36127399 10.1038/s41388-022-02468-7 39 Wu L. Yu K. Chen K. Fbxo45 facilitates pancreatic carcinoma progression by targeting USP49 for ubiquitination and degradation Cell Death Dis 13 2022 231 35279684 10.1038/s41419-022-04675-2 PMC8918322 40 Caamano J. Hunter C.A. NF-kappaB family of transcription factors: central regulators of innate and adaptive immune functions Clin Microbiol Rev 15 2002 414 429 12097249 10.1128/CMR.15.3.414-429.2002 PMC118079 41 Han S.I. Yasuda K. Kataoka K. ATF2 interacts with beta-cell-enriched transcription factors, MafA, Pdx1, and beta2, and activates insulin gene transcription J Biol Chem 286 2011 10449 10456 21278380 10.1074/jbc.M110.209510 PMC3060498 42 Lau E. Ronai Z.A. ATF2 - at the crossroad of nuclear and cytosolic functions J Cell Sci 125 2012 2815 2824 22685333 10.1242/jcs.095000 PMC3434827 43 Yu T. Li Y.J. Bian A.H. The regulatory role of activating transcription factor 2 in inflammation Mediators Inflamm 2014 2014 950472 10.1155/2014/950472 PMC4090481 25049453 Supplementary data The following are the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Multimedia component 2 Multimedia component 2 Multimedia component 3 Multimedia component 3 Multimedia component 4 Multimedia component 4 Multimedia component 5 Author names in bold designate shared co-first authorship Supplementary data to this article can be found online at https://doi.org/10.1016/j.jhepr.2025.101519 ",
  "metadata": {
    "Title of this paper": "The regulatory role of activating transcription factor 2 in inflammation",
    "Journal it was published in:": "JHEP Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478254/"
  }
}