{
  "title": "Paper_959",
  "abstract": "pmc Biomed Res Int Biomed Res Int 2029 bmri BMRI BioMed Research International 2314-6133 2314-6141 Wiley PMC12407288 PMC12407288.1 12407288 12407288 41031258 10.1155/bmri/9865234 BMRI9865234 1 Retraction Article RETRACTION: Stat3 Upregulates Leucine‐Rich Repeat‐Containing G Protein‐Coupled Receptor 4 Expression in Osteosarcoma Cells International BioMed Research bmri.office@wiley.com 27 8 2025 2025 2025 479482 9865234 11 8 2025 11 8 2025 27 08 2025 30 09 2025 01 10 2025 Copyright © 2025 BioMed Research International published by John Wiley & Sons Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Stat3 Upregulates Leucine-Rich Repeat-Containing G Protein-Coupled Receptor 4 Expression in Osteosarcoma Cells 2013 25 12 2013 310691 BioMed Research International 10.1155/2013/310691 PMC3886594 24455684 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.2 mode:remove_FC converted:27.08.2025  International BioMed Research RETRACTION: Stat3 Upregulates Leucine‐Rich Repeat‐Containing G Protein‐Coupled Receptor 4 Expression in Osteosarcoma Cells BioMed Research International 2025 9865234 2025 10.1155/bmri/9865234 PMC3886594 24455684 RETRACTION: J. Liu, W. Wei, C‐A. Guo, et al., “Stat3 Upregulates Leucine‐Rich Repeat‐Containing G Protein‐Coupled Receptor 4 Expression in Osteosarcoma Cells,” BioMed Research International https://doi.org/10.1155/2013/310691 The above article, published online on 25 December 2013 in Wiley Online Library ( http://wileyonlinelibrary.com 1 • In Figures 1c and 1e, the GAPDH blots are identical to the Figure 1c FBXO22 blots in [ 2 • In Figure 2d, the LGR4 blots are identical to the top Patient 1 blots in Figure 6a in [ 2 • In Figure 2b, the GAPDH blots are identical to the FoxO1 blots shown in Figure 5b of [ 3 • In Figure 3d, the Stat3 blots are identical to the PTPN13 blots shown in Figure 2c of [ 4 • In Figure 3b, the Stat3 blots are identical to the SENP1 blots shown in Figure 3c of [ 5 • In Figure 3b, the LGR4 blots appear similar to the Twist 1 blots shown in Figure 2b of [ 3 • In Figure 4a, the Lamin B blots are identical to the Figure 4a Lamin B blots in [ 6 • In Figure 4b, the Lamin B blots are identical to the Figure 3a GADPH blots in [ 6 • In Figure 4e, the β 3 The authors did not respond to the retraction. 1 Bik E. Pandani T. Stat3 Upregulates Leucine-Rich Repeat-Containing G Protein-Coupled Receptor 4 Expression in Osteosarcoma Cells PubPeer 2023 https://pubpeer.com/publications/45C582D9CB5547B3D6984EC902BF98 10.1155/2013/310691 PMC3886594 24455684 2 Tian X. Dai S. Sun J. Jin G. Jiang S. Meng F. Li Y. Wu D. Jiang Y. F-Box Protein FBXO22 Mediates Polyubiquitination and Degradation of KLF4 to Promote Hepatocellular Carcinoma Progression Oncotarget 2015 6 22767 22775 10.18632/oncotarget.4082 26087183 PMC4673198 3 Qian J. Luo Y. Gu X. Zhan W. Wang X. Twist1 Promotes Gastric Cancer Cell Proliferation Through Up-Regulation of FoxM1 PLoS One 2013 8 e77625 10.1371/journal.pone.0077625 24204899 PMC3812021 4 Han X.-J. Xue L. Gong L. Zhu S.-J. Yao L. Wang S.-M. Lan M. Zhang W. Li Y.-H. Stat3 Inhibits PTPN13 Expression in Squamous Cell Lung Carcinoma Through Recruitment of HDAC5 BioMed Research International 2013 2013 10.1155/2013/468963 468963 24191246 PMC3804148 5 Zhou G.-Q. Han F. Shi Z.-L. Yu L. Li X.-F. Yu C. Shen C.-L. Wan D.-W. Zhu X.-G. Li R. He S.-B. MiR-133a-3p Targets SUMO-Specific Protease 1 to Inhibit Cell Proliferation and Cell Cycle Progress in Colorectal Cancer Oncology Research 2018 26 795 800 10.3727/096504017X15004613574679 28748780 PMC7844762 6 Yu C.-Y. Liang G.-B. Du P. Liu Y.-H. Lgr4 Promotes Glioma Cell Proliferation Through Activation of Wnt Signaling Asian Pacific Journal of Cancer Prevention 2013 14 4907 4911 10.7314/APJCP.2013.14.8.4907 24083766 ",
  "metadata": {
    "Title of this paper": "Lgr4 Promotes Glioma Cell Proliferation Through Activation of Wnt Signaling",
    "Journal it was published in:": "BioMed Research International",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12407288/"
  }
}