{
  "title": "Paper_343",
  "abstract": "pmc Biomed Res Int Biomed Res Int 2029 bmri BMRI BioMed Research International 2314-6133 2314-6141 Wiley PMC12487632 PMC12487632.1 12487632 12487632 41041279 10.1155/bmri/9153643 BMRI9153643 1 Research Article Article Comprehensive Analysis of DGATs and PLINs in Ovarian Cancer: Implications for Diagnosis and Prognosis Ayyagari Vijayalakshmi N. https://orcid.org/0000-0003-1001-7044  1  2 vayyagari@siumed.edu Li Miao https://orcid.org/0000-0002-7148-0940  1 Diaz-Sylvester Paula https://orcid.org/0000-0002-1531-1958  1  2  3 Groesch Kathleen https://orcid.org/0000-0003-0124-7761  1  3 Wilson Teresa https://orcid.org/0000-0002-2797-6017  1  3 Pasman Zvi https://orcid.org/0009-0008-3880-8853  4 Brard Laurent https://orcid.org/0000-0003-0065-1826  1  2 Wesley Hannah hwesley@wiley.com   1 Division of Gynecologic Oncology Department of Obstetrics and Gynecology Southern Illinois University School of Medicine Springfield Illinois USA siu.edu   2 Simmons Cancer Institute Southern Illinois University School of Medicine Springfield Illinois USA siu.edu   3 Center for Clinical Research Southern Illinois University School of Medicine Springfield Illinois USA siu.edu   4 Department of Chemistry Illinois College Jacksonville Illinois USA 01 10 2025 2025 2025 479482 9153643 03 9 2025 25 10 2024 08 9 2025 01 10 2025 02 10 2025 03 10 2025 Copyright © 2025 Vijayalakshmi N. Ayyagari et al. BioMed Research International published by John Wiley & Sons Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Background Lipid droplet (LD) dynamics drive cancer cell proliferation, resistance, and aggressiveness. Diacylglycerol O‐acyltransferases (DGATs) and perilipins (PLINs) are key LD‐associated genes implicated in cancer pathophysiology. Objective This study aimed to comprehensively analyze the expression and clinical significance of DGATs and PLINs in ovarian cancer (OC), focusing on their correlation with LDs and triglyceride (TG) levels, and to explore their diagnostic and prognostic implications. Methods LD and TG levels in ovarian cell lines and clinical samples were assessed using BODIPY staining, fluorometric, colorimetric assays, and thin‐layer chromatography (TLC). Gene expression profiling of DGATs and PLINs in cell lines and tissue was conducted via RT‐qPCR, ELISA, and bioinformatics analysis. Correlation analyses between gene expression, Ki67, and survival data were performed. ROC curve analysis evaluated diagnostic potential. Results LD accumulation was significantly higher in OC cell lines and tissues compared with normal controls. Diacylglycerol O‐acyltransferase 1 (DGAT1) and diacylglycerol O‐acyltransferase 2 (DGAT2) were overexpressed in OC cell lines and tissues, particularly in advanced stages (III and IV). Elevated TG levels were observed in OC cell lines and clinical samples, correlating with LD abundance and the expression of DGAT1 and DGAT2. PLIN2 and PLIN3 were significantly upregulated in OC tissues. Bioinformatics analysis identified dysregulation of DGATs and PLINs in OC. Survival analysis indicated DGAT2 is a predictor of poor prognosis. Diagnostic assessments revealed DGAT2 as a potential biomarker for OC detection. Conclusion DGATs and PLINs are pivotal in LD metabolism and tumor progression in OC, with DGAT2 being a good candidate as prognostic and diagnostic marker. They present promising avenues for therapeutic targeting and diagnostic biomarkers, holding the potential to improve patient outcomes. Further exploration of their mechanistic roles and clinical implications is essential for advancing personalized cancer care. Keywords DGATs diagnostic models lipid droplets ovarian cancer PLINs prognostic pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  Ayyagari Vijayalakshmi N. Li Miao Diaz‐Sylvester Paula Groesch Kathleen Wilson Teresa Pasman Zvi Brard Laurent Comprehensive Analysis of DGATs and PLINs in Ovarian Cancer: Implications for Diagnosis and Prognosis BioMed Research International 2025 9153643 2025 10.1155/bmri/9153643  Academic Editor: 1. Introduction Ovarian cancer (OC) is often diagnosed in advanced stages, representing a significant clinical challenge. Despite initial success of treatments, such as cytoreductive surgery and platinum‐based chemotherapy, approximately 70% of patients with advanced OC experience relapse within 1 to 2 years posttreatment [ 1 2 The tendency of OC to metastasize to omental adipocytes indicates the involvement of the fatty acid (FA)–enriched tumor microenvironment in tumor progression [ 3 4 5 6 7 While LDs function as organelles, their biosynthesis, degradation, and other functions depend primarily on associated proteins [ 8 11 12 13 5 6 13 14 LDs are formed de novo following the synthesis of triglycerides (TGs) and cholesterol esters (CEs) by endoplasmic reticulum (ER) resident diacylglycerol O‐acyltransferases (DGATs) and acyl‐CoA cholesterol acyltransferases (ACATs), respectively [ 4 7 5 11 13 15 21 2. Materials and Methods 2.1. Cell Lines and Chemicals Human primary ovarian epithelial cells (H‐6036) were purchased from Cell Biologics (Chicago, IL, United States) and human fallopian tube epithelial cells (HFTECs) from Lifeline Cell Technology (United States). The ovarian carcinoma cell line NIH‐OVCAR3 was obtained from ATCC, and the SKOV‐3 human ovarian carcinoma cell line was provided by Dr. Mary McAsey′s laboratory at SIU School of Medicine in Springfield, IL. Isogenic OC cell line pairs, namely, A2780/A2780‐CDDP and IGROV‐1/IGROV‐1CDDP, were acquired from Dr. Alexander Brodsky at Brown University, Providence, RI. Growth media and conditions were as previously described [ 20 22 DGAT1 and DGAT2 inhibitors, A922500 and PF‐06424439, respectively, were purchased from Millipore Sigma, United States. Antibodies for DGAT1, DGAT2, and PLINs were obtained from Novus Biological (United States). Ki67 antibody was purchased from Abcam (Cambridge, MA, United States). DGAT1 RTU enzyme‐linked immunosorbent assay (ELISA) kit (Catalog # MBS160541) and DGAT2 ELISA kit (Catalog # MBS458842) were purchased from MyBioSource. 2.2. Ethic Statement, Standard Protocol Approvals, and Patient Consent As described earlier [ 21 2.3. Clinical Samples As described earlier [ 21 N N N N 1 Table 1 Clinical and pathological characteristics of samples.  Parameter  Nonmalignant  OC Sample size, n 32 (50) 32 (50) Age, median years (min–max) 64 (38–82) 60 (48–82) BMI, median kg/m 2 27.82 (19–52) 29 (18–47) Premenopausal, n 5 (19) 2 (6) Postmenopausal, n 23 (85) 30 (94) Obesity, n 7 (26) 8 (26) Diabetes, n 7 (26) 6 (19) Hypertension, n 11 (41) 17 (23) Hypothyroidism, n 8 (30) 4 (13) FIGO stage, n Stage I 8 (25) Stage II 4 (13) Stage III 18 (56) Stage IV 2 (6) FIGO grade, n Low grade 6 (19) High grade 22 (69) No information 4 (13) Histotype, n Endometrioid 2 (6) Serous 24 (75) Mucinous 4 (13) Others 2 (6) 2.4. Peripheral Blood, PF, and Tumor Tissue Sample Collection Peripheral blood was collected into sodium heparin tubes before surgery, and PF was obtained during surgery as previously described [ 21 3 2.5. RNA Extraction and cDNA Synthesis RNA was extracted from cell lines, tumor, and normal ovarian tissues as described previously [ 21 23 μ 2.6. Gene Expression Analyses by Reverse Transcription‐Quantitative Polymerase Chain Reaction (RT‐qPCR) mRNA expression levels of key LD‐associated genes were quantified using RT‐qPCR with specific primers obtained from Integrated DNA Technologies, Inc. The procedure was performed as described previously [ 21 23 β ΔΔ β 2.7. Western Blot Analysis Western blotting was performed to evaluate the expression of DGAT1 and DGAT2 proteins in cell lines. Cell seeding, cell lysis, and western blotting were done as described previously [ 20 22 β 2.8. Quantification of DGATs by ELISA DGAT1 and DGAT2 protein levels in cell lysates, plasma, PF, and tissue lysates were quantified using ELISA kits from MyBioSource (San Diego, CA, United States). In cell lines, 4 × 10 5 2 21 23 m e a n μ 2.9. BODIPY 493/503 Staining Cells were treated with 1 μ 2.10. Quantitative Analysis of TG From Cell Lines and Tissue Samples TG quantification was performed using a Colorimetric Assay Kit (Elabscience, United States), following the manufacturer′s guidelines. In cell lines, 1 × 10 6 μ μ 2.11. Bioinformatics Analysis The mRNA expression levels of DGATs and PLIN family genes in OC and normal tissues were analyzed using the GEPIA2 platform ( http://gepia2.cancer-pku.cn/#index https://www.cbioportal.org/ In OC, the association between mRNA expression levels of each individual gene and overall survival (OS) of patients was investigated using the Kaplan–Meier plotter ( http://www.kmplot.com p p 2.12. Statistical Analysis The clinical/pathological variables and comorbidities were described using descriptive statistics. Categorical data are presented as frequencies (percentages) and continuous data as medians (interquartile ranges). All experiments were performed at least in triplicate. Data are expressed as the m e a n s S D U p 3. Results 3.1. LD Accumulation in OC Cell Lines and Clinical Tissues We first evaluated the baseline LD content in various OC cell lines and compared it to normal ovarian (H6036) and HFTEC lines (controls). BODIPY staining revealed a marked increase in LD density in cancer cell lines compared with controls, distinguishing primary cells from cancer cells (Figure 1a 1b 1c p t 1d Figure 1 Lipid droplet (LD) accumulation in OC cell lines and ovarian tissue. (a) Cell lines: visualization of LDs using BODIPY 493/503 staining (green) and nuclei staining (blue) in ovarian cancer (OC) cell lines and nonmalignant ovarian (H6036) and HFTEC lines. OC cell lines exhibit a higher quantity of LDs compared with primary cell lines (H6036, HFTEC). Representative images were captured with an inverted microscope (Olympus H4‐100, CCD camera) using a 20× objective. Scale bar represents 100 μ t p (a) (b) (c) (d) 3.2. Increased TG Levels in OC Cell Lines and Clinical Samples To determine whether TG concentrations accurately reflect the abundance of LDs within cells, we analyzed the correlation between TG levels and LD content. In OC cell lines, TG levels were significantly elevated (two to five times) compared with control HFTEC and H6036 cells ( p 2a r p Figure 2 Triglyceride (TG) Levels in ovarian cancer. (a) Cell lines: comparison of TG levels between normal control and various ovarian cancer cell lines, quantified using a triglyceride colorimetric assay kit. Values represent mean fold change (FC) ± SD from triplicate experiments. ∗∗ p t n n n n F C S D p t n n n n n n n n p p p (a) (b) (c) (d) (e) In tumor tissue, colorimetric assay revealed higher TG levels compared with nonmalignant ovarian tissue ( p 2b p 2c 2c Similar to tumor tissue, TG levels increased significantly in the PF of women with OC compared with the control group ( p 2d p 2d p p 2e p 2e 3.3. Comprehensive Analysis of DGATs and PLINs in OC Cell Lines and Clinical Samples We next assessed the expression of DGATs and PLINs gene family in OC cell lines and clinical samples using a diverse methodology, including RT‐qPCR for mRNA expression, ELISA for protein quantification, and bioinformatics to evaluate their diagnostic and prognostic relevance. 3.4. OC Cell Lines Through RT‐qPCR, we demonstrated significantly higher expression of both DGAT1 and DGAT2 mRNA in a panel of OC cell lines compared with primary ovarian epithelial cell line, HFTEC (control, p 3a Figure 3 Analysis of DGAT1 and DGAT2 expression in ovarian cancer. (a) qRT‐PCR analysis of DGAT1 and DGAT2 mRNA expression in various ovarian cancer cell lines compared with primary ovarian epithelial cell line (HFTEC, normal control). The threshold cycle (Ct) values were normalized to the housekeeping gene 18s rRNA using the comparative Ct method to quantify DGATs mRNA levels. Data represent the mean fold change (FC) of mRNA expression in cancer cell lines relative to normal control cell line (HFTEC). Values are shown as mean FC ± SD from triplicate experiments. ∗ p t p t n n n n n n n n p p p (a) (b) (c) (d) (e) In exploring protein expression, ELISA results revealed a substantial increase in both DGAT1 and DGAT2 protein levels in OC cell lines compared with control (HFTEC) cell line (Figure 3b 3c Correlation analyses revealed a positive correlation between DGAT1 and DGAT2 mRNA levels in cancer cell lines (Spearman r p 3.5. Clinical Samples 3.5.1. Tumor Tissue Analysis of DGAT1 (Figure 3d 3e p p U p p p p Both DGAT1 (Figure 4a 4b p p U p p Figure 4 Quantification of DGAT1 and DGAT2 protein levels in ovarian cancer. (a, b) Tissue: DGAT1 and DGAT2 protein levels quantified by ELISA in levels in ovarian tissue samples (nonmalignant, n n n n n n n n n n n n p p p (a) (b) (c) (d) (e) (f) 3.5.2. PF In PF, DGAT1 protein levels showed no significant difference between nonmalignant controls and OC samples, although a few advanced‐stage cases exhibited higher values that lacked statistical significance (Figure 4c p 4d p Interestingly, no significant association was observed between DGAT1 and DGAT2 protein levels in PF (Spearman, p 3.5.3. Plasma Analysis Similar to PF, DGAT1 protein levels showed no significant difference between nonmalignant controls and OC samples, with levels generally low or undetectable (Figure 4e p 4f p p 3.5.4. Correlation of DGATs Protein Levels in Tissue, PF, and Plasma To determine if PF and plasma DGAT levels can predict tumor DGATs status, we assessed the correlation between PF, plasma, and tissue DGAT protein levels. As shown in Table 2 r p r p r p r p r p r p Table 2 Correlations of DGAT protein between tissue, PF, and plasma.  Spearman nonparametric analysis  Spearman r value  p value DGAT1 protein Tissue versus PF 0.603 0.005 Tissue versus plasma 0.098 0.656 PF versus plasma 0.102 0.643  DGAT2 protein Tissue versus PF 0.571 0.029 Tissue versus plasma 0.533 0.043 PF versus plasma 0.782 0.001 3.5.5. Association Between TG Levels and DGATs Because DGAT‐dependent TG levels are indicative of LDs, we assessed the correlation between TG levels and DGATs to understand their association with LDs. As shown in Table 3 r p r p r p r p r p r p r p r p r p Table 3 Correlations analysis between TG and DGATs.  Spearman nonparametric analysis  r value  p value Tissue–TG Versus DGAT1 mRNA (tissue) 0.630 0.008 Versus DGAT1 protein (tissue) 0.562 0.026 Versus DGAT2 mRNA (tissue) 0.404 0.109 Versus DGAT2 protein (tissue) 0.850 0.003  PF–TG Versus DGAT1 mRNA (tissue) 0.687 0.001 Versus DGAT1 protein (tissue) 0.533 0.013 Versus DGAT2 mRNA (tissue) 0.361 0.091 Versus DGAT2 protein (tissue) 0.055 0.833  Plasma–TG Versus DGAT1 mRNA (tissue) −0.100 0.641 Versus DGAT1 protein (tissue) −0.256 0.277 Versus DGAT2 mRNA (tissue) −0.119 0.573 Versus DGAT2 protein (tissue) −0.178 0.481  PF–TG Versus DGAT1 protein (PF) 0.552 0.010 Versus DGAT2 protein (PF) 0.645 0.001 Versus DGAT1 protein (plasma) −0.188 0.379 Versus DGAT2 protein (plasma) 0.486 0.041  Plasma–TG Versus DGAT1 protein (PF) −0.200 0.384 Versus DGAT2 protein (PF) −0.231 0.314 Versus DGAT1 protein (plasma) −0.097 0.661 Versus DGAT2 protein (plasma) −0.413 0.070 3.5.6. Assessment of Major DGAT Isoform Contributing to LD Levels in OC Cell Lines Given the significant association between TG and both DGATs in clinical samples, we sought to identify the primary DGAT isoform responsible for the increase in TG and LDs in OC cell lines. Cells were exposed to inhibitors targeting DGAT1 and DGAT2, either individually or in combination, and their LD and TG content was evaluated. As depicted in Figure 5a 5b Figure 5 Effects of DGAT Inhibition on LD and TG levels in ovarian cancer. Ovarian cancer cell lines were treated with DGAT1 inhibitor (PF‐06424439) and DGAT2 inhibitor (A922500), either alone or in combination, for 48 h. (a) LD content was quantified using a microplate fluorometric assay. Media treated cells were considered as control against which treated cells were compared. (b) TG levels was quantified using a microplate colorimetric assay. Media treated cells were considered as control against which treated cells were compared. Data expressed as mean (% inhibition) ± SD of triplicate experiments. Statistical significance at ∗ p n n (a) (b) (c) (d) 3.5.7. Correlation Between Ki67 Expression and DGATs (Protein, mRNA) In our previous investigation, tumor tissue samples from individuals diagnosed with OC exhibited increased levels of Ki67 mRNA transcripts compared with ovarian tissue collected from control subjects [ 21 5 r p 5c r p 5d 3.5.8. Analyzing the Expression of PLINs 1‐5 in OC Cell Lines and Tumor Tissue We determined mRNA expression profiles of PLIN1, PLIN2, PLIN3, PLIN4, and PLIN5 in a panel of OC cell lines and tumor tissue, using RT‐PCR. As shown in Figure 6a p p U p U 6b 6c p U p U 6d p U 6e p 6d p 6e 6f 6g p U Figure 6 qRT‐PCR analysis of PLINs 1–5 mRNA expression in ovarian cancer. To quantify mRNA, the threshold cycle (Ct) values were normalized to the housekeeping gene 18s rRNA using the comparative Ct method. Data represent the mean fold change (FC) of mRNA expression in cancer cell lines or tissues relative to their respective normal controls, shown as mean F C S D p p t n O C e a r l y s t a g e a d v a n c e d s t a g e n p p (a) (b) (c) (d) (e) (f) (g) 3.6. Bioinformatics Analysis 3.6.1. Expression and Genetic Alterations of LD‐Associated Genes in OC We utilized the GEPIA2 platform to validate the expression of DGATs and PLINs at both mRNA and protein levels in OC and matched normal tissues (Figure S1). While DGAT1 mRNA levels were higher in the OC group compared with the normal group, the difference did not reach statistical significance (Figure S1a). Consistent with our findings, statistical analysis revealed a significant upregulation of DGAT2 expression in the OC group compared with the normal group (Figure S1b). In contrast to our findings, GEPIA2 analysis revealed significant differences in PLIN1 (Figure S1c) and PLIN5 (Figure S1g) expression between the OC group and the control group ( p Furthermore, we utilized cBioPortal cancer databases to investigate genetic alterations in these genes (Figure S2). The genetic alteration data from 1880 patients revealed that 28% of OC patients exhibited alterations in the DGAT1 gene, 8% in DGAT2, 4% in PLIN1, 3% in PLIN2, and 2% each in PLIN3, PLIN4, and PLIN5 genes. Specifically, genetic alterations in DGAT1, DGAT2, PLIN1, and PLIN2 were predominantly characterized by copy number amplifications, while deep deletions were observed for PLIN4 and PLIN5 genes. 3.6.2. Prognostic Evaluation of Key LD‐Associated Genes in OC Survival analysis could not be conducted in our study due to the limited follow‐up time and a small sample size. Nonetheless, we employed Kaplan–Meier plotter and cBioportal to evaluate the prognostic significance of these genes in OC. As shown in Figure 7 7a H R p H R p 7b H R p 7c H R p 7d Figure 7 Prognostic significance of DGAT1, DGAT2, PLIN2, and PLIN3 expression in ovarian cancer. Kaplan–Meier survival curves showing overall survival based on high and low expression of (a) DGAT1, (b) DGAT2, (c) PLIN2, and (d) PLIN3, generated using the Kaplan–Meier Plotter database. (a) (b) (c) (d) 3.6.3. Evaluation of DGATs and TG as Diagnostic Indicators of OC The diagnostic capabilities of DGAT1, DGAT2, and TG in plasma, PF, and tissue were assessed using ROC curve analysis for diagnosing OC. As shown in Table 4 A U C A U C A U C Table 4 LD‐associated genes and TG as diagnostic indicators for OC.  Analyte  AUC value  p value Tissue DGAT1‐mRNA 0.9479 <0.0001 DGAT2‐mRNA 0.9844 <0.0001 DGAT1‐protein 0.7413 0.0456 DGAT2‐protein 0.7564 0.0296  PF DGAT1‐protein 0.5286 0.8148 DGAT2‐protein 0.8869 <0.0001  Plasma DGAT1‐protein 0.622 0.2725 DGAT2‐protein 0.9038 0.0024  Tissue TG/(TG + FS + CE) 0.8167 0.02 PF TG 0.8854 0.0003 Plasma TG 0.6528 0.129  Tissue PLIN1‐mRNA 0.5315 0.7943 PLIN2‐mRNA 0.8322 0.0059 PLIN3‐mRNA 0.7483 0.0397 PLIN4‐mRNA 0.5175 0.8848 PLIN5‐mRNA 0.6573 0.1924 4. Discussion Current treatments for OC are frequently undermined by the development of chemoresistance and high recurrence rates [ 1 24 Bioinformatic survival analysis demonstrated that high expression of DGAT2 and PLIN2 correlated with decreased OS in OC, while elevated PLIN3 expression was associated with enhanced OS. Diagnostic assessments using ROC analysis revealed that elevated DGAT2 levels detected in tumor tissue, PF, and plasma exhibited robust diagnostic capabilities. Moreover, significant Spearman correlations between DGAT2 expression in tumor tissue and plasma, and between PF and plasma, indicate that plasma DGAT2 reliably reflects tumor‐associated expression. These findings support DGAT2 as a noninvasive biomarker for OC, with plasma measurement serving as a surrogate for tumor burden and minimizing the need for invasive sampling. Additionally, DGAT1, TGs, PLIN2, and PLIN3 also showed considerable diagnostic potential for detecting malignancy in tissue. The fact that altered lipid metabolism is observed in all stages of OC suggests a significant association between OC and lipids [ 3 25 26 3 3 27 6 28 29 32 4 8 DGAT enzymes, particularly DGAT1 and DGAT2, are central to the metabolic reprogramming observed in tumors. These enzymes, responsible for TG synthesis and LD formation, are often overexpressed in various cancers and are linked to enhanced tumor growth, aggressiveness, and chemoresistance, rendering them attractive targets for intervention [ 15 18 33 35 33 17 18 5 33 36 19 While DGAT1 inhibition suppresses tumor growth in various cancers, including glioblastoma [ 15 28 17 18 37 38 34 17 18 33 36 33 34 The clinical relevance of DGATs in prognosis varies significantly across different cancer types. Overexpression of DGAT1 is associated with poorer survival outcomes in OC and gastric cancer, whereas it correlates with improved survival in lung adenocarcinoma [ 15 16 34 37 39 PLINs are crucial proteins that regulate LDs in cells, impacting cancer cell metabolism, growth, survival, and therapy response [ 8 10 PLIN1 is a prominent structural protein found abundantly on LDs and is highly expressed in mature adipocytes. Recent research indicates that the absence of PLIN1 reduces LD formation by downregulating nuclear SREBP‐1, likely through interactions with cytosolic lipases, thereby affecting lipolysis [ 40 41 42 43 44 45 46 47 48 49 50 51 PLIN3, similar to PLIN2, exhibits widespread expression and is implicated in LD formation and prostaglandin E2 (PGE2) generation [ 52 53 55 13 56 57 58 59 LD‐associated genes, notably DGATs and PLINs, significantly contribute to tumor development and prognosis across various cancers. They orchestrate LD formation within tumor tissues via intricate pathways linked to inflammation, hypoxia, and acidosis, intersecting with key oncogenic pathways like PTEN, KRAS, and FOXO3/Sirtuin6 [ 5 43 κ 60 61 5. Conclusions LD significantly influence tumor growth, facilitating chemoresistance and disease recurrence. Consequently, LDs and associated genes, such as DGATs and PLINs, are important targets for cancer therapy. Ongoing research in these fields is broadening horizons for diagnostic, prognostic and therapeutic strategies in OC, highlighting the value of metabolic enzymes as both biomarkers and therapeutic targets. This approach offers promising prospects for the development of targeted cancer therapies aimed at substantially improving patient survival and quality of life. Nomenclature DGAT1 diacylglycerol O‐acyltransferase 1 DGAT2 diacylglycerol O‐acyltransferase 2 TG triglycerides OC ovarian cancer LD lipid droplets ROC receiver operating characteristic qRT‐PCR quantitative real‐time polymerase chain reaction TLC thin‐layer chromatography BMI body mass index AUC area under the curve IGROV‐1CDDP/A2780‐CDDP cisplatin‐resistant variants of IGROV‐1 and A2780 Disclosure All authors have read and approved the final manuscript. Conflicts of Interest The authors declare no conflicts of interest. Author Contributions Conceptualization: V.N.A. and L.B.; data curation: V.N.A., M.L., Z.P., and P.D‐S.; formal analysis: V.N.A., M.L., P.D‐S., and K.G.; funding acquisition: L.B.; investigation: V.N.A., M.L., and L.B.; methodology: V.N.A., M.L., Z.P., P.D‐S., K.G., and L.B.; project administration: V.N.A., P.D‐S., K.G., T.W., and L.B.; resources: L.B.; software: V.N.A., K.G., and P.D‐S.; supervision: V.N.A. and L.B.; validation: V.N.A., M.L., P.D‐S., and L.B.; visualization: V.N.A., P.D‐S., and K.G.; writing (original draft): V.N.A., P.D‐S., K.G., and L.B.; writing (review and editing): V.N.A., P.D‐S., K.G., and L.B. Funding The authors received no specific funding for this work. Supporting information  Supporting Information p Data Availability Statement The data that support the findings of this study are available from the corresponding author upon reasonable request. 1 Yang L. Xie H. J. Li Y. Y. Wang X. Liu X. X. Mai J. Molecular Mechanisms of Platinum-Based Chemotherapy Resistance in Ovarian Cancer (Review) Oncology Reports 2022 47 10.3892/or.2022.8293 PMC8908330 35211759 2 Bray F. Ferlay J. Soerjomataram I. Siegel R. L. Torre L. A. Jemal A. Global Cancer Statistics 2018: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA: A Cancer Journal for Clinicians 2018 68 394 424 10.3322/caac.21492 30207593 3 Nieman K. M. Kenny H. A. Penicka C. V. Ladanyi A. Buell-Gutbrod R. Zillhardt M. R. Romero I. L. Carey M. S. Mills G. B. Hotamisligil G. S. Yamada S. D. Peter M. E. Gwin K. Lengyel E. Adipocytes Promote Ovarian Cancer Metastasis and Provide Energy for Rapid Tumor Growth Nature Medicine 2011 17 1498 1503 10.1038/nm.2492 PMC4157349 22037646 4 Petan T. Jarc E. Jusovic M. Lipid Droplets in Cancer: Guardians of Fat in a Stressful World Molecules 2018 23 10.3390/molecules23081941 PMC6222695 30081476 5 Li Z. Liu H. Luo X. Lipid Droplet and Its Implication in Cancer Progression American Journal of Cancer Research 2020 10 4112 4122 33414989 PMC7783747 6 Cruz A. L. S. Barreto E. A. Fazolini N. P. B. Viola J. P. B. Bozza P. T. Lipid Droplets: Platforms With Multiple Functions in Cancer Hallmarks Cell Death & Disease 2020 11 10.1038/s41419-020-2297-3 PMC7005265 32029741 7 Royo-Garcia A. Courtois S. Parejo-Alonso B. Espiau-Romera P. Sancho P. Lipid Droplets as Metabolic Determinants for Stemness and Chemoresistance in Cancer World Journal of Stem Cells 2021 13 1307 1317 10.4252/wjsc.v13.i9.1307 34630864 PMC8474722 8 Luo W. Wang H. Ren L. Lu Z. Zheng Q. Ding L. Xie H. Wang R. Yu C. Lin Y. Zhou Z. Xia L. Li G. Adding Fuel to the Fire: The Lipid Droplet and Its Associated Proteins in Cancer Progression International Journal of Biological Sciences 2022 18 6020 6034 10.7150/ijbs.74902 36439875 PMC9682530 9 Bickel P. E. Tansey J. T. Welte M. A. PAT Proteins, an Ancient Family of Lipid Droplet Proteins that Regulate Cellular Lipid Stores Biochimica et Biophysica Acta 2009 1791 419 440 10.1016/j.bbalip.2009.04.002 19375517 PMC2782626 10 Itabe H. Yamaguchi T. Nimura S. Sasabe N. Perilipins: A Diversity of Intracellular Lipid Droplet Proteins Lipids in Health and Disease 2017 16 10.1186/s12944-017-0473-y PMC5410086 28454542 11 Tauchi-Sato K. Ozeki S. Houjou T. Taguchi R. Fujimoto T. The Surface of Lipid Droplets Is a Phospholipid Monolayer With a Unique Fatty Acid Composition The Journal of Biological Chemistry 2002 277 44507 44512 10.1074/jbc.M207712200 12221100 12 Zhang Q. Zhang P. Li B. Dang H. Jiang J. Meng L. Zhang H. Zhang Y. Wang X. Li Q. Wang Y. Liu C. Li F. The Expression of Perilipin Family Proteins Can Be Used as Diagnostic Markers of Liposarcoma and to Differentiate Subtypes Journal of Cancer 2020 11 4081 4090 10.7150/jca.41736 32368290 PMC7196260 13 Zhang X. Su L. Sun K. Expression Status and Prognostic Value of the Perilipin Family of Genes in Breast Cancer American Journal of Translational Research 2021 13 4450 4463 34150026 PMC8205812 14 Bai R. Rebelo A. Kleeff J. Sunami Y. Identification of Prognostic Lipid Droplet-Associated Genes in Pancreatic Cancer Patients Via Bioinformatics Analysis Lipids in Health and Disease 2021 20 10.1186/s12944-021-01476-y PMC8171034 34078402 15 Cheng X. Geng F. Pan M. Wu X. Zhong Y. Wang C. Tian Z. Cheng C. Zhang R. Puduvalli V. Horbinski C. Mo X. Han X. Chakravarti A. Guo D. Targeting DGAT1 Ameliorates Glioblastoma by Increasing Fat Catabolism and Oxidative Stress Cell Metabolism 2020 32 229 242 10.1016/j.cmet.2020.06.002 32559414 PMC7415721 16 Cheng X. Geng F. Guo D. DGAT1 Protects Tumor From Lipotoxicity, Emerging as a Promising Metabolic Target for Cancer Therapy Molecular & Cellular Oncology 2020 7 1805257 10.1080/23723556.2020.1805257 33235909 PMC7671038 17 Mitra R. Le T. T. Gorjala P. Goodman O. B. Positive Regulation of Prostate Cancer Cell Growth by Lipid Droplet Forming and Processing Enzymes DGAT1 and ABHD5 BMC Cancer 2017 17 10.1186/s12885-017-3589-6 PMC5588693 28877685 18 Nardi F. Franco O. E. Fitchev P. Morales A. Vickman R. E. Hayward S. W. Crawford S. E. DGAT1 Inhibitor Suppresses Prostate Tumor Growth and Migration by Regulating Intracellular Lipids and Non-Centrosomal MTOC Protein GM130 Scientific Reports 2019 9 10.1038/s41598-019-39537-z PMC6395665 30816200 19 Xia L. Wang Y. Cai S. Xu M. DGAT1 Expression Promotes Ovarian Cancer Progression and Is Associated With Poor Prognosis Journal of Immunology Research 2021 2021 6636791 10.1155/2021/6636791 34095320 PMC8141271 20 Ayyagari V. N. Wang X. Diaz-Sylvester P. L. Groesch K. Brard L. Assessment of Acyl-CoA Cholesterol Acyltransferase (ACAT-1) Role in Ovarian Cancer Progression—An In Vitro Study PLoS One 2020 15 e0228024 10.1371/journal.pone.0228024 31978092 PMC6980601 21 Ayyagari V. Li M. Pasman Z. Wang X. Louis S. Diaz-Sylvester P. Groesch K. Wilson T. Brard L. Assessment of the Diagnostic and Prognostic Relevance of ACAT1 and CE Levels in Plasma, Peritoneal Fluid and Tumor Tissue of Epithelial Ovarian Cancer Patients—A Pilot Study BMC Cancer 2022 22 10.1186/s12885-022-09476-6 PMC8994887 35399074 22 Ayyagari V. N. Brard L. Bithionol Inhibits Ovarian Cancer Cell Growth In Vitro—Studies on Mechanism (S) of Action BMC Cancer 2014 14 10.1186/1471-2407-14-61 PMC3922745 24495391 23 Ayyagari V. N. Li M. Diaz-Sylvester P. Groesch K. Wilson T. Pasman Z. Shah E. Braundmeier-Fleming A. Brard L. Evaluation of Sterol-O-Acyl Transferase 1 and Cholesterol Ester Levels in Plasma, Peritoneal Fluid and Tumor Tissue of Patients With Endometrial Cancer: A Pilot Study Oncology Letters 2023 25 10.3892/ol.2023.13817 PMC10157603 37153054 24 Ortiz M. Wabel E. Mitchell K. Horibata S. Mechanisms of Chemotherapy Resistance in Ovarian Cancer Cancer Drug Resistance 2022 5 304 316 10.20517/cdr.2021.147 35800369 PMC9255249 25 Xiao Y. Chen Y. Kennedy A. W. Belinson J. Xu Y. Evaluation of Plasma Lysophospholipids for Diagnostic Significance Using Electrospray Ionization Mass Spectrometry (ESI-MS) Analyses Annals of the new York Academy of Sciences 2000 905 242 259 10.1111/j.1749-6632.2000.tb06554.x 10818458 26 Xu Y. Shen Z. Wiper D. W. Wu M. Morton R. E. Elson P. Kennedy A. W. Belinson J. Markman M. Casey G. Lysophosphatidic Acid as a Potential Biomarker for Ovarian and Other Gynecologic Cancers Journal of the American Medical Association 1998 280 719 723 10.1001/jama.280.8.719 9728644 27 Avula L. R. Hagerty B. Alewine C. Molecular Mediators of Peritoneal Metastasis in Pancreatic Cancer Cancer Metastasis Reviews 2020 39 1223 1243 10.1007/s10555-020-09924-4 32780245 PMC7680314 28 Wilcock D. Kasheta M. Ceol C. DGAT1 Is a Lipid Metabolism Oncoprotein That Enables Cancer Cells to Accumulate Fatty Acid While Avoiding Lipotoxicity 2020 29 Olzmann J. A. Carvalho P. Dynamics and Functions of Lipid Droplets Nature Reviews. Molecular Cell Biology 2019 20 137 155 10.1038/s41580-018-0085-z 30523332 PMC6746329 30 Beloribi-Djefaflia S. Vasseur S. Guillaumond F. Lipid Metabolic Reprogramming in Cancer Cells Oncogene 2016 5 e189 10.1038/oncsis.2015.49 PMC4728678 26807644 31 Obaseki E. Adebayo D. Bandyopadhyay S. Hariri H. Lipid Droplets and Fatty Acid-Induced Lipotoxicity: In a Nutshell FEBS Letters 2024 598 1207 1214 10.1002/1873-3468.14808 38281809 PMC11126361 32 Delmas D. Cotte A. K. Connat J. L. Hermetet F. Bouyer F. Aires V. Emergence of Lipid Droplets in the Mechanisms of Carcinogenesis and Therapeutic Responses Cancers (Basel) 2023 15 10.3390/cancers15164100 PMC10452604 37627128 33 Hernandez-Corbacho M. J. Obeid L. M. A Novel Role for DGATs in Cancer Advances in Biological Regulation 2019 72 89 101 10.1016/j.jbior.2018.12.001 30579761 PMC6488436 34 Deng B. Kong W. Shen X. Han C. Zhao Z. Chen S. Zhou C. Bae-Jump V. The Role of DGAT1 and DGAT2 in Regulating Tumor Cell Growth and Their Potential Clinical Implications Journal of Translational Medicine 2024 22 10.1186/s12967-024-05084-z PMC10946154 38500157 35 He P. Cheng S. Hu F. Ma Z. Xia Y. Up-Regulation of DGAT1 in Cancer Tissues and Tumor-Infiltrating Macrophages Influenced Survival of Patients With Gastric Cancer BMC Cancer 2021 21 10.1186/s12885-021-07976-5 PMC7941926 33750350 36 Ravacci G. R. Brentani M. M. Tortelli T. C. Torrinhas R. S. Santos J. R. Logullo A. F. Waitzberg D. L. Docosahexaenoic Acid Modulates a HER2-Associated Lipogenic Phenotype, Induces Apoptosis, and Increases Trastuzumab Action in HER2-Overexpressing Breast Carcinoma Cells BioMed Research International 2015 2015 838652 10.1155/2015/838652 26640797 PMC4659962 37 Li Y. Li T. Jin Y. Shen J. Dgat2 Reduces Hepatocellular Carcinoma Malignancy Via Downregulation of Cell Cycle-Related Gene Expression Biomedicine & Pharmacotherapy 2019 115 108950 10.1016/j.biopha.2019.108950 31078041 38 Graber M. Barta H. Wood R. Pappula A. Vo M. Petreaca R. C. Escorcia W. Comprehensive Genetic Analysis of DGAT2 Mutations and Gene Expression Patterns in Human Cancers Biology 2021 10 10.3390/biology10080714 PMC8389207 34439946 39 Li S. Wu T. Lu Y. X. Wang J. X. Yu F. H. Yang M. Z. Huang Y. J. Li Z. J. Wang S. L. Huang L. Lu L. Tian T. Obesity Promotes Gastric Cancer Metastasis Via Diacylglycerol Acyltransferase 2-Dependent Lipid Droplets Accumulation and Redox Homeostasis Redox Biology 2020 36 101596 10.1016/j.redox.2020.101596 32506038 PMC7276427 40 Grahn T. H. Zhang Y. Lee M. J. Sommer A. G. Mostoslavsky G. Fried S. K. Greenberg A. S. Puri V. FSP27 and PLIN1 Interaction Promotes the Formation of Large Lipid Droplets in Human Adipocytes Biochemical and Biophysical Research Communications 2013 432 296 301 10.1016/j.bbrc.2013.01.113 23399566 PMC3595328 41 Takahashi Y. Shinoda A. Furuya N. Harada E. Arimura N. Ichi I. Fujiwara Y. Inoue J. Sato R. Perilipin-Mediated Lipid Droplet Formation in Adipocytes Promotes Sterol Regulatory Element-Binding Protein-1 Processing and Triacylglyceride Accumulation PLoS One 2013 8 e64605 10.1371/journal.pone.0064605 23734208 PMC3667186 42 Heid H. W. Moll R. Schwetlick I. Rackwitz H. R. Keenan T. W. Adipophilin Is a Specific Marker of Lipid Accumulation in Diverse Cell Types and Diseases Cell and Tissue Research 1998 294 309 321 10.1007/s004410051181 9799447 43 Penrose H. Heller S. Cable C. Makboul R. Chadalawada G. Chen Y. Crawford S. E. Savkovic S. D. Epidermal Growth Factor Receptor Mediated Proliferation Depends on Increased Lipid Droplet Density Regulated Via a Negative Regulatory Loop With FOXO3/Sirtuin6 Biochemical and Biophysical Research Communications 2016 469 370 376 10.1016/j.bbrc.2015.11.119 26657850 PMC5607009 44 Suzuki K. Takahashi K. Nishimaki-Mogami T. Kagechika H. Yamamoto M. Itabe H. Docosahexaenoic Acid Induces Adipose Differentiation-Related Protein Through Activation of Retinoid x Receptor in Human Choriocarcinoma BeWo Cells Biological & Pharmaceutical Bulletin 2009 32 1177 1182 10.1248/bpb.32.1177 19571381 45 Schaiff W. T. Bildirici I. Cheong M. Chern P. L. Nelson D. M. Sadovsky Y. Peroxisome Proliferator-Activated Receptor-Gamma and Retinoid X Receptor Signaling Regulate Fatty Acid Uptake by Primary Human Placental Trophoblasts The Journal of Clinical Endocrinology and Metabolism 2005 90 4267 4275 10.1210/jc.2004-2265 15827101 46 Takahashi Y. Shinoda A. Kamada H. Shimizu M. Inoue J. Sato R. Perilipin2 Plays a Positive Role in Adipocytes During Lipolysis by Escaping Proteasomal Degradation Scientific Reports 2016 6 20975 10.1038/srep20975 26876687 PMC4753471 47 Ambrosio M. R. Piccaluga P. P. Ponzoni M. Rocca B. J. Malagnino V. Onorati M. de Falco G. Calbi V. Ogwang M. Naresh K. N. Pileri S. A. Doglioni C. Leoncini L. Lazzi S. The Alteration of Lipid Metabolism in Burkitt Lymphoma Identifies a Novel Marker: Adipophilin PLoS One 2012 7 e44315 10.1371/journal.pone.0044315 22952953 PMC3432109 48 Fujimoto M. Matsuzaki I. Yamamoto Y. Yoshizawa A. Warigaya K. Iwahashi Y. Kojima F. Furukawa F. Murata S. I. Adipophilin Expression in Cutaneous Malignant Melanoma Journal of Cutaneous Pathology 2017 44 228 236 10.1111/cup.12868 27886404 49 Cao Q. Ruan H. Wang K. Song Z. Bao L. Xu T. Xiao H. Wang C. Cheng G. Tong J. Meng X. Liu D. Yang H. Chen K. Zhang X. Overexpression of PLIN2 Is a Prognostic Marker and Attenuates Tumor Progression in Clear Cell Renal Cell Carcinoma International Journal of Oncology 2018 53 137 147 10.3892/ijo.2018.4384 29749470 PMC5958875 50 Fujimoto M. Yoshizawa A. Sumiyoshi S. Sonobe M. Menju T. Hirata M. Momose M. Date H. Haga H. Adipophilin Expression in Lung Adenocarcinoma Is Associated With Apocrine-Like Features and Poor Clinical Prognosis: An Immunohistochemical Study of 328 Cases Histopathology 2017 70 232 241 10.1111/his.13048 27467545 51 Kuniyoshi S. Miki Y. Sasaki A. Iwabuchi E. Ono K. Onodera Y. Hirakawa H. Ishida T. Yoshimi N. Sasano H. The Significance of Lipid Accumulation in Breast Carcinoma Cells Through Perilipin 2 and Its Clinicopathological Significance Pathology International 2019 69 463 471 10.1111/pin.12831 31273897 52 Nose F. Yamaguchi T. Kato R. Aiuchi T. Obama T. Hara S. Yamamoto M. Itabe H. Crucial Role of Perilipin-3 (TIP47) in Formation of Lipid Droplets and PGE2 Production in HL-60-Derived Neutrophils PLoS One 2013 8 e71542 10.1371/journal.pone.0071542 23936516 PMC3731282 53 Zhang Y. Liang X. Lian Q. Liu L. Zhang B. Dong Z. Liu K. Transcriptional Analysis of the Expression and Prognostic Value of Lipid Droplet-Localized Proteins in Hepatocellular Carcinoma BMC Cancer 2023 23 10.1186/s12885-023-10987-z PMC10354995 37464334 54 Li X. Kang K. Shen L. Shen L. Zhou Y. Integrative Analysis of the Predictive Value of Perilipin Family on Clinical Significance, Prognosis and Immunotherapy of Glioma Biomedicine 2023 11 10.3390/biomedicines11041009 PMC10136080 37189627 55 Lung J. Hung M. S. Wang T. Y. Chen K. L. Luo C. W. Jiang Y. Y. Wu S. Y. Lee L. W. Lin P. Y. Chen F. F. Liao H. F. Lin Y. C. Lipid Droplets in Lung Cancers Are Crucial for the Cell Growth and Starvation Survival International Journal of Molecular Sciences 2022 23 10.3390/ijms232012533 PMC9604479 36293388 56 Wang K. Ruan H. Song Z. Cao Q. Bao L. Liu D. Xu T. B. Xiao H. B. Wang C. Cheng G. Tong J. W. Meng X. G. Yang H. M. Chen K. Zhang X. P. PLIN3 Is Up-Regulated and Correlates With Poor Prognosis in Clear Cell Renal Cell Carcinoma Urologic Oncology 2018 36 343.e9 343.e19 10.1016/j.urolonc.2018.04.006 29773494 57 Hsieh K. Lee Y. K. Londos C. Raaka B. M. Dalen K. T. Kimmel A. R. Perilipin Family Members Preferentially Sequester to Either Triacylglycerol-Specific or Cholesteryl-Ester-Specific Intracellular Lipid Storage Droplets Journal of Cell Science 2012 125 4067 4076 10.1242/jcs.104943 22685330 PMC3482316 58 Kuramoto K. Okamura T. Yamaguchi T. Nakamura T. Y. Wakabayashi S. Morinaga H. Nomura M. Yanase T. Otsu K. Usuda N. Matsumura S. Inoue K. Fushiki T. Kojima Y. Hashimoto T. Sakai F. Hirose F. Osumi T. Perilipin 5, a Lipid Droplet-Binding Protein, Protects Heart From Oxidative Burden by Sequestering Fatty Acid From Excessive Oxidation The Journal of Biological Chemistry 2012 287 23852 23863 10.1074/jbc.M111.328708 22532565 PMC3390660 59 Wang H. Sreenivasan U. Hu H. Saladino A. Polster B. M. Lund L. M. Gong D. W. Stanley W. C. Sztalryd C. Perilipin 5, a Lipid Droplet-Associated Protein, Provides Physical and Metabolic Linkage to Mitochondria Journal of Lipid Research 2011 52 2159 2168 10.1194/jlr.M017939 21885430 PMC3220284 60 Chen R. R. Yung M. M. H. Xuan Y. Zhan S. Leung L. L. Liang R. R. Leung T. H. Y. Yang H. Xu D. Sharma R. Chan K. K. L. Ngu S. F. Ngan H. Y. S. Chan D. W. Targeting of Lipid Metabolism With a Metabolic Inhibitor Cocktail Eradicates Peritoneal Metastases in Ovarian Cancer Cells Communications Biology 2019 2 10.1038/s42003-019-0508-1 PMC6668395 31372520 61 Pyragius C. E. Fuller M. Ricciardelli C. Oehler M. K. Aberrant Lipid Metabolism: An Emerging Diagnostic and Therapeutic Target in Ovarian Cancer International Journal of Molecular Sciences 2013 14 7742 7756 10.3390/ijms14047742 23574936 PMC3645713 ",
  "metadata": {
    "Title of this paper": "Aberrant Lipid Metabolism: An Emerging Diagnostic and Therapeutic Target in Ovarian Cancer",
    "Journal it was published in:": "BioMed Research International",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487632/"
  }
}