{
  "title": "Paper_528",
  "abstract": "pmc Front Oncol Front Oncol 1755 frontonco Front. Oncol. Frontiers in Oncology 2234-943X Frontiers Media SA PMC12483866 PMC12483866.1 12483866 12483866 41040514 10.3389/fonc.2025.1579602 1 Oncology Original Research The clinicopathological characteristics, oncologic outcomes and costs of “HER2-low” early breast cancer compared to HER2-zero and HER2-positive: a single-centre retrospective analysis Rodrigues Patrícia Rafaela  1  * Lopes-Conceição Luísa  2 Sousa Virgínia  2  3 Coutada Andreia  4 Bento Maria José  2  5 Coimbra Nuno  4 Leal Conceição  4 Pereira Deolinda  1 Magalhães Ferreira Ana  1  6  1 Department of Medical Oncology, Portuguese Oncology Institute Porto Portugal  2 Epidemiology, Outcomes, Economics and Management in Oncology Group - Research Center (CI-IPOP), Porto Comprehensive Cancer Center (Porto.CCC), RISE@CI-IPOP (Health Research Network), Portuguese Oncology Institute of Porto Porto Portugal  3 Oncology Adult Day Hospital Unit, Portuguese Oncology Institute Porto Portugal  4 Department of Anatomical Pathology, Portuguese Oncology Institute Porto Portugal  5 Department of Population Studies, Abel Salazar Institute of Biomedical Sciences, University of Porto Porto Portugal  6 Abel Salazar Institute of Biomedical Sciences, University of Porto Porto Portugal Edited by: Jitendra Singh Nigam Reviewed by: Biswajit Dey  Ashok Singh *Correspondence: Patrícia Rafaela Rodrigues, patriciarafaelarodrigues@gmail.com 17 9 2025 2025 15 480898 1579602 19 2 2025 28 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Rodrigues, Lopes-Conceição, Sousa, Coutada, Bento, Coimbra, Leal, Pereira and Magalhães Ferreira. 2025 Rodrigues, Lopes-Conceição, Sousa, Coutada, Bento, Coimbra, Leal, Pereira and Magalhães Ferreira https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Breast cancer is a heterogeneous disease commonly classified based on hormone receptor (HR) status and human epidermal growth factor receptor 2 (HER2) expression. Recently, an intermediate category termed “HER2-low” has drawn attention for its potential prognostic and therapeutic implications. This study aimed to characterize the clinicopathological features, oncologic outcomes, and costs of “HER2-low” early breast cancer (eBC) in comparison with HER2-zero (HER2-0) and HER2-positive eBC. Methods A single-center, retrospective analysis included patients with stage I–IIIA eBC diagnosed from January 2019 to December 2020. Patients were categorized into HER2-0, “HER2-low” (IHC 1+ or IHC 2+/ISH-negative), or HER2-positive (IHC 3+ or IHC 2+/ISH-positive). Clinicopathological data, direct medical costs, disease-free survival (DFS), and overall survival (OS) were examined. Kaplan-Meier analyses compared survival outcomes among groups, and Chi-square tests assessed differences in clinical characteristics. Results Among 1,138 patients, 35.1% were HER2-0, 45.3% were “HER2-low”, and 19.5% were HER2-positive. “HER2-low” eBC showed higher rates of HR positivity compared with HER2-0 (94% vs. 89%, p=0.018) and more frequent nodal involvement (39% vs. 30%, p=0.014). Compared with HER2-positive disease, “HER2-low” tumors presented at earlier stages, had fewer grade 3 tumors, and were less frequently treated with chemotherapy (56% vs. 83%, p<0.001). No significant differences were observed in DFS or OS among the three groups within the study’s follow-up period. Costs were highest for patients with HER2-positive eBC, primarily driven by targeted therapies (trastuzumab, pertuzumab, T-DM1). Conclusions While “HER2-low” eBC demonstrates distinct clinicopathological features—particularly in terms of HR positivity and histological grade—this intermediate phenotype did not exhibit worse oncologic outcomes compared with HER2–0 or HER2-positive disease in the observed timeframe. Further research is needed to validate these findings and clarify the prognostic and therapeutic significance of “HER2-low” eBC, especially as new HER2-targeting agents emerge. HER2-low early breast cancer (EBC) HER2-0 HER2-positive costs of treatment clinic-pathlogical characteristics The author(s) declare that no financial support was received for the research, and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Breast Cancer Introduction Breast cancer (BC) is the most frequent type of cancer in women globally, accounting for 32% of all cancers in this gender, and it is the second most lethal after lung cancer ( 1 2 3 4 HER2 is a member of the epidermal growth factor receptor (EGFR) family ( 5 5 BC is considered HER2-positive when immunohistochemistry (IHC) assay reveals HER2 overexpression (score 3+) or there is ERBB2 amplification on an in-situ 2 5 5 2 5 7 Therefore, instead of a binary classification of HER2-negative or HER2-positive eBC, intermediate levels of expression (termed “HER2-low” eBC) could also be considered, and if so, they may represent more than half of eBC cases, since some studies report 45–60% of eBC with this phenotype. Patients with IHC score 0 are considered HER2-0 ( 2 3 5 7 8 Accordingly, it is necessary to understand the prognostic significance of “HER2-low” eBC, its clinicopathological characteristics and the treatment costs associated with this disease. Thus, this study aimed to characterize the clinicopathological features, oncologic outcomes, and costs of “HER2-low” early breast cancer (eBC) in comparison with HER2–0 and HER2-positive eBC. Materials and methods Study design We conducted a retrospective analysis of a cohort of patients diagnosed with eBC at a Portuguese Comprehensive Cancer Center between 1 January 2019 and 31 December 2020. Inclusion criteria encompassed female patients aged with 18 years-old or older at diagnosis, with histologically proven primary invasive localized BC (stages I to IIIA) and who performed all treatments at our institution. Patients were excluded if they had missing diagnostic data or missing information regarding HER2 status, were lost to follow-up, participated in clinical trials or had other malignancies (except non-melanoma skin cancer) within five years before or after the diagnosis. Therefore, a total of 1138 patients were included in the present study. Data collection Data collection included patient clinical and pathological characteristics, such as age at diagnosis, menopausal status, histologic type and grade (based on core biopsy), HR status (considered positive when either ER or PR was ≥1%; negative when both ER and PR were <1%), HER2 status, disease stage (based on the 8th American Joint Committee on Cancer), and treatments performed (including type of breast surgery and axillary management, radiotherapy, chemotherapy, endocrine therapy, and ovarian suppression). We also collected the type and quantity of care provided (outpatient visits, hospitalizations, drugs, among others), alongside unit and total costs. These data were retrieved from the cancer registry database and electronic medical records (EMRs). Unit costs were obtained from official government price lists and the centre costing system. The patients were followed until 30 June 2023. End points The primary endpoint was to identify the main clinicopathological differences between HER2-0, “HER2-low”, and HER2-positive eBC. Secondary endpoints included overall survival (OS), defined as the time from the date of surgery to the date of death from any cause, and disease-free survival (DFS), defined as the time from the date of surgery to the date of loco-regional or distant recurrence or death from any cause, whichever occurred first. We also assessed direct medical costs per patient from eBC diagnosis to the end of follow-up. For the present analysis, costs were divided into two main categories: treatment-related costs (surgery, radiotherapy, and systemic therapies) and other costs (hospitalization, consultations, blood work, and diagnostic imaging such as CT scans and ultrasounds). Statistical analysis Patient’s characteristics are presented as counts and proportions and compared using the chi-square test, for categorical variables, or as mean and standard deviations and compared using analysis of variance (ANOVA), for continuous variables. DFS and OS were estimated using the Kaplan-Meier method and compared using the log-rank test. All analyses were performed using R version 4.1.2 (R Core Team, Vienna, Austria). Results were considered statistically significant for p-values less than 0.05. Ethics The present study was approved by the Ethics Committee of the IPO-Porto (ref. CES. 009/024). The data comprised no unique personal identifiers and were extracted from the IPO-Porto Cancer Registry database and EMRs. Thus, patient informed consent was not required. Results Clinico-pathological characteristics Among the 1,138 patients included in the analysis, 35.1% (n=400) were classified as having HER2–0 eBC, 45.3% (n=516) had “HER2-low” eBC, and 19.5% (n=222) had HER2-positive eBC. Compassing all HER2-negative eBC (n=916, 80,5%), “HER2-low” represented 56.3% of the patients. Patient and tumor characteristics stratified by HER2 status are detailed in  Table 1  Supplementary Tables 1  2 Table 1 Demographic and clinical characteristics of the sample, overall and according to HER2 group. Patient and disease characteristics HER2-0 (n=400) HER2-low (n=516) HER2-positive (n=222) P-value Age (years) Mean (SD) 58 (± 13) 58 (± 13) 55 (± 13) 0.006 Menopausal status, N (%) Postmenopause 254 (64) 324 (63) 127 (57) 0.262 Premenopause 146 (36) 192 (37) 95 (43) Stage, N (%) I 296 (74) 354 (69) 113 (51) <0.001 II 90 (22) 138 (27) 87 (39) III 14 (4) 23 (4) 22 (10) Missing 0 (0) 1 (0.2) 0 (0) HR status, N (%) Negative 43 (11) 32 (6) 65 (29) <0.001 Positive 357 (89) 484 (94) 157 (71) Histologic type, N (%) Lobular 59 (15) 59 (11) 8 (4) <0.001 No special type 301 (75) 426 (83) 206 (93) Others 40 (10) 31 (6) 8 (4) Histologic grade, N (%) 1 45 (11) 37 (7) 0 (0) <0.001 2 208 (52) 248 (48) 58 (26) 3 145 (36) 230 (44) 163 (74) Missing 2 (0) 1 (0) 1 (0) Laterality, N (%) Bilateral 2 (0) 2 (0) 0 (0) 0.476 Left-sided 194 (48) 277 (54) 117 (53) Right-sided 204 (51) 237 (46) 105 (47) Nodal disease, N (%) No 282 (70) 329 (64) 165 (74) 0.011 Yes 113 (28) 179 (35) 55 (25) Missing 5 (1.3) 8 (1.6) 2 (0.9) N, number of patients; SD, Standard deviation. Patients with “HER2-low” eBC had a mean age of 58 years (± 13), similar to HER2–0 patients, but significantly older than those with HER2-positive disease (55 ± 13, p=0.006). Menopausal status did not differ significantly between groups, with more than half of all patients being postmenopausal ( p Stage distribution differed significantly. “HER2-low” tumors were more frequently diagnosed at an early stage compared to HER2-positive tumors, with 69% vs. 51% of cases at stage I ( p p Endocrine receptor (ER and/or PR) positivity was highest in the “HER2-low” group, being significantly greater than in HER2-0 (94% vs 89%, p p Histologically, HER2-low tumors were predominantly of ductal/no special type, significantly more than HER2-0 (83% vs. 75%, p p p Laterality did not differ across groups ( p Nodal involvement was more frequent in HER2-low than in HER2–0 patients (35% vs. 28%, p p Treatment-related characteristics   Table 2  Supplementary Tables 3  4 Table 2 Treatment characteristics of the sample, according to HER2 group. Type of treatment HER2-0 (n=400) HER2-low (n=516) HER2-positive (n=222) P-value Surgery, N (%) No 1 (0) 2 (0) 2 (1) 0.487 Yes 399 (100) 514 (100) 220 (99) Lymph node surgery, N (%) ALND 32 (8) 71 (14) 45 (20) 0.222 SLNB 354 (88) 433 (84) 157 (71) TAD 13 (3) 9 (2) 18 (8) Missing 1 (0.3) 3 (0.6) 2 (0.9) Radiotherapy, N (%) No 103 (26) 149 (29) 51 (23) <0.001 Yes 297 (74) 367 (71) 171 (77) Chemotherapy, N (%) No 196 (49) 229 (44) 38 (17) <0.001 Yes 204 (51) 287 (56) 184 (83) Anthracycline-based chemotherapy, N (%) No 243 (61) 308 (60) 63 (28) <0.001 Yes 157 (39) 208 (40) 159 (72) Endocrine therapy, N (%) No 45 (11) 29 (6) 60 (27) <0.001 Yes 355 (89) 487 (94) 162 (73) ALND, axillary lymph node dissection; N, Number of patients; SLNB, sentinel node biopsy; TAD, targeted axillary dissection Relating to surgery performance and type of lymph node surgery, there were no differences between “HER2-low” and HER2–0 and HER2-positive disease. However, there were differences in systemic treatment. The use of endocrine therapy was highest in the “HER2-low” group (94% vs. 89% HER2-0, p p p p Oncologic outcomes The median follow-up time for the population was 43 months (range: 4-54). At the end of follow-up, 31 deaths and 25 disease recurrences were recorded. No significant differences were observed in DFS and OS between “HER2-low” and HER2–0 or HER2-positive disease (  Figures 1  2 Figure 1 Overall survival in patients with HER2-0 (green), HER2-low (red) and HER2-positive (blue) eBC. Kaplan-Meier survival curve showing overall survival probability over four years for three HER2 groups: HER2-low (red), HER2-0 (green), and HER2-positive (blue). HER2-low and HER2-0 have similar survival probabilities, both higher than HER2-positive. Figure 2 Disease-free survival in patients with HER2-0 (green), HER2-low (red) and HER2-positive (blue) eBC. Kaplan-Meier survival plot showing disease-free survival probability over four years for three HER2 groups: HER2-low (red), HER2-0 (green), and HER2-positive (blue). The vertical axis represents survival probability, and the horizontal axis shows time in years. HER2-positive shows a steeper decline towards the end. Unit costs The average treatment costs are presented in  Table 3  Figure 3 Figure 3 Average treatment costs according to HER2 group (values in euros - €). Bar chart comparing costs across three groups: HER2-0, HER2-low, and HER2-positive. HER2-positive has the highest treatment-related and total costs, with treatment-related costs exceeding 25,000. HER2-0 and HER2-low have similar, lower costs. Other costs are relatively consistent across all groups. Table 3 Average treatment costs according to HER2 group (values in euros - €). Type of cost HER2-0 (n=400) HER2-low (n=516) HER2-positive (n=222) P-value Medical costs Mean (SD) 5200 (± 3000) 5300 (± 3800) 25000 (± 17000) <0.001 Other costs Mean (SD) 6500 (± 3200) 6900 (± 3500) 8900 (± 5900) <0.001 Total costs Mean (SD) 12000 (± 5000) 12000 (± 5800) 34000 (± 19000) <0.001 N, number of patients; SD, Standard deviation. In our cohort, HER2-positive disease incurred the highest total costs, with a mean cost of €34,000 per patient, including €25,000 in treatment-related expenses (p<0.001). There were no significant cost differences between the “HER2-low” and HER2–0 groups. Average treatment costs by stage of disease are presented in  Table 4 Table 4 Average treatment costs according to disease stage (values in euros - €). Stage of disease HER2-0 (n=400) HER2-low (n=516) HER2-positive (n=222) Stage I Mean (SD) 4600 (± 2800) 4700 (± 3000) 20000 (± 16000) Stage II Mean (SD) 6900 (± 2900) 6500 (± 4400) 28000 (± 18000) Stage III Mean (SD) 7700 (± 3000) 8600 (± 7200) 36000 (± 16000) N, number of patients; SD, Standard deviation. Discussion Our study aimed to investigate the clinicopathological characteristics, oncologic outcomes, and costs associated with HER2 status in patients with eBC. We found the prevalence of “HER2-low” disease to be 45.3%, consistent with the range reported in other retrospective studies (47.5–56.5%) ( 7 9 Differences in age were observed only in the HER2-positive group, which is expected since younger women are more likely to have HER2-enriched tumors ( 10 “HER2-low” disease showed the highest rate of HR positivity among the three groups, which was statistically significant. The predominance of HR in HER2-low eBC has also been reported in other studies, when compared with HER2-0 ( 5 7 11 8 “HER2-low” eBC was also associated with higher histological grade compared with HER2–0 disease, yet a lower histological grade compared with HER2-positive disease. This aligns with some studies. Di Cosimo et al. ( 5 9 11 “HER2-low” was more often of NST or ductal subtype than HER2–0 eBC, consistent with other studies ( 11 13 14 15 15 In our study, no differences in OS or DFS emerged among the three groups. Other reports have also shown no differences between “HER2-low” and HER2–0 in this regard ( 16 17 5 18 20 13 21 22 Patients with HER2-positive eBC were more frequently treated with chemotherapy (83% vs 51% for HER2–0 and 56% for “HER2-low”, p<0.001). This aligns with current treatment guidelines, which generally recommend neoadjuvant chemotherapy in combination with trastuzumab and pertuzumab for patients with cT2 or cN+ eBC, followed by surgery and adjuvant trastuzumab with or without pertuzumab or trastuzumab-emtansine (T-DM1), depending on treatment response ( 23 25 23 26 27 A key limitation of our study is the short follow-up time for early-stage disease, which limits the number of observed events and impacts the analysis of oncologic outcomes. More time is required to draw firm conclusions about OS and DFS. Moreover, our data came from a single comprehensive oncology center in Northern Portugal, which may limit the generalizability of our findings. Nevertheless, this center is the largest in the country, treating patients from all regions and diverse sociodemographic backgrounds, and its clinical practice follows current guidelines. Therefore, these results likely reflect a broader real-world context despite this constraint. Conclusion In this single-center retrospective analysis, we observed that “HER2-low” eBC displays unique clinicopathological characteristics, notably higher HR positivity compared with HER2–0 eBC and a lower histological grade than HER2-positive disease. Nonetheless, these distinctions did not translate into worse outcomes in terms of DFS and OS, possibly due to the relatively short follow-up and the efficacy of existing adjuvant therapies. Meanwhile, the highest treatment costs were noted among patients with HER2-positive tumors, driven by the expense of targeted agents. Collectively, our results suggest that “HER2-low” has distinct biological and clinical features, though its prognostic value remains uncertain. Longer follow-up, biomarker-driven research and multicentric studies are needed to better elucidate the role of HER2 status in treatment planning and to determine whether novel targeted strategies could further improve outcomes in this population. Data availability statement The datasets presented in this study are not publicly available due to ethical restrictions. Access to the data is limited to the researchers involved in the study as per the ethics committee approval. Requests to access the datasets should be directed to the corresponding author, who will consider them in accordance with the ethical guidelines. Ethics statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation.\" is inaccurate. The ethics committee specified that \"The data will not be shared with external parties and will only be accessible to the approved researchers involved in the study. Author contributions PR: Conceptualization, Data curation, Investigation, Methodology, Project administration, Writing – original draft, Writing – review & editing. LL-C: Conceptualization, Data curation, Formal Analysis, Methodology, Writing – review & editing, Writing – original draft. VS: Data curation, Formal Analysis, Methodology, Writing – review & editing. AC: Conceptualization, Writing – review & editing. MB: Conceptualization, Writing – review & editing. NC: Conceptualization, Writing – review & editing. CL: Conceptualization, Writing – review & editing. DP: Conceptualization, Writing – review & editing. AF: Conceptualization, Supervision, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fonc.2025.1579602/full#supplementary-material References 1 Siegel RL Giaquinto AN Jemal A Cancer statistics, 2024 CA Cancer J Clin 2024 74 12 49 10.3322/caac.21820 38230766 2 Tarantino P Hamilton E Tolaney SM Cortes J Morganti S Ferraro E HER2-low breast cancer: pathological and clinical landscape J Clin Oncol 2020 38 1951–62 10.1200/JCO.19.02488 32330069 3 Cherifi F Da Silva A Johnson A Blanc-Fournier C Abramovici O Broyelle A HELENA: HER2-Low as a prEdictive factor of response to Neoadjuvant chemotherapy in eArly breast cancer BMC Cancer 2022 22 1081 10.1186/s12885-022-10163-9 36266623 PMC9585737 4 Waks AG Winer EP Breast cancer treatment: A review JAMA 2019 321 288 300 10.1001/jama.2018.19323 30667505 5 Di Cosimo S La Rocca E Ljevar S De Santis MC Bini M Cappelletti V Moving HER2-low breast cancer predictive and prognostic data from clinical trials into the real world Front Mol Biosci 2022 9 996434 10.3389/fmolb.2022.996434 36225259 PMC9549400 6 Modi S Jacot W Yamashita T Sohn J Vidal M Tokunaga E Trastuzumab deruxtecan in previously treated HER2-low advanced breast cancer N Engl J Med 2022 387 9 20 10.1056/NEJMoa2203690 35665782 PMC10561652 7 Denkert C Seither F Schneeweiss A Link T Blohmer JU Just M Clinical and molecular characteristics of HER2-low-positive breast cancer: pooled analysis of individual patient data from four prospective, neoadjuvant clinical trials Lancet Oncol 2021 22 1151–61 10.1016/S1470-2045(21)00301-6 34252375 8 Schettini F Chic N Braso-Maristany F Pare L Pascual T Conte B Clinical, pathological, and PAM50 gene expression features of HER2-low breast cancer NPJ Breast Cancer 2021 7 1 10.1038/s41523-020-00208-2 33397968 PMC7782714 9 Park WK Nam SJ Kim SW Lee JE Yu J Ryu JM The impact of HER2-low expression on oncologic outcomes in hormone receptor-positive breast cancer Cancers (Basel) 2023 15 22 5361 10.3390/cancers15225361 38001620 PMC10670388 10 Azim HA Jr. Partridge AH Biology of breast cancer in young women Breast Cancer Res 2014 16 427 10.1186/s13058-014-0427-5 25436920 PMC4303229 11 Tarantino P Jin Q Tayob N Jeselsohn RM Schnitt SJ Vincuilla J Prognostic and biologic significance of ERBB2-low expression in early-stage breast cancer JAMA Oncol 2022 8 1177–83 10.1001/jamaoncol.2022.2286 35737367 PMC9227690 12 Douganiotis G Kontovinis L Markopoulou E Ainali A Zarampoukas T Natsiopoulos I Prognostic significance of low HER2 expression in patients with early hormone receptor positive breast cancer Cancer Diagn Progn 2022 2 316–23 10.21873/cdp.10111 35530657 PMC9066545 13 Mutai R Barkan T Moore A Sarfaty M Shochat T Yerushalmi R Prognostic impact of HER2-low expression in hormone receptor positive early breast cancer Breast 2021 60 62–9 10.1016/j.breast.2021.08.016 34481367 PMC8414540 14 Forster-Sack M Zoche M Pestalozzi B Witzel I Schwarz EI Herzig JJ ERBB2-amplified lobular breast carcinoma exhibits concomitant CDK12 co-amplification associated with poor prognostic features J Pathol Clin Res 2024 10 e12362 10.1002/2056-4538.12362 38335502 PMC10800294 15 Djerroudi L El Sabeh-Ayoun A Benoist C Pierron G Masliah-Planchon J Fuhrmann L Molecular and clinical portrait of HER2-low invasive lobular carcinomas Mod Pathol 2024 37 100463 10.1016/j.modpat.2024.100463 38428737 16 Agostinetto E Rediti M Fimereli D Debien V Piccart M Aftimos P HER2-low breast cancer: molecular characteristics and prognosis Cancers (Basel) 2021 13 11 2824 10.3390/cancers13112824 34198891 PMC8201345 17 de Moura Leite L Cesca MG Tavares MC Santana DM Saldanha EF Guimaraes PT HER2-low status and response to neoadjuvant chemotherapy in HER2 negative early breast cancer Breast Cancer Res Treat 2021 190 155–63 10.1007/s10549-021-06365-7 34409551 18 Ignatov T Eggemann H Burger E Fettke F Costa SD Ignatov A Moderate level of HER2 expression and its prognostic significance in breast cancer with intermediate grade Breast Cancer Res Treat 2015 151 357–64 10.1007/s10549-015-3407-2 25926338 19 Eggemann H Ignatov T Burger E Kantelhardt EJ Fettke F Thomssen C Moderate HER2 expression as a prognostic factor in hormone receptor positive breast cancer Endocr Relat Cancer 2015 22 725–33 10.1530/ERC-15-0335 26187126 20 Rossi V Sarotto I Maggiorotto F Berchialla P Kubatzki F Tomasi N Moderate immunohistochemical expression of HER-2 (2+) without HER-2 gene amplification is a negative prognostic factor in early breast cancer Oncologist 2012 17 1418–25 10.1634/theoncologist.2012-0194 22951668 PMC3500362 21 Almstedt K Heimes AS Kappenberg F Battista MJ Lehr HA Krajnak S Long-term prognostic significance of HER2-low and HER2-zero in node-negative breast cancer Eur J Cancer 2022 173 10–9 10.1016/j.ejca.2022.06.012 35839597 22 Fehrenbacher L Cecchini RS Geyer CE Jr. Rastogi P Costantino JP Atkins JN NSABP B-47/NRG oncology phase III randomized trial comparing adjuvant chemotherapy with or without trastuzumab in high-risk invasive breast cancer negative for HER2 by FISH and with IHC 1+ or 2 J Clin Oncol 2020 38 444–53 10.1200/JCO.19.01455 31821109 PMC7007289 23 Loibl S Andre F Bachelot T Barrios CH Bergh J Burstein HJ Early breast cancer: ESMO Clinical Practice Guideline for diagnosis, treatment and follow-up Ann Oncol 2024 35 159–82 10.1016/j.annonc.2023.11.016 38101773 24 Gianni L Pienkowski T Im YH Tseng LM Liu MC Lluch A 5-year analysis of neoadjuvant pertuzumab and trastuzumab in patients with locally advanced, inflammatory, or early-stage HER2-positive breast cancer (NeoSphere): a multicentre, open-label, phase 2 randomised trial Lancet Oncol 2016 17 791 800 10.1016/S1470-2045(16)00163-7 27179402 25 von Minckwitz G Huang CS Mano MS Loibl S Mamounas EP Untch M Trastuzumab emtansine for residual invasive HER2-positive breast cancer N Engl J Med 2019 380 617–28 10.1056/NEJMoa1814017 30516102 26 von Minckwitz G Procter M de Azambuja E Zardavas D Benyunes M Viale G Adjuvant pertuzumab and trastuzumab in early HER2-positive breast cancer N Engl J Med 2017 377 122–31 10.1056/NEJMoa1703643 28581356 PMC5538020 27 Tolaney SM Tarantino P Graham N Tayob N Pare L Villacampa G Adjuvant paclitaxel and trastuzumab for node-negative, HER2-positive breast cancer: final 10-year analysis of the open-label, single-arm, phase 2 APT trial Lancet Oncol 2023 24 273–85 10.1016/S1470-2045(23)00051-7 36858723 ",
  "metadata": {
    "Title of this paper": "Adjuvant paclitaxel and trastuzumab for node-negative, HER2-positive breast cancer: final 10-year analysis of the open-label, single-arm, phase 2 APT trial",
    "Journal it was published in:": "Frontiers in Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483866/"
  }
}