{
  "title": "Paper_587",
  "abstract": "pmc Cancer Cell Int Cancer Cell Int 96 cancell Cancer Cell International 1475-2867 BMC PMC12482532 PMC12482532.1 12482532 12482532 41024119 10.1186/s12935-025-03985-7 3985 1 Research Transcription factor MYB regulates glycolysis to promote the transfer and malignant progression of gastric cancer through the SSBP2/ISL1 axis Sun Zhenni 1 Zhou Mi 2 Yao Yasai 3 Chen Xuehong 4 Qin Tao 2 Han Yafei 5 Yue Lu qd_yuelu@163.com 1 Yao Ruyong yry0303@163.com 5 1 https://ror.org/0207yh398 grid.27255.37 0000 0004 1761 1174 Qingdao Municipal Hospital, Shandong University, 2 https://ror.org/02jqapy19 grid.415468.a 0000 0004 1761 4893 Department of Oncology, Qingdao Municipal Hospital, Qingdao Hospital of University of Health and Rehabilitation Sciences, 3 4 https://ror.org/021cj6z65 grid.410645.2 0000 0001 0455 0905 Department of Pharmacology, School of Basic Medicine, Qingdao University, 5 https://ror.org/026e9yy16 grid.412521.1 0000 0004 1769 1119 Medical Research Center, the Affiliated Hospital of Qingdao University, 29 9 2025 2025 25 478344 322 13 11 2024 9 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background The transcription factor (TF) MYB is crucial to many biological processes. Single-stranded DNA binding protein 2 (SSBP2), insulin gene enhancer protein 1 (ISL1) and glycolysis participated in the development of gastric cancer (GC). This study aims to explore the regulatory mechanism of the MYB/SSBP2/ISL1 axis in the development of GC. Methods The dataset GSE65801 Results MYB is the key differential expression TF in GC, and SSBP2 is a key target gene of MYB. MYB had a higher expression, but SSBP2 had a lower expression in GC patients’ gastric cancer tissue. SSBP2 is a direct target of MYB in GC cells. SSBP2 was transcriptionally repressed by MYB. SSBP2 further negatively regulates ISL1 expression. MYB knockdown inhibited glycolysis, proliferation, invasion, and migration abilities in GC cells both in vivo and in vitro, but it was also reversed by SSBP2 knockdown. SSBP2 overexpression inhibits glycolysis, cell proliferation, invasion and migration abilities in GC cells, but it was reversed by ISL1 overexpression. Conclusion MYB mediates glycolysis and malignant progression in GC cells through regulation of the SSBP2/ISL1 axis. Supplementary Information The online version contains supplementary material available at 10.1186/s12935-025-03985-7. Keywords Gastric cancer (GC) Glycolysis MYB Single-stranded DNA binding protein 2 (SSBP2) Insulin gene enhancer protein 1 (ISL1) pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Gastric cancer (GC) is one of the malignant tumours with high mortality and morbidity rates worldwide is characterised by high invasiveness, high metastasis and poor prognosis [ 1 2 3 Glycolysis in tumour cells has been shown to influence their therapeutic efficacy and patient prognosis, and is critical for their malignant behaviour [ 4 5 6 7 8 Transcription factors have been found to play a crucial function in regulating aerobic glycolysis, such as Hypoxia-inducible factor 1 (HIF‐1) affects chemoresistance in lung cancer related to regulating glycolysis [ 9 10 11 12 13 14 Single-stranded DNA binding protein 2 (SSBP2) is a subunit of the ssDNA-binding complex that can maintain the stability of the genome and regulate gene expression and function [ 15 16 17 18 19 In this study, we found that the transcription factor MYB was related to GC. Then, we further explored the mechanisms mediating MYB in the regulation of glycolysis and clarified the regulation mechanisms of MYB to the SSBP2/ISL1 axis in GC. We hope to provide a new scientific foundation for exploring the molecular mechanism of glycolysis and malignant cell migration of GC. And find a promising therapeutic target for the treatment of GC. Experimental procedures Clinical samples Each 36 gastric cancer tissue and paracancerous tissue samples from GC patients (Male = 23, Female = 13) were harvested in the Qingdao Municipal Hospital between 2009 and 2011. The tissue samples were saved in Liquid nitrogen or 4% Paraformaldehyde fixed for subsequent experiments. The Qingdao Municipal Hospital Ethics Committee (approval number: 2023-092) approved the study protocol, which included clinical data collection, pathological review, and molecular studies. And all patients were consented to participate and provided written consent. The studies in this work abide by the Declaration of Helsinki principles. Table 1  Table 1 Clinicopathologic information in 36 patients with gastric cancer Characteristics Number of cases  All 36 (100%)  Gender Male 2 (50.00%) Female 5 (36.11%) Age(years) median (IQR) 61 (48 67) < 55 14 (38.89%) ≥ 55 22 (61.11%) Lauren’s classification n (%) Mixed 3 (8.33%) Diffuse 18 (50%) Intestinal 15 (41.67%) Size (cm), median (IQR) 4 (2.875, 5) Histological grading n (%) Low 20 (55.55%) middle 6 (16.67%) High 10 (27.78%) Lymph node metastasis (Yes = with metastasis) n (%) Yes 23 (63.89%) No 13 (36.11%) Infiltration depth n (%) serosa 23 (63.89%) muscularis propria 4 (11.11%) muscularis mucosa 1 (2.78%) submucosa 4 (11.11%) Subserosal 1 (2.78%) mucosa 3 (8.33%)  PTNM stage 0 3 (8.33%) 1 A 3 (8.33%) 1B 5 (13.89%) 2 7 (19.44%) 3 18 (50.00%) Survival (death = 1/live = 0) n (%) 0 24 (66.67%) 1 12 (33.33%) Survival time (months), median (IQR) 41 (20.75, 42.25) Bioinformatics analysis The GSE65801 20 21 22 2 23 24 https://esefinder.ahc.umn.edu/cgi-bin/tools/ESE3/esefinder.cgi 25 26 https://bio.liclab.net/KnockTF/index.php http://gtrd20-06.biouml.org/ https://chip-atlas.org/ https://guolab.wchscu.cn/hTFtarget/#!/ https://www.cancer.gov/ccg/research/genome-sequencing/tcga https://www.ncbi.nlm.nih.gov/geo/ 27 http://www.urogene.org/methprimer/ https://cn.string-db.org/ https://xenabrowser.net/datapages/ 28 29 RT-qPCR The total RNA of the tissue sample and cells were extracted with TRIzol reagent (Invitrogen,15596026) and reverse transcribed into single-stranded complementary DNA (cDNA) by One Step Prime Script miRNA cDNA Synthesis Kit (Takara, Kyoto, Japan). Using SYBR Green PCR Master Mix (Life Technologies, CA, USA), follow the manufacturer’s procedures for RT-qPCR. The sequence of RT-qPCR primers is shown in Table 2 −ΔΔCt  Table 2 PCR primer sequence Genes Primer Sequence(5’−3’) MYB forward 5’- ATGACTATGATGGGCTGCTT − 3’ reverse 5’- TGCCTGGTAAATAATTCTGTCT − 3’ SSBP2 forward 5’- ATGTACGGCAAAGGCAAGA − 3’ reverse 5’- TAGCACTGGACTGGGAGC − 3’ ISL1 forward 5’- TGCGGACTGTGCTGAACG − 3’ reverse 5’- ACTGGCTACCATGCTGTTAGGT − 3’ GAPDH forward 5’-TGACCACAGTCCATGCCATCAC-3’ reverse 5’-CGCCTGCTTCACCACCTTCTT-3’ Immunohistochemical The tissue samples were used for paraffin slice sections stained with immunohistochemistry (IHC) by MYB (1:200, 59995, Cell Signaling, USA) and SSBP2 (1:50, ab177944, Abcam, UK) antibodies and then joined with HRP antibody and DAB chromogenic agent for immune testing. The results were photographed under a microscope (400857, Nikon, Japan). Cell culture Human GC cells (HGC-27, AGS, NCI-N87, KATO III and MKN-45) and Gastric epithelial cells (GES-1) purchased from China Wuhan Procell Life Science & Technology Co, Ltd. The cells were cultured in RPMI-1640 or DMEM medium (Sigma-Aldrich, MO, USA) containing 10% fetal bovine serum (FBS; Gibco, CA, USA) and 1% Penicillin/Streptomycin (Sigma-Aldrich), respectively, and cultured in a 5% CO 2 Cell transfection The cells were cultured overnight in a 24-well plate. When the cell density reached about 60%−70%, si-/oe-NC, si/oe-SSBP2, si/oe-MYB and oe-ISL1 were transfected into the cells according to the instructions of Lipofectamine 3000 reagent (Invitrogen, Grand Island, NY, USA). The cells were cultured at 37 ℃ and 5% CO 2 Western blot Total proteins of each group tissue sample and cell were extracted with RIPA buffer (Sigma-Aldrich, USA) containing 1% protease inhibitor and phosphatase inhibitor, separated with 10% SDS-PAGE gel, and transferred to polyvinylidene fluoride (PVDF) membrane (Millipore, MA, USA). At room temperature, the film was sealed with 5% skim milk for 2 h, the first antibody was added and spent the night at 4 °C, and then the second antibody with HRP conjugated (1:2000, ab205718, Abcam, UK) was incubated at room temperature for 1 h. ECL chemiluminescence solution development (BD Biosciences) was used for exposure and observation, and Image J was used for protein band analysis. Anti-β-actin antibody (1:1000, ab8226, Abcam, UK) was used as control. The following primary antibodies purchased from Abcam UK: anti-SSBP2 (1:1000, ab177944), anti-ISL1 (1:500, ab86472), anti-LDHA (1:1000, ab101562), anti-HK-2 (1:1000, ab209847), anti-GLUT1 (1:2500, ab14683) and anti-MYB (1:1000, 59995) purchased from Cell Signaling, USA. CCK-8 detection The CCK-8 test kit (Beyotime Biotechnology, Beijing, China) was used to detect cell viability. Each group of cells were added to a 96-well plate at a concentration of 3 × 10 3 Cell migration, invasion and colony formation assay GC cells were seeded in 6-well plates, one scratch per well was made with a sterile gun head, and PBS was used for cleaning the cell debris and taken at 0 h and 24 h. Image J was used to detect the cell migration. GC cells were adjusted to 5 × 10 4 GC cells were adjusted to 1000/well seeded in 6-well plates and cultured for 2 weeks. Then, 4% paraformaldehyde was used to fix, and crystal violet was used to stain cells. A light microscope and Image J were used to analyse the number of clones. Flow cytometry GC cells were gathered, rinsed twice using PBS, and revived with 200 µL of PBS. The rate of programmed cell death was measured using the Annexin-V-FITC/PI apoptosis kit from Absin, a company based in China. Following the guidelines provided by the producer, 5 µL of Annexin V-FITC and 5 µL of PI were introduced into every well and cultured for 15 min in a dimly lit chamber, after which apoptosis was identified using FACScan flow cytometry. Glucose uptake, lactate secretion, lactate dehydrogenase (LDH) activity and ATP level assay The Glucose Content Assay Kit (BC2505), Lactic Acid (LA) Content Assay Kit (BC2235), LDH Activity Assay Kit (BC0685) and ATP Content Assay Kit (BC0305) were purchased from Beijing Solarbio Science&Technology Co., Ltd. Specific operation referenced the instructions of Kits, the Microplate Reader was used to measure the absorbance values. Dual-luciferase assay and Yeast-one hybrid Dual luciferase assays were performed according to standard protocols (Promega, Madison, USA). The luciferase gene was cloned downstream of the SSBP2 wild-type (SSBP2-WT) or mutant region (SSBP2-MUT) and co-transfected into cells with pcDNA3.1-MYB and control vectors. After 48 h, cells were lysed and luciferase activity was determined using the Dual-Luciferase ® 30 CO-IP After IP lysis buffer lysis of cells, centrifuge and collect the supernatant. Protein A/G Sepharose (Santa Cruz Biotechnology) with the Anti-SSBP2 and Anti-ISL1 was incubated for 60 min, and cleaned twice. Then, all IPs were set overnight at 4℃. After centrifuging the beads and using a lysis buffer to wash them, the immune system precipitates by WB. Pull down The pull-down assay referenced previously conducted research [ 31 32 Immunofluorescence (IF) Cells were cultured in the 24-well plates with a density of 2 × 10 4 Chromatin Immunoprecipitation (ChIP)-seq and ChIP-PCR assays ChIP analysis was performed using a ChIP kit (JKR23002A, GeneCreate Biotech, China). The cells were crosslinked with 1% formaldehyde (final concentration) for 10 min by inverting flasks at room temperature and quenched with 0.125 M Glycine for 5 min. The cell pellets were washed repeatedly in PBS and then stored at −80 °C. The pellets were lysed in lysis buffer (50 mM HEPES, 150 mM NaCl, 1 mM EDTA, 0.1% SDS, 0.1% sodium deoxycholate,1% Triton X-100, and complemented with protease inhibitor cocktail) for 10 min. After centrifugation, supernatant was discarded, and the pellet was lysed in lysis buffer and subjected to sonication. Sheared chromatin was incubated with primary antibody bound to the PierceTM Protein A/G Agarose Beads (Thermo Fisher Scientific, Inc.) overnight, followed by elution and reverse cross-linking at 65 °C overnight. TE buffer (10mMTris-Hcl, 1mM EDTA) was added to DNA elution buffer followed by RNase treatment (0.5 mg/mL) at 37 °C for 30 min and by proteinase K treatment (0.3 mg/mL) at 51 °C for 1 h, and the DNA was isolated and purified subsequently. For ChIP-seq assays: immunoprecipitated DNA was used to construct Illumina sequencing libraries following the manufacturer’s instructions and sequenced on Illumina Novoseq 6000 sequencing platform. After evaluating the raw data in FastQC, low-quality reads were removed by using Trimmomatic, and the cleaned ChIP-seq reads were mapped to the reference genome using BWA software. Read counts were normalized to RPM (Reads per million mapped reads). Peak calling was performed using MACS2 with P Electrophoretic mobility shift assay (EMSA) The probe sequences employed in this experiment are as follows: WT: attttcccgtctttatgtctggttgccaaccgcgtttttgattctcgacctctcacttt; MT: attttcccgtctttatgtctggttattggttatatttttgattctcgacctctcacttt. Perform EMSA and supershift EMSA using the EMSA/Gel-Shift Kit (GS002, Beyotime). Competitive experiments were conducted using 10-fold, 50-fold, and 100-fold concentrations of unlabeled oligonucleotides. Perform EMSA according to the kit instructions. Add protein MYB at ratios of total protein/purified protein (12 µg/2 µg), followed by the probe and antibody as required for the EMSA binding reaction. Incubate at room temperature for 30 min. The entire reaction mixture was electrophoresed at 60 V for 1 h on a non-denaturing 0.5× TBE 6% polyacrylamide gel at 4 °C, then transferred to a Biodyne ® Animal experiments BALB/c nude mice (20 ± 2 g) were purchased from Hunan Slake Jingda Laboratory Animal Co. The animal experiment protocol of this study was reviewed and approved by the Animal Ethics Committee of Qingdao Municipal Hospital Group (No. AHQU-MAL20210716YHJ), and it was confirmed that the maximum tumour size (12 mm) was not exceeded. In vivo tumour growth was assessed using AGS cells transfected with si-NC/si-MYB, which were injected subcutaneously into the axillary region of the forelimbs of mice (1 × 10 7 2 Statistical analysis This paper’s experimental data are expressed as mean standard deviation (mean ± SD). The data were analysed and plotted with GraphPad Prism 8. T-test (t-tests) was used for comparison between the two groups, one-way analysis of variance (One-way ANOVA) was used for comparison between groups, and two-way analysis of variance (Two-way ANOVA) was used for pairwise comparison between groups. Results Identification of key TFs and genes in GC In the analysis between the Normal group and GC samples group, a total of 2406 differentially expressed genes (DEGs, Supplementary Table 5), including 1242 genes that were up-regulated and 1164 genes that were down-regulated, as shown in Fig. 1 1 1 GSE65801 1 1 25 1 1 1 33 35  Fig. 1 Identification of key TFs and genes in GC. ( A B GSE65801 C D GSE65801 E F (G H I MYB/SSBP2 axis plays a key role in GC We further performed ROC curve prediction of key TFs: LEF1, TFAP2A, MYB, and E2F7 (Fig. 2 2 2 S5 3 3 3 4 4 4 4 2 4 4  Fig. 2 The expression levels of key TFs in GC tissue. ( A B P P P  Fig. 3 The results of ChIP-seq and ChIP-PCR assays. ( A B C P  Fig. 4 The results of database validation. ( A B C D E F G P P P MYB knockdown inhibits glycolysis and malignant progression in GC cells To further understand the mechanism of MYB in GC cells. In this study, we transfected si-NC and si-MYB into the AGS and MKN-45 cells. The transfection efficiency was detected using RT-qPCR and Western blot. Compared with the NC or si-NC group, the si-MYB group had a lower expression level (Fig. 5 5 5 5 5 5 5 5 S1  Fig. 5 MYB knockdown inhibits glycolysis and malignant progression in GC cells. The transfection efficiency was detected using RT-qPCR ( A B C D E F G H I P P P SSBP2 overexpression inhibits glycolysis and malignant progression in GC cells SSBP2 is a tumour inhibitor factor; it has been reported that expression is of great significance in GC patients [ 36 6 6 6 6 6 6 6 6 S2  Fig. 6 SSBP2 overexpression inhibits glycolysis and malignant progression in GC cells. The transfection efficiency was detected using RT-qPCR ( A B C D E F G H I P P P MYB can transcriptionally regulate the expression of the SSBP2/ISL1 axis Based on the above results, SSBP2 is a direct target of MYB in GC cells, and found MYB was negatively correlated with SSBP2 (Fig. 7 7 7 7 7 7 7 7 S3 S3  Fig. 7 MYB can transcriptionally regulate the expression of the SSBP2/ISL1 axis. ( A B C D E F G H I P MYB mediates glycolysis and malignant progression in GC cells through regulation of the SSBP2/ISL1 axis To explore the mechanism of MYB in GC cells, we transfected oe/si-NC, si-SSBP2 and oe-ISL1 into the AGS and MKN-45 cells. Compared with the NC or oe/si-NC group, the oe-ISL1 group had higher ISL1 expression, and the si-SSBP2 group had lower SSBP2 expression (Figure S3 8 8 8 8 8 8 8 9 S4  Fig. 8 MYB mediates glycolysis and malignant progression in GC cells through regulation of the SSBP2/ISL1 axis. RT-qPCR ( A B C D E F G H P P # P ## P ### P  Fig. 9 MYB mediates glycolysis in GC cells through regulation of the SSBP2/ISL1 axis. ( A B P P # P ## P ### P MYB mediates GC cell growth in vivo To further verify the effect of knocking down MYB on the growth of GC cells in vivo, we constructed a subcutaneous xenograft tumour model in nude mice using AGS cells. The results showed that the size and weight of tumours in the MYB knockdown group were significantly lower than those in the control group (Fig. 10 10 10 10  Fig. 10 MYB mediates GC cell growth in vivo. ( A B C D E P P Discussion Various factors, including multigene mutations, multiple signalling pathways, and complex factors, cause gastric cancer (GC). Tumour development and progression have been shown to be closely associated with reprogramming of tumour metabolism, and the Warburg effect is a major phenotypic feature of metabolism in multiple cancer types. Targeting glycolysis in tumour metabolism may provide a potential therapeutic strategy for gastric cancer treatment [ 37 38 39 40 25 Based on bioinformatics, we screened four key TFs: LEF1, TFAP2A, MYB and E2F7. In previous studies, E2F1, TFAP2A, MYB and E2F7 were also reported to have critical roles in GC. E2F1 overexpression or E2F7 knockdown affects the growth and proliferation of GC cells through transcriptional activation and transcriptional repression of MYBL2 [ 41 42 43 44 45 46 47 48 11 36 49 Following this, we further found that SSBP2 interacted with ISL1 and negatively regulated the expression ISL1. Previous studies have shown that ISL1 is positively associated with poor prognosis and can become a potential target for treating GC [ 50 51 52 53 In summary, we combined bioinformatics analysis and experimental validation to confirm that MYB is a key TF in gastric cancer, and SSBP2 is a direct target gene of MYB and MYB transcriptional repression; and confirmed in vivo and in vitro that MYB mediates glycolysis and malignant progression of GC cells by regulating the SSBP2/ISL1 axis.The regulation of the SSBP2/ISL1 axis by MYB may be a possible regulatory glycolysis to improve GC therapy. However, there are some shortcomings in this study, and we should further confirm this conclusion at the clinical level in the follow-up study, and secondly, the exploration of the molecular mechanism is not deep enough, and we should further explore the specific molecular mechanism of the MYB/SSBP2/ISL1 axis in the progression of gastric cancer in depth in the follow-up study, and clarify the key role of its regulation as well as the specific molecular mechanism of its role in the glycolysis of cancer. This study was only confirmed by cells, and further exploratory studies at the clinical level are needed. Supplementary Information  Supplementary Material 1.  Supplementary Material 2.  Supplementary Material 3.  Supplementary Material 4.  Supplementary Material 5.  Supplementary Material 6.  Supplementary Material 7. Abbreviations TF Transcription factor SSBP2 Single-stranded DNA binding protein 2 ISL1 Insulin gene enhancer protein 1 GC Gastric cancer IF Immunofluorescence HDAC Histone deacetylase HIF‐1 Hypoxia‐inducible factor 1 AML Acute myeloid leukaemia DEGs Differentially expressed genes LDHA Lactate dehydrogenase A GLUT1 Glucose transporter 1 HK-2 Hexokinase II MYBL2 MYB Proto-Oncogene Like 2 OPA3 Optic atrophy 3 HCC Hepatocellular carcinoma PFKFB3 6‐phosphofructo‐2‐kinase/fructose‐2,6‐biphosphatase 3 GO Gene ontology KEGG Kyoto encyclopedia of genes and genomes LA Lactic acid LDH Lactate dehydrogenase SD Synthetic dropout AbA Aureobasidin A FBS Fetal bovine serum GES-1 Gastric epithelial cells cDNA Complementary DNA WT Wild-type MUT Mutant ChIP Chromatin immunoprecipitation EMSA Electrophoretic mobility shift assay Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Zhenni Sun and Zhou aThese authors contributed to the work equally and should be regarded as co-first authors. Acknowledgements We acknowledge GO, KEGG, GEO, LncSEA, TCGA, ENCORI, TRED, NPInter, TransmiRv2.0, TRRUSTV2.0, JASPAR, KnockTF, Meth Primer and STRING database for providing their platforms and contributors for uploading their meaningful datasets. And thank all our patients for their support and our colleagues for their helpful suggestions. Author contributions Conceived and designed the experiments, Zhenni Sun, Lu Yue; Performed the experiments, Yafei Han, Yasai Yao; Analyzed the data, Tao Qin, Xuehong Chen; Contributed reagents/materials/analysis tools, Ruyong Yao; Writing-original draft, Zhenni Sun. Writing-review & editing, Mi Zhou. Funding information The study did not receive funding. Data availability All data generated or analysed during this study are included in this published article [and its supplementary information files]. Declarations Ethics approval and consent to participate The Qingdao Municipal Hospital Ethics Committee (approval number: 2023-092) approved the study protocol, which included clinical data collection, pathological review, and molecular studies. And all patients were consented to participate and provided written consent. Consent for publication All the authors have read and approved the final article. Competing interests The authors declare no competing interests. References 1. Torre LA Bray F Siegel RL Ferlay J Lortet-Tieulent J Jemal A Global cancer statistics, 2012 CA Cancer J Clin 2015 65 2 87 108 25651787 10.3322/caac.21262 Torre LA, Bray F, Siegel RL, Ferlay J, Lortet-Tieulent J, Jemal A. Global cancer statistics, 2012. CA Cancer J Clin. 2015;65(2):87–108. 25651787 10.3322/caac.21262 2. Massarrat S Stolte M Development of gastric cancer and its prevention Arch Iran Med 2014 17 7 514 20 24979566 Massarrat S, Stolte M. Development of gastric cancer and its prevention. Arch Iran Med. 2014;17(7):514–20. 24979566 3. Spolverato G Ejaz A Kim Y Squires MH Poultsides GA Fields RC Rates and patterns of recurrence after curative intent resection for gastric cancer: a united States multi-institutional analysis J Am Coll Surg 2014 219 4 664 75 10.1016/j.jamcollsurg.2014.03.062 25154671 Spolverato G, Ejaz A, Kim Y, Squires MH, Poultsides GA, Fields RC, et al. Rates and patterns of recurrence after curative intent resection for gastric cancer: a united States multi-institutional analysis. J Am Coll Surg. 2014;219(4):664–75. 25154671 10.1016/j.jamcollsurg.2014.03.062 4. Paul S Ghosh S Kumar S Tumor glycolysis, an essential sweet tooth of tumor cells Sem Cancer Biol 2022 86 Pt 3 1216 30 10.1016/j.semcancer.2022.09.007 36330953 Paul S, Ghosh S, Kumar S. Tumor glycolysis, an essential sweet tooth of tumor cells. Sem Cancer Biol. 2022;86(Pt 3):1216–30. 10.1016/j.semcancer.2022.09.007 36330953 5. Liberti MV Locasale JW The warburg effect: how does it benefit cancer cells?? Trends Biochem Sci 2016 41 3 211 8 10.1016/j.tibs.2015.12.001 26778478 PMC4783224 Liberti MV, Locasale JW. The warburg effect: how does it benefit cancer cells?? Trends Biochem Sci. 2016;41(3):211–8. 26778478 10.1016/j.tibs.2015.12.001 PMC4783224 6. Upadhyay M Samal J Kandpal M Singh OV Vivekanandan P The Warburg effect: insights from the past decade Pharmacol Ther 2013 137 3 318 30 10.1016/j.pharmthera.2012.11.003 23159371 Upadhyay M, Samal J, Kandpal M, Singh OV, Vivekanandan P. The Warburg effect: insights from the past decade. Pharmacol Ther. 2013;137(3):318–30. 23159371 10.1016/j.pharmthera.2012.11.003 7. Jiang Z Yang H Zhang X Wang Z Rong R Wang X Histone deacetylase-1 as a prognostic factor and mediator of gastric cancer progression by enhancing glycolysis Hum Pathol 2019 85 194 201 10.1016/j.humpath.2018.10.031 30500418 Jiang Z, Yang H, Zhang X, Wang Z, Rong R, Wang X. Histone deacetylase-1 as a prognostic factor and mediator of gastric cancer progression by enhancing glycolysis. Hum Pathol. 2019;85:194–201. 30500418 10.1016/j.humpath.2018.10.031 8. Shao M Zhang J Zhang J Shi H Zhang Y Ji R Mao F Qian H Xu W Zhang X SALL4 promotes gastric cancer progression via hexokinase II mediated glycolysis Cancer Cell Int 2020 20 188 10.1186/s12935-020-01275-y 32489324 PMC7247129 Shao M, Zhang J, Zhang J, Shi H, Zhang Y, Ji R, et al. SALL4 promotes gastric cancer progression via hexokinase II mediated glycolysis. Cancer Cell Int. 2020;20:188. 32489324 10.1186/s12935-020-01275-y PMC7247129 9. Sowa T Menju T Chen-Yoshikawa TF Takahashi K Nishikawa S Nakanishi T Hypoxia-inducible factor 1 promotes chemoresistance of lung cancer by inducing carbonic anhydrase IX expression Cancer Med 2017 6 1 288 97 10.1002/cam4.991 28028936 PMC5269694 Sowa T, Menju T, Chen-Yoshikawa TF, Takahashi K, Nishikawa S, Nakanishi T, et al. Hypoxia-inducible factor 1 promotes chemoresistance of lung cancer by inducing carbonic anhydrase IX expression. Cancer Med. 2017;6(1):288–97. 28028936 10.1002/cam4.991 PMC5269694 10. Dang CV Myc on the path to cancer Cell 2012 149 1 22 35 10.1016/j.cell.2012.03.003 22464321 PMC3345192 Dang CV. Myc on the path to cancer. Cell. 2012;149(1):22–35. 22464321 10.1016/j.cell.2012.03.003 PMC3345192 11. Liu M Du Q Mao G Dai N Zhang F MYB proto-oncogene like 2 promotes hepatocellular carcinoma growth and glycolysis via binding to the optic atrophy 3 promoter and activating its expression Bioengineered 2022 13 3 5344 56 10.1080/21655979.2021.2017630 35176941 PMC8973866 Liu M, Du Q, Mao G, Dai N, Zhang F. MYB proto-oncogene like 2 promotes hepatocellular carcinoma growth and glycolysis via binding to the optic atrophy 3 promoter and activating its expression. Bioengineered. 2022;13(3):5344–56. 35176941 10.1080/21655979.2021.2017630 PMC8973866 12. Pham T Pereira L Roth S Galletta L Link E Akhurst T First-in-human phase I clinical trial of a combined immune modulatory approach using TetMYB vaccine and anti-PD-1 antibody in patients with advanced solid cancer including colorectal or adenoid cystic carcinoma: the MYPHISMO study protocol ( NCT03287427 Contemp Clin Trials Commun 2019 16 100409 10.1016/j.conctc.2019.100409 31650066 PMC6804811 Pham T, Pereira L, Roth S, Galletta L, Link E, Akhurst T, et al. First-in-human phase I clinical trial of a combined immune modulatory approach using TetMYB vaccine and anti-PD-1 antibody in patients with advanced solid cancer including colorectal or adenoid cystic carcinoma: the MYPHISMO study protocol ( NCT03287427 31650066 10.1016/j.conctc.2019.100409 PMC6804811 13. Srivastava SK Bhardwaj A Arora S Singh S Azim S Tyagi N Carter JE Wang B Singh AP MYB is a novel regulator of pancreatic tumour growth and metastasis Br J Cancer 2015 113 12 1694 703 10.1038/bjc.2015.400 26657649 PMC4701995 Srivastava SK, Bhardwaj A, Arora S, Singh S, Azim S, Tyagi N, Carter JE, Wang B, Singh AP. MYB is a novel regulator of pancreatic tumour growth and metastasis. Br J Cancer. 2015;113(12):1694–703. 26657649 10.1038/bjc.2015.400 PMC4701995 14. Yang RM Nanayakkara D Kalimutho M Mitra P Khanna KK Dray E Gonda TJ MYB regulates the DNA damage response and components of the homology-directed repair pathway in human estrogen receptor-positive breast cancer cells Oncogene 2019 38 26 5239 49 10.1038/s41388-019-0789-3 30971760 Yang RM, Nanayakkara D, Kalimutho M, Mitra P, Khanna KK, Dray E, et al. MYB regulates the DNA damage response and components of the homology-directed repair pathway in human estrogen receptor-positive breast cancer cells. Oncogene. 2019;38(26):5239–49. 30971760 10.1038/s41388-019-0789-3 15. Li J Kurasawa Y Wang Y Clise-Dwyer K Klumpp SA Liang H Requirement for Ssbp2 in hematopoietic stem cell maintenance and stress response J Immunol 2014 193 9 4654 62 10.4049/jimmunol.1300337 25238756 PMC4201964 Li J, Kurasawa Y, Wang Y, Clise-Dwyer K, Klumpp SA, Liang H, et al. Requirement for Ssbp2 in hematopoietic stem cell maintenance and stress response. J Immunol. 2014;193(9):4654–62. 25238756 10.4049/jimmunol.1300337 PMC4201964 16. Liang H Samanta S Nagarajan L SSBP2, a candidate tumor suppressor gene, induces growth arrest and differentiation of myeloid leukemia cells Oncogene 2005 24 16 2625 34 10.1038/sj.onc.1208167 15782145 Liang H, Samanta S, Nagarajan L. SSBP2, a candidate tumor suppressor gene, induces growth arrest and differentiation of myeloid leukemia cells. Oncogene. 2005;24(16):2625–34. 15782145 10.1038/sj.onc.1208167 17. Wang W Shi Q Guo T Yang Z Jia Z Chen P Zhou C PDX1 and ISL1 differentially coordinate with epigenetic modifications to regulate insulin gene expression in varied glucose concentrations Mol Cell Endocrinol 2016 428 38 48 10.1016/j.mce.2016.03.019 26994512 Wang W, Shi Q, Guo T, Yang Z, Jia Z, Chen P, Zhou C. PDX1 and ISL1 differentially coordinate with epigenetic modifications to regulate insulin gene expression in varied glucose concentrations. Mol Cell Endocrinol. 2016;428:38–48. 26994512 10.1016/j.mce.2016.03.019 18. Liu Y Li Y Li T Lu H Jia Z Wang W Pou homeodomain protein OCT1 modulates islet 1 expression during cardiac differentiation of P19CL6 cells Cell Mol Life Sci 2011 68 11 1969 82 10.1007/s00018-010-0544-y 20960024 PMC11115038 Liu Y, Li Y, Li T, Lu H, Jia Z, Wang W, et al. Pou homeodomain protein OCT1 modulates islet 1 expression during cardiac differentiation of P19CL6 cells. Cell Mol Life Sci. 2011;68(11):1969–82. 20960024 10.1007/s00018-010-0544-y PMC11115038 19. Li L Sun F Chen X Zhang M ISL1 is upregulated in breast cancer and promotes cell proliferation, invasion, and angiogenesis Onco Targets Ther 2018 11 781 9 10.2147/OTT.S144241 29497310 PMC5818873 Li L, Sun F, Chen X, Zhang M. ISL1 is upregulated in breast cancer and promotes cell proliferation, invasion, and angiogenesis. Onco Targets Ther. 2018;11:781–9. 29497310 10.2147/OTT.S144241 PMC5818873 20. Li H Yu B Li J Su L Yan M Zhang J Li C Zhu Z Liu B Characterization of differentially expressed genes involved in pathways associated with gastric cancer PLoS ONE 2015 10 4 e0125013 10.1371/journal.pone.0125013 25928635 PMC4415781 Li H, Yu B, Li J, Su L, Yan M, Zhang J, Li C, Zhu Z, Liu B. Characterization of differentially expressed genes involved in pathways associated with gastric cancer. PLoS ONE. 2015;10(4):e0125013. 25928635 10.1371/journal.pone.0125013 PMC4415781 21. Ulusan Bağcı Ö Caner A Defining the molecular signal pathways and upstream regulators in cutaneous leishmaniasis with transcriptomic data approach Mikrobiyol Bul 2021 55 1 67 80 10.5578/mb.20092 33590982 Ulusan Bağcı Ö, Caner A. Defining the molecular signal pathways and upstream regulators in cutaneous leishmaniasis with transcriptomic data approach. Mikrobiyol Bul. 2021;55(1):67–80. 33590982 10.5578/mb.20092 22. Zhao Z Yang H Ji G Su S Fan Y Wang M Gu S Identification of hub genes for early detection of bone metastasis in breast cancer Front Endocrinol 2022 13 1018639 10.3389/fendo.2022.1018639 PMC9556899 36246872 Zhao Z, Yang H, Ji G, Su S, Fan Y, Wang M, Gu S. Identification of hub genes for early detection of bone metastasis in breast cancer. Front Endocrinol. 2022;13:1018639. 10.3389/fendo.2022.1018639 PMC9556899 36246872 23. The Gene Ontology Resource 20 years and still going strong Nucleic Acids Res 2019 47 D1 D330 8 10.1093/nar/gky1055 30395331 PMC6323945 The Gene Ontology Resource. 20 years and still going strong. Nucleic Acids Res. 2019;47(D1):D330–8. 30395331 10.1093/nar/gky1055 PMC6323945 24. Kanehisa M Sato Y Kawashima M Furumichi M Tanabe M KEGG as a reference resource for gene and protein annotation Nucleic Acids Res 2016 44 D1 D457 462 10.1093/nar/gkv1070 26476454 PMC4702792 Kanehisa M, Sato Y, Kawashima M, Furumichi M, Tanabe M. KEGG as a reference resource for gene and protein annotation. Nucleic Acids Res. 2016;44(D1):D457-462. 26476454 10.1093/nar/gkv1070 PMC4702792 25. Zhou LQ Li SH Wu Y Xin L Establishment of a prognostic model of ten transcription factors in gastric cancer Genomics 2021 113 6 4075 87 10.1016/j.ygeno.2021.10.009 34688795 Zhou LQ, Li SH, Wu Y, Xin L. Establishment of a prognostic model of ten transcription factors in gastric cancer. Genomics. 2021;113(6):4075–87. 34688795 10.1016/j.ygeno.2021.10.009 26. Sun Q Qin X Zhao J Gao T Xu Y Chen G Bai G Guo Z Liu J Cuproptosis-related lncRNA signatures as a prognostic model for head and neck squamous cell carcinoma Apoptosis 2023 28 1–2 247 62 10.1007/s10495-022-01790-5 36344660 Sun Q, Qin X, Zhao J, Gao T, Xu Y, Chen G, et al. Cuproptosis-related lncRNA signatures as a prognostic model for head and neck squamous cell carcinoma. Apoptosis. 2023;28(1–2):247–62. 36344660 10.1007/s10495-022-01790-5 27. Li LC Dahiya R MethPrimer: designing primers for methylation PCRs Bioinformatics 2002 18 11 1427 31 10.1093/bioinformatics/18.11.1427 12424112 Li LC, Dahiya R. MethPrimer: designing primers for methylation PCRs. Bioinformatics. 2002;18(11):1427–31. 12424112 10.1093/bioinformatics/18.11.1427 28. Vivian J Rao AA Nothaft FA Ketchum C Armstrong J Novak A Pfeil J Narkizian J Deran AD Musselman-Brown A Toil enables reproducible, open source, big biomedical data analyses Nat Biotechnol 2017 35 4 314 6 10.1038/nbt.3772 28398314 PMC5546205 Vivian J, Rao AA, Nothaft FA, Ketchum C, Armstrong J, Novak A, Pfeil J, Narkizian J, Deran AD, Musselman-Brown A, et al. Toil enables reproducible, open source, big biomedical data analyses. Nat Biotechnol. 2017;35(4):314–6. 28398314 10.1038/nbt.3772 PMC5546205 29. Robin X Turck N Hainard A Tiberti N Lisacek F Sanchez JC Müller M P roc: an open-source package for R and S + to analyze and compare ROC curves BMC Bioinformatics 2011 12 77 10.1186/1471-2105-12-77 21414208 PMC3068975 Robin X, Turck N, Hainard A, Tiberti N, Lisacek F, Sanchez JC, et al. P roc: an open-source package for R and S + to analyze and compare ROC curves. BMC Bioinformatics. 2011;12:77. 21414208 10.1186/1471-2105-12-77 PMC3068975 30. Wang S Shi M Zhang Y Pan Z Xie X Zhang L The R2R3-MYB transcription factor FaMYB63 participates in regulation of eugenol production in strawberry Plant Physiol 2022 188 4 2146 65 10.1093/plphys/kiac014 35043961 PMC8968321 Wang S, Shi M, Zhang Y, Pan Z, Xie X, Zhang L, et al. The R2R3-MYB transcription factor FaMYB63 participates in regulation of eugenol production in strawberry. Plant Physiol. 2022;188(4):2146–65. 35043961 10.1093/plphys/kiac014 PMC8968321 31. Cui Z He J Zhu J Ni W Liu L Bian Z O-glcnacylated LARP1 positively regulated by circCLNS1A facilitates hepatoblastoma progression through DKK4/β-catenin signalling Clin Transl Med 2023 13 4 e1239 10.1002/ctm2.1239 37070251 PMC10111636 Cui Z, He J, Zhu J, Ni W, Liu L, Bian Z, et al. O-glcnacylated LARP1 positively regulated by circCLNS1A facilitates hepatoblastoma progression through DKK4/β-catenin signalling. Clin Transl Med. 2023;13(4):e1239. 37070251 10.1002/ctm2.1239 PMC10111636 32. Du WW Yang W Liu E Yang Z Dhaliwal P Yang BB Foxo3 circular RNA retards cell cycle progression via forming ternary complexes with p21 and CDK2 Nucleic Acids Res 2016 44 6 2846 58 10.1093/nar/gkw027 26861625 PMC4824104 Du WW, Yang W, Liu E, Yang Z, Dhaliwal P, Yang BB. Foxo3 circular RNA retards cell cycle progression via forming ternary complexes with p21 and CDK2. Nucleic Acids Res. 2016;44(6):2846–58. 26861625 10.1093/nar/gkw027 PMC4824104 33. Kim H Kim Y Chung Y Abdul R Sim J Ahn H Shin SJ Paik SS Kim HJ Jang K Single-stranded DNA binding protein 2 expression is associated with patient survival in hepatocellular carcinoma BMC Cancer 2018 18 1 1244 10.1186/s12885-018-5158-z 30541499 PMC6291933 Kim H, Kim Y, Chung Y, Abdul R, Sim J, Ahn H, Shin SJ, Paik SS, Kim HJ, Jang K, et al. Single-stranded DNA binding protein 2 expression is associated with patient survival in hepatocellular carcinoma. BMC Cancer. 2018;18(1):1244. 30541499 10.1186/s12885-018-5158-z PMC6291933 34. Huang Y Chang X Lee J Cho YG Zhong X Park IS Cigarette smoke induces promoter methylation of single-stranded DNA-binding protein 2 in human esophageal squamous cell carcinoma Int J Cancer 2011 128 10 2261 73 10.1002/ijc.25569 20658532 PMC3206631 Huang Y, Chang X, Lee J, Cho YG, Zhong X, Park IS, et al. Cigarette smoke induces promoter methylation of single-stranded DNA-binding protein 2 in human esophageal squamous cell carcinoma. Int J Cancer. 2011;128(10):2261–73. 20658532 10.1002/ijc.25569 PMC3206631 35. Kagohara LT Schussel JL Subbannayya T Sahasrabuddhe N Lebron C Brait M Maldonado L Valle BL Pirini F Jahuira M Global and gene-specific DNA methylation pattern discriminates cholecystitis from gallbladder cancer patients in Chile Future Oncol 2015 11 2 233 49 10.2217/fon.14.165 25066711 PMC4332836 Kagohara LT, Schussel JL, Subbannayya T, Sahasrabuddhe N, Lebron C, Brait M, et al. Global and gene-specific DNA methylation pattern discriminates cholecystitis from gallbladder cancer patients in Chile. Future Oncol. 2015;11(2):233–49. 25066711 10.2217/fon.14.165 PMC4332836 36. Bang S Kim H Jang K Paik SS Shin SJ The loss of nuclear expression of single-stranded DNA binding protein 2 of gastric adenocarcinoma and its prognostic role: analysis of molecular subtype PLoS ONE 2020 15 8 e0236896 10.1371/journal.pone.0236896 32745119 PMC7398516 Bang S, Kim H, Jang K, Paik SS, Shin SJ. The loss of nuclear expression of single-stranded DNA binding protein 2 of gastric adenocarcinoma and its prognostic role: analysis of molecular subtype. PLoS ONE. 2020;15(8):e0236896. 32745119 10.1371/journal.pone.0236896 PMC7398516 37. Yuan LW Yamashita H Seto Y Glucose metabolism in gastric cancer: the cutting-edge World J Gastroenterol 2016 22 6 2046 59 10.3748/wjg.v22.i6.2046 26877609 PMC4726677 Yuan LW, Yamashita H, Seto Y. Glucose metabolism in gastric cancer: the cutting-edge. World J Gastroenterol. 2016;22(6):2046–59. 26877609 10.3748/wjg.v22.i6.2046 PMC4726677 38. Vander Heiden MG DeBerardinis RJ Understanding the intersections between metabolism and cancer biology Cell 2017 168 4 657 69 10.1016/j.cell.2016.12.039 28187287 PMC5329766 Vander Heiden MG, DeBerardinis RJ. Understanding the intersections between metabolism and cancer biology. Cell. 2017;168(4):657–69. 28187287 10.1016/j.cell.2016.12.039 PMC5329766 39. Zhang H Shen X Xiong S Peng L Mai W Xin L HEIH promotes malignant progression of gastric cancer by regulating STAT3-Mediated autophagy and Glycolysis Dis Markers 2022 2022 2634526 36246567 10.1155/2022/2634526 PMC9568361 Zhang H, Shen X, Xiong S, Peng L, Mai W, Xin L. HEIH promotes malignant progression of gastric cancer by regulating STAT3-Mediated autophagy and Glycolysis. Dis Markers. 2022;2022:2634526. 36246567 10.1155/2022/2634526 PMC9568361 40. Zhao M Wei F Sun G Wen Y Xiang J Su F Zhan L Nian Q Chen Y Zeng J Natural compounds targeting glycolysis as promising therapeutics for gastric cancer: a review Front Pharmacol 2022 13 1004383 10.3389/fphar.2022.1004383 36438836 PMC9684197 Zhao M, Wei F, Sun G, Wen Y, Xiang J, Su F, et al. Natural compounds targeting glycolysis as promising therapeutics for gastric cancer: a review. Front Pharmacol. 2022;13:1004383. 36438836 10.3389/fphar.2022.1004383 PMC9684197 41. Wu T Jiang F Wu F Zheng G Li Y Wu L E2F1 and E2F7 regulate gastric cancer cell proliferation, respectively, through transcriptional activation and transcriptional repression of MYBL2 J Biol Chem 2025 301 1 108027 10.1016/j.jbc.2024.108027 39613162 PMC11731210 Wu T, Jiang F, Wu F, Zheng G, Li Y, Wu L. E2F1 and E2F7 regulate gastric cancer cell proliferation, respectively, through transcriptional activation and transcriptional repression of MYBL2. J Biol Chem. 2025;301(1):108027. 39613162 10.1016/j.jbc.2024.108027 PMC11731210 42. Zhou X Shen K Cao S Li P Xiao J Dong J Cheng Q Hu L Xu Z Yang L Polymorphism rs2327430 in TCF21 predicts the risk and prognosis of gastric cancer by affecting the binding between TFAP2A and TCF21 Cancer Cell Int 2024 24 1 159 10.1186/s12935-024-03343-z 38714991 PMC11075239 Zhou X, Shen K, Cao S, Li P, Xiao J, Dong J, Cheng Q, Hu L, Xu Z, Yang L. Polymorphism rs2327430 in TCF21 predicts the risk and prognosis of gastric cancer by affecting the binding between TFAP2A and TCF21. Cancer Cell Int. 2024;24(1):159. 38714991 10.1186/s12935-024-03343-z PMC11075239 43. Mitra P Transcription regulation of MYB: a potential and novel therapeutic target in cancer Ann Transl Med 2018 6 22 443 10.21037/atm.2018.09.62 30596073 PMC6281535 Mitra P. Transcription regulation of MYB: a potential and novel therapeutic target in cancer. Ann Transl Med. 2018;6(22):443. 30596073 10.21037/atm.2018.09.62 PMC6281535 44. Cheasley D Pereira L Sampurno S Sieber O Jorissen R Xu H Defective Myb function ablates cyclin E1 expression and perturbs intestinal carcinogenesis Mol Cancer Res 2015 13 8 1185 96 10.1158/1541-7786.MCR-15-0014 25934694 Cheasley D, Pereira L, Sampurno S, Sieber O, Jorissen R, Xu H, et al. Defective Myb function ablates cyclin E1 expression and perturbs intestinal carcinogenesis. Mol Cancer Res. 2015;13(8):1185–96. 25934694 10.1158/1541-7786.MCR-15-0014 45. Tichý M Knopfová L Jarkovský J Vlček P Katolická J Čapov I Hermanová M Šmarda J Beneš P High c-Myb expression associates with good prognosis in colorectal carcinoma J Cancer 2019 10 6 1393 7 10.7150/jca.29530 31031849 PMC6485226 Tichý M, Knopfová L, Jarkovský J, Vlček P, Katolická J, Čapov I, Hermanová M, Šmarda J, Beneš P. High c-Myb expression associates with good prognosis in colorectal carcinoma. J Cancer. 2019;10(6):1393–7. 31031849 10.7150/jca.29530 PMC6485226 46. Miao RY Drabsch Y Cross RS Cheasley D Carpinteri S Pereira L MYB is essential for mammary tumorigenesis Cancer Res 2011 71 22 7029 37 10.1158/0008-5472.CAN-11-1015 21948968 Miao RY, Drabsch Y, Cross RS, Cheasley D, Carpinteri S, Pereira L, et al. MYB is essential for mammary tumorigenesis. Cancer Res. 2011;71(22):7029–37. 21948968 10.1158/0008-5472.CAN-11-1015 47. Liang J Liu X Xue H Qiu B Wei B Sun K Microrna-103a inhibits gastric cancer cell proliferation, migration and invasion by targeting c-Myb Cell Prolif 2015 48 1 78 85 10.1111/cpr.12159 25530421 PMC6496034 Liang J, Liu X, Xue H, Qiu B, Wei B, Sun K. Microrna-103a inhibits gastric cancer cell proliferation, migration and invasion by targeting c-Myb. Cell Prolif. 2015;48(1):78–85. 25530421 10.1111/cpr.12159 PMC6496034 48. Ramsay RG Gonda TJ MYB function in normal and cancer cells Nat Rev Cancer 2008 8 7 523 34 10.1038/nrc2439 18574464 Ramsay RG, Gonda TJ. MYB function in normal and cancer cells. Nat Rev Cancer. 2008;8(7):523–34. 18574464 10.1038/nrc2439 49. Liu JW Nagpal JK Sun W Lee J Kim MS Ostrow KL Ssdna-binding protein 2 is frequently hypermethylated and suppresses cell growth in human prostate cancer Clin Cancer Res 2008 14 12 3754 60 10.1158/1078-0432.CCR-07-4763 18559593 PMC3082869 Liu JW, Nagpal JK, Sun W, Lee J, Kim MS, Ostrow KL, et al. Ssdna-binding protein 2 is frequently hypermethylated and suppresses cell growth in human prostate cancer. Clin Cancer Res. 2008;14(12):3754–60. 18559593 10.1158/1078-0432.CCR-07-4763 PMC3082869 50. Guo T Wen XZ Li ZY Han HB Zhang CG Bai YH Xing XF Cheng XJ Du H Hu Y ISL1 predicts poor outcomes for patients with gastric cancer and drives tumor progression through binding to the ZEB1 promoter together with SETD7 Cell Death Dis 2019 10 2 33 10.1038/s41419-018-1278-2 30674889 PMC6393520 Guo T, Wen XZ, Li ZY, Han HB, Zhang CG, Bai YH, Xing XF, Cheng XJ, Du H, Hu Y, et al. ISL1 predicts poor outcomes for patients with gastric cancer and drives tumor progression through binding to the ZEB1 promoter together with SETD7. Cell Death Dis. 2019;10(2):33. 30674889 10.1038/s41419-018-1278-2 PMC6393520 51. Hay N Reprogramming glucose metabolism in cancer: can it be exploited for cancer therapy? Nat Rev Cancer 2016 16 10 635 49 10.1038/nrc.2016.77 27634447 PMC5516800 Hay N. Reprogramming glucose metabolism in cancer: can it be exploited for cancer therapy? Nat Rev Cancer. 2016;16(10):635–49. 27634447 10.1038/nrc.2016.77 PMC5516800 52. Guo T Bai YH Cheng XJ Han HB Du H Hu Y Insulin gene enhancer protein 1 mediates glycolysis and tumorigenesis of gastric cancer through regulating glucose transporter 4 Cancer Commun 2021 41 3 258 72 10.1002/cac2.12141 PMC7968886 33570246 Guo T, Bai YH, Cheng XJ, Han HB, Du H, Hu Y, et al. Insulin gene enhancer protein 1 mediates glycolysis and tumorigenesis of gastric cancer through regulating glucose transporter 4. Cancer Commun. 2021;41(3):258–72. 10.1002/cac2.12141 PMC7968886 33570246 53. Shi Q Wang W Jia Z Chen P Ma K Zhou C ISL1, a novel regulator of CCNB1, CCNB2 and c-MYC genes, promotes gastric cancer cell proliferation and tumor growth Oncotarget 2016 7 24 36489 500 10.18632/oncotarget.9269 27183908 PMC5095015 Shi Q, Wang W, Jia Z, Chen P, Ma K, Zhou C. ISL1, a novel regulator of CCNB1, CCNB2 and c-MYC genes, promotes gastric cancer cell proliferation and tumor growth. Oncotarget. 2016;7(24):36489–500. 27183908 10.18632/oncotarget.9269 PMC5095015 ",
  "metadata": {
    "Title of this paper": "ISL1, a novel regulator of CCNB1, CCNB2 and c-MYC genes, promotes gastric cancer cell proliferation and tumor growth",
    "Journal it was published in:": "Cancer Cell International",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482532/"
  }
}