{
  "title": "Paper_878",
  "abstract": "pmc Surg Neurol Int Surg Neurol Int 1278 sni Surgical Neurology International 2229-5097 2152-7806 Scientific Scholar PMC12477953 PMC12477953.1 12477953 12477953 41030411 10.25259/SNI_280_2025 10.25259/SNI_280_2025 1 Original Article Epidemiological profile of adult primary brain tumors Assaad Fawaz 1 fawaz.assaad99@gmail.com Salma Asem 2 asem.salma@gmail.com Mrad Manar 3 manar_hanna@yahoo.com 1 2 3 * Corresponding author: fawaz.assaad99@gmail.com 2025 01 8 2025 16 481491 310 19 3 2025 01 6 2025 01 08 2025 30 09 2025 01 10 2025 Copyright: © 2025 Surgical Neurology International 2025 https://creativecommons.org/licenses/by-nc-sa/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution-Non Commercial-Share Alike 4.0 License, which allows others to remix, transform, and build upon the work non-commercially, as long as the author is credited and the new creations are licensed under the identical terms. Background: The study was carried out to explore the epidemiologic profile of the incidence of primary brain tumors (PBTs) in Syria. Methods: A prospective and observational study was conducted in all neurosurgical departments of primary referral hospitals across Syria’s 14 districts during 2009 th Results: A total of 2,994 cases (1,532 males and 1,462 females) were identified. The average annual incidence rate of PBTs was 7.48/100,000 person-years, with gliomas (3.36), meningiomas (1.43), and sellar region tumors (1.25) being the most common. Meningiomas showed a female predominance (female: male = 1.6:1), while gliomas were more common in males (male: female = 1.3:1). The median age at the diagnosis was 52 years overall, 56 years for neuroepithelial tumors, and 48 years for meningiomas. Conclusion: The epidemiology of brain tumors in Syria shows a relatively low incidence, with differences in age and tumor distribution by sex. These findings establish a critical pre-conflict baseline for Syria and highlight potential under the diagnosis despite a functioning health infrastructure. Central nervous system Descriptive epidemiology Glioma Meningioma Primary brain tumor pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  INTRODUCTION Primary brain tumors (PBTs) are a heterogeneous group of neoplasms classified by their histological and molecular characteristics, as outlined in the 2021 World Health Organization (WHO) classification of tumors of the central nervous system (CNS).[ 22 In this article, we prospectively review the incidence and its characteristics of brain tumors in Syria in terms of demographic and geographic variations. The main object is an epidemiological goal. This represents the first attempt of estimating incidence rates of PBTs in Syria, as well as documenting PBT distribution according to age, sex, histological types, and geographical location. This study was completed based on the data of national wide registry represented all central hospitals with neurosurgical departments in 14 districts in Syria and thus we believe that we have covered almost all newly diagnosed brain tumors during the years (2009–2010). MATERIALS AND METHODS In this prospective, medical record-based, and observational study collected data between January 2009 and December 2010 from all 14 Syrian governorates. Patients aged 18 years and older diagnosed with a PBT were included. Diagnoses were made by either histopathological confirmation (in 90.45% of cases) or characteristic imaging features (9.55%). A centralized tumor registry in Damascus coordinated data collection and quality control. Age-adjusted incidence rates were calculated using direct standardization to the 2004 Syrian national census. The WHO 2021 CNS tumor classification system was used to categorize the tumors. A flowchart [ Figure 1 Figure 1: Patient selection flowchart. In collaboration with ministry of high education, ministry of health, and WHO-regional office for the Eastern Mediterranean, we have established a Brain Tumor-Registration-Center in the university hospitals in Damascus, which collect monthly information from all neurosurgical departments, in which brain tumors were diagnosed and operated in14 districts in Syria. Briefly, cases were collected according to a standardized protocol, quality control, and statistical analysis was carried out centrally using a uniform methodology, we used the direct method to estimate incidence per 100,000 person/years. The population statistics regarding number of populations, age and sex in each district were taken from the population statistics in Syria 2004 and the following updating. We are confident that we have covered almost all newly diagnosed cases of brain tumors in the country and thus we were able to calculate the incidence per 2004 population and the following updating. Patient data were analyzed, and descriptive epidemiological records were created for the patients by age, incidence rate, sex, anatomical location, geographic distribution, and histological variables (when available). The histopathological variables tabulated were type and grade of tumor which were done initially according to the WHO grading of tumors (2007), but it was updated later to the WHO 2021 CNS tumor classification system. RESULTS Out of an initial 3,108 cases identified, 114 were excluded (duplicate records, metastatic lesions, or patients under 18), resulting in a final sample of 2,994 adult PBT cases. Among these: 51.2% were male and 48.8% were female Gliomas were the most frequent group (44.9%), followed by meningiomas (19.2%) and sellar region tumors (16.7%) The most common histologic subtype was glioblastoma, isocitrate dehydrogenase (IDH)-wildtype (WHO Grade 4), with an incidence of 1.39/100,000 person-years. A color-coded regional map [ Figure 2 Figure 3 Figure 2: Incidence of primary brain tumor by region (bar chart). Figure 3: Tumor type distribution. Table 1 Table 1: The annual average, median age at diagnosis, age adjusted incidence rates per 100.000 population for the major histologic groupings, and selected common histologic subtypes of primary brain tumors. The age-adjusted average annual incidence rate (2009– 2010) of newly diagnosed PBTs in Syria was 7.48/100,000 person-years. The incidence was slightly higher in males (3.83/100,000) compared to females (3.65/100,000), with a male-to-female ratio of 1.04:1 (51.16% males vs. 48.83% females). In our cohort, the most common tumor groups were adult-type diffuse gliomas, meningiomas, and sellar region tumors. The median age at diagnosis across all PBTs was 52 years, with a median age of 56 years for neuroepithelial tumors and 48 years for meningiomas. Gliomas and other neuroepithelial tumors were approximately 1.3 times more common in males, whereas meningiomas were approximately 1.6 times more frequent in females. Cranial nerve tumors and sellar region tumors showed near-equal distribution between genders. The annual incidence rates for the major histologic groupings were 3.36/100,000 for gliomas and other neuroepithelial tumors, 1.43 for meningiomas, and 1.25 for sellar region tumors [ Figure 3 Figure 4 Figure 4: Average annual incidence rate per 100.000 person/year in glioma and other neuroepithelial tumors. IDH: Isocitrate dehydrogenase, NOS: Not otherwise specified. Meningiomas represented the second most common group, with an incidence of 1.43/100,000, including grade 1 meningiomas (1.01/100,000) and higher-grade atypical/anaplastic meningiomas (0.42/100,000). Sellar region tumors were the third most common group, with an annual incidence of 1.25/100,000, including pituitary neuroendocrine tumors at 0.89 and craniopharyngiomas at 0.36/100,000. Overall [ Figure 5 Figure 5: Percentage distribution of primary brain tumors. In terms of tumor behavior, non-malignant tumors constituted 57.7% of cases, whereas malignant tumors represented 42.3% [ Figure 6 Figure 6: Distribution of primary brain tumors by behavior. Age group analysis revealed that the highest incidence rates occurred in the 40–50 years’ age group, followed by the 30– 40 and 50–60 years’ groups [ Figure 7 Figure 7: Age and Sex distribution of primary brain tumors according to age-groups. Geographic variation in the incidence was moderate, with average annual rates ranging from 5.59 to 8.45/100,000 person-years across different Syrian districts [ Figure 2 Finally, the study found that 67% of all brain tumor diagnoses were made in central hospitals located in Damascus (AlAssad University Hospital, Al-Mouwasat University Hospital, Al-Mujtahid Hospital, and Tishreen Hospital), with the remaining 33% diagnosed across governmental hospitals and private centers in Aleppo, Homs, Lattakia, Hama, Deir ezZor, Daraa, Sweida, and other regions. DISCUSSION This study represents, to the best of our knowledge, the first national-level epidemiological survey of adult PBTs conducted in Syria and one of the few similar investigations in the region. It establishes a vital pre-conflict baseline for future comparison and provides a reference point for epidemiologic trends across neighboring Middle Eastern countries. Publishing brain tumor epidemiologic studies from developing regions may enhance our understanding of this heterogeneous group of diseases and shed light on risk factors influenced by lifestyle, environmental exposures, infections, occupational hazards, and genetic predispositions. Nevertheless, it is important to recognize that, for the majority of brain tumors, the underlying etiology remains unknown and likely multifactorial.[ 2 3 9 24 29 34 40 When comparing our results with major studies conducted in developed countries, notable differences emerge. According to Bondy et al et al et al et al 4 6 11 16 18 26 28 31 32 33 34 Two important articles about brain tumors epidemiology in the United States, the first one from Fisher et al 14 et al 26 Fisher et al 14 5 10 14 17 20 36 37 40 Ostrom et al 26 27 et al 1 12 23 26 27 38 39 7 8 13 15 19 21 25 29 30 33 35 Comparative analysis with the recently published National Brain Tumor Registry of China (2023) reveals similarities and differences. In both Syria and China, meningiomas and gliomas are the leading histologic types. However, the overall incidence reported in China remains higher, likely reflecting differences in healthcare infrastructure and reporting practices.[ 41 The median age at diagnosis in our study (52 years) was notably younger than that reported in Western series (e.g., 59 years in Ostrom QT et al 26 27 Finally, the main limitation of this study is the lack of previous national epidemiological data for Syria, preventing temporal or regional trend analysis. Nonetheless, the strength of this research lies in its comprehensive, prospective design, and its provision of crucial baseline data for future comparisons within Syria and internationally. CONCLUSION Our study suggests that the epidemiology of adult PBTs in Syria is characterized by a relatively low incidence rate, younger median age at diagnosis, and a tumor distribution pattern like that seen internationally, dominated by gliomas, meningiomas, and tumors of the sellar region. Differences observed compared to Western populations – such as lower glioblastoma rates and earlier median age at diagnosis – highlight the need for ongoing surveillance and improved diagnostic reporting. This study provides a valuable foundation for future research and healthcare planning in Syria and similar regions. Acknowledgment: We wish to acknowledge the membership of neurosurgical departments in the 14 districts (Alhakam Abmaulla, M. Khaddam El Jammeh, Sultan Issam, Wardan Alamir-Tamer, AGafour Kiwan, M. Barazi) for their contribution to the success of this initiative. The authors would like to thank Mrs. Sawsan Farah for her invaluable assistance. How to cite this article: Ethical approval: The Institutional Review Board has approved this study at Damascus University-School of Medicine. The register and approval number are MD/08SAD. The date of approval is June, 24,2008. Declaration of patient consent: Patient’s consent not required as there are no patients in this study. Financial support and sponsorship: Nil. Conflicts of interest: There are no conflicts of interest. Use of artificial intelligence (AI)-assisted technology for manuscript preparation: The authors confirms that there was no use of artificial intelligence (AI)-assisted technology for assisting in the writing or editing of the manuscript and no images were manipulated using AI. REFERENCES 1 Aldape K Simmons ML Davis RL Miike R Wiencke J Barger G Discrepancies in diagnoses of neuroepithelial neoplasms: The San Francisco bay area adult glioma study Cancer 2000 88 2342 9 10820357 2 Berleur MP Cordier S The role of chemical, physical, or viral exposures and health factors in neurocarcinogenesis: Implications for epidemiologic studies of brain tumors Cancer Causes Control 1995 6 240 56 7612804 10.1007/BF00051796 3 Bondy M Wiencke J Wrensch M Kyritsis AP Genetics of primary brain tumors: A review J Neurooncol 1994 18 69 81 8057137 10.1007/BF01324606 4 Bondy ML Scheurer ME Malmer B Barnholtz-Salon JS Davis FG IL’Yasova D Brain tumor epidemiology: Consensus from the brain tumor epidemiology consortium (BTEC) Cancer 2008 113 1953 68 18798534 10.1002/cncr.23741 PMC2861559 5 CBTRUS Central brain tumor registery of the United States, statistical report: Primary brain tumors in the United States 1998-2002 2005 Hinsdale CBTRUS 6 CBTRUS Statistical report: Primary brain tumors in the United States 1998-2002 2005 Hinsdale, IL Central Brain Tumor Registry of the United States 7 Christensen HC Kosteljanetz M Johansen C Incidences of gliomas and meningiomas in Denmark, 1943 to 1997 Neurosurgery 2003 52 1327 33 discussion 1333-4 12762878 10.1227/01.neu.0000064802.46759.53 8 Cordera S Bottacchi E D’Alessandro G Machado D De Gonda F Corso G Epidemiology of primary intracranial tumors in NW Italy, a population based study: Stable incidence in the last two decades J Neurol 2002 249 281 4 11993526 10.1007/s004150200005 9 Counsell CE Grant R Incidence studies of primary and secondary intracranial tumors: A systematic review of their methodology and results J Neurooncol 1998 37 241 50 9524082 10.1023/a:1005861024679 10 Davis FG Bruner JM Surawicz TS The rationale for standardized registration and reporting of brain and central nervous system tumors in population-based cancer registries Neuroepidemiology 1977 16 308 16 10.1159/000109703 9430131 11 De Angelis R Francisci S Baili P Marchesi F Roazzi P Belot A The EUROCARE-4 database on cancer survival in Europe: Data standardisation, quality control and methods of statistical analysis Eur J Cancer 2009 45 909 30 19128955 10.1016/j.ejca.2008.11.003 12 Edwards BK Noone AM Mariotto AB Simard EP Boscoe FP Henley SJ Annual report to the nation on the status of cancer, 1975-2010, featuring prevalence of comorbidity and impact on survival among persons with lung, colorectal, breast, or prostate cancer Cancer 2014 120 1290 314 24343171 10.1002/cncr.28509 PMC3999205 13 Elia-Pasquet S Provost D Jaffre A Loiseau H Vital A Kantor G Incidence of central nervous system tumors in Gironde, France Neuroepidemiology 2004 23 110 7 15084779 10.1159/000075953 14 Fisher JL Scwarzbaum JA Wrensch M Wiemels JL Epidemiology of brain tumors Neurol Clin 2007 25 867 90 17964019 10.1016/j.ncl.2007.07.002 15 Fritz A Jack A Parkin DM Percy C Shanmugarathan S Sobin L International classification of diseases for oncology (ICD-O) 2000 3th ed Geneva WHO 218 16 GLOBOCAN Worldwide incidence and mortality of cancer, 2002 (computer program) 2002 Lyon, France IARC 17 Helseth A The incidence of primary central nervous system neoplasms before and after computerized tomography availability J Neurosurgery 1995 83 999 1003 10.3171/jns.1995.83.6.0999 7490645 18 Inskip PD Linet MS Heineman EF Etiology of brain tumors in adults Epidemiol Rev 1995 17 382 414 8654518 10.1093/oxfordjournals.epirev.a036200 19 Klaeboe L Lonn S Scheie D Auvinen A Christensen HC Feychting M Incidence of intracranial meningiomas in Denmark, Finland, Norway and Sweden, 1968-1997 Int J Cancer 2005 117 996 1001 15986431 10.1002/ijc.21255 20 Lacroix M Abi-said D Fourney DR Gokaslan ZL Shi W DeMonte F A multivariate analysis of 416 patients with glioblastoma multiforme: Prognosis, extent of resection, and survival J Neurosurg 2001 95 190 8 10.3171/jns.2001.95.2.0190 11780887 21 Lee CH Jung KW Yoo H Park S Lee SH Epidemiology of primary brain and central nervous system tumors in Korea J Korean Neurosurg Soc 2010 48 145 52 20856664 10.3340/jkns.2010.48.2.145 PMC2941858 22 Louis DN Perry A Wesseling P Brat DJ Cree IA FigarellaBranger D DNA methylation-based classification of central nervous system tumours Nature 2018 555 469 74 29539639 10.1038/nature26000 PMC6093218 23 McCarthy BJ Kruchko C Dolecek TA The impact of the benign brain tumor cancer registries amendment act (Public Law 107-260) on non-malignant brain and central nervous system tumor incidence trends J Registry Manage 2013 40 32 5 23778695 24 Ohgaki H Kleihues P Population-based studies on incidence, survival rates, and genetic alterations in astrocytic and oligodendroglial gliomas J Neuropathol Exp Neurol 2005 64 479 89 15977639 10.1093/jnen/64.6.479 25 Olson JD Riedel E De Angelis LM Long-term outcome of low-grade oligodendroglioma and mixed glioma Neurology 2000 54 1442 48 10751254 10.1212/wnl.54.7.1442 26 Ostrom QT Gittleman H Jordan Xu Kromer C Wolinsky Y Kruchko C CBTRUS statistical report: Primary brain and other central nervous system tumors diagnosed in the United States in 2009-2013 Neuro-Oncol 2016 18 v1 75 28475809 10.1093/neuonc/now207 PMC8483569 27 Ostrom QT Gittleman H Kruchko C Louis DN Brat DJ Gilbert MR Completeness of required site-specific factors for brain and CNS tumors in the surveillance, epidemiology and end results (SEER) 18 database (2004-2012, varying) J Neurooncol 2016 130 31 42 27418206 10.1007/s11060-016-2217-7 PMC5071143 28 Parkin MD Whelan SL Felay J Teppo L Thomas DB Cancer in five continents 2002 8 Lyon, France IARC 29 Perston-Martin S Mack W Schottenfeld D Fraument JF Jr Neoplasm of the nervous system Cancer epidemiology and preventing 1996 2nd ed New York Oxford University Press 1231 81 30 Porter KR McCarthy BJ Freels S Kim Y Davis FG Prevalence estimates for primary brain tumors in the United States by age, gender, behavior, and histology Neuro Oncol 2010 12 520 7 20511189 10.1093/neuonc/nop066 PMC2940648 31 Ries LA Eisner MP Kosary CL Hankey BF Miller BA Clegg L SEER cancer statistics review, 1975-2002 2005 Bethesda, MD National Cancer Institute 32 Robles P Fiest KM Frolkis AD Pringsheim T Atta C Germaine-Smith CS The worldwide incidence and prevalence of primary brain tumors: A systematic review and meta-analysis Neuro-Oncol 2014 17 776 83 25313193 10.1093/neuonc/nou283 PMC4483114 33 Sant M Minicozzi P Lagorio S Johannesen TB MarcosGragera R Francisci S Survival of European patients with central nervous system tumors Int J Cancer 2011 131 173 85 21805473 10.1002/ijc.26335 34 Sant M Van Der Sanden G Capocaccia R Survival rates for primary malignant brain tumours in Europe. EUROCARE working group Eur J Cancer 1998 34 2241 7 10070294 10.1016/s0959-8049(98)00336-0 35 Schomas DA Laack NN Brown PD Low-grade gliomas in older patients: Long-term follow-up from mayo clinic Cancer 2009 115 3969 78 19536875 10.1002/cncr.24444 PMC2789453 36 SEER Surveillance, epidemiology and end results (SEER) program SEER* stat data-base: Incidence SEER 13 regs public use Nov. 2005 sub (1992-2003), national cancer institute, DCCPS, surveillance research program, cancer statistic branch, released April 2006, based on the November 2005 submission Available from: www.seer.cancer.gov 37 Singh GK Siahpush M All-cause and cause-specific mortality of immigrants and native born in the United States Am J Public Health 2001 91 392 9 11236403 10.2105/ajph.91.3.392 PMC1446566 38 Stroup DF Berlin JA Morton SC Olkin I Williamson GD Rennie D Meta-analysis of observational studies in epidemiology: A proposal for reporting. Meta-analysis of observational studies in epidemiology (MOOSE) group JAMA 2000 283 2008 12 10789670 10.1001/jama.283.15.2008 39 Woehrer A Waldhoer T Heinzl H Hackl M Feichtinger J Gruber-Mosenbacher U The Austrian brain tumour registry: A cooperative way to establish a population-based brain tumour registry J Neurooncol 2009 95 401 11 19562257 10.1007/s11060-009-9938-9 40 Wrensch M Minn Y Chew T Bondy M Berger MS Epidemiology of primary brain tumors: Current concepts and review of the literature Neuro Oncol 2002 4 278 99 12356358 10.1093/neuonc/4.4.278 PMC1920665 41 Xiao D Yan C Li D Xi T Liu X Zhu D National Brain Tumor Registry of China (NBTRC) statistical report of primary brain tumours diagnosed in China in years 2019-2020 Lancet Reg Health West Pac 2023 34 100715 37283963 10.1016/j.lanwpc.2023.100715 PMC10240383 Disclaimer The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of the Journal or its management. The information contained in this article should not be considered to be medical advice; patients should consult their own physicians for advice as to their specific medical needs. ",
  "metadata": {
    "Title of this paper": "National Brain Tumor Registry of China (NBTRC) statistical report of primary brain tumours diagnosed in China in years 2019-2020",
    "Journal it was published in:": "Surgical Neurology International",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477953/"
  }
}