{
  "title": "Paper_731",
  "abstract": "J Diabetes Sci Technol J Diabetes Sci Technol 967 jdst DST Journal of Diabetes Science and Technology 1932-2968 Diabetes Technology Society PMC12479449 PMC12479449.1 12479449 12479449 40899799 10.1177/19322968251364276 10.1177_19322968251364276 1 Symposium/Special Issue Wearable Diabetes Technology for Hospitalized People With Diabetes and End-Stage Kidney Disease, Peripartum State, and Steroid Use https://orcid.org/0000-0002-7981-9603 Agarwal Shubham MD 1 https://orcid.org/0000-0002-5925-1117 Demidowich Andrew P. MD 2 Soliman Diana MD 3 https://orcid.org/0000-0002-3252-5026 Umpierrez Guillermo E. MD, CDCES, MACE, MACP 4 https://orcid.org/0000-0002-9295-3225 Galindo Rodolfo J. MD, FACE 3 1 2 3 4 Shubham Agarwal, MD, Division of Diabetes, Endocrinology and Metabolism, Department of Internal Medicine, University of Nebraska Medical Center, 984130 Nebraska Medical Center, Omaha, NE 68198, USA. Email: shubhamagarwaldr@gmail.com Current affiliation: Shubham Agarwal, MD, is now affiliated with Department of Medicine, Omaha Veterans Affairs Medical Center, Omaha, NE, USA. The author(s) declared the following potential conflicts of interest with respect to the research, authorship, and/or publication of this article: SA, DS None. APD reports research grant support from Dexcom, Inc. RJG is supported by the National Institute of Diabetes and Digestive and Kidney Diseases (NIDDK) of the National Institutes of Health (NIH) under Award Numbers 2P30DK1110246 and K23DK123384-3. RJG received research support from Novo Nordisk, Dexcom, and Eli Lilly and consulting fees from Abbott Diabetes, Bayer, Eli Lilly, Boehringer, Dexcom, Novo Nordisk, and Medtronic, outside of this work. GEU is partly supported by research grants from the National Institutes of Health (NIH/NATS UL 3UL1TR002378-05S2), has received research support (to Emory University) from Dexcom, Abbott, Corcept, and Bayer, and consulting fees for participation in advisory boards from Dexcom, Corcept, Glycare, and Glucotrack. 3 9 2025 475270 19322968251364276 03 09 2025 01 10 2025 01 10 2025 © 2025 Diabetes Technology Society 2025 Diabetes Technology Society Inpatient hyperglycemia remains a challenge, as conventional insulin regimens often lead to both hyperglycemia and hypoglycemia. Traditional glucose monitoring methods, such as point-of-care testing, fail to detect diurnal and nocturnal glycemic fluctuations, contributing to suboptimal control. This review examines the effectiveness of continuous glucose monitoring (CGM) and automated insulin delivery (AID) systems in managing diabetes in hospitalized patients, including those with additional challenges such as end-stage kidney disease (ESKD), pregnancy, and steroid use. In patients with ESKD, CGM has demonstrated reliable glucose measurements and improved glycemic control, particularly in those undergoing hemodialysis. It has been shown to increase time in range (TIR) and reduce hypoglycemia, with clinical accuracy verified in multiple studies. Existing evidence shows that AID systems may offer improved outcomes in this population, with increased TIR and reduced glycemic variability compared with conventional insulin therapy. Continuous glucose monitor use has been beneficial for maternal glycemic control in pregnancy, leading to lower HbA1c levels, increased TIR, reduced maternal hypoglycemia, reduced neonatal hypoglycemia, and admissions to intensive care. Limited studies have evaluated AID system use during labor. In addition, CGM helps identify postprandial hyperglycemia in patients with glucocorticoid-induced hyperglycemia, which is crucial for managing glucose fluctuations. Studies in patients receiving glucocorticoids have shown that continuous glucose monitoring improves glycemic control without significantly increasing hypoglycemic events. In conclusion, limited studies have shown the role of CGM and AID systems and their effects on glycemic outcomes in hospitalized patients with diabetes, particularly those with ESKD, in pregnancy, and those receiving glucocorticoids. These technologies used for glucose monitoring and insulin delivery could offer an alternative method of diabetes management in certain inpatient populations. continuous glucose monitor automated insulin delivery end-stage kidney disease corticosteroid peripartum pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf yes pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes edited-state corrected-proof typesetter ts1 ",
  "metadata": {
    "Title of this paper": "Wearable Diabetes Technology for Hospitalized People With Diabetes and End-Stage Kidney Disease, Peripartum State, and Steroid Use",
    "Journal it was published in:": "Journal of Diabetes Science and Technology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479449/"
  }
}