{
  "title": "Paper_22",
  "abstract": "pmc Acta Clin Croat Acta Clin Croat 3604 actaclincroat ACC Acta Clinica Croatica 0353-9466 1333-9451 Sestre Milosrdnice University Hospital Center PMC12490455 PMC12490455.1 12490455 12490455 10.20471/acc.2024.63.03-04.19 acc-63-604 1 Original Scientific Papers EFFECTS OF TREATMENT WITH TEMSIROLIMUS VERSUS INTERFERON ALPHA ON SURVIVAL OF PATIENTS WITH METASTATIC RENAL CELL CARCINOMA – SINGLE-CENTER REAL-WORLD EXPERIENCE Levakov Ivan  1  2 Vojinov Saša  1  2 Maletin Miloš  1  2 Jeremić Dimitrije  1  2 Popov Mladen  1  2 Levakov Olivera  2  3 Grbić Dragan  1 1 2 3 Correspondence to: Prof. Ivan Levakov, MD, PhD ivan.levakov@mf.uns.ac.rs 12 2024 12 2024 63 3-4 498197 604 610 01 8 2022 02 12 2022 01 12 2024 03 10 2025 03 10 2025 Sestre Milosrdnice University Hospital 2024 Sestre Milosrdnice University Hospital https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution Non-Commercial No Derivatives (CC BY-NC-ND) 4.0 License. SUMMARY Vascular endothelial growth factor (VEGF) and mammalian target of rapamycin (mTOR) inhibitors are two main groups of drugs for targeted treatment of metastatic renal cell carcinoma (mRCC). Inhibition of angiogenesis and other growth pathways that are pivotal for tumor progression lead to significant improvement of survival in patients with mRCC. The main aim of this study was to compare the effects of temsirolimus (mTOR inhibitor) and interferon alpha-2a (IFN-alpha-2a) on overall survival (OS) and progression-free survival (PFS) in patients with T3 stage mRCC who developed lung metastasis in the first two years after radical nephrectomy. A total of 60 patients diagnosed with T3 stage renal cancer who developed metastases in the lungs within two years after radical nephrectomy were included in a prospective study conducted at the Department for Urology, Clinical Center of Vojvodina and partially retrospective study at the Oncology Institute in Sremska Kamenica. Patients were divided into two groups consisting of 30 patients according to treatment with temsirolimus or IFN-alpha. During the first year of treatment, OS of patients treated with temsirolimus was 23.33%, whereas in patients treated with IFN-alpha it was 16.67%. Median survival in patients treated with temsirolimus was 9.3 months, whereas in patients treated with IFN-alpha it was 6.9 months, yielding a statistically significant difference (p=0.028). Patients treated with temsirolimus showed a statistically significantly longer median PFS compared to patients treated with IFN-alpha (p<0.0085). In conclusion, temsirolimus therapy had a significantly positive effect on survival in patients with mRCC. Patients treated with temsirolimus showed significantly longer median survival and median PFS compared to patients treated with IFN-alpha. Keywords: Renal cell carcinoma Temsirolimus Interferon alpha Survival pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Renal cell carcinoma (RCC) is a heterogeneous malignant disease characterized by different histologic subtypes, genetic-molecular changes, disease course, and response to systemic therapy ( 1 3 4 5 6 7 8 The introduction of a new generation of drugs that target intracellular molecular pathways included in the development, progression and metastasis of the malignant disease was revolutionary ( 9 10 11 12 14 The main aim of this study was to compare the effects of IFN-alpha and temsirolimus on OS and progression-free survival (PFS) in patients with T3 stage RCC who developed lung metastasis in the first two years of radical nephrectomy. Patients and Methods The research was conducted as a controlled, open, prospective and randomized study at the Department of Urology, Clinical Center of Vojvodina in Novi Sad and as partly retrospective study at the Oncology Institute of Vojvodina in Sremska Kamenica. A total of 60 patients diagnosed with T3 stage RCC who developed lung metastasis within two years of radical nephrectomy at the Department of Urology, Clinical Center of Vojvodina were included in the study. Patients were treated and monitored at the Oncology Institute in Sremska Kamenica and divided into two groups, i.e., test group and control group. The test group included 30 patients who were treated with temsirolimus, an mTOR inhibitor, whereas control group consisted of 30 patients in the same stage of the disease treated with immunotherapy (IFN-alpha-2a). The criteria for including patients in the study were as follows: age 18 to 65, T3 stage RCC, prior radical nephrectomy, verified metastasis in the lungs, and signed consent of patients to be included in the study. Excluding criteria were age over 65, metastasis in other organs, and inoperable RCC. All procedures conducted as part of this study were compliant with ethical standards set by the Ethics Committee of the responsible institution (no. 0008/103). Informed consent was obtained from each individual patient included in the study. Therapeutic protocol of treatment with mTOR inhibitors involved administering 25 mg of temsirolimus intravenously over 30 minutes once a week. To prevent allergic reaction, patients were administered chloropyramine hydrochloride (20 mg/2 mL intravenously) half an hour after starting the treatment. The immunotherapy protocol consisted of administering IFN-alpha-2a three times a week, single dose of 6 million IU subcutaneously until reaching the total dose of 180 million IU. After a 4-to 6-week break, the therapeutic protocol was repeated until progression or unacceptable toxicity. Medical history of each patient included in the study was taken and clinical examination was performed. Prior to starting treatment, patients underwent chest x-ray, ultrasound of upper abdomen and kidneys, as well as blood tests including erythrocyte sedimentation rate, whole blood count, glycemia, urea, creatinine, uric acid, and electrolytes. Diagnostic protocol included blood tests on day 3 of treatment each week, ultrasound of the upper abdomen and kidney every month (computed tomography scan if needed and indicated), chest x-ray every three months (computed tomography scan of the chest in case of significant changes on previous x-ray). All side effects and reactions were monitored, as well as general wellbeing of each patient during the study. PFS was assessed and defined as the time from the initiation of therapy to the day tumor progression was proven or death occurred. The patients were censored on the date of the last follow-up. OS was investigated from the initiation of therapy to the time of death as a result of any cause or censored on the date of the last follow-up. Data collected during the study were stored in a specially created database. After entry, data processing included descriptive and inferential statistics. For all numerical parameters, we calculated arithmetic mean, standard deviation, coefficient of variation, and value range (minimal and maximal values). For all attributive parameters, frequency tables, i.e., contingency tables, were done in case of two parameters. Comparison of median values between the two groups was performed using Student’s t-test. For comparison of proportions, z-test was used. For testing dependence of the parameter, the independence test was used, whereas survival analysis included Kaplan-Meier curve and logrank test. Statistical processing was performed via Results During treatment, seven patients from the temsirolimus (test) group and five patients from the IFNalpha-2a (control) group survived the first year of systemic therapy. OS during the first year of treatment was 23.33% in patients treated with temsirolimus and 16.67% in patients treated with IFN-alpha ( Table 1 Table 1 Treatment effects on survival and PFS of patients during the first year of therapy  Test group  Control group Survived patients 7/30 (23.33%) 5/30 (16.67%) Deceased patients 23/30 (76.67%) 25/30 (83.33%) Mean survival time (months) 9.267 6.967 95% CI 7.732-10.172 4.537-7.888 Statistical difference for survival p=0.0281 PFS (months) 3.696 2.440 95% CI 2.932-4.459 2.241-2.639 Statistical difference for PFS p=0.0085 CI = confidence interval; PFS = progression-free survival Median OS was 9.27 months in the test group and 6.97 months in the control group. Patients treated with temsirolimus had a significantly longer median OS compared to patients treated with immunotherapy (p=0.0281). Median OS was expressed by the Kaplan-Meier curve ( Fig. 1 Fig. 1 Overall and median 12-month survival in test group and control group patients. During the first year of treatment, the median progression-free time was 2.44 months in the control group and 3.696 months in the test group. Comparison of the results obtained in the study groups by Wilcoxon test revealed that patients treated with temsirolimus had a statistically significantly longer progression-free time (p=0.0084). Discussion Renal cell carcinoma is the most frequent type of renal malignancy; it accounts for 2%-3% of all malignancies in adults. Approximately 30% of new RCC cases present with advanced or metastatic disease (mRCC) and the 5-year survival rate with mRCC is 5% to 10% ( 15 16 17 18 The aim of this study was to compare the effects of immunotherapy and mTOR inhibitors on survival in patients with lung metastasis of RCC and poor prognostic factors. Patients with poor prognostic factors are those who have three or more of the following factors: Karnofsky performance status 60 or more, less than a year from diagnosis to randomization, hemoglobin values below minimum, corrected calcium higher than 10 mg/dL (2.5 mmol/L), lactate dehydrogenase ≥1.5 times above the upper limit of normal, and more than one metastatic hot spot. The first five factors belong to the Memorial Sloan-Kettering Cancer Center (MSKCC) classification system ( 19 20 21 23 24 et al 25 25 Temsirolimus has proved to be efficient in treating both clear cell and other histologic types of RCC, unlike immunotherapy with cytokines which shows relatively satisfactory results only in patients with clear cell RCC ( 26 26 versus When considering median OS in months, the mean OS was 9.267 months in the test group and 6.967 months in the control group, which implies a statistically significant longer survival in favor of temsirolimus. Results of a study published in 2019 show longer median survival in patients treated with temsirolimus in comparison with our results (mOS=17.6) ( 26 27 Important domain of our research was focused on the time elapsed from the start of treatment to the signs of progression, i.e., increase of recorded metastases in the lungs and appearance of new metastases in the lungs and other organs. Median PFS of patients was 3.7 months in the temsirolimus group, which was statistically significantly longer in comparison to 2.44 months recorded in the IFN-alpha-2a group. Considering median PFS, the results of our study are in concordance with the results reported by other researchers ( 26 27 Conclusion Temsirolimus therapy has a significantly positive effect on survival in patients with mRCC. Patients treated with temsirolimus showed significantly longer median OS and median PFS compared to patients treated with IFN-alpha. References 1 Kovacs G Akhtar M Beckwith BJ Bugert P Cooper CS Delahunt B The Heidelberg classification of renal cell tumours. J Pathol 1997 183 2 131 3 10.1002/(SICI)1096-9896(199710)183:2&#x0003c;131::AID-PATH931&#x0003e;3.0.CO;2-G 9390023 2 Moch H, Humphrey PA, Ulbright TM, Reuter VE. WHO Classification of Tumours of the Urinary System and Male Genital Organs – WHO Classification of Tumours, 4th ed.; WHO, Geneva; IARC Press, Lyon: 2016; Volume 8. 10.1016/j.eururo.2016.02.029 26935559 3 Theodoropoulos G Tsiambas E Tziakou P Spyropoulou D Niotis A MicroRNA signatures landscape in renal cell carcinoma-related epithelial to mesenchymal transition. JBUON 2021 26 6 2209 12 4 Capitanio U Montorsi F Renal cancer. Lancet 2016 387 10021 894 906 10.1016/S0140-6736(15)00046-X 26318520 5 Mattila KE Vainio P Jaakkola PM Prognostic factors for localized clear cell renal cell carcinoma and their application in adjuvant therapy. Cancers (Basel) 2022 14 1 239 10.3390/cancers14010239 35008402 PMC8750145 6 Motzer RJ Mazumdar M Bacik J Berg W Amsterdam A Ferrara J Survival and prognostic stratification of 670 patients with advanced renal cell carcinoma. J Clin Oncol 1999 17 8 2530 40 10.1200/JCO.1999.17.8.2530 10561319 7 Kubota S Yoshida T Kageyama S Isono T Yuasa T Yonese J A risk stratification model based on four novel biomarkers predicts prognosis for patients with renal cell carcinoma. World J Surg Oncol 2020 18 1 270 10.1186/s12957-020-02046-9 33092599 PMC7584101 8 Mekhail TM Abou-Jawde RM Boumerhi G Malhi S Wood L Elson P Validation and extension of the Memorial Sloan-Kettering prognostic factors model for survival in patients with previously untreated metastatic renal cell carcinoma. J Clin Oncol 2005 23 4 832 41 10.1200/JCO.2005.05.179 15681528 9 Del Bufalo D Ciuffreda L Trisciuoglio D Desideri M Cognetti F Zupi G Antiangiogenic potential of the mammalian target of rapamycin inhibitor temsirolimus. Cancer Res 2006 66 11 5549 54 10.1158/0008-5472.CAN-05-2825 16740688 10 Abdilkerim O Melike O Mustafa B Ali G Yildirim ME First-line pazopanib in metastatic renal cell carcinoma: multicenter experience. JBUON 2021 26 6 2581 6 11 Faes S Demartines N Dormond O Mechanistic target of rapamycin inhibitors in renal cell carcinoma: potential, limitations, and perspectives. Front Cell Dev Biol 2021 9 636037 10.3389/fcell.2021.636037 33791295 PMC8005589 12 Kobayashi Y Yamada D Kawai T Sato Y Teshima T Yamada Y Different immunological effects of the molecular targeted agents sunitinib, everolimus and temsirolimus in patients with renal cell carcinoma. Int J Oncol 2020 56 4 999 1013 10.3892/ijo.2020.4975 32319571 13 Cao G Wu X Wang Z Tian X Zhang C Wu X What is the optimum systemic treatment for advanced/metastatic renal cell carcinoma of favourable, intermediate and poor risk, respectively? A systematic review and network meta-analysis. BMJ Open 2020 10 8 e034626 10.1136/bmjopen-2019-034626 32859659 PMC7454197 14 Levakov I Vojinov S Marusic G Popov M Levakov O Popov M Safety profile of temsirolimus in patients with metastatic renal cell carcinoma. JBUON 2016 21 6 1442 8 28039705 15 Bosma NA Warkentin MT Gan CL Karim S Heng DYC Brenner DR Efficacy and safety of first-line systemic therapy for metastatic renal cell carcinoma: a systematic review and network meta-analysis. Eur Urol Open Sci 2022 37 14 26 10.1016/j.euros.2021.12.007 35128482 PMC8792068 16 Escudier B Albiges L Sonpavde G Optimal management of metastatic renal cell carcinoma: current status. Drugs 2013 73 5 427 38 10.1007/s40265-013-0043-1 23572408 17 Schwab M Hofmann R Heers H Hegele A mRCC Outcome in the treatment of metastatic renal cell carcinoma – a German single-center real-world experience. In Vivo 2018 32 6 1617 22 10.21873/invivo.11422 30348724 PMC6365752 18 Zanardi E Verzoni E Grassi P Necchi A Giannatempo P Raggi D Clinical experience with temsirolimus in the treatment of advanced renal cell carcinoma. Ther Adv Urol 2015 7 3 152 61 10.1177/1756287215574457 26161146 PMC4485412 19 Vogl UM Zehetgruber H Dominkus M Hejna M Zielinski CC Haitel A Prognostic factors in metastatic renal cell carcinoma: metastasectomy as independent prognostic variable. Br J Cancer 2006 95 6 691 8 10.1038/sj.bjc.6603327 16940978 PMC2360513 20 Kwon WA Cho IC Yu A Nam BH Joung JY Seo HK Validation of the MSKCC and Heng risk criteria models for predicting survival in patients with metastatic renal cell carcinoma treated with sunitinib. Ann Surg Oncol 2013 20 13 4397 404 10.1245/s10434-013-3290-1 24081805 21 Kanesvaran R Porta C Wong A Powles T Ng QS Schmidinger M Pan-Asian adapted ESMO Clinical Practice Guidelines for the diagnosis, treatment and follow-up of patients with renal cell carcinoma. ESMO Open 2021 6 6 100304 10.1016/j.esmoop.2021.100304 34864348 PMC8645910 22 Motzer RJ Jonasch E Michaelson MD Nandagopal L Gore JL George S CGC, Hammond LJ, Zuccarino-Catania G. NCCN Guidelines Insights: Kidney Cancer, Version 2.2020. J Natl Compr Canc Netw 2019 17 11 1278 85 10.6004/jnccn.2019.0054 31693980 23 Escudier B Porta C Schmidinger M Rioux-Leclercq N Bex A Khoo V ESMO Guidelines Committee Electronic address: clinicalguidelines@esmo.org. Renal cell carcinoma: ESMO Clinical Practice Guidelines for diagnosis, treatment andfollow-up†. Ann Oncol 2019 30 5 706 20 10.1093/annonc/mdz056 30788497 24 Sugiyama S Sato K Shibasaki Y Endo Y Uryu T Toyoshima Y Real-world use of temsirolimus in Japanese patients with unresectable or metastatic renal cell carcinoma: recent consideration based on the results of a post-marketing, all-case surveillance study. Jpn J Clin Oncol 2020 50 8 940 7 10.1093/jjco/hyaa062 32458996 PMC7401718 25 Satoh T Koie T Horiguchi H Tokui N Narita S Ohyama C Longer recurrence-free survival in a patient with metastatic renal cell carcinoma treated with temsirolimus. Clin Case Rep 2017 5 12 1950 3 10.1002/ccr3.1181 29225833 PMC5715416 26 Lee JB Park HS Park S Lee HJ Kwon KA Choi YJ Temsirolimus in Asian metastatic/recurrent non-clear cell renal carcinoma. Cancer Res Treat 2019 51 4 1578 88 10.4143/crt.2018.671 30999721 PMC6790860 27 Ramaswamy A Joshi A Noronha V Patil V Sahu A Manickam DR Poor risk advanced renal cell carcinoma: outcomes from a registry in a tertiary cancer center. Indian J Med Paediatr Oncol 2017 38 3 311 5 10.4103/ijmpo.ijmpo_154_16 29200680 PMC5686973 ",
  "metadata": {
    "Title of this paper": "Poor risk advanced renal cell carcinoma: outcomes from a registry in a tertiary cancer center.",
    "Journal it was published in:": "Acta Clinica Croatica",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490455/"
  }
}