{
  "title": "Paper_361",
  "abstract": "pmc Nutr Metab (Lond) Nutr Metab (Lond) 272 nutrmeta Nutrition & Metabolism 1743-7075 BMC PMC12487311 PMC12487311.1 12487311 12487311 41029736 10.1186/s12986-025-01006-y 1006 1 Research Dietary polyunsaturated fatty acid intake and all-cause and cardiovascular mortality in patients with COPD Zhang Yang 1 Liang Xiao 1 Luo Shuai 2 Zhang Zhizhe 2 Zhou Pinglang 1004306612@qq.com 2 Zhou Zhiyang 361439920062@email.ncu.edu.cn 3 Yang Yihan yangyihan@email.ncu.edu.cn 1 1 https://ror.org/042v6xz23 grid.260463.5 0000 0001 2182 8825 Jiangxi Provincial Key Laboratory of Respiratory Diseases, Jiangxi Institute of Respiratory Diseases, The Department of Respiratory and Critical Care Medicine, The First Affiliated Hospital, Jiangxi Medical College, Nanchang University, 2 https://ror.org/042v6xz23 grid.260463.5 0000 0001 2182 8825 The Department of Respiratory and Critical Care Medicine, The First Affiliated Hospital, Jiangxi Medical College, Nanchang University, 3 https://ror.org/042v6xz23 grid.260463.5 0000 0001 2182 8825 The Department of Day Ward, The First Affiliated Hospital, Jiangxi Medical College, Nanchang University, 30 9 2025 2025 22 478882 108 12 6 2025 29 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Chronic obstructive pulmonary disease (COPD) patients face increased mortality risk, particularly from cardiovascular causes. While polyunsaturated fatty acids (PUFAs) have shown cardiovascular benefits in general populations, their impact on COPD mortality remains unexplored. Methods This prospective cohort study analyzed 2,102 COPD patients from NHANES (1999–2018). PUFA intake was assessed through 24-hour dietary recalls and categorized into tertiles. Associations with all-cause and cardiovascular mortality were evaluated using Cox regression models, restricted cubic splines (RCS), and weighted quantile sum (WQS) regression. Comprehensive subgroup and sensitivity analyses confirmed result robustness. Results During 9.08 years of follow-up, 603 deaths (28.7%) occurred, including 190 (9.0%) from cardiovascular disease. Compared to the lowest tertile, the highest tertile of total PUFA (HR: 0.70, 95% CI: 0.53–0.91), N-3 PUFA (HR: 0.67, 95% CI: 0.52–0.87), and N-6 PUFA (HR: 0.74, 95% CI: 0.57–0.97) intake was associated with lower all-cause mortality. For cardiovascular mortality, higher intake of total PUFA (HR: 0.55, 95% CI: 0.33–0.90), N-3 PUFA (HR: 0.56, 95% CI: 0.36–0.89), and N-6 PUFA (HR: 0.57, 95% CI: 0.34–0.93) showed significant protective effects. RCS analyses revealed non-linear associations with significant threshold effects. WQS analysis identified two plant-derived PUFA—α-linolenic acid (ALA) and linoleic acid (LA) as the primary contributors to mortality reduction. All sensitivity analyses confirmed the stability and consistency of our main findings. Conclusions Higher dietary PUFA intake is associated with lower all-cause and cardiovascular mortality among COPD patients, suggesting that increasing dietary PUFA, particularly from plant sources, may help reduce COPD-related mortality risk. Supplementary Information The online version contains supplementary material available at 10.1186/s12986-025-01006-y. Keywords Polyunsaturated fatty acid Chronic obstructive pulmonary disease All-cause mortality Cardiovascular mortality Clinical Research Training Program of the First Affiliated Hospital of Nanchang University No. YFYLCYJPY202447 Yang Yihan pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Chronic Obstructive Pulmonary Disease (COPD) represents a major global public health challenge. As the third leading cause of death worldwide, COPD was responsible for approximately 3.3 million deaths in 2019 and resulted in a loss of 74.4 million disability-adjusted life years (DALYs) [ 1 2 3 4 5 6 9 Beyond pharmacological interventions, recent research indicates that specific nutritional components may improve COPD outcomes and positively affect patient management [ 10 11 12 13 16 17 18 21 Although previous studies have explored the significance of PUFA for COPD patients with promising results, the evidence remains limited. For instance, Engelen et al. found that daily supplementation with 2 g of EPA/DHA for 10 weeks was sufficient to induce muscle growth in COPD patients [ 22 23 In this study, we utilized the National Health and Nutrition Examination Survey (NHANES) database to comprehensively evaluate the associations between total PUFA, N-3 PUFA, and N-6 PUFA intake with all-cause and cardiovascular mortality among COPD patients in the United States. This research aims to provide evidence for dietary interventions and cardiovascular prevention strategies in COPD management. Materials and methods Study design and population This study utilized data from the National Health and Nutrition Examination Survey (NHANES), a comprehensive national health survey conducted by the Centers for Disease Control and Prevention (CDC). NHANES employs a multistage probability sampling design to collect data representative of the noninstitutionalized civilian U.S. population. The survey combines interviews, physical examinations, and laboratory tests conducted by standardized staff, with physical examinations performed in mobile examination centers (MECs). Since 1999, NHANES has operated in continuous two-year cycles, providing nationally representative data on health and nutritional status across diverse demographic groups. Our analysis used NHANES data from 1999 to 2018 to investigate the association between PUFA and prognosis in COPD patients. The initial dataset included 101,316 participants, with subsequent exclusions applied to refine the analytic cohort (Fig. 1 n n n n n n  Fig. 1 Screening flow chart of the study population The final cohort included 2,102 COPD patients for comparative analyses. All NHANES protocols received approval from the National Center for Health Statistics’ Ethics Review Board, and written informed consent was obtained from all participants before enrollment. As this study involved secondary analysis of de-identified public data (accessible at https://www.cdc.gov/nchs/nhanes/ Dietary assessment of PUFA Dietary PUFA intake was assessed using the NHANES 24-hour recall methodology, which evolved over the study period. While the 1999–2002 cycles utilized a single nutritional recall interview, subsequent cycles (2003–2018) implemented a dual-recall approach consisting of an initial face-to-face interview and a telephone follow-up 3–10 days later. All interviews employed the USDA’s Automated Multiple-Pass Method (AMPM), with participants using standardized visual aids including 3D food models and 2D portion-size booklets to estimate quantities. All interviews were conducted by personnel with specialized training using a standardized digital collection system to ensure data quality and consistency. For analytical purposes, we incorporated the sole available recall data from the 1999–2002 period, while for the 2003–2018 cycles, we calculated the mean values from both recalls to represent typical consumption patterns better. Dietary data were converted to nutrient intakes using the USDA Food and Nutrient Database for Dietary Studies (FNDDS), which provides laboratory-analyzed nutrient compositions for all food items. This approach allowed us to maintain methodological consistency while maximizing the accuracy of PUFA intake estimates across the entire study timeframe. We focused on quantifying daily intake (g/day) of N-3 and N-6 polyunsaturated fatty acids. The N-3 PUFA category comprised α-linolenic acid (ALA), stearidonic acid (SDA), eicosapentaenoic acid (EPA), docosapentaenoic acid (DPA), and docosahexaenoic acid (DHA). For N-6 PUFA assessment, we included linoleic acid (LA) and arachidonic acid (AA). These individual fatty acid values were aggregated to determine total N-3 PUFA and total N-6 PUFA consumption, which were then combined to calculate total PUFA intake. Measurement of COPD and different phenotypes of COPD All participants with COPD were diagnosed at baseline during their NHANES survey participation. COPD diagnosis was established when participants met at least one of the following criteria: (1) self-reported physician-diagnosed emphysema; (2) self-reported physician-diagnosed chronic bronchitis; or (3) post-bronchodilator FEV 1 24 25 To investigate the association between PUFA and mortality in different COPD phenotypes: (1) Chronic bronchitis phenotype: Participants with physician-diagnosed chronic bronchitis without emphysema. (2) Emphysema phenotype: Participants with physician-diagnosed emphysema without chronic bronchitis. (3) Asthma-COPD overlap (ACO) phenotype: Participants meeting criteria for both COPD and asthma. Asthma diagnosis was based on physician diagnosis, recent asthma attacks, or use of asthma-specific medications [ 26 27 Definition of all-cause mortality and cardiovascular mortality All-cause mortality status was determined by linking NHANES participant records with the National Death Index (NDI) data provided by the National Center for Health Statistics (NCHS). This linkage tracked mortality outcomes through December 31, 2019. For each participant, the follow-up period was calculated as the interval between their initial NHANES examination date and either their date of death or the administrative censoring date (December 31, 2019) for those who remained alive. Cardiovascular mortality was specifically identified using the “Underlying Leading Cause of Death: Recode” variable from the linked mortality files. Deaths attributed to cardiovascular causes included those from diseases of the heart (ICD-10 codes: I00-I09, I11, I13, I20-I51) and cerebrovascular diseases (ICD-10 codes: I60-I69). Assessment of covariates According to the previous study on PUFA and mortality, our analyses incorporated potential confounding variables based on established associations with COPD, all-cause, and cardiovascular mortality [ 28 30 Sociodemographic factors included age (categorized as < 60 years or ≥ 60 years), sex, race/ethnicity (Non-Hispanic White, Non-Hispanic Black, Mexican American, Other Hispanic, and Other/multiracial), poverty-income ratio (PIR, stratified as low [< 1.3], medium [1.3–3.5], or high [≥ 3.5]), and education level (middle school or lower, high school, college or more). Lifestyle factors encompassed smoking status (never, former, or current), alcohol consumption (yes/no), and body mass index (BMI, classified as normal/underweight [< 25 kg/m²], overweight [25–30 kg/m²], or obese [≥ 30 kg/m²]). Physical activity was assessed using the frequency and duration of leisure-time activities converted to Metabolic Equivalent of Task (MET) minutes per week. Participants achieving ≥ 600 MET-minutes weekly (equivalent to 150 min of moderate or 75 min of vigorous activity) were classified as meeting recommended physical activity levels (yes). Comorbidities were determined using both self-reported information and objective measurements. Hypertension was defined by any of the following: systolic blood pressure ≥ 140 mmHg, diastolic blood pressure ≥ 90 mmHg, self-reported physician diagnosis, or current use of antihypertensive medications [ 31 32 33 34 35 Dietary variables included total daily caloric intake (kcal/day), sodium consumption (mg/day), and diet quality measured by the Healthy Eating Index-2015 (HEI-2015) score. These were presented as median values with interquartile ranges. For dietary assessments, we utilized the single 24-hour recall available in the 1999–2002 cycle, while for subsequent cycles (2003–2018), we calculated the average values from both dietary recalls to better represent habitual intake patterns. Statistical analysis All analyses incorporated appropriate survey weights for NHANES’ complex sampling design, following the recommendations in the NHANES Analytic Guidelines [ 36 Baseline characteristics were presented as weighted proportions for categorical variables and median (interquartile range) for continuous variables with non-normal distributions. Statistical comparisons were performed between survivors and the all-cause mortality group using χ² tests for categorical variables and Mann-Whitney U tests for continuous variables, with P Survival probabilities were estimated using Kaplan-Meier curves, with log-rank tests employed to evaluate unadjusted differences in survival across PUFA exposure categories. For the primary analyses, dietary PUFAs intakes (total PUFA, N-3 PUFA, and N-6 PUFA) were categorized into tertiles based on their distribution. Cox proportional-hazards regression models were constructed to quantify these associations with mortality outcomes, as well as for specific fatty acid components, including plant-based N-3 PUFA (ALA), fish oil-derived N-3 PUFA (DHA + EPA), and N-6 components (LA and AA). The proportional hazards assumption was assessed using Schoenfeld residuals tests, confirming model validity for all analyses (Tables S1 S2 S3 S4 We conducted restricted cubic spline (RCS) analyses using standard distribution percentiles of PUFA intake to examine potential non-linear relationships. In the RCS figures, the horizontal dashed line represents the reference hazard ratio (HR = 1.0), while the vertical dashed line indicates the identified inflection point or threshold value. The shaded areas represent 95% confidence intervals around the estimated hazard ratios. When non-linearity was detected, we identified the optimal threshold value by systematically testing all possible cut-points and selecting the value that maximized the log-likelihood function. Subsequently, we fitted a two-piecewise Cox proportional hazards model with separate linear associations on either side of the identified threshold to characterize the relationship before and after the inflection point. Comprehensive subgroup analyses were conducted to assess the consistency of associations across different demographic and clinical characteristics, including age, sex, race/ethnicity, BMI categories, smoking status, and comorbidities. All subgroup analyses were adjusted for the same covariates as the fully adjusted model (Model 3), excluding the stratification variable. Interaction terms were incorporated into the models to test for effect modification. We also performed stratified analyses by COPD phenotype (chronic bronchitis, emphysema, and asthma-COPD overlap) to examine potential heterogeneity in PUFA-mortality associations across these distinct clinical presentations. To evaluate the combined effects of multiple PUFAs components on mortality risk, we implemented weighted quantile sum (WQS) regression analysis [ 37 Sensitivity analyses were conducted to evaluate the robustness of our findings, including exclusion of participants with implausible caloric intakes (< 500 or > 5,000 kcal/day) and extreme PUFA intakes (< 1st and > 99th percentiles). Additional sensitivity analysis for WQS models was performed by excluding polyunsaturated fatty acids with minimal weight contributions (DHA and AA). All statistical analyses were performed using R software version 4.1.0, with two-sided P Results Baseline characteristics of participants The study cohort comprised 2,102 individuals with COPD from the NHANES 1999–2018 cycles. Table 1  Table 1 Characteristics of COPD participants in NHANES, 1999–2018 Characteristic Overall, N Survivors, N All-cause Death, N CVD Death, N P Age, years, n < 0.001 < 60 years 1,024 (59%) 910 (69%) 114 (26%) 26 (18%) ≥ 60 years 1,078 (41%) 589 (31%) 489 (74%) 164 (82%) Sex, n 0.064 Female 1,139 (57%) 852 (59%) 287 (53%) 89 (50%) Male 963 (43%) 647 (41%) 316 (47%) 101 (50%) Race/ethnicity, n < 0.001 Non-Hispanic White 1,385 (82%) 941 (79%) 444 (89%) 141 (91%) Non-Hispanic Black 349 (7.9%) 268 (8.5%) 81 (5.6%) 23 (4.2%) Mexican American 162 (2.8%) 118 (3.1%) 44 (1.7%) 13 (1.9%) Other Hispanic 106 (2.9%) 86 (3.4%) 20 (1.3%) 9 (1.5%) Other/multiracial 100 (4.7%) 86 (5.5%) 14 (2.1%) 4 (1.5%) PIR, n < 0.001 Low (< 1.3) 755 (29%) 497 (26%) 258 (37%) 78 (40%) Medium (1.3–3.5) 829 (38%) 583 (36%) 246 (44%) 82 (45%) High (≥ 3.5) 518 (34%) 419 (38%) 99 (19%) 30 (15%) Education level, n < 0.001 Middle school or lower 603 (22%) 367 (18%) 236 (34%) 81 (41%) High school 540 (28%) 386 (28%) 154 (26%) 40 (20%) College or more 959 (50%) 746 (53%) 213 (40%) 69 (38%) Alcohol, n 0.218 Yes 1,378 (69%) 985 (70%) 393 (66%) 119 (62%) No 724 (31%) 514 (30%) 210 (34%) 71 (38%) Smoking, n < 0.001 Former 783 (34%) 494 (31%) 289 (45%) 90 (43%) Never 628 (30%) 494 (33%) 134 (21%) 51 (26%) Now 691 (36%) 511 (37%) 180 (34%) 49 (31%) BMI, n 0.043 Normal/Underweight 580 (29%) 370 (28%) 210 (35%) 54 (32%) Overweight 645 (30%) 460 (30%) 185 (29%) 60 (29%) Obesity 877 (41%) 669 (43%) 208 (36%) 76 (39%) Vigorous activity, n < 0.001 Yes 952 (48%) 776 (54%) 176 (31%) 46 (24%) No 1,150 (52%) 723 (46%) 427 (69%) 144 (76%) Diabetes, n < 0.001 Yes 478 (17%) 303 (15%) 175 (26%) 53 (26%) No 1,624 (83%) 1,196 (85%) 428 (74%) 137 (74%) Hypertension, n < 0.001 Yes 1,262 (52%) 823 (47%) 439 (68%) 150 (71%) No 840 (48%) 676 (53%) 164 (32%) 40 (29%) Hyperlipidemia, n 0.598 Yes 1,466 (72%) 1,051 (71%) 415 (73%) 128 (70%) No 636 (28%) 448 (29%) 188 (27%) 62 (30%) CVD, n < 0.001 Yes 535 (22%) 292 (17%) 243 (38%) 106 (56%) No 1,576 (78%) 1,207 (83%) 360 (62%) 84 (44%) CKD, n < 0.001 Yes 302 (11%) 139 (8%) 163 (22%) 69 (34%) No 1,800 (89%) 1,360 (92%) 440 (78%) 121 (66%) Cancer, n < 0.001 Yes 335 (16%) 196 (13%) 139 (24%) 33 (19%) No 1,767 (84%) 1,303 (87%) 464 (76%) 157 (81%) Calorie, kcal/day, Median (IQR) 1,867 (1,425, 2,484) 1,955 (1,505, 2,554) 1,654 (1,329, 2,293) 1,576 (1,272, 2,178) < 0.001 Sodium, mg/day, Median (IQR) 3,071 (2,259, 4,050) 3,200 (2,380, 4,215) 2,655 (1,934, 3,653) 2,615 (1,896, 3,295) < 0.001 HEI-2015, scores, Median (IQR) 48 (39, 58) 48 (39, 58) 49 (40, 59) 50 (40, 58) 0.430 Total PUFA, g/day, Median (IQR) 15 (10, 21) 15 (11, 22) 13 (9, 19) 11 (7, 18) < 0.001 N-3 PUFA, g/day, Median (IQR) 1.44 (0.95, 2.12) 1.48 (0.99, 2.16) 1.25 (0.80, 1.95) 1.10 (0.74, 1.86) 0.001 ALA, g/day, Median (IQR) 1.33 (0.87, 1.95) 1.37 (0.91, 1.99) 1.18 (0.75, 1.74) 1.00 (0.63, 1.66) < 0.001 EPA, g/day, Median (IQR) 0.01 (0.00, 0.02) 0.01 (0.00, 0.02) 0.01 (0.00, 0.02) 0.00 (0.00, 0.01) < 0.001 DHA, g/day, Median (IQR) 0.02 (0.01, 0.06) 0.02 (0.01, 0.06) 0.02 (0.00, 0.05) 0.02 (0.00, 0.05) 0.057 DPA, g/day, Median (IQR) 0.011 (0.002, 0.022) 0.012 (0.004, 0.023) 0.005 (0.000, 0.020) 0.004 (0.000, 0.017) < 0.001 SDA, g/day, Median (IQR) 0.001 (0.000, 0.005) 0.001 (0.000, 0.005) 0.000 (0.000, 0.004) 0.000 (0.000, 0.003) 0.002 N-6 PUFA, g/day, Median (IQR) 13 (9, 19) 14 (9, 19) 12 (8, 18) 10 (7, 16) < 0.001 LA, g/day, Median (IQR) 13 (9, 19) 14 (9, 19) 12 (8, 18) 10 (7, 16) < 0.001 AA, g/day, Median (IQR) 0.11 (0.06, 0.18) 0.11 (0.06, 0.19) 0.09 (0.05, 0.16) 0.09 (0.04, 0.14) 0.003 Follow-up time (months) 118 (70, 166) 128 (84, 174) 78 (38, 128) 78 (43, 135) < 0.001 Note: Categorical variables were expressed as a number (n) and a weighted percent (%) of the participants. P n n PIR, Family poverty income ratio; BMI, Body mass index; CVD, Cardiovascular disease; CKD, Chronic kidney disease; HEI-2015, Healthy Eating Index-2015; ALA, α-linolenic acid; EPA, eicosapentaenoic acid; DHA, docosahexaenoic acid; DPA, docosapentaenoic acid; SDA, stearidonic acid; LA, linoleic acid; AA, arachidonic acid Compared to survivors, participants who died from all causes were significantly older (74% vs. 31% aged ≥ 60 years, P P Regarding lifestyle factors, 69% of the overall cohort reported alcohol consumption, with no significant difference between survival groups ( P P P P The cohort exhibited a substantial comorbidity burden, with significant differences between survival groups. Hypertension (68% vs. 47%), diabetes (26% vs. 15%), cardiovascular disease (38% vs. 17%), chronic kidney disease (22% vs. 8%), and cancer (24% vs. 13%) were all significantly more prevalent among those who experienced all-cause mortality (all P Dietary assessments revealed significant differences between groups. Survivors had higher median daily caloric intake (1,955 vs. 1,654 kcal/day, P P P PUFA intake analysis showed survivors consumed significantly higher amounts of total PUFA (15 vs. 13 g/day, P P P P During a median follow-up period of 118 months (interquartile range [IQR]: 70–166), 603 participants (28.7%) died from all causes, with survivors having longer follow-up time (128 vs. 78 months, P Association of total, N-3, and N-6 PUFA intake with all-cause and cardiovascular mortality Participants were stratified into tertiles (T1, T2, T3) based on their dietary PUFA intake levels. Unadjusted Kaplan-Meier survival analysis revealed that participants with lower intake levels (T1) of total PUFA, N-3 PUFA, and N-6 PUFA had significantly reduced survival probabilities for both all-cause and cardiovascular mortality compared to those with higher intake levels (T3) (all P S1 Cox proportional hazards regression models with progressive covariate adjustment confirmed these findings (Table 2 P P P P P P  Table 2 Association of total, N-3, and N-6 PUFA intake with all-cause and cardiovascular mortality Model 1 Model 2 Model 3 HR 95% CI  P HR 95% CI  P HR 95% CI  P Total PUFA, g/day  All-cause T1 (0.56–11.14) Ref Ref Ref Ref Ref Ref T2 (11.14–18.26) 0.79 0.65–0.95 0.012 0.81 0.67–0.93 0.033 0.80 0.66–0.98 0.035 T3 (≥ 18.26) 0.60 0.49–0.73 < 0.001 0.68 0.56–0.84 < 0.001 0.70 0.53–0.91 0.007  CVD T1 (0.56–11.14) Ref Ref Ref Ref Ref Ref T2 (11.14–18.26) 0.56 0.40–0.79 < 0.001 0.59 0.41–0.83 0.002 0.62 0.43–0.90 0.011 T3 (≥ 18.26) 0.47 0.33–0.67 < 0.001 0.56 0.39–0.81 0.002 0.55 0.33–0.90 0.018 N-3 PUFA g/day  All-cause T1 (0.05–1.08) Ref Ref Ref Ref Ref Ref T2 (1.08–1.78) 0.76 0.63–0.91 0.004 0.81 0.67–0.99 0.036 0.83 0.68–1.03 0.085 T3 (≥ 1.78) 0.69 0.57–0.84 < 0.001 0.66 0.54–0.81 < 0.001 0.67 0.52–0.87 0.003  CVD T1 (0.05–1.08) Ref Ref Ref Ref Ref Ref T2 (1.08–1.78) 0.54 0.38–0.76 < 0.001 0.60 0.42–0.86 0.005 0.60 0.41–0.88 0.008 T3 (≥ 1.78) 0.60 0.42–0.84 0.003 0.58 0.40–0.82 0.002 0.56 0.36–0.89 0.015 N-6 PUFA g/day  All-cause T1 (0.50–10.00) Ref Ref Ref Ref Ref Ref T2 (10.00-16.43) 0.77 0.65–0.93 0.008 0.81 0.67–0.98 0.036 0.83 0.67–1.01 0.071 T3 (≥ 16.43) 0.61 0.50–0.74 < 0.001 0.71 0.58–0.88 0.001 0.74 0.57–0.97 0.029  CVD T1 (0.50–10.00) Ref Ref Ref Ref Ref Ref T2 (10.00-16.43) 0.56 0.40–0.80 < 0.001 0.57 0.40–0.80 0.001 0.60 0.41–0.87 0.007 T3 (≥ 16.43) 0.57 0.39–0.82 0.002 0.56 0.39–0.82 0.002 0.57 0.34–0.93 0.025 Model 1: Crude model without adjustment. Model 2: Adjusted for age and sex. Model 3: Model 2 additionally adjusted for race/ethnicity, PIR, education level, alcohol consumption, smoking status, vigorous physical activity, BMI, diabetes, hypertension, hyperlipidemia, CVD, CKD, cancer, daily calorie intake, daily sodium intake, and HEI-2015 scores PIR, Poverty-income ratio; BMI, Body mass index; CVD, Cardiovascular disease; CKD, Chronic kidney disease; HEI-2015, Healthy Eating Index-2015 RCS analyses revealed significant nonlinear relationships between dietary PUFA intake and mortality risks in COPD participants ( P 2 3 P P  Fig. 2 Dose-response analysis between total, N-3, and N-6 PUFA intake with all-cause and cardiovascular mortality. ( A-B C-D E-F All covariates included in Model 3 were fully adjusted  Table 3 Threshold effect analysis of total, N-3, and N-6 PUFA on all-cause and cardiovascular mortality in COPD participants All-cause mortality CVD mortality HR 95% CI  P HR 95% CI  P  Total PUFA Inflection point (K) 22.04 g/day 20.32 g/day < K 0.97 0.95–0.99 0.004 0.95 0.91–0.99 0.006 >K 1.01 0.99–1.03 0.336 1.02 0.99–1.05 0.141 Log likelihood ratio 0.001 0.012  N-3 PUFA Inflection point (K) 1.95 g/day 2.18 g/day < K 0.76 0.62–0.93 0.008 0.63 0.43–0.93 0.021 >K 1.18 1.01–1.37 0.036 1.10 0.75–1.61 0.637 Log likelihood ratio 0.003 0.001  N-6 PUFA Inflection point (K) 21.10 g/day 18.47 g/day < K 0.98 0.96-1.00 0.027 0.95 0.91–0.99 0.009 >K 1.00 0.99–1.03 0.401 1.03 0.99–1.06 0.128 Log likelihood ratio 0.040 0.004 All covariates included in Model 3 were fully adjusted N-3 PUFA showed protective effects below 1.95 g/day for all-cause mortality (HR: 0.76, 95% CI: 0.62–0.93, P P P Association of specific N-3 PUFA components (ALA and EPA + DHA) with all-cause and cardiovascular mortality We investigated two specific N-3 PUFA components: plant-derived α-Linolenic acid (ALA), marine-derived eicosapentaenoic acid, and docosahexaenoic acid (EPA + DHA). Unadjusted Kaplan-Meier analysis demonstrated that COPD patients with higher dietary ALA intake (T3 vs. T1) exhibited significantly lower rates of all-cause mortality ( P P S2 S2 P P S2 S2 In Cox proportional hazards regression models with progressive covariate adjustment (Table S5 P P P P S3 S6 For EPA + DHA, the highest intake group (≥ 0.06 g/day) exhibited a 27% lower risk of all-cause mortality (HR: 0.73, 95% CI: 0.60–0.89, P P S5 Association of specific N-6 PUFA components (LA and AA) with all-cause and cardiovascular mortality We evaluated two specific N-6 PUFA components: linoleic acid (LA) and arachidonic acid (AA). Unadjusted Kaplan-Meier analysis demonstrated that higher dietary LA intake was significantly associated with reduced all-cause ( P P S4 S4 P P S4 S4 In multivariable Cox regression analyses (Table S7 P P P P P S3 S7 In contrast, AA intake showed initial protective associations in the crude model but disappeared after full covariate adjustment (Table S7 Association of N6/N3-PUFA ratio with all-cause and cardiovascular mortality Previous studies have extensively documented the beneficial effects of a low N6/N3-PUFA ratio on improving atherosclerosis and cardiovascular disease outcomes [ 12 38 P S8 Subgroup analysis and COPD phenotype analysis We conducted subgroup analyses based on demographic and clinical characteristics of COPD patients. The protective association between N-3 PUFA intake and all-cause mortality was significantly stronger in males, non-hyperlipidemic patients, and those with chronic kidney disease (all P S9 S10 For the N-6/N-3 PUFA ratio, while no overall association was observed with mortality outcomes, stratified analyses revealed significant effect modifications across several subgroups (Table S11 P P P P P Given the heterogeneous nature of COPD, we conducted phenotype-specific analyses across emphysema ( N N N 26 39 P P P Significant protective effects were observed for all-cause mortality in emphysema patients with high total PUFA intake (HR: 0.53, 95% CI: 0.30–0.97, P P P 4  Table 4 Association of PUFA intake was associated with all-cause and cardiovascular mortality in different COPD phenotypes Emphysema ( N Chronic bronchitis ( N Asthma-COPD overlap ( N HR 95% CI  P HR 95% CI  P HR 95% CI  P Total PUFA, g/day  All-cause T1 (0.56–11.14) Ref Ref Ref Ref Ref Ref T2 (11.14–18.26) 0.84 0.56–1.27 0.413 0.67 0.49–0.92 0.006 0.78 0.55–1.12 0.182 T3 (≥ 18.26) 0.53 0.30–0.97 0.038 0.66 0.44–0.99 0.046 0.67 0.41–1.10 0.116  CVD T1 (0.56–11.14) Ref Ref Ref Ref Ref Ref T2 (11.14–18.26) 0.50 0.23–1.09 0.082 0.47 0.28–0.80 0.006 0.32 0.16–0.64 0.001 T3 (≥ 18.26) 0.25 0.08–0.80 0.020 0.38 0.19–0.77 0.008 0.24 0.09–0.61 0.003 N-3 PUFA g/day  All-cause T1 (0.05–1.08) Ref Ref Ref Ref Ref Ref T2 (1.08–1.78) 0.64 0.39–1.02 0.061 0.89 0.64–1.22 0.468 0.70 0.49–1.00 0.054 T3 (≥ 1.78) 0.59 0.35–1.01 0.053 0.77 0.52–1.13 0.117 0.71 0.44–1.17 0.178  CVD T1 (0.05–1.08) Ref Ref Ref Ref Ref Ref T2 (1.08–1.78) 0.36 0.16–0.97 0.042 0.55 0.31–0.95 0.033 0.41 0.21–0.81 0.010 T3 (≥ 1.78) 0.33 0.11–0.95 0.041 0.55 0.30–1.04 0.067 0.43 0.18–1.03 0.057 N-6 PUFA g/day  All-cause T1 (0.50–10.00) Ref Ref Ref Ref Ref Ref T2 (10.00-16.43) 0.84 0.55–1.28 0.418 0.66 0.48–0.91 0.011 0.83 0.58–1.18 0.288 T3 (≥ 16.43) 0.66 0.37–1.20 0.175 0.73 0.48–1.10 0.128 0.70 0.43–1.14 0.152  CVD T1 (0.50–10.00) Ref Ref Ref Ref Ref Ref T2 (10.00-16.43) 0.45 0.21–0.98 0.045 0.42 0.24–0.73 0.002 0.34 0.18–0.68 0.002 T3 (≥ 16.43) 0.22 0.07–0.69 0.010 0.42 0.21–0.86 0.017 0.27 0.11–0.68 0.006 All covariates included in Model 3 were fully adjusted Combined effects of PUFA on all-cause and cardiovascular mortality We previously analyzed the individual effects of specific PUFA intake on all-cause and cardiovascular mortality. To comprehensively assess the combined protective effects of multiple PUFAs components, we employed WQS regression analysis. For all-cause mortality (Fig. 3 S12 P  Fig. 3 The weights assigned to PUFA from WQS models. ( A B All covariates included in Model 3 were fully adjusted ALA, α-Linolenic acid; LA, linoleic acid; EPA, eicosapentaenoic acid; DPA, docosapentaenoic acid; SDA, stearidonic acid; DHA, docosahexaenoic acid; AA, arachidonic acid For cardiovascular mortality (Fig. 3 S12 P Sensitivity analysis To evaluate the robustness of our findings and address potential concerns regarding extreme values, we conducted comprehensive sensitivity analyses. First, we excluded participants with implausible caloric intakes (< 500 or > 5,000 kcal/day), resulting in a refined sample of 2,081 participants (Table S13 S14 Additionally, we performed a sensitivity analysis for the WQS models by excluding polyunsaturated fatty acids with minimal weight contributions (DHA and AA). The sensitivity analysis yielded results that were virtually identical to the full models for both all-cause and cardiovascular mortality outcomes, with effect estimates and statistical significance remaining consistent (Fig. S5 Discussion To our knowledge, this is the first study to evaluate the associations between dietary PUFA, including N-3 PUFA and N-6 PUFA, and all-cause and cardiovascular mortality in patients with COPD. Our findings suggest that higher intakes of total PUFA, N-3 PUFA, and N-6 PUFA are associated with improved survival from all-cause and cardiovascular mortality, primarily driven by ALA and LA. RCS analyses revealed non-linear inverse relationships between total PUFA, N-3 PUFA, N-6 PUFA, and all-cause and cardiovascular disease mortality. Importantly, we observed significant threshold effects, suggesting that the protective benefits of PUFA intake for COPD patients may diminish or even reverse after reaching certain levels. Additionally, we found that higher PUFA intake was associated with reduced cardiovascular mortality across different COPD phenotypes, including emphysema, chronic bronchitis, and asthma-COPD overlap. The threshold effects observed in our study indicate that PUFA supplementation for COPD patients does not follow a “more is better” principle. For instance, our analysis demonstrated that all-cause mortality reached its lowest point at an N-3 PUFA intake of 1.95 g/day, with further increases in intake providing no additional benefit and potentially increasing mortality risk. Similarly, for cardiovascular mortality, the lowest risk was observed at an N-3 PUFA intake of 2.18 g/day. These findings align with the FDA recommendations against excessive consumption of N-3 PUFA (> 2 g/day), which may be harmful [ 40 41 42 Beyond threshold analyses, we also examined the role of the N-6/N-3 ratio in all-cause and cardiovascular mortality among COPD patients. While some studies suggest that CVD mortality risk is related to imbalances in the N-6/N-3 PUFA ratio, we did not observe any significant associations between this ratio and all-cause or cardiovascular mortality in COPD patients [ 21 43 Our research revealed that COPD patients with diets rich in plant-derived PUFAs (ALA and LA) had better survival rates from all-cause and cardiovascular mortality. The WQS regression model identified these fatty acids as major contributors to the protective effects against all-cause mortality (collectively 69%) and cardiovascular mortality (collectively 58%). ALA, a potent anti-inflammatory compound, has been associated with lower tumor necrosis factor-alpha (TNF-α) concentrations in both COPD and hypertensive populations in previous studies [ 44 45 46 47 21 48 Surprisingly, the widely studied marine-derived EPA and DHA showed associations with CVD mortality risk in crude models and age-sex adjusted models, but these associations were no longer significant after adjusting for all covariates. Although the underlying reasons remain unclear, the WQS model still indicated a substantial cardiovascular protective contribution from EPA (21%), which was considerably higher than that of DHA (1%). Consistent with our findings, several studies have suggested that the cardiovascular benefits of N-3 PUFA primarily derive from EPA rather than DHA [ 29 49 50 51 Considering the variations in CVD risk across different COPD phenotypes, we further investigated the effects of total PUFA, N-3 PUFA, and N-6 PUFA on three specific COPD phenotypes: emphysema, chronic bronchitis, and asthma-COPD overlap. These phenotypes were selected based on their distinct pathophysiological mechanisms and well-established differences in cardiovascular mortality risk, which may influence their response to dietary interventions. The emphysema phenotype is characterized predominantly by parenchymal destruction, with patients primarily presenting with dyspnea, lung hyperinflation, and impaired gas exchange [ 52 53 54 39 55 Our results indicated that higher PUFA intake was associated with lower CVD mortality across all COPD phenotypes, further supporting the cardioprotective associations of high PUFA intake. However, regarding all-cause mortality, higher PUFA intake was associated with reduced mortality in the emphysema phenotype and chronic bronchitis phenotype, but not in asthma-COPD overlap. Compared to other subtypes, patients with asthma-COPD overlap exhibit distinct metabolomic profiles and inflammatory patterns [ 54 55 Furthermore, our subgroup analyses revealed important effect modifications by sex and hyperlipidemia status. The stronger N-3 PUFA protection in males likely reflects sex differences in fatty acid metabolism, with women having higher endogenous DHA levels due to estrogen regulation, while males depend more on dietary sources [ 56 57 58 59 Our findings have important clinical implications for the nutritional management of COPD patients. Current dietary recommendations for COPD focus primarily on maintaining adequate caloric intake and protein balance to prevent cachexia and muscle wasting [ 22 Our study has several limitations that should be acknowledged. First, PUFA intake was assessed using a 24-hour dietary recall, which may be subject to recall bias, and dietary habits might change over the follow-up period. Additionally, our study combined NHANES cycles that used different dietary recall methodologies (single 24-hour recall in 1999–2002 versus averaged multiple recalls in 2003–2018), which may introduce measurement heterogeneity. Biomarkers of PUFA status, such as plasma or erythrocyte membrane fatty acid composition, would provide more objective measures of exposure. Second, due to limited data on fatty acid supplements in NHANES, we could not evaluate the role of PUFA supplementation. Third, despite adjusting for multiple confounding factors, we cannot rule out the influence of all potential confounders or residual confounding. Fourth, as this is an exploratory study, the threshold values identified in our piecewise Cox regression analyses should be interpreted with caution and require validation in future prospective studies before they can be considered as evidence-based clinical recommendations for PUFA intake in COPD patients. Finally, as with all observational studies, we cannot establish causality, and our findings should be interpreted as associations that require confirmation in interventional studies. Conclusion In conclusion, our analysis of 2,102 COPD patients from NHANES 1999–2018 with an average follow-up of 9.08 years provides novel evidence that higher dietary intake of total PUFA, including N-3 PUFA (primarily ALA) and N-6 PUFA (primarily LA), is associated with lower all-cause and cardiovascular mortality. Our findings suggest that dietary PUFA may represent a modifiable risk factor for mortality in COPD patients and highlight the potential importance of nutritional strategies in comprehensive COPD management. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors thank the National Health and Nutrition Examination Survey participants and staff for their valuable contributions. Author contributions Yang Zhang: Formal analysis, Investigation, Writing - original draft, Writing - review & editing. Xiao Liang: Investigation, Writing - original draft. Shuai Luo: Data curation, Formal analysis, Visualization. Zhizhe Zhang: Data curation, Formal analysis, Visualization. Pinglang Zhou: Conceptualization, Supervision. Zhiyang Zhou: Conceptualization, Supervision. Yihan Yang: Conceptualization, Funding acquisition, Supervision, Project administration, Writing - review & editing. All authors approved the final manuscript as submitted and agreed to take responsibility for all aspects of the work. Funding This study was supported by the Clinical Research Training Program of the First Affiliated Hospital of Nanchang University (No YFYLCYJPY202447). Data availability Data from NHANES are available to all researchers upon application (apply for using the NHANES dataset at ( https://www.cdc.gov/nchs/nhanes Declarations Ethics approval and consent to participate Since the current study was a secondary analysis of publicly available NHANES data, no institutional review board approval was necessary or obtained. Competing interests The authors declare no competing interests. Abbreviations COPD Chronic obstructive pulmonary disease PUFA Polyunsaturated fatty acid N-3 PUFA Omega-3 polyunsaturated fatty acid N-6 PUFA Omega-6 polyunsaturated fatty acid ALA α-linolenic acid SDA Stearidonic acid EPA Eicosapentaenoic acid DPA Docosapentaenoic acid DHA Docosahexaenoic acid LA Linoleic acid AA Arachidonic acid NHANES National Health and Nutrition Examination Survey ACO Asthma-COPD overlap PIR Poverty income ratio CVD Cardiovascular diseases RCS Restricted cubic splines WQS Weighted quantile sum References 1. Safiri S Carson-Chahhoud K Noori M Nejadghaderi SA Sullman MJM Ahmadian Heris J Ansarin K Mansournia MA Collins GS Kolahi AA Kaufman JS Burden of chronic obstructive pulmonary disease and its attributable risk factors in 204 countries and territories, 1990–2019: results from the global burden of disease study 2019 BMJ 2022 378 e069679 10.1136/bmj-2021-069679 35896191 PMC9326843 Safiri S, Carson-Chahhoud K, Noori M, Nejadghaderi SA, Sullman MJM, Ahmadian Heris J, Ansarin K, Mansournia MA, Collins GS, Kolahi AA, Kaufman JS. Burden of chronic obstructive pulmonary disease and its attributable risk factors in 204 countries and territories, 1990–2019: results from the global burden of disease study 2019. BMJ. 2022;378:e069679. 35896191 10.1136/bmj-2021-069679 PMC9326843 2. Christenson SA Smith BM Bafadhel M Putcha N Chronic obstructive pulmonary disease Lancet 2022 399 2227 42 10.1016/S0140-6736(22)00470-6 35533707 Christenson SA, Smith BM, Bafadhel M, Putcha N. Chronic obstructive pulmonary disease. Lancet. 2022;399:2227–42. 35533707 10.1016/S0140-6736(22)00470-6 3. Agustí A, Celli BR, Criner GJ, Halpin D, Anzueto A, Barnes P, Bourbeau J, Han MK, Martinez FJ, de Montes M et al. Global initiative for chronic obstructive lung disease 2023 report: GOLD executive summary. Eur Respir J 2023, 61. 10.1183/13993003.00239-2023 PMC10066569 36858443 4. Kahnert K Jörres RA Behr J Welte T The diagnosis and treatment of COPD and its comorbidities Dtsch Arztebl Int 2023 120 434 44 36794439 10.3238/arztebl.m2023.027 PMC10478768 Kahnert K, Jörres RA, Behr J, Welte T. The diagnosis and treatment of COPD and its comorbidities. Dtsch Arztebl Int. 2023;120:434–44. 36794439 10.3238/arztebl.m2023.027 PMC10478768 5. Rabe KF, Hurst JR, Suissa S. Cardiovascular disease and COPD: dangerous liaisons? Eur Respir Rev 2018, 27. 10.1183/16000617.0057-2018 PMC9488649 30282634 6. Foos V, Mcewan P, Holmgren U, Marshall J, Müllerová H, De Nigris E. Projections of 10-year mortality in patients with COPD in the UK using the CHOPIN policy model. Eur Respir J, 58:PA1012. 7. Cho EE Maclagan LC Chu A Croxford R Sin DD Udell JA Lee D Austin PC Gershon AS Impact of COPD on cardiovascular risk factors and outcomes in people with established cardiovascular disease Thorax 2025 80 291 9 10.1136/thorax-2023-220991 40032508 Cho EE, Maclagan LC, Chu A, Croxford R, Sin DD, Udell JA, Lee D, Austin PC, Gershon AS. Impact of COPD on cardiovascular risk factors and outcomes in people with established cardiovascular disease. Thorax. 2025;80:291–9. 40032508 10.1136/thorax-2023-220991 8. Singh D Han MK Hawkins NM Hurst JR Kocks JWH Skolnik N Stolz D El Khoury J Gale CP Implications of cardiopulmonary risk for the management of COPD: A narrative review Adv Ther 2024 41 2151 67 10.1007/s12325-024-02855-4 38664329 PMC11133105 Singh D, Han MK, Hawkins NM, Hurst JR, Kocks JWH, Skolnik N, Stolz D, El Khoury J, Gale CP. Implications of cardiopulmonary risk for the management of COPD: A narrative review. Adv Ther. 2024;41:2151–67. 38664329 10.1007/s12325-024-02855-4 PMC11133105 9. Graul EL Nordon C Rhodes K Marshall J Menon S Kallis C Ioannides AE Whittaker HR Peters NS Quint JK Temporal risk of nonfatal cardiovascular events after chronic obstructive pulmonary disease exacerbation: A Population-based study Am J Respir Crit Care Med 2024 209 960 72 10.1164/rccm.202307-1122OC 38127850 PMC11531205 Graul EL, Nordon C, Rhodes K, Marshall J, Menon S, Kallis C, Ioannides AE, Whittaker HR, Peters NS, Quint JK. Temporal risk of nonfatal cardiovascular events after chronic obstructive pulmonary disease exacerbation: A Population-based study. Am J Respir Crit Care Med. 2024;209:960–72. 38127850 10.1164/rccm.202307-1122OC PMC11531205 10. Beijers R, Steiner MC, Schols A. The role of diet and nutrition in the management of COPD. Eur Respir Rev 2023, 32. 10.1183/16000617.0003-2023 PMC10245132 37286221 11. van Iersel LEJ Beijers R Gosker HR Schols A Nutrition as a modifiable factor in the onset and progression of pulmonary function impairment in COPD: a systematic review Nutr Rev 2022 80 1434 44 10.1093/nutrit/nuab077 34537848 PMC9086787 van Iersel LEJ, Beijers R, Gosker HR, Schols A. Nutrition as a modifiable factor in the onset and progression of pulmonary function impairment in COPD: a systematic review. Nutr Rev. 2022;80:1434–44. 34537848 10.1093/nutrit/nuab077 PMC9086787 12. Schulze MB Minihane AM Saleh RNM Risérus U Intake and metabolism of omega-3 and omega-6 polyunsaturated fatty acids: nutritional implications for cardiometabolic diseases Lancet Diabetes Endocrinol 2020 8 915 30 10.1016/S2213-8587(20)30148-0 32949497 Schulze MB, Minihane AM, Saleh RNM, Risérus U. Intake and metabolism of omega-3 and omega-6 polyunsaturated fatty acids: nutritional implications for cardiometabolic diseases. Lancet Diabetes Endocrinol. 2020;8:915–30. 32949497 10.1016/S2213-8587(20)30148-0 13. Tavazzi L Maggioni AP Marchioli R Barlera S Franzosi MG Latini R Lucci D Nicolosi GL Porcu M Tognoni G Effect of n-3 polyunsaturated fatty acids in patients with chronic heart failure (the GISSI-HF trial): a randomised, double-blind, placebo-controlled trial Lancet 2008 372 1223 30 10.1016/S0140-6736(08)61239-8 18757090 Tavazzi L, Maggioni AP, Marchioli R, Barlera S, Franzosi MG, Latini R, Lucci D, Nicolosi GL, Porcu M, Tognoni G. Effect of n-3 polyunsaturated fatty acids in patients with chronic heart failure (the GISSI-HF trial): a randomised, double-blind, placebo-controlled trial. Lancet. 2008;372:1223–30. 18757090 10.1016/S0140-6736(08)61239-8 14. Jiang H Wang L Wang D Yan N Li C Wu M Wang F Mi B Chen F Jia W Omega-3 polyunsaturated fatty acid biomarkers and risk of type 2 diabetes, cardiovascular disease, cancer, and mortality Clin Nutr 2022 41 1798 807 10.1016/j.clnu.2022.06.034 35830775 Jiang H, Wang L, Wang D, Yan N, Li C, Wu M, Wang F, Mi B, Chen F, Jia W, et al. Omega-3 polyunsaturated fatty acid biomarkers and risk of type 2 diabetes, cardiovascular disease, cancer, and mortality. Clin Nutr. 2022;41:1798–807. 35830775 10.1016/j.clnu.2022.06.034 15. Bassuk SS Manson JE Marine omega-3 fatty acid supplementation and prevention of cardiovascular disease: update on the randomized trial evidence Cardiovasc Res 2023 119 1297 309 10.1093/cvr/cvac172 36378553 PMC10262192 Bassuk SS, Manson JE. Marine omega-3 fatty acid supplementation and prevention of cardiovascular disease: update on the randomized trial evidence. Cardiovasc Res. 2023;119:1297–309. 36378553 10.1093/cvr/cvac172 PMC10262192 16. Manson JE Bassuk SS Lee IM Cook NR Albert MA Gordon D Zaharris E Macfadyen JG Danielson E Lin J The vitamin D and OmegA-3 trial (VITAL): rationale and design of a large randomized controlled trial of vitamin D and marine omega-3 fatty acid supplements for the primary prevention of cancer and cardiovascular disease Contemp Clin Trials 2012 33 159 71 10.1016/j.cct.2011.09.009 21986389 PMC3253961 Manson JE, Bassuk SS, Lee IM, Cook NR, Albert MA, Gordon D, Zaharris E, Macfadyen JG, Danielson E, Lin J, et al. The vitamin D and OmegA-3 trial (VITAL): rationale and design of a large randomized controlled trial of vitamin D and marine omega-3 fatty acid supplements for the primary prevention of cancer and cardiovascular disease. Contemp Clin Trials. 2012;33:159–71. 21986389 10.1016/j.cct.2011.09.009 PMC3253961 17. Rimm EB Appel LJ Chiuve SE Djoussé L Engler MB Kris-Etherton PM Mozaffarian D Siscovick DS Lichtenstein AH Seafood Long-Chain n-3 polyunsaturated fatty acids and cardiovascular disease: A science advisory from the American heart association Circulation 2018 138 e35 47 10.1161/CIR.0000000000000574 29773586 PMC6903778 Rimm EB, Appel LJ, Chiuve SE, Djoussé L, Engler MB, Kris-Etherton PM, Mozaffarian D, Siscovick DS, Lichtenstein AH. Seafood Long-Chain n-3 polyunsaturated fatty acids and cardiovascular disease: A science advisory from the American heart association. Circulation. 2018;138:e35–47. 29773586 10.1161/CIR.0000000000000574 PMC6903778 18. Li J Guasch-Ferré M Li Y Hu FB Dietary intake and biomarkers of Linoleic acid and mortality: systematic review and meta-analysis of prospective cohort studies Am J Clin Nutr 2020 112 150 67 10.1093/ajcn/nqz349 32020162 PMC7326588 Li J, Guasch-Ferré M, Li Y, Hu FB. Dietary intake and biomarkers of Linoleic acid and mortality: systematic review and meta-analysis of prospective cohort studies. Am J Clin Nutr. 2020;112:150–67. 32020162 10.1093/ajcn/nqz349 PMC7326588 19. Naghshi S Aune D Beyene J Mobarak S Asadi M Sadeghi O Dietary intake and biomarkers of alpha linolenic acid and risk of all cause, cardiovascular, and cancer mortality: systematic review and dose-response meta-analysis of cohort studies BMJ 2021 375 n2213 10.1136/bmj.n2213 34645650 PMC8513503 Naghshi S, Aune D, Beyene J, Mobarak S, Asadi M, Sadeghi O. Dietary intake and biomarkers of alpha linolenic acid and risk of all cause, cardiovascular, and cancer mortality: systematic review and dose-response meta-analysis of cohort studies. BMJ. 2021;375:n2213. 34645650 10.1136/bmj.n2213 PMC8513503 20. Chen LH Hu Q Li G Zhang L Qin LQ Zuo H Xu G Dietary intake and biomarkers of α-Linolenic acid and mortality: A Meta-Analysis of prospective cohort studies Front Nutr 2021 8 743852 10.3389/fnut.2021.743852 34805241 PMC8595337 Chen LH, Hu Q, Li G, Zhang L, Qin LQ, Zuo H, Xu G. Dietary intake and biomarkers of α-Linolenic acid and mortality: A Meta-Analysis of prospective cohort studies. Front Nutr. 2021;8:743852. 34805241 10.3389/fnut.2021.743852 PMC8595337 21. Marklund M Wu JHY Imamura F Del Gobbo LC Fretts A de Goede J Shi P Tintle N Wennberg M Aslibekyan S Biomarkers of dietary Omega-6 fatty acids and incident cardiovascular disease and mortality Circulation 2019 139 2422 36 10.1161/CIRCULATIONAHA.118.038908 30971107 PMC6582360 Marklund M, Wu JHY, Imamura F, Del Gobbo LC, Fretts A, de Goede J, Shi P, Tintle N, Wennberg M, Aslibekyan S, et al. Biomarkers of dietary Omega-6 fatty acids and incident cardiovascular disease and mortality. Circulation. 2019;139:2422–36. 30971107 10.1161/CIRCULATIONAHA.118.038908 PMC6582360 22. Engelen M Simbo SY Ruebush LE Thaden JJ Ten Have GAM Harrykissoon RI Zachria AJ Calder PC Pereira SL Deutz NEP Functional and metabolic effects of omega-3 polyunsaturated fatty acid supplementation and the role of β-hydroxy-β-methylbutyrate addition in chronic obstructive pulmonary disease: A randomized clinical trial Clin Nutr 2024 43 2263 78 10.1016/j.clnu.2024.08.004 39181037 Engelen M, Simbo SY, Ruebush LE, Thaden JJ, Ten Have GAM, Harrykissoon RI, Zachria AJ, Calder PC, Pereira SL, Deutz NEP. Functional and metabolic effects of omega-3 polyunsaturated fatty acid supplementation and the role of β-hydroxy-β-methylbutyrate addition in chronic obstructive pulmonary disease: A randomized clinical trial. Clin Nutr. 2024;43:2263–78. 39181037 10.1016/j.clnu.2024.08.004 23. Fekete M Szarvas Z Fazekas-Pongor V Lehoczki A Tarantini S Varga JT Effects of omega-3 supplementation on quality of life, nutritional status, inflammatory parameters, lipid profile, exercise tolerance and inhaled medications in chronic obstructive pulmonary disease Ann Palliat Med 2022 11 2819 29 10.21037/apm-22-254 35948470 Fekete M, Szarvas Z, Fazekas-Pongor V, Lehoczki A, Tarantini S, Varga JT. Effects of omega-3 supplementation on quality of life, nutritional status, inflammatory parameters, lipid profile, exercise tolerance and inhaled medications in chronic obstructive pulmonary disease. Ann Palliat Med. 2022;11:2819–29. 35948470 10.21037/apm-22-254 24. Huang Q Li S Wan J Nan W He B Association between ethylene oxide exposure and prevalence of COPD: evidence from NHANES 2013–2016 Sci Total Environ 2023 885 163871 10.1016/j.scitotenv.2023.163871 37149189 Huang Q, Li S, Wan J, Nan W, He B. Association between ethylene oxide exposure and prevalence of COPD: evidence from NHANES 2013–2016. Sci Total Environ. 2023;885:163871. 37149189 10.1016/j.scitotenv.2023.163871 25. Lan CC Su WL Yang MC Chen SY Wu YK Predictive role of neutrophil-percentage-to-albumin, neutrophil-to-lymphocyte and eosinophil-to-lymphocyte ratios for mortality in patients with COPD: evidence from NHANES 2011–2018 Respirology 2023 28 1136 46 10.1111/resp.14589 37655985 Lan CC, Su WL, Yang MC, Chen SY, Wu YK. Predictive role of neutrophil-percentage-to-albumin, neutrophil-to-lymphocyte and eosinophil-to-lymphocyte ratios for mortality in patients with COPD: evidence from NHANES 2011–2018. Respirology. 2023;28:1136–46. 37655985 10.1111/resp.14589 26. Cobb K Kenyon J Lu J Krieger B Perelas A Nana-Sinkam P Kim Y Rodriguez-Miguelez P COPD is associated with increased cardiovascular disease risk independent of phenotype Respirology 2024 29 1047 57 10.1111/resp.14799 39019777 PMC11570344 Cobb K, Kenyon J, Lu J, Krieger B, Perelas A, Nana-Sinkam P, Kim Y, Rodriguez-Miguelez P. COPD is associated with increased cardiovascular disease risk independent of phenotype. Respirology. 2024;29:1047–57. 39019777 10.1111/resp.14799 PMC11570344 27. Zhu M Chen A Epidemiological characteristics of asthma-COPD overlap, its association with all-cause mortality, and the mediating role of depressive symptoms: evidence from NHANES 2005–2018 BMC Public Health 2024 24 1423 10.1186/s12889-024-18911-1 38807148 PMC11134654 Zhu M, Chen A. Epidemiological characteristics of asthma-COPD overlap, its association with all-cause mortality, and the mediating role of depressive symptoms: evidence from NHANES 2005–2018. BMC Public Health. 2024;24:1423. 38807148 10.1186/s12889-024-18911-1 PMC11134654 28. Li WL Zhang NH Ge SW Xu G Dietary Omega-3 fatty acid intake and mortality in CKD population: A 1999–2014 NHANES analysis Am J Nephrol 2021 52 909 18 10.1159/000520027 34839290 Li WL, Zhang NH, Ge SW, Xu G. Dietary Omega-3 fatty acid intake and mortality in CKD population: A 1999–2014 NHANES analysis. Am J Nephrol. 2021;52:909–18. 34839290 10.1159/000520027 29. Chen H Leng X Liu S Zeng Z Huang F Huang R Zou Y Xu Y Association between dietary intake of omega-3 polyunsaturated fatty acids and all-cause and cardiovascular mortality among hypertensive adults: results from NHANES 1999–2018 Clin Nutr 2023 42 2434 42 10.1016/j.clnu.2023.09.011 37871484 Chen H, Leng X, Liu S, Zeng Z, Huang F, Huang R, Zou Y, Xu Y. Association between dietary intake of omega-3 polyunsaturated fatty acids and all-cause and cardiovascular mortality among hypertensive adults: results from NHANES 1999–2018. Clin Nutr. 2023;42:2434–42. 37871484 10.1016/j.clnu.2023.09.011 30. Xiao Y Quan Y Associations between dietary fatty acids intake and abdominal aortic calcification: a National population-based study Lipids Health Dis 2024 23 73 10.1186/s12944-024-02059-3 38461250 PMC10924990 Xiao Y, Quan Y. Associations between dietary fatty acids intake and abdominal aortic calcification: a National population-based study. Lipids Health Dis. 2024;23:73. 38461250 10.1186/s12944-024-02059-3 PMC10924990 31. Boutouyrie P Chowienczyk P Humphrey JD Mitchell GF Arterial stiffness and cardiovascular risk in hypertension Circ Res 2021 128 864 86 10.1161/CIRCRESAHA.121.318061 33793325 Boutouyrie P, Chowienczyk P, Humphrey JD, Mitchell GF. Arterial stiffness and cardiovascular risk in hypertension. Circ Res. 2021;128:864–86. 33793325 10.1161/CIRCRESAHA.121.318061 32. Third Report of the National Cholesterol Education Program (NCEP) Expert panel on detection, evaluation, and treatment of high blood cholesterol in adults (Adult treatment panel III) final report Circulation 2002 106 3143 421 10.1161/circ.106.25.3143 12485966 Third Report of the National Cholesterol Education Program (NCEP). Expert panel on detection, evaluation, and treatment of high blood cholesterol in adults (Adult treatment panel III) final report. Circulation. 2002;106:3143–421. 12485966 33. Duan M Zhao X Li S Miao G Bai L Zhang Q Yang W Zhao X Metabolic score for insulin resistance (METS-IR) predicts all-cause and cardiovascular mortality in the general population: evidence from NHANES 2001–2018 Cardiovasc Diabetol 2024 23 243 10.1186/s12933-024-02334-8 38987779 PMC11238348 Duan M, Zhao X, Li S, Miao G, Bai L, Zhang Q, Yang W, Zhao X. Metabolic score for insulin resistance (METS-IR) predicts all-cause and cardiovascular mortality in the general population: evidence from NHANES 2001–2018. Cardiovasc Diabetol. 2024;23:243. 38987779 10.1186/s12933-024-02334-8 PMC11238348 34. Levey AS Stevens LA Schmid CH Zhang YL Castro AF Feldman HI Kusek JW Eggers P Van Lente F Greene T Coresh J A new equation to estimate glomerular filtration rate Ann Intern Med 2009 150 604 12 10.7326/0003-4819-150-9-200905050-00006 19414839 PMC2763564 Levey AS, Stevens LA, Schmid CH, Zhang YL, Castro AF 3rd, Feldman HI, Kusek JW, Eggers P, Van Lente F, Greene T, Coresh J. A new equation to estimate glomerular filtration rate. Ann Intern Med. 2009;150:604–12. 19414839 10.7326/0003-4819-150-9-200905050-00006 PMC2763564 35. Dang K Wang X Hu J Zhang Y Cheng L Qi X Liu L Ming Z Tao X Li Y The association between triglyceride-glucose index and its combination with obesity indicators and cardiovascular disease: NHANES 2003–2018 Cardiovasc Diabetol 2024 23 8 10.1186/s12933-023-02115-9 38184598 PMC10771672 Dang K, Wang X, Hu J, Zhang Y, Cheng L, Qi X, Liu L, Ming Z, Tao X, Li Y. The association between triglyceride-glucose index and its combination with obesity indicators and cardiovascular disease: NHANES 2003–2018. Cardiovasc Diabetol. 2024;23:8. 38184598 10.1186/s12933-023-02115-9 PMC10771672 36. Zipf G, Chiappa M, Porter KS, Ostchega Y, Lewis BG, Dostal J. National health and nutrition examination survey: plan and operations, 1999–2010. Vital Health Stat 1 25078429 37. Carrico C Gennings C Wheeler DC Factor-Litvak P Characterization of weighted quantile sum regression for highly correlated data in a risk analysis setting J Agric Biol Environ Stat 2015 20 100 20 10.1007/s13253-014-0180-3 30505142 PMC6261506 Carrico C, Gennings C, Wheeler DC, Factor-Litvak P. Characterization of weighted quantile sum regression for highly correlated data in a risk analysis setting. J Agric Biol Environ Stat. 2015;20:100–20. 30505142 10.1007/s13253-014-0180-3 PMC6261506 38. Cao M Yang F McClements DJ Guo Y Liu R Chang M Wei W Jin J Wang X Impact of dietary n-6/n-3 fatty acid ratio of atherosclerosis risk: A review Prog Lipid Res 2024 95 101289 10.1016/j.plipres.2024.101289 38986846 Cao M, Yang F, McClements DJ, Guo Y, Liu R, Chang M, Wei W, Jin J, Wang X. Impact of dietary n-6/n-3 fatty acid ratio of atherosclerosis risk: A review. Prog Lipid Res. 2024;95:101289. 38986846 10.1016/j.plipres.2024.101289 39. Leung C Sin DD Asthma-COPD overlap: what are the important questions?? Chest 2022 161 330 44 10.1016/j.chest.2021.09.036 34626594 Leung C, Sin DD. Asthma-COPD overlap: what are the important questions?? Chest. 2022;161:330–44. 34626594 10.1016/j.chest.2021.09.036 40. Heefner A, Simovic T, Mize K, Rodriguez-Miguelez P. The role of nutrition in the development and management of chronic obstructive pulmonary disease. Nutrients 2024, 16. 10.3390/nu16081136 PMC11053888 38674827 41. Hooper L Thompson RL Harrison RA Summerbell CD Ness AR Moore HJ Worthington HV Durrington PN Higgins JP Capps NE Risks and benefits of Omega 3 fats for mortality, cardiovascular disease, and cancer: systematic review BMJ 2006 332 752 60 10.1136/bmj.38755.366331.2F 16565093 PMC1420708 Hooper L, Thompson RL, Harrison RA, Summerbell CD, Ness AR, Moore HJ, Worthington HV, Durrington PN, Higgins JP, Capps NE, et al. Risks and benefits of Omega 3 fats for mortality, cardiovascular disease, and cancer: systematic review. BMJ. 2006;332:752–60. 16565093 10.1136/bmj.38755.366331.2F PMC1420708 42. Shearer GC Walker RE An overview of the biologic effects of omega-6 Oxylipins in humans Prostaglandins Leukot Essent Fat Acids 2018 137 26 38 10.1016/j.plefa.2018.06.005 30293594 Shearer GC, Walker RE. An overview of the biologic effects of omega-6 Oxylipins in humans. Prostaglandins Leukot Essent Fat Acids. 2018;137:26–38. 10.1016/j.plefa.2018.06.005 30293594 43. Zhang Y, Sun Y, Yu Q, Song S, Brenna JT, Shen Y, Ye K. Higher ratio of plasma omega-6/omega-3 fatty acids is associated with greater risk of all-cause, cancer, and cardiovascular mortality: A population-based cohort study in UK biobank. Elife 2024, 12. 10.7554/eLife.90132 PMC10997328 38578269 44. de Batlle J Sauleda J Balcells E Gómez FP Méndez M Rodriguez E Barreiro E Ferrer JJ Romieu I Gea J Association between Ω3 and Ω6 fatty acid intakes and serum inflammatory markers in COPD J Nutr Biochem 2012 23 817 21 10.1016/j.jnutbio.2011.04.005 21889886 de Batlle J, Sauleda J, Balcells E, Gómez FP, Méndez M, Rodriguez E, Barreiro E, Ferrer JJ, Romieu I, Gea J, et al. Association between Ω3 and Ω6 fatty acid intakes and serum inflammatory markers in COPD. J Nutr Biochem. 2012;23:817–21. 21889886 10.1016/j.jnutbio.2011.04.005 45. Joris PJ Draijer R Fuchs D Mensink RP Effect of α-linolenic acid on vascular function and metabolic risk markers during the fasting and postprandial phase: A randomized placebo-controlled trial in untreated (pre-)hypertensive individuals Clin Nutr 2020 39 2413 9 10.1016/j.clnu.2019.11.032 31818531 Joris PJ, Draijer R, Fuchs D, Mensink RP. Effect of α-linolenic acid on vascular function and metabolic risk markers during the fasting and postprandial phase: A randomized placebo-controlled trial in untreated (pre-)hypertensive individuals. Clin Nutr. 2020;39:2413–9. 31818531 10.1016/j.clnu.2019.11.032 46. Djoussé L Rautaharju PM Hopkins PN Whitsel EA Arnett DK Eckfeldt JH Province MA Ellison RC Dietary linolenic acid and adjusted QT and JT intervals in the National heart, lung, and blood Institute family heart study J Am Coll Cardiol 2005 45 1716 22 10.1016/j.jacc.2005.01.060 15893192 Djoussé L, Rautaharju PM, Hopkins PN, Whitsel EA, Arnett DK, Eckfeldt JH, Province MA, Ellison RC. Dietary linolenic acid and adjusted QT and JT intervals in the National heart, lung, and blood Institute family heart study. J Am Coll Cardiol. 2005;45:1716–22. 15893192 10.1016/j.jacc.2005.01.060 47. Bertoni C, Abodi M, D’Oria V, Milani GP, Agostoni C, Mazzocchi A. Alpha-Linolenic acid and cardiovascular events: A narrative review. Int J Mol Sci 2023, 24. 10.3390/ijms241814319 PMC10531611 37762621 48. Bjermo H Iggman D Kullberg J Dahlman I Johansson L Persson L Berglund J Pulkki K Basu S Uusitupa M Effects of n-6 PUFAs compared with SFAs on liver fat, lipoproteins, and inflammation in abdominal obesity: a randomized controlled trial Am J Clin Nutr 2012 95 1003 12 10.3945/ajcn.111.030114 22492369 Bjermo H, Iggman D, Kullberg J, Dahlman I, Johansson L, Persson L, Berglund J, Pulkki K, Basu S, Uusitupa M, et al. Effects of n-6 PUFAs compared with SFAs on liver fat, lipoproteins, and inflammation in abdominal obesity: a randomized controlled trial. Am J Clin Nutr. 2012;95:1003–12. 22492369 10.3945/ajcn.111.030114 49. Singh S Arora RR Singh M Khosla S Eicosapentaenoic acid versus docosahexaenoic acid as options for vascular risk prevention: A fish story Am J Ther 2016 23 e905 910 10.1097/MJT.0000000000000165 25828517 Singh S, Arora RR, Singh M, Khosla S. Eicosapentaenoic acid versus docosahexaenoic acid as options for vascular risk prevention: A fish story. Am J Ther. 2016;23:e905–910. 25828517 10.1097/MJT.0000000000000165 50. Sherratt SCR Juliano RA Copland C Bhatt DL Libby P Mason RP EPA and DHA containing phospholipids have contrasting effects on membrane structure J Lipid Res 2021 62 100106 10.1016/j.jlr.2021.100106 34400132 PMC8430377 Sherratt SCR, Juliano RA, Copland C, Bhatt DL, Libby P, Mason RP. EPA and DHA containing phospholipids have contrasting effects on membrane structure. J Lipid Res. 2021;62:100106. 34400132 10.1016/j.jlr.2021.100106 PMC8430377 51. Sherratt SCR Mason RP Libby P Steg PG Bhatt DL Do patients benefit from omega-3 fatty acids? Cardiovasc Res 2024 119 2884 901 10.1093/cvr/cvad188 38252923 PMC10874279 Sherratt SCR, Mason RP, Libby P, Steg PG, Bhatt DL. Do patients benefit from omega-3 fatty acids? Cardiovasc Res. 2024;119:2884–901. 38252923 10.1093/cvr/cvad188 PMC10874279 52. Shah PL Herth FJ van Geffen WH Deslee G Slebos DJ Lung volume reduction for emphysema Lancet Respir Med 2017 5 147 56 10.1016/S2213-2600(16)30221-1 27693408 Shah PL, Herth FJ, van Geffen WH, Deslee G, Slebos DJ. Lung volume reduction for emphysema. Lancet Respir Med. 2017;5:147–56. 27693408 10.1016/S2213-2600(16)30221-1 53. Kim V Criner GJ Chronic bronchitis and chronic obstructive pulmonary disease Am J Respir Crit Care Med 2013 187 228 37 10.1164/rccm.201210-1843CI 23204254 PMC4951627 Kim V, Criner GJ. Chronic bronchitis and chronic obstructive pulmonary disease. Am J Respir Crit Care Med. 2013;187:228–37. 23204254 10.1164/rccm.201210-1843CI PMC4951627 54. Dey S Eapen MS Chia C Gaikwad AV Wark PAB Sohal SS Pathogenesis, clinical features of asthma COPD overlap, and therapeutic modalities Am J Physiol Lung Cell Mol Physiol 2022 322 L64 83 10.1152/ajplung.00121.2021 34668439 Dey S, Eapen MS, Chia C, Gaikwad AV, Wark PAB, Sohal SS. Pathogenesis, clinical features of asthma COPD overlap, and therapeutic modalities. Am J Physiol Lung Cell Mol Physiol. 2022;322:L64–83. 34668439 10.1152/ajplung.00121.2021 55. Dasgupta S Ghosh N Bhattacharyya P Roy Chowdhury S Chaudhury K Metabolomics of asthma, COPD, and asthma-COPD overlap: an overview Crit Rev Clin Lab Sci 2023 60 153 70 10.1080/10408363.2022.2140329 36420874 Dasgupta S, Ghosh N, Bhattacharyya P, Roy Chowdhury S, Chaudhury K. Metabolomics of asthma, COPD, and asthma-COPD overlap: an overview. Crit Rev Clin Lab Sci. 2023;60:153–70. 36420874 10.1080/10408363.2022.2140329 56. Tsou PL, Wu CJ. Sex-Dimorphic association of plasma fatty acids with cardiovascular fitness in young and Middle-Aged general adults: subsamples from NHANES 2003⁻2004. Nutrients 2018, 10. 10.3390/nu10101558 PMC6213878 30347828 57. Bakewell L Burdge GC Calder PC Polyunsaturated fatty acid concentrations in young men and women consuming their habitual diets Br J Nutr 2006 96 93 9 10.1079/BJN20061801 16869996 Bakewell L, Burdge GC, Calder PC. Polyunsaturated fatty acid concentrations in young men and women consuming their habitual diets. Br J Nutr. 2006;96:93–9. 16869996 10.1079/bjn20061801 58. Bae JH Lim H Lim S The potential cardiometabolic effects of Long-Chain ω-3 polyunsaturated fatty acids: recent updates and controversies Adv Nutr 2023 14 612 28 10.1016/j.advnut.2023.03.014 37031750 PMC10334139 Bae JH, Lim H, Lim S. The potential cardiometabolic effects of Long-Chain ω-3 polyunsaturated fatty acids: recent updates and controversies. Adv Nutr. 2023;14:612–28. 37031750 10.1016/j.advnut.2023.03.014 PMC10334139 59. Zheng T Zhao J Wang Y Liu W Wang Z Shang Y Zhang W Zhang Y Zhong M The limited effect of omega-3 polyunsaturated fatty acids on cardiovascular risk in patients with impaired glucose metabolism: a meta-analysis Clin Biochem 2014 47 369 77 10.1016/j.clinbiochem.2013.11.025 24342751 Zheng T, Zhao J, Wang Y, Liu W, Wang Z, Shang Y, Zhang W, Zhang Y, Zhong M. The limited effect of omega-3 polyunsaturated fatty acids on cardiovascular risk in patients with impaired glucose metabolism: a meta-analysis. Clin Biochem. 2014;47:369–77. 24342751 10.1016/j.clinbiochem.2013.11.025 ",
  "metadata": {
    "Title of this paper": "The limited effect of omega-3 polyunsaturated fatty acids on cardiovascular risk in patients with impaired glucose metabolism: a meta-analysis",
    "Journal it was published in:": "Nutrition & Metabolism",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487311/"
  }
}