{
  "title": "Paper_256",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12489026 PMC12489026.1 12489026 12489026 41034518 10.1038/s41598-025-20821-0 20821 1 Article A novel neonatal feeding tube with real time placement guidance Rao Anoop anooprao@stanford.edu 1 Jain Joanna 1 Green Gabrielle 1 Sutaria Saheel 2 Bucci Lorenzo 3 Burnett Daniel 3 1 https://ror.org/00f54p054 grid.168010.e 0000000419368956 Division of Neonatology, Department of Pediatrics, Lucile Packard Children’s Hospital, Stanford University, School of Medicine, 2 3 https://ror.org/0017y4h13 grid.430664.3 Theranova, LLC, 1 10 2025 2025 15 478255 34122 24 10 2024 17 9 2025 01 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Enteral nutrition with a nasogastric/orogastric feeding tube is essential in premature infants. These feeding tubes are placed either by clinical teams in the hospital setting or by parents at home. These tubes can be placed incorrectly or may dislodge after placement. Existing methods for confirming placement such as auscultation, testing gastric aspirates, and radiography have limitations, necessitating alternative solutions to improve safety and accuracy of placement. Here, we describe the clinical feasibility of a novel feeding tube with impedance and temperature sensors. The information received from the sensors is integrated to decipher real-time position, specifically using an airway misplacement algorithm (AMA) and gastric placement algorithm (GPA). We tested the feasibility and validity of this approach in a two-part clinical study involving premature neonates. In the Phase 1 study ( n n Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-20821-0. Subject terms Gastroenterology Paediatric research Translational research http://dx.doi.org/10.13039/100009633 Eunice Kennedy Shriver National Institute of Child Health and Human Development 2R44HD098938-02A 2R44HD098938-02A 2R44HD098938-02A 2R44HD098938-02A 2R44HD098938-02A 2R44HD098938-02A Rao Anoop Jain Joanna Green Gabrielle Sutaria Saheel Bucci Lorenzo Burnett Daniel pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Approximately 13 million infants are born preterm 1 2 Feeding tubes are placed by nurses or physicians in an in-patient setting and by parents when infants are at home. However, up to 59% of feeding tubes are misplaced in neonates, with 6% of these ending up in the upper esophagus, potentially leading to health risks such as aspiration or gastroesophageal reflux 3 4 5 6 7 Commonly employed methods to verify placement 8 9 10 9 10 11 12 13 14 15 Crucially, all existing confirmation techniques require advancement of the feeding tube to the full insertion depth which risks pleural effusion and pneumothorax with accidental airway insertion. This highlights the urgent need for methods to improve accuracy of tube placement and the ability to continuously monitor position. Here, we have built upon prior work 16 Methods Feeding tube design The Gravitas FT (Gravitas Medical, Inc, Berkeley, CA, USA) was designed for neonates and maintains the form factor of current standard disposable pediatric polyurethane FTs. These include features such as diameter, hole placement, fluid channel size, tip geometry and mechanical properties. FTs were made in two different sizes, 5 Fr and 8 Fr. The Gravitas FT is novel because it includes external impedance sensors and internal temperature sensors, designed to monitor the placement and position of the tube within the neonate’s upper gastrointestinal (GI) tract. The FT has a multi-lumen shaft with a central feeding lumen. Along the distal seven centimeters of the 5 Fr tube, there are five external impedance sensors and three temperature sensors. (Fig. 1  Fig. 1 Schematic representation of the multi-component 5 Fr feeding tube. The figure illustrates the various components of the 5Fr feeding tube, which is designed for safe and efficient patient use: (1) (2) (3) (4) (5) not shown (6) (7) (8) (9) (10) (11) Data from the sensors in the FT is transmitted to the monitoring device using independent wires for impedance and temperature data. These wires are embedded in secondary, non-fluid-contacting lumens within the FT wall to ensure that data transmission does not interfere with the tube’s feeding function. At the proximal end of the tube, there are two ENFit™ -style ports and an electric cable for attachment to a monitor (Fig. 2  Fig. 2 The monitor displays real-time feeding tube placement. Airway misplacement algorithm (AMA) The monitor guides the user to partially insert the tube only to a safety check depth, which corresponds to the location of the carina in the airway. This allows detection of any misplacement into the airway or curling of the tube into the nasopharynx before advancing the tube further, thereby preventing the risk of lung puncture. The AMA operates on the premise that airflow in the airway/nasopharynx causes greater temperature variations than in the upper gastrointestinal tract and that impedance in the airway/nasopharynx differs from that in the esophagus. The use of both temperature and impedance provides orthogonal redundancy in making this critical determination before the user is prompted to continue with insertion. Figure 3 Gastric placement algorithm (GPA) If safe to proceed per the AMA, the monitor will guide the user to insert to the full insertion depth guided by the GPA (Fig. 3 13 Figure 3  Fig. 3 A B Study design and data collection Ethical approval for the observational Phase 1 of this study with active guidance disabled enabled NCT05517707 NCT05914064 The study aimed to develop (Phase 1) and validate (Phase 2) Airway Misplacement (AMA) and Gastric Placement (GPA) algorithms to improve the accuracy and safety of FT placement. Inclusion criteria for the study are described in the Supplementary Table S1 The investigation was conducted in two sequential phases. Phase 1 was observational and focused on the placement of the FT, during which data was acquired and recorded by the Gravitas monitor but not displayed to the bedside team. Throughout this stage, temperature and impedance data were recorded to establish a foundational dataset. The primary goal of this phase was to gather data to evaluate and refine the AMA and the GPA. Following the development of the algorithm using data from Phase I, Phase 2 sought to assess its effectiveness in guiding placement. In this phase, the algorithm provided immediate feedback to the healthcare team by indicating the correctness of the FT’s placement in real time. In Phase I, feeding tubes were placed by the site PI (a neonatologist), neonatal nurse practitioners, and a group of bedside nurses who were specifically trained in the study procedures. In Phase II, placement was limited to the site PI and trained neonatal nurse practitioners. While feeding tubes are routinely placed by bedside nurses as part of standard clinical care, the study required consistent application of a novel device and protocol. With approximately 200 nurses in the unit, it was not practical to train all staff for a pilot study. Therefore, a smaller group of trained personnel was designated to ensure procedural consistency and data integrity. Phase 1 Here, we placed Gravitas FT in neonates and collected baseline temperature and impedance data during the process of placement. There was no real-time guidance offered during placement. First, the size (5Fr or 8Fr) and route (orogastric or nasogastric) of placement of FTs was chosen based on each patient’s size and clinical need. Next, the “final depth” of insertion was determined by the standard ICU protocol. The patient was placed either supine or with the head of the bed elevated as recommended by the clinical team. Then, the electrical cable from the FT was connected to the monitoring system and the patient’s weight was entered to calculate a “safety check depth”. At this depth, if misplaced, the tip of the FT is estimated to be in the airway but above the carina. The FT was inserted to the “safety check depth” and paused for 20 s. The purpose for this pause was to collect and analyze temperature and impedance data. Following this pause, the tube was advanced to the “final depth”. FT placement was confirmed via standard methods such as auscultation, pH testing of gastric aspirate, or X-ray if there was uncertainty. If placement was not able to be confirmed, the tube was retracted and a new insertion attempted; subjects who had two unconfirmed placements exited the study and received a standard feeding tube. This methodical approach allowed for an evaluation of standard placement techniques while providing data for the development of the airway misplacement (AMA) and gastric placement algorithms (GPA). Phase 2 In Phase 2, AMA and GPA were used to provide real-time guidance during FT insertion. Similar to Phase 1, the FT was inserted to a predetermined “safety check depth” and paused (for 20 s) to assess for airway misplacement or coiling in the pharynx. After the safety check, guidance was given either to continue advancing the tube to the final insertion depth or to retry placement if misplacement was detected. Additionally, in an attempt to provide a positive control of airway insertion, a colorimetric Kangaroo™ CO 2 After inserting the feeding tube (FT) to the final depth, the monitoring system evaluated its position in the stomach over a 10-second period. During this time, the GPA monitored the impedance across the distal and proximal electrodes. If fewer than three electrodes were detected in the stomach, indicating the FT was too shallow, the monitor prompted the user to advance the tube by 1 cm. Conversely, if four or more electrodes were detected in the stomach, indicating the FT was too deep, the monitor prompted the user to withdraw the tube by 1 cm. This process was repeated until the monitor confirmed that the FT was at the correct depth within the stomach. The final FT placement was verified using established methods (e.g., auscultation, pH testing of gastric aspirate, and/or X-ray). The FTs remained connected to the monitor to capture data for up to 72 h following insertion, during which time the device continuously monitored the FT for movement. Any dislodgements and subsequent active adjustments were noted and compared with recorded impedance data. Data capture and storage Temperature and impedance measurements (along with other supporting monitor data) were continuously recorded and stored in nonvolatile memory in the monitor and then downloaded after subjects exited the study. The data were analyzed using Microsoft Excel (version 365, Microsoft Corporation) and Python (version 3.11, Python Software Foundation). Depth and timestamp metadata were used to identify the appropriate temperature/impedance samples for evaluating the AMA and GPA. Results In Phase I, a total of 24 patients were consented. Eight of them were able to fully feed orally and did not need a new FT. Sixteen patients were successfully enrolled in Phase I. In Phase 2 a total of 22 patients were consented, 12 were able to feed orally and did not need a new feeding tube placed. Ten patients were successfully enrolled in Phase 2. Demographic details and participant flow diagram of the 16 patients enrolled in Phase 1 and the 10 patients enrolled in Phase 2 are included in Supplementary Tables S2 and S3. Throughout the study, there were no device-related adverse events reported. Phase I results In Phase I, A total of 20 attempts at feeding tube (FT) insertion were made across these 16 participants, with 17 attempts using 5Fr tubes and the remaining 3 employing 8Fr tubes. In four patients, additional insertion attempts were necessitated: two instances were due to tubes being kinked and remaining either in the esophagus or nasopharynx (Subjects 1 and 3), one curled in the esophagus (Subject 5), and one patient (Subject 10) required further efforts to properly position the tube into the stomach due to inability to auscultate/aspirate. For six of the patients, X-ray imaging was utilized to confirm the placement of the tubes; of these, five were successfully placed in the stomach, while one revealed a kink in the esophagus for Subject 5, as depicted in Fig. 4  Fig. 4 Feeding Tube misplacement (top row) and correct placement on second attempt (bottom row). The top row shows misplacement of the feeding tube, with the tube curled in the esophagus, as confirmed by X-ray (left) and depicted both in the schematic (middle) and on the bedside monitor (right). The bottom row illustrates the correct placement on the second attempt, with the tube successfully positioned in the stomach, as confirmed by X-ray (left) and similarly depicted in the schematic (middle) and on the bedside monitor (right). Retrospective data review demonstrated that the AMA was able to detect 100% of the misplacements that occurred at or before the safety check depth(4/4). Two of these misplacements occurred in Subject 1 and two occurred in Subject 3. The tube that was found to be curled in the esophagus (Subject 5) is presumed to have done so past the safety check based on impedance values and imaging. The first insertion attempt for Subject 10 passed the AMA (indicating it was not in the nasopharynx) and passed the GPA, even though placement could not be verified via auscultation/aspiration. Therefore, this attempt was not considered to be a misplacement. The GPA was also able to identify proper gastric placement in 100% of cases (14/14) in which stomach placement was confirmed via standard of care methods and there were no device-related adverse events. The FTs for the four attempts for subjects 1 and 3 are presumed to have never reached the stomach because they failed the AMA, and therefore the GPA was moot. Subject 5 in the Phase 1 study had an initial unsuccessful gastric insertion attempt where the FT curled back in the esophagus, followed by a successful gastric placement on the second attempt (Fig. 4 The median insertion time for successful placements in the unguided Phase I was 73 s, inclusive of a brief pause to collect data for the safety check. Phase 2 results In Phase II, A total of 11 attempts at feeding tube (FT) insertion were made across the 10 participants, with all 11 attempts using 5Fr tubes. All feeding tube insertions utilized real-time guidance from the monitor which successfully detected one instance of misplacement (1/11) by the AMA. Real-time feedback allowed for prompt user notification, tube retraction, and correct gastric positioning. The remaining placements (10/11) passed both the AMA and GPA check and position was confirmed via standard-of-care. No X-rays were specifically ordered for placement confirmation, but two patients received X-rays for unrelated reasons and the FT was clearly shown at correct gastric depth in both instances. Across all cases, the GPA identified correct final placement in 100% of cases (10/10) and there were no instances of device-related adverse events. The time required to identify a misplaced FT and replace it varied substantially between the unguided Phase 1 and the guided Phase 2. In Phase 1, identifying, correcting, and confirming FT placement after initial misplacement, such as curling in the nasopharynx or esophagus, took an average of over 54 min ( n 17 The median time to confirm placement for successful placements in the guided Phase II was 149 s. Discussion In this clinical study, we have successfully demonstrated safe placement and real-time monitoring of FT position in premature neonates. Impedance and temperature measurements were used simultaneously, to guide the user in real-time, to ensure optimal placement of the FT. This is significant because it addresses several shortcomings of the current methods used for confirming FT placement. This methodology circumvents the challenges posed by use of acid suppressing medications, which can invalidate pH-based verification, and overcomes the limitations of obtaining gastric aspirate. The algorithm’s efficacy in accurately determining incorrect placement and correct intragastric position of the FT utilizing the orthogonally redundant modalities of temperature and impedance monitoring has been validated across all insertions in both Phase I and II (26/26), utilizing two common sizes of feeding tubes (5Fr and 8Fr), and confirmed against the standard of care. This technology can reduce the need for serial x-rays to confirm placement, saving time and resources as well as limiting radiation exposure for neonates. This system’s early detection capability is particularly important as it helps prevent lung punctures by identifying airway misplacement before full insertion. The real-time monitoring feature further ensures that clinicians are alerted to any misplacement quickly, improving patient safety and reducing procedural delays. Moreover, the Gravitas system has received 510(k) clearance from the FDA, indicating its utility for real-time FT placement and continuous monitoring for neonates 18 The study acknowledges specific limitations. The inclusion of electronic circuitry in the feeding tube’s design precludes its use in patients who may require immediate MRI imaging. Additionally, the small sample size highlights the need for future studies to further validate both the placement and dislodgement detection algorithms, as well as to quantify the time-saving benefits of using the Gravitas system. Incidentally, the cohort in Phase II had a higher average age than the cohort in Phase I. Although we believe that the difference in the age/size of the infants is less likely to impact placement and verification metrics, future studies will consider a larger sample size. Additionally, the time to placement was longer in Phase II; this is because the reported Phase II time is the time to confirm stomach placement, which included using the colorimetric Kangaroo™ CO2 detector at the safety check and responding to monitor guidance to further insert/retract by 1 cm at a time when applicable. In conclusion, this study presents a method for ensuring safe placement and monitoring of feeding tubes. Future research will aim to expand the system’s impedance and temperature measurements to include real-time monitoring of gastroesophageal reflux and gastric emptying. This is important because preterm infants are particularly susceptible to feeding intolerance, reflux, and delayed gastric emptying, conditions that complicate recovery and nutritional management. Incorporating real-time monitoring of these functions could provide clinicians with early detection capabilities, allowing for timely interventions to improve feeding tolerance and overall outcomes. Expanding the Gravitas system’s capabilities in this way would enhance its value as a comprehensive tool in neonatal care, addressing not only safe tube placement but also key aspects of feeding management. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements This work was supported by a grant from the NIH 2R44HD098938-02 A to Theranova/Gravitas and Stanford. Author contributions All authors have endorsed the final manuscript and committed to full accountability for the work, ensuring any accuracy or integrity issues are addressed. A.R. oversaw the conduct of the study. A.R. and S.S. and contributed to study design, data analysis, interpretation, and manuscript drafting and critical revisions. J.J. and G.G. were pivotal in enrollment and data collection and also critically refining the manuscript. L.B. helped with data analysis. Data availability The data that support the findings of this study are available from the corresponding author upon reasonable request. Declarations Competing interests AR, JJ, and GG declare no competing interests. LB and DB are employees of Theranova. SS is an employee of Gravitas Inc. No other competing interests were reported. Additionally, the NIH was not involved in any aspect of study design, data collection, analysis, interpretation of the data, writing of the report, and the decision to submit the manuscript for publication. References 1. Ohuma EO National, regional, and global estimates of preterm birth in 2020, with trends from 2010: a systematic analysis Lancet 2023 402 1261 1271 10.1016/S0140-6736(23)00878-4 37805217 Ohuma, E. O. et al. National, regional, and global estimates of preterm birth in 2020, with trends from 2010: a systematic analysis. Lancet 402 37805217 10.1016/S0140-6736(23)00878-4 2. Purisch SE Gyamfi-Bannerman C Epidemiology of preterm birth Semin Perinatol. 2017 41 387 391 10.1053/j.semperi.2017.07.009 28865982 Purisch, S. E. & Gyamfi-Bannerman, C. Epidemiology of preterm birth. Semin Perinatol. 41 28865982 10.1053/j.semperi.2017.07.009 3. Quandt D Schraner T Bucher U Arlettaz Mieth, R. Malposition of feeding tubes in neonates: is it an issue? J. Pediatr. Gastroenterol. Nutr. 2009 48 608 611 10.1097/MPG.0b013e31818c52a8 19367180 Quandt, D., Schraner, T. & Bucher, U. Arlettaz Mieth, R. Malposition of feeding tubes in neonates: is it an issue? J. Pediatr. Gastroenterol. Nutr. 48 19367180 10.1097/MPG.0b013e31818c52a8 4. Yong SB Ma JS Chen FS Chung MY Yang KD Nasogastric tube placement and esophageal perforation in extremely low birth weight infants Pediatr. Neonatol 2016 57 427 430 10.1016/j.pedneo.2013.10.011 24429355 Yong, S. B., Ma, J. S., Chen, F. S., Chung, M. Y. & Yang, K. D. Nasogastric tube placement and esophageal perforation in extremely low birth weight infants. Pediatr. Neonatol 57 24429355 10.1016/j.pedneo.2013.10.011 5. Mileder, L. P. et al. Esophageal Perforation with Unilateral Fluidothorax Caused by Nasogastric Tube. Case Rep. Pediatr. 10.1155/2016/4103734 PMC5075597 27803831 6. Glüer S Schmidt AI Jesch NK Ure BM Laparoscopic repair of neonatal gastric perforation J. Pediatr. Surg. 2006 41 e57 e58 10.1016/j.jpedsurg.2005.10.061 16410092 Glüer, S., Schmidt, A. I., Jesch, N. K. & Ure, B. M. Laparoscopic repair of neonatal gastric perforation. J. Pediatr. Surg. 41 16410092 10.1016/j.jpedsurg.2005.10.061 7. Creel AM Winkler MK Oral and nasal enteral tube placement errors and complications in a pediatric intensive care unit Pediatr. Crit. Care Med. 2007 8 161 164 10.1097/01.PCC.0000257035.54831.26 17273117 Creel, A. M. & Winkler, M. K. Oral and nasal enteral tube placement errors and complications in a pediatric intensive care unit. Pediatr. Crit. Care Med. 8 17273117 10.1097/01.PCC.0000257035.54831.26 8. Northington L Evaluation of methods used to verify nasogastric feeding tube placement in hospitalized infants and children - A follow-up study J. Pediatr. Nurs. 2022 63 72 77 10.1016/j.pedn.2021.10.018 34763985 Northington, L. et al. Evaluation of methods used to verify nasogastric feeding tube placement in hospitalized infants and children - A follow-up study. J. Pediatr. Nurs. 63 34763985 10.1016/j.pedn.2021.10.018 9. Nyqvist KH Sorell A Ewald U Litmus tests for verification of feeding tube location in infants: evaluation of their clinical use J. Clin. Nurs. 2005 14 486 495 10.1111/j.1365-2702.2004.01074.x 15807756 Nyqvist, K. H., Sorell, A. & Ewald, U. Litmus tests for verification of feeding tube location in infants: evaluation of their clinical use. J. Clin. Nurs. 14 15807756 10.1111/j.1365-2702.2004.01074.x 10. Irving SY Pediatric nasogastric tube placement and verification: best practice recommendations from the NOVEL project Nutr. Clin. Pract. 2018 33 921 927 10.1002/ncp.10189 30187517 Irving, S. Y. et al. Pediatric nasogastric tube placement and verification: best practice recommendations from the NOVEL project. Nutr. Clin. Pract. 33 30187517 10.1002/ncp.10189 11. Makri T Radiation risk assessment in neonatal radiographic examinations of the chest and abdomen: a clinical and Monte Carlo dosimetry study Phys. Med. Biol. 2006 51 5023 5033 10.1088/0031-9155/51/19/019 16985285 Makri, T. et al. Radiation risk assessment in neonatal radiographic examinations of the chest and abdomen: a clinical and Monte Carlo dosimetry study. Phys. Med. Biol. 51 16985285 10.1088/0031-9155/51/19/019 12. Atalay YO Bedside ultrasonography for the confirmation of gastric tube placement in the neonate Saudi J. Anaesth. 2019 13 23 27 10.4103/sja.SJA_413_18 30692884 PMC6329247 Atalay, Y. O. et al. Bedside ultrasonography for the confirmation of gastric tube placement in the neonate. Saudi J. Anaesth. 13 30692884 10.4103/sja.SJA_413_18 PMC6329247 13. Cirgin Ellett ML Predicting the insertion length for gastric tube placement in neonates J. Obstet. Gynecol. Neonatal Nurs. 2011 40 412 421 10.1111/j.1552-6909.2011.01255.x 21639864 PMC3140585 Cirgin Ellett, M. L. et al. Predicting the insertion length for gastric tube placement in neonates. J. Obstet. Gynecol. Neonatal Nurs. 40 21639864 10.1111/j.1552-6909.2011.01255.x PMC3140585 14. Beckstrand J Cirgin Ellett ML McDaniel A Predicting internal distance to the stomach for positioning nasogastric and orogastric feeding tubes in children J. Adv. Nurs. 2007 59 274 289 10.1111/j.1365-2648.2007.04296.x 17590213 Beckstrand, J., Cirgin Ellett, M. L. & McDaniel, A. Predicting internal distance to the stomach for positioning nasogastric and orogastric feeding tubes in children. J. Adv. Nurs. 59 17590213 10.1111/j.1365-2648.2007.04296.x 15. van Zanten HA Snel-Maat HE Wielenga JM Prediction of nasogastric tube position in neonates admitted on a NICU; a comparison of two methods J. Neonatal Nurs. 2024 30 685 689 10.1016/j.jnn.2024.02.012 van Zanten, H. A., Snel-Maat, H. E. & Wielenga, J. M. Prediction of nasogastric tube position in neonates admitted on a NICU; a comparison of two methods. J. Neonatal Nurs. 30 16. Sorrentino TA Sutaria S Butler P Burnett D Bennett-Guerrero E Evaluation of a novel platform for placement confirmation of enteral feeding tubes in adults Nutrition 2023 115 112144 10.1016/j.nut.2023.112144 37506554 Sorrentino, T. A., Sutaria, S., Butler, P., Burnett, D. & Bennett-Guerrero, E. Evaluation of a novel platform for placement confirmation of enteral feeding tubes in adults. Nutrition 115 37506554 10.1016/j.nut.2023.112144 17. Meesters NJ Quantification of stress exposure in very preterm infants: development of the NeO-stress score Early Hum. Dev. 2023 176 105696 10.1016/j.earlhumdev.2022.105696 36495706 Meesters, N. J. et al. Quantification of stress exposure in very preterm infants: development of the NeO-stress score. Early Hum. Dev. 176 36495706 10.1016/j.earlhumdev.2022.105696 18. U.S. Food and Drug Administration. 510(k) Premarket Notification. (2024). ",
  "metadata": {
    "Title of this paper": "Quantification of stress exposure in very preterm infants: development of the NeO-stress score",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489026/"
  }
}