{
  "title": "Paper_935",
  "abstract": "pmc Front Cardiovasc Med Front Cardiovasc Med 2863 fcvm Front. Cardiovasc. Med. Frontiers in Cardiovascular Medicine 2297-055X Frontiers Media SA PMC12477126 PMC12477126.1 12477126 12477126 41030478 10.3389/fcvm.2025.1593824 1 Cardiovascular Medicine Original Research L-shaped association of low-density lipoprotein cholesterol with all-cause and cardiovascular mortality in cancer survivors: a population-based cohort study Hou Bowen  1  2  3  † Hu Yali  1  2  3  † Wang Hairong  4  † Zhang Huang  1  2  3 Gao Xingyu  1  2  3 Cui Ying  1  2  3 Zhao Yilin  1  2  3 Xie Jing  1  2  3 Yu Xiaomei  1  2  3 Wang Lang  1  2  3 Jiang Hong  1  2  3 Zhu Lihua  1  2  3 * 1 Department of Cardiology, Renmin Hospital of Wuhan University Wuhan China 2 Cardiovascular Research Institute of Wuhan University Wuhan China 3 Hubei Key Laboratory of Cardiology Wuhan China 4 Department of Cardiology, Zhongnan Hospital of Wuhan University Wuhan China Edited by: Paola Patrignani Reviewed by: Pietro Minuz Stefania Tacconelli * Correspondence: zhulh@whu.edu.cn  † These authors have contributed equally to this work 15 9 2025 2025 12 480653 1593824 14 3 2025 30 8 2025 15 09 2025 30 09 2025 01 10 2025 © 2025 Hou, Hu, Wang, Zhang, Gao, Cui, Zhao, Xie, Yu, Wang, Jiang and Zhu. 2025 Hou, Hu, Wang, Zhang, Gao, Cui, Zhao, Xie, Yu, Wang, Jiang and Zhu https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) Objectives To evaluate the association between LDL-C levels and all-cause, cardiovascular, and cancer mortality in cancer survivors, and to identify the LDL-C level associated with the lowest mortality risk, using data from NHANES 1999–2018. Study design  Population-based cohort study. Methods  We analyzed 1,958 U.S. cancer survivors from the National Health and Nutrition Examination Survey (NHANES) 1999–2018. We used Cox and Fine-Gray model to compare mortality risks across LDL-C quartiles, combined with restricted cubic spline analysis to assess nonlinear relationships, and piecewise linear regression to identify LDL-C inflection points. Results  During a median follow-up of 7.3 years (681 deaths were recorded), we observed a nonlinear association between LDL-C levels and all-cause/cardiovascular mortality, wherein low levels of LDL-C were associated with an increased mortality risk. The identified optimal LDL-C thresholds were 119 mg/dl for all-cause mortality and 124 mg/dl for cardiovascular mortality. Age and CVD history influenced the association, with a negative linear relationship between LDL-C and all-cause mortality observed in individuals aged under 65 years and those in the primary CVD prevention. Conclusions  Cancer survivors with low LDL-C levels were correlated with elevated all-cause and CVD mortality risks, particularly in younger patients and those without prior CVD. cancer survivors LDL-C levels population study mortality NHANES National Natural Science Foundation of China 82170455 Wuhan University Renmin Hospital Cross-Innovation Talent Program JCRCYG-2022-004 The author(s) declare that financial support was received for the research and/or publication of this article. This work was supported by National Natural Science Foundation of China (Grant No. 82170455) and Wuhan University Renmin Hospital Cross-Innovation Talent Program (JCRCYG-2022-004). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Cardio-Oncology 1 Introduction With population aging and advances in cancer screening, early detection, and therapeutic strategies, the prognosis and long-term survival of cancer patients have substantially improved, resulting in a rapid increase in the number of cancer survivors ( 1 2 Despite its clinical importance, current guidelines provide no specific recommendations for LDL-C management in cancer survivors. Previous studies have mainly focused on the relationship between LDL-C levels and cancer-related prognosis during the treatment period in patients with specific cancer types, rather than in long-term survivors ( 3 4 3 5 6 9 10 4 11 To address these uncertainties, we conducted a population-based study using data from the National Health and Nutrition Examination Survey (NHANES) 1999–2018 to evaluate the association of LDL-C levels with all-cause, cardiovascular, and cancer mortality among cancer survivors. We also aimed to identify the LDL-C level associated with the lowest mortality risk. 2 Methods 2.1 Study design We conducted a population-based cohort study using NHANES 1999–2018. The NHANES was approved by the National Center for Health Statistics (NCHS) Ethics Review Board (ERB), and all NHANES participants provided written informed consent. Detailed information about the study design and setting can be obtained from the NHANES website ( https://wwwn.cdc.gov/nchs/nhanes/ 2.2 Population and outcomes Of the 136,544 individuals screened, 31,083 completed fasting serum lipid tests. These participants were asked: “Have you ever been told by a doctor or other health professional that you had cancer or a malignancy of any kind?” Those who responded “yes” were classified as cancer survivors, resulting in 2,040 individuals ( 12 n n n Supplementary Figure S1 Linkage to National Death Index (NDI) mortality data included information on mortality status, follow-up time, and leading causes of death. Follow-up commenced from the examination in the Mobile Examination Center (MEC) and continued until death or December 31, 2019. Cause-specific mortality was classified according to the 10th revision of the International Statistical Classification of Diseases and Related Health Problems (ICD–10), including diseases of the heart (I00–I09, I11, I13, I20–I51) and malignant neoplasms (C00–C97). 2.3 LDL measurements In [ L D L − c h o l e s t e r o l ] = [ t o t a l c h o l e s t e r o l ] – [ H D L − c h o l e s t e r o l ] – [ t r i g l y c e r i d e s / 5 ] [ t r i g l y c e r i d e s / 5 ] Supplementary Materials -Covariates. 2.4 Statistical analyses Participants were grouped based on the quartiles of LDL-C levels. We fitted adjusted Cox regression models and Fine-Gray models to examine the association of LDL-C levels with all-cause and cause-specific mortality. The Fine-Gray model accounted for competing risks by considering other causes of death when analyzing a specific cause of mortality. Restricted cubic spline curves with three knots at the 10th, 50th, and 90th percentiles of LDL-C were used to assess nonlinearity. If the relationship proved nonlinear, we conducted a threshold effect analysis using piecewise linear regression to identify LDL-C inflection points, and applied a two-segment Cox proportional hazards model on either side of these inflection points. The atherosclerotic cardiovascular disease (ASCVD) risk was assessed using the American Heart Association/American College of Cardiology (AHA/ACC) risk estimation tool, based on age, diabetes status, total cholesterol, high-density lipoprotein cholesterol (HDL-C), systolic blood pressure, treatment for hypertension, smoking status, and race. Individuals with a history of ASCVD or LDL-C levels ≥190 mg/dl were directly classified into the high-risk group, while those with LDL-C levels <70 mg/dl were categorized separately as the low LDL-C group. Stratified analyses were performed based on gender, age (<65 years or ≥65 years), race (White or non-White), BMI (<25, 25–30, or ≥30.00), smoking status (current smoker or non-current smoker), cardiovascular diseases, diabetes, hypertension, statin use. Interactions between LDL-C groups defined by inflection points and subgroup variables were assessed using the Cox model. The fully adjusted models accounted for gender, age, race, education level, smoking status, body mass index, systolic blood pressure, eGFR, cardiovascular disease, diabetes, statin use and cancer type. Multiple imputation using the classification and regression trees (CART) method was performed for variables with missing values, including education level, smoking and drinking status, systolic blood pressure, eGFR, BMI, HbA1c, cardiovascular diseases, hypertension, chronic kidney disease, and statin use. The distributions before and after imputation were comparable. The number and percentage of missing data are provided in Supplementary Figure S2 p https://wwwn.cdc.gov/nchs/nhanes/tutorials Supplementary Materials —Weights in NHANES 2.5 Sensitivity analyses We conducted extensive sensitivity analyses to ensure the robustness of our results. First, we used penalized smoothing splines as an alternative to the restricted cubic splines method. Second, we excluded participants with chronic diseases, including diabetes, cardiovascular disease, and chronic kidney disease. Third, we excluded events occurring in the first, second, and third years of follow-up to minimize reverse causality. Fourth, we analyzed data from NHANES 1999–2014 to ensure that each participant had sufficient follow-up time. Fifth, we excluded individuals with missing data and repeated the primary analysis. Sixth, we excluded cancer survivors whose interval between cancer diagnosis and baseline LDL-C measurement was less than three years, aiming to minimize the potential influence of cancer and its treatments, and assessed the robustness of results in mid- to long-term survivors. 3 Result Among the 1,958 cancer survivors included in the analysis, 916 (representing a weighted 41%) were male, with a median age of 65 years (IQR 53–75). Most participants were non-Hispanic White (1,378; weighted 86%). The median LDL-C level was 113 mg/dl (IQR 90–138). Over a median follow-up of 7.3 years (range 0.2–20.7), 681 deaths (34.8%) occurred, including 206 from cancer and 175 from cardiovascular causes. The median age at most recent cancer diagnosis was 54 years (IQR 40–65). The majority of survivors had only one cancer (90%), while 10.2% had two or more cancers. The median time from the most recent cancer diagnosis to baseline was 7 years (IQR 3–15). Table 1 Table 1 Characteristics of U.S. cancer survivors, by LDL-C quartiles, NHANES, 1999–2018. Characteristic  N  a LDL-C Group p c Overall, N b Q1(<90 mg/dl), N b Q2 (90–113 mg/dl), N b Q3 (113–138 mg/dl), N b Q4(≥138 mg/dl), N b Gender 1,958 <0.001  Male 916 (41%) 306 (50%) 227 (40%) 221 (44%) 162 (31%)  Female 1,042 (59%) 246 (50%) 260 (60%) 271 (56%) 265 (69%) Age(years) 1,958 65.0 (53.0, 75.0) 69.0 (59.0, 77.0) 63.0 (50.0, 75.0) 63.0 (54.0, 74.0) 62.0 (53.0, 72.0) <0.001 Race 1,958 0.057  Non-Hispanic White 1,378 (86%) 383 (83%) 343 (85%) 347 (87%) 305 (89%)  Non-Hispanic Black 245 (5.5%) 79 (7.2%) 61 (5.2%) 49 (4.2%) 56 (5.3%)  Mexican American 149 (2.6%) 32 (2.1%) 39 (3.2%) 47 (3.0%) 31 (2.1%)  Other Hispanic 102 (2.8%) 30 (2.9%) 26 (3.5%) 29 (3.2%) 17 (1.6%)  Other Race 84 (3.2%) 28 (4.7%) 18 (3.3%) 20 (2.4%) 18 (2.2%) Education level 1,955 0.4  Less than high school 445 (15%) 145 (18%) 104 (12%) 114 (16%) 82 (13%)  High school or equivalent 472 (25%) 134 (25%) 118 (25%) 114 (23%) 106 (25%)  College or above 1,038 (61%) 272 (57%) 265 (62%) 263 (62%) 238 (62%) BMI(kg/m 2 1,919 27.41 (24.07, 32.21) 27.90 (24.02, 33.08) 27.39 (23.68, 32.10) 27.80 (24.20, 32.94) 26.80 (24.13, 31.53) 0.3 Systolic Blood Pressure(mmHg) 1,896 124.7 (112.7, 138.7) 124.7 (113.3, 140.0) 124.7 (112.7, 138.7) 124.7 (112.7, 137.3) 124.0 (113.3, 136.7) 0.9 LDL-C(mg/dl) 1,958 113 (90, 138) 77 (66, 84) 102 (95, 109) 125 (119, 132) 156 (147, 171) <0.001 HDL-C(mg/dl) 1,958 53 (43, 65) 51 (41, 64) 55 (45, 69) 53 (44, 63) 53 (45, 66) 0.067 TG(mg/dl) 1,958 112 (78, 159) 97 (71, 152) 106 (74, 157) 107 (78, 154) 134 (93, 176) <0.001 TC(mg/dl) 1,958 195 (170, 223) 154 (137, 166) 183 (171, 195) 204 (194, 215) 244 (228, 262) <0.001 eGFR[ml/(min*1.73^m 2 1,948 85.50 (70.01, 98.01) 80.73 (64.21, 92.72) 87.72 (73.01, 98.92) 85.66 (71.82, 96.69) 88.75 (74.22, 100.75) <0.001 HbA1c(%) 1,957 5.60 (5.30, 5.90) 5.70 (5.40, 6.20) 5.50 (5.20, 5.90) 5.50 (5.30, 5.80) 5.50 (5.30, 5.80) <0.001 Smoker 1,955 0.5  Current smokers 294 (16%) 82 (15%) 69 (15%) 73 (17%) 70 (18%)  Former smokers 774 (37%) 239 (41%) 198 (38%) 181 (37%) 156 (33%)  Non-smokers 887 (47%) 230 (45%) 219 (48%) 237 (46%) 201 (49%) Drinker 1,860 >0.9  Heavy drinkers 209 (12%) 59 (11%) 44 (11%) 55 (14%) 51 (13%)  Moderate drinkers 1,031 (59%) 286 (59%) 257 (59%) 259 (58%) 229 (60%)  Non-drinkers 620 (29%) 178 (29%) 156 (30%) 152 (28%) 134 (27%) Diabetes 1,958 <0.001  Yes 475 (19%) 203 (31%) 109 (18%) 87 (15%) 76 (14%)  No 1,483 (81%) 349 (69%) 378 (82%) 405 (85%) 351 (86%) Cardiovascular Disease 1,945 <0.001  Yes 426 (17%) 179 (29%) 97 (16%) 81 (14%) 69 (11%)  No 1,519 (83%) 369 (71%) 388 (84%) 407 (86%) 355 (89%) Hypertension 1,933 <0.001  Yes 1,257 (59%) 401 (72%) 300 (57%) 287 (52%) 269 (55%)  No 676 (41%) 145 (28%) 182 (43%) 197 (48%) 152 (45%) Chronic Kidney Disease 1,944 <0.001  Yes 433 (16%) 163 (24%) 101 (15%) 99 (15%) 70 (11%)  No 1,511 (84%) 384 (76%) 380 (85%) 392 (85%) 355 (89%) Statin Use 1,914 <0.001  Yes 721 (34%) 343 (62%) 194 (38%) 120 (23%) 64 (14%)  No 1,193 (66%) 204 (38%) 275 (62%) 361 (77%) 353 (86%) Age at most recent cancer diagnosis (years) 1,940 54 (40, 65) 58 (45, 68) 53 (37, 65) 54 (40, 64) 52 (38, 63) 0.007 Number of cancer types 1,958 0.041  1 1,751 (90%) 486 (89%) 441 (92%) 442 (89%) 382 (89%)  2 185 (9.2%) 55 (9.2%) 42 (7.0%) 44 (9.7%) 44 (11%) ≥ 3 22 (1.0%) 11 (2.2%) 4 (0.6%) 6(1.1%) 1(0.3%) Time since most recent cancer diagnosis to baseline (years) 1,940 7 (3, 15) 7 (3, 16) 6 (2, 14) 6 (3, 15) 7 (3, 13) 0.6  a N  b median (interquartile range, IQR) for continuous; n  c Pearson's X 2 3.1 LDL-C and all-cause mortality in cancer survivors In overall cancer survivors, a nonlinear association was observed between LDL-C levels and all-cause mortality ( P P Figure 1A Supplementary Figure S3 Figure 1 Adjusted hazard ratios and 95% confidence intervals for all-cause mortality according to levels of LDL-C on a continuous scale. (A) (B) (C) Three graphs illustrate the relationship between LDL-C levels and hazard ratios for different groups. Graph A shows all-cause mortality, Graph B shows secondary prevention of CVD, and Graph C shows primary prevention of CVD. Each graph plots hazard ratio and confidence interval against LDL-C levels, highlighting a critical point at 119 mg/dL. P-values for overall and nonlinear trends are presented in each graph. Density curves depict distribution, with detailed hazard ratio per standard deviation provided. The graphs emphasize varying impacts of LDL-C on health outcomes. A similar pattern was observed in the secondary prevention group (cancer survivors with known cardiovascular diseases) ( Figure 1B P P Figure 1C P P 3.2 LDL-C and cardiovascular, cancer mortality in cancer survivors A nonlinear association was also observed between LDL-C levels and cardiovascular mortality in cancer survivors ( Figure 2A P P Supplementary Figure S3 Figure 2B Supplementary Figure S3 Figure 2 Adjusted hazard ratios for cardiovascular and cancer mortality according to levels of LDL-C on a continuous scale. (A) (B) Graph A shows the relationship between LDL-C levels and cardiovascular mortality. The hazard ratio peaks at 124 mg/dL with significant results indicated. Graph B depicts LDL-C levels against cancer mortality, peaking at 111 mg/dL, showing no significant association. Both graphs plot hazard ratios and density against LDL-C levels with shaded confidence intervals. We further compared the cumulative incidence of cardiovascular mortality and cancer mortality among overall cancer survivors, the primary prevention group, and the secondary prevention group ( Supplementary Figure S4 Supplementary Figure S4A Supplementary Figure S4B Supplementary Figure S4C P P Figure 3 Figure 3 Association between LDL-C and cardiovascular mortality in cancer survivors not treated with statins. Graph illustrating the relationship between LDL-C levels and cardiovascular mortality. The x-axis shows LDL-C levels, while the y-axis represents the hazard ratio with a peak around 131 mg/dL. P-values are 0.040 for overall and 0.016 for nonlinear associations. Shaded areas indicate confidence intervals. 3.3 Subgroup analysis of association between LDL-C and mortality in cancer survivors We classified cancer survivors into two groups based on the inflection point of LDL-C levels in relation to all-cause mortality: higher LDL-C levels (≥119 mg/dl) and lower LDL-C levels (<119 mg/dl). The association between higher LDL-C levels and a reduced risk of all-cause mortality, compared to lower LDL-C levels, was consistent across most subgroups, with varying magnitudes of adjusted hazard ratios ( Figure 4 p Figure 4 Subgroup analysis of high vs. low LDL-C for all-cause mortality risk in cancer survivors. Forest plot illustrating various subgroups analyzed for LDL-C levels below and above 119 mg/dL, with hazard ratios and confidence intervals. Significant interactions are highlighted for cardiovascular disease, age, BMI, smoking status, diabetes, and statin use. A dashed vertical line indicates null effect. 3.4 Interaction between LDL-C levels and age Figure 5 Supplementary Figure S5 Figure 5 Association between LDL-C levels and all-cause mortality stratified by age. Graph showing hazard ratio (HR) versus LDL-C levels. Two lines represent age groups: under sixty-five years in blue and sixty-five years or older in red. Both lines decrease initially, with the blue line continuing to decline while the red line levels off and then slightly increases. To further investigate this difference, we analyzed the distribution of causes of death between the two age groups ( Supplementary Figure S6 Supplementary Figure S7 Figure 6 n n Supplementary Figure S6 n n Supplementary Figure S6 Supplementary Figure S7 Supplementary Figure 5 Figure 6 Multivariable adjusted cause-specific hazard ratios and 95% confidence intervals for CVD and cancer mortality across age groups. Forest plot showing multivariable adjusted cause-specific hazard ratios for two groups: CVD and cancer. For ages under sixty-five, both are references. For CVD, ages sixty-five and older have a hazard ratio of 4.69 with confidence interval 2.97 to 7.40. For cancer, ages sixty-five and older have a hazard ratio of 2.00 with confidence interval 1.43 to 2.78. A dashed vertical line at 1 indicates reference. Horizontal lines represent confidence intervals for each hazard ratio. 3.5 Sensitive analyses The association of low LDL-C levels with increased all-cause and cardiovascular mortality remained consistent when penalized smoothing splines were used instead of restricted cubic splines ( Supplementary Figure S8 Supplementary Figure S9 Supplementary Figure S9 Supplementary Figure S9 Supplementary Figure S9 4 Discussion This population-based study of 1,958 cancer survivors revealed a nonlinear relationship between LDL-C levels and mortality, with low LDL-C (<119 mg/dl for all-cause; <124 mg/dl for cardiovascular mortality) associated with higher risk. Notably, this association persisted in secondary CVD prevention groups, whereas younger survivors (<65 years) and those without prior CVD showed an inverse LDL-C–mortality relationship. Cumulative mortality analyses highlighted competing risks: cancer accounted for most early deaths in primary prevention cohorts, while cardiovascular mortality exceeded cancer-related deaths in secondary prevention groups over extended follow-up. With population aging and advances in cancer detection and treatment, the number of cancer survivors is rapidly increasing ( 1 2 13 Supplementary Figure S4 Previous studies in the general population have extensively examined the association between LDL-C and all-cause or cause-specific mortality, with many recent analyses reporting nonlinear relationships. A 2021 study based on NHANES including 19,034 participants ( 11 14 In comparison, cancer survivors are generally older and have a higher burden of chronic conditions. Emerging evidence indicates that LDL-C patterns in cancer survivors are distinct, influenced by tumor-driven lipid metabolism changes ( 15 16 17 19 20 23 Reverse causality may be a possible explanation for these findings. The lowest LDL-C quartile group (<90 mg/dl) in our study was characterized by older age and a higher prevalence of chronic diseases, including cardiovascular disease, hypertension, diabetes, and chronic kidney disease. Low LDL-C levels could, in part, be the outcome of poor health status and severe disease ( 24 25 11 14 4 Due to differences in factors such as age, gender, race, and comorbidities, there is significant heterogeneity among cancer survivors. To examine the differences in all-cause mortality risk between low LDL-C and high LDL-C cancer survivors, stratified analyses were performed based on gender, age (<65 years or ≥65 years), race (White or non-White), BMI (<25, 25–30 or ≥30.00), smoking status (current smoker or non-smoker), cardiovascular diseases, diabetes, hypertension, and statin use. The association of higher LDL-C levels with lower all-cause mortality risk varied within subgroups, though the interaction between LDL-C and variables other than age in relation to all-cause mortality was not statistically significant. The pronounced effect observed primarily in the subgroup without pre-existing chronic conditions could be attributed to the fact that maintaining elevated LDL-C levels in cancer individuals with underlying diseases poses a greater risk for those conditions ( 24 26 27 28 14 n 29 30 31 With the widespread adoption of early cancer screening and advances in cancer treatment, the survival duration of cancer patients has gradually increased. However, cancer patients are also facing additional health challenges, with cardiovascular disease (CVD) being the leading one ( 32 33 34 Current guidelines lack cancer-specific LDL-C management targets. While Chinese consensus ( 35 36 37 38 This study has several limitations. First, NHANES medical history data, including cancer status, alcohol use, smoking, and chronic diseases, are self-reported and may be subject to recall bias or inaccuracies. Second, LDL-C was measured only once at baseline, while serum levels can fluctuate over time; future studies should examine the relationship between dynamic LDL-C changes and mortality risk. Third, the dataset lacks detailed information on cancer stage and treatment, making it difficult to identify potential explanations for the L-shaped association between LDL-C and mortality beyond reverse causation. Future research should include long-term, repeated assessments in cancer survivors, considering cancer-specific and treatment-related factors, to better understand the mechanisms underlying the observed nonlinear associations between LDL-C and mortality. In summary, our study observed a nonlinear association of LDL-C levels with all-cause and cardiovascular mortality in cancer survivors, wherein low levels of LDL-C were associated with an increased mortality risk, and the identified optimal LDL-C thresholds were 119 mg/dl for all-cause mortality and 124 mg/dl for cardiovascular mortality. Inverse LDL-C-mortality association particularly in cancer survivors <65 years and without prior CVD. These results enhanced the understanding of the association between LDL-C levels and all-cause, cardiovascular, and cancer mortality within this population, emphasize the prognostic role of LDL-C in cancer survivors and suggest that tailored LDL-C management targets may be required for this population. Acknowledgments The authors would like to thank Dr. Feng Zhou, Dr. Fang Lei and Dr. Haomiao Li for their help with the improvement of statistical analyses and scientific language. Data availability statement Publicly available datasets were analyzed in this study. This data can be found here: https://www.cdc.gov/nchs/nhanes/ Ethics statement The studies involving humans were approved by National Center for Health Statistics (NCHS) Ethics Review Board (ERB). The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Author contributions BH: Writing – review & editing, Formal analysis, Conceptualization, Writing – original draft, Software, Methodology, Visualization, Investigation, Project administration, Data curation, Validation, Resources. YH: Writing – original draft, Software, Writing – review & editing, Resources, Investigation, Formal analysis, Visualization, Project administration, Methodology, Data curation, Conceptualization, Validation. HW: Supervision, Writing – review & editing, Investigation, Software, Resources, Validation, Data curation, Project administration, Formal analysis, Conceptualization, Visualization, Methodology. HZ: Investigation, Writing – review & editing, Methodology, Conceptualization, Validation. XG: Writing – review & editing, Data curation, Validation, Investigation, Conceptualization, Methodology. YC: Investigation, Validation, Data curation, Supervision, Project administration, Writing – review & editing, Conceptualization, Methodology. YZ: Methodology, Supervision, Writing – review & editing, Project administration, Data curation, Investigation, Conceptualization, Validation. JX: Project administration, Data curation, Validation, Conceptualization, Writing – review & editing, Supervision, Investigation. XY: Data curation, Investigation, Methodology, Conceptualization, Writing – review & editing, Validation. LW: Methodology, Writing – review & editing, Conceptualization, Investigation, Validation. HJ: Validation, Writing – review & editing, Methodology, Conceptualization, Investigation, Supervision. LZ: Software, Data curation, Methodology, Investigation, Visualization, Conceptualization, Project administration, Writing – review & editing, Funding acquisition, Validation, Resources, Supervision, Formal analysis. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that Generative AI was used in the creation of this manuscript. Generative AI was used only to improve the grammar and spelling of the paper to enhance its mandatory nature. The authors carefully checked the generated text and take full responsibility for the content. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fcvm.2025.1593824/full#supplementary-material References 1. Mayer DK Nasso SF Earp JA Defining cancer survivors, their needs, and perspectives on survivorship health care in the USA Lancet Oncol 2017 18 e11 8 10.1016/S1470-2045(16)30573-3 28049573 2. Florido R Daya NR Ndumele CE Koton S Russell SD Prizment A Cardiovascular disease risk among cancer survivors: the atherosclerosis risk in communities (ARIC) study J Am Coll Cardiol 2022 80 22 32 10.1016/j.jacc.2022.04.042 35772913 PMC9638987 3. Liu T Zhou T Luo F Yang Y Zhao S Huang Y Clinical significance of kinetics of low-density lipoprotein cholesterol and its prognostic value in limited stage small cell lung cancer patients Cancer Control J Moffitt Cancer Cent 2021 28 10732748211028257 10.1177/10732748211028257 PMC8246505 34184581 4. Kim S Kim G Cho SH Oh R Kim JY Lee Y-B Association between total cholesterol levels and all-cause mortality among newly diagnosed patients with cancer Sci Rep 2024 14 58 10.1038/s41598-023-50931-6 38168969 PMC10761709 5. Lin Q Liu W Xu S Sun L Associations of preoperative serum high-density lipoprotein cholesterol and low-density lipoprotein cholesterol levels with the prognosis of ovarian cancer Arch Gynecol Obstet 2022 305 683 91 10.1007/s00404-021-06215-3 34453586 6. Jiang Q Wang L Jin M Shou Y Zhu H Li A The clinical value of lipid abnormalities in early stage cervical cancer Int J Gen Med 2022 15 3903 14 10.2147/IJGM.S352934 35431573 PMC9012499 7. Dong S Yu J Chen X Shen K Association of serum lipid levels and clinical outcomes in early breast cancer patients Ther Adv Med Oncol 2023 15 17588359231177004 10.1177/17588359231177004 37256022 PMC10226318 8. Zimbalist AS Caan BJ Chen WY Mittendorf EA Dillon DAR Quesenberry C Metabolic abnormalities and survival among patients with non-metastatic breast cancer BMC Cancer 2022 22 1361 10.1186/s12885-022-10430-9 36581817 PMC9801571 9. Brantley KD Riis AH Erichsen R Thorlacius-Ussing O Møller HJ Lash TL The association of serum lipid levels with colorectal cancer recurrence Cancer Epidemiol 2020 66 101725 10.1016/j.canep.2020.101725 32353773 10. Gao R Liang J-H Wang L Zhu H-Y Wu W Cao L Low serum cholesterol levels predict inferior prognosis and improve NCCN-IPI scoring in diffuse large B cell lymphoma Int J Cancer 2018 143 1884 95 10.1002/ijc.31590 29744861 11. Liu Y Liu F Zhang L Li J Kang W Cao M Association between low density lipoprotein cholesterol and all-cause mortality: results from the NHANES 1999–2014 Sci Rep 2021 11 22111 10.1038/s41598-021-01738-w 34764414 PMC8586008 12. Li Y Ye Z Ran X Luo J Li H Zhou P Association between depression and liver function biomarkers among US cancer survivors in NHANES 2005–2020 Sci Rep 2024 14 27501 10.1038/s41598-024-78890-6 39528812 PMC11555283 13. Battisti NML Welch CA Sweeting M De Belder M Deanfield J Weston C Prevalence of cardiovascular disease in patients with potentially curable malignancies JACC CardioOncology 2022 4 238 53 10.1016/j.jaccao.2022.03.004 35818547 PMC9270631 14. Johannesen CDL Langsted A Mortensen MB Nordestgaard BG Association between low density lipoprotein and all cause and cause specific mortality in Denmark: prospective cohort study Br Med J 2020 371 m4266 10.1136/bmj.m4266 33293274 PMC7722479 15. Broadfield LA Pane AA Talebi A Swinnen JV Fendt S-M Lipid metabolism in cancer: new perspectives and emerging mechanisms Dev Cell 2021 56 1363 93 10.1016/j.devcel.2021.04.013 33945792 16. Fernández LP Gómez de Cedrón M Ramírez de Molina A Alterations of lipid metabolism in cancer: implications in prognosis and treatment Front Oncol 2020 10 577420 10.3389/fonc.2020.577420 33194695 PMC7655926 17. Wang Z Li J Lipoprotein(a) in patients with breast cancer after chemotherapy: exploring potential strategies for cardioprotection Lipids Health Dis 2023 22 157 10.1186/s12944-023-01926-9 37736722 PMC10515253 18. Bhatnagar R Dixit NM Yang EH Sallam T Cancer therapy’s impact on lipid metabolism: mechanisms and future avenues Front Cardiovasc Med 2022 9 925816 10.3389/fcvm.2022.925816 36017084 PMC9396263 19. Tian W Yao Y Fan G Zhou Y Wu M Xu D Changes in lipid profiles during and after (neo)adjuvant chemotherapy in women with early-stage breast cancer: a retrospective study PLoS One 2019 14 e0221866 10.1371/journal.pone.0221866 31465521 PMC6715243 20. He T Wang C Tan Q Wang Z Li J Chen T Adjuvant chemotherapy-associated lipid changes in breast cancer patients: a real-word retrospective analysis Medicine (Baltimore) 2020 99 e21498 10.1097/MD.0000000000021498 32871996 PMC7437760 21. Zhou P Li B Liu B Chen T Xiao J Prognostic role of serum total cholesterol and high-density lipoprotein cholesterol in cancer survivors: a systematic review and meta-analysis Clin Chim Acta Int J Clin Chem 2018 477 94 104 10.1016/j.cca.2017.11.039 29223765 22. Li X Liu Z-L Wu Y-T Wu H Dai W Arshad B Status of lipid and lipoprotein in female breast cancer patients at initial diagnosis and during chemotherapy Lipids Health Dis 2018 17 91 10.1186/s12944-018-0745-1 29678178 PMC5910614 23. Xu L Dong Q Long Y Tang X Zhang N Lu K Dynamic changes of blood lipids in breast cancer patients after (neo)adjuvant chemotherapy: a retrospective observational study Int J Gen Med 2020 13 817 23 10.2147/IJGM.S273056 33116773 PMC7569068 24. Zullig LL Sung AD Khouri MG Jazowski S Shah NP Sitlinger A Cardiometabolic comorbidities in cancer survivors: JACC: CardioOncology state-of-the-art review JACC CardioOncology 2022 4 149 65 10.1016/j.jaccao.2022.03.005 35818559 PMC9270612 25. Zhang Q Wang Z Song M Liu T Ding J Deng L Effects of systemic inflammation and frailty on survival in elderly cancer patients: results from the INSCOC study Front Immunol 2023 14 936904 10.3389/fimmu.2023.936904 36891320 PMC9986529 26. Li Q Liu F Tang Y Lee S Lang C Bai L The distribution of cardiovascular-related comorbidities in different adult-onset cancers and related risk factors: analysis of 10 year retrospective data Front Cardiovasc Med 2021 8 695454 10.3389/fcvm.2021.695454 34595215 PMC8476781 27. Murto MO Simolin N Arponen O Siltari A Artama M Visvanathan K Statin use, cholesterol level, and mortality among females with breast cancer JAMA Netw Open 2023 6 e2343861 10.1001/jamanetworkopen.2023.43861 37976058 PMC10656638 28. Beckwitt CH Brufsky A Oltvai ZN Wells A Statin drugs to reduce breast cancer recurrence and mortality Breast Cancer Res BCR 2018 20 144 10.1186/s13058-018-1066-z 30458856 PMC6247616 29. Miller KD Fidler-Benaoudia M Keegan TH Hipp HS Jemal A Siegel RL Cancer statistics for adolescents and young adults, 2020 CA Cancer J Clin 2020 70 443 59 10.3322/caac.21637 32940362 30. Tricoli JV Blair DG Anders CK Bleyer WA Boardman LA Khan J Biologic and clinical characteristics of adolescent and young adult cancers: acute lymphoblastic leukemia, colorectal cancer, breast cancer, melanoma, and sarcoma Cancer 2016 122 1017 28 10.1002/cncr.29871 26849082 PMC4803597 31. Tricoli JV Boardman LA Patidar R Sindiri S Jang JS Walsh WD A mutational comparison of adult and adolescent and young adult (AYA) colon cancer Cancer 2018 124 1070 82 10.1002/cncr.31136 29194591 PMC5821537 32. Cleary S Rosen SD Gilbert DC Langley RE Cardiovascular health: an important component of cancer survivorship BMJ Oncol 2023 2 e000090 10.1136/bmjonc-2023-000090 39886493 PMC11235026 33. Jiang W Hu J-W He X-R Jin W-L He X-Y Statins: a repurposed drug to fight cancer J Exp Clin Cancer Res CR 2021 40 241 10.1186/s13046-021-02041-2 34303383 PMC8306262 34. Nielsen SF Nordestgaard BG Bojesen SE Statin use and reduced cancer-related mortality N Engl J Med 2012 367 1792 802 10.1056/NEJMoa1201735 23134381 35. Integrative Cardio-Oncology Society of China Anti-Cancer Association Chinese Expert consensus on lipid management in patients with malignancy Zhonghua Zhong Liu Za Zhi 2021 43 1043 53 10.3760/cma.j.cn112152-20210415-00321 34695894 36. Mach F Baigent C Catapano AL Koskinas KC Casula M Badimon L 2019 ESC/EAS guidelines for the management of dyslipidaemias: lipid modification to reduce cardiovascular risk Eur Heart J 2020 41 111 88 10.1093/eurheartj/ehz455 31504418 37. Grundy SM Stone NJ Bailey AL Beam C Birtcher KK Blumenthal RS 2018 AHA/ACC/AACVPR/AAPA/ABC/ACPM/ADA/AGS/APhA/ASPC/NLA/PCNA guideline on the management of blood cholesterol: executive summary: a report of the American college of cardiology/American heart association task force on clinical practice guidelines Circulation 2019 139 e1046 81 10.1161/CIR.0000000000000624 30565953 38. de Jesus M Mohammed T Singh M Tiu JG Kim AS Etiology and management of dyslipidemia in patients with cancer Front Cardiovasc Med 2022 9 892335 10.3389/fcvm.2022.892335 35548413 PMC9081373 ",
  "metadata": {
    "Title of this paper": "Etiology and management of dyslipidemia in patients with cancer",
    "Journal it was published in:": "Frontiers in Cardiovascular Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477126/"
  }
}