{
  "title": "Paper_543",
  "abstract": "pmc J Clin Invest J Clin Invest 120 jcinvest J Clin Invest The Journal of Clinical Investigation 0021-9738 1558-8238 American Society for Clinical Investigation PMC12483610 PMC12483610.1 12483610 12483610 41031895 10.1172/JCI188346 188346 1 Review Series Emerging roles for complement in lung transplantation https://orcid.org/0000-0003-4830-5084 Kulkarni Hrishikesh S. HSKulkarni@mednet.ucla.edu 1 https://orcid.org/0000-0003-2379-5486 Belperio John A. jbelperio@mednet.ucla.edu 1 Atkinson Carl carl.atkinson@northwestern.edu 2 1 2 Address correspondence to: Hrishikesh Kulkarni, Division of Pulmonary, Critical Care and Sleep Medicine, University of California, Los Angeles, 10833 Le Conte Ave., 52-257 CHS, Mail code: 169017, Los Angeles, California 90095, USA. Email: hskulkarni@mednet.ucla.edu carl.atkinson@northwestern.edu 1 10 2025 1 10 2025 135 19 498024 e188346 01 10 2025 01 10 2025 02 10 2025 © 2025 Kulkarni et al. 2025 Kulkarni et al. https://creativecommons.org/licenses/by/4.0/ This work is licensed under the Creative Commons Attribution 4.0 International License. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ This article is available online at https://www.jci.org/articles/view/188346 The complement system is an evolutionarily conserved host defense system that has evolved from invertebrates to mammals. Over time, this system has become increasingly appreciated as having effects beyond purely bacterial clearance, with clinically relevant implications in transplantation, particularly lung transplantation. For many years, complement activation in lung transplantation was largely focused on antibody-mediated injuries. However, recent studies have highlighted the importance of both canonical and noncanonical complement activation in shaping adaptive immune responses, which influence alloimmunity. These studies, together with the emergence of FDA-approved complement therapeutics and other drugs in the pipeline that function at different points of the cascade, have led to an increased interest in regulating the complement system to improve donor organ availability as well as improving both short- and long-term outcomes after lung transplantation. In this Review, we provide an overview of the when, what, and how of complement in lung transplantation, posing the questions of: when does complement activation occur, what components of the complement system are activated, and how can this activation be controlled? We conclude that complement activation occurs at multiple stages of the transplant process and that randomized controlled trials will be necessary to realize the therapeutic potential of neutralizing this activation to improve outcomes after lung transplantation. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Challenges in outcomes in lung transplantation Lung transplantation is currently the only life-saving therapy available for patients with irreversible, end-stage lung disease ( 1 2 3 4 5 6 7 Complement system evolution and relevance to transplantation The complement system is a part of the host immune response that can be triggered to assemble, amplify, and attack as a defense against foreign cells, including pathogens ( 8 9 10 11 11 Figure 1 12 13 Evolutionarily, the oldest components of this system — identified in the sea anemone and horseshoe crab —are those belonging to the AP ( 8 2 14 2 15 Figure 1 16 Figure 2 Figure 3 17 Cell-type-intrinsic complement production and function It has been proposed that the complement system originated intracellularly in single-cell organisms and subsequently adapted to be secreted for host defense in multicellular organisms ( 18 19 20 23 + 20 24 25 21 26 28 29 30 31 20 22 32 25 33 27 34 35 38 However, most of the work on intracellular complement production and activity has been done in systems other than lung transplantation. Novel tools such as complement reporter mice have enabled investigation of complement activation as a part of dynamic in vivo immune responses ( 20 39 20 27 24 40 41 43 The role of complement in lung transplantation There is an increasing understanding that activation of the complement system plays key roles in the pathophysiology of organ transplant injury ( Figure 2 13 44 49 21 26 27 49 The study of complement activation in organ transplantation was for many years focused on canonical effects, which include CP activation by donor-specific antibodies (DSAs) ( 50 51 52 53 54 55 57 57 60 36 20 25 40 21 30 These studies, together with the emergence of FDA-approved complement therapeutics, which function at different points of the complement cascade ( Figure 3 61 when does complement activation occur what components of the complement pathway are activated how can this activation be controlled? Donor organ injury. Donor lungs are procured either from brain-dead (BD) or donation-after-cardiac-death (DCD) donors, each sustaining inflammatory injury before retrieval. Whether complement is locally activated within human donor lungs remains unknown; however, two murine studies show that brain death triggers robust activation of the classical and lectin complement pathways, with C3/C4 fragment deposition in pulmonary tissue and heightened injury ( 62 63 62 63 Primary graft dysfunction. Primary graft dysfunction (PGD) occurs within the first 72 hours after transplantation. The pathophysiology of PGD is complex; however, the acute lung injury that ensues after transplant is predominantly due to IRI. Complement activation plays a key role in the propagation of ischemic injury. Binding of natural antibodies to cryptic neoepitopes that have been exposed as a consequence of ischemic insult initiates the pathogenic sequelae leading to full-blown complement activation ( 53 64 65 66 66 67 67 68 Acute cellular rejection. The role of complement activation in acute cellular rejection in the lung has not been rigorously investigated. Several studies in experimental solid organ transplantation have shown that complement activation fragments can prime and promote alloimmunity (these are reviewed below). However, no studies to date have correlated complement activation with acute cellular rejection episodes clinically. AMR. Drawing from experiences in other solid organ transplants, such as heart and kidney grafts, lung AMR was first diagnostically clarified in the International Society of Heart and Lung Transplant Standardization of Nomenclature in the Diagnosis of Lung Rejection, which proposed that small vessel intimitis, together with C4d and CD68 immunostaining, are potential indicators of lung AMR ( 69 70 71 72 73 74 75 76 78 79 80 In addition to histopathological studies, the presence of complement activation has been assessed in BAL. Independent studies have demonstrated that sC4d levels in BAL correlate with increased circulating DSAs and biopsy-confirmed endothelial C4d deposition ( 81 83 81 2 15 2 Traditionally, AMR is defined by the presence of DSAs, histologic injury, and C4d deposition. However, as outlined above, many AMR cases, particularly in the lung, are C4d negative, lacking detectable complement activation despite clear clinical, serologic, and histologic signs of rejection ( 84 88 86 88 90 88 89 88 90 Endotyping of AMR in lung transplantation will require precise delineation of the underlying immune effector pathways active within the graft, which cannot be reliably captured by histopathology or conventional C4d staining alone ( 89 91 94 CLAD. Complement activation has been increasingly associated with CLAD and its primary pathological manifestation, obliterative bronchiolitis (OB). Activation of the complement cascade contributes to persistent inflammation and immune dysregulation, which are key factors in the development of CLAD. Histopathological studies assessing C4d and C3d deposition have shown that increased levels are associated with the early onset of chronic graft dysfunction or persistent graft failure ( 95 96 72 96 97 96 98 99 100 101 Table 1 Cellular sources of complement contributing to allograft injury The sine qua non feature of complement-mediated allograft injury is covalently deposited activation fragments on the tissue surface, such as C3d and C4d ( 102 103 In vivo animal models. Local graft complement activation has been shown to have a profound impact on the regulation of alloreactive T cell responses, which are critical mediators of transplant rejection. To date, all of these studies have been performed in rodents and in models other than lung transplantation (see reviews, refs. 104 106 107 108 109 + + 57 55 56 55 More recently, studies in murine models of orthotopic lung transplantation have demonstrated how complement activation drives humoral alloimmune responses, with deleterious outcomes. Lung-restricted autoantibodies activate both the CP and AP, resulting in PGD, while increasing C3 expression in the donor epithelial cells ( 51 + 110 111 112 113 113 + 113 114 + 114 Figure 2 Human donor lungs. Given that lungs produce certain complement proteins independent of the liver (C3 and C5, which can be cleaved to form anaphylatoxins) and that membranes can activate complement, there has been a historical concern that increased complement activation may contribute to detrimental outcomes during ex vivo lung perfusion (EVLP), especially with extended duration of perfusion. Additionally, complement activation occurs and contributes to antibody-mediated injury in ABO-incompatible lung transplantation and xenotransplantation ( 115 116 117 62 118 + 119 120 115 Complement therapeutics in lung transplantation Given these findings, complement inhibition has emerged as a promising therapeutic strategy in lung transplantation to mitigate PGD, AMR, and CLAD. Numerous preclinical and clinical studies have explored systemic complement therapeutics, highlighting the critical role of complement activation in driving inflammation, IRI, and immune-mediated graft damage. Investigations using rat ( 121 122 123 124 Table 2 Table 3 125 2 2 126 127 127 In addition to prevention of PGD, case studies investigating complement therapeutics in AMR, primarily eculizumab and C1-INH, have been reported. Eculizumab has been used with varying success in lung transplant recipients with refractory AMR, characterized by DSAs and complement deposition. In some reports, eculizumab administration was associated with stabilization of lung function and reduced inflammation markers. In one case, treatment with eculizumab, alongside plasmapheresis and intravenous immunoglobulin (IVIG), decreased DSA levels and improved oxygenation, though long-term graft survival varied ( 119 128 129 130 131 51 51 Complement activation is a local event, yet complement inhibition is generally applied systemically to halt complement-mediated tissue injury. Multiple cell types can generate their own complement independent of hepatic sources, and there is a growing body of literature demonstrating that donor organ–produced complement plays a role in allograft injury and alloimmune priming. For example, elegant studies demonstrated that donor C3 production was central to the development of acute kidney allograft rejection ( 107 132 63 133 134 135 136 53 53 134 136 53 133 137 139 These animal studies are informative but have limitations. The complement cascade retains its core architecture across mammals to orchestrate pathogen clearance and shape adaptive immunity ( 140 141 142 145 146 147 134 148 149 150 Table 2 While not directly related to alloimmunity, a recent report investigating SARS-CoV-2–infected lung epithelial cells demonstrates the potential of modulating intracellular complement to mediate epithelial cell inflammation ( 28 28 Figure 3 The growing number of FDA-approved complement therapeutics that can intercept the complement cascade may present opportunities to improve outcomes in lung transplantation. Each therapeutic offers distinct advantages and trade offs. For example, upstream blockade with C1-INHs and anti-C1s antibodies may prevent CP or LP initiation and, by extension, downstream activation of the C3 amplification loop ( Figure 3 151 152 125 153 Table 2 Whether these agents should be delivered systemically or directly to the lung remains an open question, as unlike other solid organs, the lung provides unique opportunities for local delivery. Intrapulmonary delivery of complement therapeutics could be performed in the donor, during EVLP, or after transplantation via nebulization, a strategy that likely obviates the risk of off-target effects seen with systemic complement inhibition, such as excessive immunosuppression. On one hand, systemic therapy may better control spillover inflammation, but organ-targeted strategies may enhance drug concentration at the site of injury, spare systemic complement activity, and enable shorter treatment duration. Summary Recent advances in lung transplantation have demonstrated that complement activation contributing to allograft injury is a local event. Yet complement modulatory therapies have largely been applied systemically, often with suboptimal results. By investigating the specific components of the complement cascade and the mechanisms by which they drive alloimmune responses, understanding the time course over which complement activation occurs, identifying lung transplant recipients who are predisposed to complement-mediated allograft injury, and by discerning the relevant cellular sources of complement production in the allograft, we will be able to refine our approaches for site-specific targeting. These approaches could enable personalized, mechanism-targeted therapies tailored to the dominant effector pathways and the patient’s own infection risk profile, with the ultimate goal of improving both short- and long-term outcomes after lung transplantation. This work is the result of NIH funding, in whole or in part, and is subject to the NIH Public Access Policy. Through acceptance of this federal funding, the NIH has been given a right to make the work publicly available in PubMed Central. HSK is supported by NIH grants R01-HL166449 and R01-HL169860. JAB is supported by NIH grant U01-AI163099 and Cystic Fibrosis Foundation (BELPER24AB0-CTOT). CA is supported by NIH grants U01-AI170075 and R01-HL140470. Conflict of interest: Copyright: Reference information: J Clin Invest 1 Christie JD et al Lung Transplantation N Engl J Med 2024 391 19 1822 1836 10.1056/NEJMra2401039 39536228 2 Singh TP et al The international thoracic organ transplant registry of the International Society for Heart and Lung Transplantation: 2025 Annual Report of Heart and Lung Transplantation J Heart Lung Transplant In press 40300677 10.1016/j.healun.2025.04.014 3 Singh TP et al Graft survival in primary thoracic organ transplant recipients: A special report from the International Thoracic Organ Transplant Registry of the International Society for Heart and Lung Transplantation J Heart Lung Transplant 2023 42 10 1321 1333 10.1016/j.healun.2023.07.017 37549773 PMC10901564 4 Abul Kashem M et al A multicenter analysis of lung transplantation outcomes comparing donation after circulatory death and donation after brain death JHLT Open 2024 6 100132 10.1016/j.jhlto.2024.100132 40145031 PMC11935477 5 Loor G et al Effect of mode of intraoperative support on primary graft dysfunction after lung transplant J Thorac Cardiovasc Surg 2022 164 5 1351 1361 10.1016/j.jtcvs.2021.10.076 35236625 6 Amubieya O et al Ambient air pollution exposure and outcomes in patients receiving lung transplant JAMA Netw Open 2024 7 10 e2437148 10.1001/jamanetworkopen.2024.37148 39418024 PMC11581506 7 Liao F et al Pseudomonas aeruginosa Sci Transl Med 2025 17 784 eadp1349 10.1126/scitranslmed.adp1349 39908350 PMC12335241 8 Le Friec G Kemper C Complement: coming full circle Arch Immunol Ther Exp (Warsz) 2009 57 6 393 407 10.1007/s00005-009-0047-4 19866344 9 Houseright RA et al Cell type specific gene expression profiling reveals a role for complement component C3 in neutrophil responses to tissue damage Sci Rep 2020 10 1 15716 10.1038/s41598-020-72750-9 32973200 PMC7518243 10 Khan MA Shamma T Complement factor and T-cell interactions during alloimmune inflammation in transplantation J Leukoc Biol 2019 105 4 681 694 10.1002/JLB.5RU0718-288R 30536904 11 Kulkarni DH et al Local complement activation and modulation in mucosal immunity Mucosal Immunol 2024 17 4 739 751 10.1016/j.mucimm.2024.05.006 38838816 PMC11929374 12 Donado CA et al Granzyme K activates the entire complement cascade Nature 2025 641 8061 211 221 10.1038/s41586-025-08713-9 39914456 PMC12180478 13 Huber-Lang M et al Generation of C5a in the absence of C3: a new complement activation pathway Nat Med 2006 12 6 682 687 10.1038/nm1419 16715088 14 Pangburn MK Initiation of the alternative pathway of complement and the history of “tickover” Immunol Rev 2023 313 1 64 70 10.1111/imr.13130 36089768 15 Elvington M et al Development and optimization of an ELISA to quantitate C3(H 2 Front Immunol 2019 10 2 703 10.3389/fimmu.2019.00703 31019515 PMC6458276 16 de Boer ECW et al Therapeutic lessons to be learned from the role of complement regulators as double-edged sword in health and disease Front Immunol 2020 11 578069 10.3389/fimmu.2020.578069 33362763 PMC7758290 17 Cooper DKC et al Milestones on the path to clinical pig organ xenotransplantation Am J Transplant 2023 23 3 326 335 10.1016/j.ajt.2022.12.023 36775767 PMC10127379 18 West EE Kemper C Complement and T cell metabolism: food for thought Immunometabolism 2019 1 t cell metabolic reprogramming e190006 31328019 10.20900/immunometab20190006 PMC6642051 19 Elvington M et al Evolution of the complement system: from defense of the single cell to guardian of the intravascular space Immunol Rev 2016 274 1 9 15 10.1111/imr.12474 27782327 PMC5108576 20 Liszewski MK et al Intracellular complement activation sustains T cell homeostasis and mediates effector differentiation Immunity 2013 39 6 1143 1157 10.1016/j.immuni.2013.10.018 24315997 PMC3865363 21 Kulkarni HS et al Intracellular C3 protects human airway epithelial cells from stress-associated cell death Am J Respir Cell Mol Biol 2019 60 2 144 157 10.1165/rcmb.2017-0405OC 30156437 PMC6376412 22 King BC et al Intracellular cytosolic complement component C3 regulates cytoprotective autophagy in pancreatic beta cells by interaction with ATG16L1 Autophagy 2019 15 5 919 921 10.1080/15548627.2019.1580515 30741587 PMC6526805 23 Mulligan JK et al C3a receptor antagonism as a novel therapeutic target for chronic rhinosinusitis Mucosal Immunol 2018 11 5 1375 1385 10.1038/s41385-018-0048-x 29907871 PMC6162114 24 Desai JV et al C5a-licensed phagocytes drive sterilizing immunity during systemic fungal infection Cell 2023 186 13 2802 2822 10.1016/j.cell.2023.04.031 37220746 PMC10330337 25 Niyonzima N et al Mitochondrial C5aR1 activity in macrophages controls IL-1β production underlying sterile inflammation Sci Immunol 2021 6 66 eabf2489 10.1126/sciimmunol.abf2489 34932384 PMC8902698 26 Sahu SK et al The role of complement component C3 in protection against pseudomonas DNA Cell Biol 2024 43 4 153 157 10.1089/dna.2023.0445 38324102 PMC11002327 27 Sahu SK et al Lung epithelial cell-derived C3 protects against pneumonia-induced lung injury Sci Immunol 2023 8 80 eabp9547 10.1126/sciimmunol.abp9547 36735773 PMC10023170 28 Yan B et al SARS-CoV-2 drives JAK1/2-dependent local complement hyperactivation Sci Immunol 2021 6 58 eabg0833 10.1126/sciimmunol.abg0833 33827897 PMC8139422 29 Propson NE et al Endothelial C3a receptor mediates vascular inflammation and blood-brain barrier permeability during aging J Clin Invest 2021 131 1 e140966140966 10.1172/JCI140966 32990682 PMC7773352 30 Friscic J et al The complement system drives local inflammatory tissue priming by metabolic reprogramming of synovial fibroblasts Immunity 2021 54 5 1002 1021 10.1016/j.immuni.2021.03.003 33761330 31 Wu M et al Gut complement induced by the microbiota combats pathogens and spares commensals Cell 2024 187 4 897 913 10.1016/j.cell.2023.12.036 38280374 PMC10922926 32 Kulak K et al Intracellular C3 protects β-cells from IL-1β-driven cytotoxicity via interaction with Fyn-related kinase Proc Natl Acad Sci U S A 2024 121 8 e2312621121 10.1073/pnas.2312621121 38346191 PMC10895342 33 Posch W et al C5aR inhibition of nonimmune cells suppresses inflammation and maintains epithelial integrity in SARS-CoV-2-infected primary human airway epithelia J Allergy Clin Immunol 2021 147 6 2083 2097 10.1016/j.jaci.2021.03.038 33852936 PMC8056780 34 Roumenina LT et al Context-dependent roles of complement in cancer Nat Rev Cancer 2019 19 12 698 715 10.1038/s41568-019-0210-0 31666715 35 Emin M et al Increased internalization of complement inhibitor CD59 may contribute to endothelial inflammation in obstructive sleep apnea Sci Transl Med 2016 8 320 320ra1 10.1126/scitranslmed.aad0634 26738794 PMC5485919 36 Suzuki H et al Role of complement activation in obliterative bronchiolitis post-lung transplantation J Immunol 2013 191 8 4431 4439 10.4049/jimmunol.1202242 24043901 PMC3873138 37 Cipolla E et al IL-17A deficiency mitigates bleomycin-induced complement activation during lung fibrosis FASEB J 2017 31 12 5543 5556 10.1096/fj.201700289R 28821630 PMC5690386 38 Gu H et al Contribution of the anaphylatoxin receptors, C3aR and C5aR, to the pathogenesis of pulmonary fibrosis FASEB J 2016 30 6 2336 2350 10.1096/fj.201500044 26956419 PMC4871799 39 Wiese AV et al C5aR1 activation in mice controls inflammatory eosinophil recruitment and functions in allergic asthma Allergy 2023 78 7 1893 1908 10.1111/all.15670 36757006 40 Kiss MG et al Cell-autonomous regulation of complement C3 by factor H limits macrophage efferocytosis and exacerbates atherosclerosis Immunity 2023 56 8 1809 1824 10.1016/j.immuni.2023.06.026 37499656 PMC10529786 41 Quell KM et al Monitoring C3aR expression using a floxed tdTomato-C3aR reporter knock-in mouse J Immunol 2017 199 2 688 706 10.4049/jimmunol.1700318 28626064 42 Dreher L et al Role of the anaphylatoxin receptor C5aR2 in Angiotensin II-induced hypertension and hypertensive end-organ damage Am J Hypertens 2024 37 10 810 825 10.1093/ajh/hpae082 38934290 43 Laumonnier Y et al Characterization of anaphylatoxin receptor expression and C3a/C5a functions in anaphylatoxin receptor reporter mice Curr Protoc Immunol 2020 130 1 e100 10.1002/cpim.100 32710701 44 Mateu-Borras M et al Pseudomonas aeruginosa Virulence 2022 13 1 215 224 10.1080/21505594.2022.2028484 35094639 PMC8802900 45 Kulkarni HS et al The complement system in the airway epithelium: An overlooked host defense mechanism and therapeutic target? J Allergy Clin Immunol 2018 141 5 1582 1586.e1 10.1016/j.jaci.2017.11.046 29339260 PMC5955701 46 Serban KA et al Lectin complement pathway in emphysema Am J Respir Crit Care Med 2019 199 5 659 661 10.1164/rccm.201807-1380LE 30557515 PMC6396862 47 Yuan X et al Cigarette smoke-induced reduction of C1q promotes emphysema JCI Insight 2019 5 13 e124317 31112138 10.1172/jci.insight.124317 PMC6629245 48 Okamoto T et al The relationship between complement C3 expression and the MUC5B genotype in pulmonary fibrosis Am J Physiol Lung Cell Mol Physiol 2018 315 1 1 10 10.1152/ajplung.00395.2017 29565179 PMC6087895 49 Ogawa T et al Complement protein C1q activates lung fibroblasts and exacerbates silica-induced pulmonary fibrosis in mice Biochem Biophys Res Commun 2022 603 88 93 10.1016/j.bbrc.2022.02.090 35278885 50 Colvin RB Smith RN Antibody-mediated organ-allograft rejection Nat Rev Immunol 2005 5 10 807 817 10.1038/nri1702 16175181 51 Yang W et al IL-1β-dependent extravasation of preexisting lung-restricted autoantibodies during lung transplantation activates complement and mediates primary graft dysfunction J Clin Invest 2022 132 20 e157975 10.1172/JCI157975 36250462 PMC9566897 52 Haihua C et al Cobra Venom Factor-induced complement depletion protects against lung ischemia reperfusion injury through alleviating blood-air barrier damage Sci Rep 2018 8 1 10346 10.1038/s41598-018-28724-z 29985461 PMC6037752 53 Li C et al A novel injury site-natural antibody targeted complement inhibitor protects against lung transplant injury Am J Transplant 2021 21 6 2067 2078 10.1111/ajt.16404 33210808 PMC8246004 54 Bidula S et al H-ficolin binds Aspergillus fumigatus leading to activation of the lectin complement pathway and modulation of lung epithelial immune responses Immunology 2015 146 2 281 291 10.1111/imm.12501 26133042 PMC4582969 55 Mathern DR et al Absence of recipient C3aR1 signaling limits expansion and differentiation of alloreactive CD8 + Am J Transplant 2019 19 6 1628 1640 10.1111/ajt.15222 30565852 PMC6538425 56 Raedler H et al Primed CD8(+) T-cell responses to allogeneic endothelial cells are controlled by local complement activation Am J Transplant 2009 9 8 1784 1795 10.1111/j.1600-6143.2009.02723.x 19563342 57 Vieyra M et al Complement regulates CD4 T-cell help to CD8 T cells required for murine allograft rejection Am J Pathol 2011 179 2 766 774 10.1016/j.ajpath.2011.04.038 21704012 PMC3157191 58 Strainic MG et al Locally produced complement fragments C5a and C3a provide both costimulatory and survival signals to naive CD4+ T cells Immunity 2008 28 3 425 435 10.1016/j.immuni.2008.02.001 18328742 PMC2646383 59 Kwan WH et al Signaling through C5a receptor and C3a receptor diminishes function of murine natural regulatory T cells J Exp Med 2013 210 2 257 268 10.1084/jem.20121525 23382542 PMC3570105 60 van der Touw W et al Cutting edge: Receptors for C3a and C5a modulate stability of alloantigen-reactive induced regulatory T cells J Immunol 2013 190 12 5921 5925 10.4049/jimmunol.1300847 23690475 PMC3679341 61 West EE et al Complement in human disease: approved and up-and-coming therapeutics Lancet 2024 403 10424 392 405 10.1016/S0140-6736(23)01524-6 37979593 PMC10872502 62 van Zanden JE et al Brain death-induced lung injury is complement dependent, with a primary role for the classical/lectin pathway Am J Transplant 2021 21 3 993 1002 10.1111/ajt.16231 32743873 PMC7984080 63 Cheng Q et al Donor pretreatment with nebulized complement C3a receptor antagonist mitigates brain-death induced immunological injury post-lung transplant Am J Transplant 2018 18 10 2417 2428 10.1111/ajt.14717 29504277 PMC6123303 64 Weiser MR et al Reperfusion injury of ischemic skeletal muscle is mediated by natural antibody and complement J Exp Med 1996 183 5 2343 2348 10.1084/jem.183.5.2343 8642343 PMC2192547 65 Zhang M et al Activation of the lectin pathway by natural IgM in a model of ischemia/reperfusion injury J Immunol 2006 177 7 4727 4734 10.4049/jimmunol.177.7.4727 16982912 66 Shah RJ et al Plasma complement levels are associated with primary graft dysfunction and mortality after lung transplantation Am J Respir Crit Care Med 2014 189 12 1564 1567 10.1164/rccm.201312-2121LE 24930532 PMC4226014 67 Kulkarni HS et al Local complement activation is associated with primary graft dysfunction after lung transplantation JCI Insight 2020 5 17 e138358 10.1172/jci.insight.138358 32750037 PMC7526453 68 Cerier E et al Temporal correlation between postreperfusion complement deposition and severe primary graft dysfunction in lung allografts Am J Transplant 2024 24 4 577 590 10.1016/j.ajt.2023.11.006 37977230 PMC10982049 69 Stewart S et al Revision of the 1996 working formulation for the standardization of nomenclature in the diagnosis of lung rejection J Heart Lung Transplant 2007 26 12 1229 1242 10.1016/j.healun.2007.10.017 18096473 70 Magro CM et al Humorally mediated posttransplantation septal capillary injury syndrome as a common form of pulmonary allograft rejection: a hypothesis Transplantation 2002 74 9 1273 1280 10.1097/00007890-200211150-00013 12451265 71 Magro CM et al Use of C4d as a diagnostic adjunct in lung allograft biopsies Am J Transplant 2003 3 9 1143 1154 10.1034/j.1600-6143.2003.00152.x 12919095 72 Magro CM et al Association of humoral immunity and bronchiolitis obliterans syndrome Am J Transplant 2003 3 9 1155 1166 10.1034/j.1600-6143.2003.00168.x 12919096 73 Ionescu DN et al C4d deposition in lung allografts is associated with circulating anti-HLA alloantibody Transpl Immunol 2005 15 1 63 68 10.1016/j.trim.2005.05.001 16223674 74 Comins-Boo A et al Non-HLA Antibodies and the risk of antibody-mediated rejection without donor-specific Anti-HLA antibodies after lung transplantation Transplant Proc 2025 57 1 73 76 10.1016/j.transproceed.2024.11.031 39753490 75 Roden AC et al Reproducibility of Complement 4d deposition by immunofluorescence and immunohistochemistry in lung allograft biopsies J Heart Lung Transplant 2014 33 12 1223 1232 10.1016/j.healun.2014.06.006 25149365 76 Aguilar PR et al The role of C4d deposition in the diagnosis of antibody-mediated rejection after lung transplantation Am J Transplant 2018 18 4 936 944 10.1111/ajt.14534 28992372 PMC5878693 77 Ngo C et al C4d detection and histological patterns in the diagnosis of antibody-mediated rejection after lung transplantation: a single-centre study Histopathology 2019 74 7 988 996 10.1111/his.13823 30636056 78 Hackman S et al The impact of C4d testing on tissue adequacy in lung transplant surveillance Ann Diagn Pathol 2020 48 151564 10.1016/j.anndiagpath.2020.151564 32659621 79 Calabrese F et al Alveolar septal widening as an “alert” signal to look into lung antibody-mediated rejection: a multicenter pilot study Transplantation 2019 103 11 2440 2447 10.1097/TP.0000000000002688 30830043 80 Lunardi F et al Assessing the role of phosphorylated S6 ribosomal protein in the pathological diagnosis of pulmonary antibody-mediated rejection J Heart Lung Transplant 2024 43 3 403 413 10.1016/j.healun.2023.10.002 37806601 81 Heigl T et al Free airway C4d after lung transplantation - a quantitative analysis of bronchoalveolar lavage fluid Transpl Immunol 2021 64 101352 10.1016/j.trim.2020.101352 33217540 82 Franchini E Porlezza M Mononuclear cell (MNC) concentration from the marrow harvest by automatic system Haematologica 1991 76 Suppl 1 15 17 1864550 83 Miller GG et al Acute humoral rejection of human lung allografts and elevation of C4d in bronchoalveolar lavage fluid Am J Transplant 2004 4 8 1323 1330 10.1111/j.1600-6143.2004.00508.x 15268735 84 Hachem RR et al Human leukocyte antigens antibodies after lung transplantation: Primary results of the HALT study Am J Transplant 2018 18 9 2285 2294 10.1111/ajt.14893 29687961 PMC6117197 85 Girnita AL et al Increased lung allograft failure in patients with HLA-specific antibody Clin Transpl 2007 2007 231 239 18637473 86 Messika J et al Antibody-mediated rejection in lung transplantation: diagnosis and therapeutic armamentarium in a 21st century perspective Transpl Int 2024 37 12973 10.3389/ti.2024.12973 39170865 PMC11336419 87 Cabezas L et al Tocilizumab and active antibody-mediated rejection in kidney transplantation: a literature review Front Immunol 2022 13 839380 10.3389/fimmu.2022.839380 35493469 PMC9047937 88 Bailly E et al Interleukin-21 promotes Type-1 activation and cytotoxicity of CD56 dim bright Kidney Int 2023 104 4 707 723 10.1016/j.kint.2023.04.024 37220805 PMC10524858 89 Calabrese DR et al CD16 + Am J Transplant 2023 23 1 37 44 10.1016/j.ajt.2022.10.006 36695619 PMC10018437 90 Lamarthee B et al Transcriptional and spatial profiling of the kidney allograft unravels a central role for FcyRIII+ innate immune cells in rejection Nat Commun 2023 14 1 4359 10.1038/s41467-023-39859-7 37468466 PMC10356785 91 Renner B et al Noninvasive detection of iC3b/C3d deposits in the kidney using a novel bioluminescent imaging probe J Am Soc Nephrol 2023 34 7 1151 1154 10.1681/ASN.0000000000000129 36995143 PMC10356150 92 Thurman JM et al Detection of complement activation using monoclonal antibodies against C3d J Clin Invest 2013 123 5 2218 2230 10.1172/JCI65861 23619360 PMC3635726 93 Sargsyan SA et al Detection of glomerular complement C3 fragments by magnetic resonance imaging in murine lupus nephritis Kidney Int 2012 81 2 152 159 10.1038/ki.2011.332 21956190 PMC3375901 94 Sharif-Paghaleh E et al Non-Invasive whole-body detection of complement activation using radionuclide imaging in a mouse model of myocardial ischaemia-reperfusion injury Sci Rep 2017 7 1 16090 10.1038/s41598-017-16387-1 29170426 PMC5700950 95 Westall GP et al C3d and C4d deposition early after lung transplantation J Heart Lung Transplant 2008 27 7 722 728 10.1016/j.healun.2008.03.018 18582800 96 DeNicola MM et al Pathologic findings in lung allografts with anti-HLA antibodies J Heart Lung Transplant 2013 32 3 326 332 10.1016/j.healun.2012.11.018 23313559 PMC3878303 97 Brugiere O et al Role of C1q-binding anti-HLA antibodies as a predictor of lung allograft outcome Eur Respir J 2018 52 2 1701898 10.1183/13993003.01898-2017 29976654 98 Vandermeulen E et al Humoral immunity in phenotypes of chronic lung allograft dysfunction: A broncho-alveolar lavage fluid analysis Transpl Immunol 2016 38 27 32 10.1016/j.trim.2016.08.004 27561239 99 Budd SJ et al Increased plasma mannose binding lectin levels are associated with bronchiolitis obliterans after lung transplantation Respir Res 2012 13 1 56 10.1186/1465-9921-13-56 22762710 PMC3441326 100 Budding K et al A promoter polymorphism in the CD59 complement regulatory protein gene in donor lungs correlates with a higher risk for chronic rejection after lung transplantation Am J Transplant 2016 16 3 987 998 10.1111/ajt.13497 26517734 101 Kulkarni HS, et al. Impaired complement regulation drives chronic lung allograft dysfunction after lung transplantation [preprint]. 10.1101/2024.11.17.623951 Posted on bioRxiv November 18, 2024 102 Cohen D et al Pros and cons for C4d as a biomarker Kidney Int 2012 81 7 628 639 10.1038/ki.2011.497 22297669 PMC3771104 103 Kleiboeker HL et al A complement to traditional treatments for antibody-mediated rejection? Use of eculizumab in lung transplantation: a review and early center experience Ann Pharmacother 2024 58 9 947 955 10.1177/10600280231213112 37994573 104 Santarsiero D Aiello S The complement system in kidney transplantation Cells 2023 12 5 791 10.3390/cells12050791 36899927 PMC10001167 105 Thorgersen EB et al The role of complement in liver injury, regeneration, and transplantation Hepatology 2019 70 2 725 736 10.1002/hep.30508 30653682 PMC6771474 106 Steggerda JA Heeger PS The promise of complement therapeutics in solid organ transplantation Transplantation 2024 108 9 1882 1894 10.1097/TP.0000000000004927 38361233 107 Pratt JR et al Local synthesis of complement component C3 regulates acute renal transplant rejection Nat Med 2002 8 6 582 587 10.1038/nm0602-582 12042808 108 Farrar CA et al Local extravascular pool of C3 is a determinant of postischemic acute renal failure FASEB J 2006 20 2 217 226 10.1096/fj.05-4747com 16449793 109 Peng Q et al Local production and activation of complement up-regulates the allostimulatory function of dendritic cells through C3a-C3aR interaction Blood 2008 111 4 2452 2461 10.1182/blood-2007-06-095018 18056835 110 Li W et al Bronchus-associated lymphoid tissue-resident Foxp3+ T lymphocytes prevent antibody-mediated lung rejection J Clin Invest 2019 129 2 556 568 10.1172/JCI122083 30561386 PMC6355223 111 Babu AN et al Microvascular destruction identifies murine allografts that cannot be rescued from airway fibrosis J Clin Invest 2007 117 12 3774 3785 10.1172/JCI32311 18060031 PMC2096438 112 Khan MA et al CD4+ T cells and complement independently mediate graft ischemia in the rejection of mouse orthotopic tracheal transplants Circ Res 2011 109 11 1290 1301 10.1161/CIRCRESAHA.111.250167 21998328 PMC3243047 113 Jane-Wit D et al Alloantibody and complement promote T cell-mediated cardiac allograft vasculopathy through noncanonical nuclear factor-κB signaling in endothelial cells Circulation 2013 128 23 2504 2516 10.1161/CIRCULATIONAHA.113.002972 24045046 PMC3885874 114 Xie CB et al Complement membrane attack complexes assemble NLRP3 inflammasomes triggering IL-1 activation of IFN-γ-primed human endothelium Circ Res 2019 124 12 1747 1759 10.1161/CIRCRESAHA.119.314845 31170059 PMC6557295 115 Wang A et al Ex vivo enzymatic treatment converts blood type A donor lungs into universal blood type lungs Sci Transl Med 2022 14 632 eabm7190 10.1126/scitranslmed.abm7190 35171649 116 Chaban R et al Increased human complement pathway regulatory protein gene dose is associated with increased endothelial expression and prolonged survival during ex-vivo perfusion of GTKO pig lungs with human blood Xenotransplantation 2023 30 4 e12812 10.1111/xen.12812 37504492 117 De Wolf J et al Prolonged dialysis during ex vivo lung perfusion promotes inflammatory responses Front Immunol 2024 15 1365964 10.3389/fimmu.2024.1365964 38585271 PMC10995259 118 Delaura IF et al Complement-targeting therapeutics for ischemia-reperfusion injury in transplantation and the potential for ex vivo Front Immunol 2022 13 1000172 10.3389/fimmu.2022.1000172 36341433 PMC9626853 119 Ku TJY et al Ex-vivo delivery of monoclonal antibody (Rituximab) to treat human donor lungs prior to transplantation EBioMedicine 2020 60 102994 10.1016/j.ebiom.2020.102994 32950000 PMC7501077 120 Kassimatis T et al Ex vivo delivery of Mirococept: A dose-finding study in pig kidney after showing a low dose is insufficient to reduce delayed graft function in human kidney Am J Transplant 2021 21 3 1012 1026 10.1111/ajt.16265 33225626 121 Naka Y et al Complement activation as a cause for primary graft failure in an isogeneic rat model of hypothermic lung preservation and transplantation Transplantation 1997 64 9 1248 1255 10.1097/00007890-199711150-00004 9371664 122 Schmid RA et al Effect of soluble complement receptor type 1 on reperfusion edema and neutrophil migration after lung allotransplantation in swine J Thorac Cardiovasc Surg 1998 116 1 90 97 10.1016/S0022-5223(98)70246-6 9671902 123 Scherer M et al C1-esterase inhibitor reduces reperfusion injury after lung transplantation Ann Thorac Surg 2002 73 1 233 8; discussion 238 10.1016/S0003-4975(01)03235-0 11834015 124 Salvatierra A et al C1-esterase inhibitor prevents early pulmonary dysfunction after lung transplantation in the dog Am J Respir Crit Care Med 1997 155 3 1147 1154 10.1164/ajrccm.155.3.9117001 9117001 125 Keshavjee S et al A randomized, placebo-controlled trial of complement inhibition in ischemia-reperfusion injury after lung transplantation in human beings J Thorac Cardiovasc Surg 2005 129 2 423 428 10.1016/j.jtcvs.2004.06.048 15678055 126 Sommer W et al C1-esterase-inhibitor for primary graft dysfunction in lung transplantation Transplantation 2014 97 11 1185 1191 10.1097/TP.0000000000000034 24573112 127 Devaquet J et al Perioperative C1-esterase inhibitor therapy to allow transplantation in a highly sensitized lung transplant candidate: Three case reports Am J Transplant 2025 25 7 1540 1546 10.1016/j.ajt.2025.02.009 39978596 128 Muller YD et al Acute antibody-mediated rejection 1 week after lung transplantation successfully treated with eculizumab, intravenous immunoglobulins, and rituximab Transplantation 2018 102 6 e301 e303 10.1097/TP.0000000000002165 29521880 129 Dawson KL et al Treatment of hyperacute antibody-mediated lung allograft rejection with eculizumab J Heart Lung Transplant 2012 31 12 1325 1326 10.1016/j.healun.2012.09.016 23063321 130 Parquin F et al C1-esterase inhibitor treatment for antibody-mediated rejection after lung transplantation: two case reports Eur Respir J 2020 55 4 1902027 10.1183/13993003.02027-2019 32079639 131 Struber M et al C1-esterase inhibitor in graft failure after lung transplantation Intensive Care Med 1999 25 11 1315 1318 10.1007/s001340051065 10654221 132 Nakashima S et al Membrane attack complex contributes to destruction of vascular integrity in acute lung allograft rejection J Immunol 2002 169 8 4620 4627 10.4049/jimmunol.169.8.4620 12370401 133 Atkinson C et al Donor brain death exacerbates complement-dependent ischemia/reperfusion injury in transplanted hearts Circulation 2013 127 12 1290 1299 10.1161/CIRCULATIONAHA.112.000784 23443736 PMC3721358 134 Atkinson C et al Targeted complement inhibitors protect against posttransplant cardiac ischemia and reperfusion injury and reveal an important role for the alternative pathway of complement activation J Immunol 2010 185 11 7007 7013 10.4049/jimmunol.1001504 20962256 135 Lin C et al Complement inhibition alleviates donor brain death-induced liver injury and posttransplant cascade injury by regulating phosphoinositide 3-kinase signaling Am J Transplant 2023 23 4 484 497 10.1016/j.ajt.2023.01.019 36746335 136 He S et al A role for complement in the enhanced susceptibility of steatotic livers to ischemia and reperfusion injury J Immunol 2009 183 7 4764 4772 10.4049/jimmunol.0900550 19752222 137 Zheng C et al Increasing the efficacy and safety of a human complement inhibitor for treating post-transplant cardiac ischemia reperfusion injury by targeting to a graft-specific neoepitope J Heart Lung Transplant 2021 40 10 1112 1121 10.1016/j.healun.2021.07.004 34334299 PMC10587835 138 Li K et al Solution structure of TT30, a novel complement therapeutic agent, provides insight into its joint binding to complement C3b and C3d J Mol Biol 2012 418 3-4 248 263 10.1016/j.jmb.2012.02.038 22387467 139 Risitano AM et al The complement receptor 2/factor H fusion protein TT30 protects paroxysmal nocturnal hemoglobinuria erythrocytes from complement-mediated hemolysis and C3 fragment Blood 2012 119 26 6307 6316 10.1182/blood-2011-12-398792 22577173 140 Li Y et al Complement opsonization of nanoparticles: Differences between humans and preclinical species J Control Release 2021 338 548 556 10.1016/j.jconrel.2021.08.048 34481928 PMC8552414 141 Mastellos DC et al A guide to complement biology, pathology and therapeutic opportunity Nat Rev Immunol 2024 24 2 118 141 10.1038/s41577-023-00926-1 37670180 142 Molina H The murine complement regulator Crry: new insights into the immunobiology of complement regulation Cell Mol Life Sci 2002 59 2 220 229 10.1007/s00018-002-8418-6 11915940 PMC11146131 143 Noris M Remuzzi G Overview of complement activation and regulation Semin Nephrol 2013 33 6 479 492 10.1016/j.semnephrol.2013.08.001 24161035 PMC3820029 144 Qin X et al Genomic structure, functional comparison, and tissue distribution of mouse Cd59a and Cd59b Mamm Genome 2001 12 8 582 589 10.1007/s00335-001-2060-8 11471050 145 Chen J et al Mouse Cd59b but not Cd59a is upregulated to protect cells from complement attack in response to inflammatory stimulation Genes Immun 2015 16 7 437 445 10.1038/gene.2015.29 26204229 146 Zheng YY et al Association of C5aR1genetic polymorphisms with coronary artery disease in a Han population in Xinjiang, China Diagn Pathol 2015 10 33 10.1186/s13000-015-0261-9 25924896 PMC4414445 147 Yadav MK et al Molecular basis of anaphylatoxin binding, activation, and signaling bias at complement receptors Cell 2023 186 22 4956 4973 10.1016/j.cell.2023.09.020 37852260 PMC7615941 148 Wang H et al Inhibition of terminal complement components in presensitized transplant recipients prevents antibody-mediated rejection leading to long-term graft survival and accommodation J Immunol 2007 179 7 4451 4463 10.4049/jimmunol.179.7.4451 17878341 149 Park P et al Inhibiting the complement system does not reduce injury in renal ischemia reperfusion J Am Soc Nephrol 2001 12 7 1383 1390 10.1681/ASN.V1271383 11423567 150 Devalaraja-Narashimha K et al Humanized C3 mouse: a novel accelerated model of C3 glomerulopathy J Am Soc Nephrol 2021 32 1 99 114 10.1681/ASN.2020050698 33288630 PMC7894673 151 Zen M et al Protective molecules and their cognate antibodies: new players in autoimmunity Auto Immun Highlights 2010 1 2 63 72 10.1007/s13317-010-0010-8 26000109 PMC4389047 152 Ogden CA et al C1q and mannose binding lectin engagement of cell surface calreticulin and CD91 initiates macropinocytosis and uptake of apoptotic cells J Exp Med 2001 194 6 781 795 10.1084/jem.194.6.781 11560994 PMC2195958 153 Kawai T et al Xenotransplantation of a porcine kidney for end-stage kidney disease N Engl J Med 2025 392 19 1933 1940 10.1056/NEJMoa2412747 39927618 Version 1 10/01/2025 Electronic publication Figure 1 Canonical activation of the complement cascade. The complement cascade can be viewed as one that can be triggered by a series of proteases, causing it to assemble into convertases that cleave key proteins such as C3 and C5, thus amplifying the cascade and, ultimately, attacking the target. The cascade is triggered via the CP (primarily by antigen-antibody complexes) or the lectin pathway (by carbohydrates on surfaces binding to pattern recognition molecules such as mannose-binding lectin [MBL] or ficolins, and C2 and C4 cleavage by mannose-associated serine proteases [MASPs] or small MBL-associated proteins [sMAP]), to form an enzyme that cleaves C3, called the C3 convertase (C4bC2b). The alternative pathway can be initiated in the fluid phase by the conversion of C3 to C3(H 2 Figure 2 Proposed scenarios and consequences of local complement activation in lung transplantation. ( A B C Figure 3 Therapies for systemic and local complement inhibition. (Left) Currently available FDA-approved complement therapeutics function via systemic inhibition of complement activation. These include inhibitors of the initiation stage (C1 esterase inhibitors [such as berinert, cinryze, haegarda, or ruconest]) or those targeting C1s (such as sutimlimab), central component C3 (pegceptacoplan), the amplification loop (iptacopan, targeting factor B; danicopan, targeting factor D), or at terminal effector pathways (eculizumab, ravulizumab, or zilucoplan, targeting C5) and C5a signaling (avacopan) ( Table 3 120 134 137 53 63 28 33 Table 3 Summary of current studies using complement inhibition in lung transplantation Table 2 Summary of experimental models used to dissect role of complement in lung transplantation Table 1 Summary of specific complement proteins/activation at different stages of the lung transplantation process ",
  "metadata": {
    "Title of this paper": "Xenotransplantation of a porcine kidney for end-stage kidney disease",
    "Journal it was published in:": "The Journal of Clinical Investigation",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483610/"
  }
}