{
  "title": "Paper_1094",
  "abstract": "pmc Viruses Viruses 1559 viruses viruses Viruses 1999-4915 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474466 PMC12474466.1 12474466 12474466 41012702 10.3390/v17091276 viruses-17-01276 1 Review Molecular Insights into HPV-Driven Head and Neck Cancers: From Viral Oncoproteins to Precision Therapeutics Ozdogan Mustafa 1 * Tutkun Gizem 2 Cakir Muharrem Okan 3 https://orcid.org/0000-0002-4516-5111 Ashrafi Gholam Hossein 3 Mymryk Joe S. Academic Editor 1 2 gizemtutkun17@gmail.com 3 m.okan@kingston.ac.uk h.ashrafi@kingston.ac.uk * ozdoganmd@yahoo.com 20 9 2025 9 2025 17 9 497677 1276 19 7 2025 19 9 2025 19 9 2025 20 09 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Human papillomavirus (HPV) plays a major role in the development of head and neck cancers (HNCs), particularly oropharyngeal squamous cell carcinoma. This review highlights the key molecular mechanisms of HPV-driven carcinogenesis, focusing on the oncogenic E6 and E7 proteins and their disruption of tumor suppressor pathways and epigenetic regulation. We discuss the rising prevalence of HPV-related HNCs, their distinct clinical features, and diagnostic approaches such as p16 immunohistochemistry and HPV DNA/RNA detection. HPV-positive tumors show better prognosis and response to treatment, prompting interest in therapy de-escalation. Emerging strategies including immune checkpoint inhibitors, therapeutic vaccines, CRISPR-based gene editing, and ctDNA monitoring are advancing precision oncology in this field. We also examine the preventive potential of HPV vaccination and ongoing research into its role across various HNC subtypes. A deeper understanding of HPV’s molecular impact may guide more effective, targeted, and less toxic interventions. human papillomavirus HPV head and neck squamous cell carcinoma HNSCC E6/E7 oncoproteins biomarkers The authors received no extramural funding for the study. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Head and neck cancers (HNCs) rank among the top ten most common malignancies worldwide, affecting the upper respiratory and digestive tracts [ 1 2 3 4 5 Globally, HNCs account for approximately 3–5% of all cancers, with more than 660,000 new cases and 350,000 deaths annually [ 1 6 7 HPV is a DNA virus implicated in several cancers, including those of the cervix, anus, and oropharynx. Its oncogenic potential lies in high-risk types, particularly HPV16 and HPV18, which drive malignant transformation through expression of the viral oncoproteins E6 and E7 [ 8 9 10 Understanding the mechanisms by which HPV contributes to the pathogenesis of HNCs is essential for developing effective strategies for prevention, early detection, and treatment. This review provides a comprehensive overview of HPV-associated HNCs, addressing their epidemiology, molecular virology, clinical features, and therapeutic implications. 2. Epidemiology, Prevalence and Demographic Trends of HPV-Related HNCs HNCs represent a major global health burden [ 11 3 12 Table 1 Beyond clinicopathological differences, HPV-related HNCs show distinct anatomical patterns. The oropharynx, especially the tonsils and base of tongue, is the most frequent site, followed by less common subsites such as the hypopharynx, nasopharynx, sinonasal cavity, and salivary glands ( Figure 1 The incidence of HPV-positive OPSCC has risen sharply in North America and Europe, in contrast to HPV-negative disease which has declined due to reduced tobacco use. For example, between 1988 and 2004, HPV-positive OPSCC increased by 225%, whereas HPV-negative OPSCC decreased by 50% [ 16 17 HPV-positive HNCs are anatomically distinct, most frequently arising in lymphoid-rich areas of the oropharynx, especially the tonsils and base of tongue, with rarer cases in the hypopharynx, nasopharynx, and sinonasal tract [ 18 14 Demographically, HPV-positive HNCs differ from HPV-negative tumors. They are more common in younger to middle-aged patients, predominantly in men (male-to-female ratio ~3–4:1), and occur more often in Caucasian populations [ 19 18 HPV type distribution also differs by site. In OPSCC, HPV16 accounts for >80–90% of cases, HPV33 contributes ~3–5%, and HPV18 is rare (~2–3%) [ 20 21 Patients with HPV-positive OPSCC often present with small primary tumors but advanced cervical lymphadenopathy, usually as painless neck masses. Despite nodal burden, they generally show better response to chemoradiotherapy, and improved survival outcomes compared with HPV-negative patients [ 22 viruses-17-01276-t001_Table 1 Table 1 Comparative Clinical, Epidemiological, and Pathological Features of HPV-positive and HPV-negative Head and Neck Squamous Cell Carcinoma (HNSCC) [ 12 17 19 Feature HPV-Related HNC Notes Common anatomical subsites Oropharynx (tonsils, base of tongue, soft palate, pharyngeal wall) Tonsil is the most frequent site Less common subsites Larynx, hypopharynx, sinonasal cavity, nasopharynx, salivary glands HPV prevalence varies by cohort, usually lower than oropharynx Histological type Predominantly squamous cell carcinoma (SCC) Non-keratinizing basaloid morphology more frequent in HPV+ tumors Global incidence >660,000 new HNC cases annually; ~30–40% of OPSCC are HPV+ globally Incidence rising in Europe and North America HPV type distribution HPV16 (~80–90%), HPV33 (~3–5%), HPV18 (~2–3%) Differs from cervical cancer, where HPV16/18 dominate Demographic trends Higher incidence in men vs. women (3–4:1); increasing in older cohorts Linked to sexual behavior and birth cohort effects Clinical presentation Often presents with small primary tumor and early lymph node metastasis Painless cervical lymphadenopathy is common initial sign Distant Organ Metastasis Unusual sites: skin, brain Lung Histopathological Features Non-keratinizing or basaloid Keratinizing Tumor Differentiation Undifferentiated Differentiated Sensitivity to Chemoradiotherapy Better response Worse response Prognosis (Survival) Better prognosis Worse prognosis 3. Virology and Mechanism of HPV in HNCs HPVs are non-enveloped viruses belonging to the Papillomaviridae 23 24 Figure 2 25 HPV is a central factor in the etiology of various malignancies, including HNCs. Its oncogenic potential stems from the ability of viral proteins to disrupt key tumor suppressor pathways within host cells [ 27 3.1. Oncogenic Mechanism of HPV HPVs are divided into low-risk and high-risk types based on their oncogenic potential. Low-risk types, such as HPV6 and HPV11, are associated mainly with benign conditions including genital warts and recurrent respiratory papillomatosis, and they rarely progress to malignancy [ 28 29 A key distinction between low-risk and high-risk HPVs is their capacity to integrate into the host genome and the oncogenic consequences that follow. In benign lesions, such as genital warts, HPV typically persists in an episomal form, separate from host chromatin. By contrast, viral integration frequently in cervical carcinogenesis and present in a subset of HPV-positive HNSCCs is a critical driver of malignant progression. Integration disrupts the viral E2 gene, leading to uncontrolled expression of the viral oncogenes E6 and E7, while also contributing to host genomic instability [ 30 31 32 33 34 30 31 33 Beyond integration, viral proteins play central roles in oncogenesis. The E5 protein localizes to the endoplasmic reticulum and Golgi apparatus, where it interferes with antigen presentation by reducing the transport of MHC class I molecules to the cell surface. This enables immune evasion by limiting recognition of infected cells by cytotoxic T lymphocytes, thereby supporting viral persistence and potentially contributing to carcinogenesis [ 35 The oncogenic potential of high-risk HPV types is, however, largely mediated by E6 and E7 oncoproteins ( Figure 3 36 37 38 39 40 41 42 43 44 In conclusion, the oncogenic mechanisms of HPV involve a multifaceted interplay between viral genome status and viral oncoproteins. Integration events can deregulate E6/E7 expression, while E5 facilitates immune evasion. Together, the actions of E5, E6, and E7 converge on key tumor suppressor pathways, particularly those mediated by p53 and Rb, driving uncontrolled proliferation and malignant transformation. Elucidating these mechanisms is essential for developing preventive and therapeutic strategies against HPV-related HNCs [ 46 47 3.2. HPV Mechanisms Affected by Epigenetic Regulation The activity of HPV oncogenes is strongly influenced by epigenetic regulation, which involves chemical and structural modifications of DNA and chromatin. The p97 promoter, located within the long control region (LCR), serves as a key regulatory hub. Its activity is modulated by epigenetic marks and transcription factors that either suppress or activate viral oncogene expression [ 47 Figure 4 22 In addition to YY1, the chromatin organizer CCCTC-binding factor (CTCF) contributes to epigenetic control by forming repressive chromatin loops within the HPV genome. These loops prevent access of RNA polymerase and restrict viral oncogene transcription. During differentiation, the disruption of these loops enables E6 and E7 expression [ 32 48 Figure 4 49 A further layer of regulation involves histone methylation. HPV31 E7 has been shown to upregulate SETD2, a histone methyltransferase responsible for depositing H3K36me3 marks on viral chromatin. This modification promotes transcription of selected viral genes. Importantly, E6 and E7 loci lack H3K36me3 deposition, allowing these oncogenes to evade repression and remain highly expressed ( Figure 4 33 34 32 33 34 These epigenetic mechanisms play a key role in determining the extent of HPV’s pathogenicity within the host, contributing to its potential to induce malignancy. 3.3. The Role of DNA Methylation in the HPV Mechanism HPV’s DNA methylation patterns play a critical role in regulating viral replication, gene expression, and oncogenic transformation ( Figure 5 50 In HPV16, E2 binding sites (E2BS) typically remain hypomethylated in low-grade lesions, maintaining normal viral transcriptional control. However, in high-grade lesions these sites become hypermethylated, correlating with activation of the early promoter and an increased likelihood of viral integration. Such methylation changes are critical events in the transition from benign to malignant disease [ 51 Hypermethylation of the L1 region has also been consistently associated with high-grade lesions and invasive cervical cancer. These findings indicate that methylation at specific genomic sites can serve as a biomarker of disease severity and risk of progression [ 51 HPV18 demonstrates a higher integration frequency than HPV16; nevertheless, viral integration is not always necessary for malignant transformation. Instead, abnormal DNA methylation at E2BS can disrupt the regulation of E6/E7 oncogenes independently of integration, thereby contributing to oncogenic progression [ 52 Interestingly, environmental and nutritional factors also appear to influence methylation. Micronutrients such as folate and vitamin B12 have been shown to enhance methylation at the E6 region, which may provide a protective effect against the progression of low-grade CIN2+ lesions [ 47 53 These findings suggest that HPV methylation profiles are not only critical in regulating viral replication and gene expression but also play a key role in determining cancer risk. valuable insights for the development of diagnostic and therapeutic approaches. 3.4. Long Non-Coding RNAs HPV alters host and viral non-coding RNA networks, which play a key role in malignant transformation. Non-coding RNAs (ncRNAs) include microRNAs (miRNAs), circular RNAs (circRNAs), and long non-coding RNAs (lncRNAs). Among these, lncRNAs—defined as transcripts longer than 200 nucleotides that lack protein-coding capacity—are particularly implicated in HNCs, as they regulate transcription, translation, and chromatin remodeling [ 54 55 One example is CCEPR (cervical carcinoma expressed PCNA regulatory lncRNA), which localizes to both the nucleus and cytoplasm of oral squamous cell carcinoma cells. Acting as an oncogene, it sponges miR-922 and thereby increases expression of PAK2, a kinase involved in PI3K/AKT and MAPK/ERK signaling, as well as cytoskeletal dynamics, proliferation, and survival [ 56 Another lncRNA, FAM83H-AS1, is highly expressed in cervical cancers and HPV16-positive HNSCC cell lines compared to HPV-negative counterparts. Its upregulation is driven by E6/E7 in a p53-independent but p300-dependent manner. Suppression of FAM83H-AS1 reduces proliferation, migration, and survival, underscoring its role in early carcinogenesis [ 57 Conversely, PRINS (psoriasis susceptibility-related RNA gene induced by stress) is overexpressed in HPV-positive HNSCC and correlates with antiviral and immune response genes. Its expression promotes immune infiltration, which may help explain the better treatment responses observed in HPV-positive patients [ 58 Additional dysregulated lncRNAs in HPV-positive HNSCC include CDKN2B-AS1, TTTY14, TTTY15, MEG3, and H19, many of which are associated with immune modulation and tumor suppression [ 47 59 3.5. Epigenetic Alterations and Their Potential as Biomarker Distinct methylation and chromatin profiles have been identified in HPV-positive cancers, distinguishing them from both normal tissues and HPV-negative counterparts [ 47 60 60 61 Emerging evidence suggests that epigenetic signatures may outperform traditional biomarkers such as p16 in sensitivity and specificity. Integrating epigenetic profiling into clinical practice could facilitate personalized treatment strategies and enable more precise patient risk stratification. 4. Clinical Presentation and Diagnosis 4.1. Symptoms and Presentation HNCs present with diverse clinical features depending on their etiology, with HPV-related and HPV-negative tumors showing distinct characteristics [ 18 62 21 63 Despite their relatively small primary size, HPV-positive tumors frequently present with advanced cervical lymph node metastasis. While the rate of distant metastasis is similar to HPV-negative HNCs, when present they often follow a more aggressive dissemination pattern [ 64 By contrast, HPV-negative HNCs usually present with more pronounced local symptoms, including severe throat pain, progressive dysphagia, otalgia, and hoarseness. These cancers, strongly associated with tobacco and alcohol exposure, often involve the oral cavity, larynx, and hypopharynx sites less commonly affected by HPV [ 65 66 4.2. Diagnostic Methods and Challenges Accurate diagnosis of HPV-related HNCs is critical given their distinct prognosis and treatment response [ 67 68 4.2.1. Key Diagnostic Differences Histopathology and p16 Immunohistochemistry: p16 overexpression is widely used as a surrogate marker of HPV-driven oncogenesis in OPSCC. Although not entirely specific, strong and diffuse nuclear/cytoplasmic p16 staining strongly correlates with high-risk HPV, particularly HPV16 [ 69 70 71 Morphologically, HPV-positive tumors display a basaloid, non-keratinizing phenotype with less differentiation, whereas HPV-negative tumors more often show keratinizing morphology [ 72 73 HPV DNA/RNA Testing: DNA-based methods such as polymerase chain reaction (PCR) and in situ hybridization (ISH) detect the presence of high-risk HPV DNA, with PCR offering high sensitivity [ 74 75 RNA-based methods assess expression of E6/E7 mRNA, confirming transcriptionally active infection and distinguishing transforming infections from latent ones [ 76 77 78 Comparison with HPV-Negative HNCs: HPV-negative HNCs rarely show p16 overexpression and typically harbor genomic alterations such as TP53 mutations, especially in smokers. Their absence of HPV biomarkers underscores the need to combine histology with molecular tests for accurate diagnosis [ 79 80 81 4.2.2. Emerging Diagnostic Methods for HPV-Related HNCs As the understanding of HPV-related HNCs evolves, so do the diagnostic techniques used to identify and characterize these cancers. Several emerging methods offer the potential to improve the accuracy and specificity of HPV-related HNC diagnosis [ 82 Next-Generation Sequencing (NGS): 83 83 Liquid Biopsy: 84 Circulating Biomarkers: 85 86 87 88 4.2.3. Challenges in the Diagnosis of HPV-Related HNCs Asymptomatic Presentation: 62 63 67 False Positives and Negatives: 70 Tumor Heterogeneity: 87 88 4.2.4. Role of Biomarkers in Diagnosis Biomarkers play a crucial role in the accurate diagnosis of HPV-related HNCs, offering insights into tumor biology, prognosis, and potential therapeutic targets. As previously discussed, p16 remains the most widely used surrogate marker for HPV in oropharyngeal cancers (OPC) [ 79 89 90 85 86 Table 2 Research into additional biomarkers, such as specific miRNAs and proteins, is ongoing. These biomarkers could help stratify patients based on their risk and guide personalized treatment approaches. For example, lower expression of certain miRNAs may be associated with more aggressive disease and poorer outcomes [ 90 93 94 The diagnosis of HPV HNCs requires a nuanced approach that integrates clinical evaluation, histopathological assessment, and advanced molecular testing. Emerging diagnostic techniques and biomarkers hold the promise of improving diagnostic accuracy and enabling earlier detection of these cancers. As research continues to unfold, the hope is that these advancements will lead to more personalized and effective treatment strategies for patients with HPV-related HNCs. 5. Treatment and Prognosis The management of HNSCC has evolved significantly with the recognition of distinct subgroups based on HPV status [ 95 96 5.1. Standard Treatment Approaches for HPV-Related HNCs Radiotherapy (RT): 97 98 99 Two randomized trials showed that replacing cisplatin with cetuximab during definitive radiotherapy leads to inferior outcomes: in RTOG 1016, 5-year OS was 84.6% with cisplatin versus 77.9% with cetuximab (HR for death 1.45), with no overall reduction in moderate-to-severe toxicity; in De-ESCALaTE, 2-year OS was 97.5% vs. 89.4% and 2-year recurrence 6.0% vs. 16.1% favoring cisplatin, again without a toxicity advantage for cetuximab [ 100 101 102 103 Chemoradiotherapy (CRT): 95 104 105 106 Surgery: 107 108 5.2. Emerging and Investigational Treatment Modalities Immune checkpoint inhibitors (ICIs) have transformed the management of recurrent/metastatic HNSCC, with pembrolizumab and nivolumab now standard of care. In KEYNOTE-048, pembrolizumab (alone or with platinum/5-FU) improved OS compared with the EXTREME regimen, establishing it as a first-line option [ 109 110 111 112 Perioperative immunotherapy is now reshaping curative-intent management. In the phase III KEYNOTE-689 trial, adding neoadjuvant and adjuvant pembrolizumab to standard therapy significantly improved event-free survival in resectable, locally advanced HNSCC an effect most evident in PD-L1 CPS ≥1 disease [ 113 Novel strategies are being developed on this immunotherapy backbone. Therapeutic vaccines targeting HPV E6/E7 are in clinical testing [ 114 115 116 117 118 119 120 121 122 118 Targeted therapies are being investigated, particularly against PI3K/Akt/mTOR signalling upregulated by E6/E7. While mTOR inhibition alone has shown modest efficacy, ongoing trials are assessing adjuvant benefit [ 123 124 De-escalation strategies have been tested, including hypoxia-guided RT dose reduction (30 Gy achieving ~95% 2-year locoregional control) [ 125 126 127 Liquid biopsy approaches, particularly circulating tumor HPV DNA, are emerging as promising tools for minimal residual disease monitoring. The HPV-DeepSeek assay detected recurrence a median of 207 days before clinical diagnosis and predicted worse PFS in patients with persistent ctHPV DNA [ 128 Gene-editing technologies, including CRISPR/Cas9 targeting E6/E7, have induced apoptosis and growth arrest in preclinical models [ 129 130 131 132 133 In summary, the treatment paradigm in HPV-related HNSCC is shifting toward personalized, immune- and biomarker-driven approaches. The integration of ICIs, vaccines, molecular targets, and cell therapies is reshaping clinical trial designs, with radiation de-escalation and liquid biopsy technologies further enabling risk-adapted strategies. 5.3. Prognosis and Survival Outcomes HPV-positive HNSCC patients have significantly better prognosis compared with HPV-negative counterparts, largely due to improved radiosensitivity and younger, healthier patient populations [ 134 135 136 137 However, concurrent smoking reduces the survival benefit in HPV-positive patients, leading to outcomes more similar to HPV-negative disease. This highlights the importance of integrating smoking cessation into treatment plans [ 136 95 137 6. HPV Vaccines and Prevention of HPV-Related HNCs Vaccination against HPV represents one of the most significant public health measures for preventing HPV-associated diseases, including HNCs [ 138 139 140 141 142 143 To date, three prophylactic vaccines have been approved. Gardasil (quadrivalent) targets HPV types 6, 11, 16, and 18, while Cervarix (bivalent) protects against HPV16 and HPV18. The most recent, Gardasil9 (nonavalent), covers HPV types 6, 11, 16, 18, 31, 33, 45, 52, and 58, providing broader protection [ 144 145 139 45 146 6.1. Therapeutic Vaccines While prophylactic vaccines have successfully reduced infection rates and precancerous lesions, they are ineffective against established HPV infections or HPV-driven neoplasms. Consequently, therapeutic vaccine development remains an important area of research [ 146 147 148 Alternative strategies are exploring vaccines against other viral proteins, such as L2, as well as innovative platforms including DNA- and vector-based vaccines. Combining therapeutic vaccines with immune checkpoint inhibitors has also demonstrated encouraging results, suggesting synergistic effects that may enhance tumor-specific immunity [ 120 149 150 6.2. Effectiveness in Preventing HNCs Although HPV vaccines were developed primarily for cervical and anogenital cancers, mounting evidence supports their role in preventing HNCs, particularly OPCs, where HPV16 is the predominant driver [ 12 150 151 151 151 152 153 6.3. Vaccination Strategies and Global Challenges The most effective HPV vaccination strategies target children aged 9–14, before sexual debut, ensuring immunity prior to viral exposure [ 154 155 156 157 156 158 159 Vaccine hesitancy also plays a significant role, often driven by cultural barriers, stigma around sexual activity, or concerns about side effects [ 157 160 158 161 162 163 164 Although HPV vaccination was initially restricted to adolescents, programs have expanded to include adults. In the United States, the FDA has approved vaccination for individuals aged 27–45, particularly those not previously exposed to the virus [ 160 163 155 7. Ongoing Research into HNCs—Related to HPV HPV is a well-established etiological driver of HNCs; with its role most clearly demonstrated in OPSCC. Nevertheless, research efforts are increasingly extending beyond OPSCC to evaluate the contribution of HPV to other subsites, including the larynx, hypopharynx, sinonasal cavity, nasopharynx, and salivary glands. These investigations seek to clarify the molecular mechanisms underlying HPV-driven carcinogenesis in these regions, to define the clinical and prognostic implications of viral involvement, and to identify opportunities for therapeutic innovation in cancer types where the oncogenic role of HPV remains less well characterized. 7.1. Oropharyngeal Cancer High-risk HPV is a major cause of OPSCC, which has now surpassed cervical cancer in the United States to become the most common HPV-related malignancy [ 144 165 166 167 Epidemiological studies indicate that the rising incidence of HPV-positive OPSCC in Western countries is strongly linked to changing sexual behaviors, particularly the increasing prevalence of oral sexual practices over the past five decades [ 168 169 170 Importantly, transcriptionally active HPV infection, demonstrated by the presence of E6/E7 mRNA, is critical for accurate diagnosis and clinical management, as HPV-positive OPSCC is associated with better prognosis and distinct therapeutic implications [ 171 172 173 Moreover, the strong viral antigenicity of HPV-positive tumors has provided a rationale for integrating immunotherapy into earlier stages of treatment. Recent trials of neoadjuvant immune checkpoint inhibitors in OPSCC suggest that these agents may permit reduced doses of surgery, radiotherapy, or chemotherapy, thereby improving quality of life while preserving survival outcomes [ 174 7.2. Laryngeal Cancer The role of HPV in laryngeal squamous cell carcinoma (LSCC) is less clearly established than in OPSCC, yet several studies suggest potential clinical relevance. HPV-positive and PD-L1–positive LSCC patients demonstrated better overall survival, with PD-L1 positivity more frequent in non-smokers. These findings indicate that HPV and PD-L1 status may represent independent favorable prognostic factors and support exploration of immune checkpoint inhibitors in LSCC [ 174 By contrast, other investigations highlight the rarity of HPV involvement. In one analysis of 78 LSCC samples, HPV DNA was detected in only 9%, and p16 was not considered a reliable surrogate marker [ 89 175 A systematic review of 77 studies spanning nearly a century emphasized the overall low prevalence of HPV in LSCC but highlighted the need for advanced models to rigorously study high-risk HPV types [ 176 7.3. Hypopharyngeal Cancer Emerging evidence suggests that HPV positivity may confer a survival advantage in hypopharyngeal squamous cell carcinoma (HPSCC). In one cohort of 108 patients, HPV16-positive tumors exhibited significantly higher tumor-infiltrating lymphocyte (TIL) density and improved three-year survival rates compared with HPV-negative tumors [ 177 Large-scale analyses support this trend. Data from the U.S. National Cancer Database (NCDB) including more than 9000 patients showed that HPV-positive HPSCC was associated with improved survival regardless of treatment modality [ 178 179 7.4. Sinonasal Cancer HPV contributes to a subset of sinonasal squamous cell carcinomas (SNSCC). Recent studies estimate that 25–30% of SNSCC cases are HPV-positive, with HPV16 the predominant genotype [ 180 181 Histological analyses show broad morphological diversity. In a series of 153 tumors, 18% of HPV-related SNSCCs were classified as non-keratinizing or partially keratinizing SCCs, underscoring heterogeneity [ 182 183 7.5. Nasopharyngeal Cancer Although Epstein–Barr virus (EBV) is the main viral driver in nasopharyngeal carcinoma (NPC), HPV has been implicated in a subset of cases. A systematic review and meta-analysis of 46 studies (6314 patients) reported that HPV-positive NPC has a global prevalence of ~18%, with the highest rates in North America (25%) and the lowest in Asia (13%). HPV16 and HPV18 were the most frequent genotypes, and most HPV-positive NPCs were classified as WHO Type I keratinizing squamous cell carcinoma [ 180 Circulating biomarkers are emerging in this setting. ctHPV DNA has shown 100% sensitivity at diagnosis and detected recurrence earlier than clinical evaluation, highlighting its utility for disease monitoring [ 180 89 127 7.6. Salivary Gland Cancer The role of HPV in salivary gland cancers remains uncertain. A population-based analysis of 416 patients and 2080 controls found that HPV infection was significantly more common in salivary gland cancer patients [ 181 182 A systematic review concluded that while HPV may play a role in specific subtypes such as mucoepidermoid carcinoma, its involvement across salivary gland malignancies is not definitive [ 183 In conclusion, the impact of HPV on HNCs extends well beyond OPSCC, with varying degrees of involvement across laryngeal, hypopharyngeal, sinonasal, nasopharyngeal, and salivary gland cancers. While its etiological role is firmly established in OPSCC, the oncogenic significance of HPV in other subsites remains less clear and requires further research. Notably, in some subtypes such as hypopharyngeal squamous cell carcinoma and sinonasal carcinoma, HPV positivity appears to confer a survival advantage, potentially linked to enhanced immune responses. In contrast, its contribution to salivary gland cancers remains controversial. Defining the molecular mechanisms and prognostic implications of HPV across these tumor types will be essential for refining diagnostic accuracy, developing novel biomarkers, and tailoring treatment strategies. Future investigations should prioritize understanding site-specific tumor biology and integrating viral, epigenetic, and immune features into optimized therapeutic approaches. 8. Conclusions and Future Directions HPV is now firmly established as a critical etiological factor in HNCs, particularly OPSCC. With the rising global incidence of HPV-related HNCs, deeper understanding of its role in tumorigenesis remains essential to guide both research and clinical practice. This review has highlighted the complex interactions between viral oncoproteins, host pathways, and epigenetic mechanisms that drive malignant transformation. HPV-positive HNCs display distinct epidemiological, clinical, and molecular profiles compared with HPV-negative disease, underscoring the need for tailored diagnostic and therapeutic strategies. Current diagnostic tools rely heavily on p16 immunohistochemistry and HPV DNA/RNA assays, while emerging approaches such as liquid biopsy and next-generation sequencing promise earlier detection and better disease monitoring. However, challenges remain, including tumor heterogeneity, asymptomatic presentation, and limitations of surrogate markers. Expanding the use of circulating biomarkers (e.g., ctHPV DNA, microRNAs) may improve diagnostic precision and risk stratification. Treatment strategies for HPV-positive HNCs are shifting toward de-intensification, reflecting their favorable prognosis and enhanced radiosensitivity. Clinical trial data show that reduced-dose radiotherapy or risk-adapted adjuvant therapy can maintain excellent survival while lowering toxicity. Concurrently, immunotherapy, therapeutic vaccines targeting E6/E7, and targeted molecular agents are broadening the treatment landscape, offering opportunities to combine efficacy with long-term quality-of-life preservation. HPV vaccination is one of the most effective preventive measures against HPV-driven cancers. While high-income countries have achieved notable success, global uptake remains uneven due to cost, infrastructure, and hesitancy. Broader implementation including programs targeting both girls and boys, catch-up vaccination for adults, and culturally tailored education will be essential to reduce the future burden of HPV-related HNCs. Looking ahead, several key research priorities are emerging in the field of HPV-related HNCs. First, there is a need to expand the focus beyond OPSCC to better understand the role of HPV in less common subtypes, including laryngeal, hypopharyngeal, sinonasal, nasopharyngeal, and salivary gland cancers, where its contribution remains poorly defined. Another important direction involves clarifying the prognostic and therapeutic implications of viral genome status specifically the distinction between episomal and integrated HPV genomes which could serve as a valuable biomarker for patient stratification and treatment planning. In addition, demographic shifts are becoming increasingly evident, with trends in age distribution, likely linked to birth cohort effects, as well as sex-based differences in incidence and clinical outcomes, both of which warrant systematic investigation. Finally, the integration of molecular biomarkers such as epigenetic alterations, non-coding RNAs, and immune signatures into clinical practice holds great promise for refining risk assessment and advancing personalized therapeutic approaches. In conclusion, HPV-related HNCs represent both a challenge and an opportunity. Continued progress in prevention, early detection, and personalized treatment will depend on multidisciplinary collaboration between researchers, clinicians, and policymakers. If vaccination programs are expanded and novel therapeutic strategies continue to mature, substantial reductions in HPV-related cancer incidence and improved outcomes for patients worldwide are achievable. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.O. and M.O.C.; methodology, M.O.C.; software, M.O.C.; validation, M.O., M.O.C. and G.H.A.; formal analysis, M.O.C.; investigation, M.O.C.; resources, M.O.C.; data curation, M.O.C.; writing—original draft preparation, G.T.; writing—review and editing, M.O.C. and M.O.; visualization, M.O.C.; supervision, M.O. and G.H.A.; project administration, M.O. and G.H.A.; funding acquisition, M.O. and G.H.A. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: HNCs Head and neck cancers 9vHPV 9-valent HPV vaccine CDK Cyclin-dependent kinase circRNAs Circular RNAs CRT Chemoradiotherapy CTCF CCCTC-binding factor ctDNA Circulating tumor DNA E2BS E2 binding sites FDA Food and Drug Administration HNSCCs Head and neck squamous cell carcinomas HPSCC Hypopharyngeal squamous cell carcinoma HPV Human papillomavirus HPV+NPC HPV-related nasopharyngeal carcinoma ICIs Immune checkpoint inhibitors IMPT Intensity-modulated proton therapy ISH In situ hybridization LCR The long control region lncRNAs Long non-coding RNAs LSCC Laryngeal squamous cell carcinoma me Methylation miRNAs MicroRNAs MRD Minimal residual disease NCDB National Cancer Database ncRNAs Non-coding RNAs NGS Next-generation sequencing OPC Oropharyngeal cancers OPSCC Oropharyngeal squamous cell carcinoma OSCC Oral squamous cell carcinoma PCR Polymerase chain reaction PFS Progression-free survival pRb Retinoblastoma protein R/M HNSCC Recurrent/metastatic head and neck squamous cell carcinoma RT Radiotherapy SETD2 SET-domain containing protein 2 SIRT1 Sirtuin1 SNSCC Sinonasal squamous cell carcinoma TORS Transoral Robotic Surgery URR Upstream regulatory region VLPs Virus-like particles WHO World Health Organization WRN Werner Syndrome Protein YY1 Yin Yang 1 References 1. Bray F. Laversanne M. Sung H. Ferlay J. Siegel R.L. Soerjomataram I. Jemal A. Global Cancer Statistics 2022: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 2. Mody M.D. Rocco J.W. Yom S.S. Haddad R.I. Saba N.F. Head and Neck Cancer Lancet 2021 398 2289 2299 10.1016/S0140-6736(21)01550-6 34562395 3. Gormley M. Creaney G. Schache A. Ingarfield K. Conway D.I. Reviewing the Epidemiology of Head and Neck Cancer: Definitions, Trends and Risk Factors Br. Dent. J. 2022 233 780 786 10.1038/s41415-022-5166-x 36369568 PMC9652141 4. Anderson G. Ebadi M. Vo K. Novak J. Govindarajan A. Amini A. An Updated Review on Head and Neck Cancer Treatment with Radiation Therapy Cancers 2021 13 4912 10.3390/cancers13194912 34638398 PMC8508236 5. Menezes F.d.S. Fernandes G.A. Antunes J.L.F. Villa L.L. Toporcov T.N. Global Incidence Trends in Head and Neck Cancer for HPV-Related and -Unrelated Subsites: A Systematic Review of Population-Based Studies Oral Oncol. 2021 115 105177 10.1016/j.oraloncology.2020.105177 33561611 6. Pytynia K.B. Dahlstrom K.R. Sturgis E.M. Epidemiology of HPV-Associated Oropharyngeal Cancer Oral Oncol. 2014 50 380 386 10.1016/j.oraloncology.2013.12.019 24461628 PMC4444216 7. Ndiaye C. Mena M. Alemany L. Arbyn M. Castellsagué X. Laporte L. Bosch F.X. de Sanjosé S. Trottier H. HPV DNA, E6/E7 MRNA, and P16INK4a Detection in Head and Neck Cancers: A Systematic Review and Meta-Analysis Lancet Oncol. 2014 15 1319 1331 10.1016/S1470-2045(14)70471-1 25439690 8. Hoppe-Seyler K. Bossler F. Braun J.A. Herrmann A.L. Hoppe-Seyler F. The HPV E6/E7 Oncogenes: Key Factors for Viral Carcinogenesis and Therapeutic Targets Trends Microbiol. 2018 26 158 168 10.1016/j.tim.2017.07.007 28823569 9. Moody C.A. Laimins L.A. Human Papillomavirus Oncoproteins: Pathways to Transformation Nat. Rev. Cancer 2010 10 550 560 10.1038/nrc2886 20592731 10. Doorbar J. Quint W. Banks L. Bravo I.G. Stoler M. Broker T.R. Stanley M.A. The Biology and Life-Cycle of Human Papillomaviruses Vaccine 2012 30 F55 F70 10.1016/j.vaccine.2012.06.083 23199966 11. Yu V.X. Long S. Tassler A. Smoking and Head and Neck Cancer JAMA Otolaryngol.-Head Neck Surg. 2023 149 470 10.1001/jamaoto.2023.0195 36995722 12. Ndon S. Singh A. Ha P.K. Aswani J. Chan J.Y.-K. Xu M.J. Human Papillomavirus-Associated Oropharyngeal Cancer: Global Epidemiology and Public Policy Implications Cancers 2023 15 4080 10.3390/cancers15164080 37627108 PMC10452639 13. Chaturvedi A.K. Engels E.A. Pfeiffer R.M. Hernandez B.Y. Xiao W. Kim E. Jiang B. Goodman M.T. Sibug-Saber M. Cozen W. Human Papillomavirus and Rising Oropharyngeal Cancer Incidence in the United States J. Clin. Oncol. 2011 29 4294 4301 10.1200/JCO.2011.36.4596 21969503 PMC3221528 14. Mehanna H. Taberna M. von Buchwald C. Tous S. Brooks J. Mena M. Morey F. Grønhøj C. Rasmussen J.H. Garset-Zamani M. Prognostic Implications of P16 and HPV Discordance in Oropharyngeal Cancer (HNCIG-EPIC-OPC): A Multicentre, Multinational, Individual Patient Data Analysis Lancet Oncol. 2023 24 239 251 10.1016/S1470-2045(23)00013-X 36796393 15. Syrjänen S. The Role of Human Papillomavirus Infection in Head and Neck Cancers Ann. Oncol. 2010 21 vii243 vii245 10.1093/annonc/mdq454 20943622 16. Vani N.V. Madhanagopal R. Swaminathan R. Ganesan T.S. Dynamics of Oral Human Papillomavirus Infection in Healthy Population and Head and Neck Cancer Cancer Med. 2023 12 11731 11745 10.1002/cam4.5686 36846921 PMC10242867 17. Anna Szymonowicz K. Chen J. Biological and Clinical Aspects of HPV-Related Cancers Cancer Biol. Med. 2020 17 864 878 10.20892/j.issn.2095-3941.2020.0370 33299640 PMC7721094 18. Powell S.F. Vu L. Spanos W.C. Pyeon D. The Key Differences between Human Papillomavirus-Positive and -Negative Head and Neck Cancers: Biological and Clinical Implications Cancers 2021 13 5206 10.3390/cancers13205206 34680354 PMC8533896 19. Kobayashi K. Hisamatsu K. Suzui N. Hara A. Tomita H. Miyazaki T. A Review of HPV-Related Head and Neck Cancer J. Clin. Med. 2018 7 241 10.3390/jcm7090241 30150513 PMC6162868 20. Thompson L.D.R. HPV-Related Multiphenotypic Sinonasal Carcinoma Ear Nose Throat J. 2020 99 94 95 10.1177/0145561319871711 31476886 21. Lim Y.X. Mierzwa M.L. Sartor M.A. D’Silva N.J. Clinical, Morphologic and Molecular Heterogeneity of HPV-Associated Oropharyngeal Cancer Oncogene 2023 42 2939 2955 10.1038/s41388-023-02819-y 37666939 PMC10541327 22. Burley M. Roberts S. Parish J.L. Epigenetic Regulation of Human Papillomavirus Transcription in the Productive Virus Life Cycle Semin. Immunopathol. 2020 42 159 171 10.1007/s00281-019-00773-0 31919577 PMC7174255 23. Bernard H.-U. Burk R.D. Chen Z. van Doorslaer K. Hausen H.z. de Villiers E.-M. Classification of Papillomaviruses (PVs) Based on 189 PV Types and Proposal of Taxonomic Amendments Virology 2010 401 70 79 10.1016/j.virol.2010.02.002 20206957 PMC3400342 24. Bernard H. Calleja-Macias I.E. Dunn S.T. Genome Variation of Human Papillomavirus Types: Phylogenetic and Medical Implications Int. J. Cancer 2006 118 1071 1076 10.1002/ijc.21655 16331617 25. McBride A.A. The Papillomavirus E2 Proteins Virology 2013 445 57 79 10.1016/j.virol.2013.06.006 23849793 PMC3783563 26. Han F. Guo X. Jiang M. Xia N. Gu Y. Li S. Structural Biology of the Human Papillomavirus Structure 2024 32 1877 1892 10.1016/j.str.2024.09.011 39368462 27. Ullah M.I. Mikhailova M.V. Alkhathami A.G. Carbajal N.C. Zuta M.E.C. Rasulova I. Najm M.A.A. Abosoda M. Alsalamy A. Deorari M. Molecular Pathways in the Development of HPV-Induced Oropharyngeal Cancer Cell Commun. Signal. 2023 21 351 10.1186/s12964-023-01365-0 38098017 PMC10722793 28. Ashrafi G.H. Salman N.A. Pathogenesis of Human Papillomavirus—Immunological Responses to HPV Infection Human Papillomavirus—Research in a Global Perspective InTech London, UK 2016 29. Kombe Kombe A.J. Li B. Zahid A. Mengist H.M. Bounda G.-A. Zhou Y. Jin T. Epidemiology and Burden of Human Papillomavirus and Related Diseases, Molecular Pathogenesis, and Vaccine Evaluation Front. Public. Health 2021 8 552028 10.3389/fpubh.2020.552028 33553082 PMC7855977 30. McBride A.A. Warburton A. The Role of Integration in Oncogenic Progression of HPV-Associated Cancers PLoS Pathog. 2017 13 e1006211 10.1371/journal.ppat.1006211 28384274 PMC5383336 31. Parfenov M. Pedamallu C.S. Gehlenborg N. Freeman S.S. Danilova L. Bristow C.A. Lee S. Hadjipanayis A.G. Ivanova E.V. Wilkerson M.D. Characterization of HPV and Host Genome Interactions in Primary Head and Neck Cancers Proc. Natl. Acad. Sci. USA 2014 111 15544 15549 10.1073/pnas.1416074111 25313082 PMC4217452 32. Groves I.J. Tang G. Pentland I. Parish J.L. Coleman N. CTCF Association with Episomal HPV16 Genomes Regulates Viral Oncogene Transcription and Splicing bioRxiv 2021 10.1101/2021.02.18.431881 33. Mac M. Moody C.A. Epigenetic Regulation of the Human Papillomavirus Life Cycle Pathogens 2020 9 483 10.3390/pathogens9060483 32570816 PMC7350343 34. Mac M. DeVico B.M. Raspanti S.M. Moody C.A. The SETD2 Methyltransferase Supports Productive HPV31 Replication through the LEDGF/CtIP/Rad51 Pathway J. Virol. 2023 97 e0020123 10.1128/jvi.00201-23 37154769 PMC10231177 35. Ashrafi G.H. Tsirimonaki E. Marchetti B. O’Brien P.M. Sibbet G.J. Andrew L. Campo M.S. Down-Regulation of MHC Class I by Bovine Papillomavirus E5 Oncoproteins Oncogene 2002 21 248 259 10.1038/sj.onc.1205008 11803468 36. Faraji F. Zaidi M. Fakhry C. Gaykalova D.A. Molecular Mechanisms of Human Papillomavirus-Related Carcinogenesis in Head and Neck Cancer Microbes Infect. 2017 19 464 475 10.1016/j.micinf.2017.06.001 28619685 PMC5603399 37. Vats A. Trejo-Cerro O. Thomas M. Banks L. Human Papillomavirus E6 and E7: What Remains? Tumour Virus Res. 2021 11 200213 10.1016/j.tvr.2021.200213 33716206 PMC7972986 38. Lim J. Lilie H. Kalbacher H. Roos N. Frecot D.I. Feige M. Conrady M. Votteler T. Cousido-Siah A. Corradini Bartoli G. Evidence for Direct Interaction between the Oncogenic Proteins E6 and E7 of High-Risk Human Papillomavirus (HPV) J. Biol. Chem. 2023 299 104954 10.1016/j.jbc.2023.104954 37354975 PMC10372912 39. Klingelhutz A.J. Roman A. Cellular Transformation by Human Papillomaviruses: Lessons Learned by Comparing High- and Low-Risk Viruses Virology 2012 424 77 98 10.1016/j.virol.2011.12.018 22284986 PMC3703738 40. Liu X. Dakic A. Zhang Y. Dai Y. Chen R. Schlegel R. HPV E6 Protein Interacts Physically and Functionally with the Cellular Telomerase Complex Proc. Natl. Acad. Sci. USA 2009 106 18780 18785 10.1073/pnas.0906357106 19843693 PMC2773972 41. Boyer S.N. Wazer D.E. Band V. E7 Protein of Human Papilloma Virus-16 Induces Degradation of Retinoblastoma Protein through the Ubiquitin-Proteasome Pathway Cancer Res. 1996 56 4620 4624 8840974 42. Dyson N. Howley P.M. Münger K. Harlow E. The Human Papilloma Virus-16 E7 Oncoprotein Is Able to Bind to the Retinoblastoma Gene Product Science 1989 243 934 937 10.1126/science.2537532 2537532 43. Skelin J. Sabol I. Tomaić V. Do or Die: HPV E5, E6 and E7 in Cell Death Evasion Pathogens 2022 11 1027 10.3390/pathogens11091027 36145459 PMC9502459 44. Cosper P.F. Bradley S. Luo Q. Kimple R.J. Biology of HPV Mediated Carcinogenesis and Tumor Progression Semin. Radiat. Oncol. 2021 31 265 273 10.1016/j.semradonc.2021.02.006 34455982 PMC8409095 45. Mo Y. Ma J. Zhang H. Shen J. Chen J. Hong J. Xu Y. Qian C. Prophylactic and Therapeutic HPV Vaccines: Current Scenario and Perspectives Front. Cell. Infect. Microbiol. 2022 12 909223 10.3389/fcimb.2022.909223 35860379 PMC9289603 46. McBride A.A. Human Papillomaviruses: Diversity, Infection and Host Interactions Nat. Rev. Microbiol. 2022 20 95 108 10.1038/s41579-021-00617-5 34522050 47. Castro-Oropeza R. Piña-Sánchez P. Epigenetic and Transcriptomic Regulation Landscape in HPV+ Cancers: Biological and Clinical Implications Front. Genet. 2022 13 886613 10.3389/fgene.2022.886613 35774512 PMC9237502 48. Pentland I. Campos-León K. Cotic M. Davies K.-J. Wood C.D. Groves I.J. Burley M. Coleman N. Stockton J.D. Noyvert B. Disruption of CTCF-YY1–Dependent Looping of the Human Papillomavirus Genome Activates Differentiation-Induced Viral Oncogene Transcription PLoS Biol. 2018 16 e2005752 10.1371/journal.pbio.2005752 30359362 PMC6219814 49. James C.D. Das D. Morgan E.L. Otoa R. Macdonald A. Morgan I.M. Werner Syndrome Protein (WRN) Regulates Cell Proliferation and the Human Papillomavirus 16 Life Cycle during Epithelial Differentiation mSphere 2020 5 e00858-20 10.1128/mSphere.00858-20 32938703 PMC7494838 50. Nakagawa T. Kurokawa T. Mima M. Imamoto S. Mizokami H. Kondo S. Okamoto Y. Misawa K. Hanazawa T. Kaneda A. DNA Methylation and HPV-Associated Head and Neck Cancer Microorganisms 2021 9 801 10.3390/microorganisms9040801 33920277 PMC8069883 51. von Knebel Doeberitz M. Prigge E.-S. Role of DNA Methylation in HPV Associated Lesions Papillomavirus Res. 2019 7 180 183 10.1016/j.pvr.2019.03.005 30978415 PMC6504999 52. Clarke M.A. Wentzensen N. Mirabello L. Ghosh A. Wacholder S. Harari A. Lorincz A. Schiffman M. Burk R.D. Human Papillomavirus DNA Methylation as a Potential Biomarker for Cervical Cancer Cancer Epidemiol. Biomark. Prev. 2012 21 2125 2137 10.1158/1055-9965.EPI-12-0905 23035178 PMC3664203 53. Yenigul N.N. Yazıcı Yılmaz F. Ayhan I. Can Serum Vitamin B12 and Folate Levels Predict HPV Penetration in Patients with ASCUS? Nutr. Cancer 2021 73 602 608 10.1080/01635581.2020.1807030 32794404 54. Casarotto M. Fanetti G. Guerrieri R. Palazzari E. Lupato V. Steffan A. Polesel J. Boscolo-Rizzo P. Fratta E. Beyond MicroRNAs: Emerging Role of Other Non-Coding RNAs in HPV-Driven Cancers Cancers 2020 12 1246 10.3390/cancers12051246 32429207 PMC7281476 55. Bonelli P. Borrelli A. Tuccillo F.M. Buonaguro F.M. Tornesello M.L. The Role of CircRNAs in Human Papillomavirus (HPV)-Associated Cancers Cancers 2021 13 1173 10.3390/cancers13051173 33803232 PMC7963196 56. Sharma S. Munger K. Expression of the Cervical Carcinoma Expressed PCNA Regulatory (CCEPR) Long Noncoding RNA Is Driven by the Human Papillomavirus E6 Protein and Modulates Cell Proliferation Independent of PCNA Virology 2018 518 8 13 10.1016/j.virol.2018.01.031 29427865 PMC5911229 57. Barr J.A. Hayes K.E. Brownmiller T. Harold A.D. Jagannathan R. Lockman P.R. Khan S. Martinez I. Long Non-Coding RNA FAM83H-AS1 Is Regulated by Human Papillomavirus 16 E6 Independently of P53 in Cervical Cancer Cells Sci. Rep. 2019 9 3662 10.1038/s41598-019-40094-8 30842470 PMC6403315 58. Kopczyńska M. Kolenda T. Guglas K. Sobocińska J. Teresiak A. Bliźniak R. Mackiewicz A. Mackiewicz J. Lamperska K. PRINS LncRNA Is a New Biomarker Candidate for HPV Infection and Prognosis of Head and Neck Squamous Cell Carcinomas Diagnostics 2020 10 762 10.3390/diagnostics10100762 32998396 PMC7599931 59. Dias T.R. Santos J.M.O. Gil da Costa R.M. Medeiros R. Long Non-Coding RNAs Regulate the Hallmarks of Cancer in HPV-Induced Malignancies Crit. Rev. Oncol. Hematol. 2021 161 103310 10.1016/j.critrevonc.2021.103310 33781867 60. Hinić S. Rich A. Anayannis N.V. Cabarcas-Petroski S. Schramm L. Meneses P.I. Gene Expression and DNA Methylation in Human Papillomavirus Positive and Negative Head and Neck Squamous Cell Carcinomas Int. J. Mol. Sci. 2022 23 10967 10.3390/ijms231810967 36142875 PMC9504918 61. Luo H. Lian Y. Tao H. Zhao Y. Wang Z. Zhou J. Zhang Z. Jiang S. Relationship between P16/Ki67 Immunoscores and PAX1/ZNF582 Methylation Status in Precancerous and Cancerous Cervical Lesions in High-Risk HPV-Positive Women BMC Cancer 2024 24 1171 10.1186/s12885-024-12920-4 39304838 PMC11414254 62. Batool S. Sethi R.K.V. Wang A. Dabekaussen K. Egloff A.M. Del Vecchio Fitz C. Kuperwasser C. Uppaluri R. Shin J. Rettig E.M. Circulating Tumor-Tissue Modified HPV DNA Testing in the Clinical Evaluation of Patients at Risk for HPV-Positive Oropharynx Cancer: The IDEA-HPV Study Oral Oncol. 2023 147 106584 10.1016/j.oraloncology.2023.106584 37837735 63. Fahmy M.D. Clegg D. Belcastro A. Smith B.D. Eric Heidel R. Carlson E.R. Hechler B. Are Throat Pain and Otalgia Predictive of Perineural Invasion in Squamous Cell Carcinoma of the Oropharynx? J. Oral Maxillofac. Surg. 2022 80 363 371 10.1016/j.joms.2021.08.265 34606767 64. Rajasekaran K. Carey R.M. Lin X. Seckar T.D. Wei Z. Chorath K. Newman J.G. O’Malley B.W. Weinstein G.S. Feldman M.D. The Microbiome of HPV-Positive Tonsil Squamous Cell Carcinoma and Neck Metastasis Oral Oncol. 2021 117 105305 10.1016/j.oraloncology.2021.105305 33905914 65. Yuan Y. Huang J. Cao J. Wu J. Wang L. Gan H. Xu J. Ye F. Tobacco and Alcohol Use Are the Risk Factors Responsible for the Greatest Burden of Head and Neck Cancers: A Study from the Global Burden of Disease Study 2019 Ann. Med. 2025 57 2500693 10.1080/07853890.2025.2500693 40319338 PMC12051598 66. McIlwain W.R. Sood A.J. Nguyen S.A. Day T.A. Initial Symptoms in Patients With HPV-Positive and HPV-Negative Oropharyngeal Cancer JAMA Otolaryngol.-Head Neck Surg. 2014 140 441 447 10.1001/jamaoto.2014.141 24652023 67. Blitzer G.C. Smith M.A. Harris S.L. Kimple R.J. Review of the Clinical and Biologic Aspects of Human Papillomavirus-Positive Squamous Cell Carcinomas of the Head and Neck Int. J. Radiat. Oncol. Biol. Phys. 2014 88 761 770 10.1016/j.ijrobp.2013.08.029 24606845 PMC3990872 68. Amaral M.N. Faísca P. Ferreira H.A. Gaspar M.M. Reis C.P. Current Insights and Progress in the Clinical Management of Head and Neck Cancer Cancers 2022 14 6079 10.3390/cancers14246079 36551565 PMC9776832 69. Gillison M.L. Evidence for a Causal Association Between Human Papillomavirus and a Subset of Head and Neck Cancers J. Natl. Cancer Inst. 2000 92 709 720 10.1093/jnci/92.9.709 10793107 70. Simoens C. Gheit T. Ridder R. Gorbaslieva I. Holzinger D. Lucas E. Rehm S. Vermeulen P. Lammens M. Vanderveken O.M. Accuracy of High-Risk HPV DNA PCR, P16(INK4a) Immunohistochemistry or the Combination of Both to Diagnose HPV-Driven Oropharyngeal Cancer BMC Infect. Dis. 2022 22 676 10.1186/s12879-022-07654-2 35933382 PMC9357318 71. Gallus R. Nauta I.H. Marklund L. Rizzo D. Crescio C. Mureddu L. Tropiano P. Delogu G. Bussu F. Accuracy of P16 IHC in Classifying HPV-Driven OPSCC in Different Populations Cancers 2023 15 656 10.3390/cancers15030656 36765613 PMC9913822 72. Cubilla A.L. Lloveras B. Alejo M. Clavero O. Chaux A. Kasamatsu E. Velazquez E.F. Lezcano C. Monfulleda N. Tous S. The Basaloid Cell Is the Best Tissue Marker for Human Papillomavirus in Invasive Penile Squamous Cell Carcinoma: A Study of 202 Cases From Paraguay Am. J. Surg. Pathol. 2010 34 104 114 10.1097/PAS.0b013e3181c76a49 20035150 73. Oppel F. Gendreizig S. Martinez-Ruiz L. Florido J. López-Rodríguez A. Pabla H. Loganathan L. Hose L. Kühnel P. Schmidt P. Mucosa-like Differentiation of Head and Neck Cancer Cells Is Inducible and Drives the Epigenetic Loss of Cell Malignancy Cell Death Dis. 2024 15 724 10.1038/s41419-024-07065-y 39358322 PMC11446932 74. Chaux A. Sanchez D.F. Fernández-Nestosa M.J. Cañete-Portillo S. Rodríguez I.M. Giannico G.A. Cubilla A.L. The Dual Pathogenesis of Penile Neoplasia: The Heterogeneous Morphology of Human Papillomavirus-Related Tumors Asian J. Urol. 2022 9 349 358 10.1016/j.ajur.2022.02.009 36381592 PMC9643287 75. Baněčková M. Cox D. Top 10 Basaloid Neoplasms of the Sinonasal Tract Head Neck Pathol. 2023 17 16 32 10.1007/s12105-022-01508-8 36928732 PMC10063752 76. Giorgi Rossi P. Ronco G. Mancuso P. Carozzi F. Allia E. Bisanzi S. Gillio-Tos A. De Marco L. Rizzolo R. Gustinucci D. Performance of HPV E6/E7 MRNA Assay as Primary Screening Test: Results from the NTCC2 Trial Int. J. Cancer 2022 151 1047 1058 10.1002/ijc.34120 35579975 77. Suresh K. Shah P.V. Coates S. Alexiev B.A. Samant S. In Situ Hybridization for High Risk HPV E6/E7 MRNA in Oropharyngeal Squamous Cell Carcinoma Am. J. Otolaryngol. 2021 42 102782 10.1016/j.amjoto.2020.102782 33171410 78. Giorgi Rossi P. Carozzi F. Ronco G. Allia E. Bisanzi S. Gillio-Tos A. De Marco L. Rizzolo R. Gustinucci D. Del Mistro A. P16/Ki67 and E6/E7 MRNA Accuracy and Prognostic Value in Triaging HPV DNA-Positive Women JNCI J. Natl. Cancer Inst. 2021 113 292 300 10.1093/jnci/djaa105 32745170 PMC7936054 79. Klussmann J.P. Gültekin E. Weissenborn S.J. Wieland U. Dries V. Dienes H.P. Eckel H.E. Pfister H.J. Fuchs P.G. Expression of P16 Protein Identifies a Distinct Entity of Tonsillar Carcinomas Associated with Human Papillomavirus Am. J. Pathol. 2003 162 747 753 10.1016/S0002-9440(10)63871-0 12598309 PMC1868106 80. Blons H. Laurent-Puig P. TP53 and Head and Neck Neoplasms Hum. Mutat. 2003 21 252 257 10.1002/humu.10171 12619110 81. Qin T. Li S. Henry L.E. Liu S. Sartor M.A. Molecular Tumor Subtypes of HPV-Positive Head and Neck Cancers: Biological Characteristics and Implications for Clinical Outcomes Cancers 2021 13 2721 10.3390/cancers13112721 34072836 PMC8198180 82. Krsek A. Baticic L. Braut T. Sotosek V. The Next Chapter in Cancer Diagnostics: Advances in HPV-Positive Head and Neck Cancer Biomolecules 2024 14 925 10.3390/biom14080925 39199313 PMC11352962 83. Tran N.H. Sais D. Tran N. Advances in Human Papillomavirus Detection and Molecular Understanding in Head and Neck Cancers: Implications for Clinical Management J. Med. Virol. 2024 96 e29746 10.1002/jmv.29746 38884391 84. Chantre-Justino M. Alves G. Delmonico L. Clinical Applications of Liquid Biopsy in HPV-negative and HPV-positive Head and Neck Squamous Cell Carcinoma: Advances and Challenges Explor. Target. Antitumor Ther. 2022 3 533 552 10.37349/etat.2022.00099 36071985 PMC9446158 85. Eberly H.W. Sciscent B.Y. Lorenz F.J. Rettig E.M. Goyal N. Current and Emerging Diagnostic, Prognostic, and Predictive Biomarkers in Head and Neck Cancer Biomedicines 2024 12 415 10.3390/biomedicines12020415 38398017 PMC10886579 86. Chen A.M. De-Escalation Treatment for Human Papillomavirus–Related Oropharyngeal Cancer: Questions for Practical Consideration Oncology 2023 37 281 287 10.46883/2023.25921000 37499250 87. Reid P. Marcu L.G. Olver I. Moghaddasi L. Staudacher A.H. Bezak E. Diversity of Cancer Stem Cells in Head and Neck Carcinomas: The Role of HPV in Cancer Stem Cell Heterogeneity, Plasticity and Treatment Response Radiother. Oncol. 2019 135 1 12 10.1016/j.radonc.2019.02.016 31015153 88. Keck M.K. Zuo Z. Khattri A. Stricker T.P. Brown C.D. Imanguli M. Rieke D. Endhardt K. Fang P. Brägelmann J. Integrative Analysis of Head and Neck Cancer Identifies Two Biologically Distinct HPV and Three Non-HPV Subtypes Clin. Cancer Res. 2015 21 870 881 10.1158/1078-0432.CCR-14-2481 25492084 89. Schindele A. Holm A. Nylander K. Allard A. Olofsson K. Mapping Human Papillomavirus, Epstein–Barr Virus, Cytomegalovirus, Adenovirus, and P16 in Laryngeal Cancer Discov. Oncol. 2022 13 18 10.1007/s12672-022-00475-4 35312853 PMC8938541 90. Vojtechova Z. Sabol I. Salakova M. Smahelova J. Zavadil J. Turek L. Grega M. Klozar J. Prochazka B. Tachezy R. Comparison of the MiRNA Profiles in HPV-Positive and HPV-Negative Tonsillar Tumors and a Model System of Human Keratinocyte Clones BMC Cancer 2016 16 382 10.1186/s12885-016-2430-y 27377959 PMC4932682 91. Sharma S. Munger K. The Role of Long Noncoding RNAs in Human Papillomavirus-Associated Pathogenesis Pathogens 2020 9 289 10.3390/pathogens9040289 32326624 PMC7238103 92. Jiang M. Liu F. Yang A.-G. Wang W. Zhang R. The Role of Long Non-Coding RNAs in the Pathogenesis of Head and Neck Squamous Cell Carcinoma Mol. Ther. Oncolytics 2022 24 127 138 10.1016/j.omto.2021.12.001 35024439 PMC8717422 93. Ludwig S. Sharma P. Wise P. Sposto R. Hollingshead D. Lamb J. Lang S. Fabbri M. Whiteside T.L. MRNA and MiRNA Profiles of Exosomes from Cultured Tumor Cells Reveal Biomarkers Specific for HPV16-Positive and HPV16-Negative Head and Neck Cancer Int. J. Mol. Sci. 2020 21 8570 10.3390/ijms21228570 33202950 PMC7698015 94. Sannigrahi M.K. Sharma R. Singh V. Panda N.K. Rattan V. Khullar M. DNA Methylation Regulated MicroRNAs in HPV-16-Induced Head and Neck Squamous Cell Carcinoma (HNSCC) Mol. Cell Biochem. 2018 448 321 333 10.1007/s11010-018-3336-6 29455435 95. Sun Y. Wang Z. Qiu S. Wang R. Therapeutic Strategies of Different HPV Status in Head and Neck Squamous Cell Carcinoma Int. J. Biol. Sci. 2021 17 1104 1118 10.7150/ijbs.58077 33867833 PMC8040311 96. Lechner M. Liu J. Masterson L. Fenton T.R. HPV-Associated Oropharyngeal Cancer: Epidemiology, Molecular Biology and Clinical Management Nat. Rev. Clin. Oncol. 2022 19 306 327 10.1038/s41571-022-00603-7 35105976 PMC8805140 97. García-Anaya M. Segado-Guillot S. Cabrera-Rodríguez J. Toledo-Serrano M. Medina-Carmona J. Gómez-Millán J. Dose and Volume De-Escalation of Radiotherapy in Head and Neck Cancer Crit. Rev. Oncol. Hematol. 2023 186 103994 10.1016/j.critrevonc.2023.103994 37061074 98. Rosenberg A.J. Vokes E.E. Optimizing Treatment De-Escalation in Head and Neck Cancer: Current and Future Perspectives Oncologist 2021 26 40 48 10.1634/theoncologist.2020-0303 32864799 PMC7794179 99. Gillison M.L. Trotti A.M. Harris J. Eisbruch A. Harari P.M. Adelstein D.J. Jordan R.C.K. Zhao W. Sturgis E.M. Burtness B. Radiotherapy plus Cetuximab or Cisplatin in Human Papillomavirus-Positive Oropharyngeal Cancer (NRG Oncology RTOG 1016): A Randomised, Multicentre, Non-Inferiority Trial Lancet 2019 393 40 50 10.1016/S0140-6736(18)32779-X 30449625 PMC6541928 100. Mehanna H. Robinson M. Hartley A. Kong A. Foran B. Fulton-Lieuw T. Dalby M. Mistry P. Sen M. O’Toole L. Radiotherapy plus Cisplatin or Cetuximab in Low-Risk Human Papillomavirus-Positive Oropharyngeal Cancer (De-ESCALaTE HPV): An Open-Label Randomised Controlled Phase 3 Trial Lancet 2019 393 51 60 10.1016/S0140-6736(18)32752-1 30449623 PMC6319250 101. Yom S.S. Torres-Saavedra P. Caudell J.J. Waldron J.N. Gillison M.L. Xia P. Truong M.T. Kong C. Jordan R. Subramaniam R.M. Reduced-Dose Radiation Therapy for HPV-Associated Oropharyngeal Carcinoma (NRG Oncology HN002) J. Clin. Oncol. 2021 39 956 965 10.1200/JCO.20.03128 33507809 PMC8078254 102. Ferris R.L. Flamand Y. Weinstein G.S. Li S. Quon H. Mehra R. Garcia J.J. Chung C.H. Gillison M.L. Duvvuri U. Phase II Randomized Trial of Transoral Surgery and Low-Dose Intensity Modulated Radiation Therapy in Resectable P16+ Locally Advanced Oropharynx Cancer: An ECOG-ACRIN Cancer Research Group Trial (E3311) J. Clin. Oncol. 2022 40 138 149 10.1200/JCO.21.01752 34699271 PMC8718241 103. Rahman M.d.T. Ghosh A.K. Khatun R.A. Hussain Q.M. Mollah M.d.N.U. Hussain S.M.d.A. Habib A.K.M.A. Hosen M.M.A. Rahim I.U. Comparison of Outcome of Concurrent Chemoradiotherapy and Sequential Chemoradiotherapy in Locally Advanced, Inoperable Squamous Cell Carcinoma of Head and Neck Region Saudi J. Med. Pharm. Sci. 2024 10 293 300 10.36348/sjmps.2024.v10i05.005 104. Wong S.J. Torres-Saavedra P.A. Saba N.F. Shenouda G. Bumpous J.M. Wallace R.E. Chung C.H. El-Naggar A.K. Gwede C.K. Burtness B. Radiotherapy Plus Cisplatin With or Without Lapatinib for Non–Human Papillomavirus Head and Neck Carcinoma JAMA Oncol. 2023 9 1565 1573 10.1001/jamaoncol.2023.3809 37768670 PMC10540060 105. Lassen P. Huang S.H. Su J. Waldron J. Andersen M. Primdahl H. Johansen J. Kristensen C.A. Andersen E. Eriksen J.G. Treatment Outcomes and Survival Following Definitive (Chemo)Radiotherapy in HPV-positive Oropharynx Cancer: Large-scale Comparison of DAHANCA vs PMH Cohorts Int. J. Cancer 2022 150 1329 1340 10.1002/ijc.33876 34792199 106. Holcomb A.J. Herberg M. Strohl M. Ochoa E. Feng A.L. Abt N.B. Mokhtari T.E. Suresh K. McHugh C.I. Parikh A.S. Impact of Surgical Margins on Local Control in Patients Undergoing single-modality Transoral Robotic Surgery for HPV-related Oropharyngeal Squamous Cell Carcinoma Head Neck 2021 43 2434 2444 10.1002/hed.26708 33856083 PMC9361190 107. Goel S. Gunasekera D. Krishnan G. Krishnan S. Hodge J. Lizarondo L. Foreman A. Is Transoral Robotic Surgery Useful as a Salvage Technique in Head and Neck Cancers: A Systematic Review and Meta Analysis Head Neck 2025 47 1018 1036 10.1002/hed.28021 39737644 108. Burtness B. Harrington K.J. Greil R. Soulières D. Tahara M. de Castro G. Psyrri A. Basté N. Neupane P. Bratland Å. Pembrolizumab Alone or with Chemotherapy versus Cetuximab with Chemotherapy for Recurrent or Metastatic Squamous Cell Carcinoma of the Head and Neck (KEYNOTE-048): A Randomised, Open-Label, Phase 3 Study Lancet 2019 394 1915 1928 10.1016/S0140-6736(19)32591-7 31679945 109. Saba N.F. Pamulapati S. Patel B. Mody M. Strojan P. Takes R. Mäkitie A.A. Cohen O. Pace-Asciak P. Vermorken J.B. Novel Immunotherapeutic Approaches to Treating HPV-Related Head and Neck Cancer Cancers 2023 15 1959 10.3390/cancers15071959 37046621 PMC10092986 110. Powell S.F. Liu S.V. Sukari A. Chung C.H. Bauml J. Haddad R.I. Gause C.K. Niewood M. Gammage L.L. Brown H. KEYNOTE-055: A Phase II Trial of Single Agent Pembrolizumab in Patients (Pts) with Recurrent or Metastatic Head and Neck Squamous Cell Carcinoma (HNSCC) Who Have Failed Platinum and Cetuximab J. Clin. Oncol. 2015 33 TPS3094 10.1200/jco.2015.33.15_suppl.tps3094 111. Muro K. Chung H.C. Shankaran V. Geva R. Catenacci D. Gupta S. Eder J.P. Golan T. Le D.T. Burtness B. Pembrolizumab for Patients with PD-L1-Positive Advanced Gastric Cancer (KEYNOTE-012): A Multicentre, Open-Label, Phase 1b Trial Lancet Oncol. 2016 17 717 726 10.1016/S1470-2045(16)00175-3 27157491 112. Uppaluri R. Haddad R.I. Tao Y. Le Tourneau C. Lee N.Y. Westra W. Chernock R. Tahara M. Harrington K.J. Klochikhin A.L. Neoadjuvant and Adjuvant Pembrolizumab in Locally Advanced Head and Neck Cancer N. Engl. J. Med. 2025 393 37 50 10.1056/NEJMoa2415434 40532178 113. Vallianou N.G. Evangelopoulos A. Kounatidis D. Panagopoulos F. Geladari E. Karampela I. Stratigou T. Dalamaga M. Immunotherapy in Head and Neck Cancer: Where Do We Stand? Curr. Oncol. Rep. 2023 25 897 912 10.1007/s11912-023-01425-1 37213060 114. Julian R. Savani M. Bauman J.E. Immunotherapy Approaches in HPV-Associated Head and Neck Cancer Cancers 2021 13 5889 10.3390/cancers13235889 34884999 PMC8656769 115. Pereira D. Martins D. Mendes F. Immunotherapy in Head and Neck Cancer When, How, and Why? Biomedicines 2022 10 2151 10.3390/biomedicines10092151 36140252 PMC9495940 116. Shamseddine A.A. Burman B. Lee N.Y. Zamarin D. Riaz N. Tumor Immunity and Immunotherapy for HPV-Related Cancers Cancer Discov. 2021 11 1896 1912 10.1158/2159-8290.CD-20-1760 33990345 PMC8338882 117. Even C. Harrington K.J. Massarelli E. Klein Hesselink M. Visscher S. Fury M.G. Sanders F. Laban S. Fayette J. Oliva M. Results of a Randomized, Double-Blind, Placebo-Controlled, Phase 2 Study (OpcemISA) of the Combination of ISA101b and Cemiplimab versus Cemiplimab for Recurrent/Metastatic (R/M) HPV16-Positive Oropharyngeal Cancer (OPC) J. Clin. Oncol. 2024 42 6003 10.1200/JCO.2024.42.16_suppl.6003 118. Nabell L. Ho A.L. Posner M.R. Neupane P. Naqash A.-R. Wong S. Niu J.J. Pearson A.T. Laux D. Adkins D.R. 921P HB-200 Arenavirus-Based Immunotherapy plus Pembrolizumab as a First-Line Treatment of Patients with Recurrent/Metastatic HPV16 Positive Head and Neck Cancer Ann. Oncol. 2023 34 S581 S582 10.1016/j.annonc.2023.09.2065 119. Yan S. Zhang X. Li F. Yang A. Li H. Hu W. Lin Q. Li X. Du M. Chen J. Neoadjuvant Sintilimab and Chemotherapy Followed by Transoral Surgery for HPV-Positive Resectable Oropharyngeal Cancer: A Single-Arm, Two-Centre, Phase 2 Trial eClinicalMedicine 2025 86 103393 10.1016/j.eclinm.2025.103393 40777862 PMC12329559 120. Rosenberg A.J. Juloori A. Izumchenko E. Cursio J. Gooi Z. Blair E.A. Lingen M.W. Cipriani N. Hasina R. Starus A. Neoadjuvant HPV16-Specific Arenavirus-Based Immunotherapy HB-200 plus Chemotherapy Followed by Response-Stratified de-Intensification in HPV16+ Oropharyngeal Cancer: TARGET-HPV J. Clin. Oncol. 2024 42 6017 10.1200/JCO.2024.42.16_suppl.6017 121. Chung C.H. Li J. Steuer C.E. Bhateja P. Johnson M. Masannat J. Poole M.I. Song F. Hernandez-Prera J.C. Molina H. Phase II Multi-Institutional Clinical Trial Result of Concurrent Cetuximab and Nivolumab in Recurrent and/or Metastatic Head and Neck Squamous Cell Carcinoma Clin. Cancer Res. 2022 28 2329 2338 10.1158/1078-0432.CCR-21-3849 35344035 PMC9167762 122. Aguayo F. Perez-Dominguez F. Osorio J.C. Oliva C. Calaf G.M. PI3K/AKT/MTOR Signaling Pathway in HPV-Driven Head and Neck Carcinogenesis: Therapeutic Implications Biology 2023 12 672 10.3390/biology12050672 37237486 PMC10215516 123. Li Q. Tie Y. Alu A. Ma X. Shi H. Targeted Therapy for Head and Neck Cancer: Signaling Pathways and Clinical Studies Signal Transduct. Target. Ther. 2023 8 31 10.1038/s41392-022-01297-0 36646686 PMC9842704 124. LEE N.Y. Sherman E.J. Schöder H. Wray R. White C. Dunn L. Hung T. Pfister D.G. Ho A.L. McBride S.M. Intra-Treatment Hypoxia Directed Major Radiation de-Escalation as Definitive Treatment for Human Papillomavirus-Related Oropharyngeal Cancer J. Clin. Oncol. 2024 42 6007 10.1200/JCO.2024.42.16_suppl.6007 125. Burtness B. Flamand Y. Quon H. Weinstein G.S. Mehra R. Garcia J.J. Kim S. O’Malley B.W. Ozer E. Ikpeazu C. Long-Term Follow-Up of E3311, an ECOG-ACRIN Cancer Research Group Phase II Trial of Transoral Surgery and Risk-Based Adjuvant Treatment in Human Papillomavirus–Initiated Oropharynx Cancer J. Clin. Oncol. 2025 43 2559 2565 10.1200/JCO-24-02550 40493877 PMC12331204 126. Frank S.J. Busse P. Rosenthal D.I. Hernandez M. Swanson D.M. Garden A.S. Sturgis E.M. Ferrarotto R. Gunn G.B. Patel S.H. Phase III Randomized Trial of Intensity-Modulated Proton Therapy (IMPT) versus Intensity-Modulated Photon Therapy (IMRT) for the Treatment of Head and Neck Oropharyngeal Carcinoma (OPC) J. Clin. Oncol. 2024 42 6006 10.1200/JCO.2024.42.16_suppl.6006 127. Hirayama S. Al-Inaya Y. Aye L. Bryan M.E. Das D. Mendel J. Naegele S. Faquin W.C. Sadow P. Fisch A.S. Prospective Validation of CtHPVDNA for Detection of Minimal Residual Disease and Prediction of Recurrence in Patients with HPV-Associated Head and Neck Cancer Treated with Surgery J. Clin. Oncol. 2024 42 6010 10.1200/JCO.2024.42.16_suppl.6010 128. Wei Y. Zhao Z. Ma X. Description of CRISPR-Cas9 Development and Its Prospects in Human Papillomavirus-Driven Cancer Treatment Front. Immunol. 2022 13 1037124 10.3389/fimmu.2022.1037124 36479105 PMC9721393 129. Zhen S. Lu J. Liu Y.-H. Chen W. Li X. Synergistic Antitumor Effect on Cervical Cancer by Rational Combination of PD1 Blockade and CRISPR-Cas9-Mediated HPV Knockout Cancer Gene Ther. 2020 27 168 178 10.1038/s41417-019-0131-9 31455836 130. Chen Y. Jiang H. Wang T. He D. Tian R. Cui Z. Tian X. Gao Q. Ma X. Yang J. In Vitro and in Vivo Growth Inhibition of Human Cervical Cancer Cells via Human Papillomavirus E6/E7 MRNAs’ Cleavage by CRISPR/Cas13a System Antivir. Res. 2020 178 104794 10.1016/j.antiviral.2020.104794 32298665 131. Nagarsheth N.B. Norberg S.M. Sinkoe A.L. Adhikary S. Meyer T.J. Lack J.B. Warner A.C. Schweitzer C. Doran S.L. Korrapati S. TCR-Engineered T Cells Targeting E7 for Patients with Metastatic HPV-Associated Epithelial Cancers Nat. Med. 2021 27 419 425 10.1038/s41591-020-01225-1 33558725 PMC9620481 132. Wang X. Sandberg M.L. Martin A.D. Negri K.R. Gabrelow G.B. Nampe D.P. Wu M.-L. McElvain M.E. Toledo Warshaviak D. Lee W.-H. Potent, Selective CARs as Potential T-Cell Therapeutics for HPV-Positive Cancers J. Immunother. 2021 44 292 306 10.1097/CJI.0000000000000386 34432728 PMC8415731 133. Sharkey Ochoa I. O’Regan E. Toner M. Kay E. Faul P. O’Keane C. O’Connor R. Mullen D. Nur M. O’Murchu E. The Role of HPV in Determining Treatment, Survival, and Prognosis of Head and Neck Squamous Cell Carcinoma Cancers 2022 14 4321 10.3390/cancers14174321 36077856 PMC9454666 134. Šimić I. Božinović K. Milutin Gašperov N. Kordić M. Pešut E. Manojlović L. Grce M. Dediol E. Sabol I. Head and Neck Cancer Patients’ Survival According to HPV Status, MiRNA Profiling, and Tumour Features—A Cohort Study Int. J. Mol. Sci. 2023 24 3344 10.3390/ijms24043344 36834756 PMC9959828 135. Lai Y.-H. Su C.-C. Wu S.-Y. Hsueh W.-T. Wu Y.-H. Chen H.H.W. Hsiao J.-R. Liu C.-H. Tsai Y.-S. Impact of Alcohol and Smoking on Outcomes of HPV-Related Oropharyngeal Cancer J. Clin. Med. 2022 11 6510 10.3390/jcm11216510 36362736 PMC9655073 136. de Roest R.H. van der Heijden M. Wesseling F.W.R. de Ruiter E.J. Heymans M.W. Terhaard C. Vergeer M.R. Buter J. Devriese L.A. de Boer J.P. Disease Outcome and Associated Factors after Definitive Platinum Based Chemoradiotherapy for Advanced Stage HPV-Negative Head and Neck Cancer Radiother. Oncol. 2022 175 112 121 10.1016/j.radonc.2022.08.013 35973619 137. Zhou J.Z. Jou J. Cohen E. Vaccine Strategies for Human Papillomavirus-Associated Head and Neck Cancers Cancers 2021 14 33 10.3390/cancers14010033 35008197 PMC8750601 138. St Laurent J. Luckett R. Feldman S. HPV Vaccination and the Effects on Rates of HPV-Related Cancers Curr. Probl. Cancer 2018 42 493 506 10.1016/j.currproblcancer.2018.06.004 30041818 139. Malagón T. Franco E.L. Tejada R. Vaccarella S. Epidemiology of HPV-Associated Cancers Past, Present and Future: Towards Prevention and Elimination Nat. Rev. Clin. Oncol. 2024 21 522 538 10.1038/s41571-024-00904-z 38760499 140. Petca A. Borislavschi A. Zvanca M. Petca R.-C. Sandru F. Dumitrascu M. Non-Sexual HPV Transmission and Role of Vaccination for a Better Future (Review) Exp. Ther. Med. 2020 20 186 10.3892/etm.2020.9316 PMC7579832 33101476 141. Du E.Y. Adjei Boakye E. Taylor D.B. Kuziez D. Rohde R.L. Pannu J.S. Simpson M.C. Patterson R.H. Varvares M.A. Osazuwa-Peters N. Medical Students’ Knowledge of HPV, HPV Vaccine, and HPV-Associated Head and Neck Cancer Hum. Vaccin. Immunother. 2022 18 2109892 10.1080/21645515.2022.2109892 36070503 PMC9746525 142. Porras C. Tsang S.H. Herrero R. Guillén D. Darragh T.M. Stoler M.H. Hildesheim A. Wagner S. Boland J. Lowy D.R. Efficacy of the Bivalent HPV Vaccine against HPV 16/18-Associated Precancer: Long-Term Follow-up Results from the Costa Rica Vaccine Trial Lancet Oncol. 2020 21 1643 1652 10.1016/S1470-2045(20)30524-6 33271093 PMC8724969 143. Gribb J.P. Wheelock J.H. Park E.S. Human Papilloma Virus (HPV) and the Current State of Oropharyngeal Cancer Prevention and Treatment Dela J. Public. Health 2023 9 26 28 10.32481/djph.2023.04.008 PMC10132363 37122346 144. Roy V. Jung W. Linde C. Coates E. Ledgerwood J. Costner P. Yamshchikov G. Streeck H. Juelg B. Lauffenburger D.A. Differences in HPV-Specific Antibody Fc-Effector Functions Following Gardasil ® ® NPJ Vaccines 2023 8 39 10.1038/s41541-023-00628-8 36922512 PMC10017795 145. Smalley Rumfield C. Roller N. Pellom S.T. Schlom J. Jochems C. Therapeutic Vaccines for HPV-Associated Malignancies Immunotargets Ther. 2020 9 167 200 10.2147/ITT.S273327 33117742 PMC7549137 146. Boilesen D.R. Nielsen K.N. Holst P.J. Novel Antigenic Targets of HPV Therapeutic Vaccines Vaccines 2021 9 1262 10.3390/vaccines9111262 34835193 PMC8621534 147. Gardella B. Gritti A. Soleymaninejadian E. Pasquali M. Riemma G. La Verde M. Schettino M. Fortunato N. Torella M. Dominoni M. New Perspectives in Therapeutic Vaccines for HPV: A Critical Review Medicina 2022 58 860 10.3390/medicina58070860 35888579 PMC9315585 148. Skolnik J.M. Morrow M.P. Vaccines for HPV-Associated Diseases Mol. Asp. Med. 2023 94 101224 10.1016/j.mam.2023.101224 37931422 149. Timbang M.R. Sim M.W. Bewley A.F. Farwell D.G. Mantravadi A. Moore M.G. HPV-Related Oropharyngeal Cancer: A Review on Burden of the Disease and Opportunities for Prevention and Early Detection Hum. Vaccin. Immunother. 2019 15 1920 1928 10.1080/21645515.2019.1600985 31050595 PMC6746516 150. Diana G. Corica C. Human Papilloma Virus Vaccine and Prevention of Head and Neck Cancer, What Is the Current Evidence? Oral Oncol. 2021 115 105168 10.1016/j.oraloncology.2020.105168 33730628 151. Morand G.B. Cardona I. Cruz S.B.S.C. Mlynarek A.M. Hier M.P. Alaoui-Jamali M.A. da Silva S.D. Therapeutic Vaccines for HPV-Associated Oropharyngeal and Cervical Cancer: The Next De-Intensification Strategy? Int. J. Mol. Sci. 2022 23 8395 10.3390/ijms23158395 35955529 PMC9368783 152. Tsentemeidou A. Fyrmpas G. Stavrakas M. Vlachtsis K. Sotiriou E. Poutoglidis A. Tsetsos N. Human Papillomavirus Vaccine to End Oropharyngeal Cancer. A Systematic Review and Meta-Analysis Sex. Transm. Dis. 2021 48 700 707 10.1097/OLQ.0000000000001405 34110733 153. Tsu V.D. LaMontagne D.S. Atuhebwe P. Bloem P.N. Ndiaye C. National Implementation of HPV Vaccination Programs in Low-Resource Countries: Lessons, Challenges, and Future Prospects Prev. Med. 2021 144 106335 10.1016/j.ypmed.2020.106335 33678232 PMC7957340 154. Wang H. Jiang Y. Wang Q. Lai Y. Holloway A. The Status and Challenges of HPV Vaccine Programme in China: An Exploration of the Related Policy Obstacles BMJ Glob. Health 2023 8 e012554 10.1136/bmjgh-2023-012554 PMC10432676 37586782 155. Karanja-Chege C.M. HPV Vaccination in Kenya: The Challenges Faced and Strategies to Increase Uptake Front. Public Health 2022 10 802947 10.3389/fpubh.2022.802947 35387182 PMC8978582 156. Casey R.M. Adrien N. Badiane O. Diallo A. Loko Roka J. Brennan T. Doshi R. Garon J. Loharikar A. National Introduction of HPV Vaccination in Senegal—Successes, Challenges, and Lessons Learned Vaccine 2022 40 A10 A16 10.1016/j.vaccine.2021.08.042 34593269 PMC10662429 157. Agadayi E. Karademir D. Karahan S. Knowledge, Attitudes and Behaviors of Women Who Have or Have Not Had Human Papillomavirus Vaccine in Turkey about the Virus and the Vaccine J. Community Health 2022 47 650 657 10.1007/s10900-022-01089-1 35476168 158. Özdemir J. Yücel M. Kızılkaya S. Yıldırım G. Özyiğit I.İ. Yuluğkural Z. HPV, HPV Vaccination Worldwide and Current Status of HPV Vaccination in Turkey: A Literature Review Turk. Med. Stud. J. 2022 9 48 54 10.4274/tmsj.galenos.2022.09.02.01 159. Waheed D.-N. Schiller J. Stanley M. Franco E.L. Poljak M. Kjaer S.K. del Pino M. van der Klis F. Schim van der Loeff M.F. Baay M. Human Papillomavirus Vaccination in Adults: Impact, Opportunities and Challenges—A Meeting Report BMC Proc. 2021 15 16 10.1186/s12919-021-00217-4 34384438 PMC8359761 160. Nogueira-Rodrigues A. Flores M.G. Macedo Neto A.O. Braga L.A.C. Vieira C.M. de Sousa-Lima R.M. de Andrade D.A.P. Machado K.K. Guimarães A.P.G. HPV Vaccination in Latin America: Coverage Status, Implementation Challenges and Strategies to Overcome It Front. Oncol. 2022 12 984449 10.3389/fonc.2022.984449 36387151 PMC9645205 161. Erbıyık H.I. Palalıoğlu R.M. HPV Infection, HPV Vaccines and Cervical Cancer Awareness: A Multi-Centric Survey Study in Istanbul, Turkey Women Health 2021 61 771 782 10.1080/03630242.2021.1969612 34425732 162. Dilley S. Miller K.M. Huh W.K. Human Papillomavirus Vaccination: Ongoing Challenges and Future Directions Gynecol. Oncol. 2020 156 498 502 10.1016/j.ygyno.2019.10.018 31848025 PMC7375852 163. Osazuwa-Peters N. Graboyes E.M. Khariwala S.S. Expanding Indications for the Human Papillomavirus Vaccine JAMA Otolaryngol.-Head Neck Surg. 2020 146 1099 10.1001/jamaoto.2020.4068 33151285 164. Taberna M. Mena M. Pavón M.A. Alemany L. Gillison M.L. Mesía R. Human Papillomavirus-Related Oropharyngeal Cancer Ann. Oncol. 2017 28 2386 2398 10.1093/annonc/mdx304 28633362 165. Ekanayake Weeramange C. Tang K.D. Irwin D. Hartel G. Langton-Lockton J. Ladwa R. Kenny L. Taheri T. Whitfield B. Vasani S. Human Papillomavirus (HPV) DNA Methylation Changes in HPV-Associated Head and Neck Cancer Carcinogenesis 2024 45 140 148 10.1093/carcin/bgae001 38270218 PMC10925951 166. Wookey V.B. Appiah A.K. Kallam A. Ernani V. Smith L.M. Ganti A.K. HPV Status and Survival in Non-Oropharyngeal Squamous Cell Carcinoma of the Head and Neck Anticancer. Res. 2019 39 1907 1914 10.21873/anticanres.13299 30952732 167. Mandić K. Milutin Gašperov N. Božinović K. Dediol E. Krasić J. Sinčić N. Grce M. Sabol I. Barešić A. Integrative Analysis in Head and Neck Cancer Reveals Distinct Role of MiRNome and Methylome as Tumour Epigenetic Drivers Sci. Rep. 2024 14 9062 10.1038/s41598-024-59312-z 38643268 PMC11032388 168. Shomorony A. Puram S.V. Johnson D.N. Chi A.W. Faquin W.C. Deshpande V. Deschler D.G. Emerick K.S. Sadow P.M. A Non-Oropharyngeal Squamous Cell Carcinoma and the Pitfalls of HPV Testing: A Case Report Otolaryngol. Case Rep. 2019 13 100129 10.1016/j.xocr.2019.100129 169. Saito S. Shibata H. Adkins D. Uppaluri R. Neoadjuvant Immunotherapy Strategies in HPV-Related Head-and-Neck Cancer Curr. Otorhinolaryngol. Rep. 2022 10 108 115 10.1007/s40136-021-00389-9 35990387 PMC9385129 170. Yang S.-M. Wu M. Han F.-Y. Sun Y.-M. Yang J.-Q. Liu H.-X. Role of HPV Status and PD-L1 Expression in Prognosis of Laryngeal Squamous Cell Carcinoma Int. J. Clin. Exp. Pathol. 2021 14 107 115 33532028 PMC7847499 171. Allegra E. Bianco M.R. Mignogna C. Caltabiano R. Grasso M. Puzzo L. Role of P16 Expression in the Prognosis of Patients With Laryngeal Cancer: A Single Retrospective Analysis Cancer Control 2021 28 10732748211033544 10.1177/10732748211033544 34538114 PMC8450612 172. King R.E. Bilger A. Rademacher J. Lambert P.F. Thibeault S.L. Preclinical Models of Laryngeal Papillomavirus Infection: A Scoping Review Laryngoscope 2023 133 3256 3268 10.1002/lary.30762 37227124 PMC10674042 173. Ji M. Lin L. Huang Q. Hu C. Zhang M. HPV16 Status Might Correlate to Increasing Tumor-Infiltrating Lymphocytes in Hypopharyngeal Cancer Acta Otolaryngol. 2023 143 543 550 10.1080/00016489.2023.2221288 37335232 174. Burbure N. Handorf E. Ridge J.A. Bauman J. Liu J.C. Giri A. Galloway T.J. Prognostic Significance of Human Papillomavirus Status and Treatment Modality in Hypopharyngeal Cancer Head Neck 2021 43 3042 3052 10.1002/hed.26793 34165223 PMC9631108 175. Patel E.J. Oliver J.R. Jacobson A.S. Li Z. Hu K.S. Tam M. Vaezi A. Morris L.G.T. Givi B. Human Papillomavirus in Patients With Hypopharyngeal Squamous Cell Carcinoma Otolaryngol.-Head Neck Surg. 2022 166 109 117 10.1177/01945998211004586 33845656 176. Hebsgaard M. Eriksen P. Ramberg I. von Buchwald C. Human Papillomavirus in Sinonasal Malignancies Curr. Otorhinolaryngol. Rep. 2023 11 109 116 10.1007/s40136-023-00448-3 177. Sjöstedt S. von Buchwald C. Agander T.K. Aanaes K. Impact of Human Papillomavirus in Sinonasal Cancer—A Systematic Review Acta Oncol. 2021 60 1175 1191 10.1080/0284186X.2021.1950922 34319844 178. Abi-Saab T. Lozar T. Chen Y. Tannenbaum A.P. Geye H. Yu M. Weisman P. Harari P.M. Kimple R.J. Lambert P.F. Morphologic Spectrum of HPV-Associated Sinonasal Carcinomas Head Neck Pathol. 2024 18 67 10.1007/s12105-024-01670-1 39101976 PMC11300749 179. Lauritzen B.B. Sjöstedt S. Jensen J.M. Kiss K. von Buchwald C. Unusual Cases of Sinonasal Malignancies: A Letter to the Editor on HPV-Positive Sinonasal Squamous Cell Carcinomas Acta Oncol. 2023 62 608 613 10.1080/0284186X.2023.2224508 37337153 180. Zhao B.Y. Hirayama S. Goss D. Zhao Y. Faden D.L. Human Papillomavirus-Associated Nasopharyngeal Carcinoma: A Systematic Review and Meta-Analysis Oral Oncol. 2024 159 107057 10.1016/j.oraloncology.2024.107057 39383626 181. Hung S.-H. Yang T.-H. Lee H.-C. Lin H.-C. Chen C.-S. Association of Salivary Gland Cancer with Human Papillomavirus Infections Eur. Arch. Oto-Rhino-Laryngol. 2025 282 403 408 10.1007/s00405-024-08906-4 39179913 182. Mohamed F.E. Aldayem L.N. Hemaida M.A. Siddig O. Osman Z.H. Shafig I.R. Salih M.A.M. Muneer M.S. Hassan R. Ahmed E.S. Molecular Detection of Human Papillomavirus-16 among Sudanese Patients Diagnosed with Squamous Cell Carcinoma and Salivary Gland Carcinoma BMC Res. Notes 2021 14 56 10.1186/s13104-021-05471-5 33563329 PMC7871554 183. Costin C.A. Chifu M.B. Pricope D.L. Grigoraş A. Balan R.A. Amălinei C. Are HPV Oncogenic Viruses Involved in Salivary Glands Tumorigenesis? Rom. J. Morphol. Embryol. 2024 65 395 407 10.47162/RJME.65.3.02 39529333 PMC11657354 Figure 1 Anatomical distribution and prevalence of HPV-related HNCs. HPV-related HNCs most frequently arise in the oropharynx, particularly the tonsils and base of the tongue (25−45%). Other affected subsites include the oral cavity (7−10%), nasopharynx (18%), larynx (5−6%), hypopharynx (5–15%), nasal cavity (20–30%), and parotid gland (>5%). These patterns reflect both regional epidemiological variation and distinct biological predispositions of lymphoid-rich tissues to HPV-driven carcinogenesis [ 1 13 14 15 Figure 2 Schematic representation of the HPV16 genome organization [ 26 Figure 3 Oncogenic functions of HPV E6 and E7 oncoproteins in host cells [ 45 A B C D Figure 4 Epigenetic regulation of HPV oncogene expression in different chromatin contexts. ( A B C Figure 5 Schematic illustration of DNA methylation-mediated regulation of HPV genome regions and its oncogenic consequences. The HPV genome is shown in its circular episomal form, with key regulatory and coding regions indicated, including the long control region (LCR), early genes (E6, E7, E1, E2, E4, E5), and late genes (L1, L2). DNA methylation (me) at distinct loci has functional consequences: LCR and E2 binding sites (E2BS): Hypomethylated in low-grade lesions but hypermethylated in high-grade lesions, leading to deregulation of E6/E7 oncogene expression and promoting viral integration; E6 region: Methylation here can suppress oncogene transcription; loss of control contributes to carcinogenesis, while micronutrient-enhanced methylation (e.g., folate, vitamin B12) may provide protective effects; L1 region: Hypermethylation correlates with high-grade intraepithelial neoplasia and invasive cancers, serving as a biomarker of advanced disease. These methylation changes collectively modulate transcriptional activity, influence integration status, and ultimately drive malignant transformation in HPV-related cancers. viruses-17-01276-t002_Table 2 Table 2 Emerging Diagnostic and Prognostic Biomarkers in HPV-related HNCs. Biomarker Type Example(s) Clinical/Research Relevance References Immunohistochemical markers p16 overexpression Widely used surrogate marker for HPV status in OPSCC; correlates with prognosis, but not fully specific [ 69 71 Viral DNA/RNA detection HPV16/18 DNA (PCR, ISH), E6/E7 mRNA Confirms transcriptionally active HPV infection; higher specificity than p16 alone [ 74 75 76 77 78 Circulating biomarkers Anti-E6/E7 antibodies, circulating HPV DNA (ctHPV DNA) Useful for early detection, monitoring recurrence, and minimal residual disease assessment [ 84 85 Epigenetic alterations DNA methylation (e.g., L1, E2BS), histone modification Correlates with disease stage, aggressiveness, and survival; potential for stratification and prognosis [ 47 50 52 60 61 Non-coding RNAs lncRNAs (CCEPR, FAM83H-AS1, PRINS), miRNAs Influence proliferation, apoptosis, immune response; emerging as diagnostic/prognostic tools [ 54 55 59 91 92 ",
  "metadata": {
    "Title of this paper": "Are HPV Oncogenic Viruses Involved in Salivary Glands Tumorigenesis?",
    "Journal it was published in:": "Viruses",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474466/"
  }
}