{
  "title": "Paper_672",
  "abstract": "pmc eClinicalMedicine EClinicalMedicine 3674 eclinm eClinicalMedicine 2589-5370 Elsevier PMC12481021 PMC12481021.1 12481021 12481021 41035796 10.1016/j.eclinm.2025.103486 S2589-5370(25)00419-5 103486 1 Articles Luvometinib in patients with Langerhans cell histiocytosis, Erdheim–Chester disease, and other histiocytic neoplasms: a single-arm, multicentre, phase 2 study Cao Xin-Xin a b Zhu Qi c Cai Zhen d Ma Jie e Zhou Hui f Chang Long a Zhong Lai-Ping g Wu Zhu-Li h Wang Xingli h Han Pu i Lin Hong-Mei i Wei Zhen i Guo Jia-Yan i Zheng Yang i Li Jian lijian@pumch.cn a j ∗ a b c d e f g h i j ∗ lijian@pumch.cn 10 2025 17 9 2025 88 496430 103486 26 6 2025 7 8 2025 20 8 2025 17 09 2025 01 10 2025 02 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Summary Background Histiocytic neoplasms are a heterogeneous group of haematologic disorders marked by a high frequency of mutations in the somatic mitogen-activated protein kinase pathway. This single-arm, multicentre, phase 2 study evaluated the efficacy and safety of the selective MEK1/2 inhibitor luvometinib in adult patients with histiocytic neoplasms. Methods Patients (aged >16 years), regardless of tumour genotype and who were either treatment-naïve or relapse/refractory, were enrolled and received oral luvometinib, 8 mg, once daily in 28-day cycles until disease progression, death, unacceptable toxicity, withdrawal of consent, or end of the study. The primary end point was overall response rate (ORR) assessed by an independent review committee according to positron emission tomography response criteria. This trial was registered with chinadrugtrials.org.cn chictr.org.cn Findings Between June 27, 2022 and February 2, 2024, 30 patients were enrolled; they were followed up for a median duration of 16.2 months (range, 1.5–19.3). In 29 evaluable patients, 22 (75.9%) had Langerhans cell histiocytosis, 3 (10.3%) had Erdheim–Chester disease, and 4 (13.8%) had other subtypes. Most (86.2%) patients had previously received systemic therapy and 27.6% had received ≥3 lines. With a median follow-up of 16.2 months, the ORR was 82.8% (95% CI, 64.2–94.2), with a median time to response of 2.9 months (range, 2.6–6.0) and median duration of response not reached. The 12-month progression-free survival rate was 74.4% (95% CI, 49.8–88.2). Grade ≥3 treatment-emergent adverse events occurred in 13 (43.3%) patients, with folliculitis (10.0%), hypertriglyceridemia (10.0%), and blood creatine phosphokinase increased (6.7%) occurring in more than one patient. No treatment-emergent adverse events led to treatment discontinuation. Interpretation Luvometinib demonstrated high and durable responses and a manageable safety profile in patients with histiocytic neoplasms. Funding Shanghai Fosun Pharmaceutical Industrial Development Co., Ltd Keywords Histiocytic neoplasm MEK1/2 inhibitor Luvometinib Langerhans cell histiocytosis Erdheim–Chester disease pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Research in context Evidence before this study We searched PubMed for articles published between database inception and April 07, 2025, with the terms “histiocytic neoplasms” OR “Langerhans cell histiocytosis” OR “Erdheim–Chester disease” OR “juvenile xanthogranuloma” OR “Rosai–Dorfman disease” AND “trial” OR “phase” OR “clinical study” in titles or abstracts with no language restrictions and manually screened for clinical trials of targeted therapy for these diseases. We identified 14 reports; among them, antitumour activity was shown for the BRAF V600 kinase inhibitor vemurafenib in adult patients with Erdheim–Chester disease (ECD) and Langerhans cell histiocytosis (LCH) harbouring BRAF BRAF BRAF Added value of this study The present phase 2 study enrolled patients with histiocytic neoplasms of more diverse subtypes (with LCH being the predominant subtype) and genotypes, and the sample size (n = 30) was relatively large compared with previous studies. Luvometinib, a selective MEK1/2 inhibitor, demonstrated high and durable antitumour activity in patients with histiocytic neoplasms, regardless of subtype or genotype. Luvometinib showed a well-tolerated safety profile, with no treatment-emergent adverse events leading to treatment discontinuation. Implications of all the available evidence Targeted treatment options for patients with histiocytic neoplasms, regardless of biomarker status, are limited and not all patients globally have access to the approved agents because of regional approvals. The results from this study suggested that luvometinib could be an alternative option for patients with histiocytic neoplasms, regardless of disease subtypes and genotypes. Introduction Histiocytic neoplasm is a rare, heterogeneous group of haematologic disorders characterised by the accumulation and infiltration of macrophages, dendritic cells, or monocyte-derived cells in various tissues and organs. 1 2 3 4 5 At the molecular level, genetic mutations in the mitogen-activated protein kinase (MAPK) pathway are one hallmark of histiocytic neoplasm. 2 , 6 7 BRAF V600E 8 Targeting the nodes along the MAPK pathway for the treatment of histiocytic neoplasms has shown promising results in clinical trials. The BRAF BRAF V600 9 10 BRAF V600 BRAF V600 11 BRAF V600 12 , 13 Luvometinib is a highly potent and selective MEK1/2 inhibitor that blocks the MAPK signalling and has proven to inhibit tumour growth in pre-clinical studies. 14 15 Luvometinib showed antitumour activity in patients with NRAS 16 , 17 Methods Study design and patients This single-arm, open-label, multicentre phase 2 study was conducted at seven sites in China. Eligible patients were >16 years old and had histologically confirmed treatment-naive or recurrent/refractory LCH, ECD, and other histiocytic neoplasms (diagnosed according to the 5th edition of the World Health Organization Classification of Haematolymphoid Tumours), 18 Supplementary Material Ethics The trial was conducted in compliance with the principles of the Declaration of Helsinki, Good Clinical Practice guidelines developed by the International Council for Harmonisation, and local applicable regulatory requirements for clinical trials. The study protocol, amendments, and informed consent were reviewed and approved by the institutional review board committee at each study centre (ethical approval numbers are available in Supplementary Table S1 Randomisation and masking This was a single-arm, open-label study. Randomisation and masking were not performed. Procedures Patients received oral luvometinib, 8 mg, once daily in 28-day cycles until disease progression, death, unacceptable toxicity, withdrawal of consent, or end of the study. Tumour assessments were done using 18-F-fluoro-2-deoxyglucose positron emission tomography ( 18 Safety was monitored throughout the study and for 30 days after the last dose of luvometinib. Adverse events (AEs) were coded according to Medical Dictionary for Regulatory Activities Terminology (MedDRA) version 26.0 and graded per National Cancer Institute Common Terminology Criteria for Adverse Events (CTCAE) version 5.0. For patients with histiocyte tissue biopsies available for central laboratory testing, genomic analyses for MAPK pathway mutations were performed with next-generation sequencing (NGS) using the OncoScreen Plus panel at screening. Cell-free DNA (cfDNA) in blood was collected at baseline, at each time point corresponding to the RECIST version 1.1 tumour assessment, and after progressive disease (PD) for central laboratory test, using the OncoCompass Plus NGS panel (∼20000X mean sequencing depth, Burning Rock, Co. Ltd., Guangzhou, China). Outcomes The primary end point was overall response rate (ORR) assessed by the IRC according to PRC, defined as the proportion of patients who had complete metabolic response (CMR; normalisation of all lesions to at or below the liver standardized uptake value [SUV liver Supplementary Material Statistical analysis Assuming an ORR of 0.80, approximately 25 evaluable patients were required to generate a two-sided 95% confidence interval (CI) with a width of 33.9%. A total of 28 patients were planned to be enrolled assuming a dropout rate of 10%. The ORRs and the corresponding 95% CIs for different numbers of responders are shown in the Supplementary Material Efficacy was analysed in patients who provided informed consent, had taken at least one dose of luvometinib, had a baseline tumour assessment and at least one postbaseline tumour assessment, and had no major protocol violations. Safety analysis set included all patients who had taken at least one dose of luvometinib and had at least one safety assessment. The 95% CI for ORR was calculated using the Clopper–Pearson method. PFS and OS were estimated using the Kaplan–Meier method. Prespecified subgroup analysis of ORR was conducted based on baseline characteristics. All analyses were performed using SAS (versions 9.4; SAS Institute Inc). The date of data cutoff for the prespecified analysis was February 02, 2024. The study was registered with chinadrugtrials.org.cn chictr.org.cn Role of the funding source Shanghai Fosun Pharmaceutical Industrial Development Co., Ltd. funded the study. The sponsor collected, analysed, and interpreted data in conjunction with the authors. All authors had access to the data and participated in the reviewing of the manuscript. Results From June 27, 2022 to February 2, 2024, a total of 30 patients were enrolled and received treatment ( Fig. 1 Fig. 1 Patient disposition. a b Among 29 patients analysed for efficacy, the diagnosed histiocytic neoplasm subtypes included LCH (n = 22 [75.9%]), ECD (n = 3 [10.3%]), mixed LCH/ECD (n = 1 [3.4%]), mixed LCH/JXG (n = 1 [3.4%]), and RDD (n = 2 [6.9%]) ( Table 1 Table 1 Baseline demographics and disease characteristics. Patients included in efficacy analysis (n = 29) Median age (IQR), years 36.0 (24.0–47.0) Sex, n (%) a Male 16 (55.2) Female 13 (44.8) Race, n (%) a Asian 29 (100) ECOG PS, n (%) 0 22 (75.9) 1 6 (20.7) 2 1 (3.4) Subtypes of histiocytic neoplasms, n (%) LCH 22 (75.9) ECD 3 (10.3) LCH plus ECD 1 (3.4) LCH plus JXG 1 (3.4) RDD 2 (6.9) System involvement Multifocal single-system 3 (10.3) Multisystem 26 (89.7) Central nervous system involvement Yes 18 (62.1) Pituitary 15 (51.7) Brain parenchyma 4 (13.8) Brain meninges 3 (10.3) Other 1 (3.4) No 11 (37.9) MAPK pathway mutation, b  BRAF 18 (62.1) V600E 5 (17.2)  BRAF 10 (34.5) N486_P490del 8 (27.6) N486_T491delinsK 2 (6.9)  BRAF 3 (10.3)  ARRB1-BRAF 1 (3.4)  BICD2-BRAF 1 (3.4)  PICALM-BRAF 1 (3.4)  ARAF 1 (3.4) Q352_F354delinsL 1 (3.4)  MAP2K1 7 (24.1) E102_I103del/L101_I103delinsM 5 (17.2) C121S 1 (3.4) F53_Q58delinsL 1 (3.4) Prior treatment lines, n (%) 0 4 (13.8) 1 11 (37.9) 2 6 (20.7) ≥3 8 (27.6) Prior treatment types, c Chemotherapy d 22 (88.0) Immunosuppressive therapy 15 (60.0) Interferon-α 2 (8.0)  BRAF 2 (8.0) Others 6 (24.0) ECOG PS, Eastern Cooperative Oncology Group performance status; ECD, Erdheim–Chester disease; JXG, juvenile xanthogranuloma; LCH, Langerhans cell histiocytosis; RDD, Rosai–Dorfman disease. a Sex and race were self-reported by patients. b No mutations in tissue or peripheral blood were identified in 2 patients. c Percentages were calculated using the total number of people who received at least one prior treatment as the denominator. d Prior first-line chemotherapy regimens included cytarabine, VP (vindesine plus prednisone), MA (methotrexate and cytarabine), CEVP (cyclophosphamide, etoposide, vindesine, and prednisone), cladribine plus cytarabine, DAL-HX90 intensified regimen (vinorelbine, vincristine, etoposide, and prednisone), TCD (thalidomide, cyclophosphamide, and dexamethasone acetate), vinorelbine plus azathioprine plus prednisone, CHOP (cyclophosphamide, doxorubicin, vindesine, and prednisone), CHOEP (cyclophosphamide, epirubicin, vincristine, etoposide, and prednisone), vinorelbine plus prednisone plus dexamethasone, COP (ifosfamide, vincristine, and prednisone), and methotrexate plus vincristine. Twenty-six (89.7%) patients had a variety of MAPK pathway mutations involving BRAF BRAF V600E BRAF Indel BRAF ARAF MAP2K1 MAP2K1 E102_I103del MAP2K1 L101_I103delinsM MAP2K1 C121S MAP2K1 F53_Q58delinsL CXCR4 The IRC-assessed ORR per PRC was 82.8% (95% CI, 64.2–94.2); 14 (48.3%) patients had CMR and 10 (34.5%) had PMR ( Table 2 Fig. 2 Table 3 BRAF ARAF MAP2K1 BRAF BRAF V600E BRAF InDel BRAF MAP2K1 MAP2K1 E102_I103del MAP2K1 L101_I103delinsM BRAF Table 2 Efficacy end points according to IRC assessments per PRC and RECIST 1.1. PRC RECIST 1.1 Evaluable patients, n 29 16 Confirmed best overall response, n (%) CMR/CR 14 (48.3) 2 (12.5) PMR/PR 10 (34.5) 7 (43.8) SMD/SD 3 (10.3) 6 (37.5) SMD/SD ≥24 weeks 1 (3.4) 5 (31.3) PMD/PD 2 (6.9) 1 (6.3) NE 0 0 ORR, % (95% CI) 82.8 (64.2–94.2) 56.3 (29.9–80.2) TTR, months 2.9 3.0 DCR, % (95% CI) 93.1 (77.2–99.2) 93.8 (69.8–99.8) CBR, % (95% CI) 86.2 (68.3–96.1) 87.5 (61.7–98.4) CBR, clinical benefit rate; CMR, complete metabolic response; CR, complete response; DCR, disease control rate; IRC, independent review committee; NE, not evaluable; ORR, overall response rate; PD, progressive disease; PMD, progressive metabolic disease; PMR, partial metabolic response; PR, partial response; PRC, positron emission tomography response criteria; SD, stable disease; SMD, stable metabolic disease; TTR, time to response. Fig. 2 Tumour response and progression-free survival. Table 3 Subgroup analysis of ORR assessed by IRC per PRC. Subgroups ORR patient numbers, n/N ORR (95% CI) Subtypes of histiocytic neoplasms LCH 18/22 81.8 (59.7–94.8) ECD 3/3 100.0 (29.2–100.0) LCH plus ECD 1/1 100.0 (2.5–100.0) LCH plus JXG 1/1 100.0 (2.5–100.0) RDD 1/2 50.0 (1.3–98.7)  BRAF 17/18 94.4 (72.7–99.9) V600E mutation 5/5 100.0 (47.8–100.0)  BRAF 10/10 100.0 (69.1–100)  BRAF 2/3 66.7 (9.4–99.1)  MAP2K1 3/7 42.9 (9.9–81.6) E102_I103del or L101_I103delinsM 2/5 40.0 (0.5–71.6) Other MAP2K1 a 1/2 50.0 (1.3–98.7)  Other mutations/unknown 4/4 100.0 (39.8–100.0) ECD, Erdheim–Chester disease; IRC, independent review committee; JXG, juvenile xanthogranuloma; LCH, Langerhans cell histiocytosis; ORR, overall response rate; PRC, positron emission tomography response criteria; RDD, Rosai–Dorfman disease. a Other MAP2K1 The median TTR was 2.9 months (range, 2.6–6.0) ( Table 2 As of the data cutoff, six (20.7%) patients had progressive metabolic disease; the median PFS was NR (95% CI, 11.2–NR) ( Fig. 2 ORR per RECIST 1.1 was 56.3% (95% CI, 29.9–80.2) and DCR was 93.8% (95% CI, 69.8–99.8) ( Table 2 Supplementary Table S2 All 30 (100.0%) patients in the safety analysis set experienced at least one TEAE ( Table 4 Table 4 Supplementary Table S3 Table 4 Common TEAEs and TRAEs in patients treated with luvometinib. n (%) Patients included in safety analysis (n = 30) TEAEs TRAEs Any grade Grade ≥3 Any grade Grade ≥3 Upper respiratory tract infection 15 (50.0) 0 1 (3.3) 0 Alanine aminotransferase increased 12 (40.0) 0 11 (36.7) 0 Folliculitis 11 (36.7) 3 (10.0) 11 (36.7) 3 (10.0) Rash 11 (36.7) 1 (3.3) 10 (33.3) 1 (3.3) COVID-19 10 (33.3) 0 0 0 Peripheral oedema 10 (33.3) 0 10 (33.3) 0 Diarrhoea 10 (33.3) 0 10 (33.3) 0 Eczema 8 (26.7) 1 (3.3) 7 (23.3) 1 (3.3) Creatine phosphokinase increased 8 (26.7) 2 (6.7) 7 (23.3) 1 (3.3) Paronychia 7 (23.3) 0 7 (23.3) 0 C-reactive protein increased 6 (20.0) 0 5 (16.7) 0 Constipation 6 (20.0) 0 4 (13.3) 0 Aspartate aminotransferase increased 6 (20.0) 0 6 (20.0) 0 Thrombocytopaenia 5 (16.7) 0 4 (13.3) 0 Hyperuricemia 5 (16.7) 0 3 (10.0) 0 Hypertriglyceridemia 4 (13.3) 3 (10.0) 4 (13.3) 3 (10.0) Most common any-grade TEAEs in 15% or more of patients by systemic organ class preferred term and grade ≥3 TEAEs in more than one patient (>3.3%) are presented. TEAEs, treatment-emergent adverse events; TRAEs, treatment-related adverse events. Serious TEAEs were observed in four of 30 (13.3%) patients, which were peripheral neuropathy, cerebral infarction, respiratory failure, infectious pneumonia, and upper gastrointestinal bleeding (n = 1; 3.3% each); none were judged to be related to treatment. TEAEs leading to treatment interruption (most common, COVID-19 in 10%) and dose reduction (most common, folliculitis in 10%) occurred in 43.3% (13/30) and 16.7% (5/30) of patients, respectively; eight (26.7%) and five (16.7%) cases were deemed related to treatment, respectively. No TEAEs led to treatment discontinuation. One death (respiratory failure) was reported and was not related to study treatment; this was reported in the one patient with incorrect disease diagnosis. The cause of death was obstructive airway changes arising from aggravation of lung lesions. Peripheral blood cfDNA samples were collected from 29 patients at baseline, different time points during treatment, and PD. A total of 13 (44.8%) patients were identified to have mutations in MAPK pathway genes (including BRAF V600E BRAF InDel BRAF MAP2K1 mut Supplementary Figure S1 BRAF N486_P490del Supplementary Figure S2 Discussion In this study, luvometinib showed efficacy and a manageable safety profile in adult patients with histiocytic neoplasms. Notably, the majority of enrolled patients had LCH, addressing a critical evidence gap for a subtype that has been underrepresented in previous studies. Luvometinib demonstrated antitumour activity with an IRC-assessed ORR per PRC of 82.8%. Assessments by IRC, unlike those according to the investigators in previous studies of MEK or BRAF inhibitors in patients with histiocytic neoplasms, added to the validity of the findings in this study. 9 , 10 Our study enrolled a heavily pre-treated patient population with histiocytic neoplasms, with LCH as the predominant subtype. A phase 2 trial of the MEK inhibitor cobimetinib included 18 patients, with only two (11%) patients having LCH and most having ECD (12 [67%]); 11% of patients had received three or more lines of prior treatment, and 50% had received chemotherapy. 10 BRAF V600E BRAF BRAF 19 The clinical activity of luvometinib was observed across a variety of genotypes. The results indicated that patients with BRAF BRAF V600E BRAF indel BRAF BRAF BRAF V600 9 BRAF V600E 20 BRAF MAP2K1 MAP2K1 E102_I103del MAP2K1 L101_I103delinsM MAP2K1 E102_I103del 21 MAP2K1 E102_I103del MAP2K1 L101_I103delinsM 15 , 22 , 23 24 MAP2K1 Luvometinib demonstrated a favourable safety profile, characterised by relatively low incidence rates of skin and gastrointestinal toxicities and a notable absence of ocular adverse events—a toxicity typically associated with MEK inhibitors. No TEAEs led to treatment discontinuation during the trial period. The safety profile of luvometinib was generally consistent with the adverse event categories reported for MEK inhibitors. 10 , 13 , 25 , 26 27 20 10 10 10 13 , 25 , 26 BRAF del 28 A series of mutations in genes in the MAPK pathway have previously been identified in both LCH and ECD, including mutations in BRAF MAP2K1 ARAF 8 Furthermore, our data indicated that cfDNA levels at baseline and after six cycles of treatment were associated with clinical outcomes. Monitoring of cfDNA levels of MAPK There are several limitations in this study. Firstly, the study was designed as a single-arm as there is no standard of care for patients with histiocytic neoplasms globally. Secondly, the trial was carried out exclusively in a Chinese population, which restricts the generalisability of evidence to other ethnic or racial groups. Thirdly, there were only a few patients with conditions such as ECD and other histiocytic neoplasms, apart from LCH. Lastly, the current duration of follow-up for this study was relatively short. Mature median PFS and OS data will be updated in the future with longer follow-up. This study showed that luvometinib resulted in durable responses in patients with histiocytic neoplasms of various subtypes and genotypes, and the safety profile was manageable. In summary, the clinical results suggested that luvometinib could be an alternative option for patients with histiocytic neoplasms, regardless of disease subtypes. Contributors JL, XC, ZWu, ZWei, JG, XW, and HL designed the study. JL, XC, QZ, ZC, JM, HZ, LC, and LZ were responsible for recruiting patients and collecting data. ZWei, PH, and YZ analysed and interpreted data. JL and XW directly accessed and verified the underlying data. All authors reviewed and revised the manuscript. All authors had full access to all the data in the study and had final responsibility for the decision to submit for publication. Data sharing statement The deidentified individual participant data that support the findings of this study are available from the corresponding author and sponsor upon reasonable request. Study protocol and statistical analysis plan are available in the Supplementary Material Declaration of interests XW, ZWei, JG, HL, and YZ are employees of Fosun Pharmaceutical Development Co., Ltd. ZWu and PH were employees of Fosun Pharmaceutical Development Co., Ltd at the time of the study and manuscript preparation. All other authors have no competing interests. References 1 Emile J.F. Abla O. Fraitag S. Revised classification of histiocytoses and neoplasms of the macrophage-dendritic cell lineages Blood 127 2016 2672 2681 10.1182/blood-2016-01-690636 26966089 PMC5161007 2 Durham B.H. Molecular characterization of the histiocytoses: neoplasia of dendritic cells and macrophages Semin Cell Dev Biol 86 2019 62 76 10.1016/j.semcdb.2018.03.002 29526544 3 Allen C.E. Merad M. McClain K.L. Langerhans-cell histiocytosis N Engl J Med 379 2018 856 868 10.1056/NEJMra1607548 30157397 PMC6334777 4 Guyot-Goubin A. Donadieu J. Barkaoui M. Bellec S. Thomas C. Clavel J. Descriptive epidemiology of childhood Langerhans cell histiocytosis in France, 2000-2004 Pediatr Blood Cancer 51 2008 71 75 10.1002/pbc.21498 18260117 5 Stalemark H. Laurencikas E. Karis J. Gavhed D. Fadeel B. Henter J.I. Incidence of Langerhans cell histiocytosis in children: a population-based study Pediatr Blood Cancer 51 2008 76 81 10.1002/pbc.21504 18266220 6 Berres M.L. Merad M. Allen C.E. Progress in understanding the pathogenesis of Langerhans cell histiocytosis: back to Histiocytosis X? Br J Haematol 169 2015 3 13 10.1111/bjh.13247 25430560 PMC5193221 7 Rodriguez-Galindo C. Allen C.E. Langerhans cell histiocytosis Blood 135 2020 1319 1331 10.1182/blood.2019000934 32106306 8 Goyal G. Heaney M.L. Collin M. Erdheim-Chester disease: consensus recommendations for evaluation, diagnosis, and treatment in the molecular era Blood 135 2020 1929 1945 10.1182/blood.2019003507 32187362 9 Diamond E.L. Subbiah V. Lockhart A.C. Vemurafenib for BRAF V600-mutant Erdheim-Chester disease and Langerhans cell histiocytosis: analysis of data from the histology-independent, phase 2, open-label VE-BASKET study JAMA Oncol 4 2018 384 388 10.1001/jamaoncol.2017.5029 29188284 PMC5844839 10 Diamond E.L. Durham B.H. Ulaner G.A. Efficacy of MEK inhibition in patients with histiocytic neoplasms Nature 567 2019 521 524 10.1038/s41586-019-1012-y 30867592 PMC6438729 11 Amerikanou R. Munir T. Bowles K. Efficacy and tolerability of trametinib in adults with histiocytic neoplasms Blood 144 2024 1802 10.1182/blood-2024-204648 12 Genentech ZELBORAF® (vemurafenib) prescribing information https://www.gene.com/download/pdf/zelboraf_prescribing.pdf 2020 13 United States Food and Drug Administration COTELLIC® (cobimetinib) prescribing information https://www.accessdata.fda.gov/drugsatfda_docs/label/2022/206192s005lbl.pdf 14 Lin S. Zhao X. Zhou Z. Abstract 1951: FCN-159: a novel, potent and selective oral inhibitor of MEK1/2 for the treatment of solid tumors Cancer Res 80 2020 1951 15 Khan Z.M. Real A.M. Marsiglia W.M. Structural basis for the action of the drug trametinib at KSR-bound MEK Nature 588 2020 509 514 10.1038/s41586-020-2760-4 32927473 PMC7746607 16 Hu X. Li W. Zeng K. Phase 1 dose-escalation study to evaluate the safety, tolerability, pharmacokinetics, and anti-tumor activity of FCN-159 in adults with neurofibromatosis type 1-related unresectable plexiform neurofibromas BMC Med 21 2023 230 10.1186/s12916-023-02927-2 37400844 PMC10318822 17 Mao L. Guo J. Zhu L. A first-in-human, phase 1a dose-escalation study of the selective MEK1/2 inhibitor FCN-159 in patients with advanced NRAS-mutant melanoma Eur J Cancer 175 2022 125 135 10.1016/j.ejca.2022.08.005 36113242 18 Khoury J.D. Solary E. Abla O. The 5th edition of the World Health Organization classification of haematolymphoid tumours: myeloid and histiocytic/dendritic neoplasms Leukemia 36 2022 1703 1719 10.1038/s41375-022-01613-1 35732831 PMC9252913 19 Pegoraro F. Maniscalco V. Peyronel F. Long-term follow-up of mTOR inhibition for Erdheim-Chester disease Blood 135 2020 1994 1997 10.1182/blood.2019004478 32299103 20 Cohen Aubart F. Emile J.-F. Carrat F. Targeted therapies in 54 patients with Erdheim-Chester disease, including follow-up after interruption (the LOVE study) Blood 130 2017 1377 1380 10.1182/blood-2017-03-771873 28667012 21 Durham B.H. Singer M.E. Benbarche S. RAF-independent MEK mutations drive histiocytic neoplasms in vivo and are sensitive to single-agent ERK inhibition in patients Blood 140 2022 1098 1100 22 Gao Y. Chang M.T. McKay D. Allele-specific mechanisms of activation of MEK1 mutants determine their properties Cancer Discov 8 2018 648 661 10.1158/2159-8290.CD-17-1452 29483135 PMC6112572 23 Yuan J. Ng W.H. Tian Z. Activating mutations in MEK1 enhance homodimerization and promote tumorigenesis Sci Signal 11 2018 eaar6795 10.1126/scisignal.aar6795 30377225 24 Lian T. Li C. Wang H. Trametinib in the treatment of multiple malignancies harboring MEK1 mutations Cancer Treat Rev 81 2019 101907 10.1016/j.ctrv.2019.101907 31715422 25 United States Food and Drug Administration MEKINIST® (trametinib) prescribing information https://www.accessdata.fda.gov/drugsatfda_docs/label/2022/204114s024lbl.pdf 26 United States Food and Drug Administration MEKTOVI® (binimetinib) prescribing information https://www.accessdata.fda.gov/drugsatfda_docs/label/2018/210498lbl.pdf 27 Schad K. Baumann Conzett K. Zipser M.C. Mitogen-activated protein/extracellular signal-regulated kinase kinase inhibition results in biphasic alteration of epidermal homeostasis with keratinocytic apoptosis and pigmentation disorders Clin Cancer Res 16 2010 1058 1064 10.1158/1078-0432.CCR-09-1766 20103661 28 Papo M. Razanamahéry J. Da Silva M. Clinical phenotype of adult-onset systemic histiocytosis harboring BRAF in-frame deletions Haematologica 109 2024 3048 3052 10.3324/haematol.2024.285273 38779720 PMC11367196 Appendix A Supplementary data  Supplementary Materials Statistical Analysis Plan Clinical Study Protocol Acknowledgements This study was supported by Shanghai Fosun Pharmaceutical Industrial Development Co., Ltd Medical writing and editorial support were provided by JingYi Lee, PhD and Molly Yu, PhD, of Parexel and funded by Shanghai Fosun Pharmaceutical Industrial Development Co. Ltd Appendix A Supplementary data related to this article can be found at https://doi.org/10.1016/j.eclinm.2025.103486 ",
  "metadata": {
    "Title of this paper": "Clinical phenotype of adult-onset systemic histiocytosis harboring BRAF in-frame deletions",
    "Journal it was published in:": "eClinicalMedicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481021/"
  }
}