{
  "title": "Paper_497",
  "abstract": "pmc Front Med (Lausanne) Front Med (Lausanne) 2657 frontmedicine Front. Med. Frontiers in Medicine 2296-858X Frontiers Media SA PMC12484200 PMC12484200.1 12484200 12484200 41041442 10.3389/fmed.2025.1671323 1 Medicine Original Research Red cell distribution width as a prognostic indicator in medical and surgical ICU patients Vural Aski  1 Cinar Fadime  2 Bulbuloglu Semra  3  * Karamelek Arife  4 1 Department of Internal Medicine, Faculty of Medicine, Adiyaman University Adiyaman Türkiye 2 Division of Surgical Nursing, Department of Nursing, Faculty of Health Sciences, Istanbul Nisantasi University Istanbul Türkiye 3 Department of Midwifery, Faculty of Health Sciences, Istanbul Aydin University Istanbul Türkiye 4 Division of Surgical Nursing, Department of Nursing, Faculty of Health Sciences, Istanbul Aydin University Istanbul Türkiye Edited by: Xintian Cai Reviewed by: Azmi Eyiol Habtie Bantider Wubet *Correspondence: Semra Bulbuloglu, semrabulbuloglu@aydin.edu.tr semrabulbuloglu@hotmail.com 17 9 2025 2025 12 480650 1671323 22 7 2025 05 9 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Vural, Cinar, Bulbuloglu and Karamelek. 2025 Vural, Cinar, Bulbuloglu and Karamelek https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Red cell distribution width (RDW) has been investigated as a clinical predictor in different study populations. However, its prognostic usefulness in medical and surgical intensive care units remains unknown. This study investigates the role of RDW as a prognostic factor in this specific patient population. Objective This study examined the relationship between red cell distribution width and other blood parameters as a prognostic indicator among patients treated in medical and surgical ICU. Methods This study is observational in type and its sample consisted of n t Results In this study a positive, strong and statistically significant relationship existed between RDW and lactate ( r p r p r p r p p p p p Conclusion As a result of this study, RDW level was associated with levels of lactate, CRP, albumin, platelet and creatinine among patients in the medical and surgical ICU. The patients with chronic wounds, comorbidities, and/or certain medications and in deceased patients, were associated with increased RDW. RDW may be a useful marker as a prognostic criterion to validate clinical status. biomarker intensive care unit mortality prognosis red cell distribution width RDW The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Pathology Introduction A decrease in hemoglobin concentration and/or absolute red blood cell count is common in critically ill patients, with an incidence level approaching 69.9% ( 1 2 3 4 2 5 6 7 8 9 Any physiological condition triggers the release of reticulocytes into the circulation, resulting in an increase in RDW. RDW elevation has not yet been recognized as a disorder, developing secondary to other erythrocyte tests, and there is still no evidence to date as to whether it is a predictor of significant failure. It is thought that elevated RDW levels may be associated with worsening lung function in adult patients ( 10 11 Mortality of patients hospitalized in the intensive care unit has been associated with several factors. These factors include hypoalbuminemia ( 12 13 14 15 16 18 19 21 22 Materials and methods This study followed recommendations from STROBE (Strengthening the Reporting of Observational studies in Epidemiology) ( 23 n n Data collection tools Intensive care unit clinical characteristics form, Charlson comorbidity index, and Acute Physiology And Chronic Health Evaluation (APACHE) II scoring (scoring is performed at the initial hospitalization) were used for data collection. Information about the data collection tools is given below. Intensive care clinical characteristics form The data recording form included questions about the age, gender, clinical characteristics, information on probes and catheters, the drug information, infections and disorders, organ function tests, blood parameters, etc. Charlson comorbidity index The Charlson comorbidity index (CCI) was developed by Charlson ( 24 APACHE II scoring Acute Physiology And Chronic Health Evaluation (APACHE) II scoring, a predictor scoring system for mortality, was developed by Knaus et al., in 1985 and has been used in mortality prediction since then ( 25 Statistical analysis The retrospective data were coded into the Statistical Package for Social Sciences (SPSS) for IBM 27. Normal distribution assumptions were calculated by Kolmogorov-Smirnov analysis ( p p t Ethical aspects of the study The data of this study were approved by the Institutional Review Board of Esenyurt Necmi Kadioglu State Hospital, Department of Anesthesia and Reanimation before being extracted from electronic and written patient records. Ethics Committee Permission was obtained from Istanbul Aydın University Clinical Research Ethics Committee (Date: 31.07.2024, Number: 71/2024). The research steps were followed by the Declaration of Helsinki, patient confidentiality was respected, and no private and personal data of the patients were accessed. Results Table 1 r p r p r p p p TABLE 1 Characteristics and mean RDW values of patients in msICU. Characteristics Mean ± Sd (Min., Max) RDW-CV Mean ± Sd Test and Sig. Age 70.51 ± 16.86 (20, 99) 17.10 ± 3.04 r p Time of ICU stay (days) 25.13 ± 17.31 (10, 84) r p Time to intubation (days) 16.41 ± 10.52 (0, 77) r p Duration of CVC stay (days) 12.22 ± 9.34 (0, 74) r p Duration of foley stay (days) 24.80 ± 17.6 (0, 84) r p Duration of antibiotic use (days) 29.75 ± 21.12 (0, 127) T Number of blood product transfusions 7.21 ± 3.17 (0, 17) r p Duration of inotropic and vasopressor use (days) 7.27 ± 8.10 (0, 41) r p * Duration of LMWH (days) 12.34 ± 4.66 (0, 27) r p CCI score 2.51 ± 1.38 (0, 5) r p ** APACHE II score 26.37 ± 7.44 (10, 44) r p *   n  %  Gender Woman 110 55.8 17.16 ± 2.90 t p Male 87 44.2 17.02 ± 3.22  Reason for ICU admission Acute respiratory disorders 157 79.7 16.93 ± 3.04 F p Sepsis 14 7.1 18.07 ± 2.45 Neurological disorders 13 6.6 17.13 ± 3.14 Advanced stage (4 and 5) malignancy 4 2 21.36 ± 5.39 Other causes (cardiac, renal, traumatic) 9 4.6 17.10 ± 2.99  Presence of chronic disease Yes 188 95.4 17.13 ± 3.07 t p No 9 4.6 16.36 ± 2.40  ICU type Surgery 60 30.5 17.91 ± 3.66 t p * Medical 137 69.5 16.74 ± 2.67  Presence of pressure wound Yes 90 45.7 17.62 ± 2.79 t p * No 107 54.3 16.66 ± 3.18  Feeding catheter PEG 30 15.2 17.14 ± 1.38 t p NG catheter 126 64 17.08 ± 3.68 Peroral 41 20.8 17.11 ± 2.14  Nosocomial infection Yes 145 73.6 17.06 ± 2.58 t p No 52 26.4 17.20 ± 4.09  Conclusion Death 117 59.4 17.74 ± 2.83 t p ** Transfer to clinic 80 40.6 16.16 ± 3.11 Statements with statistical significance are shown in bold. * p ** p r F t t Table 2 TABLE 2 Coagulation factors, immune function and erythrocyte test values. Blood parameters Mean ± Sd Min. – Max.  Coagulation factors INR (0.8 – 1.2) 1.50 ± 1.77 9.96 – 7.75 PLT (150 – 400 10∧9/L) 208.10 ± 45.46 9 – 492 APTT (25 – 39 Sec.) 34.48 ± 20.13 7.50 – 247 Fibrinogen (150 – 450 mg/dL) 553.50 ± 195.57 52.90 – 1,200 D-dimer (<500 ng/mL) 2747.20 ± 1013.14 0 – 35,200  Immune function tests WBC (3.8 – 10 10 3 14.05 ± 11.14 0.04 – 64.77 Neutrophil (1.56– 6.13 10 3 79.22 ± 13.86 19.70 – 97.20  Infection panel CRP (<5 mg/L) 145.76 ± 25.91 0.60 – 192 Procalcitonin (0–0.05 ng/mL) 3.35 ± 5.29 0.00 – 19.7  Erythrocyte tests RDW-CV (11.2 – 15%) 17.10 ± 3.04 12 – 31.60 HGB (11.5 – 15.5 g/dL) 9.17 ± 1.90 5 – 17.40 Ferritin (20 – 300 μg/L) 404.76 ± 193.25 0 – 821 HCT (35.5 – 48%) 29.23 ± 6.14 14 – 52.20 RBC (3.8 – 5.6 10(6)/μL) 3.23 ± 0.75 0.34 – 6.16 MCHC (31.0 – 37.0 g/dL) 28.56 ± 2.57 18.60 – 36.80 MCV (80 – 95 fL) 90.29 ± 8.66 32.80 – 111 Table 3 TABLE 3 Organ (liver, lung, heart and kidney) function tests. Blood parameters Mean ± Sd Min. – Max.  Liver Albumin (35 – 54 g/L) 23.14 ± 10.04 0 – 41.60 Total protein (60 – 83 g/L) 62.74 ± 34.06 25.2 – 56.6 AST (8 – 33 U/L) 105.69 ± 46.24 5 – 5.152 ALT (<41 U/L) 41.31 ± 18.16 0.76 – 1.070 LDH (125 – 220 U/L) 492.86 ± 196.11 36.60 – 3.798 Glucose (74 – 106 mg/dL) 146.44 ± 82.17 6 – 545  Lung Lactate (1 – 1.5 mmol/L) 4.96 ± 3.75 0.30 – 26  Heart Troponin T (0 – 0.04 ng/ml) 0.10 ± 0.32 0 – 3.58  Kidney e-GFR (≥90) 79.86 ± 23.88 7 – 115 Urea (7 – 20 mg/dL) 76.34 ± 9.11 8 – 99 Creatinine (0.5 – 1.13 mg/dL) 1.13 ± 1.07 0.01 – 6.50 Table 4 r p r p r p r p r p r p TABLE 4 Correlation analysis between RDW-CV and albumin, lactate, CRP, PLT, creatinine and hemoglobin. RDW-CV Correlation Blood parameters  R  P Pearson correlation Albumin −0.172 0.015 * Lactate 0.704 0.004 ** CRP 0.759 0.026 * PLT −0.169 0.015 ** Creatinine 0.229 0.001 ** Hemoglobin −0.184 0.011 * r * p ** p Figure 1 FIGURE 1 The relationship between RDW and CRP of patients. It shows the same directional relationship between RDW and CRP values in intensive care unit patients. Scatter plot showing the relationship between RDW-CV on the x-axis and CRP on the y-axis. Data points are dispersed with many clustered between 10 and 20 on the x-axis and below 200 on the y-axis. A trend line slopes upward across the plot. Figure 2 FIGURE 2 The relationship between RDW and lactate of patients. It shows the same directional relationship between RDW and lactate values in intensive care unit patients. Scatter plot showing the relationship between RDW-CV (x-axis) and Lactate levels (y-axis). Data points are scattered with a noticeable upward trend. A diagonal line indicates a positive correlation between the two variables. Figure 3 FIGURE 3 The relationship between RDW and creatinine of patients. It shows the same directional relationship between RDW and creatinine values of intensive care unit patients. Scatter plot showing creatinine levels on the vertical axis and RDW-CV on the horizontal axis. Data points are distributed across the chart, with a vertical line at 17.5 RDW-CV. According to regression analysis, the relationship between death and RDW, and the predictors of RDW-CV are shown in Table 5 p p p p TABLE 5 The relationship between death and RDW-CV, and the predictors of RDW-CV according to regression analysis, ( n Unstandardized Coefficients Standardized Coefficients Items Model B Std. Error Beta  t  P  F Sig.  R 2 Death 1 (Constant) 30.601 1.311 3.3760 .000 10.399 0.001 a 0.071 RDW-CV 2.422 0.781 0.318 1.4370 .001 RDW-CV 1 (Constant) 8.528 1.254 6.8820 .000 5.301 0.001 b 0.212 APACHE II 0.371 0.291 0.266 3.4140 .022 CCI Score −0.041 0.044 −0.208 −1.2860 .004 Duration of inotropic and vasopressor use 0.721 0.254 0.244 1.7040 .006 2 (Constant) 9.021 1.123 8.0300 .000 6.553 0.000 c 0.111 ICU Type 0.325 0.119 0.354 2.5220 .012 Presence of pressure wound 0.046 0.034 0.310 2.2270 .027 a b c Discussion In this study, we examined the relationship between clinical characteristics, other blood parameters and RDW values of patients treated in the msICU. The RDW level of intensive care unit patients has been associated with mortality in several previous studies. Otero et al. examined the relationship between RDW measured at the first admission to the intensive care unit and mortality, and it was noted that surgical intensive care unit patients with high RDW had an increased risk of 90-day mortality ( 26 27 28 The use of RDW in predicting mortality in serious diseases is undoubtedly due to its variation in the same or opposite direction from previously defined predictors. In the study by Nan et al., it was noted that changing RDW values had no statistically significant effect on lactate (mmol/L) ( 28 The results of our study report the same directional and strong correlation between RDW and lactate in intensive care unit patients, unlike the study of Nan et al. Aras and Paşalı Kilit reported that elevated lactate and RDW were associated with mortality in tertiary intensive care unit patients ( 29 30 31 32 The relationship between increased RDW levels and oxidative stress and inflammatory response has been previously described in intensive care unit patients and is associated with multiple organ failure ( 20 33 34 35 36 37 38 In this study, 7.1% of the patients were hospitalized in ICU due to sepsis, 79.7% due to acute respiratory disorders, 95.4% had a chronic disease, CCI score was 2.51 ± 1.38, and the mean age was 70.51 ± 16.86 years. There was a statistically significant correlation between the duration of inotropic and vasopressor use, CCI score, APACHE II score and RDW levels. In addition, the RDW level of patients who were deceased was higher than those who were transferred to the clinic and this difference was statistically significant. Previous studies have pointed out that there may be a link between renal failure, oxidative stress, cardiac problems, increased neuroendocrine activities and hypoalbuminemia and elevated RDW ( 2 39 41 In the literature, there is an opinion that albumin infusion does not reduce mortality even if it reduces hypalbuminemia ( 42 43 1 44 This study has several limitation principles. This study had a retrospective single-center design, and the number of patients with common ICU comorbidities was in the minority. There was no information regarding the calibration and bias of the measuring instruments used in the laboratory. In addition, small sample sizetherapeutic approaches, medications, nutritional products, blood values at initial hospitalization and unknowns regarding the current nutritional status were considered as limitations. Conclusion Considering the clinical characteristics of this study, the relatively high mean age, the presence of multiple comorbidities, a high APACHE II score, the use of inotropic and vasopressor medications, and a long ICU stay suggest that the prognosis is generally poor. The study results suggest that these clinical features can associated with increased RDW levels, although the mechanism is not explained. According to the results obtained in our study, increased RDW was weakly associated with decreased albumin and hemoglobin. In contrast, lactate, CRP and creatinine increased together with RDW. The results obtained in our study can guide clinicians during the management of intensive care unit patients. We recommend examining RDW levels in medical and surgical ICU patients in larger sample sizes and multicenter studies. Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Ethics statement The studies involving humans were approved by The data of this study were approved by the Institutional Review Board of Esenyurt Necmi Kadioglu State Hospital, Department of Anesthesia and Reanimation before being extracted from electronic and written patient records. Ethics Committee Permission was obtained from Istanbul Aydın University Clinical Research Ethics Committee (Date: 31.07.2024, Number: 71/2024). The research steps were followed by the Declaration of Helsinki, patient confidentiality was respected, and no private and personal data of the patients were accessed. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Author contributions AV: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. FC: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. SB: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. AK: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Wubet H Mengistu L Gobezie N Mekuriaw B Mebratie A Sahile W The incidence and factors associated with Anemia in elective surgical patients admitted to a surgical intensive care unit: a retrospective cohort study. Eur J Med Res 2024 29 290 10.1186/s40001-024-01887-4 38764061 PMC11103962 2. Akkoç M Bülbüloğlu S Investigation of red cell distribution width as a prognostic criterion in severe burns. Int Wound J 2022 19 1428 37 10.1111/iwj.13736 34904354 PMC9493245 3. Posluszny J Conrad P Halerz M Shankar R Gamelli R Classifying transfusions related to the anemia of critical illness in burn patients. J Trauma 2011 71 26 31 10.1097/TA.0b013e3181f2d9ed 21131855 PMC3321309 4. Celkan T What does a hemogram say to us? Turk Pediatri Ars 2020 55 103 16 10.14744/TurkPediatriArs.2019.76301 32684755 PMC7344121 5. Palmieri T Burn injury and blood transfusion. Curr Opin Anaesthesiol 2019 32 247 51 10.1097/ACO.0000000000000701 30817402 6. Chen J Wu J Lv X Yang Q Chen J Zhang D The value of red blood cell distribution width, neutrophil-to-lymphocyte ratio, and hemoglobin-to-red blood cell distribution width ratio in the progression of non-small cell lung cancer. PLoS One 2020 15 e0237947 10.1371/journal.pone.0237947 32833961 PMC7446848 7. Hu L Li M Ding Y Pu L Liu J Xie J Prognostic value of RDW in cancers: a systematic review and meta-analysis. Oncotarget 2016 8 16027 35 10.18632/oncotarget.13784 27926498 PMC5362543 8. Su C Liao L Song Y Xu Z Mei W The role of red blood cell distribution width in mortality and cardiovascular risk among patients with coronary artery diseases: a systematic review and meta-analysis. J Thorac Dis 2014 6 1429 40 10.3978/j.issn.2072-1439.2014.09.10 25364520 PMC4215144 9. Tonietto T Boniatti M Lisboa T Viana M Dos Santos M Lincho C Elevated red blood cell distribution width at ICU discharge is associated with readmission to the intensive care unit. Clin Biochem 2018 55 15 20 10.1016/j.clinbiochem.2018.03.010 29550510 10. Schepens T De Dooy J Verbrugghe W Jorens P Red cell distribution width (RDW) as a biomarker for respiratory failure in a pediatric ICU. J Inflamm 2017 14 12 10.1186/s12950-017-0160-9 28596707 PMC5463327 11. Zhou D Xu P Peng M Shao X Wang M Ouyang J Pre-treatment red blood cell distribution width provides prognostic information in multiple myeloma. Clin Chim Acta 2018 481 34 41 10.1016/j.cca.2018.02.009 29452082 12. Padkins M Breen T Anavekar N Barsness G Kashani K Jentzer J Association between albumin level and mortality among cardiac intensive care unit patients. J Intensive Care Med 2021 36 1475 82 10.1177/0885066620963875 33016174 13. Neyra J Ortiz-Soriano V Liu L Smith T Li X Xie D Prediction of mortality and major adverse kidney events in critically Ill patients with acute kidney injury. Am J Kidney Dis 2023 81 36 47 10.1053/j.ajkd.2022.06.004 35868537 PMC9780161 14. Heijnen N Hagens L Smit M Cremer O Ong D van der Poll T Biological subphenotypes of acute respiratory distress syndrome show prognostic enrichment in mechanically ventilated patients without acute respiratory distress syndrome. Am J Respir Crit Care Med 2021 203 1503 11 10.1164/rccm.202006-2522OC 33465019 15. Peng S Chen Q Ke W Wu Y The relationship between serum anion gap levels and short-, medium-, and long-term all-cause mortality in ICU patients with congestive heart failure: a retrospective cohort study. Acta Cardiol 2024 79 705 19 10.1080/00015385.2024.2371627 38953283 16. Thomas-Rüddel D Fröhlich H Schwarzkopf D Bloos F Riessen R Sepsis and underlying comorbidities in intensive care unit patients : analysis of the cause of death by different clinicians-a pilot study. Med Klin Intensivmed Notfmed 2024 119 123 8 10.1007/s00063-023-01037-4 37380812 PMC10901974 17. Muscedere J Waters B Varambally A Bagshaw S Boyd J Maslove D The impact of frailty on intensive care unit outcomes: a systematic review and meta-analysis. Intensive Care Med 2017 43 1105 22 10.1007/s00134-017-4867-0 28676896 PMC5501903 18. Vai B Mazza M Delli Colli C Foiselle M Allen B Benedetti F Mental disorders and risk of COVID-19-related mortality, hospitalisation, and intensive care unit admission: a systematic review and meta-analysis. Lancet Psychiatry 2021 8 797 812 10.1016/S2215-0366(21)00232-7 34274033 PMC8285121 19. Moreno-Torres V Royuela A Múñez-Rubio E Gutierrez-Rojas Á Mills-Sánchez P Ortega A Red blood cell distribution width as prognostic factor in sepsis: a new use for a classical parameter. J Crit Care 2022 71 154069 10.1016/j.jcrc.2022.154069 35667275 20. Zhang L Yu C Guo K Huang C Mo L Prognostic role of red blood cell distribution width in patients with sepsis: a systematic review and meta-analysis. BMC Immunol 2020 21 40 10.1186/s12865-020-00369-6 32631218 PMC7339553 21. Hu Z Lippi G Montagnana M Diagnostic and prognostic value of red blood cell distribution width in sepsis: a narrative review. Clin Biochem 2020 77 1 6 10.1016/j.clinbiochem.2020.01.001 31935355 22. Meynaar I Knook A Coolen S Le H Bos M van der Dijs F Red cell distribution width as predictor for mortality in critically ill patients. Neth J Med. 2013 71 488 93 24218427 23. von Elm E Altman D Egger M Pocock S Gøtzsche P Vandenbroucke J The Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) statement: guidelines for reporting observational studies. Lancet 2007 370 1453 7 10.1016/S0140-6736(07)61602-X 18064739 24. Charlson M Pompei P Ales K MacKenzie C A new method of classifying prognostic comorbidity in longitudinal studies: development and validation. J Chronic Dis 1987 40 373 83 10.1016/0021-9681(87)90171-8 3558716 25. Knaus W Draper E Wagner D Zimmerman J APACHE II: a severity of disease classification system. Crit Care Med. 1985 13 818 29 3928249 26. Otero T Canales C Yeh D Hou P Belcher D Quraishi S Elevated red cell distribution width at initiation of critical care is associated with mortality in surgical intensive care unit patients. J Crit Care 2016 34 7 11 10.1016/j.jcrc.2016.03.005 27288601 PMC4903153 27. Han Y Zhang L Yan L Li P Ouyang P Lippi G Red blood cell distribution width predicts long-term outcomes in sepsis patients admitted to the intensive care unit. Clin Chim Acta 2018 487 112 6 10.1016/j.cca.2018.09.019 30218659 28. Nan W Li S Wan J Peng Z Association of mean RDW values and changes in RDW with in-hospital mortality in ventilator-associated pneumonia (VAP): evidence from MIMIC-IV database. Int J Lab Hematol 2024 46 99 106 10.1111/ijlh.14192 37864327 29. Aras Z Paşalı Kilit T Impact of biochemical parameters on mortality in critically Ill ICU patients: the role of mechanical ventilation, elevated lactate, red blood cell distribution width (RDW-CV) levels, and nutrition risk screening 2002 (NRS-2002) Score. Cureus 2002 16 e76522 10.7759/cureus.76522 39872558 PMC11771530 30. Bakker J Gris P Coffernils M Kahn R Vincent J Serial blood lactate levels can predict the development of multiple organ failure following septic shock. Am J Surg 1996 171 221 6 10.1016/S0002-9610(97)89552-9 8619454 31. Berg R Jeppesen T Mohammad M Andreasen A Iepsen U Plovsing R [Hyperlactataemia]. Ugeskrift for Laeger. 2021 183 V11200813 34477100 32. Bakker J Nijsten M Jansen T Clinical use of lactate monitoring in critically ill patients. Ann Intensive Care 2013 3 1 8 10.1186/2110-5820-3-12 23663301 PMC3654944 33. Jo Y Kim K Lee J Kang C Kim T Park H Red cell distribution width is a prognostic factor in severe sepsis and septic shock. Am J Emerg Med 2013 31 545 8 10.1016/j.ajem.2012.10.017 23380094 34. Srisawat N Kellum J The role of biomarkers in acute kidney injury. Crit Care Clin 2020 36 125 40 10.1016/j.ccc.2019.08.010 31733675 35. Moledina D Parikh C Phenotyping of acute kidney injury: beyond serum creatinine. Semin Nephrol 2018 38 3 11 10.1016/j.semnephrol.2017.09.002 29291759 PMC5753429 36. Sun G Zhang Y Mo S Zhao M Multiple organ dysfunction syndrome caused by sepsis: risk factor analysis. Int J Gen Med 2021 14 7159 64 10.2147/IJGM.S328419 34737610 PMC8559339 37. El-Menyar A Al Thani H Zarour A Tuma M AbdulRahman H Parchani A Multiple organ dysfunction syndrome (MODS): is it preventable or inevitable? Int J Clin Med. 2013 3 722 30 10.4236/ijcm.2012.37A127 38. Gourd N Nikitas N Multiple organ dysfunction syndrome. J Intensive Care Med 2020 35 1564 75 10.1177/0885066619871452 31455133 39. Yamada S Yoshihisa A Kaneshiro T Amami K Hijioka N Oikawa M The relationship between red cell distribution width and cardiac autonomic function in heart failure. J Arrhythm 2020 36 1076 82 10.1002/joa3.12442 33335628 PMC7733562 40. Solak Y Yilmaz M Saglam M Caglar K Verim S Unal H Red cell distribution width is independently related to endothelial dysfunction in patients with chronic kidney disease. Am J Med Sci 2014 347 118 24 10.1097/MAJ.0b013e3182996a96 23928544 41. Allen L Felker G Mehra M Chiong J Dunlap S Ghali J Validation and potential mechanisms of red cell distribution width as a prognostic marker in heart failure. J Card Fail 2010 16 230 8 10.1016/j.cardfail.2009.11.003 20206898 PMC3894681 42. Chen Y Ma H Perng C Liao W Shih Y Lin C Albumin supplementation may have limited effects on prolonged hypoalbuminemia in major burn patients: an outcome and prognostic factor analysis. J Chin Med Assoc 2020 83 206 10 10.1097/JCMA.0000000000000245 31876796 43. Eljaiek R Dubois M Hypoalbuminemia in the first 24h of admission is associated with organ dysfunction in burned patients. Burns 2013 39 113 8 10.1016/j.burns.2012.05.008 22683139 44. Wubet H Gobezie N Diress G Belete K Mossie K Mekuriaw B The hidden burden of anemia in elderly surgical patients: a prospective study on incidence and contributing factors. BMC Geriatr 2025 25 555 10.1186/s12877-025-06182-3 40731390 PMC12309042 ",
  "metadata": {
    "Title of this paper": "The hidden burden of anemia in elderly surgical patients: a prospective study on incidence and contributing factors.",
    "Journal it was published in:": "Frontiers in Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484200/"
  }
}