{
  "title": "Paper_10",
  "abstract": "pmc eLife Elife 1894 elife eLife eLife 2050-084X eLife Sciences Publications, Ltd PMC12490854 PMC12490854.1 12490854 12490854 41037009 10.7554/eLife.106688 106688 1 version of record Review Article Immunology and Inflammation Trained immunity in skin infections: Macrophages and beyond Gres Vitka https://orcid.org/0000-0002-5034-4691 1 2 † Göcer Merve https://orcid.org/0009-0001-4180-457X 1 2 3 † Kolter Julia 1 2 Henneke Philipp https://orcid.org/0000-0001-7314-7984 philipp.henneke@uniklinik-freiburg.de 1 2 3 4  1 https://ror.org/0245cg223 Institute for Infection Prevention and Control, Medical Center and Faculty of Medicine, University of Freiburg Freiburg Germany  2 https://ror.org/0245cg223 Center for Chronic Immunodeficiency, Medical Center and Faculty of Medicine, University of Freiburg Freiburg Germany  3 https://ror.org/0245cg223 Faculty of Biology, University of Freiburg Freiburg Germany  4 https://ror.org/0245cg223 Institute for Immunodeficiency, Medical Center and Faculty of Medicine, University of Freiburg Freiburg Germany Novakovic Boris Reviewing Editor  https://ror.org/048fyec77 Murdoch Childrens Research Institute Australia Rath Satyajit Senior Editor  https://ror.org/028qa3n13 Indian Institute of Science Education and Research (IISER) India † These authors contributed equally to this work. 02 10 2025 2025 14 478904 e106688 07 3 2025 01 9 2025 02 10 2025 03 10 2025 03 10 2025 © 2025, Gres, Göcer et al 2025 Gres, Göcer et al https://creativecommons.org/licenses/by/4.0/ This article is distributed under the terms of the Creative Commons Attribution License The skin is frequently subjected to minor mechanical insults that may compromise its barrier integrity and permit the entry of pathogens. Therefore, the immune system of the skin needs to rapidly balance antimicrobial defense with tissue repair. To maintain homeostasis, the skin relies both on acute immune defenses and on mechanisms of innate memory or trained immunity. This enhanced inflammatory response to a second challenge has been well characterized in bone marrow cells, such as monocytes, monocyte-derived macrophages, and stem cells. Yet, the specific memory responses in skin-resident immune cells remain less understood. Importantly, the common skin colonizer Staphylococcus aureus trained immunity skin macrophages S. aureus Dermis http://dx.doi.org/10.13039/501100001659 Deutsche Forschungsgemeinschaft TRR359 (Project ID 491676693) Kolter Julia Henneke Philipp http://dx.doi.org/10.13039/501100001659 Deutsche Forschungsgemeinschaft TRR167 (Project ID 259373024) Henneke Philipp http://dx.doi.org/10.13039/501100001659 Deutsche Forschungsgemeinschaft CRC1160 (Project ID 256073931) Henneke Philipp The funders had no role in study design, data collection and interpretation, or the decision to submit the work for publication. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Author impact statement Review of the emerging understanding of trained immunity in the skin and how infection-driven cellular processes induce long-lasting immune adaptation and modulate skin barrier integrity. Immune landscape of the skin The skin consists of two basic layers: the epidermis and the dermis. The epidermis forms the outermost layer, and it is separated from the underlying dermis by a basement membrane. It provides protection against pathogens and UV light, while preventing excessive water loss from the inside. The dermis contributes to the mechanical properties of the skin, such as elasticity and flexibility, due to its high content of collagen and elastin fibers. It also contains various appendages, including sweat and sebaceous glands and hair follicles, which contribute to physical protection, thermoregulation, sensation, and lubrication of the skin. Below the dermis is the subcutis or hypodermis, which consists mainly of adipocytes and connective tissue and connects the skin to the deep fascia. The blood vessels in the subcutis feed into the deep venous plexus of the dermis, where they connect with the venules and arterioles of the superficial plexus, providing nutrients and oxygen to the epidermis and skin appendages. Epidermis Keratinocytes are the most numerous cell type in the epidermis, ensuring its physical stability. Beyond this structural role, they also sense microbial components via Toll-like receptors (TLR), NOD-like receptors (NLRs), and C-type lectin receptors like dectin-1, leading to the production of cytokines, such as IL-1β and IL-36. These are important for the antimicrobial and immunological properties of the skin ( Goldstein et al., 2020 Klicznik et al., 2018 Pfaff et al., 2017 Greter et al., 2012 Doebel et al., 2017 Mass et al., 2016 Hoeffel et al., 2012 Merad et al., 2008 Seré et al., 2012 The lower epidermal layer in mice, the stratum spinosum, hosts a distinct population of branched γẟ T-cells, known as dendritic epidermal T-cells (DETC). They sense stress or damage in keratinocytes, aiding in wound healing and skin homeostasis. In humans, most epidermal T-cells are αβ T-cells, particularly a non-circulating resident memory population, seeding the skin following the resolution of infection and contributing to the long-term tissue surveillance ( Ho and Kupper, 2019 Dermis and dermal macrophages Unlike the epidermis, the dermis is populated by diverse myeloid and lymphoid immune cell populations ( Kabashima et al., 2019 Ho and Kupper, 2019 + Belkaid and Tamoutounour, 2016 In terms of absolute numbers, Mϕ are the dominant immune cell type in the dermis. Dermal Mϕ are a heterogeneous population in the adult, consisting of multiple subpopulations with distinct lifespans, localizations, and transcriptional profiles ( Tamoutounour et al., 2013 Kolter et al., 2019 Lohrmann et al., 2025 Gomez Perdiguero et al., 2015 Kolter et al., 2019 Lohrmann et al., 2025 Lohrmann et al., 2025 Lohrmann et al., 2025 + 3 hi Chakarov et al., 2019 Kolter et al., 2019 Kolter et al., 2025 Interestingly, the density of the resident Mϕ network in the skin is strictly regulated at the site, as demonstrated in Irf8 -/- Lohrmann et al., 2025 In response to infection or injury, Mϕ are essential for maintaining skin barrier integrity and repair ( Barreiro et al., 2016 Kolter et al., 2019 Shook et al., 2016 Forde et al., 2023 Ginhoux et al., 2017 Trained immunity in the skin The concept of trained immunity Trained immunity (TI) or innate immune memory is a process by which innate immune cells, which previously encountered a pathogenic stimulus, show an enhanced and more rapid response to a subsequent pathogenic challenge. This primed response pattern is characterized by enhanced formation of cytokines, reactive oxygen species (ROS), and increased phagocytosis ( Netea et al., 2011 Janeway, 1989 Netea et al., 2020 While the tuberculosis vaccine Bacillus Calmette-Guérin (BCG) and the fungal cell wall component β-glucan were most frequently used as experimental inducers of TI, other triggers have been identified, for example oxidized low-density lipoproteins and S. aureus Bekkering et al., 2014 Carlile et al., 2024 Feuerstein et al., 2020 Kaufmann et al., 2018 Moorlag et al., 2020 One important example of heterologous TI is the protective effect of BCG vaccination against Candida albicans Kleinnijenhuis et al., 2012 van ’t Wout et al., 1992 Figure 1 Arts et al., 2016 Riksen and Netea, 2021 Figure 1. Metabolites of the TCA cycle involved in trained immunity ACOD1 - aconitate decarboxylase, encoded by Immune responsive gene 1 (IRG1). SDH – succinate dehydrogenase, KDM5 - Lysine-specific demethylase 5. Innate immune responses to S. aureus To date, much of the information regarding TI in the skin is derived from studies using S. aureus Streptococcus pyogenes, C. albicans, S. aureus S. aureus Eriksen et al., 1995 Kluytmans and Wertheim, 2005 . S. aureus S. aureus Thammavongsa et al., 2015 . S. aureus Cho et al., 2010 Feuerstein et al., 2017 Miller and Cho, 2011 Montgomery et al., 2015 . S. aureus Picard et al., 2010 Craig-Mueller et al., 2020 Feuerstein et al., 2015 Cho et al., 2012 . S. aureus Wang et al., 2021 Another cytokine that is crucial for protection against S. aureus S. aureus Miller and Cho, 2011 S. aureus Farmand et al., 2018 S. aureus Cho et al., 2010 S. aureus Wickersham et al., 2017 Forde et al., 2023 Tannahill et al., 2013 Woods et al., 2022 Interestingly, however, at 1 day post-infection (dpi), dermal Mϕ can bypass the need for HIF-1α by initiating a metabolic shift and generating an effective inflammatory response in a GM-CSF-dependent manner ( Forde et al., 2023 Guilliams et al., 2013 Kopf et al., 2015 Forde et al., 2023 Trained immunity by skin macrophages and HSCs Mice previously infected subcutaneously with methicillin-resistant S. aureus Chan et al., 2017 Rag1 -/- Chan et al., 2017 Chan et al., 2018 S. aureus S. aureus Chan et al., 2018 Indeed, pivotal studies revealed that β-glucan administration or BCG vaccination can train HSCs in the bone marrow, which enhances myelopoiesis and induces the generation of trained progeny, for example monocytes and Mϕ, and thus improves antimycobacterial immunity ( Bekkering et al., 2014 Cirovic et al., 2020 Kaufmann et al., 2018 Mitroulis et al., 2018 S. aureus Chan et al., 2017 S. aureus Kaufmann et al., 2018 In contrast, a strictly localized intradermal S. aureus Feuerstein et al., 2020 bona fide Myd88 Quintin et al., 2012 S. aureus Feuerstein et al., 2020 Forde et al., 2023 S. aureus Forde et al., 2023 Kaufmann et al., 2018 Zahalka et al., 2022 Figure 2 Forde et al., 2023 Ginhoux et al., 2017 Lohrmann et al., 2025 Ccr2 -/- Feuerstein et al., 2020 Figure 2. Innate memory formation in S. aureus In homeostatic mouse skin, tissue resident (TRMΦ) represent the largest innate immune cell population. Monocytes differentiate into macrophages (MDMΦ) over time. Some immune cells of the skin are not represented in this scheme, for example CD4 T cells and γδ T cells. During S. aureus S. aureus Metabolic changes are intertwined with the development and maintenance of epigenetic changes that control innate memory ( Figure 3 Cheng et al., 2014 Arts et al., 2018a Arts et al., 2016 Arts et al., 2016 Zahalka et al., 2022 Arts et al., 2016 Bekkering et al., 2014 Kleinnijenhuis et al., 2012 Mitroulis et al., 2018 Figure 3. Epigenetic and metabolic reprogramming of dermal MΦ in S. aureus MΦ detect S. aureus In the context of skin infection, the pathogen itself could modulate the immune response and induction of TI by the host. For example, S. aureus Heim et al., 2020 S. aureus Wong Fok Lung et al., 2020 S. aureus Acker et al., 2019 S. aureus C. albicans S. aureus Lin et al., 2024 Lin et al., 2024 Trained immunity in the skin beyond macrophages Granulocytes In contrast to Mϕ, granulocytes are short-lived, thus their TI mechanisms are likely different. A recent study demonstrated that epicutaneous S. aureus Radhouani et al., 2025 Radhouani et al., 2025 Similarly, neutrophils appear to acquire memory-like properties primarily through alterations in their bone marrow progenitors, rather than through changes in their terminally differentiated state ( Moorlag et al., 2020 Moorlag et al., 2020 Lastly, while skin bacterial infection can cause basophil recruitment and IL-4 release, which suppresses local IL-17A-dependent protective responses and may promote persistent changes in the skin immune environment, direct evidence for long-term, systemic TI is still emerging ( Leyva-Castillo et al., 2024 Leyva-Castillo et al., 2024 Hoft et al., 1999 Dendritic cells Compared to other myeloid cells, the capacity of DCs to develop memory-like features has been less well investigated. This may be due to their well-characterized role in T cell activation, which may blur the distinction between TI and adaptive immunity. For example, Antonio-Herrera and colleagues have shown that an adjuvant derived from cholera toxin (CTB) activates DCs in the skin, promoting long-term maintenance of CD4 T cells, in particular Th17 and Th1 subsets ( Antonio-Herrera et al., 2018 Tepale-Segura et al., 2024 Tepale-Segura et al., 2024 C. neoformans Hole et al., 2019 Natural killer (NK) cells One of the first reports on TI identified NK cells with a memory phenotype after cytomegalovirus (CMV) infection ( Sun et al., 2009 Luetke-Eversloh et al., 2014 Luetke-Eversloh et al., 2014 S. aureus Kleinnijenhuis et al., 2014 Although the aforementioned studies addressed circulating NK cells in systemic infection, the principles may also apply to tissue-resident NK cells, including those in the skin. Although NK cells are not typical constituents of a healthy skin ( Torcellan et al., 2024 de Lima et al., 2024 S. aureus Sobecki et al., 2021 S. aureus Torcellan et al., 2024 Immune memory in non-immune cells Epithelial stem cells (EpSCs) in the basal layer of the epithelium are self-renewing cells maintaining the epithelial tissues of the skin, the gastrointestinal lining, and the respiratory tract ( Blanpain et al., 2004 Naik et al. found that skin inflammation induces long-lasting memory in EpSCs, enabling faster wound closure upon subsequent injury. This process relies on AIM2, as Aim2 Naik et al., 2017 Naik et al., 2017 Other non-immune cells with possible direct or indirect implication in TI are fibroblasts, which are important for the formation of extracellular matrix (ECM) components, for wound healing and tissue remodeling. As the most abundant stromal cells in the dermis, their primary function is to provide structural tissue support. However, growing evidence suggests that fibroblasts may also contribute to immune memory. For example, in vitiligo, IFNγ-responsive fibroblasts were identified as key players in the recruitment and activation of auto-reactive CD8 +cytotoxic T-cells through the secretion of cytokines, ultimately leading to the loss of melanocytes ( Xu et al., 2022 In the synovium of patients with rheumatoid arthritis, a fibroblast subpopulation has been implicated in disease promotion via the formation of cytokines and matrix metalloproteinases ( Mizoguchi et al., 2018 Skin microbiota and TI From birth on, the skin must rapidly adapt to exposure by an increasing complex mixture of bacteria, fungi, viruses, and archaea. The mode of delivery has been found to impact the composition of the early-life skin microbiota. While infants born vaginally have Lactobacillus Staphylococcus Corynebacterium species Dominguez-Bello et al., 2010 Chu et al., 2017 Staphylococcus Streptococcus Cutibacterium Corynebacterium spp Luna, 2020 Oh et al., 2012 Nakatsuji et al., 2013 Scharschmidt et al., 2015 Zanvit et al., 2015 In contrast, certain commensal species can promote inflammation. Cutibacterium acnes Sanford et al., 2016 Staphylococcus epidermidis Naik et al., 2015 While it is established that microbial products can promote or inhibit histone modifications, their long-term effect on TI has yet to be directly demonstrated. There is, however, evidence that the interplay between microbiota and TI might be bi-directional. For instance, BCG vaccination has been shown to induce memory in alveolar Mϕ independently of circulating monocytes, but also to alter the intestinal microbiome and systemic metabolites ( Jeyanathan et al., 2022 Khosravi et al., 2014 Trained immunity in other skin pathologies Recent discoveries in TI mechanisms have not only offered insights into previously unexplained disease causes and consequences but also have opened new therapeutic avenues. Most prominently, BCG vaccination induces TI, suggesting a mechanistic explanation for the long-established ‘off-target’ effects in non-mycobacterial diseases where a strong immune response may be beneficial, in particular in cancer. BCG has been used for a long time as a treatment for melanoma by direct intradermal or subcutaneous administration into metastatic lesions ( Morton et al., 1974 Pfahlberg et al., 2002 On the other hand, the enhanced inflammatory response mediated by innate immune memory might contribute to the disease pathology. Indeed, monocytes from patients suffering from different autoimmune and autoinflammatory diseases show a phenotype resembling innate immune memory that is increased cytokine production, as well as metabolic and epigenetic rewiring ( Arts et al., 2018b Subudhi et al., 2024 Cheng et al., 2014 Post et al., 2023 Li et al., 2020 Xu et al., 2022 In conclusion, the growing mechanistic understanding of TI offers important diagnostic and therapeutic opportunities for a number of chronic inflammatory and oncologic diseases. Summary and conclusion Starting at birth, the integration of genetic programs underlying tissue growth and development and exogenous cues from the emerging microflora shapes skin immunity both at the cellular and functional level. Heterocellular interactions and a dynamic interplay of resident and incoming immune cells tune tissue immune cell composition and activity and modulate the response to subsequent infections, that is local TI. In TI development, cellular metabolites, for example itaconate and fumarate are involved, as are epigenetic modifications. It is an attractive scenario that signals derived from epithelial cells and further long-lived structural cells such as fibroblasts or nerves may lead to an enduring modulation of secondary innate responses. Moreover, the influence of environmental factors beyond those of microbial origin, such as UV light or mechanical insults on TI in the skin, needs to be disentangled. For instance, UV light is a well-recognized modulator of innate immune cells in the skin. UV radiation induces DNA damage, leading to PRR activation and production of type I interferons, antimicrobial peptides, and cytokines ( Tang et al., 2024 Bernard et al., 2019 Becklund et al., 2010 Tang et al., 2024 Finally, TI may even profoundly affect general features of the skin including immune cell adaptation, tissue turnover and repair, and prevention of early tumor growth. It is an intriguing outlook that expanding knowledge in these areas may eventually allow us to harness TI for preventing and treating pathological skin conditions in the future. Funding Information This paper was supported by the following grants: http://dx.doi.org/10.13039/501100001659 Deutsche Forschungsgemeinschaft TRR359 (Project ID 491676693) http://dx.doi.org/10.13039/501100001659 Deutsche Forschungsgemeinschaft TRR167 (Project ID 259373024) http://dx.doi.org/10.13039/501100001659 Deutsche Forschungsgemeinschaft CRC1160 (Project ID 256073931) Additional information Competing interests No competing interests declared. Author contributions Writing – original draft. Writing – original draft. Writing - review and editing. Writing – original draft. References Acker KP Wong Fok Lung T West E Craft J Narechania A Smith H O’Brien K Moustafa AM Lauren C Planet PJ Prince A 2019 Strains of Staphylococcus aureus iScience 19 281 290 10.1016/j.isci.2019.07.037 31401351 PMC6700416 Antonio-Herrera L Badillo-Godinez O Medina-Contreras O Tepale-Segura A García-Lozano A Gutierrez-Xicotencatl L Soldevila G Esquivel-Guadarrama FR Idoyaga J Bonifaz LC 2018 The nontoxic cholera B subunit is a potent adjuvant for intradermal DC-targeted vaccination Frontiers in Immunology 9 2212 10.3389/fimmu.2018.02212 30319653 PMC6171476 Arts RJW Novakovic B Ter Horst R Carvalho A Bekkering S Lachmandas E Rodrigues F Silvestre R Cheng SC Wang SY Habibi E Gonçalves LG Mesquita I Cunha C Laarhoven A Veerdonk FL Williams DL Meer JWM Logie C O’Neill LA Dinarello CA Riksen NP Crevel R Clish C 2016 Notebaart Cell Metabolism 24 807 819 10.1016/j.cmet.2016.10.008 27866838 PMC5742541 Arts RJW Joosten LAB Netea MG 2018a The potential role of trained immunity in autoimmune and autoinflammatory disorders Frontiers in Immunology 9 298 10.3389/fimmu.2018.00298 29515591 PMC5826224 Arts RJW Moorlag S Novakovic B Li Y Wang SY Oosting M Kumar V Xavier RJ Wijmenga C Joosten LAB Reusken C Benn CS Aaby P Koopmans MP Stunnenberg HG van Crevel R Netea MG 2018b BCG vaccination protects against experimental viral infection in humans through the induction of cytokines associated with trained immunity Cell Host & Microbe 23 89 100 10.1016/j.chom.2017.12.010 29324233 Barreiro O Cibrian D Clemente C Alvarez D Moreno V Valiente Í Bernad A Vestweber D Arroyo AG Martín P von Andrian UH Sánchez Madrid F 2016 Pivotal role for skin transendothelial radio-resistant anti-inflammatory macrophages in tissue repair eLife 5 e15251 10.7554/eLife.15251 27304075 PMC4961461 Becklund BR Severson KS Vang SV DeLuca HF 2010 UV radiation suppresses experimental autoimmune encephalomyelitis independent of vitamin D production PNAS 107 6418 6423 10.1073/pnas.1001119107 20308557 PMC2851981 Bekkering S Quintin J Joosten LAB van der Meer JWM Netea MG Riksen NP 2014 Oxidized low-density lipoprotein induces long-term proinflammatory cytokine production and foam cell formation via epigenetic reprogramming of monocytes Arteriosclerosis, Thrombosis, and Vascular Biology 34 1731 1738 10.1161/ATVBAHA.114.303887 24903093 Belkaid Y Tamoutounour S 2016 The influence of skin microorganisms on cutaneous immunity Nature Reviews. Immunology 16 353 366 10.1038/nri.2016.48 27231051 Bernard JJ Gallo RL Krutmann J 2019 Photoimmunology: how ultraviolet radiation affects the immune system Nature Reviews. Immunology 19 688 701 10.1038/s41577-019-0185-9 31213673 Blanpain C Lowry WE Geoghegan A Polak L Fuchs E 2004 Self-renewal, multipotency, and the existence of two cell populations within an epithelial stem cell niche Cell 118 635 648 10.1016/j.cell.2004.08.012 15339667 Carlile SR Cahill SC O’Brien EC Neto NGB Monaghan MG McLoughlin RM 2024 Staphylococcus aureus iScience 27 111284 10.1016/j.isci.2024.111284 39618498 PMC11607596 Chakarov S Lim HY Tan L Lim SY See P Lum J Zhang XM Foo S Nakamizo S Duan K Kong WT Gentek R Balachander A Carbajo D Bleriot C Malleret B Tam JKC Baig S Shabeer M Toh S Schlitzer A Larbi A Marichal T Malissen B Chen J Poidinger M Kabashima K Bajenoff M Ng LG Angeli V Ginhoux F 2019 Two distinct interstitial macrophage populations coexist across tissues in specific subtissular niches Science 363 eaau0964 10.1126/science.aau0964 30872492 Chan LC Chaili S Filler SG Miller LS Solis NV Wang H Johnson CW Lee HK Diaz LF Yeaman MR 2017 Innate immune memory contributes to host defense against recurrent skin and skin structure infections caused by methicillin-resistant Staphylococcus aureus Infection and Immunity 85 e00876-16 10.1128/IAI.00876-16 27849182 PMC5278165 Chan LC Rossetti M Miller LS Filler SG Johnson CW Lee HK Wang H Gjertson D Fowler VG Reed EF Yeaman MR Bayer AS Chan LC Chang YL Filler SG Fowler VG Gjertson D Hoffmann A Medie F Mikkaichi T Mitchell S Reed EF Rossetti M Ruffin F Qin Y Sharma B Sheu K Thaden J Waring AJ Xiong YQ Zhing Y Yeaman MR 2018 Protective immunity in recurrent Staphylococcus aureus PNAS 115 E11111 E11119 10.1073/pnas.1808353115 30297395 PMC6255181 Cheng S-C Quintin J Cramer RA Shepardson KM Saeed S Kumar V Giamarellos-Bourboulis EJ Martens JHA Rao NA Aghajanirefah A Manjeri GR Li Y Ifrim DC Arts RJW van der Veer BMJW Deen PMT Logie C O’Neill LA Willems P van de Veerdonk FL van der Meer JWM Ng A Joosten LAB Wijmenga C Stunnenberg HG Xavier RJ Netea MG 2014 mTOR- and HIF-1α-mediated aerobic glycolysis as metabolic basis for trained immunity Science 345 1250684 10.1126/science.1250684 25258083 PMC4226238 Cho JS Pietras EM Garcia NC Ramos RI Farzam DM Monroe HR Magorien JE Blauvelt A Kolls JK Cheung AL Cheng G Modlin RL Miller LS 2010 IL-17 is essential for host defense against cutaneous Staphylococcus aureus The Journal of Clinical Investigation 120 1762 1773 10.1172/JCI40891 20364087 PMC2860944 Cho JS Guo Y Ramos RI Hebroni F Plaisier SB Xuan C Granick JL Matsushima H Takashima A Iwakura Y Cheung AL Cheng G Lee DJ Simon SI Miller LS 2012 Neutrophil-derived IL-1β is sufficient for abscess formation in immunity against Staphylococcus aureus PLOS Pathogens 8 e1003047 10.1371/journal.ppat.1003047 23209417 PMC3510260 Chu DM Ma J Prince AL Antony KM Seferovic MD Aagaard KM 2017 Maturation of the infant microbiome community structure and function across multiple body sites and in relation to mode of delivery Nature Medicine 23 314 326 10.1038/nm.4272 PMC5345907 28112736 Cirovic B de Bree LCJ Groh L Blok BA Chan J van der Velden W Bremmers MEJ van Crevel R Händler K Picelli S Schulte-Schrepping J Klee K Oosting M Koeken V van Ingen J Li Y Benn CS Schultze JL Joosten LAB Curtis N Netea MG Schlitzer A 2020 BCG vaccination in humans elicits trained immunity via the hematopoietic progenitor compartment Cell Host & Microbe 28 322 334 10.1016/j.chom.2020.05.014 32544459 PMC7295478 Craig-Mueller N Hammad R Elling R Alzubi J Timm B Kolter J Knelangen N Bednarski C Gläser B Ammann S Ivics Z Fischer J Speckmann C Schwarz K Lachmann N Ehl S Moritz T Henneke P Cathomen T 2020 Modeling MyD88 deficiency in vitro Frontiers in Immunology 11 608802 10.3389/fimmu.2020.608802 33424861 PMC7786022 de Lima JF Teixeira FME Ramos YÁL de Carvalho GC Castelo Branco ACC Pereira NV Sotto MN Aoki V Sato MN Orfali RL 2024 Outlining the skin-homing and circulating CLA + Scientific Reports 14 2663 10.1038/s41598-024-53224-8 38302650 PMC10834414 Doebel T Voisin B Nagao K 2017 Langerhans cells - the macrophage in dendritic cell clothing Trends in Immunology 38 817 828 10.1016/j.it.2017.06.008 28720426 Dominguez-Bello MG Costello EK Contreras M Magris M Hidalgo G Fierer N Knight R 2010 Delivery mode shapes the acquisition and structure of the initial microbiota across multiple body habitats in newborns PNAS 107 11971 11975 10.1073/pnas.1002601107 20566857 PMC2900693 Eriksen NH Espersen F Rosdahl VT Jensen K 1995 Carriage of Staphylococcus aureus Epidemiology and Infection 115 51 60 10.1017/s0950268800058118 7641838 PMC2271555 Farmand S Kremer B Häffner M Pütsep K Bergman P Sundin M Ritterbusch H Seidl M Follo M Henneke P Henriques-Normark B 2018 Eosinophilia and reduced STAT3 signaling affect neutrophil cell death in autosomal-dominant Hyper-IgE syndrome European Journal of Immunology 48 1975 1988 10.1002/eji.201847650 30315710 PMC6587726 Feuerstein R Seidl M Prinz M Henneke P 2015 MyD88 in macrophages is critical for abscess resolution in staphylococcal skin infection Journal of Immunology 194 2735 2745 10.4049/jimmunol.1402566 25681348 Feuerstein R Kolter J Henneke P 2017 Dynamic interactions between dermal macrophages and Staphylococcus aureus Journal of Leukocyte Biology 101 99 106 10.1189/jlb.3MR0316-097RR 27733573 Feuerstein R Forde AJ Lohrmann F Kolter J Ramirez NJ Zimmermann J Gomez de Agüero M Henneke P 2020 Resident macrophages acquire innate immune memory in staphylococcal skin infection eLife 9 e55602 10.7554/eLife.55602 32639232 PMC7343389 Forde AJ Kolter J Zwicky P Baasch S Lohrmann F Eckert M Gres V Lagies S Gorka O Rambold AS Buescher JM Kammerer B Lachmann N Prinz M Groß O Pearce EJ Becher B Henneke P 2023 Metabolic rewiring tunes dermal macrophages in staphylococcal skin infection Science Immunology 8 eadg3517 10.1126/sciimmunol.adg3517 37566679 Ginhoux F Bleriot C Lecuit M 2017 Dying for a cause: regulated necrosis of tissue-resident macrophages upon infection Trends in Immunology 38 693 695 10.1016/j.it.2017.05.009 28642066 Goldstein JD Bassoy EY Caruso A Palomo J Rodriguez E Lemeille S Gabay C 2020 IL-36 signaling in keratinocytes controls early IL-23 production in psoriasis-like dermatitis Life Science Alliance 3 e202000688 10.26508/lsa.202000688 32345660 PMC7190273 Gomez Perdiguero E Klapproth K Schulz C Busch K Azzoni E Crozet L Garner H Trouillet C de Bruijn MF Geissmann F Rodewald H-R 2015 Tissue-resident macrophages originate from yolk-sac-derived erythro-myeloid progenitors Nature 518 547 551 10.1038/nature13989 25470051 PMC5997177 Greter M Lelios I Pelczar P Hoeffel G Price J Leboeuf M Kündig TM Frei K Ginhoux F Merad M Becher B 2012 Stroma-derived interleukin-34 controls the development and maintenance of langerhans cells and the maintenance of microglia Immunity 37 1050 1060 10.1016/j.immuni.2012.11.001 23177320 PMC4291117 Guilliams M De Kleer I Henri S Post S Vanhoutte L De Prijck S Deswarte K Malissen B Hammad H Lambrecht BN 2013 Alveolar macrophages develop from fetal monocytes that differentiate into long-lived cells in the first week of life via GM-CSF The Journal of Experimental Medicine 210 1977 1992 10.1084/jem.20131199 24043763 PMC3782041 Heim CE Bosch ME Yamada KJ Aldrich AL Chaudhari SS Klinkebiel D Gries CM Alqarzaee AA Li Y Thomas VC Seto E Karpf AR Kielian T 2020 Lactate production by Staphylococcus aureus Nature Microbiology 5 1271 1284 10.1038/s41564-020-0756-3 32661313 PMC7529909 Ho AW Kupper TS 2019 T cells and the skin: from protective immunity to inflammatory skin disorders Nature Reviews. Immunology 19 490 502 10.1038/s41577-019-0162-3 30992525 Hoeffel G Wang Y Greter M See P Teo P Malleret B Leboeuf M Low D Oller G Almeida F Choy SHY Grisotto M Renia L Conway SJ Stanley ER Chan JKY Ng LG Samokhvalov IM Merad M Ginhoux F 2012 Adult Langerhans cells derive predominantly from embryonic fetal liver monocytes with a minor contribution of yolk sac-derived macrophages The Journal of Experimental Medicine 209 1167 1181 10.1084/jem.20120340 22565823 PMC3371735 Hoft DF Leonardi C Milligan T Nahass GT Kemp B Cook S Tennant J Carey M 1999 Clinical reactogenicity of intradermal bacille Calmette-Guérin vaccination Clinical Infectious Diseases 28 785 790 10.1086/515201 10825039 Hole CR Wager CML Castro-Lopez N Campuzano A Cai H Wozniak KL Wang Y Wormley FL 2019 Induction of memory-like dendritic cell responses in vivo Nature Communications 10 2955 10.1038/s41467-019-10486-5 31273203 PMC6609631 Janeway CA 1989 Approaching the asymptote? Evolution and revolution in immunology Cold Spring Harbor Symposia on Quantitative Biology 54 Pt 1 1 13 10.1101/sqb.1989.054.01.003 2700931 Jeyanathan M Vaseghi-Shanjani M Afkhami S Grondin JA Kang A D’Agostino MR Yao Y Jain S Zganiacz A Kroezen Z Shanmuganathan M Singh R Dvorkin-Gheva A Britz-McKibbin P Khan WI Xing Z 2022 Parenteral BCG vaccine induces lung-resident memory macrophages and trained immunity via the gut-lung axis Nature Immunology 23 1687 1702 10.1038/s41590-022-01354-4 36456739 PMC9747617 Kabashima K Honda T Ginhoux F Egawa G 2019 The immunological anatomy of the skin Nature Reviews. Immunology 19 19 30 10.1038/s41577-018-0084-5 30429578 Kaufmann E Sanz J Dunn JL Khan N Mendonça LE Pacis A Tzelepis F Pernet E Dumaine A Grenier JC Mailhot-Léonard F Ahmed E Belle J Besla R Mazer B King IL Nijnik A Robbins CS Barreiro LB Divangahi M 2018 BCG educates hematopoietic stem cells to generate protective innate immunity against tuberculosis Cell 172 176 190 10.1016/j.cell.2017.12.031 29328912 Khosravi A Yáñez A Price JG Chow A Merad M Goodridge HS Mazmanian SK 2014 Gut microbiota promote hematopoiesis to control bacterial infection Cell Host & Microbe 15 374 381 10.1016/j.chom.2014.02.006 24629343 PMC4144825 Kleinnijenhuis J Quintin J Preijers F Joosten LAB Ifrim DC Saeed S Jacobs C van Loenhout J de Jong D Stunnenberg HG Xavier RJ van der Meer JWM van Crevel R Netea MG 2012 Bacille Calmette-Guerin induces NOD2-dependent nonspecific protection from reinfection via epigenetic reprogramming of monocytes PNAS 109 17537 17542 10.1073/pnas.1202870109 22988082 PMC3491454 Kleinnijenhuis J Quintin J Preijers F Joosten LAB Jacobs C Xavier RJ van der Meer JWM van Crevel R Netea MG 2014 BCG-induced trained immunity in NK cells: Role for non-specific protection to infection Clinical Immunology 155 213 219 10.1016/j.clim.2014.10.005 25451159 PMC5084088 Klicznik MM Szenes-Nagy AB Campbell DJ Gratz IK 2018 Taking the lead - how keratinocytes orchestrate skin T cell immunity Immunology Letters 200 43 51 10.1016/j.imlet.2018.06.009 29969603 PMC7032065 Kluytmans J Wertheim HFL 2005 Nasal carriage of Staphylococcus aureus Infection 33 3 8 10.1007/s15010-005-4012-9 15750752 Kolter J Feuerstein R Zeis P Hagemeyer N Paterson N d’Errico P Baasch S Amann L Masuda T Lösslein A Gharun K Meyer-Luehmann M Waskow C Franzke C-W Grün D Lämmermann T Prinz M Henneke P 2019 A subset of skin macrophages contributes to the surveillance and regeneration of local nerves Immunity 50 1482 1497 10.1016/j.immuni.2019.05.009 31201094 Kolter J Döring CL Sarout S Baasch S Steele L Alsumati R Lucena Silva GV Aníbal Silva CE Paiva IM Mansoori Moghadam Z Gres V Lohrmann F Aktories P Buchegger T Bijnen M Doumard L Voisin B Le Foll C Lachmann N Greter M Kierdorf K Haniffa M Cunha TM Flacher V Henneke P 2025 Sensory neurons shape local macrophage identity via TGF-β signaling Immunity 1 S1074-7613(25)00367-X 10.1016/j.immuni.2025.08.004 40914152 Kopf M Schneider C Nobs SP 2015 The development and function of lung-resident macrophages and dendritic cells Nature Immunology 16 36 44 10.1038/ni.3052 25521683 Leyva-Castillo JM Vega-Mendoza D Strakosha M Deng L Choi S Miyake K Karasuyama H Chiu IM Phipatanakul W Geha RS 2024 Basophils are important for development of allergic skin inflammation The Journal of Allergy and Clinical Immunology 153 1344 1354 10.1016/j.jaci.2024.01.022 38336257 PMC11070311 Li S Kang P Zhang W Jian Z Zhang Q Yi X Guo S Guo W Shi Q Li B He Y Song P Liu L Li K Wang G Gao T Li C 2020 Activated NLR family pyrin domain containing 3 (NLRP3) inflammasome in keratinocytes promotes cutaneous T-cell response in patients with vitiligo The Journal of Allergy and Clinical Immunology 145 632 645 10.1016/j.jaci.2019.10.036 31756352 Lin XQ Liu ZZ Zhou CK Zhang L Gao Y Luo XY Zhang JG Chen W Yang YJ 2024 Trained immunity in recurrent Staphylococcus aureus PLOS Pathogens 20 e1011918 10.1371/journal.ppat.1011918 38241414 PMC10798626 Lohrmann F Sankowski R Schwer S Neuber J Vlachou EP Westermann F Troesch E Kolter J Kathrin Lösslein A Das Mahapatra K Döring CL Ghanem N Kohnert E Heselich A Staszewski O Monaco G Müller A Eyerich K Zeiser R Prinz M Becher B Zaugg J Kreutz C Henneke P 2025 Tissue imprinting defines functional mosaic of dermal macrophages bioRxiv 10.1101/2025.01.09.631670 Luetke-Eversloh M Hammer Q Durek P Nordström K Gasparoni G Pink M Hamann A Walter J Chang HD Dong J Romagnani C 2014 Human cytomegalovirus drives epigenetic imprinting of the IFNG locus in NKG2Chi natural killer cells PLOS Pathogens 10 e1004441 10.1371/journal.ppat.1004441 25329659 PMC4199780 Luna PC 2020 Skin microbiome as years go by American Journal of Clinical Dermatology 21 12 17 10.1007/s40257-020-00549-5 32910437 PMC7584528 Mass E Ballesteros I Farlik M Halbritter F Günther P Crozet L Jacome-Galarza CE Händler K Klughammer J Kobayashi Y Gomez-Perdiguero E Schultze JL Beyer M Bock C Geissmann F 2016 Specification of tissue-resident macrophages during organogenesis Science 353 aaf4238 10.1126/science.aaf4238 27492475 PMC5066309 Merad M Ginhoux F Collin M 2008 Origin, homeostasis and function of Langerhans cells and other langerin-expressing dendritic cells Nature Reviews. Immunology 8 935 947 10.1038/nri2455 19029989 Miller LS Cho JS 2011 Immunity against Staphylococcus aureus Nature Reviews. Immunology 11 505 518 10.1038/nri3010 21720387 PMC5868361 Mitroulis I Ruppova K Wang B Chen LS Grzybek M Grinenko T Eugster A Troullinaki M Palladini A Kourtzelis I Chatzigeorgiou A Schlitzer A Beyer M Joosten LAB Isermann B Lesche M Petzold A Simons K Henry I Dahl A Schultze JL Wielockx B Zamboni N Mirtschink P Coskun Ü Hajishengallis G Netea MG Chavakis T 2018 Modulation of myelopoiesis progenitors is an integral component of trained immunity Cell 172 147 161 10.1016/j.cell.2017.11.034 29328910 PMC5766828 Mizoguchi F Slowikowski K Wei K Marshall JL Rao DA Chang SK Nguyen HN Noss EH Turner JD Earp BE Blazar PE Wright J Simmons BP Donlin LT Kalliolias GD Goodman SM Bykerk VP Ivashkiv LB Lederer JA Hacohen N Nigrovic PA Filer A Buckley CD Raychaudhuri S Brenner MB 2018 Functionally distinct disease-associated fibroblast subsets in rheumatoid arthritis Nature Communications 9 789 10.1038/s41467-018-02892-y 29476097 PMC5824882 Montgomery CP David MZ Daum RS 2015 Host factors that contribute to recurrent staphylococcal skin infection Current Opinion in Infectious Diseases 28 253 258 10.1097/QCO.0000000000000156 25887613 PMC4414914 Moorlag S Rodriguez-Rosales YA Gillard J Fanucchi S Theunissen K Novakovic B de Bont CM Negishi Y Fok ET Kalafati L Verginis P Mourits VP Koeken V de Bree LCJ Pruijn GJM Fenwick C van Crevel R Joosten LAB Joosten I Koenen H Mhlanga MM Diavatopoulos DA Chavakis T Netea MG 2020 BCG vaccination induces long-term functional reprogramming of human neutrophils Cell Reports 33 108387 10.1016/j.celrep.2020.108387 33207187 PMC7672522 Morton DL Eilber FR Holmes EC Hunt JS Ketcham AS Silverstein MJ Sparks FC 1974 BCG immunotherapy of malignant melanoma: summary of a seven-year experience Annals of Surgery 180 635 643 10.1097/00000658-197410000-00029 4412271 PMC1344159 Naik S Bouladoux N Linehan JL Han SJ Harrison OJ Wilhelm C Conlan S Himmelfarb S Byrd AL Deming C Quinones M Brenchley JM Kong HH Tussiwand R Murphy KM Merad M Segre JA Belkaid Y 2015 Commensal-dendritic-cell interaction specifies a unique protective skin immune signature Nature 520 104 108 10.1038/nature14052 25539086 PMC4667810 Naik S Larsen SB Gomez NC Alaverdyan K Sendoel A Yuan S Polak L Kulukian A Chai S Fuchs E 2017 Inflammatory memory sensitizes skin epithelial stem cells to tissue damage Nature 550 475 480 10.1038/nature24271 29045388 PMC5808576 Nakatsuji T Chiang HI Jiang SB Nagarajan H Zengler K Gallo RL 2013 The microbiome extends to subepidermal compartments of normal skin Nature Communications 4 1431 10.1038/ncomms2441 23385576 PMC3655727 Netea MG Quintin J van der Meer JWM 2011 Trained immunity: a memory for innate host defense Cell Host & Microbe 9 355 361 10.1016/j.chom.2011.04.006 21575907 Netea MG Domínguez-Andrés J Barreiro LB Chavakis T Divangahi M Fuchs E Joosten LAB van der Meer JWM Mhlanga MM Mulder WJM Riksen NP Schlitzer A Schultze JL Stabell Benn C Sun JC Xavier RJ Latz E 2020 Defining trained immunity and its role in health and disease Nature Reviews. Immunology 20 375 388 10.1038/s41577-020-0285-6 32132681 PMC7186935 Oh J Conlan S Polley EC Segre JA Kong HH 2012 Shifts in human skin and nares microbiota of healthy children and adults Genome Medicine 4 77 10.1186/gm378 23050952 PMC3580446 Pfaff CM Marquardt Y Fietkau K Baron JM Lüscher B 2017 The psoriasis-associated IL-17A induces and cooperates with IL-36 cytokines to control keratinocyte differentiation and function Scientific Reports 7 15631 10.1038/s41598-017-15892-7 29142248 PMC5688102 Pfahlberg A Kölmel KF Grange JM Mastrangelo G Krone B Botev IN Niin M Seebacher C Lambert D Shafir R Schneider D Kokoschka E-M Kleeberg UR Uter W Gefeller O 2002 Inverse association between melanoma and previous vaccinations against tuberculosis and smallpox: results of the FEBIM study The Journal of Investigative Dermatology 119 570 575 10.1046/j.1523-1747.2002.00643.x 12230497 Picard C von Bernuth H Ghandil P Chrabieh M Levy O Arkwright PD McDonald D Geha RS Takada H Krause JC Creech CB Ku C-L Ehl S Maródi L Al-Muhsen S Al-Hajjar S Al-Ghonaium A Day-Good NK Holland SM Gallin JI Chapel H Speert DP Rodriguez-Gallego C Colino E Garty B-Z Roifman C Hara T Yoshikawa H Nonoyama S Domachowske J Issekutz AC Tang M Smart J Zitnik SE Hoarau C Kumararatne DS Thrasher AJ Davies EG Bethune C Sirvent N de Ricaud D Camcioglu Y Vasconcelos J Guedes M Vitor AB Rodrigo C Almazán F Méndez M Aróstegui JI Alsina L Fortuny C Reichenbach J Verbsky JW Bossuyt X Doffinger R Abel L Puel A Casanova J-L 2010 Clinical features and outcome of patients with IRAK-4 and MyD88 deficiency Medicine 89 403 425 10.1097/MD.0b013e3181fd8ec3 21057262 PMC3103888 Post NF Ginski G Peters R Van Uden NOP Bekkenk MW Wolkerstorfer A Netea MG Luiten RM 2023 Trained immunity in the pathogenesis of vitiligo Pigment Cell & Melanoma Research 36 348 354 10.1111/pcmr.13101 37293969 Quintin J Saeed S Martens JHA Giamarellos-Bourboulis EJ Ifrim DC Logie C Jacobs L Jansen T Kullberg BJ Wijmenga C Joosten LAB Xavier RJ van der Meer JWM Stunnenberg HG Netea MG 2012 Candida albicans infection affords protection against reinfection via functional reprogramming of monocytes Cell Host & Microbe 12 223 232 10.1016/j.chom.2012.06.006 22901542 PMC3864037 Radhouani M Farhat A Hakobyan A Zahalka S Pimenov L Fokina A Hladik A Lakovits K Brösamlen J Dvorak V Nunes N Zech A Idzko M Krausgruber T Köhl J Uluckan O Kovarik J Hoehlig K Vater A Eckhard M Sombke A Fortelny N Menche J Knapp S Starkl P 2025 Eosinophil innate immune memory after bacterial skin infection promotes allergic lung inflammation Science Immunology 10 eadp6231 10.1126/sciimmunol.adp6231 40184438 Riksen NP Netea MG 2021 Immunometabolic control of trained immunity Molecular Aspects of Medicine 77 100897 10.1016/j.mam.2020.100897 32891423 PMC7466946 Sanford JA Zhang LJ Williams MR Gangoiti JA Huang CM Gallo RL 2016 Inhibition of HDAC8 and HDAC9 by microbial short-chain fatty acids breaks immune tolerance of the epidermis to TLR ligands Science Immunology 1 eaah4609 10.1126/sciimmunol.aah4609 28783689 Scharschmidt TC Vasquez KS Truong HA Gearty SV Pauli ML Nosbaum A Gratz IK Otto M Moon JJ Liese J Abbas AK Fischbach MA Rosenblum MD 2015 A wave of regulatory T cells into neonatal skin mediates tolerance to commensal microbes Immunity 43 1011 1021 10.1016/j.immuni.2015.10.016 26588783 PMC4654993 Seré K Baek JH Ober-Blöbaum J Müller-Newen G Tacke F Yokota Y Zenke M Hieronymus T 2012 Two distinct types of Langerhans cells populate the skin during steady state and inflammation Immunity 37 905 916 10.1016/j.immuni.2012.07.019 23159228 Shook B Xiao E Kumamoto Y Iwasaki A Horsley V 2016 CD301b+ macrophages are essential for effective skin wound healing The Journal of Investigative Dermatology 136 1885 1891 10.1016/j.jid.2016.05.107 27287183 PMC5727894 Sobecki M Krzywinska E Nagarajan S Audigé A Huỳnh K Zacharjasz J Debbache J Kerdiles Y Gotthardt D Takeda N Fandrey J Sommer L Sexl V Stockmann C 2021 NK cells in hypoxic skin mediate a trade-off between wound healing and antibacterial defence Nature Communications 12 4700 10.1038/s41467-021-25065-w 34349124 PMC8338923 Subudhi I Konieczny P Prystupa A Castillo RL Sze-Tu E Xing Y Rosenblum D Reznikov I Sidhu I Loomis C Lu CP Anandasabapathy N Suárez-Fariñas M Gudjonsson JE Tsirigos A Scher JU Naik S 2024 Metabolic coordination between skin epithelium and type 17 immunity sustains chronic skin inflammation Immunity 57 1665 1680 10.1016/j.immuni.2024.04.022 38772365 PMC11236527 Sun JC Beilke JN Lanier LL 2009 Adaptive immune features of natural killer cells Nature 457 557 561 10.1038/nature07665 19136945 PMC2674434 Tamoutounour S Guilliams M Montanana Sanchis F Liu H Terhorst D Malosse C Pollet E Ardouin L Luche H Sanchez C Dalod M Malissen B Henri S 2013 Origins and functional specialization of macrophages and of conventional and monocyte-derived dendritic cells in mouse skin Immunity 39 925 938 10.1016/j.immuni.2013.10.004 24184057 Tang X Yang T Yu D Xiong H Zhang S 2024 Current insights and future perspectives of ultraviolet radiation (UV) exposure: Friends and foes to the skin and beyond the skin Environment International 185 108535 10.1016/j.envint.2024.108535 38428192 Tannahill GM Curtis AM Adamik J Palsson-McDermott EM McGettrick AF Goel G Frezza C Bernard NJ Kelly B Foley NH Zheng L Gardet A Tong Z Jany SS Corr SC Haneklaus M Caffrey BE Pierce K Walmsley S Beasley FC Cummins E Nizet V Whyte M Taylor CT Lin H Masters SL Gottlieb E Kelly VP Clish C Auron PE Xavier RJ O’Neill LAJ 2013 Succinate is an inflammatory signal that induces IL-1β through HIF-1α Nature 496 238 242 10.1038/nature11986 23535595 PMC4031686 Tepale-Segura A Gajón JA Muñoz-Cruz S Castro-Escamilla O Bonifaz LC 2024 The cholera toxin B subunit induces trained immunity in dendritic cells and promotes CD8 T cell antitumor immunity Frontiers in Immunology 15 1362289 10.3389/fimmu.2024.1362289 38812523 PMC11133619 Thammavongsa V Kim HK Missiakas D Schneewind O 2015 Staphylococcal manipulation of host immune responses Nature Reviews. Microbiology 13 529 543 10.1038/nrmicro3521 26272408 PMC4625792 Torcellan T Friedrich C Doucet-Ladevèze R Ossner T Solé VV Riedmann S Ugur M Imdahl F Rosshart SP Arnold SJ Gomez de Agüero M Gagliani N Flavell RA Backes S Kastenmüller W Gasteiger G 2024 Circulating NK cells establish tissue residency upon acute infection of skin and mediate accelerated effector responses to secondary infection Immunity 57 124 140 10.1016/j.immuni.2023.11.018 38157853 PMC10783803 van ’t Wout JW Poell R van Furth R 1992 The role of BCG/PPD-activated macrophages in resistance against systemic candidiasis in mice Scandinavian Journal of Immunology 36 713 719 10.1111/j.1365-3083.1992.tb03132.x 1439583 Wang G Sweren E Liu H Wier E Alphonse MP Chen R Islam N Li A Xue Y Chen J Park S Chen Y Lee S Wang Y Wang S Archer NK Andrews W Kane MA Dare E Reddy SK Hu Z Grice EA Miller LS Garza LA 2021 Bacteria induce skin regeneration via IL-1β signaling Cell Host & Microbe 29 777 791 10.1016/j.chom.2021.03.003 33798492 PMC8122070 Wickersham M Wachtel S Wong Fok Lung T Soong G Jacquet R Richardson A Parker D Prince A 2017 Metabolic stress drives keratinocyte defenses against Staphylococcus aureus Cell Reports 18 2742 2751 10.1016/j.celrep.2017.02.055 28297676 PMC6799992 Wong Fok Lung T Monk IR Acker KP Mu A Wang N Riquelme SA Pires S Noguera LP Dach F Gabryszewski SJ Howden BP Prince A 2020 Staphylococcus aureus Nature Microbiology 5 141 153 10.1038/s41564-019-0597-0 31686028 PMC10184863 Woods PS Kimmig LM Sun KA Meliton AY Shamaa OR Tian Y Cetin-Atalay R Sharp WW Hamanaka RB Mutlu GM 2022 HIF-1α induces glycolytic reprograming in tissue-resident alveolar macrophages to promote cell survival during acute lung injury eLife 11 e77457 10.7554/eLife.77457 35822617 PMC9323005 Xu Z Chen D Hu Y Jiang K Huang H Du Y Wu W Wang J Sui J Wang W Zhang L Li S Li C Yang Y Chang J Chen T 2022 Anatomically distinct fibroblast subsets determine skin autoimmune patterns Nature 601 118 124 10.1038/s41586-021-04221-8 34912121 Zahalka S Starkl P Watzenboeck ML Farhat A Radhouani M Deckert F Hladik A Lakovits K Oberndorfer F Lassnig C Strobl B Klavins K Matsushita M Sanin DE Grzes KM Pearce EJ Gorki AD Knapp S 2022 Trained immunity of alveolar macrophages requires metabolic rewiring and type 1 interferon signaling Mucosal Immunology 15 896 907 10.1038/s41385-022-00528-5 35856089 PMC9385480 Zanvit P Konkel JE Jiao X Kasagi S Zhang D Wu R Chia C Ajami NJ Smith DP Petrosino JF Abbatiello B Nakatsukasa H Chen Q Belkaid Y Chen ZJ Chen W 2015 Antibiotics in neonatal life increase murine susceptibility to experimental psoriasis Nature Communications 6 9424 10.1038/ncomms9424 26416167 PMC4598725 ",
  "metadata": {
    "Title of this paper": "Antibiotics in neonatal life increase murine susceptibility to experimental psoriasis",
    "Journal it was published in:": "eLife",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490854/"
  }
}