{
  "title": "Paper_734",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12479418 PMC12479418.1 12479418 12479418 41035635 10.3389/fimmu.2025.1654622 1 Immunology Mini Review The innate immune axis drives aortic dissection pathogenesis through inflammation and presents novel therapeutic targets Xu Can  1  2 Chen Wenping  3 Nie Xinyu  4 Xu Rui  4 Feng Xingyue  4 Chen Zhifen  5  6  * Wang Dongjin  1  2  *  1 Department of Cardiac Surgery, Nanjing Drum Tower Hospital, The Affiliated Hospital of Nanjing University Medical School Nanjing China  2 Institute of Cardiothoracic Vascular Disease, Nanjing University Nanjing China  3 Department of Radiology, Nanjing Drum Tower Hospital, The Affiliated Hospital of Nanjing University Medical School Nanjing China  4 Nanjing University Medical School Nanjing China  5 Department of Cardiology, German Heart Centre Munich, Technical University of Munich Munich Germany  6 Deutsches Zentrum für Herz- und Kreislaufforschung (DZHK), Partner Site Munich Heart Alliance Munich Germany Edited by: Yavuz Nuri Ertas Reviewed by: Zhijia Xia *Correspondence: Zhifen Chen, chenz@dhm.mhn.de nanjingdoctor@foxmail.com 16 9 2025 2025 16 480569 1654622 26 6 2025 01 9 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Xu, Chen, Nie, Xu, Feng, Chen and Wang. 2025 Xu, Chen, Nie, Xu, Feng, Chen and Wang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Acute aortic dissection (AAD) is a life-threatening cardiovascular emergency characterized by aortic layer separation and false lumen formation, with high mortality rates. Emerging evidence highlights the critical role of innate immunity in AD pathogenesis. Innate immune activation drives AAD progression through multiple mechanisms, including macrophage polarization (M1/M2 imbalance), neutrophil extracellular trap (NET) formation, and inflammasome activation. These processes amplify vascular inflammation via cytokine storms (IL-1β, IL-6, TNF-α) and oxidative stress, further promoting matrix metalloproteinase activation and smooth muscle cell phenotypic switching. The cGAS-STING pathway, triggered by mitochondrial DNA release, and TLR signaling act as central hubs connecting vascular injury to innate immune responses. This review synthesizes recent advances in the molecular mechanisms of AAD, focusing on aortic wall structural alterations, dysregulated signaling pathway, including TGF-β, Ang II, STING, and TLR cascades, and immune-inflammatory responses mediated by innate immune components. A deeper understanding of these innate immune components may lead to improved diagnostic biomarkers and targeted therapies for AAD management. acute aortic dissection macrophage polarization neutrophil inflammation extracellular matrix cytokines The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Molecular Innate Immunity 1 Introduction Acute aortic dissection (AAD) is a fatal cardiovascular emergency in which blood penetrates a tear in the intima, creating a false lumen within the medial layer. AAD shows distinct age- and sex-specific epidemiological patterns and carries a very high mortality rate. Population studies indicate that AAD occurs predominantly in men aged 60–70 years ( 1 2 Although the molecular drivers of AAD remain incompletely defined, several mechanisms have been implicated, including endothelial-to-mesenchymal transition (EndMT) ( 3 4 5 6 7 2 Structural alterations of the aortic wall underlie the pathogenesis of AD 2.1 Injury to the intima and media and degradation of the extracellular matrix The aortic wall comprises three layers, including intima, media, and adventitia, composed of vascular cells and extracellular matrix (ECM) components undergoing constant remodeling to maintain biomechanical integrity. Disruption of this balance initiates AAD. The intima, lined by endothelial cells, acts as a barrier and regulator of vascular homeostasis. In AAD, hypertension disrupts endothelial tight junctions, promoting macrophage infiltration and inflammation, leading to intimal rupture ( 8 9 7 10 11 12 13 14 15 2.2 Activation of ECM remodeling pathways Transforming growth factor-beta (TGF-β), encompassing TGF-β1, -β2, and -β3, orchestrates proliferation, differentiation, apoptosis, ECM synthesis, and motility ( 16 17 18 10 19 20 21 ApoE - - 22 23 3 Inflammatory cell infiltration and immune responses 3.1 Inflammatory cell subsets 3.1.1 Macrophages Macrophages, as central phagocytes of the innate immune system, play a central role in the pathogenesis of AAD by mediating inflammation and presenting antigens to initiate adaptive responses ( 6 24 25 6 26 27 3.1.2 Neutrophils Neutrophils initiate acute inflammation by rapidly infiltrating injured sites and orchestrating secondary immune recruitment via cytokine release, thus forming the frontline defense barrier ( 28 4 29 31 32 34 35 36 4 37 5 4 38  Figure 1 Figure 1 Innate immune in aortic dissection pathogenesis. Flowchart illustrating cellular and molecular pathways involved in acute aortic dissection. It shows interactions between Angiotensin II, macrophages, cytokines, and various signaling molecules leading to inflammation, ECM remodeling, and vascular injury. Key components include JAK/STAT, MAPK cascades, and MMP enzymes. Neutrophils, monocytes, and T cells also contribute to processes like endothelial dysfunction and SMC loss, resulting in aortic structural changes. 3.1.3 T lymphocytes T lymphocyte activation plays a critical role in the pathogenesis of AAD. Elevated levels of CD3 + + + + 39 40 41 42 42 45 46 47 48 50 51 54 55 + 56 57 58 3.1.4 Monocytes Monocytes, circulating components of the adaptive immune system, possess phagocytic capacity and activate other immune cells. Based on surface markers, they are classified into three subsets: classical (CD14 ++ − ++ + + + 59 60 61 62 63 64 in vitro 65 3.2 Inflammatory factors 3.2.1 Cytokine and chemokine The interleukin-6 (IL-6) cytokine family includes IL-6, IL-11, IL-30, IL-31, and non-IL molecules, primarily secreted by lymphocytes, monocytes/macrophages, adipocytes, tumor cells, and endothelial cells ( 66 67 68 69 70 71 72 69 73 74 3.2.2 Tumor necrosis factor-α and interferons The tumor necrosis factor (TNF) superfamily includes over 20 members, such as TNF-α, B cell activating factor (BAF), photosensitizer-β (PS-β), TNF-related apoptosis-inducing ligand (TRAIL), and receptor activator of nuclear factor kappa-B ligand (RANKL), all of which potentiate inflammation through NF-κB signaling. Liu et al. ( 75 76 77 78 79 80 81 82 83 3.3 Activation of inflammation-associated signaling pathways The stimulator of interferon genes (STING) pathway, a key component of the cytosolic DNA-sensing cGAS–STING axis, is a critical mediator of pro-inflammatory responses ( 84 85 86 87 88 89 90 91 92 93 94 3.4 Crosstalk among signaling pathways in AAD Multiple signaling pathways, including TGF-β, Ang II, STING, and TLR cascades, intersect to drive the complex pathogenesis of AAD. TRAF6 acts as a central adaptor, linking TGF-β receptor activation to downstream effectors such as TAK1, p38 MAPK, NF-κB, and JNK ( 95 87 96 97 98 99 4 Conclusion Acute aortic dissection is a life-threatening vascular disorder driven by innate immune activation, inflammatory cascades, and structural degradation of the aortic wall. Endothelial injury, smooth muscle cell dysfunction, and extracellular matrix breakdown create a vulnerable microenvironment, while dysregulated TGF-β, Ang II, and TLR-STING pathways amplify inflammation and oxidative stress. Innate immunity plays a pivotal role, where macrophage polarization imbalance, neutrophil NETosis, and monocyte-derived cytokines exacerbate vascular injury. Additionally, cGAS-STING and TLR signaling propagate DNA damage responses and matrix metalloproteinase activation. The crosstalk between these pathways creates a vicious cycle of ECM degradation and smooth muscle cell phenotypic switching. For instance, ROS-induced mitochondrial DNA release fuels STING-dependent inflammation, further aggravating disease progression. Therapeutic strategies targeting innate immunity, such as NET inhibition, IL-6 and IL-1β blockade, or STING antagonists, may complement conventional approaches by mitigating early inflammatory triggers. Future research should prioritize biomarkers of innate immune activation for early diagnosis, as well as immunomodulatory therapies to disrupt pathogenic feedback loops. By integrating mechanistic insights into innate immunity with vascular biology, precision interventions could significantly improve outcomes in this high-mortality condition. Author contributions CX: Writing – original draft. WC: Writing – original draft. XN: Writing – original draft. RX: Writing – original draft. XF: Writing – original draft. ZC: Writing – original draft, Writing – review & editing. DW: Writing – review & editing, Writing – original draft. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Pape LA Awais M Woznicki EM Suzuki T Trimarchi S Evangelista A Presentation, diagnosis, and outcomes of acute aortic dissection: 17-year trends from the international registry of acute aortic dissection J Am Coll Cardiol 2015 66 350–8 10.1016/j.jacc.2015.05.029 26205591 2 Kovoor E Chauhan SK Hajrasouliha A Role of inflammatory cells in pathophysiology and management of diabetic retinopathy Surv Ophthalmol 2022 67 1563–73 10.1016/j.survophthal.2022.07.008 35914582 PMC11082823 3 Lo Presti F Guzzardi DG Bancone C Fedak PWM Della Corte A The science of BAV aortopathy Prog Cardiovasc Dis 2020 63 465–74 10.1016/j.pcad.2020.06.009 32599028 4 Yang S Xiao Y Du Y Chen J Ni Q Guo X Diagnostic and prognostic value of neutrophil extracellular trap levels in patients with acute aortic dissection Front Cardiovasc Med 2021 8 683445 10.3389/fcvm.2021.683445 35242817 PMC8885526 5 Yang M Zhou X Pearce SWA Yang Z Chen Q Niu K Causal role for neutrophil elastase in thoracic aortic dissection in mice Arterioscler Thromb Vasc Biol 2023 43 1900–20 10.1161/ATVBAHA.123.319281 37589142 PMC10521802 6 Wang X Zhang H Cao L He Y Ma A Guo W The role of macrophages in aortic dissection Front Physiol 2020 11 54 10.3389/fphys.2020.00054 32116765 PMC7013038 7 Gawinecka J Schönrath F von Eckardstein A Acute aortic dissection: pathogenesis, risk factors and diagnosis Swiss Med Wkly 2017 147 w14489 10.4414/smw.2017.14489 28871571 8 Cong X Kong W Endothelial tight junctions and their regulatory signaling pathways in vascular homeostasis and disease Cell Signal 2020 66 109485 10.1016/j.cellsig.2019.109485 31770579 9 Michel JB Jondeau G Milewicz DM From genetics to response to injury: vascular smooth muscle cells in aneurysms and dissections of the ascending aorta Cardiovasc Res 2018 114 578–89 10.1093/cvr/cvy006 29360940 PMC6658716 10 Takeda N Hara H Fujiwara T Kanaya T Maemura S Komuro I TGF-β Signaling-related genes and thoracic aortic aneurysms and dissections Int J Mol Sci 2018 19 2125 10.3390/ijms19072125 30037098 PMC6073540 11 Carnevale D Facchinello N Iodice D Bizzotto D Perrotta M De Stefani D Loss of EMILIN-1 enhances arteriolar myogenic tone through TGF-β (Transforming growth factor-β)-dependent transactivation of EGFR (Epidermal growth factor receptor) and is relevant for hypertension in mice and humans Arterioscler Thromb Vasc Biol 2018 38 2484–97 10.1161/ATVBAHA.118.311115 30354220 12 Wang X LeMaire SA Chen L Shen YH Gan Y Bartsch H Increased collagen deposition and elevated expression of connective tissue growth factor in human thoracic aortic dissection Circulation 2006 114 I200–205 10.1161/CIRCULATIONAHA.105.000240 16820572 PMC2637375 13 Cui N Hu M Khalil RA Biochemical and biological attributes of matrix metalloproteinases Prog Mol Biol Transl Sci 2017 147 1 73 10.1016/bs.pmbts.2017.02.005 28413025 PMC5430303 14 Maguire EM Pearce SWA Xiao R Oo AY Xiao Q Matrix metalloproteinase in abdominal aortic aneurysm and aortic dissection Pharm (Basel) 2019 12 118 10.3390/ph12030118 31390798 PMC6789891 15 Cabral-Pacheco GA Garza-Veloz I Castruita-De la Rosa C Ramirez-Acuña JM Perez-Romero BA Guerrero-Rodriguez JF The roles of matrix metalloproteinases and their inhibitors in human diseases Int J Mol Sci 2020 21 9739 10.3390/ijms21249739 33419373 PMC7767220 16 Goumans MJ Ten Dijke P TGF-β Signaling in control of cardiovascular function Cold Spring Harb Perspect Biol 2018 10 a022210 10.1101/cshperspect.a022210 28348036 PMC5793760 17 Hinck AP Mueller TD Springer TA Structural biology and evolution of the TGF-β Family Cold Spring Harb Perspect Biol 2016 8 a022103 10.1101/cshperspect.a022103 27638177 PMC5131774 18 Tzavlaki K Moustakas A TGF-β Signaling Biomolecules 2020 10 487 10.3390/biom10030487 32210029 PMC7175140 19 Chen J Chang R Association of TGF-β Canonical signaling-related core genes with aortic aneurysms and aortic dissections Front Pharmacol 2022 13 888563 10.3389/fphar.2022.888563 35517795 PMC9065418 20 Bekassy Z Lopatko Fagerström I Bader M Karpman D Crosstalk between the renin-angiotensin, complement and kallikrein-kinin systems in inflammation Nat Rev Immunol 2022 22 411–28 10.1038/s41577-021-00634-8 34759348 PMC8579187 21 Habashi JP Doyle JJ Holm TM Aziz H Schoenhoff F Bedja D Angiotensin II type 2 receptor signaling attenuates aortic aneurysm in mice through ERK antagonism Science 2011 332 361–5 10.1126/science.1192152 21493863 PMC3097422 22 Saraff K Babamusta F Cassis LA Daugherty A Aortic dissection precedes formation of aneurysms and atherosclerosis in angiotensin II-infused, apolipoprotein E-deficient mice Arterioscler Thromb Vasc Biol 2003 23 1621–6 10.1161/01.ATV.0000085631.76095.64 12855482 23 Akwii RG Sajib MS Zahra FT Mikelis CM Role of angiopoietin-2 in vascular physiology and pathophysiology Cells 2019 8 471 10.3390/cells8050471 31108880 PMC6562915 24 Li Y Ren P Dawson A Vasquez HG Ageedi W Zhang C Single-cell transcriptome analysis reveals dynamic cell populations and differential gene expression patterns in control and aneurysmal human aortic tissue Circulation 2020 142 1374–88 10.1161/CIRCULATIONAHA.120.046528 33017217 PMC7539140 25 Locati M Curtale G Mantovani A Diversity, mechanisms, and significance of macrophage plasticity Annu Rev Pathol 2020 15 123–47 10.1146/annurev-pathmechdis-012418-012718 31530089 PMC7176483 26 Wynn TA Vannella KM Macrophages in tissue repair, regeneration, and fibrosis Immunity 2016 44 450–62 10.1016/j.immuni.2016.02.015 26982353 PMC4794754 27 Li D Li J Liu H Zhai L Hu W Xia N Pathogenic Tconvs promote inflammatory macrophage polarization through GM-CSF and exacerbate abdominal aortic aneurysm formation FASEB J 2022 36 e22172 10.1096/fj.202101576R 35133017 PMC9303938 28 Silvestre-Roig C Braster Q Ortega-Gomez A Soehnlein O Neutrophils as regulators of cardiovascular inflammation Nat Rev Cardiol 2020 17 327–40 10.1038/s41569-019-0326-7 31996800 29 Peng J Pan F Xu Y Yan Y Gao M Zang H Mesenchymal stem cell transplantation alleviated TBI-induced lung injury by inhibiting PAD4-dependent NET formation J Adv Res 2025 10.1016/j.jare.2025.06.029 40523519 30 Wise AD TenBarge EG Mendonça JDC Mennen EC McDaniel SR Reber CP Mitochondria sense bacterial lactate and drive release of neutrophil extracellular traps Cell Host Microbe 2025 33 341 357.e349 10.1016/j.chom.2025.02.003 40020664 PMC11955204 31 Mansourabadi Z Assarehzadegan MA Mehdipour F Ariafar A Faghih Z Safari E Neutrophil extracellular traps and reactive oxygen species: Predictors of prognosis in bladder cancer Immunol Lett 2025 273 106991 10.1016/j.imlet.2025.106991 39971199 32 Luo Y Fraser L Jezykowski J Gupta NA Miethke AG Taylor SA Interleukin 8-CXCR2-mediated neutrophil extracellular trap formation in biliary atresia associated with neutrophil extracellular trap-induced stellate cell activation Hepatology 2025 82 552–65 10.1097/HEP.0000000000001195 39693274 PMC12174471 33 Hemmling H Hallberg LAE Hägglund P Hawkins CL Histones in neutrophil extracellular traps (NETs) contain oxidative post-translational modifications induced by the myeloperoxidase oxidant hypochlorous acid Redox Biol 2025 84 103696 10.1016/j.redox.2025.103696 40456203 PMC12164213 34 Wei M Wang X Song Y Zhu D Qi D Jiao S Inhibition of peptidyl arginine deiminase 4-dependent neutrophil extracellular trap formation reduces angiotensin II-induced abdominal aortic aneurysm rupture in mice Front Cardiovasc Med 2021 8 676612 10.3389/fcvm.2021.676612 34395553 PMC8360833 35 Sae-Khow K Charoensappakit A Udompornpitak K Saisorn W Issara-Amphorn J Palaga T Syk inhibitor attenuates lupus in FcγRIIb(-)(/-) mice through the Inhibition of DNA extracellular traps from macrophages and neutrophils via p38MAPK-dependent pathway Cell Death Discov 2025 11 63 10.1038/s41420-025-02342-x 39962056 PMC11832894 36 Wang Y Zhang J Wang Y Wu F Song B Li J Ubiquitin-like modifier-activating enzyme 1 as a potential therapeutic target for aortic dissection Int Immunopharmacol 2025 145 113742 10.1016/j.intimp.2024.113742 39637577 37 Ravindran M Khan MA Palaniyar N Neutrophil extracellular trap formation: physiology, pathology, and pharmacology Biomolecules 2019 9 365 10.3390/biom9080365 31416173 PMC6722781 38 Chang TT Liao LY Chen JW Inhibition on CXCL5 reduces aortic matrix metalloproteinase 9 expression and protects against acute aortic dissection Vascul Pharmacol 2021 141 106926 10.1016/j.vph.2021.106926 34653642 39 He R Guo DC Estrera AL Safi HJ Huynh TT Yin Z Characterization of the inflammatory and apoptotic cells in the aortas of patients with ascending thoracic aortic aneurysms and dissections J Thorac Cardiovasc Surg 2006 131 671–8 10.1016/j.jtcvs.2005.09.018 16515922 40 Ye J Wang Y Wang Z Ji Q Huang Y Zeng T Circulating th1, th2, th9, th17, th22, and treg levels in aortic dissection patients Mediators Inflammation 2018 2018 5697149 10.1155/2018/5697149 30258282 PMC6146596 41 Lee GR The balance of th17 versus treg cells in autoimmunity Int J Mol Sci 2018 19 730 10.3390/ijms19030730 29510522 PMC5877591 42 Huang Z Liu Z Wang K Ye Z Xiong Y Zhang B Reduced number and activity of circulating endothelial progenitor cells in acute aortic dissection and its relationship with IL-6 and IL-17 Front Cardiovasc Med 2021 8 628462 10.3389/fcvm.2021.628462 33869300 PMC8044799 43 Negoto S Aoki H Ohshima K Nakamura E Shojima T Takagi K Cell type-specific relationships among immune cells in human aortic dissection tissue Kurume Med J 2024 70 145–55 10.2739/kurumemedj.MS7034007 39218645 44 Huang X Zhang G Feng Y Zhao X Li Y Liu F Developing and verifying an effective diagnostic model linked to immune infiltration in stanford type A aortic dissection Front Biosci (Landmark Ed) 2024 29 318 10.31083/j.fbl2909318 39344316 45 Vessieres E Guihot AL Grimaud L Rivron J Arnal JF Loufrani L Estrogens and the angiotensin II type 2 receptor control flow-mediated outward remodeling in the female mouse mesenteric artery J Vasc Res 2021 58 16 26 10.1159/000511799 33264773 46 Kimura K Motoyama E Kanki S Asano K Sips P Sheikh MAA Novel aortic dissection model links endothelial dysfunction and immune infiltration Circ Res 2025 137 26 42 10.1161/CIRCRESAHA.125.326230 40365676 PMC12175827 47 Li JP He WB Xu SW Liu JZ Huang ZQ Li CP FSTL1 protects against acute aortic dissection by suppressing vascular smooth muscle cell phenotypic switching and degradation of the extracellular matrix J Mol Cell Cardiol 2025 198 60 73 10.1016/j.yjmcc.2024.11.008 39631359 48 Buffa S Borzì D Chiarelli R Crapanzano F Lena AM Nania M Biomarkers for vascular ageing in aorta tissues and blood samples Exp Gerontol 2019 128 110741 10.1016/j.exger.2019.110741 31648011 49 Stammer P Terhorst I Guo J Ibrahim A Oberhuber A Eierhoff T VE-cadherin shedding in vitro Sci Rep 2024 14 26743 10.1038/s41598-024-77940-3 39501015 PMC11538497 50 Song J Peng H Lai M Kang H Chen X Cheng Y Relationship between inflammatory-related cytokines with aortic dissection Int Immunopharmacol 2023 122 110618 10.1016/j.intimp.2023.110618 37480750 51 Jin Y Pan Z Zhou J Wang K Zhu P Wang Y Hedgehog signaling pathway regulates Th17 cell differentiation in asthma via IL-6/STAT3 signaling Int Immunopharmacol 2024 139 112771 10.1016/j.intimp.2024.112771 39074418 52 Marino Y Arangia A Cordaro M Siracusa R D’Amico R Impellizzeri D Analysis of the influence of IL-6 and the activation of the jak/stat3 pathway in fibromyalgia Biomedicines 2023 11 792 10.3390/biomedicines11030792 36979771 PMC10045851 53 Liang Z Tang Z Zhu C Li F Chen S Han X Intestinal CXCR6(+) ILC3s migrate to the kidney and exacerbate renal fibrosis via IL-23 receptor signaling enhanced by PD-1 expression Immunity 2024 57 1306 1323.e1308 10.1016/j.immuni.2024.05.004 38815582 PMC11539045 54 Jie XL Luo ZR Yu J Tong ZR Li QQ Wu JH Pi-Pa-Run-Fei-Tang alleviates lung injury by modulating IL-6/JAK2/STAT3/IL-17 and PI3K/AKT/NF-κB signaling pathway and balancing Th17 and Treg in murine model of OVA-induced asthma J Ethnopharmacol 2023 317 116719 10.1016/j.jep.2023.116719 37268260 55 Ju X Ijaz T Sun H Ray S Lejeune W Lee C Interleukin-6-signal transducer and activator of transcription-3 signaling mediates aortic dissections induced by angiotensin II via the T-helper lymphocyte 17-interleukin 17 axis in C57BL/6 mice Arterioscler Thromb Vasc Biol 2013 33 1612–21 10.1161/ATVBAHA.112.301049 23685554 PMC3818154 56 Kuan R Agrawal DK Thankam FG Treg cells in atherosclerosis Mol Biol Rep 2021 48 4897–910 10.1007/s11033-021-06483-x 34117978 57 Xu S Zhang J Liu J Ye J Xu Y Wang Z The role of interleukin-10 family members in cardiovascular diseases Int Immunopharmacol 2021 94 107475 10.1016/j.intimp.2021.107475 33662690 58 McKenzie C El-Kholy M Parekh F Robson M Lamb K Allen C Novel Fas-TNFR chimeras that prevent Fas ligand-mediated kill and signal synergistically to enhance CAR T cell efficacy Mol Ther Nucleic Acids 2023 32 603–21 10.1016/j.omtn.2023.04.017 37200859 PMC10185706 59 Ruder AV Wetzels SMW Temmerman L Biessen EAL Goossens P Monocyte heterogeneity in cardiovascular disease Cardiovasc Res 2023 119 2033–45 10.1093/cvr/cvad069 37161473 PMC10478755 60 Allen B Bottomly D Köhnke T Wang A Lin HY Johnson K A CEBPB/IL-1β/TNF-α feedback loop drives drug resistance to venetoclax and MDM2 inhibitors in monocytic leukemia Blood 2025 145 2488–506 10.1182/blood.2024028239 40009487 PMC12163741 61 Jia L Wang Y Wang J Lin Y Wang C Chen C Prognostic value of the preoperative lymphocyte-to-monocyte ratio for postoperative adverse events in patients with acute type a aortic dissection J Inflammation Res 2025 18 519–29 10.2147/JIR.S490339 39810977 PMC11731014 62 He W Yu S Li J Li S Chen Z Zhang J From inflammation to remodelling: A novel BASP1(+) monocyte subset as a catalyst for acute aortic dissection J Adv Res 2025 10.1016/j.jare.2025.03.003 40057028 63 Lordan R Tsoupras A Zabetakis I Platelet activation and prothrombotic mediators at the nexus of inflammation and atherosclerosis: Potential role of antiplatelet agents Blood Rev 2021 45 100694 10.1016/j.blre.2020.100694 32340775 64 Haider P Kral-Pointner JB Salzmann M Moik F Bleichert S Schrottmaier WC Interleukin-4 receptor alpha signaling regulates monocyte homeostasis FASEB J 2022 36 e22532 10.1096/fj.202101672RR 36063138 PMC9544925 65 Whately KM Sengottuvel N Edatt L Srivastava S Woods AT Tsai YS Spon1+ inflammatory monocytes promote collagen remodeling and lung cancer metastasis through lipoprotein receptor 8 signaling JCI Insight 2024 9 e168792 10.1172/jci.insight.168792 38716730 PMC11141919 66 Feng Y Ye D Wang Z Pan H Lu X Wang M The role of interleukin-6 family members in cardiovascular diseases Front Cardiovasc Med 2022 9 818890 10.3389/fcvm.2022.818890 35402550 PMC8983865 67 Wen D Zhou XL Li JJ Luo F Zhang L Gao LG Plasma concentrations of interleukin-6, C-reactive protein, tumor necrosis factor-α and matrix metalloproteinase-9 in aortic dissection Clin Chim Acta 2012 413 198 202 10.1016/j.cca.2011.09.029 22001516 68 Sano M Anzai J The molecular mechanisms contributing to the pathophysiology of systemic inflammatory response after acute aortic dissection Nihon Rinsho Meneki Gakkai Kaishi 2016 39 91–5 10.2177/jsci.39.91 27212594 69 Tieu BC Lee C Sun H Lejeune W Recinos A 3rd Ju X An adventitial IL-6/MCP1 amplification loop accelerates macrophage-mediated vascular inflammation leading to aortic dissection in mice J Clin Invest 2009 119 3637–51 10.1172/JCI38308 19920349 PMC2786788 70 Heinrich PC Behrmann I Haan S Hermanns HM Müller-Newen G Schaper F Principles of interleukin (IL)-6-type cytokine signalling and its regulation Biochem J 2003 374 1 20 10.1042/bj20030407 12773095 PMC1223585 71 Patel S Rauf A Khan H Abu-Izneid T Renin-angiotensin-aldosterone (RAAS): The ubiquitous system for homeostasis and pathologies BioMed Pharmacother 2017 94 317–25 10.1016/j.biopha.2017.07.091 28772209 72 Xue C Jiang L Zhang B Sun J Zhu H Lu L Integrative analysis reveals chemokines CCL2 and CXCL5 mediated shear stress-induced aortic dissection formation Heliyon 2024 10 e23312 10.1016/j.heliyon.2023.e23312 38163105 PMC10757018 73 Fan F Zhou Q Pan J Wang Q Cao H Xue Y Preliminary observation of chemokine expression in patients with Stanford type A aortic dissection Cytokine 2020 127 154920 10.1016/j.cyto.2019.154920 31786503 74 Zheng HQ Rong JB Ye FM Xu YC Lu HS Wang JA Induction of thoracic aortic dissection: a mini-review of β-aminopropionitrile-related mouse models J Zhejiang Univ Sci B 2020 21 603–10 10.1631/jzus.B2000022 32748576 PMC7445087 75 Liu X Wang G Zhang T The analysis of the levels of plasma inflammation-related cytokines and endotoxins in patients with acute aortic dissection Clin Hemorheol Microcirc 2020 76 1 7 10.3233/CH-190674 32116237 76 Tang M Fang J TNF−α regulates apoptosis of human vascular smooth muscle cells through gap junctions Mol Med Rep 2017 15 1407–11 10.3892/mmr.2017.6106 28075455 77 Gu J Hu J Zhang HW Xiao ZH Fang Z Qian H Time-dependent changes of plasma inflammatory biomarkers in type A aortic dissection patients without optimal medical management J Cardiothorac Surg 2015 10 3 10.1186/s13019-014-0199-0 25592634 PMC4302155 78 Siebeler R de Winther MPJ Hoeksema MA The regulatory landscape of macrophage interferon signaling in inflammation J Allergy Clin Immunol 2023 152 326–37 10.1016/j.jaci.2023.04.022 37271317 79 Li SF Gong MJ Zhao FR Shao JJ Xie YL Zhang YG Type I interferons: distinct biological activities and current applications for viral infection Cell Physiol Biochem 2018 51 2377–96 10.1159/000495897 30537741 80 Tang D Zhao L Yan F Ren C Xu K Zhao K Expression of VISTA regulated via IFN-γ governs endogenous T-cell function and exhibits correlation with the efficacy of CD19 CAR-T cell treated B-malignant mice J Immunother Cancer 2024 12 e008364 10.1136/jitc-2023-008364 38925679 PMC11202651 81 Yu Z Xu C Song B Zhang S Chen C Li C Tissue fibrosis induced by radiotherapy: current understanding of the molecular mechanisms, diagnosis and therapeutic advances J Transl Med 2023 21 708 10.1186/s12967-023-04554-0 37814303 PMC10563272 82 Botham KM Wheeler-Jones CP Postprandial lipoproteins and the molecular regulation of vascular homeostasis Prog Lipid Res 2013 52 446–64 10.1016/j.plipres.2013.06.001 23774609 83 Wang K Li W Yu Q Guo B Yang B Zhang C High mobility group box 1 mediates interferon-γ-induced phenotypic modulation of vascular smooth muscle cells J Cell Biochem 2017 118 518–29 10.1002/jcb.25682 27579780 84 Huang Z Zhu J Zhou YL Shi J The cGAS-STING pathway: a dual regulator of immune response in cancer and therapeutic implications J Transl Med 2025 23 766 10.1186/s12967-025-06843-2 40640925 PMC12247247 85 Decout A Katz JD Venkatraman S Ablasser A The cGAS-STING pathway as a therapeutic target in inflammatory diseases Nat Rev Immunol 2021 21 548–69 10.1038/s41577-021-00524-z 33833439 PMC8029610 86 Oduro PK Zheng X Wei J Yang Y Wang Y Zhang H The cGAS-STING signaling in cardiovascular and metabolic diseases: Future novel target option for pharmacotherapy Acta Pharm Sin B 2022 12 50 75 10.1016/j.apsb.2021.05.011 35127372 PMC8799861 87 Luo W Wang Y Zhang L Ren P Zhang C Li Y Critical role of cytosolic DNA and its sensing adaptor STING in aortic degeneration, dissection, and rupture Circulation 2020 141 42 66 10.1161/CIRCULATIONAHA.119.041460 31887080 PMC6939474 88 Fitzgerald KA Kagan JC Toll-like receptors and the control of immunity Cell 2020 180 1044–66 10.1016/j.cell.2020.02.041 32164908 PMC9358771 89 Vijay K Toll-like receptors in immunity and inflammatory diseases: Past, present, and future Int Immunopharmacol 2018 59 391 412 10.1016/j.intimp.2018.03.002 29730580 PMC7106078 90 Li T Liu X Ning H Li X Yang J Ma C Association of toll-like receptor 4 gene polymorphisms with acute aortic dissection in a chinese han population BioMed Res Int 2020 2020 8306903 10.1155/2020/8306903 33426065 PMC7783515 91 Fan LM Douglas G Bendall JK McNeill E Crabtree MJ Hale AB Endothelial cell-specific reactive oxygen species production increases susceptibility to aortic dissection Circulation 2014 129 2661–72 10.1161/CIRCULATIONAHA.113.005062 24807872 PMC5357047 92 Bax M Romanov V Junday K Giannoulatou E Martinac B Kovacic JC Arterial dissections: Common features and new perspectives Front Cardiovasc Med 2022 9 1055862 10.3389/fcvm.2022.1055862 36561772 PMC9763901 93 Branchetti E Poggio P Sainger R Shang E Grau JB Jackson BM Oxidative stress modulates vascular smooth muscle cell phenotype via CTGF in thoracic aortic aneurysm Cardiovasc Res 2013 100 316–24 10.1093/cvr/cvt205 23985903 PMC4192047 94 Liu W Zhang W Wang T Wu J Zhong X Gao K Obstructive sleep apnea syndrome promotes the progression of aortic dissection via a ROS- HIF-1α-MMPs associated pathway Int J Biol Sci 2019 15 2774–82 10.7150/ijbs.34888 31853217 PMC6909961 95 Rodari MM Cerf-Bensussan N Parlato M Dysregulation of the immune response in TGF-β signalopathies Front Immunol 2022 13 1066375 10.3389/fimmu.2022.1066375 36569843 PMC9780292 96 Motwani M Pesiridis S Fitzgerald KA DNA sensing by the cGAS-STING pathway in health and disease Nat Rev Genet 2019 20 657–74 10.1038/s41576-019-0151-1 31358977 97 Wang X Majumdar T Kessler P Ozhegov E Zhang Y Chattopadhyay S STING requires the adaptor TRIF to trigger innate immune responses to microbial infection Cell Host Microbe 2017 21 788 10.1016/j.chom.2017.05.007 28618273 98 Yu X Cai B Wang M Tan P Ding X Wu J Cross-regulation of two type I interferon signaling pathways in plasmacytoid dendritic cells controls anti-malaria immunity and host mortality Immunity 2016 45 1093–107 10.1016/j.immuni.2016.10.001 27793594 PMC7128466 99 Xu P Bailey-Bucktrout S Xi Y Xu D Du D Zhang Q Innate antiviral host defense attenuates TGF-β function through IRF3-mediated suppression of Smad signaling Mol Cell 2014 56 723–37 10.1016/j.molcel.2014.11.027 25526531 PMC4273650 ",
  "metadata": {
    "Title of this paper": "Innate antiviral host defense attenuates TGF-β function through IRF3-mediated suppression of Smad signaling",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479418/"
  }
}