{
  "title": "Paper_131",
  "abstract": "pmc Front Cell Neurosci Front Cell Neurosci 639 frontcellneuro Front. Cell. Neurosci. Frontiers in Cellular Neuroscience 1662-5102 Frontiers Media SA PMC12488627 PMC12488627.1 12488627 12488627 10.3389/fncel.2025.1636185 1 Review Spatiotemporal crosstalk among mitochondrial dynamics, NLRP3 inflammasome activation, and histone lactylation drives α Lv Peizhu  1 Writing – original draft Chen Xia  1 Writing – original draft Liu Shiping  1 Writing – original draft Zhang Yu  1 Writing – original draft Bai Yan  2 Writing – review & editing Wang Shun  1  * Writing – review & editing Wang Yulin  1 Writing – review & editing 1 The Second Clinical Medical College, Heilongjiang University of Traditional Chinese Medicine Harbin China 2 Institute of Acupuncture and Moxibustion, Heilongjiang Academy of Traditional Chinese Medicine Harbin China * hljwang@aliyun.com 18 9 2025 2025 19 481747 1636185 27 5 2025 03 9 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Lv, Chen, Liu, Zhang, Bai, Wang and Wang. 2025 Lv, Chen, Liu, Zhang, Bai, Wang and Wang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) This article conducts a systematic search of literature in the fields of neuroscience, cell biology, immunometabolism, etc. from 1990 to 2025, with PubMed/WebofScience as the core database. Experimental and clinical studies covering the core mechanisms of the preprophase of PD (mitochondrial imbalance → NLRP3 activation → lactation modification → α α Parkinson’s disease prodromal phase mitochondrial dynamics NLRP3 inflammasome lactylation modification The author(s) declare that financial support was received for the research and/or publication of this article. This work was supported by the National Natural Science Foundation of China. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Cellular Neuropathology 1 Introduction The prodromal phase of Parkinson’s disease (PD) constitutes a preclinical stage exceeding 20 years (Braak stages I–III), characterized by cell-type-specific pathology (e.g., glutamatergic neurons in the olfactory bulb, cholinergic neurons in the dorsal motor nucleus of the vagus) and temporospatial progression (brainstem-to-cortex spread per Braak staging) ( Braak et al., 2003 Kulkarni et al., 2022 α Braak et al., 2003 Dryanovski et al., 2013 α β Brown et al., 2001 + + α Scheiblich et al., 2021 González-Rodríguez et al., 2021 Despite advances in understanding genetic (e.g., SNCA, LRRK2mutations) and environmental (e.g., MPTP, pesticides) risk factors, motor symptom onset marks irreversible neuronal loss, underscoring the urgency to delineate prodromal mechanisms for early intervention ( González-Rodríguez et al., 2021 α Figure 1 Figure 1 This figure demonstrates the mechanism of mitochondrial dynamic imbalance in the prodromal stage of Parkinson’s disease, including abnormal division/fusion (dysregulation of Drp1 and Mfn1/2), energy metabolism disorders caused by the accumulation of fragmented mitochondria, and the pathological vicious cycle of α -synuclein. This figure was created using the software BioRender. Cycle diagram showing mitochondrial dynamic imbalance. Starts with mitochondrial damage, progresses to neuroinflammation, leading to neuronal death, then alpha-synuclein aggregates, and circles back to mitochondrial damage. Labeled as a vicious cycle. 1.1 Mitochondrial dynamics imbalance and its pathological association with PD The dynamic balance of mitochondrial morphology is maintained by the cooperative action of fusion proteins (Mfn1/2 regulating the outer membrane, OPA1 regulating the inner membrane) and fission proteins (Drp1 and its receptor complexes). Imbalance between the two leads to defects in mitochondrial autophagy and the accumulation of dysfunctional mitochondria ( Chan, 2020 Chen et al., 2023 Quintana-Cabrera and Scorrano, 2023 Chan, 2020 Gao et al., 2017 Subramaniam and Chesselet, 2013 Rani and Mondal, 2020 p Schapira et al., 1990 Ali et al., 1994 Reeve et al., 2018 α Guardia-Laguarta et al., 2014 Jiao et al., 2025 Calì et al., 2012 Devi et al., 2008 α Duvezin-Caubet et al., 2006 Guardia-Laguarta et al., 2014 α Devi et al., 2008 Abnormal accumulation of α-synuclein delays mitochondrial autophagy by upregulating Miro protein levels. Specifically, the clearance rate of damaged mitochondria on the surface of Miro decreases, leading to delayed mitochondrial transport and ultimately resulting in the accumulation of abnormal mitochondria within neurons ( Shaltouki et al., 2018 Lee and Lu, 2014 Verma et al., 2023 Shlevkov et al., 2016 Narendra et al., 2012 Liu et al., 2012 Wang et al., 2011a b 1.2 Upstream events related to mitochondrial dynamics imbalance in PD Studies have shown that Drp1-dependent fission is a key upstream event in the pathology of PD ( Zhang D. et al., 2019 Zhang Q. et al., 2019 Santos et al., 2015 Chuang et al., 2016 Santos et al., 2015 Yang et al., 2021 Wang et al., 2011a b Figure 2 Figure 2 This figure describes the upstream event mechanism of mitochondrial dynamic imbalance, focusing on how DRP1-dependent hyperdivision, defects in the PINK1/Parkin pathway, and LRRK2 mutations induce excessive mitochondrial division, mtDNA leakage, and NLRP3 inflammasome activation, driving the molecular cascade of neuronal damage. This figure was created using the software BioRender. Diagram illustrating the pathway of cellular events triggered by LRRK2 G2019S mutation and PINK1/Parkin deficiency leading to mitochondrial dysfunction. It includes ROS overproduction, calcium dysregulation, mitochondrial DNA leak, NLRP3 inflammasome assembly, and the release of inflammatory cytokines IL-1β and IL-18. This results in inflammatory amplification and formation of α-synuclein aggregates, associated with DJ-1 deficiency and MPP+ exposure. For example, mutations in the Parkin and PINK1 genes lead to early-onset Parkinson’s disease, with mechanisms involving defects in the PINK1/Parkin pathway that cause abnormal mitochondrial quality control. When the E3 ubiquitin ligase activity of Parkin is impaired, the abnormal ubiquitination of Mfn1/2 hinders mitochondrial fission and autophagosome formation, resulting in decreased mitochondrial clearance capacity ( Gegg et al., 2010 Wang et al., 2023 Wang et al., 2023 Mouton-Liger et al., 2018 Mouton-Liger et al., 2018 Wang et al., 2023 Wang et al., 2023 Su and Qi, 2013 Pena et al., 2024 He et al. (2023) Zhu et al. (2013) Wang et al., 2023 Mouton-Liger et al., 2018 Pena et al., 2024 Recent studies indicate that DJ-1 is a key downstream mediator of PINK1/parkin-dependent mitophagy ( Thomas et al., 2011 McCoy and Cookson, 2011 Imberechts and Vandenberghe, 2023 Imberechts et al., 2022 Figure 3 Figure 3 This figure clarifies the pathological interaction mechanism between the mitochondrial-lysosomal interaction disorder and the NLRP3 inflammasome, including lysosomal membrane permeation (CTSB leakage), mtDNA release, and the cascade amplification of inflammatory factors (such as IL-1β), forming a positive feedback loop of α -synuclein diffusion and neuroinflammation. This figure was created using the software BioRender. Pathway diagram illustrating how GBA1 mutation and CTSB deficiency lead to neuronal death. Lysosomal dysfunction causes membrane permeabilization, cathepsin B leak, and alpha-synuclein aggregates. This triggers mitochondrial dysfunction, increased reactive oxygen species, and DNA leakage. These events activate caspase-1 and microglial cells, further aggravating inflammation through IL-1β and IL-18, ultimately causing neuronal death. 1.3 Pathological interaction between mitochondrial dynamic imbalance and NLRP3 inflammasome The NLRP3 inflammasome, as a core regulatory component of innate immunity, is closely related to the neuroinflammatory process and loss of dopaminergic neurons in PD. This complex is composed of the NLRP3 receptor protein, the adaptor protein ASC, and the precursor caspase-1 ( Lamkanfi and Dixit, 2014 Fu and Wu, 2023 Zhang et al., 2023 Swanson et al., 2019 Lee et al., 2019 In PD patients, mitochondrial ROS serve as the initial signal promoting NLRP3 activation ( Mishra et al., 2021 Yan et al., 2023 Lin and Beal, 2006 Yu et al., 2025 Sarkar et al., 2017 Zhou et al., 2011 Shao et al., 2021 Javed et al., 2020 Holley and Schroder, 2020 Casey et al., 2025 Chen et al., 2019 α Jones-Tabah et al., 2024 Moors et al., 2024 The underlying mechanisms of this pathological network are closely related to mitochondrial-lysosomal interaction disorders. GBA1 mutations lead to decreased β Kim et al., 2021 Xie et al., 2025 Peng et al., 2020 α Lee et al., 2023 Chen et al., 2021 It is noteworthy that the characteristic pathological product of PD—fibrillated α Yu et al., 2024 Li G. et al., 2024 Li M. M. et al., 2024 Codolo et al., 2013 Martinon et al., 2002 Halle et al., 2008 α Wang et al., 2019 Daniele et al., 2015 Fan et al., 2020 α Codolo et al., 2013 Gordon et al., 2018 Based on existing research evidence, during the prodromal phase of PD, the interplay between mitochondrial-lysosomal interaction disorders and neuroinflammation creates a unique diagnostic and intervention window. The ROS and mtDNA release caused by mitochondrial autophagy defects can be detected through the following pathways: elevated mtDNA fragments in cerebrospinal fluid, abnormal mitochondrial membrane potential (Δψm), and activation markers of the NLRP3 inflammasome such as caspase-1 cleavage products and IL-1β levels. Lysosomal function assessment should focus on CTSB activity detection, lysosomal membrane stability markers, and GCase activity evaluation (especially for GBA1 mutation carriers). Notably, the oligomer levels of phosphorylated α Intervention strategies should be based on the spatiotemporal characteristics of the pathological network: at the metabolic level, drugs that inhibit reverse electron transfer (RET) of complex I block glycolysis-enhanced mtROS bursts ( Casey et al., 2025 Jimenez-Orgaz et al., 2018 Liang et al., 2023 Prieto Huarcaya et al., 2022 α Tantra et al., 2024 Zhou et al., 2024 Su and Qi, 2013 1.4 The catalytic role of lactylation modification Lactylation modification is a newly discovered epigenetic regulatory mechanism that dynamically regulates protein function through the covalent binding of lactyl groups to lysine residues, becoming a core hub connecting metabolic abnormalities and neurodegenerative diseases (see Figure 4 Figure 4 This figure demonstrates the catalytic mechanism of lactic acid modification, which affects mitochondrial function, autophagy deficiency and NLRP3 inflammatory response through metabolic reprogramming (such as enhanced glycolysis) and epigenetic regulation (histone H3K9la modification), connecting the spatiotemporal dynamics of abnormal energy metabolism and neurodegeneration. This figure was created using the software BioRender. Illustration showing the process of histone lactylation. It begins with the attachment of a lactyllysine (La) to a histone, impacting DNA. This leads to two outcomes: NLRP3 inflammasome activation and mitochondrial RNA leakage, marked by reactive oxygen species (ROS) in mitochondria. Both contribute to mitophagy and neuroinflammation. Arrows indicate the sequence and impact of events. Lactylation is involved in physiological processes such as energy metabolism and inflammatory responses. In non-tumor diseases like atherosclerosis and Alzheimer’s disease, lactylation exacerbates pathological damage by regulating inflammation, fibrosis, and cellular senescence ( Zhao et al., 2025 Zhang D. et al., 2019 Zhang Q. et al., 2019 Brand et al., 2016 Guardia-Laguarta et al., 2014 Ali et al., 1994 Certo et al., 2021 Mao et al., 2024 Mi et al., 2023 Hagihara et al., 2021 Kuang et al., 2025 Sun et al., 2025 Table 1 Table 1 Summary of lactylation biology. Lactation modification site Detection methods Functional mechanisms Results References Mitochondrial complex I proteins Mitochondrial protein IP-MS Lactylation inhibits complex I function, aggravating mitochondrial dysfunction and oxidative stress Parkinson’s disease(PD)  González-Rodríguez et al. (2021) α-tubulin K40 IP-MS, lactylation-specific antibody WB HDAC6-catalyzed lactylation enhances microtubule dynamics; alters axonal stability balance, enhances plasticity; impairs dopaminergic neuronal transport function Neurodegenerative diseases (PD/AD, etc.) Sun et al. (2024) González-Rodríguez et al. (2021) H4K12 CUT&Tag + qChIP; Immunofluorescence staining; Western Blotting Activates the “glycolysis-H4K12la-PKM2” positive feedback loop, exacerbating microglial dysfunction Alzheimer’s disease (AD)  Pan et al. (2022) NLRP3-K245 Lactylation antibody + co-precipitation LDHA promotes cardiomyocyte pyroptosis Myocardial ischemia–reperfusion injury  Fang et al. (2024) Histone H1 Immunohistochemistry (IHC) Increased neuronal excitability drives Kla in the prefrontal cortex, associated with anxiety-like behavior Social defeat stress (anxiety model)  Hagihara et al. (2021) H4K5 ChIP-qPCR Macrophage phenotypic transition disorder, increased release of pro-inflammatory factors (TNF-α, IL-6), aggravates vascular inflammation Atherosclerosis (AS) Yang H. et al. (2022) Yang K. et al. (2022) SLC25A4-K245, SLC25A5-K96 Lactylation antibody + co-precipitation Interfere with the calcium signaling pathway, induce mitochondrial Ca 2+ Cerebral ischemia–reperfusion injury (CIRI)  Yao et al. (2023) HMGB1 ELISA, cellular confocal imaging Disrupts vascular endothelial barrier Sepsis Yang H. et al. (2022) Yang K. et al. (2022) APOC2-K70 Immunoprecipitation-mass spectrometry (IP-MS) Induces tumor metastasis and resistance to immunotherapy Non-small cell lung cancer (NSCLC) Chen B. et al. (2024) Chen J. et al. (2024) H3K18 ChIP-seq、WB Activates POM121/MYC/PD-L1 pathway to promote immune escape  Zhang et al. (2024) β-catenin Immunofluorescence, Co-IP Activates Wnt signaling pathway to promote proliferation Colorectal cancer (CRC)  Miao et al. (2023) NSUN2-K356 Lactylation antibody + MS validation Promotes tumor progression Chen B. et al. (2024) Chen J. et al. (2024) H3K9, H3K56 Histone modification profile analysis Upregulates ESM1 to enhance malignant phenotype Hepatocellular carcinoma (HCC)  Zhao et al. (2024) H3K18 CUT&Tag Anti-H3K18la antibody WB Activate neuroendocrine genes such as Mycn and Ascl1 Neuroendocrine prostate cancer (NEPC)  Wang et al. (2024) XRCC1-K247 Anti-XRCC1 lac-K247 antibody Immunoprecipitation mass spectrometry (IP-MS) Induces therapy resistance Glioblastoma (GBM) Li G. et al. (2024) Li M. M. et al. (2024) In summary, the abnormal accumulation of lactate may exacerbate neuroinflammation through a tripartite attack: By remodeling the promoter regions of glycolysis-related genes through histone lactylation modification, a positive feedback loop is formed involving glycolytic hyperactivity, histone lactylation modification, and transcription of glycolytic genes. Pan et al. (2022) α Inhibition of PINK1/Parkin pathway-mediated mitophagy leads to the accumulation of damaged mitochondria and the release of ROS, mtDNA, and other DAMPs. Some studies have found that lactylation modification regulates Parkin-mediated mitochondrial quality control by targeting mitochondrial metabolic enzyme PCK2, where lactate activates KAT8 to catalyze lactylation modification at the Lys100 site of PCK2, significantly enhancing its kinase activity. Activated PCK2 competitively inhibits the ubiquitination degradation of the rate-limiting enzyme (OXSM) for mitochondrial fatty acid synthesis by Parkin, leading to increased stability of OXSM protein, which drives abnormal enhancement of mitochondrial fatty acid synthesis and oxidative phosphorylation. This metabolic reprogramming process triggers mitochondrial membrane potential depolarization and ROS overload ( Yuan et al., 2025 α Lactylation modification promotes the activation of the NLRP3 inflammasome and the expression of inflammatory factors through epigenetic regulatory mechanisms ( You et al., 2024 Wang et al., 2025 Fang et al., 2024 Ge et al., 2025 α Lactylation is a key link between metabolism and epigenetic regulation. Some studies have found that lactyl-CoA is a donor for lactylation, and its modification is catalyzed by CBP (CREBBP) or p300 (EP300). CBP/p300 acts as the writer enzyme for lactylation modification, catalyzing the lactylation of histone lysines through its acetyltransferase structural domain ( Zhang D. et al., 2019 Zhang Q. et al., 2019 Dai et al., 2022 Dai et al., 2022 α 2 Discussion Mitochondrial dynamic imbalance is a core hub in the pathological process of PD, where network fragmentation, energy metabolism disorders, and calcium homeostasis imbalance together constitute early driving factors for neurodegeneration ( Celardo et al., 2014 Rocha et al., 2018 Mao et al., 2022 Sironi et al., 2020 Shaltouki et al., 2018 α In-depth exploration of upstream events of mitochondrial dynamic imbalance reveals that excessive activation of Drp1-dependent fission is not only a pathological core induced by neurotoxins like MPTP but is also closely related to the collapse of mitochondrial quality control networks caused by gene mutations such as VPS35 and PINK1/Parkin. The lysosomal degradation barrier mediated by mitochondrial-derived vesicles (MDVs) leads to abnormal turnover of Drp1, causing excessive assembly of fission complexes and exacerbating mitochondrial fragmentation; mtDNA leakage caused by defects in the PINK1/Parkin pathway promotes NLRP3 inflammasome assembly through the activation of the cGAS-STING pathway, tightly coupling mitochondrial damage with neuroinflammation. These findings suggest that interventions during the preclinical phase need to balance precise molecular-level regulation with systemic-level network repair: on one hand, in-depth studies on the locking of Drp1 conformations or the regulation of Rab7 activity to restore the spatiotemporal coordination of mitochondrial fission-autophagy; on the other hand, targeting the protection of mtDNA integrity or inhibiting excessive activation of the NLRP3 inflammasome may block the cascade reaction of “mitochondrial damage-inflammation amplification” ( Li et al., 2020 The interaction barrier between mitochondria and lysosomes, along with the pathological interaction of the NLRP3 inflammasome, further expands the intervention dimensions during the preclinical phase of PD. The leakage of CTSB caused by lysosomal membrane permeabilization (LMP) not only directly activates NLRP3 ( Meng et al., 2023 α Bellomo et al., 2020 Bonam et al., 2019 The interaction barrier between mitochondria and lysosomes, along with the pathological interaction of the NLRP3 inflammasome, constitutes a core driving network for the progression of Parkinson’s disease ( Sarkar et al., 2017 Abdelaziz, 2025 The discovery of lactylation modifications injects a triple regulatory perspective of metabolism-epigenetics-inflammation into the pathological mechanism of PD. The accumulation of lactate caused by mitochondrial dysfunction not only inhibits the transcription of autophagy genes through histone lactylation modifications, leading to the collapse of quality control networks, but also enhances the chromatin accessibility of the NLRP3 promoter, amplifying neuroinflammation. Targeting this mechanism, early diagnosis during the preclinical phase of PD can develop molecular imaging technologies based on dynamic lactate metabolism combined with cerebrospinal fluid lactylation modification marker detection, while integrating assessments of mitochondrial autophagic flow and NLRP3 activation indicators to construct a multi-dimensional early warning system. Intervention strategies should focus on the synergistic regulation of metabolism and epigenetics: designing blood–brain barrier penetrating nanocarriers loaded with LDHA inhibitors and KAT8 antagonists to target and block the cascade effects of lactylation modifications ( Cheng et al., 2024 Ren et al., 2024 Zhu et al., 2025 In summary, the pathological network during the preclinical phase of PD exhibits characteristics of multi-level, cross-scale interactions, from mitochondrial fragmentation to epigenetic reprogramming of lactylation modifications, from lysosomal collapse to NLRP3 inflammation storms. Each mechanistic node is not isolated but forms a tightly coupled vicious cycle through energy metabolism imbalance and neuroinflammation diffusion. Early diagnosis needs to break through the limitations of single biomarkers and establish a multi-dimensional assessment system integrating morphological compensation markers, metabolic-epigenetic correlation profiles, and interface interaction dynamics parameters; while intervention strategies should focus on the “fragile nodes” of the pathological network, achieving the remodeling of quality control networks and reversal of inflammatory microenvironments through spatiotemporally specific drugs and gene-metabolism combined regulation within the compensation threshold. Future research needs to validate the synergistic effects of these strategies in PD preclinical animal models and explore the dynamic associations between cerebrospinal fluid exosomal markers and imaging genomics, thereby opening up new paradigms for pre-diagnosis of motor symptoms and disease-modifying therapies. Edited by: Junhui Wang Reviewed by: Marla Tipping Slawomir Jakiela Author contributions PL: Writing – original draft. XC: Writing – original draft. SL: Writing – original draft. YZ: Writing – original draft. YB: Writing – review & editing. SW: Writing – review & editing. YW: Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Abdelaziz A. M. 2025 Alpha-Synuclein drives NURR1 and NLRP3 Inflammasome dysregulation in Parkinson's disease: from pathogenesis to potential therapeutic strategies Int. Immunopharmacol. 156 114692 10.1016/j.intimp.2025.114692 40267723 Ali S. F. David S. N. Newport G. D. Cadet J. L. Slikker W. Jr. 1994 MPTP-induced oxidative stress and neurotoxicity are age-dependent: evidence from measures of reactive oxygen species and striatal dopamine levels Synapse 18 27 34 10.1002/syn.890180105 7825121 Bellomo G. Paciotti S. Gatticchi L. Parnetti L. 2020 The vicious cycle between α-synuclein aggregation and autophagic-lysosomal dysfunction Mov. Disord. 35 34 44 10.1002/mds.27895 31729779 Bonam S. R. Wang F. Muller S. 2019 Lysosomes as a therapeutic target Nat. Rev. Drug Discov. 18 923 948 10.1038/s41573-019-0036-1 31477883 PMC7097195 Braak H. Del Tredici K. Rüb U. de Vos R. A. Jansen Steur E. N. Braak E. 2003 Staging of brain pathology related to sporadic Parkinson's disease Neurobiol. Aging 24 197 211 10.1016/s0197-4580(02)00065-9 12498954 Brand A. Singer K. Koehl G. E. Kolitzus M. Schoenhammer G. Thiel A. 2016 LDHA-associated lactic acid production blunts tumor Immunosurveillance by T and NK cells Cell Metab. 24 657 671 10.1016/j.cmet.2016.08.011 27641098 Brown P. Oliviero A. Mazzone P. Insola A. Tonali P. Di Lazzaro V. 2001 Dopamine dependency of oscillations between subthalamic nucleus and pallidum in Parkinson's disease J. Neurosci. 21 1033 1038 10.1523/JNEUROSCI.21-03-01033.2001 11157088 PMC6762327 Calì T. Ottolini D. Negro A. Brini M. 2012 α-Synuclein controls mitochondrial calcium homeostasis by enhancing endoplasmic reticulum-mitochondria interactions J. Biol. Chem. 287 17914 17929 10.1074/jbc.M111.302794 22453917 PMC3365710 Casey A. M. Ryan D. G. Prag H. A. Chowdhury S. R. Marques E. Turner K. 2025 Pro-inflammatory macrophages produce mitochondria-derived superoxide by reverse electron transport at complex I that regulates IL-1β release during NLRP3 inflammasome activation Nat. Metab. 7 493 507 10.1038/s42255-025-01224-x 39972217 PMC11946910 Celardo I. Martins L. M. Gandhi S. 2014 Unravelling mitochondrial pathways to Parkinson's disease Br. J. Pharmacol. 171 1943 1957 10.1111/bph.12433 24117181 PMC3976614 Certo M. Tsai C. H. Pucino V. Ho P. C. Mauro C. 2021 Lactate modulation of immune responses in inflammatory versus tumour microenvironments Nat. Rev. Immunol. 21 151 161 10.1038/s41577-020-0406-2 32839570 Chan D. C. 2020 Mitochondrial dynamics and its involvement in disease Annu. Rev. Pathol. 15 235 259 10.1146/annurev-pathmechdis-012419-032711 31585519 Chen B. Deng Y. Hong Y. Fan L. Zhai X. Hu H. 2024 Metabolic recoding of NSUN2-mediated m5C modification promotes the progression of colorectal cancer via the NSUN2/YBX1/m5C-ENO1 positive feedback loop Adv. Sci. 11 e2309840 10.1002/advs.202309840 38769664 PMC11267267 Chen C. M. Yen C. Y. Chen W. L. Lin C. H. Wu Y. R. Chang K. H. 2021 Pathomechanism characterization and potential therapeutics identification for Parkinson's disease targeting Neuroinflammation Int. J. Mol. Sci. 22 1062 10.3390/ijms22031062 33494411 PMC7865530 Chen W. Zhao H. Li Y. 2023 Mitochondrial dynamics in health and disease: mechanisms and potential targets Signal Transduct. Target. Ther. 8 333 10.1038/s41392-023-01547-9 37669960 PMC10480456 Chen J. Zhao D. Wang Y. Liu M. Zhang Y. Feng T. 2024 Lactylated apolipoprotein C-II induces immunotherapy resistance by promoting extracellular lipolysis Adv. Sci. 11 e2406333 10.1002/advs.202406333 38981044 PMC11481198 Chen S. Zhou C. Yu H. Tao L. An Y. Zhang X. 2019 27-hydroxycholesterol contributes to lysosomal membrane Permeabilization-mediated Pyroptosis in co-cultured SH-SY5Y cells and C6 cells Front. Mol. Neurosci. 12 14 10.3389/fnmol.2019.00014 30881285 PMC6405519 Cheng H. J. Chen N. F. Chen W. F. Wu Z. S. Sun Y. Y. Teng W. N. 2024 Intrathecal lactate dehydrogenase a inhibitors FX11 and oxamate alleviate chronic constriction injury-induced nociceptive sensitization through neuroinflammation and angiogenesis J. Headache Pain 25 207 10.1186/s10194-024-01916-x 39587478 PMC11590346 Chuang J. I. Pan I. L. Hsieh C. Y. Huang C. Y. Chen P. C. Shin J. W. 2016 Melatonin prevents the dynamin-related protein 1-dependent mitochondrial fission and oxidative insult in the cortical neurons after 1-methyl-4-phenylpyridinium treatment J. Pineal Res. 61 230 240 10.1111/jpi.12343 27159033 Codolo G. Plotegher N. Pozzobon T. Brucale M. Tessari I. Bubacco L. 2013 Triggering of inflammasome by aggregated α-synuclein, an inflammatory response in synucleinopathies PLoS One 8 e55375 10.1371/journal.pone.0055375 23383169 PMC3561263 Dai S. K. Liu P. P. Li X. Jiao L. F. Teng Z. Q. Liu C. M. 2022 Dynamic profiling and functional interpretation of histone lysine crotonylation and lactylation during neural development Development 149 dev200049 10.1242/dev.200049 35735108 Daniele S. G. Béraud D. Davenport C. Cheng K. Yin H. Maguire-Zeiss K. A. 2015 Activation of MyD88-dependent TLR1/2 signaling by misfolded α-synuclein, a protein linked to neurodegenerative disorders Sci. Signal. 8 ra45 10.1126/scisignal.2005965 25969543 PMC4601639 Devi L. Raghavendran V. Prabhu B. M. Avadhani N. G. Anandatheerthavarada H. K. 2008 Mitochondrial import and accumulation of alpha-synuclein impair complex I in human dopaminergic neuronal cultures and Parkinson disease brain J. Biol. Chem. 283 9089 9100 10.1074/jbc.M710012200 18245082 PMC2431021 Dryanovski D. I. Guzman J. N. Xie Z. Galteri D. J. Volpicelli-Daley L. A. Lee V. M. Y. 2013 Calcium entry and α-synuclein inclusions elevate dendritic mitochondrial oxidant stress in dopaminergic neurons J. Neurosci. 33 10154 10164 10.1523/JNEUROSCI.5311-12.2013 23761910 PMC3682382 Duvezin-Caubet S. Jagasia R. Wagener J. Hofmann S. Trifunovic A. Hansson A. 2006 Proteolytic processing of OPA1 links mitochondrial dysfunction to alterations in mitochondrial morphology J. Biol. Chem. 281 37972 37979 10.1074/jbc.M606059200 17003040 Fan Z. Pan Y. T. Zhang Z. Y. Yang H. Yu S. Y. Zheng Y. 2020 Systemic activation of NLRP3 inflammasome and plasma α-synuclein levels are correlated with motor severity and progression in Parkinson's disease J. Neuroinflammation 17 11 10.1186/s12974-019-1670-6 31915018 PMC6950934 Fang L. Yu Z. Qian X. Fang H. Wang Y. 2024 LDHA exacerbates myocardial ischemia-reperfusion injury through inducing NLRP3 lactylation BMC Cardiovasc. Disord. 24 651 10.1186/s12872-024-04251-w 39548367 PMC11568565 Fu J. Wu H. 2023 Structural mechanisms of NLRP3 Inflammasome assembly and activation Annu. Rev. Immunol. 41 301 316 10.1146/annurev-immunol-081022-021207 36750315 PMC10159982 Gao J. Wang L. Liu J. Xie F. Su B. Wang X. 2017 Abnormalities of mitochondrial dynamics in neurodegenerative diseases Antioxidants 6 25 10.3390/antiox6020025 28379197 PMC5488005 Ge S. Qiu B. Liu R. Sun L. Yang L. Chen X. 2025 Ultraviolet-treated riboflavin alleviates atopic dermatitis by inhibiting NLRP3 inflammasome activation and M1 macrophage polarization via histone lactylation Biochem. Pharmacol. 236 116879 10.1016/j.bcp.2025.116879 40118287 Gegg M. E. Cooper J. M. Chau K. Y. Rojo M. Schapira A. H. Taanman J. W. 2010 Mitofusin 1 and mitofusin 2 are ubiquitinated in a PINK1/parkin-dependent manner upon induction of mitophagy [published correction appears in hum Mol genet. 2013 Apr 15; 22(8): 1697] Hum. Mol. Genet. 19 4861 4870 10.1093/hmg/ddq419 20871098 PMC3583518 González-Rodríguez P. Zampese E. Stout K. A. Guzman J. N. Ilijic E. Yang B. 2021 Disruption of mitochondrial complex I induces progressive parkinsonism Nature 599 650 656 10.1038/s41586-021-04059-0 34732887 PMC9189968 Gordon R. Albornoz E. A. Christie D. C. Langley M. R. Kumar V. Mantovani S. 2018 Inflammasome inhibition prevents α-synuclein pathology and dopaminergic neurodegeneration in mice Sci. Transl. Med. 10 eaah 4066 10.1126/scitranslmed.aah4066 30381407 PMC6483075 Guardia-Laguarta C. Area-Gomez E. Rüb C. Liu Y. Magrané J. Becker D. 2014 α-Synuclein is localized to mitochondria-associated ER membranes J. Neurosci. 34 249 259 10.1523/JNEUROSCI.2507-13.2014 24381286 PMC3866487 Hagihara H. Shoji H. Otabi H. Toyoda A. Katoh K. Namihira M. 2021 Protein lactylation induced by neural excitation Cell Rep. 37 109820 10.1016/j.celrep.2021.109820 34644564 Halle A. Hornung V. Petzold G. C. Stewart C. R. Monks B. G. Reinheckel T. 2008 The NALP3 inflammasome is involved in the innate immune response to amyloid-beta Nat. Immunol. 9 857 865 10.1038/ni.1636 18604209 PMC3101478 He K. J. Zhang J. B. Liu J. Y. Zhao F. L. Yao X. Y. Tang Y. T. 2023 LRRK2 G2019S promotes astrocytic inflammation induced by oligomeric α-synuclein through NF-κB pathway iScience 26 108130 10.1016/j.isci.2023.108130 37876795 PMC10590863 Holley C. L. Schroder K. 2020 The rOX-stars of inflammation: links between the inflammasome and mitochondrial meltdown Clin. Transl. Immunol. 9 e01109 10.1002/cti2.1109 32055400 PMC7008497 Imberechts D. Kinnart I. Wauters F. Terbeek J. Manders L. Wierda K. 2022 DJ-1 is an essential downstream mediator in PINK1/parkin-dependent mitophagy Brain 145 4368 4384 10.1093/brain/awac313 36039535 PMC9762950 Imberechts D. Vandenberghe W. 2023 Defects in PINK-PRKN-PARK7/DJ-1-dependent mitophagy and autosomal recessive Parkinson disease Autophagy 19 1872 1873 10.1080/15548627.2022.2139129 36282786 PMC10262757 Javed H. Thangavel R. Selvakumar G. P. Dubova I. Schwartz N. Ahmed M. E. 2020 NLRP3 inflammasome and glia maturation factor coordinately regulate neuroinflammation and neuronal loss in MPTP mouse model of Parkinson's disease Int. Immunopharmacol. 83 106441 10.1016/j.intimp.2020.106441 32259702 PMC7255416 Jiao J. Liu W. Gao G. Yang H. 2025 Serine-129 phosphorylated α-synuclein drives mitochondrial dysfunction and calcium dysregulation in Parkinson's disease model Front. Aging Neurosci. 17 1538166 10.3389/fnagi.2025.1538166 40230488 PMC11994663 Jimenez-Orgaz A. Kvainickas A. Nägele H. Denner J. Eimer S. Dengjel J. 2018 Control of RAB7 activity and localization through the retromer-TBC1D5 complex enables RAB7-dependent mitophagy EMBO J. 37 235 254 10.15252/embj.201797128 29158324 PMC5770787 Jones-Tabah J. He K. Karpilovsky N. Senkevich K. Deyab G. Pietrantonio I. 2024 The Parkinson's disease risk gene cathepsin B promotes fibrillar alpha-synuclein clearance, lysosomal function and glucocerebrosidase activity in dopaminergic neurons [published correction appears in Mol Neurodegener. 2024 18;19(1):94. doi: 10.1186/s13024-024-00791-z] Mol. Neurodegener. 19 88 10.1186/s13024-024-00779-9 39587654 PMC11587650 Kim S. Wong Y. C. Gao F. Krainc D. 2021 Dysregulation of mitochondria-lysosome contacts by GBA1 dysfunction in dopaminergic neuronal models of Parkinson's disease Nat. Commun. 12 1807 10.1038/s41467-021-22113-3 33753743 PMC7985376 Kuang X. Chen S. Ye Q. 2025 The lactate metabolism and protein lactylation in epilepsy Front. Cell. Neurosci. 18 1464169 10.3389/fncel.2024.1464169 39876842 PMC11772370 Kulkarni A. S. Burns M. R. Brundin P. Wesson D. W. 2022 Linking α-synuclein-induced synaptopathy and neural network dysfunction in early Parkinson's disease Brain Commun. 4 fcac165 10.1093/braincomms/fcac165 35822101 PMC9272065 Lamkanfi M. Dixit V. M. 2014 Mechanisms and functions of inflammasomes Cell 157 1013 1022 10.1016/j.cell.2014.04.007 24855941 Lee E. Hwang I. Park S. Hong S. Hwang B. Cho Y. 2019 MPTP-driven NLRP3 inflammasome activation in microglia plays a central role in dopaminergic neurodegeneration Cell Death Differ. 26 213 228 10.1038/s41418-018-0124-5 29786072 PMC6329843 Lee K. S. Lu B. 2014 The myriad roles of Miro in the nervous system: axonal transport of mitochondria and beyond Front. Cell. Neurosci. 8 330 10.3389/fncel.2014.00330 25389385 PMC4211407 Lee J. Y. Park C. S. Seo K. J. Kim I. Y. Han S. Youn I. 2023 IL-6/JAK2/STAT3 axis mediates neuropathic pain by regulating astrocyte and microglia activation after spinal cord injury Exp. Neurol. 370 114576 10.1016/j.expneurol.2023.114576 37863306 Li D. Mastaglia F. L. Fletcher S. Wilton S. D. 2020 Progress in the molecular pathogenesis and nucleic acid therapeutics for Parkinson's disease in the precision medicine era Med. Res. Rev. 40 2650 2681 10.1002/med.21718 32767426 PMC7589267 Li M. M. Shi M. J. Feng C. C. Yu Z. Y. Bai X. F. 2024 LncRNA KCNQ1OT1 promotes NLRP3 inflammasome activation in Parkinson's disease by regulating pri-mi R-186/mature miR-186/NLRP3 axis Biochim. Biophys. Acta Mol. basis Dis. 1870 167454 10.1016/j.bbadis.2024.167454 39122224 Li G. Wang D. Zhai Y. Pan C. Zhang J. Wang C. 2024 Glycometabolic reprogramming-induced XRCC1 lactylation confers therapeutic resistance in ALDH1A3-overexpressing glioblastoma Cell Metab. 36 1696 1710.e10 10.1016/j.cmet.2024.07.011 39111285 Liang W. Sagar S. Ravindran R. Najor R. H. Quiles J. M. Chi L. 2023 Mitochondria are secreted in extracellular vesicles when lysosomal function is impaired Nat. Commun. 14 5031 10.1038/s41467-023-40680-5 37596294 PMC10439183 Lin M. T. Beal M. F. 2006 Mitochondrial dysfunction and oxidative stress in neurodegenerative diseases Nature 443 787 795 10.1038/nature05292 17051205 Liu S. Sawada T. Lee S. Yu W. Silverio G. Alapatt P. 2012 Parkinson's disease-associated kinase PINK1 regulates Miro protein level and axonal transport of mitochondria PLoS Genet. 8 e1002537 10.1371/journal.pgen.1002537 22396657 PMC3291531 Mao H. Chen W. Chen L. Li L. 2022 Potential role of mitochondria-associated endoplasmic reticulum membrane proteins in diseases Biochem. Pharmacol. 199 115011 10.1016/j.bcp.2022.115011 35314166 Mao Y. Zhang J. Zhou Q. He X. Zheng Z. Wei Y. 2024 Hypoxia induces mitochondrial protein lactylation to limit oxidative phosphorylation Cell Res. 34 13 30 10.1038/s41422-023-00864-6 38163844 PMC10770133 Martinon F. Burns K. Tschopp J. 2002 The inflammasome: a molecular platform triggering activation of inflammatory caspases and processing of pro IL-beta Mol. Cell 10 417 426 10.1016/s1097-2765(02)00599-3 12191486 McCoy M. K. Cookson M. R. 2011 DJ-1 regulation of mitochondrial function and autophagy through oxidative stress Autophagy 7 531 532 10.4161/auto.7.5.14684 21317550 PMC3127213 Meng Z. Gao M. Wang C. Guan S. Zhang D. Lu J. 2023 Apigenin alleviated high-fat-diet-induced hepatic Pyroptosis by Mitophagy-ROS-CTSB-NLRP3 pathway in mice and AML12 cells J. Agric. Food Chem. 71 7032 7045 10.1021/acs.jafc.2c07581 37141464 Mi Y. Qi G. Vitali F. Shang Y. Raikes A. C. Wang T. 2023 Loss of fatty acid degradation by astrocytic mitochondria triggers neuroinflammation and neurodegeneration Nat. Metab. 5 445 465 10.1038/s42255-023-00756-4 36959514 PMC10202034 Miao Z. Zhao X. Liu X. 2023 Hypoxia induced β-catenin lactylation promotes the cell proliferation and stemness of colorectal cancer through the wnt signaling pathway Exp. Cell Res. 422 113439 10.1016/j.yexcr.2022.113439 36464122 Mishra S. R. Mahapatra K. K. Behera B. P. Patra S. Bhol C. S. Panigrahi D. P. 2021 Mitochondrial dysfunction as a driver of NLRP3 inflammasome activation and its modulation through mitophagy for potential therapeutics Int. J. Biochem. Cell Biol. 136 106013 10.1016/j.biocel.2021.106013 34022434 Moors T. E. Morella M. L. Bertran-Cobo C. Geut H. Udayar V. Timmermans-Huisman E. 2024 Altered TFEB subcellular localization in nigral neurons of subjects with incidental, sporadic and GBA-related Lewy body diseases Acta Neuropathol. 147 67 10.1007/s00401-024-02707-z 38581586 PMC10998821 Mouton-Liger F. Rosazza T. Sepulveda-Diaz J. Ieang A. Hassoun S. M. Claire E. 2018 Parkin deficiency modulates NLRP3 inflammasome activation by attenuating an A20-dependent negative feedback loop Glia 66 1736 1751 10.1002/glia.23337 29665074 PMC6190839 Narendra D. Walker J. E. Youle R. 2012 Mitochondrial quality control mediated by PINK1 and parkin: links to parkinsonism Cold Spring Harb. Perspect. Biol. 4 a011338 10.1101/cshperspect.a011338 23125018 PMC3536340 Pan R. Y. He L. Zhang J. Liu X. Liao Y. Gao J. 2022 Positive feedback regulation of microglial glucose metabolism by histone H4 lysine 12 lactylation in Alzheimer's disease Cell Metab. 34 634 648.e6 10.1016/j.cmet.2022.02.013 35303422 Pena N. Richbourg T. Gonzalez-Hunt C. P. Qi R. Wren P. Barlow C. 2024 G2019S selective LRRK2 kinase inhibitor abrogates mitochondrial DNA damage NPJ Parkinsons Dis. 10 49 10.1038/s41531-024-00660-y 38429321 PMC10907374 Peng W. Wong Y. C. Krainc D. 2020 Mitochondria-lysosome contacts regulate mitochondrial Ca2+ dynamics via lysosomal TRPML1 Proc. Natl. Acad. Sci. USA 117 19266 19275 10.1073/pnas.2003236117 32703809 PMC7430993 Prieto Huarcaya S. Drobny A. Marques A. R. A. di Spiezio A. Dobert J. P. Balta D. 2022 Recombinant pro-CTSD (cathepsin D) enhances SNCA/α-Synuclein degradation in α-Synucleinopathy models Autophagy 18 1127 1151 10.1080/15548627.2022.2045534 35287553 PMC9196656 Quintana-Cabrera R. Scorrano L. 2023 Determinants and outcomes of mitochondrial dynamics Mol. Cell 83 857 876 10.1016/j.molcel.2023.02.012 36889315 Rani L. Mondal A. C. 2020 Emerging concepts of mitochondrial dysfunction in Parkinson's disease progression: pathogenic and therapeutic implications Mitochondrion 50 25 34 10.1016/j.mito.2019.09.010 31654753 Reeve A. K. Grady J. P. Cosgrave E. M. Bennison E. Chen C. Hepplewhite P. D. 2018 Mitochondrial dysfunction within the synapses of substantia nigra neurons in Parkinson's disease NPJ Parkinsons Dis. 4 9 10.1038/s41531-018-0044-6 29872690 PMC5979968 Ren J. Xiang B. Song L. René D. J. Luo Y. Wen G. 2024 Kaixinsan regulates neuronal mitochondrial homeostasis to improve the cognitive function of Alzheimer's disease by activating CaMKKβ-AMPK-PGC-1α signaling axis Phytomedicine 135 156170 10.1016/j.phymed.2024.156170 39520951 Rocha E. M. De Miranda B. Sanders L. H. 2018 Alpha-synuclein: pathology, mitochondrial dysfunction and neuroinflammation in Parkinson's disease Neurobiol. Dis. 109 249 257 10.1016/j.nbd.2017.04.004 28400134 Santos D. Esteves A. R. Silva D. F. Januário C. Cardoso S. M. 2015 The impact of mitochondrial fusion and fission modulation in sporadic Parkinson's disease Mol. Neurobiol. 52 573 586 10.1007/s12035-014-8893-4 25218511 Sarkar S. Malovic E. Harishchandra D. S. Ghaisas S. Panicker N. Charli A. 2017 Mitochondrial impairment in microglia amplifies NLRP3 inflammasome proinflammatory signaling in cell culture and animal models of Parkinson's disease NPJ Parkinsons Dis. 3 30 10.1038/s41531-017-0032-2 29057315 PMC5645400 Schapira A. H. Cooper J. M. Dexter D. Clark J. B. Jenner P. Marsden C. D. 1990 Mitochondrial complex I deficiency in Parkinson's disease J. Neurochem. 54 823 827 10.1111/j.1471-4159.1990.tb02325.x 2154550 Scheiblich H. Dansokho C. Mercan D. Schmidt S. V. Bousset L. Wischhof L. 2021 Microglia jointly degrade fibrillar alpha-synuclein cargo by distribution through tunneling nanotubes Cell 184 5089 5106.e21 10.1016/j.cell.2021.09.007 34555357 PMC8527836 Shaltouki A. Hsieh C. H. Kim M. J. Wang X. 2018 Alpha-synuclein delays mitophagy and targeting Miro rescues neuron loss in Parkinson's models Acta Neuropathol. 136 607 620 10.1007/s00401-018-1873-4 29923074 PMC6123262 Shao S. Xu C. B. Chen C. J. Shi G. N. Guo Q. L. Zhou Y. 2021 Divanillyl sulfone suppresses NLRP3 inflammasome activation via inducing mitophagy to ameliorate chronic neuropathic pain in mice J. Neuroinflammation 18 142 10.1186/s12974-021-02178-z 34162415 PMC8223331 Shlevkov E. Kramer T. Schapansky J. LaVoie M. J. Schwarz T. L. 2016 Miro phosphorylation sites regulate parkin recruitment and mitochondrial motility Proc. Natl. Acad. Sci. USA 113 E6097 E6106 10.1073/pnas.1612283113 27679849 PMC5068282 Sironi L. Restelli L. M. Tolnay M. Neutzner A. Frank S. 2020 Dysregulated Interorganellar crosstalk of mitochondria in the pathogenesis of Parkinson's disease Cells 9 233 10.3390/cells9010233 31963435 PMC7016713 Su Y. C. Qi X. 2013 Inhibition of excessive mitochondrial fission reduced aberrant autophagy and neuronal damage caused by LRRK2 G2019S mutation Hum. Mol. Genet. 22 4545 4561 10.1093/hmg/ddt301 23813973 Subramaniam S. R. Chesselet M. F. 2013 Mitochondrial dysfunction and oxidative stress in Parkinson's disease Prog. Neurobiol. 106-107 17 32 10.1016/j.pneurobio.2013.04.004 23643800 PMC3742021 Sun S. Xu Z. He L. Shen Y. Yan Y. Lv X. 2024 Metabolic regulation of cytoskeleton functions by HDAC6-catalyzed α-tubulin lactylation Nat. Commun. 15 8377 10.1038/s41467-024-52729-0 39333081 PMC11437170 Sun M. Zhang Y. Mao R. Chen Y. Liu P. Ye L. 2025 MeCP2 Lactylation protects against ischemic brain injury by transcriptionally regulating neuronal apoptosis Adv. Sci. 12 2415309 10.1002/advs.202415309 PMC12140320 40271828 Swanson K. V. Deng M. Ting J. P. 2019 The NLRP3 inflammasome: molecular activation and regulation to therapeutics Nat. Rev. Immunol. 19 477 489 10.1038/s41577-019-0165-0 31036962 PMC7807242 Tantra T. Rahaman T. A. A. Nandini Chaudhary S. 2024 Therapeutic role of NLRP3 inflammasome inhibitors against Alzheimer's disease Bioorg. Chem. 153 107912 10.1016/j.bioorg.2024.107912 39504636 Thomas K. J. McCoy M. K. Blackinton J. Beilina A. van der Brug M. Sandebring A. 2011 DJ-1 acts in parallel to the PINK1/parkin pathway to control mitochondrial function and autophagy Hum. Mol. Genet. 20 40 50 10.1093/hmg/ddq430 20940149 PMC3000675 Verma H. Gangwar P. Yadav A. Yadav B. Rao R. Kaur S. 2023 Understanding the neuronal synapse and challenges associated with the mitochondrial dysfunction in mild cognitive impairment and Alzheimer's disease Mitochondrion 73 19 29 10.1016/j.mito.2023.09.003 37708950 Wang Z. Chan S. W. Zhao H. Miu K. K. Chan W. Y. 2023 Outlook of PINK1/parkin signaling in molecular etiology of Parkinson's disease, with insights into Pink1 knockout models Zool. Res. 44 559 576 10.24272/j.issn.2095-8137.2022.406 37161651 PMC10236303 Wang J. Chen Z. Walston J. D. Gao P. Gao M. Leng S. X. 2019 Interferon-γ potentiates α-Synuclein-induced neurotoxicity linked to toll-like receptors 2 and 3 and tumor necrosis factor-α in murine astrocytes Mol. Neurobiol. 56 7664 7679 10.1007/s12035-019-1567-5 31098954 PMC7404632 Wang D. Du G. Chen X. 2024 Zeb1-controlled metabolic plasticity enables remodeling of chromatin accessibility in the development of neuroendocrine prostate cancer Cell Death Differ. 31 779 791 10.1038/s41418-024-01295-5 38654072 PMC11164927 Wang X. Su B. Liu W. He X. Gao Y. Castellani R. J. 2011a DLP1-dependent mitochondrial fragmentation mediates 1-methyl-4-phenylpyridinium toxicity in neurons: implications for Parkinson's disease Aging Cell 10 807 823 10.1111/j.1474-9726.2011.00721.x 21615675 PMC3173562 Wang X. Winter D. Ashrafi G. Schlehe J. Wong Y. L. Selkoe D. 2011b PINK1 and parkin target Miro for phosphorylation and degradation to arrest mitochondrial motility Cell 147 893 906 10.1016/j.cell.2011.10.018 22078885 PMC3261796 Wang H. Xia H. Bai J. Wang Z. Wang Y. Lin J. 2025 H4K12 lactylation-regulated NLRP3 is involved in cigarette smoke-accelerated Alzheimer-like pathology through mTOR-regulated autophagy and activation of microglia J. Hazard. Mater. 488 137310 10.1016/j.jhazmat.2025.137310 39862777 Xie Y. Sun W. Han A. Zhou X. Zhang S. Shen C. 2025 Novel strategies targeting mitochondria-lysosome contact sites for the treatment of neurological diseases Front. Mol. Neurosci. 17 1527013 10.3389/fnmol.2024.1527013 39877141 PMC11772484 Yan Y. Q. Zheng R. Liu Y. Ruan Y. Lin Z. H. Xue N. J. 2023 Parkin regulates microglial NLRP3 and represses neurodegeneration in Parkinson's disease Aging Cell 22 e13834 10.1111/acel.13834 37029500 PMC10265164 Yang K. Fan M. Wang X. Xu J. Wang Y. Tu F. 2022 Lactate promotes macrophage HMGB1 lactylation, acetylation, and exosomal release in polymicrobial sepsis Cell Death Differ. 29 133 146 10.1038/s41418-021-00841-9 34363018 PMC8738735 Yang H. Sun Y. Li Q. Jin F. Dai Y. 2022 Diverse epigenetic regulations of macrophages in atherosclerosis Front. Cardiovasc. Med. 9 868788 10.3389/fcvm.2022.868788 35425818 PMC9001883 Yang H. Wang L. Zang C. Yang X. Bao X. Shang J. 2021 Squamosamide derivative FLZ diminishes aberrant mitochondrial fission by inhibiting dynamin-related protein 1 Front. Pharmacol. 12 588003 10.3389/fphar.2021.588003 33815098 PMC8017221 Yao Y. Bade R. Li G. Zhang A. Zhao H. Fan L. 2023 Global-scale profiling of differential expressed lysine-Lactylated proteins in the cerebral endothelium of cerebral ischemia-reperfusion injury rats Cell. Mol. Neurobiol. 43 1989 2004 10.1007/s10571-022-01277-6 36030297 PMC11412193 You X. Xie Y. Tan Q. Zhou C. Gu P. Zhang Y. 2024 Glycolytic reprogramming governs crystalline silica-induced pyroptosis and inflammation through promoting lactylation modification Ecotoxicol. Environ. Saf. 283 116952 10.1016/j.ecoenv.2024.116952 39217895 Yu H. Ren K. Jin Y. Zhang L. Liu H. Huang Z. 2025 Mitochondrial DAMPs: key mediators in neuroinflammation and neurodegenerative disease pathogenesis Neuropharmacology 264 110217 10.1016/j.neuropharm.2024.110217 39557152 Yu J. Zhao Z. Li Y. Chen J. Huang N. Luo Y. 2024 Role of NLRP3 in Parkinson's disease: specific activation especially in dopaminergic neurons Heliyon 10 e28838 10.1016/j.heliyon.2024.e28838 38596076 PMC11002585 Yuan J. Yang M. Wu Z. Wu J. Zheng K. Wang J. 2025 The lactate-primed KAT8–PCK2 Axis exacerbates hepatic Ferroptosis during ischemia/reperfusion injury by reprogramming OXSM-dependent mitochondrial fatty acid synthesis Adv. Sci. 12 e2414141 10.1002/advs.202414141 39853940 PMC11923996 Zhang Q. Hu C. Huang J. Liu W. Lai W. Leng F. 2019 ROCK1 induces dopaminergic nerve cell apoptosis via the activation of Drp 1-mediated aberrant mitochondrial fission in Parkinson's disease Exp. Mol. Med. 51 1 13 10.1038/s12276-019-0318-z 31578315 PMC6802738 Zhang W. J. Li K. Y. Lan Y. Zeng H. Y. Chen S. Q. Wang H. 2023 NLRP3 Inflammasome: a key contributor to the inflammation formation Food Chem. Toxicol. 174 113683 10.1016/j.fct.2023.113683 36809826 Zhang D. Tang Z. Huang H. Zhou G. Cui C. Weng Y. 2019 Metabolic regulation of gene expression by histone lactylation Nature 574 575 580 10.1038/s41586-019-1678-1 31645732 PMC6818755 Zhang C. Zhou L. Zhang M. du Y. Li C. Ren H. 2024 H3K18 Lactylation potentiates immune escape of non-small cell lung cancer Cancer Res. 84 3589 3601 10.1158/0008-5472.CAN-23-3513 39137401 Zhao L. Qi H. Lv H. Liu W. Zhang R. Yang A. 2025 Lactylation in health and disease: physiological or pathological? Theranostics 15 1787 1821 Published 2025 Jan 2 10.7150/thno.105353 39897556 PMC11780532 Zhao P. Qiao C. Wang J. Zhou Y. Zhang C. 2024 Histone lactylation facilitates hepatocellular carcinoma progression by upregulating endothelial cell-specific molecule 1 expression Mol. Carcinog. 63 2078 2089 10.1002/mc.23794 39016629 Zhou Y. Cai Z. Zhai Y. Yu J. He Q. He Y. 2024 Necroptosis inhibitors: mechanisms of action and therapeutic potential Apoptosis 29 22 44 10.1007/s10495-023-01905-6 38001341 Zhou R. Yazdi A. S. Menu P. Tschopp J. 2011 A role for mitochondria in NLRP3 inflammasome activation [published correction appears in nature. 2011 7; 475 (7354): 122] Nature 469 221 225 10.1038/nature09663 21124315 Zhu R. X. Han R. X. Chen Y. H. Huang L. Liu T. Jiang J. 2025 Inactivation of NLRP3 inflammasome by dephosphorylation at serine 658 alleviates glial inflammation in the mouse model of Parkinson's disease Mol. Neurodegener. 20 27 10.1186/s13024-025-00818-z 40038816 PMC11881452 Zhu Y. Wang C. Yu M. Cui J. Liu L. Xu Z. 2013 ULK1 and JNK are involved in mitophagy incurred by LRRK2 G2019S expression Protein Cell 4 711 721 10.1007/s13238-013-3910-3 27023913 PMC4875534 ",
  "metadata": {
    "Title of this paper": "ULK1 and JNK are involved in mitophagy incurred by LRRK2 G2019S expression",
    "Journal it was published in:": "Frontiers in Cellular Neuroscience",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488627/"
  }
}