{
  "title": "Paper_411",
  "abstract": "medRxiv 3854 medrxiv MEDRXIV medRxiv Cold Spring Harbor Laboratory Preprints PMC12486029 PMC12486029.1 12486029 12486029 41040699 10.1101/2025.09.26.25336642 1 preprint 1 Article Privacy-Enhancing Sequential Learning under Heterogeneous Selection Bias in Multi-Site EHR Data Kundu Ritoban http://orcid.org/0000-0003-0967-6755 Shi Xu http://orcid.org/0000-0001-8566-9552 Patel Kumar Kshitij Ohno-Machado Lucila http://orcid.org/0000-0002-8005-7327 Salvatore Maxwell http://orcid.org/0000-0002-3659-1514 Song Peter X.K. Mukherjee Bhramar 28 9 2025 498070 2025.09.26.25336642 01 10 2025 02 10 2025 03 10 2025 http://medrxiv.org/lookup/doi/10.1101/2025.09.26.25336642 nihpp-2025.09.26.25336642.pdf Abstract Objective To develop privacy-enhancing statistical methods for estimation of binary disease risk model association parameters across multiple electronic health record (EHR) sites with heterogeneous selection mechanisms, without sharing raw individual-level data. We illustrate their utility through a cross-biobank analysis of smoking and 97 cancer subtypes using data from the NIH All of Us (AOU) and the Michigan Genomics Initiative (MGI). Materials and Methods Large-scale biobanks often follow heterogeneous recruitment strategies and store data in separate cloud-based platforms, making centralized algorithms infeasible. To address this, we propose two decentralized sequential estimators namely, Sequential Pseudo-likelihood (SPL) and Sequential Augmented Inverse Probability Weighting (SAIPW) that leverage external population-level information to adjust for selection bias, with valid variance estimation. SAIPW additionally protects against misspecification of the selection model using flexible machine learning based auxiliary outcome models. We compare SPL and SAIPW with the existing Sequential Unweighted (SUW) estimator and with centralized and meta learning extensions of IPW and AIPW in simulations under both correctly specified and misspecified selection mechanisms. We apply the methods to harmonized data from MGI ( n n Results In simulations, SUW exhibited substantial bias and poor coverage. SPL and SAIPW yielded unbiased estimates with valid coverage probabilities under correct model specification, with SAIPW remaining robust under selection model misspecification. Both approaches showed no notable efficiency loss relative to centralized methods. Meta-learning methods were efficient for large sites but failed in settings with small cohort sizes and rare outcome prevalence. In real-data analysis, strong associations were consistently identified between smoking and cancers of the lung, bladder, and larynx, aligning with established epidemiological evidence. Conclusion Our framework enables valid, privacy-enhancing inference across EHR cohorts with heterogeneous selection, supporting scalable, decentralized research using real-world data. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version yes pmc-prop-is-scanned-article no pmc-prop-preprint yes pmc-prop-in-epmc no ",
  "metadata": {
    "Title of this paper": "\nPrivacy-Enhancing Sequential Learning under Heterogeneous Selection Bias in Multi-Site EHR Data\n",
    "Journal it was published in:": "medRxiv",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486029/"
  }
}