{
  "title": "Paper_441",
  "abstract": "pmc Clin Cancer Res Clin Cancer Res 4147 aacrsd Clinical Cancer Research 1078-0432 1557-3265 pmc-is-collection-domain yes pmc-collection-title AACR Open Access PMC12485373 PMC12485373.1 12485373 12485373 40711480 10.1158/1078-0432.CCR-25-0992 CCR-25-0992 1 Version of Record Breast Cancer Clinical Trial Results Phase I clinical trials Drug Targets Protein Kinase & Phosphatase Drug Targets Clinical Trials: Targeted Therapy Gedatolisib Combined with Palbociclib and Letrozole in Patients with No Prior Systemic Therapy for Hormone Receptor–Positive, HER2-Negative Advanced Breast Cancer Gedatolisib for HR-Positive, HER2-Negative Breast Cancer https://orcid.org/0000-0003-0606-0648 Wesolowski Robert 1 * https://orcid.org/0000-0001-6710-4814 Rugo Hope S. 2 https://orcid.org/0000-0003-1484-2113 Specht Jennifer M. 3 https://orcid.org/0000-0002-0072-0257 Han Hyo S. 4 https://orcid.org/0000-0003-1500-471X Kabos Peter 5 https://orcid.org/0000-0001-5800-4571 Vaishampayan Ulka 6 https://orcid.org/0000-0002-4127-4708 Wander Seth A. 7 https://orcid.org/0000-0002-9822-797X Gogineni Keerthi 8 https://orcid.org/0000-0003-1303-0447 Spira Alexander 9 https://orcid.org/0000-0001-9951-7269 Schott Anne F. 10 https://orcid.org/0000-0003-4888-7547 Abu-Khalaf Maysa 11 https://orcid.org/0000-0002-9744-8439 Mutka Sarah C. 12 https://orcid.org/0009-0003-1234-5532 Suzuki Samuel 12 https://orcid.org/0009-0005-6644-7459 Sullivan Brian 12 https://orcid.org/0009-0008-1980-6705 Gorbatchevsky Igor 12 https://orcid.org/0000-0002-8663-0331 Layman Rachel M. 13  1  2  3  4  5  6  7  8  9  10  11  12  13 * Corresponding Author: Robert.Wesolowski@osumc.edu Clin Cancer Res 2025;31:4040–8 At time of study conduct. 01 10 2025 25 7 2025 31 19 498054 4040 4048 25 3 2025 28 5 2025 23 7 2025 01 10 2025 02 10 2025 03 10 2025 ©2025 The Authors; Published by the American Association for Cancer Research 2025 American Association for Cancer Research https://creativecommons.org/licenses/by/4.0/ This open access article is distributed under the Creative Commons Attribution 4.0 International (CC BY 4.0) license. Abstract Purpose: Nonclinical evidence demonstrating that estrogen receptor, cyclin-dependent kinases 4 and 6 (CDK4/6), and PI3K/AKT/mTOR (PAM) pathways cross-promote tumor proliferation in hormone receptor–positive (HR+)/HER2− breast cancer cell lines led to the development of CDK4/6 inhibitors and agents inhibiting single PAM pathway nodes to treat HR+/HER2− advanced breast cancer. Simultaneous blockade of the estrogen receptor, CDK4/6, and PAM pathways may optimize antitumor control in the treatment-naïve advanced breast cancer setting. Gedatolisib, a pan-PI3K/mTOR inhibitor, was evaluated as first-line therapy, combined with standard-of-care palbociclib and letrozole, for patients with HR+/HER2− advanced breast cancer. Patients and Methods: Treatment-naïve patients from a phase Ib study with HR+/HER2− advanced breast cancer treated with gedatolisib plus palbociclib and letrozole were analyzed. The primary endpoint of the overall study was investigator-assessed objective response. Secondary endpoints included safety, duration of response, progression-free survival (PFS), and overall survival. Results: Of 41 patients, all had stage IV disease, 93% had measurable disease, 78% had visceral metastases, and 22% had detectable PIK3CA N PIK3CA Conclusions: Gedatolisib plus palbociclib and letrozole demonstrated preliminary efficacy in patients with no prior systemic therapy for advanced breast cancer. These results warrant further evaluation of gedatolisib added to standard-of-care, first-line therapy for HR+/HER2− advanced breast cancer. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Translational Relevance Gedatolisib, a pan-PI3K/mTOR inhibitor, combined with a cyclin-dependent kinases 4 and 6 inhibitor (palbociclib) and endocrine therapy (letrozole, an aromatase inhibitor), was well tolerated and elicited a 79% objective response rate in first-line patients with hormone receptor–positive, HER2− advanced breast cancer. The median progression-free survival was 48.4 months, and the median overall survival was 77.3 months in first-line patients receiving gedatolisib, palbociclib, and letrozole triplet therapy. Unlike currently available inhibitors of the PI3K/AKT/mTOR pathway, gedatolisib-based triplet therapy achieved comparable clinical responses in patients with and without PIK3CA Introduction Breast cancer is the most common tumor type diagnosed in women in the United States and is the leading cause of cancer death in women globally (Supplementary Table S1; ref. 1 2 1 3 Current National Comprehensive Cancer Network (NCCN), American Society of Clinical Oncology (ASCO), and European Society for Medical Oncology (ESMO) guidelines recommend ET combined with cyclin-dependent kinases 4 and 6 (CDK4/6) inhibitors as standard-of-care first-line treatment for patients with HR+, HER2− locally advanced (inoperable) or metastatic breast cancer ( 4 1 5 6 7 8 9 10 Gedatolisib is a potent kinase inhibitor that targets all four class I PI3K isoforms and the mTOR complexes mTORC1 and mTORC2. Due to cross-talk between the various PAM nodes, the targeting of multiple PAM nodes by gedatolisib may prevent the development of resistance and thus induce a more comprehensive blockade of the PAM pathway than therapies that only target a single PAM node. A multicenter, open-label, phase Ib study in adult women with HR+, HER2− advanced breast cancer was conducted to evaluate gedatolisib combined with palbociclib and ET in the first-line and later-line settings ( 11 PIK3CA 11 In this study, we report the efficacy and safety results in a subgroup analysis from the phase Ib study of patients with HR+, HER2− advanced breast cancer who received gedatolisib, palbociclib, and letrozole as their first-line treatment for advanced disease. The current analysis combines patients who participated in either the dose escalation or dose expansion portions of the trial and provides updated data based on a May 29, 2023, cutoff. Patients and Methods Study design This multicenter, open-label, phase Ib trial included two dose escalation and four dose expansion arms in which patients with HR+, HER2− advanced breast cancer were enrolled. No randomization occurred. The original results from the dose expansion arms were previously reported ( 11 post hoc The study was performed in accordance with the Declaration of Helsinki and in compliance with good clinical practice guidelines and applicable laws. The protocol was approved by the institutional review boards at the study sites. Written informed consent before study entry was obtained from each patient or from the patient’s legally authorized representative if the patient was unable to provide consent. Patients The subgroup analyzed consisted of adult (age at least 18 years) female patients with HR+, HER2−, metastatic breast cancer who were eligible to receive a CDK4/6 inhibitor and letrozole, had received no prior systemic therapy in the metastatic setting, and were enrolled in either the dose escalation or dose expansion portion of the study. As eligibility for palbociclib and letrozole therapy required patients to have completed their course of adjuvant ET, if applicable, more than 12 months from the diagnosis of advanced breast cancer, the patients enrolled would generally be considered endocrine-sensitive. Patients were required to have an Eastern Cooperative Oncology Group performance status of 0 to 1 and adequate hepatic, renal, and bone marrow function. Patients were ineligible if they received prior treatment with an mTOR or PI3K inhibitor, had prior hematopoietic stem cell or bone marrow transplantation, or had active, uncontrolled, or symptomatic central nervous system metastases. The protocol mandated that LHRH, GnRH, or equivalent agents to suppress ovarian function be administered to premenopausal or perimenopausal women. Furthermore, patients were required to have adequate glucose control for inclusion, as defined by hemoglobin A 1c  PIK3CA  PIK3CA PIK3CA 12 13 PIK3CA Efficacy assessments Objective response status [complete response (CR), partial response (PR), stable disease (SD), progressive disease (PD)] was assessed by the investigator and confirmed by a subsequent radiological scan ≥4 weeks later per Response Evaluation Criteria in Solid Tumors (RECIST) guideline version 1.1. While on study, tumor assessments (CT or MRI) were initially performed every 8 weeks starting from the first day of study drug for at least 18 months or until PD. Twelve months after study enrollment was completed, the protocol was amended to allow tumor assessment to occur every 12 to 16 weeks. Best objective response was defined as the best response across all time points after all tumor assessments were complete for each patient. The ORR, defined as the proportion of patients who achieved a radiologically confirmed PR or CR, was assessed using RECIST version 1.1. The response evaluable population in this ad hoc Secondary efficacy analyses included progression-free survival (PFS) and duration of response (DOR). PFS was determined by the time from the date of the first dose of study drug to the date of the first radiologic documentation of postbaseline disease progression or death due to any cause. DOR was determined from the time of the first documentation of CR or PR to the date of the first documentation of PD or death, whichever occurred first. PFS and DOR were determined using the full analysis set. OS analysis was performed post hoc Safety assessments All patients were monitored for adverse events (AE) with a treatment-emergent AE (TEAE), defined as an AE occurring from the time of the first dose of study therapy until at least 28 days after the last dose of the study drug. All AEs were coded using MedDRA and graded for severity via the Common Terminology Criteria for Adverse Events version 4.03. Safety laboratory assessments, vital signs, 12-lead electrocardiograms, and Eastern Cooperative Oncology Group performance status were summarized by visit. Statistical analysis All statistical tests were summarized descriptively. Time-to-event data were summarized using Kaplan–Meier methods, and confidence intervals (CI) for median time to event were estimated using the Brookmeyer–Crowley method. Statistical analyses were done with SAS software (version 9.4; RRID:SCR_008567). Data availability The data are available from the corresponding author upon reasonable request. Results Patients A total of 41 patients with no prior systemic therapy for advanced breast cancer from the dose escalation cohort ( N N N = N = N N = N = N = N = N = Demographics and baseline characteristics are described in Table 1 PIK3CA Table 1 Table 1. Patient demographic and baseline disease characteristics in the full analysis population with no prior systemic therapy for advanced breast cancer. ​ No prior systemic therapy ( N Age ​ Median years (range) 54 (28–78) Race, n ​ Black or African American 5 (12%) White 35 (85%) Other 1 (2%) TNM current stage, n ​ Stage IV 41 (100%) Number of prior systemic therapies for advanced disease, n ​ 0 41 (100%) Prior neoadjuvant chemotherapy, n 6 (15%) Prior adjuvant chemotherapy, n 11 (27%) Prior adjuvant ET, n 18 (44%) Measurable baseline disease, n ​ Yes 38 (93%) No 3 (7%) ECOG performance status, n ​ 0 28 (68%) 1 13 (32%) Visceral metastasis, n ​ Yes 32 (78%) No 9 (22%) Metastatic site involved, n ​ Bone 26 (63%) Bone only 1 (2%) Brain 0 Liver 15 (37%) Lung 7 (17%) Lymph node 12 (29%) Pleural effusion 4 (10%) Skin 1 (2%) Other 35 (85%) Number of sites involved, n ​ ≤3 35 (85%) ≥4 6 (15%) PIK3CA, n ​ Wild-type 31 (76%) Mutant 9 (22%) Unknown/missing 1 (2%) Abbreviations: ECOG, Eastern Cooperative Oncology Group; TNM, tumor–node–metastasis. Response In the treatment-naïve patients who were response evaluable ( N = Table 2 Fig. 1 Fig. 1 Table 2. Response rates to gedatolisib + palbociclib + letrozole in the response evaluable set. ​ Response evaluable WT PIK3CA a N Response evaluable mut PIK3CA N Total response evaluable ( N ORR, n b 20 (80%) 5 (71%) 26 (79%) Median DOR, months (95% CI) b 48 (24, NR) 47 (4, NR) 48 (25, NR) Best overall response, n ​ ​ ​ CR 1 (4%) 0 1 (3%) PR 19 (76%) 5 (71%) 25 (76%) SD 4 (16%) 2 (29%) 6 (18%) c PD 1 (4%) 0 1 (3%) Abbreviation: NR, not reached. a  PIK3CA b ORR was determined in the response evaluable population ( N N c Three (9%) patients experienced durable SD, defined as SD for >24 weeks. Figure 1. Best overall response and target lesion improvement. Percentage change from baseline in the sum of the diameters of all target lesions at the time of best response. There were five subjects with 100% target lesion responses, but they were classified as PR due to nontarget lesions. Each bar represents a single patient with no prior systemic therapy for advanced breast cancer in the response evaluable set ( N Survival At the time of data cutoff on May 29, 2023, 15 of 41 patients experienced disease progression, and the median PFS was 48.4 months (95% CI, 30.4 to not reached; Fig. 2A Fig. 2A Figure 2. Survival in patients with no prior systemic therapy for advanced breast cancer in the full analysis population. Kaplan–Meier curve determined in the full analysis population of ( A B At data cutoff among the full analysis set ( N Fig. 2B post hoc  PIK3CA Exploratory analyses revealed that ORR and PFS results were comparable in patients with and without PIK3CA PIK3CA N = PIK3CA PIK3CA PIK3CA Safety Safety data were summarized using the full analysis set ( N = Table 3 Table 3 Table 4 Table 3. TEAEs (of any cause, occurring in >20% of patients in the safety analysis set; N Preferred term Grade 3 Grade 4 All grades  N  N  N Patients with any TEAE 34 (83%) 7 (17%) 41 (100%) Stomatitis a 12 (29%) 0 37 (90%) Rash b , c 16 (39%) 0 36 (88%) Nausea 1 (2%) 0 34 (83%) Neutropenia or neutrophil count decreased c , d 21 (51%) 4 (10%) 32 (78%) Fatigue 4 (10%) 0 30 (73%) Constipation 0 0 27 (66%) Diarrhea 3 (7%) 0 24 (59%) Vomiting 0 0 24 (59%) Dysgeusia 0 0 21 (51%) Upper respiratory tract infection 0 0 21 (51%) Insomnia 1 (2%) 0 19 (46%) Headache 0 0 18 (44%) Anemia or hemoglobin decrease c 5 (12%) 0 17 (42%) Pruritus 4 (10%) 0 17 (42%) Urinary tract infection 1 (2%) 1 (2%) 17 (42%) White blood cell count decreased or leukopenia c 8 (20%) 1 (2%) 17 (42%) Arthralgia 0 0 16 (39%) Back pain 0 0 16 (39%) Hyperglycemia or blood glucose increased c 3 (7%) 0 14 (34%) Oropharyngeal pain 0 0 14 (34%) Pyrexia 1 (2%) 0 14 (34%) AST or ALT increased c 3 (7%) 0 13 (32%) Dizziness 0 0 13 (32%) Cough 0 0 12 (29%) Epistaxis 0 0 12 (29%) Hot flush 0 0 12 (29%) Hypokalemia 2 (5%) 0 12 (29%) Influenza-like illness 0 0 12 (29%) Infusion-related reaction 0 0 12 (29%) Dry mouth 0 0 11 (27%) Hypomagnesemia 0 0 11 (27%) Decreased appetite 0 0 10 (24%) Dry skin 0 0 10 (24%) Hypertension 4 (10%) 0 10 (24%) Lymphocyte count decreased 4 (10%) 0 9 (22%) Myalgia 0 0 9 (22%) Nasal congestion 0 0 9 (22%) Oral pain 0 0 9 (22%) Abbreviations: ALT, alanine aminotransferase; AST, aspartate aminotransferase. a Prophylactic treatment for stomatitis was not implemented. b Includes rash, rash maculopapular, rash pruritic, rash papular, rash erythematous, dermatitis, and dermatitis acneiform. c Number of patients with at least one of the terms. If a patient experienced multiple terms, it was counted once for the highest grade. d Neutropenia and neutrophil count decrease were reported interchangeably for many patients. In this table, neutropenia (system organ class blood and lymphatic system disorders) and neutrophil count decreased (system organ class investigations) were combined. Table 4. Grade 3 or 4 TESAEs, of any cause, occurring in >1 patient, N Preferred term Grade 3 N Grade 4 N Patients with at least one TESAE 15 (37%) 3 (7%) Febrile neutropenia 5 (12%) 0 Acute kidney injury 2 (5%) 0 Bacteremia 1 (2%) 1 (2%) Stomatitis or mucosal inflammation 2 (5%) 0 Urinary tract infection 1 (2%) 1 (2%) Hypercalcemia 0 1 (2%) Sepsis 0 1 (2%) Number of patients with at least one of the terms. If a patient experienced multiple terms, it was counted once for the highest grade. All Grade 4 TESAEs are presented. Two grade 4 TESAEs occurred in one patient (grade 4 urinary tract infection and grade 4 bacteremia). Discussion In treatment-naïve patients with HR+, HER2– advanced breast cancer, gedatolisib in combination with palbociclib and letrozole induced an ORR of 79% among evaluable patients, a median PFS of 48.4 months, and a median OS of 77.3 months. The triplet therapy had a low rate of discontinuations due to treatment-related AEs [<10% (4/41)], and side effects were managed by available standards of care. The efficacy and safety results of the pooled analysis were consistent with the study results published previously for the dose expansion arm A patients ( 11 A subgroup analysis of PFS and ORR by PIK3CA PIK3CA 11 PIK3CA 14 15 16 17 18 19 When combined with letrozole, the three approved CDK4/6 inhibitors—palbociclib, ribociclib, and abemaciclib—have each reported significant improvements in PFS compared with letrozole alone as first-line treatment for women with HR+, HER2− advanced breast cancer whose disease recurred more than 12 months after completing adjuvant ET. The PALOMA-2 study evaluated palbociclib combined with letrozole as first-line therapy for patients with HR+, HER2− advanced breast cancer, a similar patient population to the subgroup analyzed here, which thus provides a baseline measure of efficacy for one of the current standard-of-care regimens ( 20 21 22 22 24 A patient’s endocrine resistance or sensitivity status has recently been incorporated into guidelines recommending first-line treatment options ( 25 26 27 PIK3CA NCT06790693 PIK3CA PIK3CA The limitations associated with this subpopulation analysis report include its small sample size and the post hoc PIK3CA NCT06757634 In conclusion, the ORR, median PFS, and OS for patients who received gedatolisib combined with palbociclib and letrozole compare favorably with published results for patients receiving palbociclib and letrozole as first-line therapy for advanced breast cancer. Additionally, the proportion of patients discontinuing treatment due to treatment-related AEs in this study and for palbociclib and letrozole was identical (∼10%). In light of these promising preliminary efficacy and safety results, a phase III study evaluating gedatolisib combined with a CDK4/6 inhibitor and fulvestrant as first-line treatment for patients with ET-resistant HR+, HER2− advanced breast cancer was initiated ( NCT06757634 NCT05501886 Supplementary Material Supplementary Appendix1 Table S1 and Figure S1 Acknowledgments This work was supported by Celcuity; no grant number is applicable. Medical writing and editorial support were provided by Jocelyn Hybiske, PhD, an independent consultant funded by Celcuity. The sponsor of this study collaborated with the clinical investigators in the study design, conduct, and data collection. The study sponsor analyzed the data and conducted the statistical analyses. All authors had access to the data and vouch for the completeness and accuracy of the data, analyses, and fidelity to the study protocol.  Note: http://clincancerres.aacrjournals.org/ Authors’ Disclosures R. Wesolowski reports nonfinancial support and other support from Celcuity during the conduct of the study as well as nonfinancial support from Celcuity outside the submitted work. H.S. Rugo reports other support from Pfizer and Celcuity, Inc. during the conduct of the study as well as other support from AstraZeneca, Novartis, Lilly, Merck, Roche/Genentech, Gilead, Stemline, and Ambrx and personal fees from Napo and Bristol Myers Squibb outside the submitted work. J.M. Specht reports personal fees from Sensei Biotherapeutics, Scripps Research Institute, BioNTech SE, Daiichi Sankyo, and Boehringer Ingelheim and grants from Merck, Pfizer, Seagen, Genentech, Celcuity, AstraZeneca, Lyell Immunopharma, Carisma Therapeutics, A2 Biotherapeutics, OnKure, and Biocity outside the submitted work. H.S. Han reports other support from Celcuity during the conduct of the study as well as personal fees from Pfizer and Arvinas and other support from Arvinas, Pfizer, Phoenix, Senhwa, Quantum Leap Health, Ellipse Pharma, Regor Therapeutics, Exelixis, BridgeBio Pharma, and Eisai outside the submitted work. P. Kabos reports grants from Celcuity, AstraZeneca, Roche, OnKure, and Eli Lilly during the conduct of the study. U. Vaishampayan reports grants and personal fees from Pfizer during the conduct of the study as well as personal fees from Bristol Myers Squibb, Bayer, AstraZeneca, Novartis, Exelixis, and Janssen and grants and personal fees from Merck outside the submitted work. S.A. Wander reports personal fees from Genentech, Novartis, Hologic, AstraZeneca, Gilead, Foundation Medicine, Veracyte, and Biovica; personal fees and other support from Eli Lilly, Pfizer/Arvinas, Regor Therapeutics, Menarini/Stemline, and Puma Biotechnology; and other support from Sermonix, Phoenix Molecular Designs, 2nd.MD, and Guardant Health outside the submitted work. K. Gogineni reports grants from Pfizer during the conduct of the study as well as institutional grant support for effort as site principal investigator of trials sponsored by BriaCell Therapeutics, ACCRU, Stemline, Novartis, F. Hoffmann-La Roche, SWOG, ECOG-ACRIN, Dana-Farber Cancer Institute, Moffitt, Seattle Genetics, Merck, and Immunomedics. A. Spira reports grants from Roche during the conduct of the study as well as grants from Avenzo Therapeutics outside the submitted work. M. Abu-Khalaf reports other support from Celcuity during the conduct of the study. S.C. Mutka reports other support from Celcuity during the conduct of the study. S. Suzuki reports other support from Celcuity during the conduct of the study as well as other support from Celcuity outside the submitted work. B. Sullivan reports personal fees from Celcuity during the conduct of the study as well as personal fees from Celcuity outside the submitted work. I. Gorbatchevsky reports other support from Celcuity during the conduct of the study. R.M. Layman reports grants, personal fees, and nonfinancial support from Celcuity and Pfizer during the conduct of the study as well as grants and nonfinancial support from Accutar Biotechnology; grants, personal fees, and nonfinancial support from Eli Lilly; grants and personal fees from Novartis and Biotheryx; grants from Puma and Arvinas; and personal fees from Gilead outside the submitted work. No disclosures were reported by the other authors. Authors’ Contributions  R. Wesolowski: H.S. Rugo: J.M. Specht: H.S. Han: P. Kabos: U. Vaishampayan: S.A. Wander: K. Gogineni: A. Spira: A.F. Schott: M. Abu-Khalaf: S.C. Mutka: S. Suzuki: B. Sullivan: I. Gorbatchevsky: R.M. Layman: References 1. Waks AG Winer EP Breast cancer treatment: a review JAMA 2019 321 288 300 30667505 10.1001/jama.2018.19323 2. Jerzak KJ Bouganim N Brezden-Masley C Edwards S Gelmon K Henning JW HR+/HER2− advanced breast cancer treatment in the first-line setting: expert review Curr Oncol 2023 30 5425 47 37366894 10.3390/curroncol30060411 PMC10297170 3. Lambertini M Blondeaux E Bisagni G Mura S De Placido S De Laurentiis M Prognostic and clinical impact of the endocrine resistance/sensitivity classification according to international consensus guidelines for advanced breast cancer: an individual patient-level analysis from the Mammella InterGruppo (MIG) and Gruppo Italiano Mammella (GIM) studies eClinicalMedicine 2023 59 101931 37256095 10.1016/j.eclinm.2023.101931 PMC10225659 4. Cardoso F Paluch-Shimon S Senkus E Curigliano G Aapro MS André F 5th ESO-ESMO international consensus guidelines for advanced breast cancer (ABC 5) Ann Oncol 2020 31 1623 49 32979513 10.1016/j.annonc.2020.09.010 PMC7510449 5. Alves CL Ditzel HJ Drugging the PI3K/AKT/mTOR pathway in ER+ breast cancer Int J Mol Sci 2023 24 4522 36901954 10.3390/ijms24054522 PMC10003259 6. Clark AS Makhlin I DeMichele A Setting the pick: can PI3K inhibitors circumvent CDK4/6 inhibitor resistance? Clin Cancer Res 2021 27 371 3 33144339 10.1158/1078-0432.CCR-20-3624 PMC8278622 7. Garrido-Castro AC Goel S CDK4/6 inhibition in breast cancer: mechanisms of response and treatment failure Curr Breast Cancer Rep 2017 9 26 33 28479958 10.1007/s12609-017-0232-0 PMC5414585 8. Vasan N Toska E Scaltriti M Overview of the relevance of PI3K pathway in HR-positive breast cancer Ann Oncol 2019 30 Suppl 10 x3 11 31859348 10.1093/annonc/mdz281 PMC6923788 9. O’Brien NA McDermott MSJ Conklin D Luo T Ayala R Salgar S Targeting activated PI3K/mTOR signaling overcomes acquired resistance to CDK4/6-based therapies in preclinical models of hormone receptor-positive breast cancer Breast Cancer Res 2020 22 89 32795346 10.1186/s13058-020-01320-8 PMC7427086 10. Turner NC Im SA Saura C Juric D Loibl S Kalinsky K Inavolisib-based therapy in PIK3CA-mutated advanced breast cancer N Engl J Med 2024 391 1584 96 39476340 10.1056/NEJMoa2404625 11. Layman RM Han HS Rugo HS Stringer-Reasor EM Specht JM Dees EC Gedatolisib in combination with palbociclib and endocrine therapy in women with hormone receptor-positive, HER2-negative advanced breast cancer: results from the dose expansion groups of an open-label, phase 1b study Lancet Oncol 2024 25 474 87 38547892 10.1016/S1470-2045(24)00034-2 12. Diehl F Li M Dressman D He Y Shen D Szabo S Detection and quantification of mutations in the plasma of patients with colorectal tumors Proc Natl Acad Sci U S A 2005 102 16368 73 16258065 10.1073/pnas.0507904102 PMC1283450 13. Dressman D Yan H Traverso G Kinzler KW Vogelstein B Transforming single DNA molecules into fluorescent magnetic particles for detection and enumeration of genetic variations Proc Natl Acad Sci U S A 2003 100 8817 22 12857956 10.1073/pnas.1133470100 PMC166396 14. Gazi M Moharram SA Marhäll A Kazi JU The dual specificity PI3K/mTOR inhibitor PKI-587 displays efficacy against T-cell acute lymphoblastic leukemia (T-ALL) Cancer Lett 2017 392 9 16 28159681 10.1016/j.canlet.2017.01.035 15. Sarbassov DD Ali SM Kim DH Guertin DA Latek RR Erdjument-Bromage H Rictor, a novel binding partner of mTOR, defines a rapamycin-insensitive and raptor-independent pathway that regulates the cytoskeleton Curr Biol 2004 14 1296 302 15268862 10.1016/j.cub.2004.06.054 16. Juric D Janku F Rodón J Burris HA Mayer IA Schuler M Alpelisib plus fulvestrant in PIK3CA-altered and PIK3CA-wild-type estrogen receptor-positive advanced breast cancer: a phase 1b clinical trial JAMA Oncol 2019 5 e184475 30543347 10.1001/jamaoncol.2018.4475 PMC6439561 17. Hanan EJ Braun MG Heald RA MacLeod C Chan C Clausen S Discovery of GDC-0077 (inavolisib), a highly selective inhibitor and degrader of mutant PI3Kα J Med Chem 2022 65 16589 621 36455032 10.1021/acs.jmedchem.2c01422 18. Schuler W Sedrani R Cottens S Häberlin B Schulz M Schuurman HJ SDZ RAD, a new rapamycin derivative: pharmacological properties in vitro and in vivo Transplantation 1997 64 36 42 9233698 10.1097/00007890-199707150-00008 19. Turner NC Oliveira M Howell SJ Dalenc F Cortes J Gomez Moreno HL Capivasertib in hormone receptor-positive advanced breast cancer N Engl J Med 2023 388 2058 70 37256976 10.1056/NEJMoa2214131 PMC11335038 20. IBRANCE [prescribing information] Pfizer Inc. 2023 [cited 2024 May 21] 21. Finn RS Martin M Rugo HS Jones S Im SA Gelmon K Palbociclib and letrozole in advanced breast cancer N Engl J Med 2016 375 1925 36 27959613 10.1056/NEJMoa1607303 22. Rugo HS Finn RS Diéras V Ettl J Lipatov O Joy AA Palbociclib plus letrozole as first-line therapy in estrogen receptor-positive/human epidermal growth factor receptor 2-negative advanced breast cancer with extended follow-up Breast Cancer Res Treat 2019 174 719 29 30632023 10.1007/s10549-018-05125-4 PMC6438948 23. Hortobagyi GN Stemmer SM Burris HA Yap YS Sonke GS Paluch-Shimon S Updated results from MONALEESA-2, a phase III trial of first-line ribociclib plus letrozole versus placebo plus letrozole in hormone receptor-positive, HER2-negative advanced breast cancer Ann Oncol 2019 30 1842 31407010 10.1093/annonc/mdz215 PMC6927326 24. VERZENIO® (abemaciclib) tablets, for oral use prescribing information Eli Lilly and Company 2023 [cited 2024 Oct 6]. Available from: https://uspl.lilly.com/verzenio/verzenio.html#pi 25. Burstein HJ Somerfield MR Barton DL Dorris A Fallowfield LJ Jain D Endocrine treatment and targeted therapy for hormone receptor-positive, human epidermal growth factor receptor 2-negative metastatic breast cancer: ASCO guideline update J Clin Oncol 2021 39 3959 77 34324367 10.1200/JCO.21.01392 PMC8659999 26. Gennari A André F Barrios CH Cortés J de Azambuja E DeMichele A ESMO Clinical Practice Guideline for the diagnosis, staging and treatment of patients with metastatic breast cancer Ann Oncol 2021 32 1475 95 34678411 10.1016/j.annonc.2021.09.019 27. Lambertini M Blondeaux E Bisagni G Mura S De Placido S De Laurentiis M Prognostic and clinical impact of the endocrine resistance/sensitivity classification according to international consensus guidelines for advanced breast cancer: an individual patient-level analysis from the Mammella InterGruppo (MIG) and Gruppo Italiano Mammella (GIM) studies EClinicalMedicine 2023 59 101931 37256095 10.1016/j.eclinm.2023.101931 PMC10225659 ",
  "metadata": {
    "Title of this paper": "Prognostic and clinical impact of the endocrine resistance/sensitivity classification according to international consensus guidelines for advanced breast cancer: an individual patient-level analysis from the Mammella InterGruppo (MIG) and Gruppo Italiano Mammella (GIM) studies",
    "Journal it was published in:": "Clinical Cancer Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485373/"
  }
}