{
  "title": "Paper_589",
  "abstract": "pmc Stem Cell Res Ther Stem Cell Res Ther 1238 stemcellres Stem Cell Research & Therapy 1757-6512 BMC PMC12482506 PMC12482506.1 12482506 12482506 41024256 10.1186/s13287-025-04607-9 4607 1 Research The PCNA inhibitor AOH1996 suppresses cancer stemness and enhances anti-PD1 immunotherapy in squamous cell carcinoma Wang Yujia 1 Qin Zhen 1 Chen Yiwen 1 Gu Baoxin 1 Jia Lingfei jialingfei@bjmu.edu.cn 1 2 3 1 https://ror.org/02v51f717 grid.11135.37 0000 0001 2256 9319 Department of Oral and Maxillofacial Surgery, Peking University School and Hospital of Stomatology, 2 3 https://ror.org/02v51f717 grid.11135.37 0000 0001 2256 9319 Beijing Advanced Center of Cellular Homeostasis and Aging-Related Diseases, Institute of Advanced Clinical Medicine, Peking University, 29 9 2025 2025 16 478640 523 20 3 2025 19 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background Proliferating cell nuclear antigen (PCNA), a well-documented anticancer target, is critical for DNA synthesis, replication, and repair. AOH1996, a small-molecule PCNA inhibitor, is currently undergoing clinical trials for the treatment of advanced solid tumors. However, the therapeutic effect of AOH1996 on head and neck squamous cell carcinoma (HNSCC) remains unclear. Methods The effects of AOH1996 on HNSCC biological behaviors and cancer stemness were tested in HNSCC cells and nude mice. The combination treatment of AOH1996 and anti-PD1 was performed in a 4-nitroquinoline N-oxide (4NQO)-induced HNSCC mouse model. RNA sequencing, Western Blotting, immunofluorescence staining, comet assays, and qRT‒PCR were conducted for mechanistic studies. Results Our results showed that AOH1996 effectively inhibited HNSCC proliferation and invasion both in vitro and in vivo. AOH1996 suppressed HNSCC stemness, development, and metastasis. Moreover, AOH1996 altered the tumor immune microenvironment into an inflamed state with increased CD8 + + Conclusions Taken together, our results demonstrated that AOH1996 suppressed tumor growth, eliminated cancer stem cells (CSCs), and synergistically enhanced the efficacy of anti-PD1 immunotherapy in HNSCC. Supplementary Information The online version contains supplementary material available at 10.1186/s13287-025-04607-9. Keywords Head and neck squamous cell carcinoma (HNSCC) AOH1996 PCNA Cancer stem cell (CSC) Immunotherapy http://dx.doi.org/10.13039/501100001809 National Natural Science Foundation of China 82272706 Jia Lingfei pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Head and neck squamous cell carcinoma (HNSCC) is the most common malignant tumor of the head and neck [ 1 2 2 2 4 5 6 7 8 For metastatic and recurrent HNSCC, the Food and Drug Administration has approved immune checkpoint inhibitor (ICI) therapy, including pembrolizumab and nivolumab, which target the programmed cell death protein 1 (PD1) receptor [ 2 9 10 11 13 Proliferating cell nuclear antigen (PCNA) reflects the status of cell proliferation and is located mostly in the nuclei of normal proliferating cells and tumor cells [ 14 15 17 18 19 20 21 22 21 Cancer stem cells (CSCs) are a subpopulation of cancer cells capable of self-renewal, infinite proliferation, and multiple differentiation potential [ 23 25 26 27 28 30 In this study, we aimed to evaluate the therapeutic potential of AOH1996, with a particular focus on its effects on cancer stemness and the tumor immune microenvironment, and to elucidate the underlying mechanisms involved. These findings may provide a better understanding of the therapeutic potential of AOH1996 in HNSCC and promote the development of more effective treatment strategies targeting PCNA and its associated pathways in cancer. Methods Cell culture and treatment The human HNSCC cell lines CAL27 [ 31 32 2 Cell counting Kit-8 (CCK-8) assay The proliferation of HNSCC cells was evaluated using a CCK-8 assay (Dojindo, Shanghai, China). The cells treated with AOH1996 were added to 96-well plates (2 × 10 3 Transwell assay Transwell chambers with 8 μm pore-size membranes coated with Matrigel (Corning Inc., NY, USA; Cat# 3422) were placed in 24-well plates. HNSCC cells were resuspended in 200 µL of serum-free DMEM (1 × 10 5 Terminal deoxynucleotidyl transferase nick-end-labeling (TUNEL) assay A TUNEL Apoptosis Assay Kit (Solarbio; Cat# T2130) was used to detect apoptotic cells following the manufacturer’s instructions. Briefly, the cells were incubated with TUNEL working solution for 1 h at 37 °C after AOH1996 treatment for 24 h. The cells were fixed with 4% paraformaldehyde for 20 min and then stained with 4′,6-diamidino-2-phenylindole (DAPI; Solarbio; Cat# C0065). Images were acquired using a fluorescence microscope. CSC isolation and flow cytometry assay After AOH1996 treatment, an ALDEFLUOR Kit (STEMCELL Technologies, Vancouver, Canada; Cat# 01700) was used to isolate CSCs from HNSCC cells expressing high levels of aldehyde dehydrogenase (ALDH high low high low + high low + Tumorsphere formation assay Ultralow attachment 6-well plates (Corning Inc.; Cat# 3471) were used to analyze tumorsphere formation. FACS-isolated HNSCC cells treated with AOH1996 were plated. Serum-free DMEM/F12 (Thermo Fisher Scientific, Shanghai, China; Cat# 8122659) supplemented with 1% N2 (Thermo Fisher Scientific; Cat# 17502048) and 1% B27 supplement (Thermo Fisher Scientific; Cat# 17504044) was used to culture the cells. A total of 20 ng/mL recombinant human epidermal growth factor (EGF; R&D Systems, Minneapolis, MN, USA; Cat# 236-EG-01 M) and 10 ng/mL human basic fibroblast growth factor (FGF; R&D Systems; Cat# 233-FB/CF) [ 33 Western blot HNSCC cells were lysed using radioimmunoprecipitation assay (RIPA) buffer (Solarbio; Cat# R0010) containing phenylmethylsulfonyl fluoride (PMSF; Beyotime, Shanghai, China; Cat# ST506). Protein samples were separated on 10% SDS polyacrylamide gels and transferred to polyvinylidene difluoride (PVDF) membranes. The membranes were blocked with 5% nonfat milk for 1 h and then incubated with primary antibodies at 4 °C overnight. The primary antibodies used included the following: anti-BMI1 (1:1000; Cell Signaling Technology, Shanghai, China; Cat# 6964), anti-SOX2 (1:1000; Cell Signaling Technology; Cat# 14962), anti-ALDH1 (1:1000; Cell Signaling Technology; Cat# 54135), anti-MYC (1:1000; Cell Signaling Technology; Cat# 18583), anti-phosphorylated H2A.X (anti-p-H2A.X; 1:1000; Cell Signaling Technology; Cat# 9718), anti-p-STING (1:1000; Cell Signaling Technology; Cat# 19781), anti-STING (1:1000; Cell Signaling Technology; Cat# 13647), anti-p-TBK1 (1:1000; Cell Signaling Technology; Cat# 5483), anti-TBK1 (1:1000; Cell Signaling Technology; Cat# 3504), anti-p-IRF3 (1:1000; Cell Signaling Technology; Cat# 29047), and anti-IRF3 (1:1000; Cell Signaling Technology; Cat# 4302). GAPDH (1:1000; Cell Signaling Technology; Cat# 5174) was used as the internal control. The membranes were then incubated with secondary horseradish peroxidase (HRP)-labeled goat anti-rabbit or goat anti-mouse antibodies (Beyotime; Cat# A0208 or #A0216) at room temperature for 1 h. Immunoreactive protein bands were visualized using NcmECL Ultra (NCM Biotech, Suzhou, China; Cat# P10100 RNA-seq and pathway enrichment analysis Total RNA was isolated from SCC15 cells using TRIzol Reagent (Thermo Fisher Scientific; Cat# 15596026). The quality of total RNA was evaluated using an Agilent 2100 Bioanalyzer (Agilent Technologies, Santa Clara, CA, USA). An Illumina TruSeq RNA sample preparation kit (Illumina, San Diego, CA, USA) was used for RNA-sequencing library construction [ 34 https://davidbioinformatics.nih.gov/tools.jsp GSE289770 Comet assay A Comet SCGE Assay Kit (Enzo, NY, USA; Cat# ADI-900-166) was used for single-cell gel electrophoresis [ 35 5 Cytosolic DsDNA staining After AOH1996 treatment for 24 h, HNSCC cells were stained with PicoGreen (Thermo Fisher Scientific; Cat# P11496 Quantitative reverse transcription polymerase chain reaction (qRT‒PCR) Total RNA was extracted from HNSCC cells using TRIzol Reagent (Thermo Fisher Scientific; Cat# 15596026), and then 500 ng of RNA was reverse transcribed to cDNA using a reverse transcription kit (Takara, Beijing, China; Cat# RR036A). A SYBR Green Kit (Roche, Basel, Switzerland; Cat# 04913914001) was used to quantify the cDNA by quantitative real-time PCR, which was conducted at 95 °C for 10 min, followed by 40 cycles of 95 °C for 15 s and 60 °C for 1 min using an ABI Prism 7500 real-time PCR System (Applied Biosystems, Foster City, CA, USA). The primers used for qRT ‒ S1 In vivo HNSCC tumor growth, ELDA, patient-derived xenografts (PDXs), and the orthotopic model Female BALB/c nude mice (6–8 weeks old) were purchased from SPF Biotechnology Co., Ltd (Beijing, China). All the animal studies strictly conformed to the regulations of the Institutional Animal Care and Use Committee of Peking University Health Science Center. In this study, the mice were euthanized by cervical dislocation after isoflurane anesthesia. The work has been reported in line with the ARRIVE guidelines 2.0. For the subcutaneous tumor models, twelve mice were randomly divided into two groups ( n 6 For the extreme limiting dilution assay (ELDA), ALDH high https://bioinf.wehi.edu.au/software/elda/index.html For the HNSCC PDX and orthotopic models, CSCs were obtained from the HNSCC PDX #1 model using FACS with EpCAM + high 36 6 n After the mice were sacrificed, the tongues and cervical lymph nodes were collected. The tumor volume (mm 3 2 HNSCC 4-nitroquinoline 1-oxide (4NQO) mouse model, treatment and histology For 4NQO-induced HNSCC, 6–8-week-old Bmi1 CreER Rosa tdTomato + For HNSCC treatment, after 22 weeks, the mice were randomly divided into four groups and treated as follows: (1) control vehicle; (2) AOH1996 (50 mg/kg, twice a week); (3) anti-PD1 (BioXcell, Lebanon, NH, USA; Cat# BE0146, 200 µg/mouse, twice a week); and (4) AOH1996 combined with anti-PD1, which lasted four weeks. To assess the tolerability of anti-PD1, AOH1996, and combination treatments in mice, the heart, liver, lung, kidney, and spleen were collected for histopathological analysis, and H&E-stained images were captured. The blood of the mice was collected for routine blood tests and biochemical indicator analysis. HNSCC tumor growth and lymph node metastasis were evaluated as previously described [ 36 For histological analysis and immunostaining, longitudinally cut tongues (dorsal/ventral) and lymph nodes were sectioned into 4-µm-thick tissues, fixed with 4% paraformaldehyde, and paraffin-embedded overnight. Tongue sections were stained with hematoxylin and eosin (H&E). The number of squamous cell carcinomas (SCCs) was counted, and SCC areas were measured as previously described [ 36 Immunostaining For immunohistochemistry (IHC), after antigen repair, the lymph node sections were incubated with the primary antibody anti-pan-cytokeratin (anti-PCK; 1:200; Santa Cruz Biotechnology, Shanghai, China; Cat# sc-8018) at 4 °C overnight. Anti-PCK can be used to specifically test epithelial tumor cells in lymph nodes. The tongue sections were incubated with the primary antibody anti-CD8 (1:200; Cell Signaling Technology; Cat# 98941) at 4 °C overnight. The sections were then incubated with goat anti-mouse IgG polymer (ZSGB-BIO; Cat# PV-6002) or goat anti-rabbit IgG polymer (ZSGB-BIO; Cat# PV-6001) secondary antibodies for 1 h at room temperature. The percentages of lymph node metastasis, metastatic areas, and CD8 + For cell immunofluorescence staining, HNSCC cells were fixed with 4% paraformaldehyde for 15 min after AOH1996 treatment at room temperature. The cells were incubated with the primary antibody anti-p-H2A.X (1:100; Cell Signaling Technology; Cat# 9718) at 4 °C overnight, followed by incubation with a secondary antibody conjugated with the fluorescent marker Cy3 (Jackson ImmunoResearch Laboratories, West Grove, PA, USA). The nuclei were stained with DAPI. All immunostaining images were acquired using a fluorescence microscope. Statistical analysis Statistical analyses were performed using GraphPad Prism 10.4.1 for Windows (GraphPad Software Inc., La Jolla, CA, USA). In vitro experiments were performed at least three times, and in vivo experiments were performed at least twice. The data are expressed as the mean ± standard deviation (SD) or standard error of the mean (SEM) [ 28 33 P Results AOH1996 inhibits cell proliferation and invasion while promoting apoptosis in HNSCC cells To investigate the therapeutic effect of AOH1996 on HNSCC, two HNSCC cell lines, CAL27 and SCC15, were treated with AOH1996. AOH1996 reduced the relative cell viability of CAL27 and SCC15 cells (Fig. 1 1 1 1 1 1 1  Fig. 1 AOH1996 inhibits HNSCC cell proliferation and invasion, promotes apoptosis, and suppresses tumor growth ( A-B C-D E P F P G P H I n P J n P AOH1996 inhibits the cancer stemness signature of HNSCC We further investigated whether AOH1996 could inhibit cancer stemness in HNSCC. Aldehyde dehydrogenase (ALDH) is a specific marker on the surface of CSCs [ 23 37 low high high 2 high 2 30 38 39 2 high 2  Fig. 2 AOH1996 inhibits the cancer stemness of HNSCC ( A high high B-C high low P D E-F high n AOH1996 inhibits the progression and metastasis of CSCs cultured from patient-derived xenograft (PDX) models PDX models and human cancers share similar genetic landscapes, and PDXs have been widely used as preclinical models in cancer studies [ 40 + high 36 3 3 3 41 37 42 3  Fig. 3 AOH1996 inhibits the tumorigenic potential and lymph node metastasis of HNSCC CSCs ( A B C D n P E n P F G P H P AOH1996 eliminates CSCs and enhances the response to anti-PD1 immunotherapy in HNSCC In our previous study, we successfully established a Bmi1 CreER Rosa tdTomato + 28 4  Fig. 4 AOH1996 enhances the therapeutic effect of anti-PD1 immunotherapy in HNSCC ( A Bmi1 CreER Rosa tdTomato B C n P P D E-F n P P G P P H I P P J P P K + + P P L + P P Compared with either anti-PD1 monotherapy or AOH1996 monotherapy, combination treatment with AOH1996 and anti-PD1 significantly reduced the tongue lesion area (Fig. 4 4 4 In vivo lineage tracing revealed that AOH1996 reduced Bmi1 + + 4 + 4 To evaluate the drug safety of the anti-PD1, AOH1996, and the combination treatment of AOH1996 and anti-PD1, we conducted histopathological and hematological analyses in C57BL/6J mice. Histopathological examination revealed no significant morphological alterations in major organs, including the heart, liver, lung, kidney, and spleen (Fig. 5 5 5  Fig. 5 Systematic effect of AOH1996 combined with anti-PD1 treatment in HNSCC in vivo ( A B C AOH1996 induces cellular DNA damage, activates the cGAS–STING signaling pathway, inhibits cancer stemness, and stimulates antitumor immune responses in HNSCC To investigate the mechanisms underlying the therapeutic potential of AOH1996 in HNSCC, RNA sequencing (RNA-seq) was performed on HNSCC cells. Comprehensive transcriptome alterations were analyzed in SCC15 cells after treatment with AOH1996. KEGG pathway analysis suggested that AOH1996 treatment modulated the regulation of transcription by RNA polymerase II, DNA-templated transcription, and DNA damage response signaling pathways (Fig. 6 21  Fig. 6 AOH1996 induces cellular DNA damage, activates the cGAS-STING signaling pathway, and stimulates antitumor immune responses ( A B C P D P E P F P Phosphorylated H2A.X (p-H2A.X) has been used as a DNA damage marker in previous studies [ 43 44 6 6 45 6 46 6 The cyclic GMP–AMP synthase-stimulator of interferon genes (cGAS–STING) signaling pathway can be activated by accumulated cytosolic dsDNA, inducing the phosphorylation of STING, TANK binding kinase 1 (TBK1) and interferon regulatory factor 3 (IRF3). Phosphorylated IRF3 regulates the expression of IFN [ 47 49 6 50 qRT–PCR analysis revealed that AOH1996 increased the relative expression of IFNβ mRNA in CAL27 and SCC15 cells (Fig. 6 51 + 6 Discussion In recent years, targeted therapies that focus on specific molecules have been widely applied in the treatment of various cancers, which potentiate precise therapeutic strategies [ 52 53 14 54 54 18 19 21 22 21 In this study, our results demonstrated that AOH1996 inhibited the biological behaviors of HNSCC both in vitro and in vivo. AOH1996 suppressed HNSCC stemness, development, and metastasis. Moreover, AOH1996 eliminated CSCs, increased CD8 + + 7  Fig. 7 Mechanism of AOH1996 treatment in HNSCC ( A The therapeutic effect of AOH1996 on regulating HNSCC cancer stemness remains unclear. A previous study demonstrated that PCNA is essential for maintaining cancer stemness through Y211 phosphorylation [ 14 14 55 56 Cancer stemness and immune evasion are important characteristics of HNSCC initiation, development, and metastasis [ 57 58 26 33 59 11 13 42 51 60 The 4NQO-induced HNSCC Bmi1 CreER Rosa tdTomato 28 + + 59 61 Mechanistically, AOH1996 can cause DNA double-strand breaks and genome instability [ 21 62 65 50 50 51 + However, there are limitations in this study. The translational potential of AOH1966 is constrained by its unknown effects in human HNSCC samples or patient-derived immune microenvironments. Future studies should further validate the therapeutic efficacy of AOH1996 in human HNSCC samples. The molecular mechanism by which AOH1996 modulates PCNA in HNSCC CSCs requires further investigation. Moreover, how AOH1996 modulates immune checkpoints such as PD-L1 and Tregs also needs to be explored. Conclusions Our study demonstrated that the PCNA inhibitor AOH1996 suppressed HNSCC biological behaviors, impaired cancer stemness, prevented development and metastasis, enhanced the effect of anti-PD1 immunotherapy, promoted cellular DNA damage, and stimulated antitumor immune responses. This study provides a novel therapeutic strategy for HNSCC. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We appreciate the support from the Department of Oral and Maxillofacial Surgery at Peking University School and Hospital of Stomatology. The authors declare that they have not used AI-generated work in this manuscript. Author contributions Conceptualization, LJ, YW; Methodology, YW, ZQ, YC, BG, LJ; Investigation, YW, ZQ, YC, BG; Statistical analysis YW, LJ; Writing-original draft, YW; Writing-review and editing, LJ, YW; Project administration, LJ; Funding acquisition, LJ. All authors read and approved the final manuscript. Funding This study was supported by the National Natural Science Foundation of China under Grant number 82272706. Data availability The data supporting this study are available from the corresponding author upon reasonable request. The RNA-seq data were deposited in the GEO database of the NCBI under accession number GSE289770 Declarations Ethics approval and consent to participate The human HNSCC cell lines CAL27 (CRL-2095) and SCC15 (CRL-1623) were obtained from ATCC ( https://www.atcc.org/ Consent for publication Not applicable. Competing interests The authors declare that they have no competing interests. Abbreviations PCNA Proliferating cell nuclear antigen HNSCC Head and neck squamous cell carcinoma CSCs Cancer stem cells ICI Immune checkpoint inhibitors PD1 Programmed cell death protein 1 DMEM Dulbecco’s modified Eagle’s medium FBS Fetal bovine serum DMSO Dimethyl sulfoxide CCK-8 Cell counting kit-8 DAPI 4′,6-diamidino-2-phenylindole FACS Fluorescence-activated cell sorting PDXs Patient-derived xenografts EGF Epidermal growth factor FGF Fibroblast growth factor RIPA Radioimmunoprecipitation assay PMSF Phenylmethylsulfonyl fluoride PVDF Polyvinylidene difluoride HPR Horseradish peroxidase ELDA Extreme limiting dilution assay 4NQO 4-nitroquinoline 1-oxide H&E Hematoxylin and eosin SCC Squamous cell carcinoma IHC Immunohistochemistry PCK Pan-cytokeratin GEO Gene Expression Omnibus qRT–PCR Quantitative reverse transcription polymerase chain reaction SD Standard deviation SEM Standard error of the mean ANOVA One-way analysis of variance ALDH Aldehyde dehydrogenase WBC White blood cells RBC Red blood cells HGB Hemoglobin PLT Platelet ALT Alanine aminotransferase AST Aspartate aminotransferase CREA Creatinine RNA-seq RNA-sequencing KEGG Kyoto Encyclopedia of Genes and Genomes dsDNA Double-stranded DNA mtDNA Mitochondrial DNA TBK1 TANK-binding kinase 1 IRF3 Interferon regulatory factor 3 CXCL C-X-C motif chemokine ligand References 1. Mody MD Rocco JW Yom SS Haddad RI Saba NF Head and neck cancer Lancet 2021 398 10318 2289 99 10.1016/S0140-6736(21)01550-6 34562395 Mody MD, Rocco JW, Yom SS, Haddad RI, Saba NF. Head and neck cancer. Lancet. 2021;398(10318):2289–99. 34562395 10.1016/S0140-6736(21)01550-6 2. Johnson DE Burtness B Leemans CR Lui VWY Bauman JE Grandis JR Head and neck squamous cell carcinoma Nat Rev Dis Primers 2020 6 1 92 10.1038/s41572-020-00224-3 33243986 PMC7944998 Johnson DE, Burtness B, Leemans CR, Lui VWY, Bauman JE, Grandis JR. Head and neck squamous cell carcinoma. Nat Rev Dis Primers. 2020;6(1):92. 33243986 10.1038/s41572-020-00224-3 PMC7944998 3. Chow LQM Head and neck cancer N Engl J Med 2020 382 1 60 72 10.1056/NEJMra1715715 31893516 Chow LQM. Head and neck cancer. N Engl J Med. 2020;382(1):60–72. 31893516 10.1056/NEJMra1715715 4. Cramer JD Burtness B Le QT Ferris RL The changing therapeutic landscape of head and neck cancer Nat Rev Clin Oncol 2019 16 11 669 83 10.1038/s41571-019-0227-z 31189965 Cramer JD, Burtness B, Le QT, Ferris RL. The changing therapeutic landscape of head and neck cancer. Nat Rev Clin Oncol. 2019;16(11):669–83. 31189965 10.1038/s41571-019-0227-z 5. Barsouk A, Aluru JS, Rawla P, Saginala K, Barsouk A, Epidemiology. Risk factors, and prevention of head and neck squamous cell carcinoma. Med Sci (Basel). 2023;11(2). 10.3390/medsci11020042 PMC10304137 37367741 6. Hoesseini A Sewnaik A van den Besselaar BN Zhang J van Leeuwen N Hardillo JA Prognostic model for overall survival of head and neck cancer patients in the palliative phase BMC Palliat Care 2024 23 1 54 10.1186/s12904-023-01325-y 38395897 PMC10893612 Hoesseini A, Sewnaik A, van den Besselaar BN, Zhang J, van Leeuwen N, Hardillo JA, et al. Prognostic model for overall survival of head and neck cancer patients in the palliative phase. BMC Palliat Care. 2024;23(1):54. 38395897 10.1186/s12904-023-01325-y PMC10893612 7. Siegel RL Giaquinto AN Jemal A Cancer statistics, 2024 CA Cancer J Clin 2024 74 1 12 49 38230766 10.3322/caac.21820 Siegel RL, Giaquinto AN, Jemal A. Cancer statistics, 2024. CA Cancer J Clin. 2024;74(1):12–49. 38230766 10.3322/caac.21820 8. Tan Y Wang Z Xu M Li B Huang Z Qin S Oral squamous cell carcinomas: state of the field and emerging directions Int J Oral Sci 2023 15 1 44 10.1038/s41368-023-00249-w 37736748 PMC10517027 Tan Y, Wang Z, Xu M, Li B, Huang Z, Qin S, et al. Oral squamous cell carcinomas: state of the field and emerging directions. Int J Oral Sci. 2023;15(1):44. 37736748 10.1038/s41368-023-00249-w PMC10517027 9. Machiels JP Rene Leemans C Golusinski W Grau C Licitra L Gregoire V Squamous cell carcinoma of the oral cavity, larynx, oropharynx and hypopharynx: EHNS-ESMO-ESTRO clinical practice guidelines for diagnosis, treatment and follow-up Ann Oncol 2020 31 11 1462 75 10.1016/j.annonc.2020.07.011 33239190 Machiels JP, Rene Leemans C, Golusinski W, Grau C, Licitra L, Gregoire V, et al. Squamous cell carcinoma of the oral cavity, larynx, oropharynx and hypopharynx: EHNS-ESMO-ESTRO clinical practice guidelines for diagnosis, treatment and follow-up. Ann Oncol. 2020;31(11):1462–75. 33239190 10.1016/j.annonc.2020.07.011 10. Bhatia A Burtness B Treating head and neck cancer in the age of immunotherapy: A 2023 update Drugs 2023 83 3 217 48 10.1007/s40265-023-01835-2 36645621 Bhatia A, Burtness B. Treating head and neck cancer in the age of immunotherapy: A 2023 update. Drugs. 2023;83(3):217–48. 36645621 10.1007/s40265-023-01835-2 11. Ruffin AT Li H Vujanovic L Zandberg DP Ferris RL Bruno TC Improving head and neck cancer therapies by Immunomodulation of the tumour microenvironment Nat Rev Cancer 2023 23 3 173 88 10.1038/s41568-022-00531-9 36456755 PMC9992112 Ruffin AT, Li H, Vujanovic L, Zandberg DP, Ferris RL, Bruno TC. Improving head and neck cancer therapies by Immunomodulation of the tumour microenvironment. Nat Rev Cancer. 2023;23(3):173–88. 36456755 10.1038/s41568-022-00531-9 PMC9992112 12. Mei Z Huang J Qiao B Lam AK Immune checkpoint pathways in immunotherapy for head and neck squamous cell carcinoma Int J Oral Sci 2020 12 1 16 10.1038/s41368-020-0084-8 32461587 PMC7253444 Mei Z, Huang J, Qiao B, Lam AK. Immune checkpoint pathways in immunotherapy for head and neck squamous cell carcinoma. Int J Oral Sci. 2020;12(1):16. 32461587 10.1038/s41368-020-0084-8 PMC7253444 13. Okuyama K Naruse T Yanamoto S Tumor microenvironmental modification by the current target therapy for head and neck squamous cell carcinoma J Exp Clin Cancer Res 2023 42 1 114 10.1186/s13046-023-02691-4 37143088 PMC10161653 Okuyama K, Naruse T, Yanamoto S. Tumor microenvironmental modification by the current target therapy for head and neck squamous cell carcinoma. J Exp Clin Cancer Res. 2023;42(1):114. 37143088 10.1186/s13046-023-02691-4 PMC10161653 14. Wang YL, Wu WR, Lin PL, Shen YC, Lin YZ, Li HW et al. The functions of PCNA in tumor stemness and invasion. Int J Mol Sci. 2022;23(10). 10.3390/ijms23105679 PMC9143764 35628489 15. Gonzalez-Magana A, Blanco FJ, Human PCNA, Structure. Function Interact Biomolecules. 2020;10(4). 10.3390/biom10040570 PMC7225939 32276417 16. Kang S Yoo J Myung K PCNA cycling dynamics during DNA replication and repair in mammals Trends Genet 2024 40 6 526 39 10.1016/j.tig.2024.02.006 38485608 Kang S, Yoo J, Myung K. PCNA cycling dynamics during DNA replication and repair in mammals. Trends Genet. 2024;40(6):526–39. 38485608 10.1016/j.tig.2024.02.006 17. Zhang S Zhou T Wang Z Yi F Li C Guo W Post-Translational modifications of PCNA in control of DNA synthesis and DNA damage Tolerance-the implications in carcinogenesis Int J Biol Sci 2021 17 14 4047 59 10.7150/ijbs.64628 34671219 PMC8495385 Zhang S, Zhou T, Wang Z, Yi F, Li C, Guo W, et al. Post-Translational modifications of PCNA in control of DNA synthesis and DNA damage Tolerance-the implications in carcinogenesis. Int J Biol Sci. 2021;17(14):4047–59. 34671219 10.7150/ijbs.64628 PMC8495385 18. Shin DM, Voravud N, Ro JY, Lee JS, Hong WK. WN. H. Sequential increases in proliferating cell nuclear antigen expression in head and neck tumorigenesis- a potential biomarker. J Natl Cancer Inst 1993;Jun 16;85(12):971–8. 10.1093/jnci/85.12.971 8098774 19. Lörz M Meyer-Breiting E Proliferating cell nuclear antigen counts as markers of cell proliferation in head and neck cancer Eur Arch Otorhinolaryngol 1994 251 2 91 4 10.1007/BF00179899 7517683 Lörz M, Meyer-Breiting E. Proliferating cell nuclear antigen counts as markers of cell proliferation in head and neck cancer. Eur Arch Otorhinolaryngol. 1994;251(2):91–4. 7517683 10.1007/BF00179899 20. Chang HR, Jung E, Cho S, Jeon YJ, Kim Y. Targeting Non-Oncogene addiction for cancer therapy. Biomolecules. 2021;11(2). 10.3390/biom11020129 PMC7909239 33498235 21. Gu L Li M Li CM Haratipour P Lingeman R Jossart J Small molecule targeting of transcription-replication conflict for selective chemotherapy Cell Chem Biol 2023 30 10 1235 47 10.1016/j.chembiol.2023.07.001 37531956 PMC10592352 Gu L, Li M, Li CM, Haratipour P, Lingeman R, Jossart J, et al. Small molecule targeting of transcription-replication conflict for selective chemotherapy. Cell Chem Biol. 2023;30(10):1235–47. e6. 37531956 10.1016/j.chembiol.2023.07.001 PMC10592352 22. Wendel SO Snow JA Gu L Banerjee NS Malkas L Wallace NA The potential of PCNA Inhibition as a therapeutic strategy in cervical cancer J Med Virol 2023 95 11 e29244 10.1002/jmv.29244 38010649 PMC10683864 Wendel SO, Snow JA, Gu L, Banerjee NS, Malkas L, Wallace NA. The potential of PCNA Inhibition as a therapeutic strategy in cervical cancer. J Med Virol. 2023;95(11):e29244. 38010649 10.1002/jmv.29244 PMC10683864 23. Duan H Liu Y Gao Z Huang W Recent advances in drug delivery systems for targeting cancer stem cells Acta Pharm Sin B 2021 11 1 55 70 10.1016/j.apsb.2020.09.016 33532180 PMC7838023 Duan H, Liu Y, Gao Z, Huang W. Recent advances in drug delivery systems for targeting cancer stem cells. Acta Pharm Sin B. 2021;11(1):55–70. 33532180 10.1016/j.apsb.2020.09.016 PMC7838023 24. Valent P Bonnet D De Maria R Lapidot T Copland M Melo JV Cancer stem cell definitions and terminology: the devil is in the details Nat Rev Cancer 2012 12 11 767 75 10.1038/nrc3368 23051844 Valent P, Bonnet D, De Maria R, Lapidot T, Copland M, Melo JV, et al. Cancer stem cell definitions and terminology: the devil is in the details. Nat Rev Cancer. 2012;12(11):767–75. 23051844 10.1038/nrc3368 25. Kudelka MR Lavin Y Sun S Fuchs E Molecular and cellular dynamics of squamous cell carcinomas across tissues Genes Dev 2025 39 1–2 18 35 39455281 10.1101/gad.351990.124 PMC11789493 Kudelka MR, Lavin Y, Sun S, Fuchs E. Molecular and cellular dynamics of squamous cell carcinomas across tissues. Genes Dev. 2025;39(1–2):18–35. 39455281 10.1101/gad.351990.124 PMC11789493 26. Wang C Li Y Jia L Kim JK Li J Deng P CD276 expression enables squamous cell carcinoma stem cells to evade immune surveillance Cell Stem Cell 2021 28 9 1597 613 10.1016/j.stem.2021.04.011 33945793 PMC8419062 Wang C, Li Y, Jia L, Kim JK, Li J, Deng P, et al. CD276 expression enables squamous cell carcinoma stem cells to evade immune surveillance. Cell Stem Cell. 2021;28(9):1597–613. e7. 33945793 10.1016/j.stem.2021.04.011 PMC8419062 27. Saw PE Liu Q Wong PP Song E Cancer stem cell mimicry for immune evasion and therapeutic resistance Cell Stem Cell 2024 31 8 1101 12 10.1016/j.stem.2024.06.003 38925125 Saw PE, Liu Q, Wong PP, Song E. Cancer stem cell mimicry for immune evasion and therapeutic resistance. Cell Stem Cell. 2024;31(8):1101–12. 38925125 10.1016/j.stem.2024.06.003 28. Jia L Zhang W Wang CY BMI1 Inhibition eliminates residual cancer stem cells after PD1 Blockade and activates antitumor immunity to prevent metastasis and relapse Cell Stem Cell 2020 27 2 238 53 10.1016/j.stem.2020.06.022 32697949 PMC7416748 Jia L, Zhang W, Wang CY. BMI1 Inhibition eliminates residual cancer stem cells after PD1 Blockade and activates antitumor immunity to prevent metastasis and relapse. Cell Stem Cell. 2020;27(2):238–53. e6. 32697949 10.1016/j.stem.2020.06.022 PMC7416748 29. Chen D Wang CY Targeting cancer stem cells in squamous cell carcinoma Precis Clin Med 2019 2 3 152 65 10.1093/pcmedi/pbz016 31598386 PMC6770277 Chen D, Wang CY. Targeting cancer stem cells in squamous cell carcinoma. Precis Clin Med. 2019;2(3):152–65. 31598386 10.1093/pcmedi/pbz016 PMC6770277 30. Yang L Shi P Zhao G Xu J Peng W Zhang J Targeting cancer stem cell pathways for cancer therapy Signal Transduct Target Ther 2020 5 1 8 10.1038/s41392-020-0110-5 32296030 PMC7005297 Yang L, Shi P, Zhao G, Xu J, Peng W, Zhang J, et al. Targeting cancer stem cell pathways for cancer therapy. Signal Transduct Target Ther. 2020;5(1):8. 32296030 10.1038/s41392-020-0110-5 PMC7005297 31. Gioanni J Fischel JL Lambert JC Demard F Mazeau C Zanghellini E Two new human tumor cell lines derived from squamous cell carcinomas of the tongue- establishment, characterization and response to cytotoxic treatment Eur J Cancer Clin Oncol 1988 24 9 1445 55 10.1016/0277-5379(88)90335-5 3181269 Gioanni J, Fischel JL, Lambert JC, Demard F, Mazeau C, Zanghellini E, et al. Two new human tumor cell lines derived from squamous cell carcinomas of the tongue- establishment, characterization and response to cytotoxic treatment. Eur J Cancer Clin Oncol. 1988;24(9):1445–55. 3181269 10.1016/0277-5379(88)90335-5 32. Rheinwald JG Defective terminal differentiation in culture as a consistent and selectable character of malignant human keratinocytes Cell 1980 22 2 Pt 2 629 32 10.1016/0092-8674(80)90373-6 6160916 Rheinwald JG. Defective terminal differentiation in culture as a consistent and selectable character of malignant human keratinocytes. Cell. 1980;22(2 Pt 2):629–32. 6160916 10.1016/0092-8674(80)90373-6 33. Jia L Wang Y Wang CY circFAT1 promotes cancer stemness and immune evasion by promoting STAT3 activation Adv Sci (Weinh) 2021 8 13 2003376 10.1002/advs.202003376 34258151 PMC8261519 Jia L, Wang Y, Wang CY. circFAT1 promotes cancer stemness and immune evasion by promoting STAT3 activation. Adv Sci (Weinh). 2021;8(13):2003376. 34258151 10.1002/advs.202003376 PMC8261519 34. Pelos G Riester M Pal J Myacheva K Moneke I Rotondo JC Fast proliferating and slowly migrating non-small cell lung cancer cells are vulnerable to decitabine and retinoic acid combinatorial treatment Int J Cancer 2024 154 6 1029 42 10.1002/ijc.34783 37947765 Pelos G, Riester M, Pal J, Myacheva K, Moneke I, Rotondo JC, et al. Fast proliferating and slowly migrating non-small cell lung cancer cells are vulnerable to decitabine and retinoic acid combinatorial treatment. Int J Cancer. 2024;154(6):1029–42. 37947765 10.1002/ijc.34783 35. Lu S Dong Z Additive effects of a small molecular PCNA inhibitor PCNA-I1S and DNA damaging agents on growth Inhibition and DNA damage in prostate and lung cancer cells PLoS ONE 2019 14 10 e0223894 10.1371/journal.pone.0223894 31600334 PMC6786632 Lu S, Dong Z. Additive effects of a small molecular PCNA inhibitor PCNA-I1S and DNA damaging agents on growth Inhibition and DNA damage in prostate and lung cancer cells. PLoS ONE. 2019;14(10):e0223894. 31600334 10.1371/journal.pone.0223894 PMC6786632 36. Chen D Wu M Li Y Chang I Yuan Q Ekimyan-Salvo M Targeting BMI1(+) cancer stem cells overcomes chemoresistance and inhibits metastases in squamous cell carcinoma Cell Stem Cell 2017 20 5 621 34 10.1016/j.stem.2017.02.003 28285905 PMC5419860 Chen D, Wu M, Li Y, Chang I, Yuan Q, Ekimyan-Salvo M, et al. Targeting BMI1(+) cancer stem cells overcomes chemoresistance and inhibits metastases in squamous cell carcinoma. Cell Stem Cell. 2017;20(5):621–34. e6. 28285905 10.1016/j.stem.2017.02.003 PMC5419860 37. Zeng Z Fu M Hu Y Wei Y Wei X Luo M Regulation and signaling pathways in cancer stem cells: implications for targeted therapy for cancer Mol Cancer 2023 22 1 172 10.1186/s12943-023-01877-w 37853437 PMC10583419 Zeng Z, Fu M, Hu Y, Wei Y, Wei X, Luo M. Regulation and signaling pathways in cancer stem cells: implications for targeted therapy for cancer. Mol Cancer. 2023;22(1):172. 37853437 10.1186/s12943-023-01877-w PMC10583419 38. Huang T Song X Xu D Tiek D Goenka A Wu B Stem cell programs in cancer initiation, progression, and therapy resistance Theranostics 2020 10 19 8721 43 10.7150/thno.41648 32754274 PMC7392012 Huang T, Song X, Xu D, Tiek D, Goenka A, Wu B, et al. Stem cell programs in cancer initiation, progression, and therapy resistance. Theranostics. 2020;10(19):8721–43. 32754274 10.7150/thno.41648 PMC7392012 39. Bayik D Lathia JD Cancer stem cell-immune cell crosstalk in tumour progression Nat Rev Cancer 2021 21 8 526 36 10.1038/s41568-021-00366-w 34103704 PMC8740903 Bayik D, Lathia JD. Cancer stem cell-immune cell crosstalk in tumour progression. Nat Rev Cancer. 2021;21(8):526–36. 34103704 10.1038/s41568-021-00366-w PMC8740903 40. Liu Y Wu W Cai C Zhang H Shen H Han Y Patient-derived xenograft models in cancer therapy: technologies and applications Signal Transduct Target Ther 2023 8 1 160 10.1038/s41392-023-01419-2 37045827 PMC10097874 Liu Y, Wu W, Cai C, Zhang H, Shen H, Han Y. Patient-derived xenograft models in cancer therapy: technologies and applications. Signal Transduct Target Ther. 2023;8(1):160. 37045827 10.1038/s41392-023-01419-2 PMC10097874 41. Dong J Li J Li Y Ma Z Yu Y Wang CY Transcriptional super-enhancers control cancer stemness and metastasis genes in squamous cell carcinoma Nat Commun 2021 12 1 3974 10.1038/s41467-021-24137-1 34172737 PMC8233332 Dong J, Li J, Li Y, Ma Z, Yu Y, Wang CY. Transcriptional super-enhancers control cancer stemness and metastasis genes in squamous cell carcinoma. Nat Commun. 2021;12(1):3974. 34172737 10.1038/s41467-021-24137-1 PMC8233332 42. Chu X Tian W Ning J Xiao G Zhou Y Wang Z Cancer stem cells: advances in knowledge and implications for cancer therapy Signal Transduct Target Ther 2024 9 1 170 10.1038/s41392-024-01851-y 38965243 PMC11224386 Chu X, Tian W, Ning J, Xiao G, Zhou Y, Wang Z, et al. Cancer stem cells: advances in knowledge and implications for cancer therapy. Signal Transduct Target Ther. 2024;9(1):170. 38965243 10.1038/s41392-024-01851-y PMC11224386 43. Xue Q Liu Z Feng Z Xu Y Zuo W Wang Q Penfluridol: an antipsychotic agent suppresses lung cancer cell growth and metastasis by inducing G0/G1 arrest and apoptosis Biomed Pharmacother 2020 121 109598 10.1016/j.biopha.2019.109598 31733572 Xue Q, Liu Z, Feng Z, Xu Y, Zuo W, Wang Q, et al. Penfluridol: an antipsychotic agent suppresses lung cancer cell growth and metastasis by inducing G0/G1 arrest and apoptosis. Biomed Pharmacother. 2020;121:109598. 31733572 10.1016/j.biopha.2019.109598 44. Mroz RM Schins RP Li H Jimenez LA Drost EM Holownia A Nanoparticle-driven DNA damage mimics irradiation-related carcinogenesis pathways Eur Respir J 2008 31 2 241 51 10.1183/09031936.00006707 18057054 Mroz RM, Schins RP, Li H, Jimenez LA, Drost EM, Holownia A, et al. Nanoparticle-driven DNA damage mimics irradiation-related carcinogenesis pathways. Eur Respir J. 2008;31(2):241–51. 18057054 10.1183/09031936.00006707 45. Collins A Moller P Gajski G Vodenkova S Abdulwahed A Anderson D Measuring DNA modifications with the comet assay: a compendium of protocols Nat Protoc 2023 18 3 929 89 10.1038/s41596-022-00754-y 36707722 PMC10281087 Collins A, Moller P, Gajski G, Vodenkova S, Abdulwahed A, Anderson D, et al. Measuring DNA modifications with the comet assay: a compendium of protocols. Nat Protoc. 2023;18(3):929–89. 36707722 10.1038/s41596-022-00754-y PMC10281087 46. Holden L Curley RC Avella G Long C Keyes TE Targeting mitochondrial guanine quadruplexes for photoactivatable chemotherapy in hypoxic environments Angew Chem Int Ed Engl 2024 63 41 e202408581 10.1002/anie.202408581 39012206 Holden L, Curley RC, Avella G, Long C, Keyes TE. Targeting mitochondrial guanine quadruplexes for photoactivatable chemotherapy in hypoxic environments. Angew Chem Int Ed Engl. 2024;63(41):e202408581. 39012206 10.1002/anie.202408581 47. Decout A Katz JD Venkatraman S Ablasser A The cGAS-STING pathway as a therapeutic target in inflammatory diseases Nat Rev Immunol 2021 21 9 548 69 10.1038/s41577-021-00524-z 33833439 PMC8029610 Decout A, Katz JD, Venkatraman S, Ablasser A. The cGAS-STING pathway as a therapeutic target in inflammatory diseases. Nat Rev Immunol. 2021;21(9):548–69. 33833439 10.1038/s41577-021-00524-z PMC8029610 48. Wang Y Luo J Alu A Han X Wei Y Wei X cGAS-STING pathway in cancer biotherapy Mol Cancer 2020 19 1 136 10.1186/s12943-020-01247-w 32887628 PMC7472700 Wang Y, Luo J, Alu A, Han X, Wei Y, Wei X. cGAS-STING pathway in cancer biotherapy. Mol Cancer. 2020;19(1):136. 32887628 10.1186/s12943-020-01247-w PMC7472700 49. Kwon J Bakhoum SF The cytosolic DNA-Sensing cGAS-STING pathway in cancer Cancer Discov 2020 10 1 26 39 10.1158/2159-8290.CD-19-0761 31852718 PMC7151642 Kwon J, Bakhoum SF. The cytosolic DNA-Sensing cGAS-STING pathway in cancer. Cancer Discov. 2020;10(1):26–39. 31852718 10.1158/2159-8290.CD-19-0761 PMC7151642 50. Alvarado AG Thiagarajan PS Mulkearns-Hubert EE Silver DJ Hale JS Alban TJ Glioblastoma cancer stem cells evade innate immune suppression of Self-Renewal through reduced TLR4 expression Cell Stem Cell 2017 20 4 450 61 10.1016/j.stem.2016.12.001 28089910 PMC5822422 Alvarado AG, Thiagarajan PS, Mulkearns-Hubert EE, Silver DJ, Hale JS, Alban TJ, et al. Glioblastoma cancer stem cells evade innate immune suppression of Self-Renewal through reduced TLR4 expression. Cell Stem Cell. 2017;20(4):450–61. e4. 28089910 10.1016/j.stem.2016.12.001 PMC5822422 51. Elewaut A Estivill G Bayerl F Castillon L Novatchkova M Pottendorfer E Cancer cells impair monocyte-mediated T cell stimulation to evade immunity Nature 2025 637 8046 716 25 10.1038/s41586-024-08257-4 39604727 PMC7617236 Elewaut A, Estivill G, Bayerl F, Castillon L, Novatchkova M, Pottendorfer E, et al. Cancer cells impair monocyte-mediated T cell stimulation to evade immunity. Nature. 2025;637(8046):716–25. 39604727 10.1038/s41586-024-08257-4 PMC7617236 52. Du X, Lu X, Cao X. Gantt chart for updated OS and PFS after cancer targeted therapy. Innov Med. 2023;1(1). 53. Ziyue Gu Y Yao G Yang G Zhu Z Tian R Wang Pharmacogenomic landscape of head and neck squamous cell carcinoma informs precision oncology therapy Sci Transl Med 2022 14 661 eabo5987 10.1126/scitranslmed.abo5987 36070368 Ziyue Gu Y, Yao G, Yang G, Zhu Z, Tian R, Wang, et al. Pharmacogenomic landscape of head and neck squamous cell carcinoma informs precision oncology therapy. Sci Transl Med. 2022;14(661):eabo5987. 36070368 10.1126/scitranslmed.abo5987 54. Wang T, Wang Z. Targeting the undruggable: Small-Molecule inhibitors of proliferating cell nuclear antigen (PCNA) in the spotlight in cancer therapy. J Med Chem. 2025. 10.1021/acs.jmedchem.4c00526 39904718 55. Zanella ER Grassi E Trusolino L Towards precision oncology with patient-derived xenografts Nat Rev Clin Oncol 2022 19 11 719 32 10.1038/s41571-022-00682-6 36151307 Zanella ER, Grassi E, Trusolino L. Towards precision oncology with patient-derived xenografts. Nat Rev Clin Oncol. 2022;19(11):719–32. 36151307 10.1038/s41571-022-00682-6 56. Yoshida GJ Applications of patient-derived tumor xenograft models and tumor organoids J Hematol Oncol 2020 13 1 4 10.1186/s13045-019-0829-z 31910904 PMC6947974 Yoshida GJ. Applications of patient-derived tumor xenograft models and tumor organoids. J Hematol Oncol. 2020;13(1):4. 31910904 10.1186/s13045-019-0829-z PMC6947974 57. Zhang M Hoyle RG Ma Z Sun B Cai W Cai H FOSL1 promotes metastasis of head and neck squamous cell carcinoma through super-enhancer-driven transcription program Mol Ther 2021 29 8 2583 600 10.1016/j.ymthe.2021.03.024 33794365 PMC8353207 Zhang M, Hoyle RG, Ma Z, Sun B, Cai W, Cai H, et al. FOSL1 promotes metastasis of head and neck squamous cell carcinoma through super-enhancer-driven transcription program. Mol Ther. 2021;29(8):2583–600. 33794365 10.1016/j.ymthe.2021.03.024 PMC8353207 58. Quah HS Cao EY Suteja L Li CH Leong HS Chong FT Single cell analysis in head and neck cancer reveals potential immune evasion mechanisms during early metastasis Nat Commun 2023 14 1 1680 10.1038/s41467-023-37379-y 36973261 PMC10042873 Quah HS, Cao EY, Suteja L, Li CH, Leong HS, Chong FT, et al. Single cell analysis in head and neck cancer reveals potential immune evasion mechanisms during early metastasis. Nat Commun. 2023;14(1):1680. 36973261 10.1038/s41467-023-37379-y PMC10042873 59. Elmusrati A Wang J Wang CY Tumor microenvironment and immune evasion in head and neck squamous cell carcinoma Int J Oral Sci 2021 13 1 24 10.1038/s41368-021-00131-7 34341329 PMC8329257 Elmusrati A, Wang J, Wang CY. Tumor microenvironment and immune evasion in head and neck squamous cell carcinoma. Int J Oral Sci. 2021;13(1):24. 34341329 10.1038/s41368-021-00131-7 PMC8329257 60. Zhang D Tang DG Rycaj K Cancer stem cells: regulation programs, immunological properties and immunotherapy Sem Cancer Biol 2018 52 94 106 10.1016/j.semcancer.2018.05.001 PMC7859848 29752993 Zhang D, Tang DG, Rycaj K. Cancer stem cells: regulation programs, immunological properties and immunotherapy. Sem Cancer Biol. 2018;52:94–106. 10.1016/j.semcancer.2018.05.001 PMC7859848 29752993 61. de Ruiter EJ Ooft ML Devriese LA Willems SM The prognostic role of tumor infiltrating T-lymphocytes in squamous cell carcinoma of the head and neck: A systematic review and meta-analysis Oncoimmunology 2017 6 11 e1356148 10.1080/2162402X.2017.1356148 29147608 PMC5674970 de Ruiter EJ, Ooft ML, Devriese LA, Willems SM. The prognostic role of tumor infiltrating T-lymphocytes in squamous cell carcinoma of the head and neck: A systematic review and meta-analysis. Oncoimmunology. 2017;6(11):e1356148. 29147608 10.1080/2162402X.2017.1356148 PMC5674970 62. Pezone A Olivieri F Napoli MV Procopio A Avvedimento EV Gabrielli A Inflammation and DNA damage: cause, effect or both Nat Rev Rheumatol 2023 19 4 200 11 10.1038/s41584-022-00905-1 36750681 Pezone A, Olivieri F, Napoli MV, Procopio A, Avvedimento EV, Gabrielli A. Inflammation and DNA damage: cause, effect or both. Nat Rev Rheumatol. 2023;19(4):200–11. 36750681 10.1038/s41584-022-00905-1 63. Klapp V Alvarez-Abril B Leuzzi G Kroemer G Ciccia A Galluzzi L The DNA damage response and inflammation in cancer Cancer Discov 2023 13 7 1521 45 10.1158/2159-8290.CD-22-1220 37026695 Klapp V, Alvarez-Abril B, Leuzzi G, Kroemer G, Ciccia A, Galluzzi L. The DNA damage response and inflammation in cancer. Cancer Discov. 2023;13(7):1521–45. 37026695 10.1158/2159-8290.CD-22-1220 64. Jiang M Jia K Wang L Li W Chen B Liu Y Alterations of DNA damage response pathway: biomarker and therapeutic strategy for cancer immunotherapy Acta Pharm Sin B 2021 11 10 2983 94 10.1016/j.apsb.2021.01.003 34729299 PMC8546664 Jiang M, Jia K, Wang L, Li W, Chen B, Liu Y, et al. Alterations of DNA damage response pathway: biomarker and therapeutic strategy for cancer immunotherapy. Acta Pharm Sin B. 2021;11(10):2983–94. 34729299 10.1016/j.apsb.2021.01.003 PMC8546664 65. Dvorkin S Cambier S Volkman HE Stetson DB New frontiers in the cGAS-STING intracellular DNA-sensing pathway Immunity 2024 57 4 718 30 10.1016/j.immuni.2024.02.019 38599167 PMC11013568 Dvorkin S, Cambier S, Volkman HE, Stetson DB. New frontiers in the cGAS-STING intracellular DNA-sensing pathway. Immunity. 2024;57(4):718–30. 38599167 10.1016/j.immuni.2024.02.019 PMC11013568 ",
  "metadata": {
    "Title of this paper": "New frontiers in the cGAS-STING intracellular DNA-sensing pathway",
    "Journal it was published in:": "Stem Cell Research & Therapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482506/"
  }
}