{
  "title": "Paper_1226",
  "abstract": "pmc Metabolites Metabolites 2273 metabolites metabolites Metabolites 2218-1989 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472154 PMC12472154.1 12472154 12472154 41002983 10.3390/metabo15090599 metabolites-15-00599 1 Article Dietary Intervention with Cottonseed and Olive Oil Differentially Affect the Circulating Lipidome and Immunoregulatory Compounds—A Randomized Clinical Trial Cooper Gwendolyn Methodology Software Validation Formal analysis Investigation Data curation Writing – original draft Writing – review & editing 1 https://orcid.org/0009-0003-4809-8895 Bhattarai Prabina Methodology Validation Investigation Data curation Writing – review & editing 2 Sather Brett Methodology Data curation Writing – review & editing 1 https://orcid.org/0009-0002-9982-8117 Bailey Marguerite L. 1 Chamberlin Morgan 2 https://orcid.org/0000-0002-2147-3777 Miles Mary Conceptualization Resources Writing – review & editing Supervision Project administration Funding acquisition 2 * https://orcid.org/0000-0003-1295-9609 Bothner Brian Conceptualization Resources Writing – review & editing Supervision Project administration Funding acquisition 2 * Martinez-Martin MJ Pilar Academic Editor Lloyd Amanda J. Academic Editor 1 gwendolyncooper@montana.edu brettsather@montana.edu marguerite.bailey@student.montana.edu 2 prabina.bhattarai@student.montana.edu mchamberlin1@billingsclinic.org * mmiles@montana.edu bbothner@montana.edu 08 9 2025 9 2025 15 9 497655 599 11 7 2025 28 8 2025 29 8 2025 08 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods Results Conclusions metabolomics lipidomics cottonseed oil dietary intervention Cotton Incorporated #22-070 Funding for the clinical trial was provided by Cotton Incorporated grant #22-070. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cardiovascular disease (CVD) is a multifactorial condition that is the leading cause of death and chronic disability in the world [ 1 2 2 3 4 3 4 5 6 7 8 Fatty acids are long-chain lipids with a variety of biological roles. Fatty acids act as the main structural components within membranes and can also be utilized for energy production and cellular signaling [ 9 10 11 11 12 Diets high in n-6 PUFAs are traditionally associated with inflammation [ 13 14 13 14 15 16 14 17 18 19 20 Cottonseed oil (CSO) is a dietary oil especially high in the n-6 PUFA linoleic acid (18:2), for which the health impacts have not been adequately elucidated. Curiously, diets rich in CSO fed to rats resulted in an overall decrease in HDL cholesterol, despite an increase in saturated fats in the adipose tissue [ 21 22 23 24 25 To clarify the impact of CSO consumption, recent studies have re-examined the pro-inflammatory effects of n-6 PUFAs, particularly linoleic acid (LA). For example, mice fed high SFA, MUFA, and high-fat diets for 4 weeks had increased pro-inflammatory markers in the liver and adipose tissue; however, mice on a diet high in LA for four weeks did not have any significant changes in inflammatory or pro-coagulant markers in epididymal fat, liver, or plasma [ 26 27 The LA, and thereby CSO paradox is well documented in murine models and humans; however, the mechanism responsible remains a mystery. A particular gap in knowledge is the effect of CSO on the metabolomic and lipidomic profiles of humans. The biochemical actions of metabolites and lipids are far reaching and provide direct insight into cellular functions such as signal transduction, energy storage and production, immune regulation, and cellular health [ 28 29 30 31 32 33 34 The aim of this study was to compare the metabolic response of a four-week dietary intervention of high- and low-dose CSO versus OO on healthy adults via multi-omic analyses. We hypothesized that a 4-week intervention of CSO and OO will result in significant differences in the global metabolome and lipidome, as well as differences in metabolized products of arachidonic and linoleic acid. Untargeted and targeted metabolomic analyses were performed in tandem to provide a comprehensive representation of changes induced by the dietary interventions. To our understanding, this is the first study examining the effects of CSO and OO dietary interventions on the circulating lipidome and metabolome of healthy adults. This type of analysis demonstrates how CSO and OO dietary interventions impact the small molecule profile of healthy adults and how these data can be utilized to uncover the complexities of food intake on human physiology. 2. Materials and Methods 2.1. Study Population Study participants were recruited in Bozeman, Montana (MT), from August 2022 to November 2023. Inclusion criteria required participants to be between the ages of 18 and 55 years old, with a body mass index of 18–27 kg/m 2 35 36 37 2.2. Experimental Design This study was a randomized, double-blind, parallel clinical trial with four conditions: high-dose cottonseed oil, low-dose cottonseed oil, high-dose olive oil, and low-dose olive oil. The USDA Dietary Guideline for Americans recommends 27 g of oil per 2000 kcal for healthy adults [ 38 NCT05439590 Participants came to the Nutrition Research Laboratory on three occasions for testing. During the first visit, informed consent was reviewed and obtained prior to completing general health questionnaires and anthropometric measurements. At visit two, anthropometric measurements and fasting blood samples were collected. At the end of the second visit, participants were randomized to one of the four diet arms and provided accompanying diet guidelines to follow during the 4-week intervention period. Participants then returned to the lab for repeated testing during the third visit. See Figure S1 Figure S2 The R package, Gpower (version 3.1), was utilized to calculate the power a posteriori. A total sample size of 47–48 participants was determined to detect a medium effect size using repeated-measures ANOVA with 79–80% power for detecting changes in total cholesterol levels. 2.3. Dietary Intervention and Adherence A randomized protocol assigned participants to one of the four experimental groups. Block randomization was performed using the blockrand function in R (version 1.5). Researchers, volunteers, and clinical staff participating in data collection were blinded to condition assignments at visit 2. Allocation sequence was determined by a third party. The participants were asked to consume two doses of smoothies—one mango-flavored and one chocolate-flavored every day during the 4-week intervention period (28–30 days) containing 30 g or 60 g of CSO or OO based on group assignment. Participants were asked to consume two smaller smoothies a day rather than one large smoothie in order to avoid issues with consuming too much in one sitting, i.e., 800 kcal and 60 g of fat in one sitting do not appropriately mimic fat intake across multiple meals a day. A registered dietician designed and prepared the study smoothies. Smoothie flavors within each dosing regimen were matched for protein, carbohydrate, fat, and calorie content. For example, both the 30 g CSO and the 30 g OO chocolate-flavored smoothies contained 3.81 g of protein. While the protein content of mango and chocolate smoothies differed by a small amount, participants had one of each flavor daily to ensure that the protein from smoothies was the same within each oil dose per day. Two flavors were included in this study to provide some variety and increase compliance. Detailed information on the nutritional composition of the smoothies can be found in Supplementary Table S1 Adherence to smoothie consumption was monitored during smoothie pick-ups, which occurred once per week or every two weeks, depending on participant preference. The researchers recorded the type and number of smoothies consumed by participants every week. Participants were excluded from the analysis if adherence failures exceeded one day. 2.4. Blood Sample Collection Prior to visits two and three, the participants fasted and avoided strenuous activity for 12 h and alcohol consumption for 24 h. A standard venipuncture technique, performed by a phlebotomist or medical doctor, from an antebrachial vein was used for blood collection. Briefly, the skin was cleaned using an alcohol swab, and blood was collected through a single-use needle into vacutainer tubes. Blood markers, including total cholesterol (TC), high-density lipoprotein cholesterol (HDL), low-density lipoprotein cholesterol (LDL), glucose (GLU), and triglycerides (TG), were measured using whole blood collected in heparin tubes on a Picollo Xpress Chemistry Analyzer lipid panel (Abaxis, Union City, CA, USA). Plasma was frozen at –80 °C until subsequent mass spectrometry and cytokine analyses, respectively. An Ella Automated Immunoassay system (BioTechne, USA) was utilized to measure interleukin 1-beta (IL-1β), interleukin-6 (IL-6), interleukin-8 (IL-8), interleukin-10 (IL-10), tumor necrosis factor alpha (TNF-alpha), interferon-gamma (IFNg), and interleukin-1 receptor alpha (IL-1Ra). Segmental multifrequency bioelectrical impendence analysis (Seca mBCA 515, Hamburg, Germany) was utilized to assess anthropometrics. General linear models, including ANOVA and two-tailed t-tests, were used to assess any potential differences in the basic lipid panel and inflammatory markers between CSO and OO groups. 2.5. Fatty Acid Analysis of Oil Samples via Mass Spectrometry To determine the fatty acid composition of the oils, a fatty acid methyl esterification (FAME) protocol was followed. Concentrated HCl was diluted with methanol (35%, w/w) to make methanolic HCl. This was diluted to a final concentration of 85% methanol and 15% water (v/v). An amount of 2 mL of the methanolic HCl was added to 100 µL of each oil sample. The samples were then vortexed for 30 s and placed in an incubator set to 37 °C overnight to ensure complete esterification of the fatty acids. After cooling to room temperature, 1 mL of hexanes and 1 mL of water was added. The samples were vortexed briefly and left for 5 min to allow for phase separation to occur. The top layer containing the FAMEs was extracted and then dried down using N 2 An Agilent 7890A/5975C XL GC-MS system, equipped with an HP-5MS 5% phenyl methyl siloxane column (Agilent) and an Agilent 7693 autosampler, was utilized for analysis of FAMEs extracted from the oils. The 20 min method began with an oven temperature of 45 °C and was increased by 20 °C/min until a final temperature of 325 °C was reached. The obtained data were analyzed using Agilent Mass Hunter (10.0). National Institute of Standards and Technology (NIST) library version 11 and an in-house library were utilized and cross-referenced for the identification of mass spectra collected. Peak integration and the subsequent area under the curve (AUC) were calculated using a combination of Agilent Mass hunter software (version 12.1) and manual peak verifications. 2.6. Untargeted Metabolomic Analysis of Plasma To extract plasma metabolites and precipitate proteins, 100 µL of plasma was added to 400 µL of cold acetone. The samples were then placed at −80 °C overnight. To isolate the metabolites from proteins and other macromolecules, the samples were centrifuged at 16,100× g Following metabolite extraction, all samples were analyzed by liquid chromatography–mass spectrometry (LC-MS) using a Waters Acquity UPLC coupled through an electrospray ionization source to a Waters Synapt XS. A Cogent Diamond Hydride HILIC column (150 × 2.1 mm) at a flow rate of 400 µL/min was used to separate the metabolites. Solvent A was 95% water 5% acetonitrile with 0.1% formic acid, and solvent B was 95% acetonitrile 5% water with 0.1% formic acid. The 19 min elution gradient decreased from 95% to 25% solvent B over 12 min, followed by a 5 min wash of 25% solvent B. Each run began with 2 min of washing. Blanks and pooled samples were injected every 10 samples throughout the run to track spectral drift and to assess LCMS performance. All samples underwent standard MS1 and the pooled samples underwent liquid chromatography–tandem mass spectrometry (LC-MS/MS) with a constant energy ramp of 20–50 V. MS E Data processing, including peak picking and alignment, was conducted utilizing Water’s Progenesis QI software, v.2.3 (Nonlinear Dynamics, Newcastle, UK). Progenesis and an in-house metabolite library (Mass Spectrometry Library of Standards, IORA Technologies, Ann Arbor, MI, USA) were utilized for metabolite annotations. The Human Metabolome Database, ChemSpider, and the in-house metabolite library were used for comparing acquired and theoretical fragmentation of MS/MS data. Multivariate statistical analysis was performed using MetaboAnalyst 6.0 https://www.metaboanalyst.ca/home.xhtml 39 2.7. Targeted Lipid Mediator (LM) and Total Bulk Lipidomic (TBL) Analyses For all LCMS methods LCMS grade solvents were used. An amount of 250 µL aliquots of each plasma sample were immersed in 250 µL of ice-cold methanol. Following this, 250 µL of water and 400 µL of chloroform were added. Samples were shaken for 20 min at 4 °C, then centrifuged at 16,000× g Oxidized lipid mediators (LMs) were analyzed using the same MRMs as previously described but without solid phase extraction [ 40 Bulk lipidomics was performed as previously described [ 41 All lipidomic and LM signals were processed and integrated using SciexOS 3.1 (AB Sciex Pte. Ltd.). Signals with greater than 50% missing values for a specific tissue set were discarded and the remaining missing values were replaced with the lowest registered signal value. Signals with a QC coefficient of variance greater than 30% were discarded. Lipids and LMs with multiple MRMs were quantified with the higher signal-to-noise MRM. Filtered bulk lipidomics data were total-sum normalized after initial filtering. Multivariate statistical analysis was performed using MetaboAnalyst 6.0 https://www.metaboanalyst.ca/home.xhtml 2.8. Network Analysis To determine whether relationships existed among the lipids, LMs, and clinical covariates, a correlation-based network analysis was conducted. Correlation-based network analysis utilizes mathematically defined correlations to reflect the magnitude of similarity between variables in datasets [ 42 p p https://github.com/IDSS-NIAID/MetLipNet 43 3. Results 3.1. Participant Characteristics Between August 2022 and November 2023, a total of 163 adults were assessed for eligibility by completing a RedCAP survey, the AHA/ACSM Health/Fitness Facility Preparation Screening Questionnaire, and the PAR-Q+ questionnaire. Of the 163, 60 met the screening criteria and were invited to participate in this study. Of the 60 participants that enrolled, 13 withdrew from this study due to illness, lack of time, inability to drink smoothies, inability to follow dietary guidelines, or adverse events ( Figure S2 2 p p p p Table 1 3.2. Impact of CSO and OO on Global Metabolic Status To investigate metabolic changes induced by dietary interventions of high- and low-dose CSO and OO, an untargeted metabolomic analysis was conducted on the plasma samples from the participants. To analyze global changes in the entire small-molecule profile, an acetone crash was utilized to isolate small molecules from proteins. Metabolites were separated via HILIC chromatography prior to being analyzed in positive mode via mass spectrometry. In total, 2675 metabolomic features were detected in the experiment. A paired analysis, consisting of a delta change of metabolite intensity (intensity measured in pre dietary intervention subtracted from post intervention), was performed for all participants to determine the change induced by the diet. To better visualize the potential differences between the groups, principal component analysis (PCA) was conducted between the low-dose and high-dose oil groups. There was virtually no separation between any of the groups indicating that there was not a global change in the metabolomic profiles due to the dietary intervention ( Figure 1 Using a more targeted analysis of variance (ANOVA), 30 features changed significantly in abundance ( p Figure 1 3.3. Fatty Acid Composition of CSO and OO To determine the total fatty acid composition of the two dietary fats, a fatty acid methyl esterification (FAME) analysis on a GC-MS was performed. The dominant fatty acid in cottonseed oil was linoleic acid (FA 18:2), comprising 60% of the sample, followed by palmitic acid (FA 16:0) (28%), oleic acid (FA 18:1) (5%), stearic acid (FA 18:0) (2%), and palmitoleic acid (FA 16:1) (2%) ( Figure 2 Olive oil was predominantly composed of oleic acid, comprising 51% of the sample, followed by palmitic acid (26%), stearic acid (12%), squalene (8%), and palmitoleic acid (2%). These results agree with reported values [ 44 45 Figure S4 3.4. Impact of CSO and OO on Lipidomic Profiles Untargeted metabolomic analysis identified minor global differences in participant plasma samples, with relatively few features changing significantly ( Figure 1 Figure 1 After data filtering, 794 unique lipids were detected. Since the magnitude of a diet-induced change was expected to be larger in the high-dose CSO versus the high-dose OO groups, a pairwise t-test was performed to evaluate which lipids changed in response to the high oil intervention. A total of 50 lipids showed modest change between high-dose CSO and the high-dose OO ( p Figure S5 The acyl chain composition of phospholipid classes has biological significance, reflecting processes including lipid remodeling, modulation of membrane trafficking, and selective hydrolysis [ 46 47 Figure 2 Figure 2 3.5. Immunoregulatory Compounds Affected by Dietary CSO and OO Interventions To further probe changes in lipid profiles, specifically in bioactive lipids implicated in inflammatory and immunoregulatory processes, a targeted lipid mediator (LM) analysis was performed. In total, 65 LMs were detected in participant plasma ( Table S3 Figure 3 To parse out any potential differences in LM profiles induced by the dietary intervention, an ANOVA was performed. Two LMs changed significantly, 15-deoxy-PGJ2 and PGF2a, both of which increased in abundance in the CSO groups compared to the OO groups ( Figure 3 48 49 3.6. Correlations Between Oil Consumption, Clinical Measurements, and -Omics Data To determine if relationships existed between the general lipid pool, LMs, and the clinical covariates measured, a network analysis was performed. The relationships between covariates were formalized as a network where lipids, LMs, and clinical measurements corresponded to nodes. Nodes are connected by edges if a relationship exists between them. Correlation analysis is a powerful tool for identifying relationships in complex systems that may be missed by approaches such as ANOVA and hierarchical clustering [ 50 The network generated contained three clusters ( Figure S6 p Figure 4 Cluster 1 is dominated by positive correlations of triglycerides (TAGs), many of which have a linoleic acid acyl chain ( Figure 4 51 52 Figure 4 4. Discussion The results of this study reveal changes in the circulating lipidome and immunoregulatory compounds induced by a 4-week dietary intervention with CSO or OO. Interestingly, the global metabolome of the CSO participants was very similar to that of the OO participants, indicating that overall response is similar for both types of oil. One specific change observed was that plasma lipid acyl chain composition reflected 18:2, linoleic acid, if CSO was consumed, or 18:1, oleic acid, if OO was consumed. This is a clear indication that the fats consumed directly influence the pool of lipids in circulation. Network analysis revealed two clusters of variables that responded to the CSO and OO interventions: one descriptive of the bulk drivers of diet and one descriptive of the bulk drivers of the immune response. Together, these findings highlight the complexity of food systems and their impact on human metabolic status. 4.1. Metabolomic Profiles of CSO and OO Are Similar We found that the metabolomes of participants on low-dose and high-dose CSO and OO were very similar ( Figure 1 Table 1 Table S2 Other studies observing gross changes resulting from CSO interventions were conducted with relatively short intervention periods (5–7 days) [ 24 53 54 55 This study is the first of its kind to utilize an ultra-sensitive, global profiling technique to characterize human responses to 4-week dietary interventions with CSO and OO. By employing an untargeted metabolomics approach, we were able to determine that the metabolic response of the OO and CSO participants was relatively similar, with only minor differences being observed, primarily in lipid and lipid-like molecules ( Figure 1 4.2. Decreases in Clinically Relevant Lipids and Acyl Chain Composition Are Observed in CSO Participants After identifying subtle and interesting differences in the metabolome of the CSO and OO participants, we conducted a targeted bulk lipidomic analysis to determine if the changes were specific to the lipidome. Lysophosphatidylcholine (LPC) is a major phospholipid implicated in the induction and progression of atherosclerosis, is positively associated with cardiovascular and neurodegenerative diseases, and is an etiological factor in autoimmune diseases such as systemic lupus erythematosus [ 56 57 58 59 60 Figure S4 To further investigate lipidome-specific changes induced by CSO and OO interventions, the top 30 lipids identified via the ANOVA analysis ( Figure S4 61 Figure 2 The rapid effects on the circulating lipidome resulting from dietary oil supplementation demonstrated within this study also has implications for precision medicine. Several studies have emphasized the importance of tailoring personalized diets to acute metabolic responses to food intake [ 62 63 4.3. Immunoregulatory Lipids Are Differentially Affected by CSO and OO Given that CSO and OO lipidomes were distinguishable, and that the dominant PUFAs in the oils were either the pro-inflammatory omega-6 or the anti-inflammatory omega-3, we performed a targeted lipid mediator analysis on participant plasma to see if there were differences in these immunoregulatory lipid species. Surprisingly, there was little spontaneous variation observed in the PCAs ( Figure 3 64 65 64 66 The similarities in LM profiles between the n-6 rich CSO diet and the n-3 rich OO diet also demonstrates that a diet high in n-6 fatty acids is not inherently unhealthy. Traditionally, n-6 rich diets were thought to be unfavorable, since LA can be elongated to AA, which plays key roles in carcinogenesis, inflammatory diseases, and cardiovascular biology [ 67 68 69 Only two LMs, 15-deoxy-PGJ2 and PGF2a, changed significantly based on the one-way ANOVA analysis ( Figure 3 70 70 70 71 72 73 The effects of 15-deoxy-PGJ2 are less divisive, and this LM is widely reported to exert anti-inflammatory effects on numerous tissue and cell types [ 74 75 76 76 Figure 3 4.4. Bulk Drivers of Dietary Response and Immune Response Are Observed in Response to Interventions A network analysis was conducted to continue the investigation of how immunomodulatory lipids, circulating lipids, and clinical variables related to the dietary intervention. Network analysis provides a useful way to compare how components of a system interact or relate to one another. These interactions are driven by statistical analysis, to highlight associations between components [ 77 Figure 2 Figure 3 Figure S4 Figure 4 The network analysis highlighted two clusters of interest, indicating two different responses of the participants during the dietary intervention. Cluster 1 ( Figure 4 78 78 79 80 81 Network cluster 2 ( Figure 4 82 83 84 85 86 85 4.5. Limitations We acknowledge that there are additional factors and limitations of this study that must be addressed. Only healthy adults were allowed to participate, and therefore, the results discussed may not be applicable to individuals with increased metabolic risks or pre-existing metabolic perturbations (such as diabetes, hypercholesterolemia, etc.). In addition, the dietary instructions were quite strict and could have resulted in alterations in the daily eating habits of the participants. It is possible that alterations in the eating patterns of the participants could have impacted this study’s outcome measures. However, daily eating patterns were tracked via questionnaire both pre- and post-dietary intervention ( Supplementary Excel File Table S4 6 87 5. Conclusions In this study, we applied both untargeted and targeted metabolomics and lipidomics to track changes induced by dietary interventions with CSO and OO in healthy adults. Untargeted metabolomics revealed a large degree of similarity between the CSO and OO participants, suggesting that CSO may produce similar metabolic responses to OO in healthy adults. Targeted lipidomics revealed that the changes in the acyl chain composition are a direct reflection of the oil consumed. These results suggest that the acyl chain composition may represent a novel biomarker for fat intake. Lipid mediator analysis revealed changes in both pro- and anti-inflammatory LMs in response to high CSO consumption, suggesting that the “one size fits all” assumption about n-6 fatty acids may not be appropriate. Lastly, network analysis revealed subtle drivers of the dietary response and the immune response to the CSO and OO interventions. The primary outcomes of this study were the differential impacts of CSO and OO consumption on the lipid mediator and lipid profiles of healthy adults. The secondary outcomes were the targeted bulk lipidomic analysis, which was not initially planned but undertaken to more deeply explore the lipidome. Further analyses examining the effects of CSO supplementation on human physiology are necessary to pinpoint the mechanisms governing the impact of food intake on human health. Acknowledgments Funding for the Montana State Mass Spectrometry Facility (RRID: SCR_012482) used in this publication was made possible in part by the MJ Murdock Charitable Trust, the National Institute of General Medical Sciences of the National Institutes of Health under Award Numbers P20GM103474 and S10OD28650, and the MSU Office of Research and Economic Development. We thank the RTB team at Rocky Mountain Laboratories for consulting on this project. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/metabo15090599/s1 Figure 2 p Figure 4 Author Contributions Conceptualization, B.B. and M.M.; methodology, G.C., B.S., P.B., M.L.B. and M.C.; software, G.C., B.S. and M.L.B.; validation, G.C., B.B. and P.B.; formal analysis, G.C.; investigation, G.C. and P.B.; resources, B.B. and M.M.; data curation, G.C., B.S., P.B. and M.L.B.; writing—original draft preparation, G.C.; writing—review and editing, G.C., B.B., M.C., M.L.B., P.B., M.M. and B.B.; visualization, G.C.; supervision, M.M. and B.B.; project administration, M.M. and B.B.; funding acquisition, M.M. and B.B. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the Declaration of Helsinki and approved by the Institutional Review Board of Montana State University (protocol code 146, approved in 2022). Informed Consent Statement Informed consent was obtained from all subjects involved in this study. Data Availability Statement The raw data supporting the conclusions of this article will be made available by the authors on request. Conflicts of Interest The funders had no role in the design of this study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. References 1. Zarate S.M. Kirabo A. Hinton A.O. Santisteban M.M. Neuroimmunology of Cardiovascular Disease Curr. Hypertens. Rep. 2024 26 339 347 10.1007/s11906-024-01301-8 38613621 PMC11199253 2. Samuel P.O. Edo G.I. Emakpor O.L. Oloni G.O. Ezekiel G.O. Essaghah A.E.A. Agoh E. Agbo J.J. Lifestyle modifications for preventing and managing cardiovascular diseases Sports Sci. Health 2024 20 23 36 10.1007/s11332-023-01118-z 3. Widmer R.J. Flammer A.J. Lerman L.O. Lerman A. The Mediterranean Diet, its Components, and Cardiovascular Disease Am. J. Med. 2015 128 229 238 10.1016/j.amjmed.2014.10.014 25447615 PMC4339461 4. Davis C. Bryan J. Hodgson J. Murphy K. Definition of the Mediterranean Diet; A Literature Review Nutrients 2015 7 9139 9153 10.3390/nu7115459 26556369 PMC4663587 5. Hassen I. Casabianca H. Hosni K. Biological activities of the natural antioxidant oleuropein: Exceeding the expectation—A mini-review J. Funct. Foods 2015 18 926 940 10.1016/j.jff.2014.09.001 6. Lanza B. Ninfali P. Antioxidants in Extra Virgin Olive Oil and Table Olives: Connections between Agriculture and Processing for Health Choices Antioxidants 2020 9 41 10.3390/antiox9010041 31906540 PMC7023406 7. Parkinson L. Keast R. Oleocanthal, a phenolic derived from virgin olive oil: A review of the beneficial effects on inflammatory disease Int. J. Mol. Sci. 2014 15 12323 12334 10.3390/ijms150712323 25019344 PMC4139846 8. Kien C.L. Bunn J.Y. Tompkins C.L. Dumas J.A. Crain K.I. Ebenstein D.B. Koves T.R. Muoio D.M. Substituting dietary monounsaturated fat for saturated fat is associated with increased daily physical activity and resting energy expenditure and with changes in mood Am. J. Clin. Nutr. 2013 97 689 697 10.3945/ajcn.112.051730 23446891 PMC3607650 9. Cucchi D. Camacho-Munoz D. Certo M. Pucino V. Nicolaou A. Mauro C. Fatty acids—From energy substrates to key regulators of cell survival, proliferation and effector function Cell Stress. 2019 4 9 23 10.15698/cst2020.01.209 31922096 PMC6946016 10. Sokoła-Wysoczańska E. Wysoczański T. Wagner J. Czyż K. Bodkowski R. Lochyński S. Patkowska-Sokoła B. Polyunsaturated Fatty Acids and Their Potential Therapeutic Role in Cardiovascular System Disorders—A Review Nutrients 2018 10 1561 10.3390/nu10101561 30347877 PMC6213446 11. Kapoor B. Kapoor D. Gautam S. Singh R. Bhardwaj S. Dietary Polyunsaturated Fatty Acids (PUFAs): Uses and Potential Health Benefits Curr. Nutr. Rep. 2021 10 232 242 10.1007/s13668-021-00363-3 34255301 12. Saini R.K. Keum Y.-S. Omega-3 and omega-6 polyunsaturated fatty acids: Dietary sources, metabolism, and significance—A review Life Sci. 2018 203 255 267 10.1016/j.lfs.2018.04.049 29715470 13. Patterson E. Wall R. Fitzgerald G.F. Ross R.P. Stanton C. Health implications of high dietary omega-6 polyunsaturated Fatty acids J. Nutr. Metab. 2012 2012 539426 10.1155/2012/539426 22570770 PMC3335257 14. Mariamenatu A.H. Abdu E.M. Overconsumption of Omega-6 Polyunsaturated Fatty Acids (PUFAs) versus Deficiency of Omega-3 PUFAs in Modern-Day Diets: The Disturbing Factor for Their “Balanced Antagonistic Metabolic Functions” in the Human Body J. Lipids 2021 2021 8848161 10.1155/2021/8848161 33815845 PMC7990530 15. Corsinovi L. Biasi F. Poli G. Leonarduzzi G. Isaia G. Dietary lipids and their oxidized products in Alzheimer’s disease Mol. Nutr. Food Res. 2011 55 S161 S172 10.1002/mnfr.201100208 21954186 16. Delavar M.A. Lye M.S. Khor G.L. Hassan S.T. Hanachi P. Dietary patterns and the metabolic syndrome in middle aged women, Babol, Iran Asia Pac. J. Clin. Nutr. 2009 18 285 292 19713190 17. Innes J.K. Calder P.C. Omega-6 fatty acids and inflammation Prostaglandins Leukot. Essent. Fat. Acids 2018 132 41 48 10.1016/j.plefa.2018.03.004 29610056 18. Simopoulos A.P. DiNicolantonio J.J. The importance of a balanced ω-6 to ω-3 ratio in the prevention and management of obesity Open Heart 2016 3 e000385 10.1136/openhrt-2015-000385 27843563 PMC5093368 19. Albracht-Schulte K. Kalupahana N.S. Ramalingam L. Wang S. Rahman S.M. Robert-McComb J. Moustaid-Moussa N. Omega-3 fatty acids in obesity and metabolic syndrome: A mechanistic update J. Nutr. Biochem. 2018 58 1 16 10.1016/j.jnutbio.2018.02.012 29621669 PMC7561009 20. Ma C. Xu Z. Lv H. Low n/6/ n/3 PUFA ratio improves inflammation and myocardial ischemic reperfusion injury Biochem. Cell Biol. 2019 97 621 629 10.1139/bcb-2018-0342 31580709 21. Radcliffe J.D. Czajka-Narins D.M. Imrhan V. Fatty Acid Composition of Serum, Adipose Tissue, and Liver in Rats Fed Diets Containing Corn Oil or Cottonseed Oil Plant Foods Hum. Nutr. 2004 59 73 77 10.1007/s11130-004-0029-y 15678755 22. Radcliffe J.D. Czajka-Narins D.M. Lipids and Tocopherols in Serum and Liver of Female Rats Fed Diets Containing Corn Oil or Cottonseed Oil Plant Foods Hum. Nutr. 2006 61 33 36 10.1007/s11130-006-0011-y 16736386 23. Polley K.R. Oswell N.J. Pegg R.B. Paton C.M. Cooper J.A. A 5-day high-fat diet rich in cottonseed oil improves cholesterol profiles and triglycerides compared to olive oil in healthy men Nutr. Res. 2018 60 43 53 10.1016/j.nutres.2018.09.001 30527259 24. Davis K.E. Prasad C. Imrhan V. Consumption of a Diet Rich in Cottonseed Oil (CSO) Lowers Total and LDL Cholesterol in Normo-Cholesterolemic Subjects Nutrients 2012 4 602 610 10.3390/nu4070602 22852052 PMC3407983 25. Prater M.C. Scheurell A.R. Paton C.M. Cooper J.A. Blood Lipid Responses to Diets Enriched with Cottonseed Oil Compared With Olive Oil in Adults with High Cholesterol in a Randomized Trial J. Nutr. 2022 152 2060 2071 10.1093/jn/nxac099 35511204 PMC9449680 26. Vaughan R.A. Garrison R.L. Stamatikos A.D. Kang M. Cooper J.A. Paton C.M. A High Linoleic Acid Diet does not Induce Inflammation in Mouse Liver or Adipose Tissue Lipids 2015 50 1115 1122 10.1007/s11745-015-4072-2 26404455 27. Wu J.H.Y. Lemaitre R.N. King I.B. Song X. Psaty B.M. Siscovick D.S. Mozaffarian D. Circulating Omega-6 Polyunsaturated Fatty Acids and Total and Cause-Specific Mortality Circulation 2014 130 1245 1253 10.1161/CIRCULATIONAHA.114.011590 25124495 PMC4189990 28. Johnson C.H. Ivanisevic J. Siuzdak G. Metabolomics: Beyond biomarkers and towards mechanisms Nat. Rev. Mol. Cell Biol. 2016 17 451 459 10.1038/nrm.2016.25 26979502 PMC5729912 29. Gilroy D.W. Bishop-Bailey D. Lipid mediators in immune regulation and resolution Br. J. Pharmacol. 2019 176 1009 1023 10.1111/bph.14587 30674066 PMC6451072 30. Guasch-Ferré M. Bhupathiraju S.N. Hu F.B. Use of Metabolomics in Improving Assessment of Dietary Intake Clin. Chem. 2018 64 82 98 10.1373/clinchem.2017.272344 29038146 PMC5975233 31. Gika H. Virgiliou C. Theodoridis G. Plumb R.S. Wilson I.D. Untargeted LC/MS-based metabolic phenotyping (metabonomics/metabolomics): The state of the art J. Chromatogr. B 2019 1117 136 147 10.1016/j.jchromb.2019.04.009 31009899 32. Belhaj M.R. Lawler N.G. Hoffman N.J. Metabolomics and Lipidomics: Expanding the Molecular Landscape of Exercise Biology Metabolites 2021 11 151 10.3390/metabo11030151 33799958 PMC8001908 33. Carbone F. Bruzzaniti S. Fusco C. Colamatteo A. Micillo T. De Candia P. Bonacina F. Norata G.D. Matarese G. Metabolomics, Lipidomics, and Immunometabolism Methods in Molecular Biology Springer Berlin/Heidelberg, Germany 2021 319 328 10.1007/978-1-0716-1311-5_24 33928562 34. Jones D.P. Park Y. Ziegler T.R. Nutritional Metabolomics: Progress in Addressing Complexity in Diet and Health Annu. Rev. Nutr. 2012 32 183 202 10.1146/annurev-nutr-072610-145159 22540256 PMC4031100 35. Harris P.A. Taylor R. Minor B.L. Elliott V. Fernandez M. O’Neal L. McLeod L. Delacqua G. Delacqua F. Kirby J. The REDCap consortium: Building an international community of software platform partners J. Biomed. Inform. 2019 95 103208 10.1016/j.jbi.2019.103208 31078660 PMC7254481 36. Thompson P.D. Arena R. Riebe D. Pescatello L.S. ACSM’s New Preparticipation Health Screening Recommendations from ACSM’s Guidelines for Exercise Testing and Prescription, Ninth Edition Curr. Sports Med. Rep. 2013 12 215 217 10.1249/JSR.0b013e31829a68cf 23851406 37. Warburton D.E.R. Jamnik V.K. Bredin S.S.D. Gledhill N. The Physical Activity Readiness Questionnaire for Everyone (PAR-Q+) and Electronic Physical Activity Readiness Medical Examination (ePARmed-X+) Health Fit. J. Can. 2011 4 3 17 10.14288/hfjc.v4i2.103 38. USDA Dietary Guidelines for Americans, 2020–2025 USDA Washington, DC, USA 2020 39. Welhaven H.D. Vahidi G. Walk S.T. Bothner B. Martin S.A. Heveran C.M. June R.K. The Cortical Bone Metabolome of C57BL/6J Mice Is Sexually Dimorphic JBMR Plus 2022 6 e10654 10.1002/jbm4.10654 35866150 PMC9289981 40. Schwarz B. Roberts L.M. Bohrnsen E. Jessop F. Wehrly T.D. Shaia C. Bosio C.M. Contribution of Lipid Mediators in Divergent Outcomes following Acute Bacterial and Viral Lung Infections in the Obese Host J. Immunol. 2022 209 1323 1334 10.4049/jimmunol.2200162 36002235 PMC9529825 41. Schwarz B. Sharma L. Roberts L. Peng X. Bermejo S. Leighton I. Casanovas-Massana A. Minasyan M. Farhadian S. Ko A.I. Cutting Edge: Severe SARS-CoV-2 Infection in Humans Is Defined by a Shift in the Serum Lipidome, Resulting in Dysregulation of Eicosanoid Immune Mediators J. Immunol. 2021 206 329 334 10.4049/jimmunol.2001025 33277388 PMC7962598 42. Toubiana D. Sade N. Liu L. Rubio Wilhelmi M.d.M. Brotman Y. Luzarowska U. Vogel J.P. Blumwald E. Correlation-based network analysis combined with machine learning techniques highlight the role of the GABA shunt in Brachypodium sylvaticum freezing tolerance Sci. Rep. 2020 10 4489 10.1038/s41598-020-61081-4 32161322 PMC7066199 43. Csardi G.N.T. The Igraph Software Package for Complex Network Research 2006 Available online: https://igraph.org (accessed on 1 May 2025) 44. Yang A. Qi M. Wang X. Wang S. Sun L. Qi D. Zhu L. Duan Y. Gao X. Ali Rajput S. Refined cottonseed oil as a replacement for soybean oil in broiler diet Food Sci. Nutr. 2019 7 1027 1034 10.1002/fsn3.933 30918645 PMC6418425 45. Zhang Z. Tong Z. Shao Y. Su G. Li K. Li C. Comparing and Evaluating the Oil Composition of Olive Oil of 85 Olive Varieties in the Liangshan Region, China Agronomy 2024 14 304 10.3390/agronomy14020304 46. Vanni S. Riccardi L. Palermo G. De Vivo M. Structure and Dynamics of the Acyl Chains in the Membrane Trafficking and Enzymatic Processing of Lipids Acc. Chem. Res. 2019 52 3087 3096 10.1021/acs.accounts.9b00134 31364837 47. Barneda D. Janardan V. Niewczas I. Collins D.M. Cosulich S. Clark J. Stephens L.R. Hawkins P.T. Acyl chain selection couples the consumption and synthesis of phosphoinositides EMBO J. 2022 41 e110038 10.15252/embj.2021110038 35771169 PMC9475507 48. Basu S. Bioactive Eicosanoids: Role of Prostaglandin F2α and F2-Isoprostanes in Inflammation and Oxidative Stress Related Pathology Mol. Cells 2010 30 383 392 10.1007/s10059-010-0157-1 21113821 49. Scher J.U. Pillinger M.H. 15d-PGJ2: The anti-inflammatory prostaglandin? Clin. Immunol. 2005 114 100 109 10.1016/j.clim.2004.09.008 15639643 50. Becker M. Nassar H. Espinosa C. Stelzer I.A. Feyaerts D. Berson E. Bidoki N.H. Chang A.L. Saarunya G. Culos A. Large-scale correlation network construction for unraveling the coordination of complex biological systems Nat. Comput. Sci. 2023 3 346 359 10.1038/s43588-023-00429-y 38116462 PMC10727505 51. Biadgo B. Abebe S.M. Baynes H.W. Yesuf M. Alemu A. Abebe M. Correlation between Serum Lipid Profile with Anthropometric and Clinical Variables in Patients with Type 2 Diabetes Mellitus Ethiop. J. Health Sci. 2017 27 215 226 10.4314/ejhs.v27i3.3 29217920 PMC5614992 52. Ikezaki H. Lim E. Cupples L.A. Liu C.T. Asztalos B.F. Schaefer E.J. Small Dense Low-Density Lipoprotein Cholesterol Is the Most Atherogenic Lipoprotein Parameter in the Prospective Framingham Offspring Study J. Am. Heart Assoc. 2021 10 e019140 10.1161/JAHA.120.019140 33586462 PMC8174280 53. Catherine Prater M. Polley K.R. Cooper J.A. Improvements in markers of inflammation and coagulation potential following a 5-day high-fat diet rich in cottonseed oil vs. Olive oil in healthy males Cytokine 2024 175 156494 10.1016/j.cyto.2023.156494 38171039 54. Prater M.C. Scheurell A.R. Paton C.M. Cooper J.A. Metabolic responses to 8 weeks of consuming cottonseed oil versus olive oil in adults with dyslipidaemia: A randomised trial J. Hum. Nutr. Diet. 2023 36 1079 1089 10.1111/jhn.13085 36056703 55. Sergeant S. Rahbar E. Chilton F.H. Gamma-linolenic acid, Dihommo-gamma linolenic, Eicosanoids and Inflammatory Processes Eur. J. Pharmacol. 2016 785 77 86 10.1016/j.ejphar.2016.04.020 27083549 PMC4975646 56. Akerele O.A. Cheema S.K. Fatty acyl composition of lysophosphatidylcholine is important in atherosclerosis Med. Hypotheses 2015 85 754 760 10.1016/j.mehy.2015.10.013 26604024 57. Kabarowski J.H. G2A and LPC: Regulatory functions in immunity Prostaglandins Other Lipid Mediat. 2009 89 73 81 10.1016/j.prostaglandins.2009.04.007 19383550 PMC2740801 58. Schwenke D.C. Antioxidants and atherogenesis J. Nutr. Biochem. 1998 9 424 445 10.1016/S0955-2863(98)00046-1 59. Yamamoto Y. Sakurai T. Chen Z. Inoue N. Chiba H. Hui S.-P. Lysophosphatidylethanolamine Affects Lipid Accumulation and Metabolism in a Human Liver-Derived Cell Line Nutrients 2022 14 579 10.3390/nu14030579 35276938 PMC8839386 60. Laaksonen R. Ekroos K. Sysi-Aho M. Hilvo M. Vihervaara T. Kauhanen D. Suoniemi M. Hurme R. März W. Scharnagl H. Plasma ceramides predict cardiovascular death in patients with stable coronary artery disease and acute coronary syndromes beyond LDL-cholesterol Eur. Heart J. 2016 37 1967 1976 10.1093/eurheartj/ehw148 27125947 PMC4929378 61. Green C.R. Kolar M.J. McGregor G.H. Nelson A.T. Wallace M. Metallo C.M. Quantifying acyl-chain diversity in isobaric compound lipids containing monomethyl branched-chain fatty acids J. Lipid Res. 2024 65 100677 10.1016/j.jlr.2024.100677 39490922 PMC11621494 62. Berry S.E. Valdes A.M. Drew D.A. Asnicar F. Mazidi M. Wolf J. Capdevila J. Hadjigeorgiou G. Davies R. Al Khatib H. Human postprandial responses to food and potential for precision nutrition Nat. Med. 2020 26 964 973 10.1038/s41591-020-0934-0 32528151 PMC8265154 63. Eichelmann F. Prada M. Sellem L. Jackson K.G. Salas Salvadó J. Razquin Burillo C. Estruch R. Friedén M. Rosqvist F. Risérus U. Lipidome changes due to improved dietary fat quality inform cardiometabolic risk reduction and precision nutrition Nat. Med. 2024 30 2867 2877 10.1038/s41591-024-03124-1 38992128 PMC11485259 64. Meuronen T. Lankinen M.A. Fauland A. Shimizu B.-i. de Mello V.D. Laaksonen D.E. Wheelock C.E. Erkkilä A.T. Schwab U.S. Intake of Camelina Sativa Oil and Fatty Fish Alter the Plasma Lipid Mediator Profile in Subjects with Impaired Glucose Metabolism—A Randomized Controlled Trial Prostaglandins Leukot. Essent. Fat. Acids 2020 159 102143 10.1016/j.plefa.2020.102143 32512364 65. Irún P. Carrera-Lasfuentes P. Sánchez-Luengo M. Belio Ú. Domper-Arnal M.J. Higuera G.A. Hawkins M. de la Rosa X. Lanas A. Pharmacokinetics and Changes in Lipid Mediator Profiling after Consumption of Specialized Pro-Resolving Lipid-Mediator-Enriched Marine Oil in Healthy Subjects Int. J. Mol. Sci. 2023 24 6143 10.3390/ijms242216143 38003333 PMC10671020 66. Dasilva G. Lois S. Méndez L. Miralles-Pérez B. Romeu M. Ramos-Romero S. Torres J.L. Medina I. Fish Oil Improves Pathway-Oriented Profiling of Lipid Mediators for Maintaining Metabolic Homeostasis in Adipose Tissue of Prediabetic Rats Front. Immunol. 2021 12 608875 10.3389/fimmu.2021.608875 33968013 PMC8097180 67. Wang B. Wu L. Chen J. Dong L. Chen C. Wen Z. Hu J. Fleming I. Wang D.W. Metabolism pathways of arachidonic acids: Mechanisms and potential therapeutic targets Signal Transduct. Target. Ther. 2021 6 94 10.1038/s41392-020-00443-w 33637672 PMC7910446 68. Chowdhury R. Warnakula S. Kunutsor S. Crowe F. Ward H.A. Johnson L. Franco O.H. Butterworth A.S. Forouhi N.G. Thompson S.G. Association of dietary, circulating, and supplement fatty acids with coronary risk: A systematic review and meta-analysis Ann. Intern. Med. 2014 160 398 406 10.7326/M13-1788 24723079 69. Farvid M.S. Ding M. Pan A. Sun Q. Chiuve S.E. Steffen L.M. Willett W.C. Hu F.B. Dietary Linoleic Acid and Risk of Coronary Heart Disease: A Systematic Review and Meta-Analysis of Prospective Cohort Studies Circulation 2014 130 1568 1578 10.1161/CIRCULATIONAHA.114.010236 25161045 PMC4334131 70. Xiao L. De Jesus D.F. Ju C.W. Wei J.B. Hu J. DiStefano-Forti A. Tsuji T. Cero C. Männistö V. Manninen S.M. m(6)A mRNA methylation in brown fat regulates systemic insulin sensitivity via an inter-organ prostaglandin signaling axis independent of UCP1 Cell Metab. 2024 36 2207 2227.V2209 10.1016/j.cmet.2024.08.006 39255799 PMC11891809 71. Riaposova L. Kim S.H. Hanyaloglu A.C. Sykes L. MacIntyre D.A. Bennett P.R. Terzidou V. Prostaglandin F2α requires activation of calcium-dependent signalling to trigger inflammation in human myometrium Front. Endocrinol. 2023 14 1150125 10.3389/fendo.2023.1150125 37547305 PMC10400332 72. Janczura M. Gielicz A. Kotula-Horowitz K. Iwaniec T. Stanisz A. Rosa R. Dropinski J. Domagala T. Plasma but not urine 8-ISO-PGF2ALFA is a predictor of insulin resistance in the middle-aged subjects—An occupational, cohort-based study Atherosclerosis 2018 275 e63 10.1016/j.atherosclerosis.2018.06.173 73. Akour A. Farha R.A. Alefishat E. Kasabri V. Bulatova N. Insulin resistance and levels of cardiovascular biomarkers in night-shift workers Atherosclerosis 2020 315 e117 e118 10.1016/j.atherosclerosis.2020.10.359 74. Kim W. Jang J.-H. Zhong X. Seo H. Surh Y.-J. 15-Deoxy-Δ 12,14 2 Front. Immunol. 2021 12 615803 10.3389/fimmu.2021.615803 33633749 PMC7901909 75. Chiang K.-M. Chen J.-F. Yang C.-A. Xiu L. Yang H.-C. Shyur L.-F. Pan W.-H. Identification of Serum Oxylipins Associated with the Development of Coronary Artery Disease: A Nested Case-Control Study Metabolites 2022 12 495 10.3390/metabo12060495 35736428 PMC9231201 76. Katsumata Y. Shinmura K. Sugiura Y. Tohyama S. Matsuhashi T. Ito H. Yan X. Ito K. Yuasa S. Ieda M. Endogenous Prostaglandin D2 and Its Metabolites Protect the Heart Against Ischemia–Reperfusion Injury by Activating Nrf2 Hypertension 2014 63 80 87 10.1161/HYPERTENSIONAHA.113.01639 24101662 77. Jiang D. Armour C.R. Hu C. Mei M. Tian C. Sharpton T.J. Jiang Y. Microbiome Multi-Omics Network Analysis: Statistical Considerations, Limitations, and Opportunities Front. Genet. 2019 10 995 10.3389/fgene.2019.00995 31781153 PMC6857202 78. Borén J. Taskinen M.-R. Björnson E. Packard C.J. Metabolism of triglyceride-rich lipoproteins in health and dyslipidaemia Nat. Rev. Cardiol. 2022 19 577 592 10.1038/s41569-022-00676-y 35318466 79. Han F.Y. Conboy-Schmidt L. Rybachuk G. Volk H.A. Zanghi B. Pan Y. Borges K. Dietary medium chain triglycerides for management of epilepsy: New data from human, dog, and rodent studies Epilepsia 2021 62 1790 1806 10.1111/epi.16972 34169513 PMC8453917 80. Dimache A.M. Șalaru D.L. Sascău R. Stătescu C. The Role of High Triglycerides Level in Predicting Cognitive Impairment: A Review of Current Evidence Nutrients 2021 13 2118 10.3390/nu13062118 34203094 PMC8234148 81. Berezhnoy G. Bissinger R. Liu A. Cannet C. Schäfer H. Kienzle K. Bitzer M. Häberle H. Göpel S. Trautwein C. Maintained imbalance of triglycerides, apolipoproteins, energy metabolites and cytokines in long-term COVID-19 syndrome patients Front. Immunol. 2023 14 1144224 10.3389/fimmu.2023.1144224 37228606 PMC10203989 82. Arend W.P. Malyak M. Guthridge C.J. Gabay C. Interleukin-1 receptor antagonist: Role in biology Annu. Rev. Immunol. 1998 16 27 55 10.1146/annurev.immunol.16.1.27 9597123 83. Arend W.P. The balance between IL-1 and IL-1Ra in disease Cytokine Growth Factor. Rev. 2002 13 323 340 10.1016/S1359-6101(02)00020-5 12220547 84. McGillicuddy F.C. Harford K.A. Reynolds C.M. Oliver E. Claessens M. Mills K.H.G. Roche H.M. Lack of Interleukin-1 Receptor I (IL-1RI) Protects Mice From High-Fat Diet–Induced Adipose Tissue Inflammation Coincident With Improved Glucose Homeostasis Diabetes 2011 60 1688 1698 10.2337/db10-1278 21515850 PMC3114387 85. Luotola K. IL-1 Receptor Antagonist (IL-1Ra) Levels and Management of Metabolic Disorders Nutrients 2022 14 3422 10.3390/nu14163422 36014927 PMC9415765 86. Salomaa V. Havulinna A. Saarela O. Zeller T. Jousilahti P. Jula A. Muenzel T. Aromaa A. Evans A. Kuulasmaa K. Thirty-One Novel Biomarkers as Predictors for Clinically Incident Diabetes PLoS ONE 2010 5 e10100 10.1371/journal.pone.0010100 20396381 PMC2852424 87. Paton C.M. Vaughan R.A. Selen Alpergin E.S. Assadi-Porter F. Dowd M.K. Dihydrosterculic acid from cottonseed oil suppresses desaturase activity and improves liver metabolomic profiles of high-fat-fed mice Nutr. Res. 2017 45 52 62 10.1016/j.nutres.2017.06.008 29037332 Figure 1 Global multivariate statistics of untargeted metabolomics data. ( A B C p Figure 2 Lipidomic changes reflect the dominant lipid in the dietary oil. ( A B p Figure S3 Figure 3 Global multivariate statistics of lipid mediator data. ( A B C p p Figure 4 Network analysis of changes induced by CSO and OO interventions. ( A B C Figure S7 metabolites-15-00599-t001_Table 1 Table 1 Final participant baseline characteristics. Fasting glucose (mmol/L) and triglyceride (mmol/L) values are presented as the average fasting value from visits 2 and 3. Values are presented as a mean +/− standard deviation (SD). Participants Age (years) BMI (kg/m 2 WC (cm) VAT (L) Glucose (mmol/L) Triglycerides (mmol/L) All ( n 31.49 ± 11.83 23.13 ± 1.98 77.40 ± 7.67 0.71 ± 0.57 5.3 ± 0.4 0.93 ± 0.33 Male ( n 31.25 ± 12.25 23.58 ± 1.91 80.55 ± 6.86 0.95 ± 0.58 5.4 ± 0.4 1.01 ± 0.4 Female ( n 31.74 ± 11.38 22.66 ± 1.94 74.12 ± 7.07 0.46 ± 0.44 5.2 ± 0.3 0.84 ± 0.21 All 47 participants described were included in the metabolomic and lipidomic analyses. Additional participant characteristics can be found in Supplementary Table S2 ",
  "metadata": {
    "Title of this paper": "Dihydrosterculic acid from cottonseed oil suppresses desaturase activity and improves liver metabolomic profiles of high-fat-fed mice",
    "Journal it was published in:": "Metabolites",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472154/"
  }
}