{
  "title": "Paper_310",
  "abstract": "pmc BJUI Compass BJUI Compass 4162 bjuic BCO2 BJUI Compass 2688-4526 Wiley PMC12488251 PMC12488251.1 12488251 12488251 41040504 10.1002/bco2.70055 BCO270055 1 Original Article Original Article Real‐world clinical outcomes of oligometastatic prostate cancer using SBRT: An Australian experience Shekar et al. Shekar Samantha  1 samanthashekar@gmail.com Crumbaker Megan https://orcid.org/0000-0001-7213-900X  1  2 Joshua Anthony  1  2 Yam Andrew  1  2 Stricker Phillip  2  3 Yuen Carlo  4 Ende David  4 Namdarian Benjamin  4 Thompson James  4 Kooner Raji  4 O'Neill Gordon  4 Mo Jeremy  1  2 Sim Hao‐Wen https://orcid.org/0000-0002-2530-0523  1 Hruby George  5  6 Kasraei Farshad  5 Ho Annie  5 De Leon Jeremy  5   1 The Kinghorn Cancer Centre St Vincent's Hospital Darlinghurst NSW Australia   2 Garvan Institute of Medical Research Darlinghurst NSW Australia   3 St Vincent's Prostate Cancer Centre Darlinghurst NSW Australia   4 St Vincent's Hospital Darlinghurst NSW Australia   5 St Vincent's GenesisCare Darlinghurst NSW Australia   6 University of Sydney Camperdown NSW Australia * Correspondence samanthashekar@gmail.com 01 10 2025 10 2025 6 10 497544 10.1002/bco2.v6.10 e70055 18 5 2025 11 2 2025 23 6 2025 01 10 2025 02 10 2025 03 10 2025 © 2025 The Author(s). BJUI Compass https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Objectives This work aimed to report real‐world outcomes from the use of SBRT to treat ADT naïve, PSMA‐detected oligometastatic prostate cancer (OPCa) and to assess disease and treatment characteristics in this heterogeneous population intersect or impact treatment response. Subjects and Methods This retrospective single‐institution study examined PSMA‐PET–detected oligometastases ( n Results Sixty‐seven patients treated from January 2019 to August 2024 were analysed with a median follow‐up of 18.8 months. Ninety‐three oligometastatic lesions were treated; 55.3% were treated for nodal disease, 38.8% bone and 5% with lung disease. All lesions were PSMA‐detected with median SUVmax 6.3. Median bPFS was 22.1 m; TTNI was 28.8 m. Lower initial T stage and longer duration from OPCa diagnosis to MDT were associated with prolonged bPFS. Lower T stage and PSA doubling time >3 m at MDT were associated with prolonged time to PSA progression. Median PSA fall was 68.9%; PSA 50% response was observed in 55.2%. Twenty‐nine patients (43%) had a complete metabolic response after MDT. Median ADT‐free survival was not reached. Conclusions MDT in PSMA‐PET‐detected OPCa can provide clinically meaningful disease control in a subset of patients. This study supports this approach but warrants continued prospective study and exploration into the castrate‐resistant setting. MDT oligometastatic prostate cancer prostate cancer PSMA‐PET SBRT pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  Shekar S Crumbaker M Joshua A Yam A Stricker P Yuen C Real‐world clinical outcomes of oligometastatic prostate cancer using SBRT: An Australian experience BJUI Compass 2025 6 10 e70055 10.1002/bco2.70055 1 INTRODUCTION The oligometastatic hypothesis was first proposed by Hellman and Weichselbaum  1  2  1  3  4 Currently in oligometastatic prostate cancer, prospective trials of SBRT demonstrate sustained periods of disease‐free survival, prolonging time to initiation of ADT  5  6  7  5  5  7  7  8  8  5  8 Despite few prospective large‐scale studies, current evidence supports improvement of ADT‐free survival, local control and progression‐free survival. This has significant implications in reducing the toxicity burden of systemic therapies especially cardiometabolic events, enabling treatment breaks in those with cumulative side effects and enhancing QoL. At present, OPCa is defined based on the number of detectable lesions on conventional imaging. In an analysis of six original articles and 10 prospective trials, the majority limited the number of metastases included to up to five lesions with bone and lymph node metastases being commonly outlined when site‐specific criteria utilised.  9  10  11  2 We report real‐world data of PSMA‐PET detected, radiotherapy‐based MDT in OPCa to identify clinical characteristics associated with patient outcomes that may be used to refine patient selection for future MDT‐trials. 2 SUBJECTS AND METHODS 2.1 Study design and participants This is a retrospective study conducted at St Vincent's Hospital (Darlinghurst, Sydney, Australia). The study was approved by St Vincent's Hospital Human Research Ethics Committee (2021/ ETH11891 Men with histologically confirmed prostate cancer, PSMA‐PET/CT imaging consistent with oligometastatic disease (defined as fewer than five lesions) and considered appropriate for MDT with SBRT to metastatic lesions were included. All patients had previous definitive management of their primary prostate tumour with surgery or radiotherapy (salvage or adjuvant radiotherapy to the prostate bed or pelvis allowed) prior to MDT. Standard dosing and fractionation for SBRT of specific oligometastatic lesions were adopted. Patients could have received adjuvant ADT during definitive management or salvage treatment. A minimum follow‐up period of 6 weeks after each MDT course was required. Patients were typically reviewed every 3 to 6 months after MDT with repeat PSA and imaging repeated at 6‐ to‐12‐month intervals or earlier based on symptoms or change in PSA kinetics. Patients with castration‐resistance or that had received systemic therapy (including chemotherapy, androgen receptor pathway inhibitor or continuous androgen deprivation therapy) prior to oligometastatic treatment were excluded. Individuals without a minimum of 6 weeks' follow‐up data (PSA or imaging) were excluded. 2.2 Study measures Clinical data were obtained including age and PSA at prostate cancer (PC) diagnosis, Gleason score, primary tumour/nodal status/metastatic disease classification, treatment of primary tumour, use of ADT prior to MDT, SUVmax of treated lesions and the number and location of oligometastases. PSA kinetics including PSA at time of MDT and doubling time prior to, and post MDT were collected. Post‐treatment clinical data were obtained for site of recurrence and choice of treatment at subsequent distant progression. The primary outcome was biochemical progression free survival (bPFS) including events of interests such as PSA failure, start of systemic therapy (i.e., ADT) or death by any cause. As per The Prostate Cancer Trials Working Group 3 (PCWG3),  11  12 Secondary outcomes were time to PSA progression, time to next intervention defined as a change in therapy after SBRT (including repeat SBRT to oligometastases), PSA30/50/90 responses (PSA reduction of ≥30%, ≥50% and ≥90% from baseline following treatment), maximum PSA fall post MDT, PSA responses at 3/6/12 months, ADT‐free survival and local or distant failure rates. 2.3 Statistical analysis Demographic and clinical data were summarised using descriptive statistics for categorical and continuous variables. Survival analysis using the Kaplan–Meier method was conducted for median biochemical PFS (bPFS), time to next intervention and time to PSA progression. Time to event outcomes were censored if the event was not met or end of follow‐up was reached, whichever came first. Univariable Cox regression analysis was conducted to identify variables associated with bPFS, time to PSA progression and PSA50 response. Significant variables found to be associated on univariable analysis ( p 3 RESULTS 3.1 Patient, disease and treatment characteristics Sixty‐seven patients were identified and analysed. Table 1 TABLE 1 Baseline patient and disease characteristics. Characteristic ( n Value Age (year) at treatment, median (range) 75 (60–89) Initial PSA at diagnosis (ng/mL), median (range) 6.8 (1.4–34) Gleason score (%) 6 2 (3.1) 7 48 (73.8) 8–9 15 (23.1) Primary tumour classification (%) T2 33 (51.6) T3a/3b 31 (48.4) Node status at initial diagnosis (%) N0 31 (48.4) N1 9 (14.1) Nx/cN0 24 (37.5) Type of treatment at PC diagnosis (%) Radical prostatectomy 21 (31.3) Radical prostatectomy/salvage radiotherapy 31 (46.3) Radical prostatectomy/adjuvant radiotherapy 7 (10.4) Definitive radiotherapy/ADT 3 (4.5) Definitive radiotherapy 3 (4.5) Brachytherapy 2 (3) Salvage prostatectomy 2 (3) ADT during primary treatment (%) Yes 15 (22.4) No 52 (77.6) Indication for ADT commencement at primary treatment Adjuvant 8 (11.9) Concurrent with salvage radiotherapy 4 (6) Concurrent with definitive radiotherapy 3 (4.5) Testosterone recovery post ADT at primary treatment (%) Yes 14 (93.3) Unknown 1 (6.7) Abbreviations: ADT, androgen deprivation therapy; PC, prostate cancer; PSA, prostate‐specific antigen. Baseline treatment characteristics are reported in Table 2 TABLE 2 Baseline treatment characteristics. Characteristic ( n Value Time between diagnosis and MDT (month), median (range) 85.1 (1.7–266.6) Timing of MDT treatment (%) Synchronous 2 (3) Metachronous 65 (97) Number of metastases (%) 1 49 (73.1) 2 13 (19.4) 3 2 (3) 4 3 (4.5) Location metastases (%) M0 32 (47.8) M1a 5 (7.5) M1b 26 (38.8) M1c 4 (6) Treatment site (%) Pelvic lymph node 32 (47.8) Abdominal lymph node 5 (7.5) Bone 26 (38.8) Lung 4 (6) Type of radiotherapy (%) SBRT 39 (58.2) MRI‐Linac 28 (41.8) Staging imaging (%) PSMA‐PET or Bombesin 67 (100) Conventional 0 Follow‐up imaging Enhanced 36 (53.7) Conventional 4 (6) Abbreviations: ADT, androgen deprivation therapy; MDT, metastases‐directed therapy, MRI, magnetic resonance imaging; PC, prostate cancer; PSA, prostate‐specific antigen; PSMA‐PET, prostate‐specific membrane antigen positron emission tomography; RT, radiotherapy; SBRT, stereotactic radiotherapy. 3.2 PSA kinetics and response Median PSA prior to the first MDT was 0.59 ng/mL (0.03–10 ng/mL) with most PSA values ranging between 0.2 and 2.0 ng/mL (59.7%). Most patients (95.5%) had a PSA doubling time prior to MDT of greater than 3 months. This remained consistent post treatment with majority of patients (94%) still having a PSA doubling time of greater than 3 months. We found 60 patients (89.6%) had either PSA decline or stability post MDT. Of these 60 patients, all demonstrated a PSA response at 3 months, 48 (80%) at 6 months and 30 (50%) at 12 months. Forty‐eight patients (71.6%) achieved a PSA reduction of at least 30%, 37 patients (55.2%) of 50% and 18 patients (26.9%) of 90% or greater from baseline (Figure 1 p FIGURE 1 . Summary of PSA response levels. 3.3 Clinical outcomes Median follow‐up time was 18.8 months (range, 16.4–25.4 months). Median bPFS was 22.1 months (95% confidence interval [CI], 17.8 months—not reached; Figure 2A n 3 p 3 p n 3 3 FIGURE 2 (A) Biochemical progression‐free survival after radiotherapy. (B) Time to next intervention after radiotherapy. TABLE 3 Univariate and multivariate analyses of clinical factors. Univariate analysis for factors associated with bPFS, PSA50 response and time to PSA progression Characteristic HR (95% CI)  p  bPFS Age at diagnosis of oligometastatic disease 0.96(0.91–1.01) 0.13 T stage 0.02 T3 2.48(1.14–5.37) T2 0.4(0.19–0.87) Node status 0.22 N1 1.75(0.7–4.38) Nx/N0 0.57(0.23–1.43) M stage 0.49 M1 1.31(0.6–2.84) M0 0.76(0.35–1.65) Gleason score 0.26 8–9 1.52(0.72–3.19) 6–7 0.66(0.31–1.38) Location of treated oligometastases Node 0.57(0.27–1.23) 0.15 Bone 1.75(0.82–3.74) 0.15 Lung 0.28(0.04–2.18) 0.23 PSA doubling time prior to MDT 0.49 >3 months 0.6(0.14–2.61) <3 months 1.66(0.38–7.18) Baseline PSA at MDT initiation 0.97(0.81–1.16) 0.80 Time from diagnosis to MDT initiation 0.99(0.98–1.00) 0.03  PSA50 response Age at diagnosis of oligometastatic disease 1.03(0.98–1.08) 0.25 T stage 0.14 T3 0.56(0.26–1.21) T2 1.78(0.82–3.83) Node status 0.07 N1 0.19(0.02–1.39) Nx/N0 5.39(0.72–40.41) M stage 0.84 M1 1.22(0.16–9.13) M0 0.82(0.11–6.15) Gleason score 0.87 8–9 0.94(0.48–1.84) 6–7 1.06(0.54–2.07) Location of treated oligometastases Node 0.59(0.29–1.21) 0.15 Bone 1.7(0.83–3.5) 0.15 Lung 0.51(0.12–2.25) 0.38 PSA doubling time prior to MDT 0.87 >3 months 1.19(0.16–8.84) <3 months 0.84(0.11–6.22) Baseline PSA at MDT initiation 0.99(0.85–1.16) 0.93 Time from diagnosis to MDT initiation 0.99(0.985–0.999) 0.03  Time to PSA progression Age at diagnosis of oligometastatic disease 0.99(0.93–1.05) 0.68 T stage 0.02 T3 2.59(1.13–5.95) T2 0.39(0.17–0.89) Node status 0.96 N1 0.97(0.39–0.95) Nx/N0 1.03(0.41–2.59) M stage 0.93 M1 0.91(0.12–6.82) M0 1.1(0.15–8.33) Gleason score 0.89 8–9 1.05(0.49–2.26) 6–7 0.95(0.44–2.04) Location of treated oligometastases Node 0.54(0.24–1.2) 0.13 Bone 1.86(0.83–4.19) 0.13 Lung 0.88(0.11–6.92) 0.90 PSA doubling time prior to MDT < 0.001 >3 months 0.05(0.01–0.34) <3 months 21.21(2.94–153.94) Baseline PSA at MDT initiation 0.92(0.76–1.11) 0.39 Time from diagnosis to MDT initiation 0.997(0.989–1.00) 0.56 Multivariate analysis for factors associated with bPFS and time to PSA progression Characteristic HR (95% CI)  p  bPFS T stage 2.47(1.15–5.34) 0.02 Time to MDT 0.99(0.98–1.00) 0.06  Time to PSA progression T stage 2.38(1.02–5.57) 0.04 PSA doubling time prior to MDT 0.06(0.009–0.48) 0.007 Abbreviations: bPFS, biochemical progression‐free survival; CI, confidence interval; HR, hazard ratio; MDT, metastasis directed therapy; PSA, prostate specific antigen. FIGURE 3 (A) Nomogram for predicting bPFS. (B) Nomogram for predicting time to PSA progression. Ninety‐three lesions were detected on PSMA‐PET and subsequently treated. The median SUVmax of treated lesions was 6.3 (2.5–59.2). Of patients that had follow‐up imaging post MDT, 29 (43%) patients had a complete metabolic response. The 26 patients (39%) that did not have follow‐up imaging, was due to a lack of clinical indication for repeat imaging. Progression of treated oligometastases on follow‐up imaging occurred in 10 patients (15%). Distant progressive disease occurred in 15 patients (22%). Of these patients nine (60%) recurred with bone metastases, 5 (33%) with lung lesions and 1 (7%) in nonregional nodes. The median time to next intervention was 28.8 months with (95% confidence interval [CI], 19.8 months—not reached; Figure 2B 4 DISCUSSION Our study describes a real‐world experience treating OPCa with SBRT at a median follow‐up of 18.8 months. In our cohort of 67 patients, median bPFS and TTNI after SBRT were 22.1 months and 28.8 months, respectively. Time to PSA progression was 25.7 months. The median maximum PSA fall was 68.9%. PSA30/50/90 responses were observed in 71.6%, 55.2% and 26.9% of patients, respectively. The median ADT‐free survival was not reached. We performed an exploratory analysis to see if a particular subgroup did well or may have been unsuitable for MDT. On multivariate analysis, a lower initial T stage was significantly associated with prolonged bPFS. Lower initial T stage and a PSA doubling time greater than 3 months prior to MDT were predictive of prolonged time to PSA progression. Management of OPCa with MDT remains an investigational area,  13  6  5  5  14  15  14  14  15 Additionally, a plethora of retrospective series have suggested that SBRT in OPCa provides optimal metastasis control is well tolerated and beneficial in deferring time to hormonal therapy and prolonging biochemical PFS.  2  16  17  18  19 This study represents the perspective of real‐world experience in a large single institution using both standard and MRI‐Linac guided radiotherapy techniques to treat oligometastatic lesions. We included 67 patients in the ADT naive setting, with a similar sample size to current retrospective data and prospective trials reporting on populations on the order of 50 to 60 patients. With consideration to events such as PSA failure, initiation of systemic therapy or death by any cause, this study demonstrated a favourable median bPFS response in keeping with current prospective evidence.  5  6  8 With the advancement in imaging and availability of 68Ga prostate‐specific membrane antigen (PSMA) PET, there are higher rates of early detection of micro‐metastatic disease and improved patient selection for MDT compared with conventional imaging.  20  17  21  2 The findings in this series were comparable to well cited trials including STOMP  5  8  2  5  18  7  7  16 In the context of Australian experience, our data aligns with both prospective and retrospective literature.  6  19  6  19  6  6  19 While the results are promising, this study has several limitations. It was retrospective with a small sample size. Seven individuals without follow‐up data (PSA or imaging) were excluded from analysis despite receiving oligometastatic treatment. Clinical selection bias may have evolved over time, in those participants that were offered whole pelvic RT and concurrent ADT versus an MDT approach for nodal disease. This is reflective in the median time from definitive treatment to SBRT of 7 years. In regard to ADT‐free survival, there were not enough events to perform a robust statistical analysis and hence the event rate remains inconclusive. Furthermore, ADT free survival remains an inconsistent endpoint as ADT initiation may be influenced by patient and clinician preference based on PSA doubling time. The retrospective nature inherently opens to biases and may affect the statistical power of the data. Although patients were treated at a single centre, care was across multiple clinicians thus impacting timing of imaging, PSA testing and PSA threshold for ADT administration. Owing to accessibility of enhanced imaging, follow‐up staging was inconsistent in this cohort impacting the interpretation of local progression of baseline‐detected oligometastatic lesions. Castrate‐resistant patients were not included in this study but further exploration in this setting is certainly warranted and is currently being investigated through the STAMPEDE2 trial of SBRT compared with Lu‐PSMA‐617 treatment in metastatic prostate cancer.  22 5 CONCLUSION Both standard and MRI‐Linac guided MDT in PSMA‐PET detected OPCa can be effective in prolonging biochemical PFS, time to next intervention and PSA progression across a heterogeneous population of varying prostate cancer subtypes. The data from this study supports this approach but warrants continued prospective study and exploration into the castrate resistant setting. AUTHOR CONTRIBUTIONS S.S. wrote the manuscript alongside M.C. A.J., J.D.L., S.S., J.M. and H.‐W.S. performed statistical analysis. All other authors reviewed the manuscript and provided editorial suggestions. CONFLICT OF INTEREST STATEMENT The authors declare their affiliations with St Vincent's Hospital Sydney, The Kinghorn Cancer Centre Sydney, St Vincent's Clinic Sydney, St Vincent's Prostate Cancer Centre Sydney and St Vincent's GenesisCare NSW. The authors have no other conflicts of interest to disclose in relation to this manuscript. ACKNOWLEDGEMENTS None. Open access publishing facilitated by University of New South Wales, as part of the Wiley ‐ University of New South Wales agreement via the Council of Australian University Librarians. REFERENCES 1 Hellman S Weichselbaum RR Oligometastases J Clin Oncol 1995 13 1 8 10 7799047 10.1200/JCO.1995.13.1.8 2 Deek MP Yu C Phillips R Song DY Deville C Greco S Radiation therapy in the definitive management of oligometastatic prostate cancer: the Johns Hopkins experience Int J Radiat Oncol Biol Phys 2019 105 5 948 956 10.1016/j.ijrobp.2019.08.008 31419509 PMC7050213 3 Antonarakis ES Shui IM Zaidi O Bernauer M Gratzke C Current treatment paradigms and clinical outcomes in oligometastatic prostate cancer patients: a targeted literature review Eur Urol Oncol 2024 7 6 1280 1292 10.1016/j.euo.2024.06.002 38964996 4 Miszczyk M Rajwa P Yanagisawa T Nowicka Z Shim SR Laukhtina E The efficacy and safety of metastasis‐directed therapy in patients with prostate cancer: a systematic review and meta‐analysis of prospective studies Eur Urol 2024 85 2 125 138 10.1016/j.eururo.2023.10.012 37945451 5 Ost P Reynders D Decaestecker K Fonteyne V Lumen N De Bruycker A Surveillance or metastasis‐directed therapy for oligometastatic prostate cancer recurrence: a prospective, randomized, multicenter phase II trial J Clin Oncol 2018 36 5 446 453 10.1200/JCO.2017.75.4853 29240541 6 Kneebone A Hruby G Ainsworth H Byrne K Brown C Guo L Stereotactic body radiotherapy for oligometastatic prostate cancer detected via prostate‐specific membrane antigen positron emission tomography Eur Urol Oncol 2018 1 6 531 537 10.1016/j.euo.2018.04.017 31158100 7 Siva S Bressel M Murphy DG Shaw M Chander S Violet J Stereotactic abative body radiotherapy (SABR) for oligometastatic prostate cancer: a prospective clinical trial Eur Urol 2018 74 4 455 462 10.1016/j.eururo.2018.06.004 30227924 8 Phillips R Shi WY Deek M Radwan N Lim SJ Antonarakis ES Outcomes of observation vs stereotactic ablative radiation for oligometastatic prostate cancer: the ORIOLE phase 2 randomized clinical trial JAMA Oncol 2020 6 5 650 659 10.1001/jamaoncol.2020.0147 32215577 PMC7225913 9 Tosoian JJ Gorin MA Ross AE Pienta KJ Tran PT Schaeffer EM Oligometastatic prostate cancer: definitions, clinical outcomes, and treatment considerations Nat Rev Urol 2017 14 1 15 25 10.1038/nrurol.2016.175 27725639 PMC5808411 10 Wong AC Watson SP Pitroda SP Son CH Das LC Stack ME Clinical and molecular markers of long‐term survival after oligometastasis‐directed stereotactic body radiotherapy (SBRT) Cancer 2016 122 14 2242 2250 10.1002/cncr.30058 27206146 11 Pitroda SP Khodarev NN Huang L Uppal A Wightman SC Ganai S Integrated molecular subtyping defines a curable oligometastatic state in colorectal liver metastasis Nat Commun 2018 9 1 1793 10.1038/s41467-018-04278-6 29728604 PMC5935683 12 Scher HI Morris MJ Stadler WM Higano C Basch E Fizazi K Trial design and objectives for castration‐resistant prostate cancer: updated recommendations from the prostate cancer clinical trials working group 3 J Clin Oncol 2016 34 12 1402 1418 10.1200/JCO.2015.64.2702 26903579 PMC4872347 13 Ost P Bossi A Decaestecker K De Meerleer G Giannarini G Karnes RJ Metastasis‐directed therapy of regional and distant recurrences after curative treatment of prostate cancer: a systematic review of the literature Eur Urol 2015 67 5 852 863 10.1016/j.eururo.2014.09.004 25240974 14 Tang C Sherry AD Haymaker C Bathala T Liu S Fellman B Addition of metastasis‐directed therapy to intermittent hormone therapy for oligometastatic prostate cancer: the EXTEND phase 2 randomized clinical trial JAMA Oncol 2023 9 6 825 834 10.1001/jamaoncol.2023.0161 37022702 PMC10080407 15 Ost P Siva S Brabrand S Dirix P Liefhooghe N Otte FX PEACE v‐salvage treatment of oligorecurrent nodal prostate cancer metastases (STORM): acute toxicity of a randomized phase 2 trial Eur Urol Oncol 2024 7 3 462 468 10.1016/j.euo.2023.09.007 37821242 16 Muldermans JL Romak LB Kwon ED Park SS Olivier KR Stereotactic body radiation therapy for oligometastatic prostate cancer Int J Radiat Oncol Biol Phys 2016 95 2 696 702 10.1016/j.ijrobp.2016.01.032 27131082 PMC5154616 17 Gillessen S Attard G Beer TM Beltran H Bossi A Bristow R Management of patients with advanced prostate cancer: the report of the advanced prostate cancer consensus conference APCCC 2017 Eur Urol 2018 73 2 178 211 10.1016/j.eururo.2017.06.002 28655541 18 Soldatov A von Klot CAJ Walacides D Derlin T Bengel FM Ross TL Patterns of progression after (68)Ga‐PSMA‐ligand PET/CT‐guided radiation therapy for recurrent prostate cancer Int J Radiat Oncol Biol Phys 2019 103 1 95 104 10.1016/j.ijrobp.2018.08.066 30201438 19 Mohan R Kneebone A Eade T Hsiao E Emmett L Brown C Long‐term outcomes of SBRT for PSMA PET detected oligometastatic prostate cancer Radiat Oncol 2023 18 1 127 10.1186/s13014-023-02302-8 37528487 PMC10394924 20 Perera M Papa N Christidis D Wetherell D Hofman MS Murphy DG Sensitivity, specificity, and predictors of positive (68)Ga‐prostate‐specific membrane antigen positron emission tomography in advanced prostate cancer: a systematic review and meta‐analysis Eur Urol 2016 70 6 926 937 10.1016/j.eururo.2016.06.021 27363387 21 Emmett L Tang R Nandurkar R Hruby G Roach P Watts JA 3‐year freedom from progression after (68)Ga‐PSMA PET/CT‐triaged management in men with biochemical recurrence after radical prostatectomy: results of a prospective multicenter trial J Nucl Med 2020 61 6 866 872 10.2967/jnumed.119.235028 31676727 22 UCL MCTUa STAMPEDE 2: a randomised controlled platform trial testing treatments in metastatic hormone sensitive prostate cancer 2025 https://www.stampede2trial.org/ ",
  "metadata": {
    "Title of this paper": "STAMPEDE 2: a randomised controlled platform trial testing treatments in metastatic hormone sensitive prostate cancer 2025",
    "Journal it was published in:": "BJUI Compass",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488251/"
  }
}