{
  "title": "Paper_995",
  "abstract": "pmc World J Clin Oncol 1494 wjco WJCO World Journal of Clinical Oncology 2218-4333 Baishideng Publishing Group Inc PMC12476619 PMC12476619.1 12476619 12476619 41024844 10.5306/wjco.v16.i9.108748 jWJCO.v16.i9.eid108748 1 Minireviews Gastric neuroendocrine tumors: A review of pathology and updated roadmap to surgical management Agathis AZ et al Agathis Alexandra Z Department of Surgery, Icahn School of Medicine at Mount Sinai, New York, NY 10029, United States Lopez-May Martina Department of Surgery, Icahn School of Medicine at Mount Sinai, New York, NY 10029, United States Brown Cole Department of Surgery, Icahn School of Medicine at Mount Sinai, New York, NY 10029, United States Divino Celia M Department of Surgery, Icahn School of Medicine at Mount Sinai, New York, NY 10029, United States. celia.divino@mountsinai.org Author contributions: Agathis AZ established study design, principally conducted literature review, and drafted the original manuscript; Lopez-May M and Brown C contributed to the paper significantly and revised the manuscript; Divino CM conceptualized the study, supervised the work, and revised the manuscript; All authors prepared the draft and approved the submitted version. Corresponding author: Celia M Divino, FACS, MD, Professor, Department of Surgery, Icahn School of Medicine at Mount Sinai, 1 Gustave L. Levy Place New York, New York, NY 10029, United States. celia.divino@mountsinai.org 24 9 2025 24 9 2025 16 9 497728 108748 24 4 2025 28 5 2025 12 8 2025 24 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ Neuroendocrine tumors are a rare cancer, with those arising in gastric tissue even less commonly. With increasing recognition through endoscopy, these tumors are diagnosed in more patients each year. As a rare and growing entity, our understanding of these tumors, the way we characterize them, and treatment are changing rapidly. Thus, we sought to provide an updated review of pathology and management, highlighting the latest guidelines and evidence for surgical treatment. Much of the general treatment paradigm is from consensus guidelines put forth by the European Neuroendocrine Tumor Society and the North American Neuroendocrine Tumor Society; however, future research is needed to help guide further surgical decision-making around intermediate grade and intermediate size type III tumors, as well as systemic therapies in the perioperative and nonoperative settings for high-grade tumors. Gastric Carcinoid Neuroendocrine tumor Stomach Endoscopic Surgical management pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION Neuroendocrine neoplasms (NENs) are a rare type of cancer but are growing in incidence[ 1 2 3 4 5 6 7 Gastric NETs (G-NETs) are a particularly rare subtype of neuroendocrine tumor but have nonetheless been rising in prevalence over the last 3 decades[ 1 8 9 10 14 vs 1 Table 1 Characteristics of gastric neuroendocrine tumors subtypes   Type I (75%-80%)  Type II (5%)  Type III (15%-25%) Gastrin levels High gastrin High gastrin Normal gastrin Gastric acid pH > 4, hypo- or achlorhydria pH < 2, hyperchlorhydria pH < 4, normal gastric HCL Surrounding gastric mucosa Atrophic gastritis Corpus mucosal hypertrophy Normal mucosa Underlying cause Autoimmune atrophic gastritis Gastrinoma related to Zollinger-Ellison, MEN-1 syndrome Sporadic mutations Tumor number Multifocal Multifocal Singular Tumor size Smaller, < 2 cm Smaller, < 2 cm Larger, > 2 cm WHO grade 1-2 1-2 1-3 Ki-67% Lower Lower Higher Malignancy potential Low Low High This table compares qualities between type I, II, and III G-NETs, as their characteristic behavior, presentation, and management differ. MEN-1: Multiple endocrine neoplasia type 1; WHO: World Health Organization. In this review, we seek to provide an overview of disease epidemiology and pathology to provide context before focusing on treatment clinical decision-making. We will delve deep into surgical management, providing a roadmap for treating this rising population of patients, highlighting gaps in consensus. EPIDEMIOLOGY While uncommon and making up an estimated 0.3%-1.8% of all gastric malignancies, G-NET rates have been rising globally[ 1 8 15 17 9 1 14 15 This rising incidence is likely in-part due to increased diagnosis facilitated by widespread endoscopy use and advances in immunohistochemistry[ 18 20 8 21 Carcinoid tumors are most common in women, with an age-standardized incidence rate reported to be 0.5 per 100000 noted in a SEER analysis of 13279 cases from 2000-2019 in the United States. Men have a reported incidence of 0.37 per 100000. In looking at race and ethnicity, Hispanic patients were found to have the highest incidence in this SEER analysis, with Hispanic women having an incidence of 0.91 per 100000 and men having an incidence of 0.49 per 100000. They noted two-times the number of cases in patients 55 years-old and greater vs 22 23 8 22 24 There are also epidemiologic patterns noted based on the subtype of gastric cancer. The most common subtype is type I (75%-80% of NENs), followed by type III (15%-25%), and the least common type II (5%). Aligning with the associated pathologies, type I gastric carcinoid tumors, which are associated with atrophic gastritis, are more commonly found in women, rather than men, and in people of white race[ 12 25 26 27 28 29 PATHOPHYSIOLOGY AND RISK FACTORS The pathogenesis of gastric NETs overall can be divided into 2 categories: Gastrin-dependent and gastrin-independent. The understanding of normal gastric physiology is vital to understanding the deviance which results in type I and II gastrin-dependent G-NETs[ 3 30 via via via 30 via 1 via Figure 1  Gastric physiology, interactions between enterochromaffin-like and parietal cell. Type I gastric NETs are characterized by their association with atrophic gastritis[ 31 Helicobacter pylori 32 . 33 28 34 In comparison, type III carcinoids occur sporadically and have predominantly been noted to be gastrin-independent without associated conditions. Some have also suggested the classification of type IV gastric NETs; these tumors have been described as those that behave similarly to type III as often solitary and aggressive, but with characteristics of NECs rather than NETs. Another description of type IV tumors is with an inherent defect in acid secretion by parietal cells, effectively presenting like type I tumors[ 35 38 e.g. 39 40 10 11 Gastric neuroendocrine tumors can present with general signs and symptoms of gastric cancer such as weight loss, abdominal pain, nausea, vomiting, and gastrointestinal bleeding, as NETs represent a subset of gastric cancers. Specifically, type I gastric carcinoids are generally low-grade, slow-growing tumors that have a malignancy risk of less than 3%[ 41 39 42 21 43 In contrast, type III gastric carcinoids are known as the most aggressive subtype with the highest malignant potential and lowest survival rate[ 44 24 via e.g. via 45 46 DIAGNOSIS AND STAGING Endoscopy The diagnosis of gastric carcinoid tumors typically begins with an upper endoscopy (esophagogastroduodenoscopy, or EGD) for direct visualization of the gastric mucosa, which also enables the biopsy of any suspicious lesions. Often times, gastric carcinoid tumors, especially type I, are noted incidentally during endoscopies for a different indication. During endoscopy, gastric carcinoids often appear as small, polypoid, or nodular lesions that are frequently found in the gastric body and fundus[ 47 48 49 Once a lesion is identified, diagnosis is made with histopathologic examination of the biopsy samples. Immunohistochemical staining can confirm the neuroendocrine origin of the tumor, with markers such as chromogranin A and synaptophysin[ 50 52 50 53 54 10 11 40 50 Lab testing Laboratory tests can assess biochemical markers associated with neuroendocrine activity. Serum chromogranin A is the most utilized biomarker typically elevated in gastric carcinoids, especially in type I and type II tumors[ 55 28 34 56 57 Imaging and staging For staging and metastatic evaluation, cross-sectional imaging such as computed tomography or magnetic resonance imaging of the abdomen and pelvis is performed to assess tumor burden and organ involvement[ 58 59 e.g. 60 39 Various classification systems exist for staging. One example is the American Joint Committee on Cancer staging criteria, which uses the tumor-node-metastasis (T-N-M) staging model. Stage I and II encompass tumors with limited local invasion, without nodal or distant metastases. Stage I denotes patients with smaller tumors (< 1.0 cm) with limited local depth invasion (into lamina propria or submucosa) (T1). Stage II includes tumors that are larger (> 1.0 cm) and more invasive (across the lamina propria and/or submucosa or invades muscularis propria) (T2). In addition, stage II also includes more invasive T3 tumors, which have grown through the muscularis propria into the subserosa. Stage III encompasses any tumors that extend deeper into the serosa or visceral peritoneum (T4) or that has spread to nearby lymph nodes (N1). The most widespread disease is stage IV, which includes metastatic tumors that spread to more distant parts of the body[ 61 MANAGEMENT Given the complex pathophysiology and rarity of this disorder, as previously described in this review, managing these patients is a multi-disciplinary initiative consisting of medical oncologists, endocrinologists, gastroenterologists (including advanced endoscopists), pathologists, and surgeons. The clinical decision-making of these tumor boards is typically guided by the subtype of G-NET and more specifically on tumor grade and size[ 39 62 Type I G-NETs The management of type I mainly consists of endoscopic resection and surveillance for smaller (< 1.0 cm), low-grade tumors (G1 or low G2). More extensive resection or surgical consideration is reserved for larger (> 2.0 cm) tumors or those with high-risk features or grade (G3 or high G2), as per The North American Neuroendocrine Tumor Society (NANETS) among others’ recommendation[ 63 64 64 65 vs 64 For intermediate size (1.0-2.0 cm) tumors, ENETS suggests EUS to assess depth and local lymph node involvement[ 64 vs 64 vs 2 66 67 Figure 2  Management of localized gastric neuroendocrine tumors type I tumors. Type II G-NETs Given that type II tumors are fed by gastrinomas, treatment of type II tumors begins with addressing the gastrinoma, as this type of G-NET has been noted to regress if its gastrin supply is impeded by somatostatin analogs or surgery[ 68 3 63 68 Type III G-NETs Type III tumors are the most aggressive tumors and thus require the most invasive management. Depending on the size, location, and invasiveness, there are different extents of resection offered. A surgeon will need to decide the extent of gastric resection required (wedge vs vs 64 69 62 For high-grade (G3) tumors, radical resection with subtotal or total gastrectomy with lymphadenectomy should be performed, as suggested by organizations like NANETS and ENETS[ 64 70 3 64 69 71 Figure 3  Management of type III gastric neuroendocrine tumors. Metastatic disease If there are isolated hepatic metastases with localization to one lobe, patients may be treated with hepatic resection, as both symptoms and survival have been shown to improve after[ 63 72 73 73 76 Patients with widespread metastatic disease may also benefit from somatostatin-analog therapy, peptide receptor radionuclide therapy (PRRT), or chemotherapy. Somatostatin analogs, such as octreotide LAR and lanreotide, can help symptoms and slow the growth of well-differentiated tumors[ 77 78 PRRT is performed with beta-emitting radionuclides such as 177 Lutetium (177 LuDOTATATE). Recent prospective randomized control trials have shown great promise with mid-gut NET tumors and gastroenteropancreatic tumors in general (including stomach), in NETTER-1 and NETTER-2, respectively[ 79 81 63 70 82 85 86 85 Perioperative considerations While carcinoid syndrome is not common with gastric NET tumors, it is important that surgeons are aware of this syndrome and the potentially life-threatening complications that can occur as a result of carcinoid crisis, and how to avoid it. Providers should obtain a careful history to inquire about any carcinoid symptoms[ 87 88 89 90 90 91 87 91 92 CONCLUSION Gastric carcinoid is a rare disease but is nonetheless increasing in incidence, largely due to the rise in endoscopic diagnosis. As the disease is more widely diagnosed, further studies have deepened our understanding of pathophysiology, management, and prognosis. Continually updated guidelines provided by organizations like NANETS and ENETS are immensely helpful in guiding medical and surgical management. Nonetheless, there are still gaps in our knowledge, especially in establishing optimal surgical decision-making for type III intermediate grade and medium-sized tumors and in clarifying indications for systemic therapies specifically for gastric NETs. Future work should also elucidate prevention and treatment of carcinoid crisis in perioperative patients. While great strides have been made in the past century since carcinoid was first named, we continue to work towards clarifying optimal care for these patients.  Conflict-of-interest statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Dasari A Shen C Halperin D Zhao B Zhou S Xu Y Shih T Yao JC Trends in the Incidence, Prevalence, and Survival Outcomes in Patients With Neuroendocrine Tumors in the United States JAMA Oncol 2017 3 1335 1342 28448665 10.1001/jamaoncol.2017.0589 PMC5824320 2 Rindi G Klimstra DS Abedi-Ardekani B Asa SL Bosman FT Brambilla E Busam KJ de Krijger RR Dietel M El-Naggar AK Fernandez-Cuesta L Klöppel G McCluggage WG Moch H Ohgaki H Rakha EA Reed NS Rous BA Sasano H Scarpa A Scoazec JY Travis WD Tallini G Trouillas J van Krieken JH Cree IA A common classification framework for neuroendocrine neoplasms: an International Agency for Research on Cancer (IARC) and World Health Organization (WHO) expert consensus proposal Mod Pathol 2018 31 1770 1786 30140036 10.1038/s41379-018-0110-y PMC6265262 3 Lamberti G Panzuto F Pavel M O'Toole D Ambrosini V Falconi M Garcia-Carbonero R Riechelmann RP Rindi G Campana D Gastric neuroendocrine neoplasms Nat Rev Dis Primers 2024 10 25 38605021 10.1038/s41572-024-00508-y 4 Oberndorfer S. Karzinoide tumoren des dunndarms. Frankfurt Z Path 1907; 1: 426-432 5 Tsoucalas G Karamanou M Androutsos G The eminent German pathologist Siegfried Oberndorfer (1876-1944) and his landmark work on carcinoid tumors Ann Gastroenterol 2011 24 98 100 24713679 PMC3959292 6 Arnold R Endocrine tumours of the gastrointestinal tract. Introduction: definition, historical aspects, classification, staging, prognosis and therapeutic options Best Pract Res Clin Gastroenterol 2005 19 491 505 16183523 10.1016/j.bpg.2005.03.006 7 Gastrointestinal Neuroendocrine Tumors Treatment (PDQ®): Health Professional Version. 2025 May 9. In: PDQ Cancer Information Summaries [Internet]. Bethesda (MD): National Cancer Institute (US); 2002– 8 Modlin IM Lye KD Kidd M A 50-year analysis of 562 gastric carcinoids: small tumor or larger problem? Am J Gastroenterol 2004 99 23 32 14687136 10.1046/j.1572-0241.2003.04027.x 9 Xu Z Wang L Dai S Chen M Li F Sun J Luo F Epidemiologic Trends of and Factors Associated With Overall Survival for Patients With Gastroenteropancreatic Neuroendocrine Tumors in the United States JAMA Netw Open 2021 4 e2124750 34554237 10.1001/jamanetworkopen.2021.24750 PMC8461504 10 WHO Classification of Tumours Editorial Board WHO Classification of Digestive Tumours. WHO, 2019 11 WHO Classification of Tumours Editorial Board WHO Classification of Endocrine and Neuroendocrine Tumours. WHO, 2022 12 Rindi G Luinetti O Cornaggia M Capella C Solcia E Three subtypes of gastric argyrophil carcinoid and the gastric neuroendocrine carcinoma: a clinicopathologic study Gastroenterology 1993 104 994 1006 7681798 10.1016/0016-5085(93)90266-f 13 Capella C Solcia E Sobin LH Arnold R Endocrine tumours of the small intestine. In: Hamilton SR, Aaltonen LA. Pathology and Genetics of Tumours of the Digestive System. International Agency for Research on Cancer, 2000: 67-90 14 Lawrence B Gustafsson BI Chan A Svejda B Kidd M Modlin IM The epidemiology of gastroenteropancreatic neuroendocrine tumors Endocrinol Metab Clin North Am 2011 40 1 18, vii 21349409 10.1016/j.ecl.2010.12.005 15 Ellis L Shale MJ Coleman MP Carcinoid tumors of the gastrointestinal tract: trends in incidence in England since 1971 Am J Gastroenterol 2010 105 2563 2569 20823835 10.1038/ajg.2010.341 16 Das S Dasari A Epidemiology, Incidence, and Prevalence of Neuroendocrine Neoplasms: Are There Global Differences? Curr Oncol Rep 2021 23 43 33719003 10.1007/s11912-021-01029-7 PMC8118193 17 Maly M Callebout E Ribeiro S Hoorens A Carton S Cuyle PJ Vandamme T Borbath I Demetter P Van Damme N Van Eycken L Verslype C Geboes K Neuroendocrine tumors in the stomach: An epidemiological analysis of Belgian Cancer Registry data 2010-2019 J Neuroendocrinol 2025 37 e13473 39604221 10.1111/jne.13473 18 Peery AF Dellon ES Lund J Crockett SD McGowan CE Bulsiewicz WJ Gangarosa LM Thiny MT Stizenberg K Morgan DR Ringel Y Kim HP DiBonaventura MD Carroll CF Allen JK Cook SF Sandler RS Kappelman MD Shaheen NJ Burden of gastrointestinal disease in the United States: 2012 update Gastroenterology 2012 143 1179 1187.e3 22885331 10.1053/j.gastro.2012.08.002 PMC3480553 19 Klimstra DS Modlin IR Adsay NV Chetty R Deshpande V Gönen M Jensen RT Kidd M Kulke MH Lloyd RV Moran C Moss SF Oberg K O'Toole D Rindi G Robert ME Suster S Tang LH Tzen CY Washington MK Wiedenmann B Yao J Pathology reporting of neuroendocrine tumors: application of the Delphic consensus process to the development of a minimum pathology data set Am J Surg Pathol 2010 34 300 313 20118772 10.1097/PAS.0b013e3181ce1447 20 ASGE Standards of Practice Committee Evans JA Chandrasekhara V Chathadi KV Decker GA Early DS Fisher DA Foley K Hwang JH Jue TL Lightdale JR Pasha SF Sharaf R Shergill AK Cash BD DeWitt JM The role of endoscopy in the management of premalignant and malignant conditions of the stomach Gastrointest Endosc 2015 82 1 8 25935705 10.1016/j.gie.2015.03.1967 21 Zheng Z Lu Z Song Y Long-term proton pump inhibitors use and its association with premalignant gastric lesions: a systematic review and meta-analysis Front Pharmacol 2023 14 1244400 37693896 10.3389/fphar.2023.1244400 PMC10492503 22 Aslani A Soheili A Mousavi SE Ebrahimi A Antar RM Yekta Z Nejadghaderi SA Incidence trends of gastric cancer in the United States over 2000-2020: A population-based analysis PLoS One 2024 19 e0310040 39321169 10.1371/journal.pone.0310040 PMC11423999 23 Rustgi SD McKinley M McBay B Zylberberg HM Gomez SL Hur C Kastrinos F Gupta S Kim MK Itzkowitz SH Shah SC Epidemiology of Gastric Malignancies 2000-2018 According to Histology: A Population-Based Analysis of Incidence and Temporal Trends Clin Gastroenterol Hepatol 2023 21 3285 3295.e8 36792000 10.1016/j.cgh.2023.01.037 PMC10809276 24 Shebani KO Souba WW Finkelstein DM Stark PC Elgadi KM Tanabe KK Ott MJ Prognosis and survival in patients with gastrointestinal tract carcinoid tumors Ann Surg 1999 229 815 21; discussion 822 10363895 10.1097/00000658-199906000-00008 PMC1420828 25 Annibale B Azzoni C Corleto VD di Giulio E Caruana P D'Ambra G Bordi C Delle Fave G Atrophic body gastritis patients with enterochromaffin-like cell dysplasia are at increased risk for the development of type I gastric carcinoid Eur J Gastroenterol Hepatol 2001 13 1449 1456 11742193 10.1097/00042737-200112000-00008 26 Vannella L Sbrozzi-Vanni A Lahner E Bordi C Pilozzi E Corleto VD Osborn JF Delle Fave G Annibale B Development of type I gastric carcinoid in patients with chronic atrophic gastritis Aliment Pharmacol Ther 2011 33 1361 1369 21492197 10.1111/j.1365-2036.2011.04659.x 27 Rindi G Bordi C Rappel S La Rosa S Stolte M Solcia E Gastric carcinoids and neuroendocrine carcinomas: pathogenesis, pathology, and behavior World J Surg 1996 20 168 172 8661813 10.1007/s002689900026 28 Solcia E Capella C Fiocca R Rindi G Rosai J Gastric argyrophil carcinoidosis in patients with Zollinger-Ellison syndrome due to type 1 multiple endocrine neoplasia. A newly recognized association Am J Surg Pathol 1990 14 503 513 1970928 10.1097/00000478-199006000-00001 29 Laffi A Lania AGA Ragni A Di Vito V Liccardi A Rubino M Sesti F Colao A Faggiano A On Behalf Of The Nike Group Gastric Neuroendocrine Tumors (g-NETs): A Systematic Review of the Management and Outcomes of Type 3 g-NETs Cancers (Basel) 2023 15 2202 37190131 10.3390/cancers15082202 PMC10137004 30 Engevik AC Kaji I Goldenring JR The Physiology of the Gastric Parietal Cell Physiol Rev 2020 100 573 602 31670611 10.1152/physrev.00016.2019 PMC7327232 31 Massironi S Gallo C Elvevi A Stegagnini M Coltro LA Invernizzi P Incidence and prevalence of gastric neuroendocrine tumors in patients with chronic atrophic autoimmune gastritis World J Gastrointest Oncol 2023 15 1451 1460 37663936 10.4251/wjgo.v15.i8.1451 PMC10473929 32 Shah SC Piazuelo MB Kuipers EJ Li D AGA Clinical Practice Update on the Diagnosis and Management of Atrophic Gastritis: Expert Review Gastroenterology 2021 161 1325 1332.e7 34454714 10.1053/j.gastro.2021.06.078 PMC8740554 33 Bordi C D'Adda T Azzoni C Pilato FP Caruana P Hypergastrinemia and gastric enterochromaffin-like cells Am J Surg Pathol 1995 19 Suppl 1 S8 19 7762739 34 Berna MJ Annibale B Marignani M Luong TV Corleto V Pace A Ito T Liewehr D Venzon DJ Delle Fave G Bordi C Jensen RT A prospective study of gastric carcinoids and enterochromaffin-like cell changes in multiple endocrine neoplasia type 1 and Zollinger-Ellison syndrome: identification of risk factors J Clin Endocrinol Metab 2008 93 1582 1591 18270260 10.1210/jc.2007-2279 PMC2386679 35 Abraham SC Carney JA Ooi A Choti MA Argani P Achlorhydria, parietal cell hyperplasia, and multiple gastric carcinoids: a new disorder Am J Surg Pathol 2005 29 969 975 15958864 10.1097/01.pas.0000163363.86099.9f 36 Ooi A Ota M Katsuda S Nakanishi I Sugawara H Takahashi I An Unusual Case of Multiple Gastric Carcinoids Associated with Diffuse Endocrine Cell Hyperplasia and Parietal Cell Hypertrophy Endocr Pathol 1995 6 229 237 12114744 10.1007/BF02739887 37 Nakata K Aishima S Ichimiya H Yao T Matsuura T Seo M Nagai E Okido M Kato M Nakagaki M Tsuneyoshi M Tanaka M Unusual multiple gastric carcinoids with hypergastrinemia: report of a case Surg Today 2010 40 267 271 20180083 10.1007/s00595-009-4032-7 38 Exarchou K Stephens NA Moore AR Howes NR Pritchard DM New Developments in Gastric Neuroendocrine Neoplasms Curr Oncol Rep 2022 24 77 88 35059996 10.1007/s11912-021-01175-y PMC8831276 39 Borch K Ahrén B Ahlman H Falkmer S Granérus G Grimelius L Gastric carcinoids: biologic behavior and prognosis after differentiated treatment in relation to type Ann Surg 2005 242 64 73 15973103 10.1097/01.sla.0000167862.52309.7d PMC1357706 40 Song Y Chen E Chiang YJ Yao JC Halperin DM Chatterjee D Badgwell BD Classification of Gastric Neuroendocrine Tumors and Associations With Survival J Surg Oncol 2025 131 204 211 39257200 10.1002/jso.27876 41 Chen YY Guo WJ Shi YF Su F Yu FH Chen RA Wang C Liu JX Luo J Tan HY Management of type 1 gastric neuroendocrine tumors: an 11-year retrospective single-center study BMC Gastroenterol 2023 23 440 38097952 10.1186/s12876-023-03079-6 PMC10722838 42 Ogata Y Hatta W Kanno T Saito M Jin X Asano N Koike T Imatani A Yuan Y Masamune A Type 2 and type 3 gastric neuroendocrine tumors have high risk of lymph node metastasis: Systematic review and meta-analysis Dig Endosc 2025 10.1111/den.15026 PMC12333324 40170116 43 Zollinger RM Ellison EH Primary peptic ulcerations of the jejunum associated with islet cell tumors of the pancreas Ann Surg 1955 142 709 23; discussion, 724 13259432 PMC1465210 44 Panzuto F Campana D Massironi S Faggiano A Rinzivillo M Lamberti G Sciola V Lahner E Manuzzi L Colao A Annibale B Tumour type and size are prognostic factors in gastric neuroendocrine neoplasia: A multicentre retrospective study Dig Liver Dis 2019 51 1456 1460 31175013 10.1016/j.dld.2019.04.016 45 Davis Z Moertel CG McIlrath DC The malignant carcinoid syndrome Surg Gynecol Obstet 1973 137 637 644 4730072 46 Yadegarfar G Friend L Jones L Plum LM Ardill J Taal B Larsson G Jeziorski K Kwekkeboom D Ramage JK EORTC Quality of Life Group Validation of the EORTC QLQ-GINET21 questionnaire for assessing quality of life of patients with gastrointestinal neuroendocrine tumours Br J Cancer 2013 108 301 310 23322194 10.1038/bjc.2012.560 PMC3566824 47 Nikou GC Toubanakis C Moulakakis KG Pavlatos S Kosmidis C Mallas E Safioleas P Sakorafas GH Safioleas MC Carcinoid tumors of the duodenum and the ampulla of Vater: current diagnostic and therapeutic approach in a series of 8 patients. Case series Int J Surg 2011 9 248 253 21215338 10.1016/j.ijsu.2010.12.003 48 Borbath I Pape UF Deprez PH Bartsch DK Caplin M Falconi M Garcia-Carbonero R Grozinsky-Glasberg S Jensen RT Arnold R Ruszniewski P Toumpanakis C Valle JW O Toole D Members of the Advisory Board of the European Neuroendocrine Tumor Society (ENETS) ENETS standardized (synoptic) reporting for endoscopy in neuroendocrine tumors J Neuroendocrinol 2022 34 e13105 35233848 10.1111/jne.13105 49 Yoshikane H Tsukamoto Y Niwa Y Goto H Hase S Mizutani K Nakamura T Carcinoid tumors of the gastrointestinal tract: evaluation with endoscopic ultrasonography Gastrointest Endosc 1993 39 375 383 8514069 10.1016/s0016-5107(93)70109-1 50 Kunz PL Reidy-Lagunes D Anthony LB Bertino EM Brendtro K Chan JA Chen H Jensen RT Kim MK Klimstra DS Kulke MH Liu EH Metz DC Phan AT Sippel RS Strosberg JR Yao JC North American Neuroendocrine Tumor Society Consensus guidelines for the management and treatment of neuroendocrine tumors Pancreas 2013 42 557 577 23591432 10.1097/MPA.0b013e31828e34a4 PMC4304762 51 Lloyd RV Practical markers used in the diagnosis of neuroendocrine tumors Endocr Pathol 2003 14 293 301 14739487 10.1385/ep:14:4:293 52 Buffa R Rindi G Sessa F Gini A Capella C Jahn R Navone F De Camilli P Solcia E Synaptophysin immunoreactivity and small clear vesicles in neuroendocrine cells and related tumours Mol Cell Probes 1987 1 367 381 3134611 10.1016/0890-8508(87)90018-1 53 Georgakopoulou VE Zygouris E Damaskos C Pierrakou A Papalexis P Garmpis N Aravantinou-Fatorou A Chlapoutakis S Diamantis E Nikokiris C Gkoufa A Sklapani P Trakas N Janinis J Spandidos DA Dahabreh J Prognostic value of the immunohistochemistry markers CD56, TTF-1, synaptophysin, CEA, EMA and NSE in surgically resected lung carcinoid tumors Mol Clin Oncol 2022 16 31 34984102 10.3892/mco.2021.2464 PMC8719249 54 Capella C Heitz PU Höfler H Solcia E Klöppel G Revised classification of neuroendocrine tumours of the lung, pancreas and gut Virchows Arch 1995 425 547 560 7697211 10.1007/BF00199342 55 Nobels FR Kwekkeboom DJ Coopmans W Schoenmakers CH Lindemans J De Herder WW Krenning EP Bouillon R Lamberts SW Chromogranin A as serum marker for neuroendocrine neoplasia: comparison with neuron-specific enolase and the alpha-subunit of glycoprotein hormones J Clin Endocrinol Metab 1997 82 2622 2628 9253344 10.1210/jcem.82.8.4145 56 Pregun I Herszényi L Juhász M Miheller P Hritz I Patócs A Rácz K Tulassay Z Effect of proton-pump inhibitor therapy on serum chromogranin a level Digestion 2011 84 22 28 21304238 10.1159/000321535 57 Kleĭman EI [Complicated diverticulum of the stomach] Vestn Rentgenol Radiol 1986 82 3099452 58 Pape UF Jann H Müller-Nordhorn J Bockelbrink A Berndt U Willich SN Koch M Röcken C Rindi G Wiedenmann B Prognostic relevance of a novel TNM classification system for upper gastroenteropancreatic neuroendocrine tumors Cancer 2008 113 256 265 18506737 10.1002/cncr.23549 59 Shell J Keutgen XM Millo C Nilubol N Patel D Sadowski S Boufraqech M Yang L Merkel R Atallah C Herscovitch P Kebebew E 68-Gallium DOTATATE scanning in symptomatic patients with negative anatomic imaging but suspected neuroendocrine tumor Int J Endocr Oncol 2018 5 IJE04 30112163 10.2217/ije-2017-0005 PMC6085594 60 Arnold R Trautmann ME Creutzfeldt W Benning R Benning M Neuhaus C Jürgensen R Stein K Schäfer H Bruns C Dennler HJ Somatostatin analogue octreotide and inhibition of tumour growth in metastatic endocrine gastroenteropancreatic tumours Gut 1996 38 430 438 8675099 10.1136/gut.38.3.430 PMC1383075 61 American Joint Committee on Cancer (AJCC) Neuroendocrine Tumors of the Stomach. In: AJCC Cancer Staging Manual. 8th ed. New York, NY: Springer, 2017: 351-359 62 Hanna A Kim-Kiselak C Tang R Metz DC Yang Z DeMatteo R Fraker DL Roses RE Gastric Neuroendocrine Tumors: Reappraisal of Type in Predicting Outcome Ann Surg Oncol 2021 28 8838 8846 34120268 10.1245/s10434-021-10293-7 63 Kulke MH Anthony LB Bushnell DL de Herder WW Goldsmith SJ Klimstra DS Marx SJ Pasieka JL Pommier RF Yao JC Jensen RT North American Neuroendocrine Tumor Society (NANETS) NANETS treatment guidelines: well-differentiated neuroendocrine tumors of the stomach and pancreas Pancreas 2010 39 735 752 20664472 10.1097/MPA.0b013e3181ebb168 PMC3100728 64 Panzuto F Ramage J Pritchard DM van Velthuysen MF Schrader J Begum N Sundin A Falconi M O'Toole D European Neuroendocrine Tumor Society (ENETS) 2023 guidance paper for gastroduodenal neuroendocrine tumours (NETs) G1-G3 J Neuroendocrinol 2023 35 e13306 37401795 10.1111/jne.13306 65 Sebastian-Valles F Bernaldo Madrid B Sager C Carrillo López E Mera Carreiro S Ávila Antón L García NS Sampedro-Nuñez MA Díaz Pérez JÁ Marazuela M Chronic Treatment with Somatostatin Analogues in Recurrent Type 1 Gastric Neuroendocrine Tumors Biomedicines 2023 11 872 36979851 10.3390/biomedicines11030872 PMC10045480 66 Eckhauser FE Lloyd RV Thompson NW Raper SE Vinik AI Antrectomy for multicentric, argyrophil gastric carcinoids: a preliminary report Surgery 1988 104 1046 1053 3194832 67 Hirschowitz BI Griffith J Pellegrin D Cummings OW Rapid regression of enterochromaffinlike cell gastric carcinoids in pernicious anemia after antrectomy Gastroenterology 1992 102 1409 1418 1551550 68 Tomassetti P Migliori M Caletti GC Fusaroli P Corinaldesi R Gullo L Treatment of type II gastric carcinoid tumors with somatostatin analogues N Engl J Med 2000 343 551 554 10954763 10.1056/NEJM200008243430805 69 Exarchou K Kamieniarz L Tsoli M Victor A Oleinikov K Khan MS Srirajaskanthan R Mandair D Grozinsky-Glasberg S Kaltsas G Howes N Pritchard DM Toumpanakis C Is local excision sufficient in selected grade 1 or 2 type III gastric neuroendocrine neoplasms? Endocrine 2021 74 421 429 34120313 10.1007/s12020-021-02775-1 70 Eads JR Halfdanarson TR Asmis T Bellizzi AM Bergsland EK Dasari A El-Haddad G Frumovitz M Meyer J Mittra E Myrehaug S Nakakura E Raj N Soares HP Untch B Vijayvergia N Chan JA Expert Consensus Practice Recommendations of the North American Neuroendocrine Tumor Society for the management of high grade gastroenteropancreatic and gynecologic neuroendocrine neoplasms Endocr Relat Cancer 2023 30 e220206 37184955 10.1530/ERC-22-0206 PMC10388681 71 Sok C Ajay PS Tsagkalidis V Kooby DA Shah MM Management of Gastric Neuroendocrine Tumors: A Review Ann Surg Oncol 2024 31 1509 1518 38062290 10.1245/s10434-023-14712-9 PMC10922891 72 Watzka FM Fottner C Miederer M Schad A Weber MM Otto G Lang H Musholt TJ Surgical therapy of neuroendocrine neoplasm with hepatic metastasis: patient selection and prognosis Langenbecks Arch Surg 2015 400 349 358 25682055 10.1007/s00423-015-1277-z 73 Barat M Cottereau AS Kedra A Dermine S Palmieri LJ Coriat R Dautry R Tselikas L Soyer P Dohan A The Role of Interventional Radiology for the Treatment of Hepatic Metastases from Neuroendocrine Tumor: An Updated Review J Clin Med 2020 9 2302 32698459 10.3390/jcm9072302 PMC7408651 74 Sarmiento JM Que FG Hepatic surgery for metastases from neuroendocrine tumors Surg Oncol Clin N Am 2003 12 231 242 12735141 10.1016/s1055-3207(02)00076-5 75 Musunuru S Chen H Rajpal S Stephani N McDermott JC Holen K Rikkers LF Weber SM Metastatic neuroendocrine hepatic tumors: resection improves survival Arch Surg 2006 141 1000 4; discussion 1005 17043278 10.1001/archsurg.141.10.1000 76 Zuckerman DA Kennard RF Roy A Parikh PJ Weiner AA Outcomes and toxicity following Yttrium-90 radioembolization for hepatic metastases from neuroendocrine tumors-a single-institution experience J Gastrointest Oncol 2019 10 118 127 30788167 10.21037/jgo.2018.10.05 PMC6351300 77 Rinke A Wittenberg M Schade-Brittinger C Aminossadati B Ronicke E Gress TM Müller HH Arnold R PROMID Study Group Placebo-Controlled, Double-Blind, Prospective, Randomized Study on the Effect of Octreotide LAR in the Control of Tumor Growth in Patients with Metastatic Neuroendocrine Midgut Tumors (PROMID): Results of Long-Term Survival Neuroendocrinology 2017 104 26 32 26731483 10.1159/000443612 78 Caplin ME Pavel M Ćwikła JB Phan AT Raderer M Sedláčková E Cadiot G Wolin EM Capdevila J Wall L Rindi G Langley A Martinez S Blumberg J Ruszniewski P CLARINET Investigators Lanreotide in metastatic enteropancreatic neuroendocrine tumors N Engl J Med 2014 371 224 233 25014687 10.1056/NEJMoa1316158 79 Strosberg J El-Haddad G Wolin E Hendifar A Yao J Chasen B Mittra E Kunz PL Kulke MH Jacene H Bushnell D O'Dorisio TM Baum RP Kulkarni HR Caplin M Lebtahi R Hobday T Delpassand E Van Cutsem E Benson A Srirajaskanthan R Pavel M Mora J Berlin J Grande E Reed N Seregni E Öberg K Lopera Sierra M Santoro P Thevenet T Erion JL Ruszniewski P Kwekkeboom D Krenning E NETTER-1 Trial Investigators Phase 3 Trial of (177)Lu-Dotatate for Midgut Neuroendocrine Tumors N Engl J Med 2017 376 125 135 28076709 10.1056/NEJMoa1607427 PMC5895095 80 Hope TA Abbott A Colucci K Bushnell DL Gardner L Graham WS Lindsay S Metz DC Pryma DA Stabin MG Strosberg JR NANETS/SNMMI Procedure Standard for Somatostatin Receptor-Based Peptide Receptor Radionuclide Therapy with (177)Lu-DOTATATE J Nucl Med 2019 60 937 943 31263080 10.2967/jnumed.118.230607 PMC12079155 81 Singh S Halperin D Myrehaug S Herrmann K Pavel M Kunz PL Chasen B Tafuto S Lastoria S Capdevila J García-Burillo A Oh DY Yoo C Halfdanarson TR Falk S Folitar I Zhang Y Aimone P de Herder WW Ferone D all the NETTER-2 Trial Investigators [(177)Lu]Lu-DOTA-TATE plus long-acting octreotide versus highdose long-acting octreotide for the treatment of newly diagnosed, advanced grade 2-3, well-differentiated, gastroenteropancreatic neuroendocrine tumours (NETTER-2): an open-label, randomised, phase 3 study Lancet 2024 403 2807 2817 38851203 10.1016/S0140-6736(24)00701-3 82 Arnold R Rinke A Schmidt Ch Hofbauer L Endocrine tumours of the gastrointestinal tract: Chemotherapy Best Pract Res Clin Gastroenterol 2005 19 649 656 16183533 10.1016/j.bpg.2005.04.004 83 Zappi A Persano I Galvani L Parlagreco E Andrini E Campana D Brizzi MP Lamberti G La Salvia A Chemotherapy in Well Differentiated Neuroendocrine Tumors (NET) G1, G2, and G3: A Narrative Review J Clin Med 2023 12 717 36675645 10.3390/jcm12020717 PMC9861419 84 Sorbye H Grande E Pavel M Tesselaar M Fazio N Reed NS Knigge U Christ E Ambrosini V Couvelard A Tiensuu Janson E European Neuroendocrine Tumor Society (ENETS) 2023 guidance paper for digestive neuroendocrine carcinoma J Neuroendocrinol 2023 35 e13249 36924180 10.1111/jne.13249 85 National Comprehensive Cancer Network NCCN Guidelines Version 1.2025 Neuroendocrine Tumors of the Gastrointestinal Tract (Well-Differentiated Grade 1/2), Lung, and Thymus. Accessed May 23, 2025. Available from: https://www.nccn.org/guidelines/category_1 86 Yao JC Phan AT Chang DZ Wolff RA Hess K Gupta S Jacobs C Mares JE Landgraf AN Rashid A Meric-Bernstam F Efficacy of RAD001 (everolimus) and octreotide LAR in advanced low- to intermediate-grade neuroendocrine tumors: results of a phase II study J Clin Oncol 2008 26 4311 4318 18779618 10.1200/JCO.2008.16.7858 PMC2653122 87 Kaltsas G Caplin M Davies P Ferone D Garcia-Carbonero R Grozinsky-Glasberg S Hörsch D Tiensuu Janson E Kianmanesh R Kos-Kudla B Pavel M Rinke A Falconi M de Herder WW Antibes Consensus Conference participants ENETS Consensus Guidelines for the Standards of Care in Neuroendocrine Tumors: Pre- and Perioperative Therapy in Patients with Neuroendocrine Tumors Neuroendocrinology 2017 105 245 254 28253514 10.1159/000461583 PMC5637287 88 Kinney MA Warner ME Nagorney DM Rubin J Schroeder DR Maxson PM Warner MA Perianaesthetic risks and outcomes of abdominal surgery for metastatic carcinoid tumours Br J Anaesth 2001 87 447 452 11517130 10.1093/bja/87.3.447 89 Mancuso K Kaye AD Boudreaux JP Fox CJ Lang P Kalarickal PL Gomez S Primeaux PJ Carcinoid syndrome and perioperative anesthetic considerations J Clin Anesth 2011 23 329 341 21663822 10.1016/j.jclinane.2010.12.009 90 Massimino K Harrskog O Pommier S Pommier R Octreotide LAR and bolus octreotide are insufficient for preventing intraoperative complications in carcinoid patients J Surg Oncol 2013 107 842 846 23592524 10.1002/jso.23323 91 Seymour N Sawh SC Mega-dose intravenous octreotide for the treatment of carcinoid crisis: a systematic review Can J Anaesth 2013 60 492 499 23328959 10.1007/s12630-012-9879-1 92 McCully BH Kozuma K Pommier S Pommier RF Comparison of Octreotide and Vasopressors as First-Line Treatment for Intraoperative Carcinoid Crisis Ann Surg Oncol 2024 31 2996 3002 38227166 10.1245/s10434-023-14876-4 ",
  "metadata": {
    "Title of this paper": "Comparison of Octreotide and Vasopressors as First-Line Treatment for Intraoperative Carcinoid Crisis",
    "Journal it was published in:": "World Journal of Clinical Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476619/"
  }
}