{
  "title": "Paper_240",
  "abstract": "pmc Am J Pathol Am J Pathol 338 amjpathol The American Journal of Pathology 0002-9440 1525-2191 American Society for Investigative Pathology PMC12489385 PMC12489385.1 12489385 12489385 40499782 10.1016/j.ajpath.2025.05.010 S0002-9440(25)00192-0 1 Regular Article Molecular Pathogenesis of Genetic and Inherited Diseases Folliculin Shalaby Ola ∗ † Ohmori Tomoko ∗ Miike Koichiro ∗ Tanigawa Shunsuke ∗ Wilan Krisna Luh Ade ‡ Calcagnì Alessia § ¶ Ballabio Andrea § ¶ ‖ ∗∗ Kubota Yoshiaki †† Schmidt Laura S. ‡‡ §§ Linehan W. Marston ‡‡ Ito Takaaki ¶¶ Baba Masaya babam@kumamoto-u.ac.jp ‖‖ ∗ Nishinakamura Ryuichi ryuichi@kumamoto-u.ac.jp ∗ ∗ ∗ † ‡ § ¶ ‖ ∗∗ †† ‡‡ §§ ¶¶ ‖‖ ∗ babam@kumamoto-u.ac.jp ryuichi@kumamoto-u.ac.jp 9 2025 09 6 2025 195 9 498163 1643 1659 22 5 2025 09 06 2025 03 10 2025 03 10 2025 © 2025 American Society for Investigative Pathology. Published by Elsevier Inc. 2025 American Society for Investigative Pathology https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). The mammalian kidney contains numerous nephrons connected to the collecting ducts, and each nephron consists of a glomerulus, a proximal tubule, the loop of Henle (LoH), and a distal tubule. Folliculin FLCN Flcn Flcn Flcn/Tfe3 Flcn/Tfeb Flcn Graphical abstract pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Nephrons in the kidney consist of glomeruli covered by Bowman’s capsule, the proximal tubule, the loop of Henle (LoH), and the distal tubule. The glomerulus is responsible for filtration of plasma, and the tubules function to reabsorb water and ions from the filtrate. Among the nephron segments, LoH has a unique loop structure that runs longitudinally along the corticomedullary axis and is essential for the production of hypertonic urine. 1 + 2 3 Birt-Hogg-Dubé (BHD) syndrome is an autosomal dominant syndrome characterized by renal cysts and tumors, benign skin papules, lung cysts, and spontaneous pneumothorax. 4 Folliculin FLCN 5 6 7 FLCN 8 9 FLCN activity is required for mTORC1-mediated phosphorylation of transcription factors EB (TFEB) and E3 (TFE3), whereas it is dispensable for the phosphorylation of other mTORC1 substrates such as ribosomal protein S6 kinase and eukaryotic translation initiation factor 4E-BP1 (4E-binding protein 1). 9 , 10 11 12 13 14 15 16 17 18 19 20 21 RagC/D 22 Genetic deletion of Flcn Flcn Cadherin16 Ksp Flcn 23 24 25 Flcn 26 , 27 Flcn 28 Flcn The current study focused on the Six2Cre 2 Flcn in vivo Flcn Tfeb Tfe3 Materials and Methods Animals Six2Cre , 2 Flcn 23 Tfeb, 16 Tfe3 29 Flcn flox/flox Six2Cre Flcn flox/+ Six2Cre Flcn flox/flox Flcn Tfe3 Six2Cre Flcn flox/+ Flcn flox/flox Tfe3 (X del/ X del ) Six2Cre Flcn flox/flox Tfe3 (X del/ Y) Tfe3 Flcn Tfeb Six2Cre Flcn flox/+ Tfeb flox/+ Flcn flox/flox Tfeb flox/flox All animal experiments were performed in accordance with institutional ethical guidelines and approved by the licensing committee of Kumamoto University (approval numbers: A2021-008, A2023-009, and A2024-073). Histology Mouse kidneys were fixed in 10% neutral buffered formalin for 24 hours and processed for paraffin embedding. Serial sections of 6 μm thick were cut, and every 10 sections were stained with hematoxylin and eosin (H&E). For Flcn Flcn/Tfe3 Flcn/Tfeb Quantification of Glomerular Cysts and Kidney Area The number of glomeruli with and without cysts was counted on an H&E–stained median sagittal kidney section from each mouse pup. Glomerular cysts were quantified by counting the total number of glomeruli identified by glomerular tufts; they were scored as cystic when a twofold to threefold dilatation of Bowman’s space was observed. 30 Immunohistochemistry For immunofluorescence staining, paraffin sections were deparaffinized followed by antigen retrieval in 10 mM citrate buffer (pH 6.0). Sections were washed three times with phosphate-buffered saline and blocked by incubation with 1% bovine serum albumin in phosphate-buffered saline for 1 hour at room temperature. The sections were then incubated with primary antibodies at 4°C overnight, followed by incubation with secondary antibodies conjugated with Alexa Fluor 488, 568, or 633 for 90 minutes at room temperature. The nuclei were counterstained with DAPI (#NQ215; Dojindo, Kumamoto, Japan). The following primary antibodies were used: rabbit anti-SIX2 (#11562-1-AP; 1:400 dilution; Proteintech, Rosemont, IL), rat anti-KRT8 (1:10; Developmental Studies Hybridoma Bank, Iowa City, IA), mouse anti–E-cadherin (CDH1) (#610181; 1:100; BD, Franklin Lakes, NJ); rabbit anti-NKCC2 (SLC12A1) (#SPC-401D; 1:100; StressMarq Biosciences, Victoria, BC, Canada), goat anti-NKCC2 (SLC12A1) (#PAS-142445; 1:100; Invitrogen, Carlsbad, CA), rabbit anti-phospho-S6 ribosomal protein (Ser 240/244) (#5364; 1:100; Cell Signaling Technology, Danvers, MA), rabbit anti-WT1 (#GR 3270281-4; 1:100; Abcam, Cambridge, UK,), LTL (#B-132; 1:200; Vector Laboratories, Newark, CA), guinea pig anti-NEPHRIN (#GP-N2, 1:200; PROGEN, Heidelberg, Germany), rabbit anti-TFE3 (#HPA023881; 1:100; Sigma-Aldrich, St. Louis, MN), and rabbit anti-TFEB (#A303-673A, lot numbers 8 and 9; Bethyl Laboratories, Montgomery, TX). 10 For staining of TFE3 and TFEB, sections were incubated with the primary antibodies followed by an anti-rabbit secondary antibody conjugated with peroxidase polymers from an ImmPRESS Reagent Kit (#MP-7401; Vector Laboratories). The sections were then incubated with Alexa Fluor 594-tyramide (# B40957 In Situ RNAscope analysis of 10% formalin-fixed paraffin sections was performed by using an RNAscope Multiplex Fluorescent Reagent Kit version 2 (catalog number 323100; Advanced Cell Diagnostics, Newark, CA) and TSA Plus reagents (fluorescein, #NEL741001KT; Cy3, #NEL744001KT; Cy5, #NEL745001KT; Akoya Biosciences, Marlborough, MA), as described previously. 31 , 32 scRNA-Seq Analysis scRNA-seq was performed on P0 kidneys, which were digested in 0.25% trypsin/EDTA for 10 minutes, as described previously. 31 , 32 LS002139 2 3 C10227 Aliquots containing 5000 dissociated cells from each sample were applied to a Chromium Controller (10x Genomics, Pleasanton, CA). A Chromium Single Cell 3′ Library & Gel Beads Kit version 3 (10x Genomics) was used to generate cDNA libraries, which were then sequenced by an HiSeq X Ten System (409,102,561 reads for Flcn Flcn The raw sequence data were processed using the cell ranger count command in Cell Ranger version 7.0.0 (10x Genomics) for heterozygote and KO samples to generate count tables of unique molecular identifiers for each gene per cell. At this point, each data set contained 35,671 and 35,862 genes, and 5572 and 5591 cells, respectively. All subsequent analyses were performed by using the R statistical programming language version 4.3.0 33 34 A principal component analysis was used for dimension reduction with a dimension value of 73 determined by the JackStrawPlot function. Normalization was performed by SCTransform with the top 3000 highly variable genes selected by the SelectIntegrationFeatures function. Integrated data were generated by IntegrateData using anchor genes created by FindIntegrationAnchors function, followed by scaling the data with regressing out cell cycle, high mitochondrial, ribosomal, and hemoglobin ratio. Cluster segmentation was performed by using a resolution value of 2.0. The FindClusters command generated a total of 18 clusters that were easily distinguished with cluster-specific marker genes obtained with the FindMarkers function of the Seurat package. Uniform Manifold Approximation and Projection for Dimension Reduction (UMAP) plots were generated by using the uwot package. The UMAP coordinates, Seurat cluster coordinates, and cluster-specific markers obtained were exported as csv files for confirmation analysis using Loupe Cell Browser version 8.0.0 (10x Genomics). The raw data were deposited in the National Center for Biotechnology Information Gene Expression Omnibus ( https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc= GSE287600 GSE287600 Volcano Plot, Gene Ontology, Dot Plot, and Violin Plot Analyses We first used the FindMarkers function to pick up genes that were differentially expressed between Flcn P P 35 Analysis Using the ChIP-Altas Database The ChIP-Altas data sets of all cell types (not limited to the kidney cell types) were used to obtain the gene lists of TFE3 or TFEB target candidates. 36 , 37 38 39 Statistical Analysis Bar graphs with plots were generated by using GraphPad Prism software version 10 (GraphPad Software, Boston, MA). Two-sided t U P Results Flcn To examine the role of Flcn Flcn Flcn flox/flox Flcn flox/+ ; Six2Cre Flcn Flcn Supplemental Figure S1 The KO mice that survived to 7 months displayed some large cortical cysts, the epithelia of which were positive for LTL (proximal tubule marker) or SLC12A1 (LoH marker) ( Supplemental Figure S1 Supplemental Figure S1 n Supplemental Figure S2 Supplemental Figure S2 We therefore mainly examined the newborn pups (P0). All 29 Flcn Six2Cre; Flcn flox/flox Figure 1 Figure 1 Flcn Figure 1 Figure 1 Figure 1 Flcn Figure 1 Figure 1 high negative Figure 1 Six2Cre Flcn Flcn Supplemental Figure S3 Flcn Figure 1 Flcn A B: Flcn flox/flox Flcn Six2Cre Flcn flox/flox N C D: Flcn E F: C D White asterisks: yellow asterisks: G H: yellow arrows lower left panels boxed regions arrowheads + + Flcn A B C D E–H NPs in the Flcn Six2Cre; Flcn flox/flox Flcn Six2Cre; Flcn flox/+ Flcn flox/flox , Six2Cre Six3 40 Six2Cre Six2 + Flcn Supplemental Figure S4 Supplemental Figure S4 Many Genes Are Up-regulated, Especially in the LoH To investigate the gene expression changes upon Flcn Flcn Flcn Supplemental Figure S4 Supplemental Figure S4 In the UMAP plots, the clusters for each nephron segment were clearly identified: NP, clusters 1, 3, and 15; glomerular podocyte, cluster 7; proximal tubule, clusters 14, 16, 19, 22, and 24; LoH, clusters 18 and 21; and distal tubule, cluster 29 ( Figure 2 Figure 2 Supplemental Figure S5 Supplemental Figure S6 Supplemental Figure S7 Supplemental Figure S8 Six2 Cited1 Supplemental Figure S8 Figure 2 Single-cell RNA sequencing analysis reveals many up-regulated genes in the loop of Henle (LoH). A: Flcn B: C: D: Flcn Gene Ontology analysis of the differentially expressed genes in LoH revealed that the up-regulated genes were related to mTORC1 activation, lipid metabolism, and lysosomal activity ( Figure 2 Supplemental Figure S5 Supplemental Figure S6 Supplemental Figure S7 The representative dot plots and UMAP plots showed differentially expressed genes between Flcn Rag C (Rragc), Rag D (Rragd), Lamtor1 , Mtor, Fnip2 Atp6v0d2 Rab27a Figures 3 4 Supplemental Figure S9 Figure 3 Differentially expressed genes in Flcn Figure 2 Figure 4 Uniform Manifold Approximation and Projection for Dimension Reduction plots of representative up-regulated genes in Flcn Atp6v0d2 Rab27a Lamtor1 R r a gd Fnip2 Slc12a1 Figure 2 Highly sensitive in situ Flcn Atp6v0d2 Slc12a1 Figure 4 Atp6v0d2 41 , 42 Flcn Figure 5 Slc12a1, Atp6v0d2 43 Figure 5 44 Flcn Figure 5 Slc12a1, Figure 5 Transcription factor E3 (TFE3) and mammalian target of rapamycin complex 1 (mTORC1) are activated in Flcn A–D: In situ Atp6v0d2 and Rab27a Flcn flox/flox Slc12a1 right panels boxed regions left panels E–H: E F G H white arrowheads yellow arrowheads Flcn right panels boxed regions left panels I–L: yellow arrows Flcn right panels boxed regions left panels A–D E–L Taken together, genes associated with mTORC1 and lysosomal activity were up-regulated upon Flcn 10 , 45 RagC RagD TFE3, TFEB, and mTORC1 Are Activated in Flcn The ChIP-Atlas database 36 , 37 Figure 2 Supplemental Figure S5 S6 S7 Figure 2 Supplemental Figure S5 S6 S7 39 Flcn scRNA-seq analysis, including UMAP plots and violin plots, did not show a significant increase in mRNA per cell of either Tfe3 Tfeb Flcn Supplemental Figure S9 Flcn Figure 5 Flcn Figure 5 Figure 6 Figure 6 Figure 6 Transcription factor EB (TFEB) is activated in Flcn A-D: A B C D yellow arrowheads yellow arrows Flcn White arrowheads right panels boxed regions left panels E F: right panels boxed regions left panels A–F mTORC1 activity was examined next. The downstream target of mTORC1, pS6, was highly phosphorylated in both the cortex and medulla of Flcn Figure 5 Figure 5 Supplemental Figure S3 Thus, TFE3, TFEB, and mTORC1 are activated in the Flcn 10 Tfe3 Flcn Double Flcn Tfe3 Flcn Tfe3 Tfe3 Tfe3 Six2Cre Flcn flox/+ Flcn flox/flox Tfe3 (X del/ X del Figure 7 Flcn; Tfe3 Flcn;Tfe3 Figure 7 Figure 7 Tfe3 Flcn A: Flcn Tfe3 Tfe3 B C: D E: Flcn Six2Cre; Flcn flox/flox Flcn Tfe3 Six2Cre Flcn flox/flox Tfe3 del/Y Black arrows F: Flcn Flcn Tfe3 G–J: yellow asterisks right panels boxed regions left panels P P B E G– J The glomerular cysts were reduced in the double KOs compared with their controls, as analyzed by H&E staining ( Figure 7 Figure 7 Figure 7 Figure 7 Flcn Supplemental Figure S10 Tfe3 Flcn Tfeb Flcn Mice lacking both Flcn Tfeb Tfeb Flcn Flcn Flcn Tfeb Flcn; Tfeb Supplemental Figure S11 Flcn Figure 8 Figure 8 Figure 8 Figure 8 Figure 8, I Flcn Figure 8 Tfeb Flcn A B: Flcn Flcn Tfeb black arrows C D: Left panel: right panel: Yellow arrowheads yellow asterisk: yellow arrows: Flcn E F: right panels boxed regions left panels G–J: right panels boxed regions left panels A–J Discussion The nephron-specific Flcn Flcn Flcn Flcn Tfeb Tfe3 FLCN Flcn Flcn Flcn KspCre Flcn 23 46 Flcn It is interesting that the LoH displayed a more severe phenotype than the glomeruli or the proximal tubules. Immunostaining showed that pS6 staining was high in cortical proximal tubules but low in medullary LoH in control mice. Thus, the increase in S6 kinase activity in Flcn Flcn Tfeb 47 48 49 Flcn 28 Flcn KspCre Flcn 23 , 25 , 27 , 45 Six2Cre KspCre Six2Cre KspCre 2 , 25 , 40 , 50 Flcn Flcn; Tfeb KspCre: Flcn 10 , 45 Tfeb, Tfe3, Flcn Flcn 45 Flcn 51 The establishment of human disease models is also important. Recent advances in kidney organoids will enable such studies. Several protocols for generating nephron and collecting duct organoids have been established 52 53 54 FLCN 54 Disclosure Statement A.B. is cofounder and shareholder of Casma Therapeutics and an advisory board member of Avilar and Amplify Therapeutics. References 1 Nakai S. Sugitani Y. Sato H. Ito S. Miura Y. Ogawa M. Nishi M. Jishage K.-I. Minowa O. Noda T. Crucial roles of Brn1 in distal tubule formation and function in mouse kidney Development 130 2003 4751 4759 12925600 10.1242/dev.00666 2 Kobayashi A. Valerius M.T. Mugford J.W. Carroll T.J. Self M. Oliver G. McMahon A.P. Six2 defines and regulates a multipotent self-renewing nephron progenitor population throughout mammalian kidney development Cell Stem Cell 3 2008 169 181 18682239 10.1016/j.stem.2008.05.020 PMC2561900 3 Shakya R. Watanabe T. Costantini F. The role of GDNF/Ret signaling in ureteric bud cell fate and branching morphogenesis Dev Cell 8 2005 65 74 15621530 10.1016/j.devcel.2004.11.008 4 Birt A.R. Hogg G.R. Dubé W.J. Hereditary multiple fibrofolliculomas with trichodiscomas and acrochordons Arch Dermatol 113 1977 1674 1677 596896 5 Nickerson M.L. Warren M.B. Toro J.R. Matrosova V. Glenn G. Turner M.L. Duray P. Merino M. Choyke P. Pavlovich C.P. Sharma N. Walther M. Munroe D. Hill R. Maher E. Greenberg C. Lerman M.I. Linehan W.M. Zbar B. Schmidt L.S. Mutations in a novel gene lead to kidney tumors, lung wall defects, and benign tumors of the hair follicle in patients with the Birt-Hogg-Dubé syndrome Cancer Cell 2 2002 157 164 12204536 10.1016/s1535-6108(02)00104-6 6 Schmidt L.S. Linehan W.M. Molecular genetics and clinical features of Birt-Hogg-Dubé syndrome Nat Rev Urol 12 2015 558 569 26334087 10.1038/nrurol.2015.206 PMC5119524 7 Schmidt L.S. Linehan W.M. FLCN: The causative gene for Birt-Hogg-Dubé syndrome Gene 640 2018 28 42 28970150 10.1016/j.gene.2017.09.044 PMC5682220 8 Baba M. Hong S.-B. Sharma N. Warren M.B. Nickerson M.L. Iwamatsu A. Esposito D. Gillette W.K. Hopkins R.F. 3rd Hartley J.L. Furihata M. Oishi S. Zhen W. Burke T.R. Jr. Linehan W.M. Schmidt L.S. Zbar B. Folliculin encoded by the BHD gene interacts with a binding protein, FNIP1, and AMPK, and is involved in AMPK and mTOR signaling Proc Natl Acad Sci U S A 103 2006 15552 15557 17028174 10.1073/pnas.0603781103 PMC1592464 9 Lawrence R.E. Fromm S.A. Fu Y. Yokom A.L. Kim D.J. Thelen A.M. Young L.N. Lim C.-Y. Samelson A.J. Hurley J.H. Zoncu R. Structural mechanism of a Rag GTPase activation checkpoint by the lysosomal folliculin complex Science 366 2019 971 977 31672913 10.1126/science.aax0364 PMC6945816 10 Napolitano G. Di Malta C. Esposito A. de Araujo M.E.G. Pece S. Bertalot G. Matarese M. Benedetti V. Zampelli A. Stasyk T. Siciliano D. Venuta A. Cesana M. Vilardo C. Nusco E. Monfregola J. Calcagnì A. Di Fiore P.P. Huber L.A. Ballabio A. A substrate-specific mTORC1 pathway underlies Birt-Hogg-Dubé syndrome Nature 585 2020 597 602 32612235 10.1038/s41586-020-2444-0 PMC7610377 11 Napolitano G. Di Malta C. Ballabio A. Non-canonical mTORC1 signaling at the lysosome Trends Cell Biol 32 2022 920 931 35654731 10.1016/j.tcb.2022.04.012 12 Sardiello M. Palmieri M. di Ronza A. Medina D.L. Valenza M. Gennarino V.A. Di Malta C. Donaudy F. Embrione V. Polishchuk R.S. Banfi S. Parenti G. Cattaneo E. Ballabio A. A gene network regulating lysosomal biogenesis and function Science 325 2009 473 477 19556463 10.1126/science.1174447 13 Settembre C. De Cegli R. Mansueto G. Saha P.K. Vetrini F. Visvikis O. Huynh T. Carissimo A. Palmer D. Jürgen Klisch T. Wollenberg A.C. Di Bernardo D. Chan L. Irazoqui J.E. Ballabio A. TFEB controls cellular lipid metabolism through a starvation-induced autoregulatory loop Nat Cell Biol 15 2013 647 658 23604321 10.1038/ncb2718 PMC3699877 14 Martina J.A. Diab H.I. Lishu L. Jeong A.L. Patange S. Raben N. Puertollano R. The nutrient-responsive transcription factor TFE3 promotes autophagy, lysosomal biogenesis, and clearance of cellular debris Sci Signal 7 2014 ra9 24448649 10.1126/scisignal.2004754 PMC4696865 15 Roczniak-Ferguson A. Petit C.S. Froehlich F. Qian S. Ky J. Angarola B. Walther T.C. Ferguson S.M. The transcription factor TFEB links mTORC1 signaling to transcriptional control of lysosome homeostasis Sci Signal 5 2012 ra42 22692423 10.1126/scisignal.2002790 PMC3437338 16 Settembre C. Zoncu R. Medina D.L. Vetrini F. Erdin S. Erdin S. Huynh T. Ferron M. Karsenty G. Vellard M.C. Facchinetti V. Sabatini D.M. Ballabio A. A lysosome-to-nucleus signalling mechanism senses and regulates the lysosome via mTOR and TFEB EMBO J 31 2012 1095 1108 22343943 10.1038/emboj.2012.32 PMC3298007 17 Martina J.A. Chen Y. Gucek M. Puertollano R. MTORC1 functions as a transcriptional regulator of autophagy by preventing nuclear transport of TFEB Autophagy 8 2012 903 914 22576015 10.4161/auto.19653 PMC3427256 18 Hong S.-B. Oh H. Valera V.A. Baba M. Schmidt L.S. Linehan W.M. Inactivation of the FLCN tumor suppressor gene induces TFE3 transcriptional activity by increasing its nuclear localization PLoS One 5 2010 e15793 10.1371/journal.pone.0015793 PMC3012117 21209915 19 Petit C.S. Roczniak-Ferguson A. Ferguson S.M. Recruitment of folliculin to lysosomes supports the amino acid-dependent activation of Rag GTPases J Cell Biol 202 2013 1107 1122 24081491 10.1083/jcb.201307084 PMC3787382 20 Baba M. Toyama H. Sun L. Takubo K. Suh H.-C. Hasumi H. Nakamura-Ishizu A. Hasumi Y. Klarmann K.D. Nakagata N. Schmidt L.S. Linehan W.M. Suda T. Keller J.R. Loss of folliculin disrupts hematopoietic stem cell quiescence and homeostasis resulting in bone marrow failure Stem Cells 34 2016 1068 1082 27095138 10.1002/stem.2293 PMC4843833 21 Endoh M. Baba M. Endoh T. Hirayama A. Nakamura-Ishizu A. Umemoto T. Hashimoto M. Nagashima K. Soga T. Lang M. Schmidt L.S. Linehan W.M. Suda T. A FLCN-TFE3 feedback loop prevents excessive glycogenesis and phagocyte activation by regulating lysosome activity Cell Rep 30 2020 1823 1834.e5 32049013 10.1016/j.celrep.2020.01.042 PMC8459211 22 Di Malta C. Siciliano D. Calcagni A. Monfregola J. Punzi S. Pastore N. Eastes A.N. Davis O. De Cegli R. Zampelli A. Di Giovannantonio L.G. Nusco E. Platt N. Guida A. Ogmundsdottir M.H. Lanfrancone L. Perera R.M. Zoncu R. Pelicci P.G. Settembre C. Ballabio A. Transcriptional activation of RagD GTPase controls mTORC1 and promotes cancer growth Science 356 2017 1188 1192 28619945 10.1126/science.aag2553 PMC5730647 23 Baba M. Furihata M. Hong S.-B. Tessarollo L. Haines D.C. Southon E. Patel V. Igarashi P. Alvord W.G. Leighty R. Yao M. Bernardo M. Ileva L. Choyke P. Warren M.B. Zbar B. Linehan W.M. Schmidt L.S. Kidney-targeted Birt-Hogg-Dube gene inactivation in a mouse model: Erk1/2 and Akt-mTOR activation, cell hyperproliferation, and polycystic kidneys J Natl Cancer Inst 100 2008 140 154 18182616 10.1093/jnci/djm288 PMC2704336 24 Chen J. Futami K. Petillo D. Peng J. Wang P. Knol J. Li Y. Khoo S.-K. Huang D. Qian C.-N. Zhao P. Dykyma K. Zhang R. Cao B. Yang X.J. Furge K. Williams B.O. Teh B.T. Deficiency of FLCN in mouse kidney led to development of polycystic kidneys and renal neoplasia PLoS One 3 2008 e3581 10.1371/journal.pone.0003581 PMC2570491 18974783 25 Bonucci M. Kuperwasser N. Barbe S. Koka V. de Villeneuve D. Zhang C. Srivastava N. Jia X. Stokes M.P. Bienaimé F. Verkarre V. Lopez J.B. Jaulin F. Pontoglio M. Terzi F. Delaval B. Piel M. Pende M. mTOR and S6K1 drive polycystic kidney by the control of Afadin-dependent oriented cell division Nat Commun 11 2020 3200 32581239 10.1038/s41467-020-16978-z PMC7314806 26 Hasumi Y. Baba M. Ajima R. Hasumi H. Valera V.A. Klein M.E. Haines D.C. Merino M.J. Hong S.-B. Yamaguchi T.P. Schmidt L.S. Linehan W.M. Homozygous loss of BHD causes early embryonic lethality and kidney tumor development with activation of mTORC1 and mTORC2 Proc Natl Acad Sci U S A 106 2009 18722 18727 19850877 10.1073/pnas.0908853106 PMC2765925 27 Cash T.P. Gruber J.J. Hartman T.R. Henske E.P. Simon M.C. Loss of the Birt-Hogg-Dubé tumor suppressor results in apoptotic resistance due to aberrant TGF[beta]-mediated transcription Oncogene 30 2011 2534 2546 21258407 10.1038/onc.2010.628 PMC3109270 28 Chen J. Huang D. Rubera I. Futami K. Wang P. Zickert P. Khoo S.-K. Dykema K. Zhao P. Petillo D. Cao B. Zhang Z. Si S. Schoen S.R. Yang X.J. Zhou M. Xiao G.-Q. Wu G. Nordenskjöld M. Tauc M. Williams B.O. Furge K.A. Teh B.T. Disruption of tubular Flcn expression as a mouse model for renal tumor induction Kidney Int 88 2015 1057 1069 26083655 10.1038/ki.2015.177 29 Steingrimsson E. Tessarollo L. Pathak B. Hou L. Arnheiter H. Copeland N.G. Jenkins N.A. Mitf and Tfe3, two members of the Mitf-Tfe family of bHLH-Zip transcription factors, have important but functionally redundant roles in osteoclast development Proc Natl Acad Sci U S A 99 2002 4477 4482 11930005 10.1073/pnas.072071099 PMC123673 30 Rasouly H.M. Kumar S. Chan S. Pisarek-Horowitz A. Sharma R. Xi Q.J. Nishizaki Y. Higashi Y. Salant D.J. Maas R.L. Lu W. Loss of Zeb2 in mesenchyme-derived nephrons causes primary glomerulocystic disease Kidney Int 90 2016 1262 1273 27591083 10.1016/j.kint.2016.06.037 PMC5123919 31 Naganuma H. Miike K. Ohmori T. Tanigawa S. Ichikawa T. Yamane M. Eto M. Niwa H. Kobayashi A. Nishinakamura R. Molecular detection of maturation stages in the developing kidney Dev Biol 470 2021 62 73 33197428 10.1016/j.ydbio.2020.11.002 32 Tanigawa S. Tanaka E. Miike K. Ohmori T. Inoue D. Cai C.-L. Taguchi A. Kobayashi A. Nishinakamura R. Generation of the organotypic kidney structure by integrating pluripotent stem cell-derived renal stroma Nat Commun 13 2022 611 35105870 10.1038/s41467-022-28226-7 PMC8807595 33 R Core Team R: A Language and Environment for Statistical Computing 2018 R Foundation for Statistical Computing Vienna, Austria 34 RStudio Team RStudio: Integrated Development for R 2020 RStudio, PBC Boston, MA 35 Zhou Y. Zhou B. Pache L. Chang M. Khodabakhshi A.H. Tanaseichuk O. Benner C. Chanda S.K. Metascape provides a biologist-oriented resource for the analysis of systems-level datasets Nat Commun 10 2019 1523 30944313 10.1038/s41467-019-09234-6 PMC6447622 36 Oki S. Ohta T. Shioi G. Hatanaka H. Ogasawara O. Okuda Y. Kawaji H. Nakaki R. Sese J. Meno C. ChIP-Atlas: a data-mining suite powered by full integration of public ChIP-seq data EMBO Rep 19 2018 1 10 30413482 10.15252/embr.201846255 PMC6280645 37 Zou Z. Ohta T. Oki S. ChIP-Atlas 3.0: A data-mining suite to explore chromosome architecture together with large-scale regulome data Nucleic Acids Res 52 2024 W45 W53 38749504 10.1093/nar/gkae358 PMC11223792 38 Hulsen T. BioVenn—an R and Python package for the comparison and visualization of biological lists using area-proportional Venn diagrams Data Sci 4 2021 51 61 10.1186/1471-2164-9-488 PMC2584113 18925949 39 Palmieri M. Impey S. Kang H. di Ronza A. Pelz C. Sardiello M. Ballabio A. Characterization of the CLEAR network reveals an integrated control of cellular clearance pathways Hum Mol Genet 20 2011 3852 3866 21752829 10.1093/hmg/ddr306 40 Perl A.J. Liu H. Hass M. Adhikari N. Chaturvedi P. Hu Y.-C. Jiang R. Liu Y. Kopan R. Reduced nephron endowment in Six2-TGC tg mice is due to Six3 misexpression by aberrant enhancer-promoter interactions in the transgene J Am Soc Nephrol 35 2024 566 577 38447671 10.1681/ASN.0000000000000324 PMC11149036 41 Smith A.N. Borthwick K.J. Karet F.E. Molecular cloning and characterization of novel tissue-specific isoforms of the human vacuolar H+-ATPase C, G and d subunits, and their evaluation in autosomal recessive distal renal tubular acidosis Gene 297 2002 169 177 12384298 10.1016/s0378-1119(02)00884-3 42 Shin Y.K. Jo Y.R. Lee S.H. Park H.T. Shin J.E. Regulation of the V-ATPase subunit ATP6V0D2 and its role in demyelination after peripheral nerve injury Biochem Biophys Res Commun 646 2023 1 7 36689911 10.1016/j.bbrc.2023.01.039 43 Saxena V. Gao H. Arregui S. Zollman A. Kamocka M.M. Xuei X. McGuire P. Hutchens M. Hato T. Hains D.S. Schwaderer A.L. Kidney intercalated cells are phagocytic and acidify internalized uropathogenic Escherichia coli Nat Commun 12 2021 2405 33893305 10.1038/s41467-021-22672-5 PMC8065053 44 Johnson J.L. Monfregola J. Napolitano G. Kiosses W.B. Catz S.D. Vesicular trafficking through cortical actin during exocytosis is regulated by the Rab27a effector JFC1/Slp1 and the RhoA-GTPase-activating protein Gem-interacting protein Mol Biol Cell 23 2012 1902 1916 22438581 10.1091/mbc.E11-12-1001 PMC3350554 45 Di Malta C. Zampelli A. Granieri L. Vilardo C. De Cegli R. Cinque L. Nusco E. Pece S. Tosoni D. Sanguedolce F. Sorrentino N.C. Merino M.J. Nielsen D. Srinivasan R. Ball M.W. Ricketts C.J. Vocke C.D. Lang M. Karim B. Lanfrancone L. Schmidt L.S. Linehan W.M. Ballabio A. TFEB and TFE3 drive kidney cystogenesis and tumorigenesis EMBO Mol Med 15 2023 e16877 10.15252/emmm.202216877 PMC10165358 36987696 46 Pavlovich C.P. Walther M.M. Eyler R.A. Hewitt S.M. Zbar B. Linehan W.M. Merino M.J. Renal tumors in the Birt-Hogg-Dubé syndrome Am J Surg Pathol 26 2002 1542 1552 12459621 10.1097/00000478-200212000-00002 47 Okada T. Iwamoto A. Mukamoto M. Nakamura J. Kusakabe K. Kiso Y. Morioka H. Morikawa Y. Perinatal development of the rat kidney: apoptosis and epidermal growth factor Congenit Anom (Kyoto) 43 2003 161 167 14684965 10.1111/j.1741-4520.2003.tb01039.x 48 Vogetseder A. Picard N. Gaspert A. Walch M. Kaissling B. Le Hir M. Proliferation capacity of the renal proximal tubule involves the bulk of differentiated epithelial cells Am J Cell Physiol 294 2008 C22 C28 10.1152/ajpcell.00227.2007 17913845 49 Lu Y.-A. Liao C.-T. Raybould R. Talabani B. Grigorieva I. Szomolay B. Bowen T. Andrews R. Taylor P.R. Fraser D. Single-nucleus RNA sequencing identifies new classes of proximal tubular epithelial cells in kidney fibrosis J Am Soc Nephrol 32 2021 2501 2516 34155061 10.1681/ASN.2020081143 PMC8722798 50 Shao X. Somlo S. Igarashi P. Epithelial-specific Cre/lox recombination in the developing kidney and genitourinary tract J Am Soc Nephrol 13 2002 1837 1846 12089379 10.1097/01.asn.0000016444.90348.50 51 Lin Y. Shi Q. Yang G. Shi F. Zhou Y. Wang T. Xu P. Li P. Liu Z. Sun H. Zhao Z. Ding K. Wang Z. Feng H. Yu B. Fang P. Wang J. A small-molecule drug inhibits autophagy gene expression through the central regulator TFEB Proc Natl Acad Sci U S A 120 2023 e2213670120 10.1073/pnas.2213670120 PMC9963785 36749723 52 Taguchi A. Kaku Y. Ohmori T. Sharmin S. Ogawa M. Sasaki H. Nishinakamura R. Redefining the in vivo origin of metanephric nephron progenitors enables generation of complex kidney structures from pluripotent stem cells Cell Stem Cell 14 2014 53 67 24332837 10.1016/j.stem.2013.11.010 53 Taguchi A. Nishinakamura R. Higher-order kidney organogenesis from pluripotent stem cells Cell Stem Cell 21 2017 730 746 29129523 10.1016/j.stem.2017.10.011 54 Nishinakamura R. Advances and challenges toward developing kidney organoids for clinical applications Cell Stem Cell 30 2023 1017 1027 37541208 10.1016/j.stem.2023.07.011 Supplemental Data  Supplemental Figure S1 Surviving adult Flcn A: Flcn B C: Flcn D E: Flcn Flcn F G: Flcn Flcn H: P B C D–G Supplemental Figure S2 Clusters of loop of Henle (LoH) cells in 7-month–old Flcn A B: Flcn C D: Flcn E F: A–F Supplemental Figure S3 No apparent phenotypes in Flcn A B: Flc C D: Flc yellow asterisks yellow arrowheads yellow arrows E F: Flc A B C F Supplemental Figure S4 Nephron progenitors are mildly reduced at birth. A B: Flcn + C D: Flcn E F: Flcn A F Supplemental Figure S5 Differentially expressed (DE) genes in podocytes (Pod) between Flcn Supplemental Figure S6 Differentially expressed (DE) genes in proximal tubules (PT) between Flcn Supplemental Figure S7 Differentially expressed (DE) genes in nephron progenitors (NP) between Flcn Supplemental Figure S8 Mild phenotypes of nephron progenitors (NPs) in Flcn A: B: Six2 Cited1 Supplemental Figure S9 Uniform Manifold Approximation and Projection for Dimension Reduction plots and violin plots of representative genes in Flcn Mtor Fnip1 R r a gc Umod Tfe3 Tfeb Supplemental Figure S10 Reduced staining of phosphorylated S6 ribosomal protein (pS6) in the Bowman’s capsule of Flcn; Tfe3 A B: Flcn Flcn; Tfe3 yellow arrows Flcn P C D: Flcn Flcn; Tfe3 right panels boxed regions left panels E F: Flcn Flcn; Tfe3 right panels left panels A–F Supplemental Figure S11 Reduced staining of transcription factor EB (TFEB) in the loop of Henle of Flcn; Tfeb A B: yellow arrowheads Flcn; Tfeb Flcn right panels boxed regions left panels white arrowheads A B Acknowledgments We thank Sayoko Fujimura, Shingo Usuki, Nobuko Irie, and Yuko Nakaishi-Fukuchi for experimental assistance; Drs. Takaya Yamamoto, Shintaro Funasaki, and Sally Mehanna for technical advice and assistance; and all the members of the Nishinakamura and Baba laboratories and Dr. Tomomi Kamba for helpful discussions. Author Contributions R.N. and M.B. conceptualized the study; O.S. and R.N. developed methodology; O.S., K.M., T.O., L.A.W.K., T.I., and S.T. performed experiments; M.B, R.N., A.C., A.B., Y. K., L.S.S., and W.M.L. provided resources; O.S. and R.N. wrote the manuscript; and R.N, M.B, L.S.S. and A.B. edited the manuscript. Supported in part by 10.13039/501100001691 JSPS KAKENHI JP21H05050 10.13039/501100001691 JSPS KAKENHI JP24K23941 Inter-University Research Network IMEG 10.13039/501100004091 Kumamoto University Intramural Research Program of the NIH 10.13039/100000054 National Cancer Institute 10.13039/100031022 Center for Cancer Research 10.13039/100000054 National Cancer Institute 10.13039/100000002 NIH The content of this publication does not necessarily reflect the views or policies of the Department of Health and Human Services, nor does mention of trade names, commercial products, or organizations imply endorsement by the US Government. Supplemental material for this article can be found at https://doi.org/10.1016/j.ajpath.2025.05.010 ",
  "metadata": {
    "Title of this paper": "Advances and challenges toward developing kidney organoids for clinical applications",
    "Journal it was published in:": "The American Journal of Pathology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489385/"
  }
}