{
  "title": "Paper_885",
  "abstract": "pmc Biochem Biophys Rep Biochem Biophys Rep 3295 bbpr Biochemistry and Biophysics Reports 2405-5808 Elsevier PMC12477849 PMC12477849.1 12477849 12477849 41030780 10.1016/j.bbrep.2025.102272 S2405-5808(25)00359-0 102272 1 Research Article The effect of general anesthetics on neutrophil-like differentiated HL60 cells: sevoflurane activates the mitochondrial function to promote their bactericidal action Asei Kosuke kei90@med.kobe-u.ac.jp ⁎ Nomura Yuki Fujimoto Daichi Ooi Mayu Obata Norihiko Mizobuchi Satoshi Department of Anesthesiology, Kobe University Graduate School of Medicine, Kobe, Hyogo, Japan ⁎ kei90@med.kobe-u.ac.jp 12 2025 19 9 2025 44 495892 102272 7 4 2025 6 9 2025 15 9 2025 19 09 2025 30 09 2025 01 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Background Recent research has suggested that general anesthetics may affect the immune system, but it is unclear how they affect the mitochondria of neutrophils. The effects of general anesthetics on neutrophil-like differentiated HL60 cells mitochondrial function and their production of reactive oxygen species (ROS) were examined in this study. Methods HL60 cells were differentiated into neutrophil-like cells by treating them with 1 μM all-trans-retinoic acid for 4 days. The differentiated HL60 cells were exposed to propofol (4 μg ml −1 −1 Results Administration of propofol or midazolam activated neutrophil-like differentiated HL60 cells mitochondrial respiration and increased ATP production (P < 0.05). However, there was no significant change in production of ROS or cell death. Exposure to sevoflurane activated mitochondrial respiration, ATP production (P < 0.05) and ROS production (P < 0.05). Additionally, exposure to sevoflurane led to a significant increase in phagocytosis. Filamentous mitochondria appeared after treatment with propofol, midazolam, and sevoflurane, while fragmented and filamentous mitochondria were seen in untreated neutrophil-like differentiated HL60 cells. Conclusion We investigated the effects of three anesthetics on the mitochondrial and bactericidal functions of differentiated HL60 cells. Our results indicate that sevoflurane activates mitochondrial function in differentiated HL60 cells, promotes the production of reactive oxygen species, and enhances bactericidal activity. Graphical abstract Image 1 Highlights • We investigated the effects of three anesthetics on the mitochondrial and bactericidal functions of differentiated HL60 cells. • Propofol and midazolam activate mitochondrial function in differentiated HL60 cells without significant changes in the production of reactive oxygen species. • Sevoflurane activates mitochondrial function in differentiated HL60 cells, promotes the production of reactive oxygen species, and enhances bactericidal activity. Keywords Neutrophil-like differentiated HL60 cell General anesthetics Mitochondrial metabolism Mitochondrial respiration Reactive oxygen species pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Stress associated with surgery can reduce a patient's immunity and delay recovery after surgery. It has long been thought that general and local anesthetics used during surgery can impact immune function during the perioperative period [ 1 [2] [3] [4] [5] [6] [7] 8 9 Mitochondria are intracellular organelles that are important for the functioning of immune cells and for the production of adenosine triphosphate (ATP) and ROS. ROS, which are produced as a by-product in the process of mitochondria producing energy, are highly reactive and have the risk of causing cell death through DNA damage. On the other hand, it has also been shown that ROS function as important molecules that are responsible for signal transduction, such as activation of immune cells. ROS produced from mitochondria activate immune cell function and release signal transduction molecules [ 10 11 12 13 14 15 16 2 Materials and methods 2.1 Cell culture and cell differentiation The HL60 cell line (JCRB0085) was obtained from JCRB Cell Bank (Osaka, Japan). It was maintained in Roswell Park Memorial Institute (RPMI) 1640 medium (Thermo Fisher, Waltham, MA, USA) supplemented with 10 % fetal bovine serum (Thermo Fisher, Waltham, MA, USA) and 100 units ml −1 2 17 2.2 NBT (nitro blue tetrazolium) dye reduction assay 5 × 10 5 2.3 Stimulation of cells using general anesthetics The anesthetics that were tested were propofol (Maruishi Pharmaceutical Co., Ltd., Osaka, Japan), midazolam (Sandoz, Tokyo, Japan), and sevoflurane (Maruishi Pharmaceutical Co., Ltd., Osaka, Japan), based on clinical usage concentrations. HL60 cells were cultured in a medium containing 4 μg ml −1 2 18 −1 3 19 7 20 2.4 Mitochondrial activity assay The Seahorse XFe96 extracellular flux analyzer (Agilent Technologies, Santa Clara, CA, USA) was used to measure mitochondrial oxygen consumption rate (OCR), ATP production, and maximum respiration [ 21 l 5 2.5 ROS production assay One x 10 5 22 23 24 2.6 Apoptosis assay We used the Annexin V-FITC/PI assay kit (MBL, Tokyo, Japan) according to the manufacturer's protocol. The cells were stained with annexin V and propidium iodide (PI) for 15 min at room temperature in the dark. The cells were subsequently analyzed using the BZ-X700 microscope along with BZ-X800 analysis software. To evaluate cell death, we calculated the percentage of cells that were positive for annexin V, PI, or both relative to the total number of cells [ 25 2.7 Cell viability and cytotoxicity assay Cell viability was assessed by morphological assessment under bright-field microscopy; cells with intact membranes and refractile appearance were scored as viable. Cell viability was calculated by dividing the number of viable cells by the total number of cells. Cell viability and Cytotoxicity were measured using the MTT assay (Premix WST-1 Cell Proliferation Assay System, Takara Bio Inc, Shiga, Japan) that utilizes a reagent to measure cell proliferation and viability through chromogenic analysis. Specifically, the tetrazolium salt (WST-1) is converted into formazan dye by the mitochondrial dehydrogenase present in living cells. We seeded 4 × 10 4 2 2.8 pHrodo bioparticles phagocytosis assay We used pHrodo Bioparticles to analyze the impact of anesthetics on the bactericidal activity associated with phagocytosis of differentiated HL60 cells. First, we seeded 0.8 × 10 6 −1 26 2.9 Mitochondrial morphology Cells were placed in 96-well plates and stained with Mito Bright LT Green probes (DOJINDO, Kumamoto, Japan, excitation: 488 nm, emission: 500–560 nm) and Hoechst 33342 solution (excitation: 352 nm, emission: 461 nm) according to the manufacturer's instructions. Fluorescent images were captured using the BZ-X700 microscope. Fluorescent microscope filters were as follows: GFP filter (excitation: 470/40, emission: 525/50) for Mito Bright LT Green and DAPI filter (excitation: 360/40, emission: 460/50) for Hoechst 33342. The intensity of Mito Bright LT Green fluorescence was measured using imageJ, and the level of mitochondrial expression was evaluated. Fifty Mito Bright LT Green-positive cells were selected to assess the average fluorescence Intensity. We used the LSM700 confocal laser microscope (Carl Zeiss, Jena, Germany) to observe the mitochondria in more detail. Excitation wavelengths of 488 nm for Mito Bright LT Green and 405 nm for Hoechst 33342 as well as appropriate filters were used. After staining, cell fluid was sealed on a glass slide for observation. We quantified the morphology of mitochondria by measuring the aspect ratio (length-to-width ratio) using ImageJ [ 27 2.10 Statistical analysis Each independent experiment was repeated at least twice. Independent experiments were performed three times for Figure 1 Fig. 2 Fig. 3 Supplementary Figs. 2–4 Fig. 4 Supplementary Figs. 1, 5, 6 Fig. 1 Supplementary Fig. S2 Fig. 2 Fig. 3 Fig. 4 Supplementary Fig. S3 Supplementary Fig. S1 Supplementary Figs. S4 and S5 Supplementary Fig. S6 Fig. 1 U Figure 1 General anesthetics activated mitochondrial respiration in differentiated HL60 cells. The measured parameters include basal respiration (A, D), ATP production (B, E), and maximum respiration (C, F) after 1 h and 5 h of anesthesia. Each bar in the graphs represents the mean ± standard deviation. Independent experiments were performed three times. Replicate wells per experiment was n = 4–10. To reduce variability, the data from all experiments were analyzed collectively. Analysis was performed by using the Kruskal-Wallis test followed by Dunn's multiple comparison test. Statistical significance is indicated as follows: ∗p < 0.05, ∗∗p < 0.01, ∗∗∗p < 0.001, ∗∗∗∗p < 0.0001. Figure 1 Fig. 2 General anesthetics affect the production of reactive oxygen species (ROS) in differentiated HL60 cells. The production of ROS was assessed after 1 h and 5 h of anesthesia (A). The increase in the production of ROS caused by 3 % sevoflurane anesthesia was reduced by mitochondrial respiratory inhibitors, rotenone and antimycin (Rot/AA) (B). Each bar in the graphs represents the mean ± standard deviation. Independent experiments were performed three times. Replicate wells per experiment was n = 5. Analysis was performed by using the Kruskal-Wallis test followed by Dunn's multiple comparison test. Statistical significance is indicated as follows: ∗p < 0.05, ∗∗p < 0.01, ∗∗∗p < 0.001. Fig. 2 Fig. 3 The bactericidal effect of ROS was investigated by examining phagocytosis rates in the presence of general anesthetics. Sevoflurane significantly increased bactericidal activity compared to that in the control groups at both 1 h and 5 h of anesthesia (A–C). Red coloring indicates ROS-producing cells related to phagocytosis (white arrow). Blue indicates the nucleus. The white bar in the image represents a scale of 20 μm (A, B). Each bar represents the mean ± standard deviation. Independent experiments were performed three times. Replicate wells per experiment was n = 5. Analysis was performed by using the Kruskal-Wallis test followed by Dunn's multiple comparison test. Statistical significance is indicated as ∗p < 0.05, ∗∗p < 0.01. Fig. 3 Fig. 4 Mitochondrial morphology after 1 h and 5 h of anesthesia. The impact of anesthetics on mitochondrial expression was assessed using the average GFP fluorescence intensity (A). Each bar represents the mean ± standard deviation. Independent experiments were performed twice. Replicate wells per experiment was n = 5. Analysis was performed by using the Kruskal-Wallis test followed by Dunn's multiple comparison test. Statistical significance is indicated as ∗p < 0.05, ∗∗p < 0.01, ∗∗∗p < 0.001. Filamentous mitochondria were observed in the anesthesia groups, but fragmented mitochondria were present in the control group. Green indicates mitochondria and blue indicates the nucleus. The white bar represents 10 μm (B). Fig. 4 3 Results 3.1 Differentiated HL60 cell morphology HL60 cells were induced to differentiate into neutrophil-like HL60 cells using ATRA. The differentiated HL60 cells exhibited neutrophil-like morphology and had a divided nucleus ( Supplementary Fig. S1 A, B 3.2 NBT assay confirming HL60 cell differentiation into neutrophil-like cells The differentiation efficiency of HL60 cells was evaluated using the NBT assay. Differentiated HL60 cells exhibited increased NBT reductive activity compared with the controls. ( Supplementary Fig. S1 C 3.3 General anesthetics alter mitochondrial metabolism in differentiated HL60 cells A representative Seahorse XFe96 extracellular flux analyzer trace is shown to illustrate the OCR profile during the assay ( Supplementary Fig. S2 Fig. 1 Fig. 1 Fig. 1 3.4 General anesthetics affect production of ROS in differentiated HL60 cells Propofol and midazolam did not increase the production of ROS after either 1 h or 5 h ( Fig. 2 A, Supplementary Fig. S3 A, B Fig. 2 3.5 None of the anesthetic had any cytotoxic effects on differentiated HL60 cells Propofol, midazolam, and sevoflurane did not increase apoptosis of differentiated HL60 cells compared with controls by 1-h and 5-h exposure ( Supplementary Fig. S4 A-C Supplementary Fig. S5 A-C 3.6 Sevoflurane significantly increased bactericidal activity by phagocytosis Exposure of differentiated HL60 cells to sevoflurane significantly enhanced the phagocytosis of fluorescent beads compared to that in the control group. In contrast, exposure to propofol or midazolam did not alter the phagocytic activity of the cells ( Fig. 3 3.7 Mitochondrial morphology of differentiated HL60 cells after exposure to anesthetics Exposure to sevoflurane for 1 h and 5 h and exposure to midazolam for 1 h enhanced the fluorescence of differentiated HL60 cells, as indicated by Mito Bright LT Green staining ( Fig. 4 Supplementary Fig. S6 A, B) Fig. 4 Supplementary Fig. S6 C 4 Discussion This study showed that the general anesthetics propofol, midazolam, and sevoflurane activate mitochondrial function in differentiated HL60 cells. Propofol and midazolam partially activated mitochondrial function but did not increase the production of ROS or phagocytosis. Sevoflurane was shown to promote the production of ROS in neutrophil-like differentiated HL60 cells and to promote phagocytosis, which is one of the bactericidal effects (see Table 1 Table 1 Summary of changes in mitochondrial respiration, ATP production, ROS levels, and phagocytosis in differentiated HL60 cells assessed after 1 h and 5 h of anesthesia with each anesthetic. Table 1 Prop 4 μg ml −1 Mdz 0.5 μg ml −1 Sev 3 % Mitochondrial respiration 1 h (−) ⇑ ⇑ 5 h ⇑ (−) ⇑ ATP production 1 h (−) ⇑ ⇑ 5 h ⇑ (−) ⇑ ROS levels 1 h (−) (−) ⇑ 5 h (−) (−) ⇑ Phagocytosis 1 h (−) (−) ⇑ 5 h (−) (−) ⇑ (−), not changed; ⇑, Research on the immune system using human neutrophils has been conducted for many years. However, there have been concerns that neutrophils have a short lifespan and are likely to be subject to unexpected external stimuli [ 28 29 in vitro 30 There have been many studies in which the effects of general anesthetics on immune cells such as neutrophils were investigated [ [1] [2] [3] [4] [5] 31 32 22 33 34 On the other hand, no cytotoxicity or apoptosis was observed with sevoflurane, suggesting that the ROS produced by sevoflurane were not toxic to the cells themselves. In experiments using pHrodo bioparticles, sevoflurane significantly increased the bactericidal effect associated with phagocytosis. These results suggest that an increase in the production of ROS by sevoflurane may be related to its bactericidal action against pathogens. It was shown that sevoflurane was less likely than propofol to increase plasma endotoxin levels in sepsis model mice, suggesting that it improves mouse survival [ 35 in vitro 6 Production of ROS can occur via two pathways: one mediated by nicotinamide adenine dinucleotide phosphate (NADPH) in the cytoplasm and the other mediated via the mitochondrial electron transport chain [ 36 c 2 − 36 Healthy mitochondria repeatedly undergo fusion and fission over time. We observed that the fluorescence intensity of mitochondria increased after 1 h of exposure to midazolam, 1 h of exposure to sevoflurane and 5 h of exposure to sevoflurane. These results support the results of our research showing that exposure to midazolam for 1 h and exposure to sevoflurane for 1 h and 5 h activate mitochondrial function in HL60 cells. Morphologically, fragmented or filamentous mitochondria indicate a healthy state, and spherical mitochondria indicate a damaged state due to ROS [ 37 5 Limitations This study showed that sevoflurane activates mitochondrial function in neutrophil-like differentiated HL60 cells and promotes their bactericidal action, but the underlying molecular mechanisms have not yet been elucidated. In the future, if it becomes clear where the action site of sevoflurane is and the mechanism of activation of neutrophil function becomes clear, it is hoped that an anesthetic that contributes to infection control can be developed. In addition, we conducted an anesthetic exposure experiment using the neutrophil-like cultured cell line HL60, but the results obtained in this study may be influenced by the type of cell, the differentiation culture conditions [ 17 in vitro in vivo Another limitation of this study is the relatively small number of independent experiments. Although each assay was repeated at least twice with multiple technical replicates, the limited number of biological replicates may reduce the robustness of the statistical analyses. Future studies with a larger number of independent experiments will be required to confirm and strengthen these findings. 6 Conclusion The results of this study indicate that exposure to sevoflurane activates mitochondrial function in differentiated HL60 cells and leads to the production of ROS and promotes their bactericidal action. The results of this study may provide promising insights into the development of effective approaches for preventing complications associated with a decline in immune function during the perioperative period. CRediT authorship contribution statement Kosuke Asei: Yuki Nomura: Daichi Fujimoto: Mayu Ooi: Norihiko Obata: Satoshi Mizobuchi: Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Ackkerman R.S. Luddy K.A. Icard B.E. Fernández J.P. Gatenby R.A. Muncey A.R. The effects of anaesthetics and perioperative medications on immune function Anesth. Analg. 133 2021 676 689 34100781 10.1213/ANE.0000000000005607 2 Mikawa K. Akamatsu H. Nishina K. Shiga M. Maekawa N. Obara H. Niwa Y. Propofol inhibits human neutrophil functions Anesth. Analg. 87 1998 695 700 9728856 10.1097/00000539-199809000-00039 3 Nishina K. Akamatsu H. Mikawa K. Shiga M. Maekawa N. Obara H. Niwa Y. The inhibitory effects of thiopental, midazolam, and ketamine on human neutrophil functions Anesth. Analg. 86 1998 159 165 9428872 10.1097/00000539-199801000-00032 4 Kolle G. Metterlein T. Gruber M. Seyfried T. Petermichl W. Pfaehler S.M. … Bredthauer Andre Potential impact of local anesthetics inducing granulocyte arrest and altering immune functions on perioperative outcome J. Inflamm. Res. 14 2021 1 12 33442284 10.2147/JIR.S275525 PMC7797324 5 Fahlenkamp A.V. Coburn M. Rossaint R. Stoppe C. Haase H. Comparison of the effects of xenon and sevoflurane anaesthesia on leucocyte function in surgical patients Br. J. Anaesth. 112 2014 272 280 24131665 10.1093/bja/aet330 6 Minguet G. Franck T. Joris J. Serteyn D. Sevoflurane modulates the release of reactive oxygen species, myeloperoxidase, and elastase in human whole blood Int. J. Immunopathol. Pharmacol. 30 2017 362 370 29087224 10.1177/0394632017739530 PMC5806810 7 Strosing K.M. Faller S. Gyllenram V. Engelstaedter H. Buerkle H. Spassov S. Hoetzel A. Inhaled anesthetics exert different protective properties in a mouse model of ventilator-induced lung injury Anesth. Analg. 123 2016 143 151 27023766 10.1213/ANE.0000000000001296 8 Shimizu K. Hirose M. Mikami S. Takamura K. Goi T. Yamaguchi A. … Shigemi K. Effect of anaesthesia maintained with sevoflurane and propofol on surgical site infection after elective open gastrointestinal surgery J. Hosp. Infect. 2 2010 129 136 10.1016/j.jhin.2009.10.011 20061057 9 Kishimoto M. Yamana H. Inoue S. Noda T. Akahane M. Inagaki Y. … Imamura T. Suspected periprosthetic joint infection after total knee arthroplasty under Propofol versus Sevoflurane Anesthesia Can. J. Anaesth. 65 2018 893 900 29687360 10.1007/s12630-018-1139-6 10 Angajala A. Lim S. Phillip J.B. Kim J.H. Yates C. You Z. Tan M. Diverse roles of mitochondria in immune responses Front. Immunol. 9 2018 1605 30050539 10.3389/fimmu.2018.01605 PMC6052888 11 Hanada Y. Ishihara N. Wang L. Otera H. Ishihara T. Koshiba T. … Nomura M. MAVS is energized by Mff which senses mitochondrial metabolism via AMPK for acute antiviral immunity Nat. Commun. 11 2020 5711 33177519 10.1038/s41467-020-19287-7 PMC7658986 12 Cao Z. Zhao M. Sun H. Hu L. Chen Y. Fan Z. Roles of mitochondria in neutrophils Front. Immunol. 13 2022 934444 10.3389/fimmu.2022.934444 PMC9447286 36081497 13 Chen R.M. Wu C.H. Chang H.C. Wu G.J. Lin Y.L. Sheu J.R. Chen T.L. Propofol suppresses macrophage functions and modulates mitochondrial membrane potential and cellular adenosine triphosphate synthesis Anesthesiology 98 2003 1178 1185 12717140 10.1097/00000542-200305000-00021 14 Orriach J.L.G. Luque M.D.C. Ponferrada A.R. Beneficial effects of halogenated anesthetics in cardiomyocytes Antioxidants 12 2023 1819 37891898 10.3390/antiox12101819 PMC10604121 15 Archer D.P. Walker A.M. McCann S.K. Moser J.J. Appireddy R.M. Anesthetic neuroprotection in experimental stroke in rodents Anesthesiology 126 2017 653 665 28182585 10.1097/ALN.0000000000001534 PMC5354268 16 Ye R. Yang Q. Kong X. Li N. Zhang Y. Han J. … Zhao G. Sevoflurane preconditioning improves mitochondrial function and long-term neurologic sequelae after transient cerebral ischemia Crit. Care Med. 40 2012 2685 2693 22732280 10.1097/CCM.0b013e318258fb90 17 Tasseff R. Jensen H.A. Congleton J. Dai D. Rogers K.V. Sagar A. … Varner J.D. An effective model of the retinoic acid induced HL-60 differentiation program Sci. Rep. 7 2017 14237 10.1038/s41598-017-14523-5 PMC5662654 29085021 18 Twaroski D.M. Yan Y. Zaja I. Clark E. Bosnjak Z.J. Bai X. Altered mitochondrial dynamics contributes to propofol-induced cell death in human stem cell-derived neurons Anesthesiology 123 2015 1067 1083 26352374 10.1097/ALN.0000000000000857 PMC4632973 19 Weiss M. Mirow N. Birkhahn A. Schneider M. Wernet P. Benzodiazepines and their solvents influence neutrophil granulocyte function Br. J. Anaesth. 70 1993 317 321 8471377 10.1093/bja/70.3.317 20 Han X.C. Zhang Y.J. Dong X. Xing Q.Z. Li K.H. Zhang L. Sevoflurane modulates the cancer stem cell-like properties and mitochondrial membrane potential of glioma via Ca2+-dependent CaMKII/JNK cascade Life Sci. 253 2020 117675 10.1016/j.lfs.2020.117675 32360621 21 Yoo I. Ahn I. Lee J. Lee N. Extracellular flux assay (Seahorse Assay): diverse applications in metabolic research across biological disciplines Mol. Cell 47 2024 100095 10.1016/j.mocell.2024.100095 PMC11374971 39032561 22 Chen Q. Vazquez E.J. Moghaddas S. Hopple C.L. Lesnefsky E.J. Production of reactive oxygen species by mitochondria J. Biol. Chem. 278 2003 36027 36031 12840017 10.1074/jbc.M304854200 23 Griffiths L.A. Flatters S.J.L. Pharmacological modulation of the mitochondrial electron transport chain in paclitaxel-induced painful peripheral neuropathy J. Pain 16 2015 981 994 26142652 10.1016/j.jpain.2015.06.008 PMC4596251 24 Rizzi E. Guimaraes D.A. Ceron C.S. Prado C.M. Pinheiro L.C. Oliveira A.M. … Santos J.E.T. Β1-adrenergic blockers exert antioxidant effects, reduce matrix metalloproteinase activity, and improve renovascular hypertension-induced cardiac hypertrophy Free Radic. Biol. Med. 73 2014 308 317 24933619 10.1016/j.freeradbiomed.2014.05.024 25 Asano M. Tanaka S. Sakaguchi M. Matsumura H. Yamaguchi T. Fujita Y. Tabuse K. Normothermic microwave irradiation induces death of HL-60 cells through heat-independent apoptosis Sci. Rep. 7 2017 11406 10.1038/s41598-017-11784-y PMC5595850 28900243 26 Lindner B. Burkard T. Schuler M. Phagocytosis assays with different pH-sensitive fluorescent particles and various readouts Biotechniques 68 2020 245 250 32079414 10.2144/btn-2020-0003 27 Koopman W.J.H. Visch H.J. Smeitink J.A.M. Willems P.H.G.M. Simultaneous quantitative measurement and automated analysis of mitochondrial morphology, mass, potential, and motility in living human skin fibroblasts Cytometry. A. 69 2006 1 12 16342116 10.1002/cyto.a.20198 28 Hidalgo A. Chilvers E.R. Summers C. Koenderman L. The neutrophil life cycle Trends Immunol. 40 2019 584 597 31153737 10.1016/j.it.2019.04.013 29 Nordenfelt P. Bauer S. Lönnbro P. Tapper H. Phagocytosis of streptococcus pyogenes by all-trans retinoic acid-differentiated HL-60 cells: roles of azurophilic granules and NADPH oxidase PLoS One 4 2009 e7363 10.1371/journal.pone.0007363 PMC2752193 19806211 30 Dong X. Peng S. Ling Y. Huang B. Tu W. Sun X. … Wu J. ATRA treatment slowed P-selectin-mediated rolling of flowing HL60 cells in a mechano-chemical-dependent manner Front. Immunol. 14 2023 1148543 10.3389/fimmu.2023.1148543 PMC10164934 37168856 31 Cao Z. Zhao M. Sun H. Hu L. Chen Y. Fan Z. Roles of mitochondria in neutrophils Front. Immunol. 13 2022 934444 10.3389/fimmu.2022.934444 PMC9447286 36081497 32 Dahlgren C. Karlsson A. Bylund J. Intracellular neutrophil oxidants J. Immunol. 202 2019 3127 3134 31109945 10.4049/jimmunol.1900235 33 Serrano M.M. Pardo M.G. Monsalve A.M. Sánchez M.D.C. Antibacterial effect of sevoflurane and isoflurane Rev. Esp. Quimioter. 30 2017 84 89 28198170 34 Li W.X. Tong X. Yang P.P. Zhang Y. Liang J.H. Li G.H. … Dai S.X. Screening of antibacterial compounds with novel structure from the FDA approved drugs using machine learning methods Aging (Albany NY) 14 2022 1448 1472 35150482 10.18632/aging.203887 PMC8876917 35 Schläpfer M. Piegeler T. Dull R.O. Schwartz D.E. Mao M. Bonini M.G. … Minshall R.D. Propofol increases morbidity and mortality in a rat model of sepsis Crit. Care 19 2015 45 25887642 10.1186/s13054-015-0751-x PMC4344774 36 Snary K.J.D. Surewaard B.G. Mewburn J.D. Bentley R.E. Martin A.Y. Jones O. … Archer S.L. Mitochondria in human neutrophils mediate killing of Staphylococcus aureus Redox Biol. 49 2022 102225 10.1016/j.redox.2021.102225 PMC8758915 34959099 37 Willems P.H.G.M. Rossignol R. Dieteren C.E.J. Murphy M.P. Koopman W.J.H. Redox homeostasis and mitochondrial dynamics Cell. Metab. 22 2015 207 218 26166745 10.1016/j.cmet.2015.06.006 Appendix A Supplementary data The following are the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Multimedia component 2 Multimedia component 2 Multimedia component 3 Multimedia component 3 Multimedia component 4 Multimedia component 4 Multimedia component 5 Multimedia component 5 Multimedia component 6 Multimedia component 6 Multimedia component 7 Multimedia component 7 Data availability Data will be made available on request. Acknowledgements This work was supported by a Grant-in-Aid for Scientific Research from the 10.13039/501100001691 Japan Society for the Promotion of Science 20K17836 The authors are grateful to M. Kimura for cell culture with the experiments. We are also thankful to S.E.S. Translational and Proofreading Services for English language editing. Finally, we appreciate the referees for their valuable comments. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.bbrep.2025.102272 ",
  "metadata": {
    "Title of this paper": "Redox homeostasis and mitochondrial dynamics",
    "Journal it was published in:": "Biochemistry and Biophysics Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477849/"
  }
}