{
  "title": "Paper_724",
  "abstract": "pmc Front Oncol Front Oncol 1755 frontonco Front. Oncol. Frontiers in Oncology 2234-943X Frontiers Media SA PMC12479550 PMC12479550.1 12479550 12479550 41035671 10.3389/fonc.2025.1642996 1 Oncology Original Research Efficacy and survival analysis of neoadjuvant chemotherapy combined with immunotherapy in locally advanced resectable Siewert type II adenocarcinoma of the esophagogastric junction Gai Chunyue  1  2  † Lv Huilai  1  2  † Feng Cuili  3 Zhao Xiaohan  4 Wang Hao  1 Sun Bokang  1 Zhang Fan  1 Tian Ziqiang  1  2  *  1 Department of Thoracic Surgery, The Fourth Hospital of Hebei Medical University Shijiazhuang, Hebei China  2 Hebei Key Laboratory of Accurate Diagnosis and Comprehensive Treatment of Esophageal Cancer Shijiazhuang, Hebei China  3 Department of Endoscopy, The Fourth Hospital of Hebei Medical University Shijiazhuang, Hebei China  4 Department of Radiation Oncology, The Fourth Hospital of Hebei Medical University Shijiazhuang, Hebei China Edited by: Mingzhou Guo Reviewed by: Zhichao Zuo  Xiaofeng Duan  Zhichao Fu *Correspondence: Ziqiang Tian, tianziqiang@hebmu.edu.cn †These authors have contributed equally to this work and share first authorship 16 9 2025 2025 15 480898 1642996 07 6 2025 02 9 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Gai, Lv, Feng, Zhao, Wang, Sun, Zhang and Tian. 2025 Gai, Lv, Feng, Zhao, Wang, Sun, Zhang and Tian https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Neoadjuvant chemotherapy combined with immunotherapy (nCI) has achieved significant results in esophageal and gastric cancers, but its efficacy in Siewert type II adenocarcinoma of the esophagogastric junction (AEG) remains unclear. This study aims to verify the efficacy and safety of nCI in real-world settings for locally advanced resectable Siewert type II AEG. Methods A retrospective analysis of clinical data from 101 patients with locally advanced resectable Siewert type IIAEG who underwent esophagogastric junction resection after chemotherapy combined with Sintilimab in a single-center treatment group from December 2020 to May 2024. The analysis focused on the rates of pathological complete response (pCR), major pathological response (MPR), R0 resection rate, tumor downstaging, recurrence-free survival (RFS), and safety. Results A total of 101 patients were included, the median follow-up time was 19.2 months. 74 patients (73.3%) experienced postoperative pathological downstaging, with 78 patients (77.2%) showing postoperative pathological T downstaging and 47 patients (55.3%) showing postoperative pathological N downstaging. Patients with cT3 had better outcomes in pCR, MPR, and postoperative pathological downstaging compared to those with cT4 (pCR 27.9% vs 12.1% p=0.044, MPR 48.8% vs 25.9% p=0.017, postoperative pathological downstaging rate 83.7% vs 65.5% p=0.041). 3–4 cycles of nCI yield a higher pathological complete response (pCR) rate compared to 1–2 cycles (26.7% vs 7.3%, P Conclusion Preliminary results indicate that nCI shows promising efficacy in the treatment of resectable locally advanced Siewert type II AEG, with high rates of pCR and MPR, as well as good tolerance and safety. 3–4 cycles of nCI may provide better therapeutic efficacy than 1–2 cycles. These findings require confirmation in prospective head-to-head trials to establish potential long-term clinical benefits. Siewert type II AEG neoadjuvant immunochemotherapy pathological response pathologic complete response prognosis The author(s) declare financial support was received for the research and/or publication of this article. This work was supported by the Medical Science Research Project of Hebei (Project Number: 20250725) and Government-Funded Training Program for Outstanding Clinical Medical Talents of Hebei Province (Grant number: ZF2024118). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Gastrointestinal Cancers: Gastric and Esophageal Cancers Introduction Adenocarcinoma of esophagogastric junction (AEG) refers to adenocarcinoma where the tumor center is located within 5 centimeters above or below the esophagogastric junction and crosses or contacts this line. In recent years, the epidemiological trends of AEG have shown notable changes, primarily attributed to the accelerated aging of the global population, diversified lifestyles, and complex environmental factors. According to an analysis of global gastric and esophageal cancer registry data from 2018, East Asia accounted for as much as 67.1% of new cases of AEG globally, showing a significant increase compared to data from 2012 ( 1 2 3 5 In clinical practice, the combination of programmed cell death ligand 1 (PD-L1) inhibitors and chemotherapy has achieved significant results in the treatment and long-term prognosis of patients with advanced upper gastrointestinal tumors, including AEG ( 6 8 9 12 Lately, the impressive findings from the KEYNOTE-062 and CheckMate-649 clinical trials ( 13 14 15 Methods Study design and patients This study screened patients with locally advanced resectable Siewert type II AEG who were registered in the thoracic surgery single-treatment group database of the Fourth Hospital of Hebei Medical University from December 2020 to May 2024 and received nCI. Inclusion criteria were: (1) adult patients (age ≥18 years); (2) histologically confirmed adenocarcinoma with clinically stage II-III Siewert type II AEG, (3) expected to be surgically resectable; (4) completed nCI for 1–4 cycles. Exclusion criteria: (1) clinical stage T4b, (2) Incomplete medical record. Ethical approval was obtained from the Ethics Committee of the Fourth Hospital of Hebei Medical University and conducted in accordance with the practice of the Declaration of Helsinki. Informed consent from patients was waived because of the retrospective nature of this study, which was approved by the Ethics Committee of the Fourth Hospital of Hebei Medical University. Staging Clinical staging was performed by chest and abdominal CT enhancement scans, endoscopic ultrasound (EUS), and neck lymph node ultrasound at baseline, every two cycles neoadjuvant and before surgical resection, with PET/CT examination when necessary. Clinical and pathological staging was determined according to the AJCC 8th edition gastric cancer TNM staging system. Treatment and follow-up All patients completed the SOX scheme (S-1, 40mg/m2 orally twice daily for 14 days followed by 7 days off; Oxaliplatin, 130mg/m2 intravenously on day 1 every 3 weeks) in combination with the Sintilimab Injection(200mg intravenous infusion over 30 minutes on Day 1 of each chemotherapy cycle), followed by efficacy evaluation. Surgery was performed 3–4 weeks after the last dose of nCI to avoid overlapping chemotherapy or immunotherapy-related toxicity with perioperative complications. Surgical options include laparoscopic combined with left/right thoracotomy and laparotomy esophagogastric junction cancer resection. Routine follow-up is conducted every three months within the first year post-surgery, every six months from years one to three, and annually after three years. The final follow-up was completed on October 31, 2024. Observation indicators The primary endpoints were pathological complete response (pCR) and major pathological response (MPR), while the secondary endpoints were recurrence-free survival (RFS),overall survival (OS),and treatment-related adverse reactions (TRAEs). pCR is defined as the absence of residual tumor cells in all resected tumor specimens and regional lymph nodes after completing neoadjuvant therapy and surgical resection. MPR is defined as having less than 10% residual tumor cells within the primary tumor bed after neoadjuvant therapy and surgical resection. Pathology was assessed by two experienced gastrointestinal pathologists. Discrepancies in assessment were resolved through a consensus conference involving a third senior pathologist.OS is defined as the time from the date of surgery until the patients’ death for any reason. RFS is defined as the time from the date of surgery until recurrence or the end of follow-up (non-disease-related deaths are considered censored). R0 resection is defined as a microscopic negative margin resection in which there are no visible or microscopic tumors in the primary tumor bed. Postoperative pathological staging was compared with baseline clinical staging, and a decrease in T stage, N stage, or both is defined as tumor downstaging. Safety assessment was based on the National Cancer Institute Common Toxicity Criteria (NCI-CTCAE, 5.0 version). Additionally, Additionally, surgical complications were classified was based on the Clavien-Dindo scale (2009 version). Statistical analysis Statistical analysis was conducted after data collection and validation were completed. The complete demographic information and baseline characteristics of the patient population were compiled into tables and analyzed. Categorical variables were expressed as numbers and percentages. Statistical analysis was performed on the efficacy and safety of treatment for all patients, with results presented in the form of numbers and percentages. Comparisons between subgroups were conducted using the Chi-square test or Fisher’s exact test. The median follow-up time was calculated using the reverse Kaplan-Meier method. RFS and OS were analyzed using the Kaplan-Meier method. Assessing the Impact of tumor-related death on cancer-specific survival using a Competing Risks Model and comparing intergroup differences via the Gray Test.All statistical tests were two-tailed, and P<0.05 was considered statistically significant. All statistical analyses were conducted using SPSS (version 26.0; SPSS Inc., Chicago, IL, USA) and R software(version 4.3.1). Results Baseline characteristics A total of 101 patients with locally advanced Siewert type II AEG who underwent surgical treatment at this center from December 2020 to May 2024 met the inclusion and exclusion criteria for this study. Among them, there were 89 males (88.1%) and 12 females (11.9%), with a median age of 65 years (IQR 59.5-70.0 years). The cTNM stage was Phase II B in 16 cases (15.8%), and PhaseIIIin 85 cases (84.2%). All cT stages were cT3 or cT4, with 43 cases (42.6%) at cT3 and 58 cases (57.4%) at cT4. Of the cases, 16 were classified as cN0 (15.5%), 58 as cN1 (57.4%), 25 as cN2 (24.8%), and 2 as cN3 (2.0%). (  Table 1 Table 1 Baseline characteristics. Characteristics No. (%) Age (years) Median (IQR) 65 (59.5-70.0) <65 45 (44.6%) ≥65 56 (55.4%) Sex Female 12 (11.9%) Male 89 (88.1%) Smoking Yes 47 (46.5%) No 54 (53.5%) Alcohol Drinking Yes 25 (24.8%) No 76 (75.2%) Clinical TNM Stage II B 16 (15.8%) III 85 (84.2%) Clinical T Stage T3 43 (42.6%) T4 58 (57.4%) Clinical N Stage N0 16 (15.8%) N1 58 (57.4%) N2 25 (24.8%) N3 2 (2.0%) nCI Cycle Numbers* 1–2 cycles 41 (40.6%) 3–4 cycles 60 (59.4%) *nCI: neoadjuvant chemotherapy combined with immunotherapy. Neoadjuvant therapy and results A total of 41 patients (40.6%) received 1–2 cycles of neoadjuvant therapy, while 60 patients (59.4%) received 3–4 cycles. Treatment cycle primarily depends on the surgeon’s decision and tolerance to neoadjuvant treatment. Postoperative pathological analysis showed that 19 patients (18.8%) achieved pCR (ypT0N0), 2 patients (1.98%) were ypT0N+ responders, and 36 patients (35.6%) achieved MPR. Additionally, 74 patients (73.3%) achieved pathological downstaging postoperatively, including 78 patients (77.2%) with T-staging downstaged and 47 patients (55.3%) with N-staging downstaged (  Table 2 Table 2 Postoperative pathological analysis. Pathological status No.(%) nCI Pathologic Complete Response (pCR) 19(18.8%,95%CI,12.1%fendo~27.3%) Major Pathologic Response (MPR) 36(35.6%,95%CI,26.8%fendo~45.3%) Pathologic Downstaging 74(73.3%,95%CI,64.1%fendo~81.2%) Pathologic Downstaging in T category 78(77.2%,95%CI,68.4%fendo~84.6%) Pathologic Downstaging in N category* 47(55.3%,95%CI,44.7%fendo~65.5%) *85 cases were N+ before treatment. Surgical treatment In all 101 patients, surgery was performed as planned, with 100 cases (99%) successfully achieving R0 resection. Only one patient failed to meet the R0 resection criteria because enlarged lymph nodes found behind the pancreas during surgery prevented complete resection, and postoperative pathological examination of two excised enlarged lymph nodes revealed lymph node metastasis. The median interval between the end of neoadjuvant therapy and surgery was 40 days (IQR 35–51 days). 91 cases (90.1%) underwent combined upper abdominal and left thoracotomy approach, 8 cases (7.9%) underwent open abdominal surgery, and 2 cases (2.0%) underwent combined upper abdominal and right thoracotomy approach. The median surgical time was 266 minutes (IQR 235.0-300.5min), and the average intraoperative blood loss was 150ml (IQR 100–200 ml). The median hospital stay was 9 days (IQR 8.5-11.0 days), and the median number of lymph nodes removed was 28 (IQR 19-40.5).In terms of surgical approach, 91 cases (90.1%) underwent upper abdominal combined with left thoracotomy surgery, 8 cases (7.9%) underwent open abdominal surgery, and 2 cases (2.0%) underwent upper abdominal combined with right thoracotomy surgery (  Table 3 Table 3 Surgical treatment details of Siewert type II AEG patients receiving neoadjuvant chemotherapy and immunotherapy. Analytical indicators Results Surgical time (min) 266 (IQR 235.0-300.5) Intraoperative blood loss (ml) 150 (IQR 100-200) New adjuvant-surgery interval (d) 40 (IQR 35-51) Number of days in hospital (d) 9 (IQR 8.5-11.0) Number of lymph node dissections (count) 28 (IQR 19-40.5) Surgical approach Upper abdominal + Left Thoracotomy 91 (90.1%) Upper abdominal + Right Thoracotomy 2 (2.0%) Upper abdominal 8 (7.9%) Exploratory analysis for factors influence efficacy of nCI patients This study further explored various factors that may influence the efficacy of surgery for nCI patients, as detailed in  Table 4 Table 4 The factors of affecting the efficacy of neoadjuvant chemotherapy and immunotherapy for Siewert type II AEG patients. Factors Subgroup pCR, n (% [95% CI]) P-value MPR, n (% [95% CI]) P-value Postoperative Pathologic Downstaging, n (% [95% CI]) P-value Age <65 (n=45) 10 (22.2 [12.0-35.8]) 0.432 17 (37.8 [24.7-52.3]) 0.688 34 (75.6 [61.7-86.3]) 0.641 ≥65 (n=56) 9 (16.1 [8.3-27.3]) 19 (33.9 [22.6-46.9]) 40 (71.4 [58.7-82.0]) Sex Female (n=12) 2 (16.7 [3.6-43.6]) 1.000 2 (16.7 [3.6-43.6]) 0.254 11 (91.7 [67.2-99.1]) 0.235 Male (n=89) 17 (19.1 [12.0-28.2]) 34 (38.2 [28.6-48.5]) 63 (70.8 [60.8-79.5]) Smoking Yes (n=47) 8 (17.0 [8.4-29.6]) 0.667 19 (40.4 [27.3-54.7]) 0.349 32 (68.1 [54.0-80.0]) 0.272 No (n=54) 11 (20.4 [11.3-32.5]) 17 (31.5 [20.3-44.6]) 42 (77.8 [65.4-87.2]) Alcohol Drinking Yes (n=25) 4 (16.0 [5.7-33.7]) 0.905 12 (48.0 [29.5-66.9]) 0.137 19 (76.0 [57.1-89.3]) 0.722 No (n=76) 15 (19.7 [12.0-29.7]) 24 (31.6 [22.0-42.6]) 55 (72.4 [61.6-81.5]) Clinical Stage II B (n=16) 3 (18.8 [5.6-42.1]) 1.000 6 (37.5 [17.4-61.7]) 0.866 10 (62.5 [38.3-82.6]) 0.451 III (n=85) 16 (18.8 [11.6-28.1]) 30 (35.3 [25.8-45.8]) 64 (75.3 [65.4-83.5) Clinical T stage T3 (n=43) 12 (27.9 [16.3-42.4])  0.044 21 (48.8 [34.4-63.4])  0.017 36 (83.7 [70.7-92.4])  0.041 T4 (n=58) 7 (12.1 [5.6-22.2]) 15 (25.9 [16.0-38.1]) 38 (65.5 [52.8-76.8]) Clinical N stage N0 (n=16) 3 (18.8 [95-42.1]) 1.000 6 (37.5 [17.4-61.7]) 0.629 10 (62.5 [38.3-82.6]) 0.163 N1 (n=58) 11 (19.0 [10.5-30.4]) 23 (39.7 [27.8-52.5]) 47 (81.0 [69.6-89.5]) N2 (n=25) 5 (20.0 [8.1-38.4]) 7 (28.0 [13.5-47.3]) 16 (64.0[44.5-80.5]) N3 (n=2) 0 (0) 0 (0) 1 (50.0 [6.4-93.9]) Cycle Numbers 1-2 (n=41) 3 (7.3 [2.1-18.3])  0.015 16 (39.0 [25.3-54.3]) 0.558 28 (68.3 [53.2-80.9]) 0.350 3-4 (n=60) 16 (26.7 16.8-38.8]) 20 (33.3 [22.4-45.8]) 46 (76.7 [64.9-86.0]) PD-L1 CPS≥10 (n=6) 0 1 0 0.298 3 (50.0[16.7%-83.3]) 0.644 CPS<10 (n=20) 2 (10.0[2.1%-28.4%]) 5 (25.0[10.2%-46.4]) 13 (65.0[43.2%-82.8]) Bold values indicates with statistic significant. Follow-up Interim analysis results indicate:Data as of October 31,2024, showed a median follow-up duration of 19.2 months (IQR:12.4-31.8 months). The one-year RFS rate was 93.1% (95%CI, 88.0%-98.6%), and the OS rate was 93.2% (95%CI, 88.1%~98.6%). The two-year RFS rate was 78.9% (95%CI, 69.1%-90.1%), and the OS rate was 76.0% (95%CI, 65.5%~88.2%) (  Figures 1  2 Figure 1 Relapse-free survival(RFS) of Siewert type II adenocarcinoma of the esophagogastric junction patients receiving neoadjuvant chemotherapy combined with immunotherapy. A Kaplan-Meier survival curve showing relapse-free survival over fifty months. The x-axis represents time in months, and the y-axis represents relapse-free survival in percentage, starting at one hundred percent and declining to about seventy-five percent. The curve shows a gradual decrease with several small drops indicating events over time. Figure 2 Overall survival (OS) of Siewert type II adenocarcinoma of the esophagogastric junction patients receiving neoadjuvant chemotherapy combined with immunotherapy. A Kaplan-Meier survival curve depicting overall survival over time in months. The red line begins at 100%, gradually declining with several steps, stabilizing around 70% near the 50-month mark. By the final follow-up, a total of 17 patients had died, including 11 deaths due to recurrence or metastasis, and 6 patients were non-disease-related deaths:3 patients died from cardiovascular diseases, 1 patient died from COVID-19, and 2 patients died from severe pneumonia. Additionally, 5 patients have experienced recurrence or metastasis and are still under follow-up treatment. Among these 16 patients with metastasis or recurrence, all had a baseline clinical stage of cT4aN+, and all achieved R0 resection but did not achieve pCR. The most common patterns of recurrence were anastomotic recurrence (6 cases, 37.5%), abdominal lymph node recurrence (4 cases, 25.0%), bone metastasis (2 cases, 12.5%), liver metastasis (2 cases, 12.5%), chest/abdominal wall muscle metastasis (2 cases, 12.5%), and lung metastasis (1 case, 6.25%). In the pCR cases, there were no recurrences or deaths,and in the non-pCR cases, 16 patients(19.51%)had recurrence or metastasis, 11 patients(13.41%) died from tumor-related causes. Among the MPR cases, 2 patients had recurrence or metastasis, no patient died from tumor-related causes, and the non-MPR cases, 14 patients (21.5%)had recurrence or metastasis, and 11 patients(16.9%) died from tumor-related causes.The prognosis of the MPR group is better than that of the non-MPR group, and the difference is statistically significant(Recurrence or metastasis 5.56% vs 21.5% p=0.035, Disease-related death 0% vs 16.9% p=0.023) (  Table 5 ). Table 5 Recurrence and metastasis situation for Siewert type II AEG patients receiving neoadjuvant chemotherapy and immunotherapy. Recurrence or metastasis P-value Disease-related death P-value pCR 0 0.080 0 0.200 non-pCR 16 (19.5%) 11 (13.4%) MPR 2 (5.6%)  0.035 0  0.023 non-MPR 14 (21.5%) 11 (16.9%) Bold values indicates with statistic significant. Median RFS was not reached in MPR or non-MPR groups. MPR group patients had significantly better RFS than non-MPR group (p=0.037, HR = 0.23, 95% CI 0.05-1.04 ;  Figure 3 ).  Figure 4 ). Figure 3 Relapse-free survival(RFS) of Siewert type II adenocarcinoma of the esophagogastric junction patients receiving neoadjuvant chemotherapy combined with immunotherapy for those with a major pathological response (MPR) and non-MPR. Kaplan-Meier survival plot showing relapse-free survival probability over 50 months, comparing MPR and non-MPR groups. The non-MPR group (red line) shows lower survival probability compared to the MPR group (blue line), with a p-value of 0.037. The number at risk table below shows data at intervals, starting with 65 non-MPR and 36 MPR participants at month 0. Figure 4 Relapse-free survival(RFS) of Siewert type II adenocarcinoma of the esophagogastric junction patients receiving neoadjuvant chemotherapy combined with immunotherapy for those with a pathological complete response(pCR) and non-pCR. Kaplan-Meier graph showing relapse-free survival probability over 50 months, comparing pCR and non-pCR groups. The red line (non-pCR) shows decreasing survival, while the blue line (pCR) remains flat, indicating better outcomes. The p-value is 0.088. Below, a table shows the number at risk at different time points for both groups. Tumor-related death cumulative incidence: in non-pCR group, 1-year 4.2% (95% CI 0.0-9.0%), 2-year 19.2% (95% CI 7.9-30.5%); in pCR group, both rates 0%. Difference not significant (Gray’s test P = 0.199;  Figure 5 ;  Figure 6 ). Figure 5 The cumulative incidence of tumor-related death Siewert type II adenocarcinoma of the esophagogastric junction patients receiving neoadjuvant chemotherapy combined with immunotherapy for those with a pCR and non-pCR. Cumulative incidence plot showing time in months on the x-axis and cumulative incidence on the y-axis. Red solid line represents non-PCR non-tumor-related death, blue dashed line for pCR non-tumor-related death, black dotted line for non-PCR tumor-related death, and green dash-dotted line for pCR tumor-related death. Figure 6 The cumulative incidence of tumor-related death Siewert type II adenocarcinoma of the esophagogastric junction patients receiving neoadjuvant chemotherapy combined with immunotherapy for those with a MPR and non-MPR. Cumulative incidence plot showing time in months on the x-axis and cumulative incidence on the y-axis. Four lines represent different scenarios: solid red for MPR non-tumor-related death, dashed blue for non-MPR non-tumor-related death, dotted black for MPR tumor-related death, and dash-dotted green for non-MPR tumor-related death. Treatment safety A total of 36 patients experienced TRAEs, among which 16 cases involved leukopenia, 17 cases involved nausea or vomiting, 2 patients involved diarrhea, and 1 patient had drug-induced liver injury. The occurrence of immune-related adverse reactions (irAEs) is as follows: 3 cases of immune-related hypothyroidism, 2 cases of immune-related hyperthyroidism, 1 cases of Immune myocarditis and 1 case of Immune myositis with myasthenia gravis. The myocarditis case developed three weeks after the first cycle of immunotherapy, presenting with elevated troponin and arrhythmia. The patient responded well to high-dose glucocorticoids and recovered without long-term cardiac dysfunction, allowing surgery four weeks later. The case of immune myositis initially presented with blepharoptosis progressing to limb weakness, accompanied by elevated creatine kinase levels and confirmed by muscle biopsy. Treatment with glucocorticoids and cholinesterase inhibitors led to significant improvement, enabling successful surgery. The incidence rate of grade 3–4 adverse reactions was 4.95% and no treatment-related death occurred. (  Table 6 Table 6 Adverse events for Siewert type II AEG patients receiving neoadjuvant chemotherapy and immunotherapy. Adverse events Adverse event grading Numbers of nCI cycles Grade 1-2 Grade 3-4 1-2Cycles (n=41) 3-4Cycles (n=60) P-value Any treatment-related adverse event 31 (30.69%) 5 (4.95%) 16 (39.02%) 20 (33.33%) 0.56 Immunologically associated thyroid dysfunction 4 (3.96%) 1 (0.99%) 2 (4.88%) 3 (5%) 1 Immune myositis 0 1 (0.99%) 1 (2.44%) 0 0.41 Immune myocarditis 0 1 (0.99%) 1 (2.44%) 0 0.41 Abnormal liver function 1 (0.99%) 0 1 (2.44%) 0 0.41 White blood cell count decreased 15 (14.85%) 1 (0.99%) 6 (14.63%) 10 (16.67%) 0.78 Diarrhoea 1 (0.99%) 1 (0.99%) 1 (2.44%) 1 (1.67%) 1 Nausea, vomiting 17 (16.83%) 0 7 (17.07%) 10 (16.67%) 0.96 nCI, neoadjuvant chemotherapy combined with immunotherapy. Surgical complications Postoperative complications occurred in 37 patients. 4 patients experienced postoperative respiratory failure, 2 patients developed arrhythmias, and 4 patients had anastomotic stricture. 1 patient experienced anastomotic bleeding. A total of 29 patients developed postoperative pneumonia, with 3 cases requiring endotracheal intubation with ventilator-assisted breathing. 5 patients developed postoperative deep vein thrombosis in the lower extremities. No intraoperative complications or deaths related to postoperative complications were reported (  Table 7 Table 7 Postoperative complications. Adverse event grading Numbers of nCI cycles Grade 1-2 Grade 3-4 1-2Cycles (n=41) 3-4Cycles (n=60) P-value Any Complications 33 (32.67%) 4 (3.96%) 14 (34.15%) 23 (38.33%) 0.67 Failure of respiration 1 (0.99%) 3 (2.97%) 2 (4.88%) 2 (3.33%) 1 Arhythmia 2 (1.98%) 0 1 (2.44%) 1 (1.67%) 1 Stenosis of the anastomosis 4 (3.96%) 2 (1.98%) 4 (9.76%) 2 (3.33%) 0.36 Anastomotic bleeding 1 (0.99%) 0 0 1 (1.67%) 1 Pulmonary infection 26 (25.74%) 3 (2.97%) 12 (29.27%) 17 (28.33%) 0.92 Deep vein thrombosis of the lower extremities 5 (4.95%) 0 2 (4.88%) 3 (5%) 1 nCI, neoadjuvant chemotherapy combined with immunotherapy. Discussion At present, the standard neoadjuvant treatment for locally advanced Siewert type II AEG remains based on chemotherapy or chemoradiotherapy with fluorouracil combined with platinum agents. The MAGIC study ( 16 17 18 Specifically for Siewert II/III AEG, retrospective analyses have shown even lower pathological responses with nCT alone, with pCR rates around 3% and R0 resection rates of 82%, leading to inferior survival compared with nCRT (3-year OS 58.0% vs. 79.2%) ( 17 19 In recent years, immunotherapy has brought new breakthroughs, several studies such as ORIENT-16, ATTRACTION-4, CheckMate-649 ( 8 13 20 12 21 This study demonstrates that the neoadjuvant treatment regimen combining fluorouracil/tegafur with platinum-based chemotherapy and ICIs shows significant efficacy for resectable locally advanced Siewert type II AEG. Overall, the pCR rate was 18.8%, the MPR rate was 35.6%, and the pathological downstaging rate was 73.3%. Additionally, among clinical T stages, patients with cT3 stage showed better outcomes compared to those with cT4 stage in terms of pCR, MPR, and postoperative pathological downstaging (pCR 27.9% vs 12.1%, p=0.044; MPR 48.8% vs 25.9%, p=0.017; postoperative pathological downstaging rate 83.7% vs 65.5%, p=0.041). At present, the assessment of tumor regression response is of notable importance for determining treatment efficacy, formulating subsequent treatment plans, and predicting patient prognosis ( 22 23 25 26 29 18 29 30 32 With a median follow-up of 19.2 months, the median RFS and OS had not yet been reached, underscoring the relatively immature survival data at this stage. Accordingly, the present results should be regarded as an interim analysis. Patients in the MPR group experienced significantly better RFS compared with the non-MPR group (p=0.037). In contrast, although the pCR group showed a numerical trend toward improved RFS (p=0.088), this difference did not reach statistical significance. The cumulative incidence of tumor-related death further highlighted this pattern: in the non-MPR group, it was 5.4% (95% CI: 0.0–11.5%) at 1 year and 26.8% (95% CI: 11.1–42.6%) at 2 years, whereas no tumor-related deaths occurred in the MPR group at either timepoint (Gray’s test, p=0.008). However, no significant difference was observed between the pCR and non-pCR groups. Several factors may account for this discrepancy. First, the relatively small sample size reduces the statistical power to detect survival differences, particularly when stratifying by pathological response. Second, the short follow-up period, with median RFS not yet reached, results in immature survival data. Third, non-cancer-related deaths and the impact of postoperative adjuvant therapy may have diluted the prognostic effect of pCR. Nevertheless, the observed association between pathological response and improved outcomes is consistent with previous clinical studies ( 25 33 There is no unified standard for the number of neoadjuvant treatment cycles for resectable locally advanced Siewert type II AEG, leading to much controversy. Most Japanese studies adopt a two-cycle regimen, whereas studies such as FLOT4, MAGIC, and FFCD ( 16 34 35 Regarding the safety of preoperative treatment, the incidence of TRAEs in this study was 35.69%, with the most common hematological toxicity being leukopenia (15.84%),which less than that of neoadjuvant ECF/ECX and FLOT formula reported in the FLOT4 study ( 34 16 17 27 34 In our study, most patients (90.1%) underwent “Upper abdominal + Left Thoracotomy”, which is the prevailing practice at our center. Data from previous concurrent studies ( 36 In addition, the incidence of surgical-related complications was 36.6%, with the most common postoperative complication being lung infection (28.7%), followed by deep vein thrombosis in the lower limbs (4.9%). The postoperative complications were relatively manageable, and no perioperative mortality events occurred. The average operative time was 266 minutes, with an average intraoperative blood loss of approximately 150ml, a median number of lymph node dissections of 28, and an average postoperative hospital stay of 9 days. There were no intraoperative complications, consistent with previous studies ( 27 37 Our study has several inherent limitations. First, it was a single-center retrospective analysis without a contemporaneous nCT control group, which may introduce selection bias and limits the strength of causal inference. Second, the follow-up duration was relatively short, the survival endpoints remain immature, and the observed advantages of nCI should be regarded as preliminary; Longer follow-up is essential to fully evaluate its impact on long-term survival and recurrence. Third, biomarker analyses were limited. Routine testing for PD-L1 expression, MSI, TMB, and dMMR was not performed in all patients due to the retrospective nature of this study. Ongoing prospective studies at our center are expected to provide more comprehensive biomarker data and long-term clinical outcomes, thereby strengthening the confirmation of our preliminary results. Conclusion Neoadjuvant chemotherapy combined with immunotherapy show a promising efficacy in the treatment of resectable locally advanced Siewert type II AEG, with high rates of pCR and MPR, as well as good tolerance and safety. Moreover,3–4 cycles of nCI may provide better therapeutic efficacy than 1–2 cycles. Additionally, this treatment regimen has potential long-term benefits in reducing recurrence and metastasis rates and prolonging survival.Validation in larger prospective studies with extended follow-up is required to determine the long-term survival impact of this regimen. Data availability statement The original contributions presented in the study are included in the article/supplementary material. Further inquiries can be directed to the corresponding author. Ethics statement The studies involving humans were approved by Ethics Committee of The Fourth Hospital of Hebei Medical. The studies were conducted in accordance with the local legislation and institutional requirements. Written informed consent for participation was not required from the participants or the participants’ legal guardians/next of kin in accordance with the national legislation and institutional requirements. Author contributions CG: Conceptualization, Writing – review & editing, Methodology, Data curation, Investigation, Writing – original draft. HL: Investigation, Conceptualization, Funding acquisition, Writing – review & editing, Methodology, Data curation, Writing – original draft. CF: Data curation, Investigation, Writing – original draft, Formal Analysis. XZ: Investigation, Formal analysis, Writing – original draft, Data curation. HW: Investigation, Writing – original draft, Data curation. BS: Data curation, Investigation, Writing – original draft. FZ: Investigation, Data curation, Writing – original draft. ZT: Methodology, Supervision, Conceptualization, Validation, Project administration, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Arnold M Ferlay J van Berge HM Soerjomataram I Global burden of oesophageal and gastric cancer by histology and subsite in 2018 Gut 2020 69 1564–71 10.1136/gutjnl-2020-321600 32606208 2 Colquhoun A Arnold M Ferlay J Goodman KJ Forman D Soerjomataram I Global patterns of cardia and non-cardia gastric cancer incidence in 2012 Gut 2015 64 1881–88 10.1136/gutjnl-2014-308915 25748648 3 Liu K Yang K Zhang W Chen X Chen X Zhang B Changes of esophagogastric junctional adenocarcinoma and gastroesophageal reflux disease among surgical patients during 1988-2012: a single-institution, high-volume experience in China Ann Surg 2016 263 88 95 10.1097/SLA.0000000000001148 25647058 PMC4679348 4 Rubenstein JH Fontaine S MacDonald PW Burns JA Evans RR Arasim ME Predicting incident adenocarcinoma of the esophagus or gastric cardia using machine learning of electronic health records Gastroenterology 2023 165 1420–29 10.1053/j.gastro.2023.08.011 37597631 PMC11013733 5 Pucher PH Park MH Cromwell DA Crosby TC Thomas B Trudgill N Diagnosis and treatment for gastro-oesophageal cancer in england and wales: analysis of the national oesophago-gastric cancer audit (nogca) database 2012-2020 Br J Surg 2023 110 701–09 10.1093/bjs/znad065 36972221 PMC10364547 6 Patel MA Kratz JD Lubner SJ Loconte NK Uboha NV Esophagogastric cancers: integrating immunotherapy therapy into current practice J Clin Oncol 2022 40 2751–62 10.1200/JCO.21.02500 35839430 PMC10476757 7 Kamposioras K Ntellas P Nikolaou M Germetaki T Gazouli I Dadouli K Immunotherapy efficacy in the initial lines of treatment in advanced upper gastrointestinal Malignancies: a systematic review of the literature Jnci Cancer Spectr 2021 5 10.1093/jncics/pkab088 34926989 PMC8677514 8 Xu J Jiang H Pan Y Gu K Cang S Han L Sintilimab plus chemotherapy for unresectable gastric or gastroesophageal junction cancer: the orient-16 randomized clinical trial Jama 2023 330 2064–74 10.1001/jama.2023.19918 38051328 PMC10698618 9 Andre T Tougeron D Piessen G de la Fouchardiere C Louvet C Adenis A Neoadjuvant nivolumab plus ipilimumab and adjuvant nivolumab in localized deficient mismatch repair/microsatellite instability-high gastric or esophagogastric junction adenocarcinoma: the gercor neonipiga phase ii study J Clin Oncol 2023 41 255–65 10.1200/JCO.22.00686 35969830 PMC9839243 10 Yuan Z Cui H Wang S Liang W Cao B Song L Combining neoadjuvant chemotherapy with pd-1/pd-l1 inhibitors for locally advanced, resectable gastric or gastroesophageal junction adenocarcinoma: a systematic review and meta-analysis Front Oncol 2023 13 1103320 10.3389/fonc.2023.1103320 36776290 PMC9909552 11 Zhu J Leng X Gao B Wang B Zhang H Wu L Efficacy and safety of neoadjuvant immunotherapy in resectable esophageal or gastroesophageal junction carcinoma: a pooled analysis of prospective clinical trials Front Immunol 2022 13 1041233 10.3389/fimmu.2022.1041233 36591306 PMC9800859 12 Yin Y Lin Y Yang M Lv J Liu J Wu K Neoadjuvant tislelizumab and tegafur/gimeracil/octeracil (s-1) plus oxaliplatin in patients with locally advanced gastric or gastroesophageal junction cancer: early results of a phase 2, single-arm trial Front Oncol 2022 12 959295 10.3389/fonc.2022.959295 36158692 PMC9491115 13 Janjigian YY Shitara K Moehler M Garrido M Salman P Shen L First-line nivolumab plus chemotherapy versus chemotherapy alone for advanced gastric, gastro-oesophageal junction, and oesophageal adenocarcinoma (checkmate 649): a randomised, open-label, phase 3 trial Lancet 2021 398 27 40 10.1016/S0140-6736(21)00797-2 34102137 PMC8436782 14 Shitara K Van Cutsem E Bang YJ Fuchs C Wyrwicz L Lee KW Efficacy and safety of pembrolizumab or pembrolizumab plus chemotherapy vs chemotherapy alone for patients with first-line, advanced gastric cancer: the keynote-062 phase 3 randomized clinical trial JAMA Oncol 2020 6 1571–80 10.1001/jamaoncol.2020.3370 32880601 PMC7489405 15 Zuo Z Peng Y Zeng Y Lin S Zeng W Zhou X Survival benefit after neoadjuvant or adjuvant radiotherapy for stage ii-iii gastroesophageal junction adenocarcinoma: a large population-based cohort study Front Oncol 2022 12 998101 10.3389/fonc.2022.998101 36338703 PMC9630344 16 Cunningham D Allum WH Stenning SP Thompson JN Van de Velde CJ Nicolson M Perioperative chemotherapy versus surgery alone for resectable gastroesophageal cancer N Engl J Med 2006 355 11 20 10.1056/NEJMoa055531 16822992 17 Schuhmacher C Gretschel S Lordick F Reichardt P Hohenberger W Eisenberger CF Neoadjuvant chemotherapy compared with surgery alone for locally advanced cancer of the stomach and cardia: european organisation for research and treatment of cancer randomized trial 40954 J Clin Oncol 2010 28 5210–18 10.1200/JCO.2009.26.6114 21060024 PMC3020693 18 Al-Batran SE Hofheinz RD Pauligk C Kopp HG Haag GM Luley KB Histopathological regression after neoadjuvant docetaxel, oxaliplatin, fluorouracil, and leucovorin versus epirubicin, cisplatin, and fluorouracil or capecitabine in patients with resectable gastric or gastro-oesophageal junction adenocarcinoma (flot4-aio): results from the phase 2 part of a multicentre, open-label, randomised phase 2/3 trial Lancet Oncol 2016 17 1697–708 10.1016/S1470-2045(16)30531-9 27776843 19 Ge X Zhao Q Song Y Li J Liu M Bai W Comparison of preoperative concurrent chemoradiotherapy with chemotherapy alone in patients with locally advanced siewert ii and iii adenocarcinoma of the esophagogastric junction Eur J Surg Oncol 2018 44 502–08 10.1016/j.ejso.2017.11.026 29395438 20 Kang YK Chen LT Ryu MH Oh DY Oh SC Chung HC Nivolumab plus chemotherapy versus placebo plus chemotherapy in patients with her2-negative, untreated, unresectable advanced or recurrent gastric or gastro-oesophageal junction cancer (attraction-4): a randomised, multicentre, double-blind, placebo-controlled, phase 3 trial Lancet Oncol 2022 23 234–47 10.1016/S1470-2045(21)00692-6 35030335 21 Yuan SQ Nie RC Jin Y Liang CC Li YF Jian R Perioperative toripalimab and chemotherapy in locally advanced gastric or gastro-esophageal junction cancer: a randomized phase 2 trial Nat Med 2024 30 552–59 10.1038/s41591-023-02721-w 38167937 22 Becker K Langer R Reim D Novotny A Meyer ZBC Engel J Significance of histopathological tumor regression after neoadjuvant chemotherapy in gastric adenocarcinomas: a summary of 480 cases Ann Surg 2011 253 934–39 10.1097/SLA.0b013e318216f449 21490451 23 Li Z Shan F Wang Y Zhang Y Zhang L Li S Correlation of pathological complete response with survival after neoadjuvant chemotherapy in gastric or gastroesophageal junction cancer treated with radical surgery: a meta-analysis PLoS One 2018 13 e189294 10.1371/journal.pone.0189294 29370182 PMC5784899 24 Wan T Zhang XF Liang C Liao CW Li JY Zhou YM The prognostic value of a pathologic complete response after neoadjuvant therapy for digestive cancer: systematic review and meta-analysis of 21 studies Ann Surg Oncol 2019 26 1412–20 10.1245/s10434-018-07147-0 30805807 25 Lorenzen S Thuss-Patience P Al-Batran SE Lordick F Haller B Schuster T Impact of pathologic complete response on disease-free survival in patients with esophagogastric adenocarcinoma receiving preoperative docetaxel-based chemotherapy Ann Oncol 2013 24 2068–73 10.1093/annonc/mdt141 23592699 26 Zhao Q Lian C Huo Z Li M Liu Y Fan L The efficacy and safety of neoadjuvant chemotherapy on patients with advanced gastric cancer: a multicenter randomized clinical trial Cancer Med 2020 9 5731–45 10.1002/cam4.3224 32583567 PMC7433829 27 Tian Y Zhao Q Li Y Fan L Zhang Z Zhao X Efficacy of neoadjuvant chemotherapy dox and xelox regimens for patients with resectable gastric or gastroesophageal junction adenocarcinoma Gastroenterol Res Pract 2021 2021 5590626 10.1155/2021/5590626 34335737 PMC8324337 28 Yu Y Fang Y Shen Z Wang Y Yan M Cao H Oxaliplatin plus capecitabine in the perioperative treatment of locally advanced gastric adenocarcinoma in combination with d2 gastrectomy: neo-classic study Oncologist 2019 24 1311–989 10.1634/theoncologist.2019-0416 31239311 PMC6795163 29 Hasegawa H Shitara K Takiguchi S Takiguchi N Ito S Kochi M A multicenter, open-label, single-arm phase i trial of neoadjuvant nivolumab monotherapy for resectable gastric cancer Gastric Cancer 2022 25 619–28 10.1007/s10120-022-01286-w 35254550 PMC9013329 30 Hodge JW Garnett CT Farsaci B Palena C Tsang KY Ferrone S Chemotherapy-induced immunogenic modulation of tumor cells enhances killing by cytotoxic t lymphocytes and is distinct from immunogenic cell death Int J Cancer 2013 133 624–36 10.1002/ijc.28070 23364915 PMC3663913 31 Li JY Chen YP Li YQ Liu N Ma J Chemotherapeutic and targeted agents can modulate the tumor microenvironment and increase the efficacy of immune checkpoint blockades Mol Cancer 2021 20 27 10.1186/s12943-021-01317-7 33541368 PMC7863268 32 Seliger B Combinatorial approaches with checkpoint inhibitors to enhance anti-tumor immunity Front Immunol 2019 10 999 10.3389/fimmu.2019.00999 31178856 PMC6538766 33 Fields RC Strong VE Gonen M Goodman KA Rizk NP Kelsen DP Recurrence and survival after pathologic complete response to preoperative therapy followed by surgery for gastric or gastrooesophageal adenocarcinoma Br J Cancer 2011 104 1840–47 10.1038/bjc.2011.175 21610705 PMC3111205 34 Al-Batran SE Homann N Pauligk C Goetze TO Meiler J Kasper S Perioperative chemotherapy with fluorouracil plus leucovorin, oxaliplatin, and docetaxel versus fluorouracil or capecitabine plus cisplatin and epirubicin for locally advanced, resectable gastric or gastro-oesophageal junction adenocarcinoma (flot4): a randomised, phase 2/3 trial Lancet 2019 393 1948–57 10.1016/S0140-6736(18)32557-1 30982686 35 Ychou M Boige V Pignon JP Conroy T Bouche O Lebreton G Perioperative chemotherapy compared with surgery alone for resectable gastroesophageal adenocarcinoma: an fnclcc and ffcd multicenter phase iii trial J Clin Oncol 2011 29 1715–21 10.1200/JCO.2010.33.0597 21444866 36 Tian Y Lv H Wang M Tian Z A retrospective analysis of lymph node dissection in siewert ii adenocarcinoma of the esophagogastric junction J Cardiothorac Surg 2024 19 1 09 10.1186/s13019-024-02897-3 39026299 PMC11264608 37 Nusrath S Thammineedi SR Vijaya NRK Patnaik SC Pawar S Santa A Short-term outcomes in patients with carcinoma of the esophagus and gastroesophageal junction receiving neoadjuvant chemotherapy or chemoradiation before surgery. A prospective study Rambam Maimonides Med J 2019 10 10.5041/RMMJ.10339 29993360 PMC6363373 ",
  "metadata": {
    "Title of this paper": "Short-term outcomes in patients with carcinoma of the esophagus and gastroesophageal junction receiving neoadjuvant chemotherapy or chemoradiation before surgery. A prospective study",
    "Journal it was published in:": "Frontiers in Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479550/"
  }
}