{
  "title": "Paper_769",
  "abstract": "Chest Chest 886 chest Chest 0012-3692 1931-3543 American College of Chest Physicians PMC11538888 PMC11538888.1 11538888 11538888 38513965 10.1016/j.chest.2024.03.030 S0012-3692(24)00400-8 1 Critical Care: Original Research The Association of Pregnancy With Outcomes Among Critically Ill Reproductive-Aged Women A Propensity Score-Matched Retrospective Cohort Analysis Kohn Rachel MD, MSCE rachel.kohn2@pennmedicine.upenn.edu a b c ∗ Ashana Deepshikha C. MD, MSCE, MBA e Vranas Kelly C. MD, MCR c f g Viglianti Elizabeth M. MD, MPH, MSc h i Hauschildt Katrina PhD j Chen Catherine MD k Vail Emily A. MD, MSc b d Moroz Leslie MD, MS l Gershengorn Hayley B. MD m n a b c d e f g h i j k l m n ∗ CORRESPONDENCE TO: rachel.kohn2@pennmedicine.upenn.edu 10 2024 20 3 2024 166 4 473114 765 777 01 10 2025 01 10 2025 07 11 2024 01 10 2025 © 2024 American College of Chest Physicians. Published by Elsevier Inc. All rights are reserved, including those for text and data mining, AI training, and similar technologies. 2024 American College of Chest Physicians BACKGROUND The maternal mortality rate in the United States is unacceptably high. However, the relative contribution of pregnancy to these outcomes is unknown. Studies comparing outcomes among pregnant vs nonpregnant critically ill patients show mixed results and are limited by small sample sizes. Research Question What is the association of pregnancy with critical illness outcomes? Study Design and Methods We performed a retrospective cohort study of women 18 to 55 years of age who received invasive mechanical ventilation (MV) on hospital day 0 or 1 or who demonstrated sepsis on admission (infection with organ failure) discharged from Premier Healthcare Database hospitals from 2008 through 2021. The exposure was pregnancy. The primary outcome was in-hospital mortality. We created propensity scores for pregnancy (using patient and hospital characteristics) and performed 1:1 propensity score matching without replacement within age strata (to ensure exact age matching). We performed multilevel multivariable mixed-effects logistic regression for propensity-matched pairs with pair as a random effect. Results Three thousand ninety-three pairs were included in the matched MV cohort, and 13,002 pairs were included in the sepsis cohort. The characteristics of both cohorts were well balanced (all standard mean differences, < 0.1). Among matched pairs, unadjusted mortality was 8.0% vs 13.8% for MV and 1.4% vs 2.3% for sepsis among pregnant and nonpregnant patients, respectively. In adjusted regression, pregnancy was associated with lower odds of in-hospital mortality (MV: OR, 0.50; 95% CI, 0.41-0.60; P P Interpretation In this large US cohort, critically ill pregnant women receiving MV or with sepsis showed better survival than propensity score-matched nonpregnant women. These findings must be interpreted in the context of likely residual confounding. Graphical Abstract Key Words critical care outcomes critical illness mechanical ventilation pregnancy sepsis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations ICD International Classification of Diseases IQR interquartile range IRR incidence rate ratio MV mechanical ventilation SMD standard mean difference ",
  "metadata": {
    "Title of this paper": "The Association of Pregnancy With Outcomes Among Critically Ill Reproductive-Aged Women",
    "Journal it was published in:": "Chest",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11538888/"
  }
}