{
  "title": "Paper_1178",
  "abstract": "pmc Molecules Molecules 3416 molecules molecules Molecules 1420-3049 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472940 PMC12472940.1 12472940 12472940 41011612 10.3390/molecules30183721 molecules-30-03721 1 Review Research Progress on Chemical Components of Astragalus membranaceus Liu Taiyu Sun Yumu https://orcid.org/0000-0003-1431-8362 Zhao Xueying * Cacciola Francesco Academic Editor School of Basic Medical Sciences, Heilongjiang University of Chinese Medicine, 24 Heping Road, Harbin 150040, China; 13946539517@163.com 17703607675@163.com * xueyingzhao2010@126.com 12 9 2025 9 2025 30 18 496804 3721 18 7 2025 01 9 2025 08 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Astragalus membranaceus mongholicus Astragalus membranaceus chemical constituents metabolic syndrome type 2 diabetes mellitus non-alcoholic fatty liver disease obesity hypertension cardiovascular diseases This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Astragalus membranaceus Astragalus membranaceus mongholicus Astragalus membranaceus 1 Over recent decades, AM has been extensively studied in terms of its chemical constituents, pharmacological effects, and therapeutic indications. For instance, Tian et al. provided a comprehensive overview of the extraction, structural characteristics, biological activities, and practical applications of astragalus polysaccharides (APSs) isolated from AM [ 2 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 Several studies have also documented the metabolic regulatory effects of AM. Zhang et al. reviewed multiple pathways through which APSs improved non-alcoholic fatty liver disease (NAFLD) and pointed out its role in regulating the intestinal flora [ 17 18 19 20 21 In short, most of the reported reviews focus on a single disease or organ, without summarizing the multi-target mechanisms within the overall framework of metabolic syndrome (MetS) or involving the core pathways of MetS. Focusing on a certain type of component while ignoring the synergistic effects among different components. In recent years, research has extended beyond the root to explore the medicinal potential of other plant parts, such as stems and leaves. As a traditional Chinese medicinal herb with multi-component and multi-target properties, AM shows advantages in the management of MetS. Currently, the therapeutic value of AM in MetS and its component diseases has not been systematically organized. Similarly, the specific mechanisms underlying its actions in these conditions remain to be deeply discussed. The majority of published studies have primarily focused on MetS-related risk factors associated with AM, such as diabetes, complications, and obesity, while failing to explore the common pathological basis and distinct pathogenic mechanisms underlying these conditions. To further investigate the therapeutic potential of AM, we conducted a systematic review of recent original research articles focusing on its application in managing MetS and associated risk factors. A literature search was conducted across PubMed, ScienceDirect, Web of Science, and CNKI (China National Knowledge Infrastructure) using the keywords “ Astragalus membranaceus 2. Main Components of AM With the advancement of isolation and identification techniques, research on the chemical constituents of AM has become increasingly detailed. The investigation of active ingredients in Chinese medicine now extends beyond phytochemical methods. Screening for bioactive compounds is essential to elucidate the material basis of pharmacological efficacy [ 22 23 24 25 Some researchers employed in vitro intestinal absorption models combined with high-performance liquid chromatography–photodiode array–tandem mass spectrometry (HPLC-PDA-MS) to rapidly screen and analyze potential active compounds in multi-component systems. A response surface methodology was used to optimize extraction and separation conditions [ 22 26 27 28 28 In this paper, we summarized many studies from the past five years on newly isolated and identified compounds and key active constituents from AM including flavonoids, saponins, and polysaccharides. 2.1. Astragalus Flavonoids Flavonoids are the largest group of plant secondary metabolites and share a common C6-C3-C6 backbone [ 29 Figure 1 30 1 2 3 4 5 6 7 8 9 10 11 30 31 31 12 13 14 15 16 17 18 19 32 Wang et al. identified potential active compounds such as kumatakenin ( 20 21 22 23 22 27 24 25 26 27 28 27 2.2. Astragalus Saponins Studies indicate that the saponin types in AM leaves are similar to those in roots. However, the total saponin content in leaf is higher than that in root [ 33 34 Figure 2 29 30 31 32 33 34 35 36 37 38 39 40 34 Similarly, Nguyen et al. [ 35 41 42 43 44 45 46 47 48 49 50 51 Figure 3 35 52 Figure 3 36 Recently, Zhao et al. isolated and identified a new flavonol glycoside, astraside D ( 53 Figure 4 37 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 Figure 4 38 69 70 71 72 73 74 75 76 Figure 5 39 77 78 79 80 81 82 83 84 85 86 Figure 5 40 2.3. Astragalus Polysaccharides APSs are key bioactive components of AM and mainly consist of heteropolysaccharides and glucans. APSs can be extracted in various ways, such as homogenization-assisted negative-pressure cavitation, juicing extraction and microwave-assisted acid hydrolysis, etc. Enzyme-assisted extraction gives the highest crude polysaccharide yield [ 41 42 42 43 43 44 Currently, studies have shown that the stems and leaves of AM contain abundant flavonoids and saponins. However, whether these components can serve as an effective substitute for the roots in terms of medicinal use and therapeutic outcomes remains unclear. This uncertainty requires systematic evaluation through comparative pharmacodynamic research. The newly isolated compounds, such as astraoleanosides E–P, have so far only undergone structural characterization. To date, no pharmacological evaluation has been conducted on these compounds. Their mechanisms of action in metabolic regulation remain to be elucidated. Although previous studies have indicated that the pharmacological effects of APSs are influenced by its molecular weight, the specific molecular targets associated with different molecular weight fractions in metabolic regulation remain poorly understood. Future studies could employ metabolomics integrated with animal models. This approach can be used to systematically compare the pharmacological effects of analogous compounds across different plant parts, thereby providing a scientific basis for resource expansion. For newly identified compounds, initial pharmacological screening can be conducted using in vitro cell models, followed by molecular docking to predict potential specific targets. Fractionation purification techniques can be applied to separate APSs into distinct molecular weight fractions, enabling the identification of specific binding receptors. These data can then be compiled into a database to establish clear structure–activity relationships. 3. Therapeutic Effects of AM and Its Active Ingredients on MetS Recent studies demonstrate that AM and its bioactive compounds exhibit significant efficacy in modulating key risk factors of MetS. In this section, the pharmacological actions and pathways were summarized in the treatment of MetS by AM and its components. 3.1. Common Mechanisms of AM in MetS Studies have demonstrated that AM and its components exhibit pharmacological effects including anti-inflammatory and antioxidant activities, modulation of intestinal microbiota, and regulation of lipid metabolism. These effects lay the foundation for the potential of AM in treating kidney diseases, such as acute kidney injury, diabetic nephropathy, hypertensive renal damage, and chronic glomerulonephritis [ 45 46 47 48 49 50 51 52 53 54 55 56 57 3.1.1. Antioxidation Oxidative stress refers to a state of disequilibrium between oxidants and antioxidants during the body’s metabolic processes. This state arises when reactive oxygen species (ROS) and other oxidative agents are overproduced, or when the antioxidant defense system becomes impaired. It serves as a key pathophysiological mechanism contributing to MetS and its associated complications. Zou et al. [ 58 58 microRNA-210 miR-210 59 60 60 61 61 Liang et al. [ 62 62 63 63 AsIV reduces the proportion of NADPH oxidase 4 (NOX4)-positive cells in mouse hearts, where NOX4 serves as a key enzyme in ROS production. Furthermore, AsIV enhances the expression of superoxide dismutase 2 (SOD2), a critical antioxidant enzyme that scavenges ROS and mitigates oxidative stress-induced damage in cardiomyocytes [ 64 65 66 67 67 68 Chan et al. [ 69 69 AM primarily exerts its effects through multiple mechanisms, including the regulation of redox-related signaling pathways, enhancement of antioxidant enzyme activity, reduction in oxidative substance production, and scavenging of free radicals. However, current mechanistic studies remain limited in depth. There is a lack of systematic investigation into the upstream and downstream molecular targets of individual components and the crosstalk between different signaling pathways. 3.1.2. Anti-Inflammatory MetS and its associated disorders are characterized by chronic low-grade inflammation. The anti-inflammatory effects of AM are central to mediating its therapeutic actions. Inflammatory cytokines can impair insulin signaling, accelerate pancreatic β-cell apoptosis, and contribute to vascular complications. AsIV upregulates C1q/tumor necrosis factor-related protein 3 (CTRP3), activates the downstream PI3K/AKT signaling pathway, and results in the downregulation of pro-inflammatory cytokines interleukin-6 (IL-6) and tumor necrosis factor-alpha (TNF-α) [ 70 71 71 72 72 IL-6 TNF-α 73 The anti-inflammatory effects of AM can intervene in diabetes progression at an early stage. It also helps prevent cardiovascular and renal complications. When combined with conventional hypoglycemic drugs, it may enhance glycemic control through distinct mechanisms. Targeting inflammation is a key strategy for improving insulin sensitivity, protecting β-cell function, and preventing complications. AsIV significantly reduces the levels of pro-inflammatory cytokines, including TNF-α, IL-6, and interleukin-8 (IL-8), in serum, thereby attenuating liver cell injury induced by inflammatory responses [ 74 75 76 The alpha-7 nicotinic acetylcholine receptor (α7nAChR) serves as a critical component of the cholinergic anti-inflammatory pathway, and its activation directly suppresses the activation of the inhibitor of nuclear factor kappa-B kinase subunit beta (IKKβ)/NF-κB signaling cascade. AsIV downregulates both mRNA and protein levels of p-IKKβ and NF-κB via the α7nAChR. This downregulation reduces interleukin-1 beta (IL-1β) and TNF-α levels, thereby attenuating low-grade inflammation in the hypothalamus and adipose tissue. Consequently, AsIV inhibits excessive sympathetic nervous system activation, resulting in decreased blood pressure and heart rate [ 77 Chronic low-grade inflammation and metabolic inflammation are often associated with metabolic changes directly related to CVD incidence, such as diabetes, hypertension, and obesity [ 78 79 79 80 81 81 82 83 83 84 Fernandez et al. [ 85 85 3.1.3. Regulating Intestinal Flora In addition to its direct cellular effects, AM exerts influence on the pathogenesis of MetS through modulation of the gut microbiota. APSs suppress the growth of potential pathogenic bacteria, such as Shigella Allobaculum Lactobacillus 86 Bifidobacterium Lactobacillus 87 Xu et al. found that APSs modulated gut microbiota and restored microbial abundance in diabetic nephropathy (DN) rats [ 88 Lactobacillus Faecalibacterium 89 90 91 92 92 He et al. [ 93 93 94 95 96 Individual differences in drug efficacy are common. They may arise from variations in gut microbiota and host metabolic responses. However, the individual differences in the therapeutic effects of AM remain poorly understood. Their underlying mechanisms are also unclear. Wang et al. [ 97 Deferribacteres 97 In short, AM has been shown to increase microbial diversity and restore microbial balance. Through the enhancement of intestinal barrier function, reduction in harmful substance translocation into the bloodstream, and elevation of the relative abundance of beneficial bacteria, AM effectively attenuates inflammation and oxidative stress. Given the high individual variability of gut microbiota, further studies are needed to clarify the interactions between specific AM components and key microbial taxa. Combining this with metabolomics may help reveal the links between microbial metabolites and host metabolic phenotypes in metabolic disease prevention and treatment. 3.1.4. Regulating Lipid Metabolism Dysregulation of lipid metabolism leads to excessive free fatty acids (FFAs) in the bloodstream, which in turn disrupts insulin signaling. FFA accumulation exacerbates oxidative stress, impairing insulin secretion and sensitivity. A prolonged high-fat environment accelerates pancreatic β-cell apoptosis. Lipid metabolism disorders also serve as catalysts for diabetic complications. Cluster of Differentiation 36 (CD36) serves as a critical mediator of lipid uptake. AsIV attenuates lipid accumulation through the downregulation of CD36, leading to reduced expression of ferroptosis-related factors. In vitro studies showed that AsIV inhibited ferroptosis in cardiomyocytes. In vivo experiments demonstrated that AsIV improved myocardial contractility and reduced myocardial damage. Both types of studies provide evidence for the potential clinical application of AsIV in treating dilated cardiomyopathy (DCM) [ 98 APSs inhibit the Wnt family member 1 (Wnt1) signaling pathway and upregulate lipid metabolism-related enzymes, including fatty acid synthase (FAS) and lipoprotein lipase (LPL), in liver tissue. This leads to enhanced lipid metabolism, reduced hepatic lipid deposition, and decreased serum total cholesterol (TC) and triglyceride (TG) levels [ 99 99 100 100 101 101 102 102 Huang et al. demonstrated that APSs reduced circulating leptin levels, potentially preventing weight gain by enhancing leptin sensitivity and modulating energy balance and appetite [ 103 104 105 obesity-associated gene Fto 106 Overall, AM and its active components can lower TG levels in the blood, reduce lipid deposition in liver tissue, and inhibit pancreatic cell apoptosis, thereby improving IR. The reduction in LDL-C and TG, along with the increase in HDL-C, can lower the risk of cardiovascular complications. Subsequent research ought to concentrate on monitoring the potential risks of hypoglycemia and hepatotoxicity when combined with lipid-lowering agents. Variations in lipid metabolism disorders among diabetic patients may influence the therapeutic outcomes. AM achieves its therapeutic effects on MetS via a variety of pathways. These include exerting antioxidant effects, performing anti-inflammatory functions, regulating the composition of gut microbiota, and modulating lipid metabolism processes. These are closely interconnected and function synergistically to restore metabolic homeostasis. ROS can activate pathways including NF-κB, thereby promoting the secretion of pro-inflammatory cytokines. In turn, inflammatory mediators can further amplify ROS production, creating a self-perpetuating cycle. AsIV upregulates the Nrf2/HO-1 pathway, enhancing antioxidant enzyme activity and thereby reducing ROS levels. Additionally, AsIV suppresses the NF-κB pathway, resulting in decreased secretion of inflammatory cytokines. APSs also inhibit TLR4/NF-κB-mediated inflammatory responses. Gut dysbiosis is common in patients with MetS. This dysbiosis impairs the intestinal barrier. It also increases the translocation of LPS into systemic circulation. These changes thereby trigger systemic inflammation and oxidative stress. AM improves gut microbial composition by increasing the relative abundance of beneficial bacteria, which in turn produce higher levels of SCFAs. It also enhances the intestinal barrier by upregulating tight junction proteins such as ZO-1 and activates GPRs, thereby alleviating oxidative stress and inflammation. Dysregulation of lipid metabolism results in elevated levels of FFAs, which induce ROS generation via NADPH oxidase and activate inflammatory pathways such as TLR4/NF-κB. AM has been shown to alleviate redox imbalance and inflammation caused by excessive FFA accumulation. Furthermore, SCFAs activate AMPK, directly modulating lipid metabolism and reducing FFAs levels. Although it is well established that AM exerts its effects on MetS through four major mechanisms—antioxidant activity, anti-inflammatory action, modulation of gut microbiota, and regulation of lipid metabolism—these mechanisms are not only interconnected but also function synergistically. However, the comprehensive regulatory network underlying its metabolic effects remains incompletely understood. Moreover, the interactions among these pathways have yet to be systematically elucidated. Based on current research, it is essential to identify core signaling pathways and biomarkers associated with the therapeutic effects of AM. To validate the synergistic interactions among multiple pathways, approaches such as gene knockout models and pathway-specific inhibitors could be employed. Further research should aim to refine and integrate the regulatory network involving antioxidant activity, anti-inflammatory responses, gut microbiota modulation, and lipid metabolism. 3.2. Therapeutic Effect on Diabetes The pathophysiology of MetS is complex and involves multiple interrelated mechanisms. IR is one of the key factors. It contributes to pancreatic β-cell dysfunction and significantly increases the risk of type 2 diabetes. Epidemiological studies have shown that patients with MetS are five times more likely to develop type 2 diabetes compared to the general population [ 107 3.2.1. Improving Insulin Resistance The characteristic of IR is the defect in insulin-mediated glucose metabolism control, especially in muscle, adipose tissue, and liver. AM treatment for IR is crucial for reversing this pathological state. AM regulates disorders of glucose metabolism through multiple targets and pathways, providing unique advantages for the treatment of MetS. Table 1 Wu et al. found that APSs exerted insulin-sensitizing and hypoglycemic effects by reducing the elevated expression and the activity of protein tyrosine phosphatase 1B (PTP1B) in skeletal muscle of T2DM model rats [ 108 109 110 molecules-30-03721-t001_Table 1 Table 1 The mechanism of AM in improving IR. NO Model Pathways Effects * Ref. 1 In vivo / ↓ PTP1B [ 108 2 In vitro / ↑ Adiponectin [ 110 3 In vivo AMPK/PGC1α, IRS/AKT ↑ PGC-1α, p-AKT, p-AMPK, p-IRS-1 [ 111 4 In vitro STAT5/IGF-1 ↑ IGF-1R, p-AKT/AKT, IGF-1, p-STAT5/STAT5 [ 112 5 In vivo ROS-ERK-NF-κB ↓ myostatin, MDA, NF-κB [ 113 6 In vivo ERS ↑ miR203a-3p [ 114 7 In vivo SIRT1-PGC-1α/PPARα-FGF21 ↑ FGF21, PPARα, [ 115 8 In vivo / ↑ IRS-1, PI3K, PDK1, p-AKT [ 87 9 In vitro C1q/CTRP3/PI3K/Akt ↑ p53, CTRP3 [ 70 10 In vitro/ JNK-AKT-GSK3β ↓ IL-6, TNF-α, [ 116 11 In vitro/ / ↑ Adiponectin [ 117 12 In vitro / ↑ p-IR, p-IRS-1 [ 118 13 In vivo / ↑ p-AMPK, HDL, ISI [ 109 * ↑ means increase; ↓ means decrease. Zhang et al. demonstrated that AM improved cardiac IR and mitochondrial function by activating AMPK/peroxisome proliferator-activated receptor–gamma coactivator 1-alpha (PGC-1α) and insulin receptor substrate (IRS)/AKT pathways, thus exerting anti-heart failure effects [ 111 112 113 114 115 Ma et al. reported that TAS from AM improved blood glucose levels, IR, and lipid profiles in T2DM rats [ 87 87 70 70 116 116 117 118 119 119 APSs and astragalosides work synergistically to enhance insulin sensitivity. While each act through distinct mechanisms, their combined effect allows for coordinated regulation of multiple targets in the insulin signaling pathway, ultimately resulting in more robust improvements in insulin responsiveness. This cooperative interaction underscores the potential of AM as a therapeutic agent for IR-related conditions. 3.2.2. Protection of Pancreatic β-Cell Function Progressive dysfunction of pancreatic β-cells is a central pathological mechanism in type 2 diabetes. Preserving β-cell function can delay disease progression, reduce insulin dependence, improve glycemic control, and minimize complications related to oxidative stress and inflammation, such as vascular and neural damage. Table 2 Deng et al. [ 120 120 121 121 122 122 123 124 124 molecules-30-03721-t002_Table 2 Table 2 The protective effect of AM on pancreatic islet β-cell in vivo. NO Pathways Effects * Ref. 1 / ↑ miR-136-5p, miR-149-5p [ 120 2 AMPK ↑ P-AMPKα, P-ACC, GLUT4 [ 121 3 Akt/mTOR/GLUT2 ↑ GLUT2, GCK, PDX-1, GSIS, p-Akt, p-mTOR [ 122 4 PI3K/AKT ↑ p-Akt, p-AKT/AKT [ 123 5 SIRT1/p53 ↑ Bcl-2 [ 124 * ↑ means increase; ↓ means decrease. 3.2.3. Increasing GLP-1 Levels GLP-1 is an intestinal insulinotropic hormone secreted by intestinal L-cells. Patients with type 2 diabetes often experience insufficient GLP-1 secretion or impaired action. AM and its active components can stimulate GLP-1 secretion and prolong its half-life, which has significant effects on blood glucose control and weight management. Figure 6 Huang et al. found that AsIV could significantly increase GLP-1 levels in the blood, intestinal tissues, and cells of rats [ 125 proglucagon 125 126 126 127 127 In general, AM and its active ingredients can increase the level of GLP-1 in blood and intestinal tissues and promote the secretion of GLP-1 by enhancing the expression of the proglucagon Figure 6 AM and its constituent compounds exert therapeutic effects on diabetes-induced metabolic disorders through multiple mechanisms, including the improvement of IR, protection of β-cells, and regulation of intestinal microbiota. However, the majority of current mechanistic studies rely on animal models and in vitro cell systems, with limited clinical evidence available. Existing clinical trials are relatively scarce and generally involve small sample sizes. Individual active components of AM have been shown to ameliorate IR independently. However, the potential multi-target synergistic effects among flavonoids, saponins, and polysaccharides have not yet been validated. This validation needs to be carried out through orthogonal experimental designs. Future research should prioritize multi-center, randomized controlled trials (RCTs) involving larger cohorts and diverse subtypes of T2DM patients. Additionally, network pharmacology integrated with animal studies should be employed to design various combinations of flavonoids, saponins, and polysaccharides, aiming to elucidate the molecular mechanisms underlying their synergistic multi-target regulation of core signaling pathways. 3.3. Anti-Nonalcoholic Fatty Liver Disease (NAFLD) Metabolic dysfunction-associated fatty liver disease (MAFLD), formerly known as NAFLD, is a condition characterized by excessive fat accumulation in the liver unrelated to alcohol consumption [ 128 129 130 Table 3 Zhao et al. [ 131 131 132 133 134 134 molecules-30-03721-t003_Table 3 Table 3 The mechanism of AM in treating metabolic disorders of NAFLD. NO Model Pathways Effects * Ref. 1 In vitro / ↑ AMPK, ACC, SREBP-1c [ 132 2 In vivo TLR4/NF-κB ↓ AST, ALT, TG, TNF-α, IL-6, IL-8, TLR4, MyD88, NF-κB [ 74 3 In vitro/ / ↑ GSH-Px, Bcl-2, Bax [ 62 4 In vivo SCFA-GPR ↑ZO-1, occludin [ 75 5 In vitro/ / ↑ THDCA, CYP7B1 [ 135 6 In vivo FXR ↓ BG, TG, HBA [ 136 7 In vitro AMPK/MAPK/TNF-α, AMPK/ACC/CPT1α ↑ AMPK, ACC, CPT1α [ 76 * ↑ means increase; ↓ means decrease. Liu et al. demonstrated that AsIV significantly alleviated hepatic steatosis, reduced lipid droplet accumulation in hepatocytes, and improved liver injury in NAFLD rats through inhibition of the TLR4/myeloid differentiation primary response 88 (MyD88)/NF-κB signaling pathway [ 74 75 75 135 136 76 A. mongholicus 76 To sum up, the main aspects of AM in the treatment of NAFLD are related to anti-inflammation, regulation of lipid metabolism, anti-oxidative stress, and regulation of intestinal flora ( Figure 7 Generally, AM can improve lipid metabolism through multiple pathways, such as activating AMPK to inhibit lipid synthesis and reducing hepatic lipid accumulation, or modulating bile acid homeostasis and affecting FXR signaling. AM also enhances antioxidant capacity by upregulating enzymes like GSH-Px to clear lipid peroxides such as MDA, protecting hepatocytes from oxidative damage. Furthermore, AM reduces the release of inflammatory cytokines, alleviating liver inflammation. Its multi-target effects align with the complex pathogenesis of NAFLD that often coexists with T2DM. AM’s glucose-lowering and lipid-lowering effects contribute to the comprehensive management of MetS. Subsequent research ought to concentrate on elucidating the specific regulatory mechanisms of AM and its components on the gut microbiota–intestinal–liver axis. The potential variation in the therapeutic effects of AM across the progression of NAFLD—from simple steatosis to non-alcoholic steatohepatitis (NASH) and eventually liver fibrosis—remains poorly understood, primarily due to the lack of stage-specific investigations. Obeticholic acid, a commonly prescribed agent for NAFLD in clinical settings, is associated with adverse effects such as diarrhea. Whether co-administration of AM with obeticholic acid can enhance therapeutic efficacy while mitigating side effects has yet to be validated in animal models. Furthermore, no studies have explored the relationship between AM-induced improvements and established serum biomarkers of NAFLD, such as fibroblast growth factor 21 (FGF21) and cytokeratin-18 (CK18), which limits the ability to quantitatively assess its intervention effects during disease progression. Future research should aim to identify the specific bile acid metabolites resulting from key microbial alterations following AM treatment. In experimental models representing different stages of NAFLD, the impact of AM components on hepatic lipid accumulation and fibrosis markers should be systematically compared to determine stage-specific active constituents. Additionally, combining therapy groups involving both obeticholic acid, AM should be included in NAFLD models to assess markers of liver injury and adverse effects, thereby evaluating potential synergistic detoxification effects. Finally, clinical studies should be expanded to measure serum levels of FGF21 and CK18 after AM intervention, providing much-needed quantitative biomarkers for evaluating clinical efficacy. 3.4. Therapeutic Effect on Obesity Obesity is one of the core features of MetS. It is not only an important inducement of NAFLD but also closely associated with IR. While AM improves hepatic lipid accumulation, its intervention on obesity essentially blocks the upstream pathological mechanisms such as IR through multi-target synergy. Over 1.9 billion adults worldwide were overweight or obese. Childhood obesity has been proven to increase the risk of developing type 2 diabetes, hypertension, dyslipidemia, atherosclerosis, and related CVD in adulthood [ 137 Ma et al. demonstrated that APSs could inhibit lipolysis and the browning of white adipose tissue and reduce the thermogenesis of brown adipose tissue, thus inhibiting obesity [ 138 139 139 140 141 uncoupling protein 1 UCP1 PR domain-containing protein 16 PRDM16 PGC-1α iodothyronine deiodinase 2 Dio2 cell death-inducing DFFA-like effectora Cidea 141 142 143 143 APSs regulate fat browning by upregulating the expression of uncoupling protein 1 (UCP1), increasing energy expenditure. AsIV improves IR, leptin resistance, and promotes lipid oxidation. By working synergistically, these components improve multiple metabolic abnormalities and block the progression of obesity to MetS. Additionally, AM can regulate gut microbiota imbalances related to obesity, enhance SCFA production, and indirectly improve metabolic disorders. AM alleviates obesity by modulating the composition of the gut microbiota and enhancing the production of SCFAs. However, this relationship has been primarily described in qualitative terms and lacks quantitative investigations linking SCFAs levels to energy metabolism. Notably, significant gender differences exist in the pathophysiological mechanisms of obesity; for example, estrogen levels play a crucial role in female obesity [ 144 3.5. Therapeutic Effect on Hypertension Obesity is frequently comorbid with hypertension, and their coexistence significantly exacerbates the burden on the cardiovascular system. AM also exerts a regulatory effect on MetS through multi-target mechanisms, with a notable intervention on hypertension as a key component. Hypertension is a major global public health issue and a leading reversible cause of cardiovascular disease [ 145 Li et al. found that long-term administration of small doses of AM reduced arterial stiffness and urinary microalbumin in patients with hypertension and MetS [ 146 147 147 148 149 77 150 n n n 150 In conclusion, AM exerts regulatory effects on hypertension and related metabolic disorders through various mechanisms, including anti-inflammatory action, metabolic improvement, lipid lowering, and kidney protection. These findings provide scientific evidence for the use of AM in hypertension treatment and suggest that it may become an effective adjunctive therapeutic approach. Current research remains limited to qualitative associations. For example, AM shows to upregulate α7nAChR expression and concurrently reduce blood pressure. However, the lack of a clear quantitative relationship between these two factors hinders the determination of effective clinical dosages. Given that long-term pharmacotherapy is essential for managing hypertension combined with MetS, existing clinical studies on AM suffer from several limitations, including small sample sizes, short observation periods, and restricted outcome measures. Future research should prioritize multi-dose animal experiments to establish the quantitative correlations among AM component dosages, α7nAChR activation intensity, and the magnitude of blood pressure reduction. Furthermore, large-scale randomized controlled trials are needed to rigorously evaluate the vascular protective effects associated with long-term, low-dose administration of AM. 3.6. Therapeutic Effect on Cardiovascular Disease Hypertension represents a primary risk factor for CVD. The dynamic progression of metabolic MetS shows to significantly influence the risks of CVD, stroke, and mortality, with prolonged MetS markedly amplifying these outcomes [ 151 3.6.1. Improving Endothelial Function TFAs improve atherosclerosis by reducing aortic lesion area and enhancing plaque stability. This effect is primarily mediated through the downregulation of miR-33 expression, which alleviates the suppression of ATP-binding cassette transporter A1 and G1 (ABCA1/G1) and promotes cholesterol efflux. Additionally, TFAs inhibit scavenger receptors CD36 and scavenger receptor class A (SRA), thereby reducing cholesterol uptake [ 80 82 152 153 153 84 84 154 155 Li et al. [ 156 156 3.6.2. Autophagy Regulation Basal level autophagy is essential for removing damaged cellular components and maintaining lipid homeostasis. Autophagy and lipophagy have been considered novel therapeutic targets for cardiometabolic syndrome and atherosclerosis due to their regulatory effects on lipid metabolism [ 157 Table 4 158 158 159 160 molecules-30-03721-t004_Table 4 Table 4 The mechanism of AM in treating CVD. NO Pharmacology Diseases Model Pathways Effects * Ref. 1 Anti-atherosclerotic AS In vivo MAPK/NF-κB ↓ NF-κB, p65, JNK, ERK1/2, p38, iNOS, VCAM-1, IL-6 [ 79 2   In vitro/ miR-33, NFκB ↑ ABCA1/G1 [ 80 3   In vitro NF-κB ↓ VCAM-1, ICAM-1, p-iκB, NF-κB [ 82 4   In vivo NF-κB/PPARγ ↑ PPAR-γ [ 83 5   In vivo / ↑ GPR78, CHOP, LC3-II;, beclin-1, ATG5 [ 66 6 Anti-myocardial infarction MI In vitro/ MAPK, EKR, JNK ↑ EKR [ 81 7 Vascular protection HHcy In vivo / ↓ MMP-2, MMP-9 [ 155 8 Anti-heart failure HF In vivo / ↓ miR-1 [ 158 9 Activate autophagy MH In vivo / ↑ LC3-II [ 159 10 Protect cardiomyocytes / In vitro / ↑ GATA-4, Bcl-2, p62 [ 160 * ↑ means increase; ↓ means decrease. AsIV can reduce the area of arterial plaques and enhance their stability by inhibiting inflammatory pathways, improving endothelial function, and reducing oxidative stress-induced endothelial damage. It can also promote autophagy to decrease macrophage apoptosis and lipid deposition in plaques. Furthermore, TFAs and AsIV act synergistically in inhibiting inflammation, while APSs improve endothelial dysfunction and enhance plaque stability through mechanisms distinct from those of AsIV. The multi-target effects of AsIV and its active components provide a new strategy for the treatment of CVD, particularly in inflammation and plaque stability. Existing studies have demonstrated that AsIV can reduce macrophage apoptosis and enhance collagen content in atherosclerotic plaques. However, its long-term efficacy in preventing plaque rupture and reducing the risk of acute cardiovascular and cerebrovascular events remains to be validated. AM exerts a bidirectional regulatory effect on autophagy; however, the threshold at which AM switches between activation and inhibition of autophagy has not yet been clearly defined. In the treatment of CVD, the concurrent use of AM and statins raises questions regarding potential metabolic competition in the liver and other possible side effects, which remain insufficiently investigated. Moreover, most current animal studies predominantly employ male models, leaving the potential influence of AM on therapeutic outcomes through estrogen receptor modulation unexplored. Future research should include long-term follow-up studies to assess plaque stability under continuous AM intervention, with dynamic monitoring of plaque area and rupture rates. Additionally, pharmacokinetic–pharmacodynamic (PK-PD) interactions between AM and statin therapy should be systematically evaluated. Gender should be incorporated as a key variable in future investigations. Specifically, animal experiments should utilize MetS models with equal representation of male and female subjects to compare the cardiovascular effects of AM and analyze estrogen receptor-mediated differential signaling pathways. 3.7. Therapeutic Effect on Other Diseases In addition to the core components of MetS, this condition is frequently associated with other metabolic disorders, including hyperuricemia and polycystic ovary syndrome (PCOS). AM has demonstrated potential in modulating these comorbidities, thereby contributing to a more comprehensive therapeutic strategy for MetS. Deng et al. [ 161 161 162 162 163 Bacillus subtilis Astragalus membranaceus Butyricimonas synergistica Odoribacter splanchnicus Collinsella tanakaei Lactobacillus intestinalis Bacillus mycoides 163 164 165 paecilomyces cicadae 166 Nejati et al. demonstrated that Astragalus hamosus Astragalus hamosus 167 168 169 Table 5 To sum up, AM and its active ingredients exhibit extensive therapeutic potential in various metabolic diseases. In hyperuricemia, fermented products of AM restore microbiota balance, indirectly modulate bile acid and lipid metabolism pathways, and lower serum uric acid levels. AsIV inhibits uric acid reabsorption transporters, thereby promoting uric acid excretion. Additionally, AsIV protects the kidneys from high insulin-induced damage by reducing type IV collagen and laminin deposition and delaying kidney fibrosis progression. In PCOS, AM extract alleviates hormonal imbalances, while APSs improve PCOS symptoms by regulating glucose and lipid metabolism and gut microbiota. AsIV aids in restoring ovarian function by promoting autophagy and apoptosis in ovarian granulosa cells. The multi-target, multi-pathway actions of AM and its active components show broad potential in treating metabolic diseases. However, some key issues still need further investigation, such as verifying the direct link between microbiota regulation and uric acid metabolism, understanding the effects of different fermentation processes on efficacy, exploring the connection between the PPARγ pathway and ovarian hormone secretion, and uncovering the interactions within the microbiota–metabolism–endocrine axis. molecules-30-03721-t005_Table 5 Table 5 The therapeutic mechanism of AM on other diseases. NO Pharmacology Diseases Model Pathways Effects * Ref. 1 Anti-hyperuricemia HU In vivo / ↓ UA, XOD, CRE, ALT/AST, BUN [ 161 2  In vitro/ PI3K/Akt ↑ ABCG2 [ 164 3 Anti-hyperinsulinemia HI In vivo / ↑ TRPC6, GPx, SOD, NOX4 [ 162 4 Anti-PCOS PCOS In vivo / ↑ CL, IRS1; ↓CF, INS, T [ 167 * ↑ means increase; ↓ means decrease. Current studies predominantly rely on animal models. However, there remains a critical gap in large-sample RCTs to substantiate the therapeutic efficacy of AM. Small-scale or observational studies are insufficient to establish reliable dosing recommendations or to assess the long-term safety profile of AM in clinical settings. Furthermore, existing PCOS animal models fail to fully recapitulate the core pathophysiological features of human PCOS, particularly the integrated manifestations of hyperandrogenism, ovulatory dysfunction, and IR. These limitations significantly constrain the clinical translational value of the research findings. Additionally, the mechanistic understanding of AM’s therapeutic actions remains incomplete, with key molecular pathways and their regulatory nodes yet to be fully elucidated. To address these gaps, well-designed, multicenter clinical RCTs are warranted to determine the optimal therapeutic dosage and safety profile of AM in human patients. Complementary in vitro studies using cell models should be employed to validate the regulatory mechanisms of critical nodes within the proposed molecular pathways. In summary, the main aspects of AM treatment for MetS include improving IR, protecting pancreatic beta cells, regulating the intestinal flora, anti-inflammation, anti-oxidative stress, regulating lipid metabolism, and improving vascular endothelial function ( Figure 8 4. Study on the Stems and Leaves of AM The preceding discussion has comprehensively outlined the therapeutic potential of AM in managing MetS. However, during the industrialization process, its above-ground parts—primarily stems and leaves—are frequently discarded or merely used for composting. These components contain bioactive compounds similar to those found in the roots, yet their medicinal value remains largely untapped and warrants further exploration. Cui et al. [ 170 170 Bacillus cereus 171 37 40 172 172 The exploitation and utilization of the stems and leaves of AM are still at a preliminary stage. Currently, there is a lack of in vivo pharmacodynamic studies. These studies use MetS animal models to evaluate the efficacy of AM stems and leaves. Whether these aerial parts have equivalent effects to AM roots is uncertain. Specifically, their effects on improving IR and modulating lipid profiles need to be confirmed. Additionally, the pharmacological potential of newly identified bioactive compounds requires further investigation. The impact of harvesting periods and geographical origins on the chemical composition of AM stems and leaves is not fully elucidated. Corresponding quality control standards also remain to be established. Future research should prioritize comparative in vivo pharmacodynamic studies. These studies will compare AM stems and leaves with AM roots. The goal is to determine if above-ground parts can substitute for root materials. Furthermore, developing fingerprint chromatograms is essential. This helps standardize AM stem and leaf preparations. For novel bioactive compounds, integrated approaches should be used. These approaches include molecular docking simulations and animal experiments. The aim is to elucidate their mechanisms of action against metabolic disorders. 5. Pharmacokinetics Study The active ingredients of AM have the potential for antioxidation and anti-inflammation. The absorption, distribution, metabolism, and excretion (ADME) of them after entering the body are the key to guiding clinical medication. Rao et al. [ 173 173 Xiang et al. [ 174 Saposhnikovia divaricata 174 Wang et al. [ 175 −1 −1 1/2 175 Du et al. [ 36 1/2 36 Du et al. [ 176 1/2 176 Zhao et al. [ 177 177 Yu et al. [ 26 beagle dog 26 Most existing research has focused on single components or total extracts. However, the intricate interactions among flavonoids, saponins, and polysaccharides are still largely unknown. Individuals with MetS often have pathological alterations. These alterations include IR and abnormal hepatic and renal functions. These factors can significantly affect the ADME processes of drugs. Future studies should place greater emphasis on the application of PhenoPK. Integrating advanced technologies like metabolomics can help systematically analyze pharmacokinetic interactions. These interactions occur among multiple components of AM under coexisting conditions. The interaction between AsIV and APS needs to be clearly elucidated. Furthermore, animal models should be developed. These models should represent distinct pathological stages of MetS. They will help better simulate clinical scenarios. Additionally, investigating the underlying mechanisms is necessary. These mechanisms explain how pathological factors influence the ADME processes of AM constituents. 6. Safety Evaluation of AM Pharmacokinetic studies have clarified the ADME characteristics of the components of AM in the body. Patients with MetS often need prolonged pharmacotherapy. Therefore, the long-term clinical safety of AM is of great importance for its therapeutic application. Chan et al. [ 69 69 Stępnik et al. [ 178 zebrafish 178 However, current safety assessments of AsIV have limitations. They mainly reflect short-term developmental toxicity. Importantly, there is a lack of in vivo data from mammalian models. Potential toxicity at higher concentrations has not been fully explored, and the observation period in existing studies was relatively short. Therefore, the long-term safety and efficacy of AsIV cannot be evaluated based on current research. LS-102 is a novel derivative of AsIV. Wu et al. [ 179 zebrafish 179 The current safety evaluation of AM features short-term, regular dosage and healthy models, which does not meet the clinical needs of MetS. There is still a lack of toxicity data for AM. This data refers to high-dose and long-term exposure to AM. Furthermore, safety assessments in vulnerable subpopulations are notably limited. These subpopulations include elderly individuals and MetS patients with hepatic or renal impairment. Additionally, research on AM’s safety profile is insufficient. This research focuses on AM when co-administered with commonly prescribed MetS medications. Conduct long-term, high-dose toxicity studies on AM and its active components. Monitor liver function, kidney function, and histopathological changes in mammalian models. These models include rats and dogs. Establish corresponding animal models for special populations. Use pregnant rats and rats with renal failure. Evaluate the safety of AM using these models. 7. Conclusions and Future Perspectives Based on the above discussion, AM, a natural medicinal plant with considerable therapeutic potential, exerts key regulatory effects on MetS and associated diseases through multi-target mechanisms. In recent years, newly identified compounds from AM have mainly included triterpenoid saponins. These may represent only a portion of its active constituents. Flavonoids and polysaccharides still possess considerable research value for further extraction and isolation. The structural elucidation and identification of novel compounds remain incomplete. Some newly discovered constituents, such as astragaloside A, exhibit high biological activity, yet their pharmacological effects and mechanisms of action are not fully understood. Further in-depth investigation is needed, which would support the medicinal development and utilization of AM. Chemical composition of AM varies significantly depending on its geographical origin and harvesting period. A standardized evaluation system based on chromatographic fingerprinting is required. Due to the limited availability of wild AM resources, exploring non-traditional plant parts such as stems and leaves may help alleviate resource pressure. This would also deepen our understanding of the whole plant, allowing for a comprehensive assessment of its medicinal value and enhancing its economic potential. AM and its active ingredients demonstrate multiple pharmacological effects in the management of MetS and related disorders. Studies suggest that AM exerts regulatory effects on metabolic diseases such as T2DM, NAFLD, obesity, hypertension, and CVD through mechanisms including improvement of IR, protection of pancreatic β-cell function, modulation of gut microbiota, anti-inflammatory and antioxidant activities, and regulation of lipid metabolism. Despite promising results, current studies have limitations. Most findings are derived from in vitro experiments or animal models. Clinical evidence on safety and efficacy remains insufficient. Future research should prioritize large-scale randomized controlled trials to provide more reliable clinical evidence. Additionally, the synergistic interactions among multiple components in AM are not yet clearly defined. UPLC-MS/MS and in vitro intestinal absorption models combined with HPLC-PDA-MS have been successfully applied to the screening and identification of active components in AM. In the future, molecular docking technology can be further integrated to predict the target sites of new components. Metabolomics and 16S rRNA sequencing are suitable for investigating the interactions between intestinal flora and metabolism. Furthermore, proteomics and transcriptomics can be integrated to reveal the multi-target and multi-pathway metabolic regulatory effects of AM. Individual variations in gut microbiota may also influence the therapeutic outcomes of AM. Future studies should explore precise microbiota–host metabolic regulation mechanisms to support personalized medicine. It is also worth investigating the potential synergistic effects of AM in combination with conventional therapies, such as antidiabetic or statin medications. AM has achieved results in formulation optimization, pharmacokinetic characteristics, and short-term safety. However, the absorption and metabolic patterns of components under pathological conditions remain unclear. The pharmacokinetic interactions among multiple components have not been clarified. It is necessary to improve pharmacokinetic and safety data, explore the pharmacokinetic characteristics under pathological conditions, supplement long-term and special population safety evaluations, and clarify the risks of combined medication. This review provides a reference for further studies on AM. Current research on AM remains predominantly confined to preclinical models, and the synergistic effects of its multiple bioactive components are not yet fully elucidated. Further efforts should focus on enhancing clinical translation and investigating the mechanistic interactions among multiple components, which will provide a more solid scientific foundation for its application in the treatment of MetS. Disclaimer/Publisher’s Note: Author Contributions Data curation, writing—original draft preparation, T.L. and Y.S.; conceptualization, supervision, methodology, writing—review and editing, X.Z. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflicts of interest. References 1. Pharmacopoeia of the People’s Republic of China Chinese Pharmacopoeia China Medical Science Press Beijing, China 2020 2. Tian H. An L. Wang P. Zhang X. Gao W. Li X. Review of Astragalus membranaceus Chin. Herb. Med. 2025 17 56 69 10.1016/j.chmed.2024.09.004 39949812 PMC11814244 3. Chen Z. Liu L. Gao C. Chen W. Vong C.T. Yao P. Yang Y. Li X. Tang X. Wang S. Astragali Radix (Huangqi): A promising edible immunomodulatory herbal medicine J. Ethnopharmacol. 2020 258 112895 10.1016/j.jep.2020.112895 32330511 4. Zheng Y. Ren W. Zhang L. Zhang Y. Liu D. Liu Y. A Review of the Pharmacological Action of Astragalus Polysaccharide Front. Pharmacol. 2020 11 349 10.3389/fphar.2020.00349 32265719 PMC7105737 5. Li C.X. Liu Y. Zhang Y.Z. Li J.C. Lai J. Astragalus polysaccharide: A review of its immunomodulatory effect Arch. Pharm. Res. 2022 45 367 389 10.1007/s12272-022-01393-3 35713852 6. Lu Q. Jiang J. Wang X. Wang R. Han X. Advancements in the Research of Astragalus membranaceus Am. J. Chin. Med. 2025 53 119 146 10.1142/S0192415X25500065 39880662 7. Guo Y. Yang P. Wu Z. Zhang S. You F. Mechanisms of Astragalus membranaceus mongholicus Integr. Cancer Ther. 2025 24 15347354241311917 10.1177/15347354241311917 39882753 PMC11780663 8. Tang Z. Tian X. Astragalus membranaceus Biomolecules 2024 14 1339 10.3390/biom14101339 39456271 PMC11506204 9. Sheng F. Yang S. Li M. Wang J. Liu L. Zhang L. Research Progress on the Anti-Cancer Effects of Astragalus membranaceus Molecules 2024 29 3388 10.3390/molecules29143388 39064966 PMC11280308 10. Sheng X. Yang L. Huang B. Lin G. Wang Y. Wu X. Lin R. Efficacy of Astragalus membranaceus Integr. Cancer Ther. 2025 24 15347354241313344 10.1177/15347354241313344 40302232 PMC12041688 11. Luo Z.H. Zeng J. Yu H.Y. Huang H.Y. Bao X.F. Qin S.Y. Chen G.D. Zhou Z.Q. Zhi H. Yao X.S. Astramalabaricosides A-T, Highly Oxygenated Malabaricane Triterpenoids with Migratory Inhibitory Activity from Astragalus membranaceus mongholicus J. Nat. Prod. 2022 85 2312 2331 10.1021/acs.jnatprod.2c00494 36137221 12. Bunddulam P. Nakamura M. Zorig A. Hinata Y. Takasugi M. Feng C.H. Sato T. Arai H. Effects of Astragalus membranaceus Prev. Nutr. Food Sci. 2025 30 68 80 10.3746/pnf.2025.30.1.68 40059916 PMC11884941 13. He X. Liu L. Luo X. Zhu J. Yang H. Wang J. Chen L. Zhong L. Astragalus Polysaccharide Relieves Inflammatory Responses in Guinea Pigs with Allergic Rhinitis via Ameliorating NF-kB-Mediated Treg/Th17 Imbalance Am. J. Rhinol. Allergy 2022 36 638 648 10.1177/19458924221098847 35585694 14. Bival Štefan M. Astragalus membranaceus Curr. Issues Mol. Biol. 2024 46 9016 9032 10.3390/cimb46080533 39194750 PMC11352820 15. Hou M. Leng Y. Shi Y. Tan Z. Min X. Astragalus membranaceus Am. J. Chin. Med. 2023 51 1501 1526 10.1142/S0192415X23500684 37530507 16. Ghabeshi S. Mousavizadeh L. Ghasemi S. Enhancing the Antiviral Potential and Anti-inflammatory Properties of Astragalus membranaceus Anti-Inflamm. Anti-Allergy Agents Med. Chem. 2023 22 211 219 10.2174/0118715230280333231207114927 38115620 17. Zhang J. Feng Q. Pharmacological Effects and Molecular Protective Mechanisms of Astragalus Polysaccharides on Nonalcoholic Fatty Liver Disease Front. Pharmacol. 2022 13 854674 10.3389/fphar.2022.854674 35308224 PMC8929346 18. Liu S. Wang L. Zhang Z. Leng Y. Yang Y. Fu X. Xie H. Gao H. Xie C. The potential of astragalus polysaccharide for treating diabetes and its action mechanism Front. Pharmacol. 2024 15 1339406 10.3389/fphar.2024.1339406 38659573 PMC11039829 19. Chen C. Bu X. Deng L. Xia J. Wang X. Chen L. Li W. Huang J. Chen Q. Wang C. Astragaloside IV as a promising therapeutic agent for liver diseases: Current landscape and future perspectives Front. Pharmacol. 2025 16 1574154 10.3389/fphar.2025.1574154 40337517 PMC12055773 20. Xu Z. Zhou H. Zhang Y. Cheng Z. Wan M. Qin W. Li P. Feng J. Shao S. Xue W. Recent pharmacological advances in the treatment of cardiovascular events with Astragaloside IV Biomed. Pharmacother. 2023 168 115752 10.1016/j.biopha.2023.115752 37875045 21. Tan Y.Q. Chen H.W. Li J. Astragaloside IV: An Effective Drug for the Treatment of Cardiovascular Diseases Drug Des. Dev. Ther. 2020 14 3731 3746 10.2147/DDDT.S272355 PMC7507407 32982178 22. Wang D. Liu R. Zeng J. Li C. Xiang W. Zhong G. Xia Z. Preliminary screening of the potential active ingredients in traditional Chinese medicines using the Ussing chamber model combined with HPLC-PDA-MS J. Chromatogr. B Anal. Technol. Biomed. Life Sci. 2022 1189 123090 10.1016/j.jchromb.2021.123090 34959037 23. Wang L. Xiong F. Yang L. Wang B. Zhou G. Major Chemical Compounds and Mineral Elements of Astragalus membranaceus Chem. Biodivers. 2022 19 e202100778 10.1002/cbdv.202100778 34904789 24. Wang L. Xiong F. Yang L. Xiao Y. Zhou G. A Seasonal Change of Active Ingredients and Mineral Elements in Root of Astragalus membranaceus Biol. Trace Elem. Res. 2021 199 3950 3959 10.1007/s12011-020-02486-0 33241436 25. Sheng Z. Jiang Y. Liu J. Yang B. UHPLC-MS/MS Analysis on Flavonoids Composition in Astragalus membranaceus Antioxidants 2021 10 1852 10.3390/antiox10111852 34829723 PMC8614773 26. Yu X. Xia K. Wu S. Wang Q. Cheng W. Ji C. Yang W. Kang C. Yuan Z. Li Y. Simultaneous determination and pharmacokinetic study of six components in beagle dog Astragalus membranaceus Biomed. Chromatogr. 2022 36 e5488 10.1002/bmc.5488 36001467 27. Liu R. Zhang Y. Li S. Liu C. Zhuang S. Zhou X. Li Y. Zhang Y. Liang J. Extraction and preparation of 5-lipoxygenase and acetylcholinesterase inhibitors from Astragalus membranaceus J. Sep. Sci. 2023 46 e2200812 10.1002/jssc.202200812 36502278 28. Zhao C.G. Li C.Y. Yang S. Xu Q.L. Zheng Y.F. Wang Y.F. Li H.Y. Peng G.P. Analysis of quality difference based on Astragalus membranaceus mongholicus Zhongguo Zhong Yao Za Zhi 2020 45 3183 3190 10.19540/j.cnki.cjcmm.20200424.204 32726028 29. Zhang Y. Chen Z. Chen L. Dong Q. Yang D.H. Zhang Q. Zeng J. Wang Y. Liu X. Cui Y. Astragali radix (Huangqi): A time-honored nourishing herbal medicine Chin. Med. 2024 19 119 10.1186/s13020-024-00977-z 39215362 PMC11363671 30. Tan J.Y. Zhao J.X. Zang Y. Li P. Yang S.Q. Li X.M. Wang Y.L. Cheng Y.G. New flavonoid glycosides from the stems and leaves of Astragalus membranaceus Fitoterapia 2025 180 106321 10.1016/j.fitote.2024.106321 39638075 31. Wang Q.X. Guo S. Shen K.X. Li H.W. Zhang H.K. Xie Y.J. Shang E.X. Duan J.A. Chemical composition analysis and value evaluation of stems and leaves of Astragalus membranaceus mongholicus Zhongguo Zhong Yao Za Zhi 2023 48 6600 6612 10.19540/j.cnki.cjcmm.20230808.102 38212020 32. Li A. Cui W. Zhao Y. Luo T. Zhang Q. Liu Y. Li K. Qin X. Zhang L. Exploration of the main effective constituent and the mechanism in Astragali Radix in the treatment for doxorubicin-induced nephropathy by integrating metabolomics and molecular docking J. Ethnopharmacol. 2023 305 116074 10.1016/j.jep.2022.116074 36577490 33. Li Y. Guo S. Zhu Y. Yan H. Qian D.W. Wang H.Q. Yu J.Q. Duan J.A. Flowers of Astragalus membranaceus mongholicus Molecules 2019 24 434 10.3390/molecules24030434 30691074 PMC6384981 34. Yan M.Q. Xu F. Kuang H.X. Shi X.P. Cao F. Yang B.Y. Wang Z.B. 10-Secocycloartane (=9, 19-cyclo-9, 10-secolanostane) triterpenoid saponins: Huangqiyenins M-X from Astragalus membranaceus Phytochemistry 2024 222 114072 10.1016/j.phytochem.2024.114072 38561105 35. Nguyen M.K. Nguyen V.P. Yang S.Y. Min B.S. Kim J.A. Astraoleanosides E-P, oleanane-type triterpenoid saponins from the aerial parts of Astragalus membranaceus Bioorg. Chem. 2024 145 107230 10.1016/j.bioorg.2024.107230 38387397 36. Du R. Xu F. Wei D. Wei Y. Wang Z. Wang Z. Pharmacokinetics of two triterpenoid saponins and three flavonoids in Astragalus membranaceus J. Pharm. Biomed. Anal. 2024 251 116419 10.1016/j.jpba.2024.116419 39154580 37. Zhao J.X. Zang Y. Li P. Zhang J.N. Yang S.Q. Li H.F. Wang Y. Tan J.Y. Wang Y.L. Cheng Y.G. A new flavonol glycoside isolated from the stems and leaves of Astragalus membranaceus Nat. Prod. Res. 2025 1–6 in press 10.1080/14786419.2025.2526750 40608968 38. Xu W. Li X. Zhang Q. Jiang P. Zhang Y. Luo Y. Guan W. Li M. Chen Q. Zhang L. New triterpenoid saponins isolated from the leaves of Astragalus membranaceus Bioorg. Chem. 2025 156 108149 10.1016/j.bioorg.2025.108149 39826500 39. Xu W.X. Liu Z.Y. Bu Q.Y. Jiang P. Zhang Y.Q. Luo Y.M. Guan W. Ma X.C. Li M.M. Chen Q.S. Eight new triterpenoid saponins from the leaves of Astragalus membranaceus Fitoterapia 2025 183 106559 10.1016/j.fitote.2025.106559 40258427 40. Cheng Y.G. Li J.L. Li P. Yang S.Q. Zang Y. Wang Y. Yu Y.T. Xie X. Li H.F. Hao X.L. Neuroprotective triterpenoids from Astragalus membranaceus Bioorg. Chem. 2025 160 108492 10.1016/j.bioorg.2025.108492 40280011 41. Tang Z. Huang G. Extraction, structure, and activity of polysaccharide from Radix astragali Biomed. Pharmacother. 2022 150 113015 10.1016/j.biopha.2022.113015 35468585 42. Guo Y. Wang L. Liu K. Li M. Jin Y. Gu L. Yu X.A. Wang S. Wang P. Wang B. A Rapid and Accurate UHPLC Method for Determination of Monosaccharides in Polysaccharides of Different Sources of Radix Astragali and Its Immune Activity Analysis Molecules 2024 29 2287 10.3390/molecules29102287 38792148 PMC11124152 43. Li K. Li S. Du Y. Qin X. Screening and structure study of active components of Astragalus polysaccharide for injection based on different molecular weights J. Chromatogr. B Anal. Technol. Biomed. Life Sci. 2020 1152 122255 10.1016/j.jchromb.2020.122255 32673831 44. Chen G. Jiang N. Zheng J. Hu H. Yang H. Lin A. Hu B. Liu H. Structural characterization and anti-inflammatory activity of polysaccharides from Astragalus membranaceus Int. J. Biol. Macromol. 2023 241 124386 10.1016/j.ijbiomac.2023.124386 37054858 45. Shi Y. Shi X. Zhao M. Ma S. Zhang Y. Pharmacological potential of Astragali Radix for the treatment of kidney diseases Phytomedicine 2024 123 155196 10.1016/j.phymed.2023.155196 37952410 46. Liu Y. Huang Y. Sun D. Ye N. Chen T. Yang M. Zhou L. Zou H. Research progress of astragaloside IV in treating acute kidney injury Int. Urol. Nephrol. 2024 56 2645 2650 10.1007/s11255-024-04016-6 38494585 47. Li Y. Zhou J. Zhang T. Li X. Wu C. Zhao Z. Tang J. Tan X. Hu Q. Liao W. Astragaloside IV attenuates cadmium induced nephrotoxicity in rats by activating Nrf2 Sci. Rep. 2025 15 2028 10.1038/s41598-025-86312-4 39815001 PMC11735858 48. Borowicz K.K. Jach M.E. Astragalus Membranaceus Nutrients 2025 17 1229 10.3390/nu17081299 40284164 PMC12029721 49. Chen K. Qin C. Ji C. Yu Y. Wu Y. Xu L. Jiang Y. Zou G. Astragalus polysaccharide alleviates oxidative stress and senescence in chondrocytes in osteoarthritis via GCN2/ATF4/TXN axis Int. J. Biol. Macromol. 2025 310 143285 10.1016/j.ijbiomac.2025.143285 40253033 50. Son S.R. Kim K.S. Jun M. Jang D.S. Lee S. Effects of Astraflavonoid A and Astraside C from the Aerial Part of Astragalus membranaceus Plants 2025 14 1358 10.3390/plants14091358 40364386 PMC12074202 51. Wang S.W. Li P. Liu S.Y. Huang D.L. Zhang S.J. Zeng X.X. Lan T. Mao K.L. Gao Y. Cheng Y.F. Astragaloside IV inhibits retinal pigment epithelial cell senescence and reduces IL-1β mRNA stability by targeting FTO-mediated m(6)A methylation Phytomedicine 2025 138 156408 10.1016/j.phymed.2025.156408 39848020 52. Miao X. Rong L. Fu B. Cui S. Gu Z. Hu F. Lu Y. Yan S. Sun B. Jiang W. Astragalus polysaccharides attenuate rat aortic endothelial senescence via regulation of the SIRT-1/p53 signaling pathway BMC Complement. Med. Ther. 2024 24 80 10.1186/s12906-024-04387-4 38331805 PMC10851563 53. Zaman Q. Zhang D. Reddy O.S. Wong W.T. Lai W.F. Roles and Mechanisms of Astragaloside IV in Combating Neuronal Aging Aging Dis. 2022 13 1845 1861 10.14336/AD.2022.0126 36465185 PMC9662284 54. Xue H.Z. Chen Y. Wang S.D. Yang Y.M. Cai L.Q. Zhao J.X. Huang W.J. Xiao Y.H. Radix Astragali and Its Representative Extracts for Diabetic Nephropathy: Efficacy and Molecular Mechanism J. Diabetes Res. 2024 2024 5216113 10.1155/2024/5216113 39308629 PMC11416176 55. Li Y. Wang J. Possible mechanism for the protective effect of active ingredients of astragalus membranaceus on diabetes nephropathy J. Asian Nat. Prod. Res. 2024 26 1276 1284 10.1080/10286020.2024.2364350 38856077 56. Liu M. Di Y.M. May B. Zhang A.L. Zhang L. Chen J. Wang R. Liu X. Xue C.C. Renal protective effects and mechanisms of Astragalus membranaceus Phytomedicine 2024 129 155646 10.1016/j.phymed.2024.155646 38733903 57. Liu P.Y. Hong K.F. Liu Y.D. Sun Z.Y. Zhao T.T. Li X.L. Lao C.C. Tan S.F. Zhang H.Y. Zhao Y.H. Total flavonoids of Astragalus protects glomerular filtration barrier in diabetic kidney disease Chin. Med. 2024 19 27 10.1186/s13020-024-00903-3 38365794 PMC10870499 58. Zou X. Liu X. Qu W. Zhang X. Zou Y. Lin X. Hu W. Gao R. He Y. Zhou S. Astragaloside IV Relieves Mitochondrial Oxidative Stress Damage and Dysfunction in Diabetic Mice Endothelial Progenitor Cells by Regulating the GSK-3β/Nrf2 Axis Appl. Biochem. Biotechnol. 2025 197 3964 3981 10.1007/s12010-025-05211-6 40131628 59. Xiong W. Zhang X. Zou X.L. Peng S. Lei H.J. Liu X.N. Zhao L. Huang Z.X. Exosomes Derived from Astragaloside IV-pretreated Endothelial Progenitor Cells (AS-IV-Exos) Alleviated Endothelial Oxidative Stress and Dysfunction Via the miR-210/Nox2/ROS Pathway Curr. Mol. Med. 2024 25 320 329 10.2174/0115665240262982240109104620 38299414 60. Zhang Y. Mao X.D. Cao A.L. Chu S. Li Z.J. Wang Y.M. Peng W. Wang L. Wang H. Astragaloside IV prevents endothelial dysfunction by improving oxidative stress in streptozotocin-induced diabetic mouse aortas Exp. Ther. Med. 2021 22 1197 10.3892/etm.2021.10631 34584542 PMC8422382 61. Leng B. Li C. Sun Y. Zhao K. Zhang L. Lu M.L. Wang H.X. Protective Effect of Astragaloside IV on High Glucose-Induced Endothelial Dysfunction via Inhibition of P2X7R Dependent P38 MAPK Signaling Pathway Oxid. Med. Cell Longev. 2020 2020 5070415 10.1155/2020/5070415 33014270 PMC7512101 62. Liang X.Y. Hong F.F. Yang S.L. Astragaloside IV Alleviates Liver Inflammation, Oxidative Stress and Apoptosis to Protect Against Experimental Non-Alcoholic Fatty Liver Disease Diabetes Metab. Syndr. Obes. 2021 14 1871 1883 10.2147/DMSO.S304817 33953586 PMC8089473 63. Yuan Q.F. Tang S.M. Chen S.Y. Yang Z.M. Therapeutic effect of astragalus polysaccharides on nonalcoholic fatty liver disease in rats Acad. J. Nav. Med. Univ. 2018 39 573 578 10.16781/j.0258-879x.2018.05.0573 64. Li X.Z. Ding Y.Z. Wu H.F. Bian Z.P. Xu J.D. Gu C.R. Chen X.J. Yang D. Astragaloside IV Prevents Cardiac Remodeling in the Apolipoprotein E-Deficient Mice by Regulating Cardiac Homeostasis and Oxidative Stress Cell Physiol. Biochem. 2017 44 2422 2438 10.1159/000486166 29268252 65. Wang D. Zhuang Y. Tian Y. Thomas G.N. Ying M. Tomlinson B. Study of the effects of total flavonoids of Astragalus on atherosclerosis formation and potential mechanisms Oxid. Med. Cell Longev. 2012 2012 282383 10.1155/2012/282383 22496932 PMC3306992 66. Tian H. Wang T. Zhang Y. Pan T. Yao S. Yu H. Ma K. Wang S. Astragaloside IV protects against C/EBP homologous protein-mediated apoptosis in oxidized low-density lipoprotein-treated macrophages by promoting autophagy Eur. J. Pharmacol. 2022 923 174912 10.1016/j.ejphar.2022.174912 35339476 67. Luo L.F. Qin L.Y. Wang J.X. Guan P. Wang N. Ji E.S. Astragaloside IV Attenuates the Myocardial Injury Caused by Adriamycin by Inhibiting Autophagy Front. Pharmacol. 2021 12 669782 10.3389/fphar.2021.669782 34108879 PMC8184095 68. Shi X. Qin Y. Effect and mechanism of astragalus polysaccharide on lipid metabolism of macrophages J. Xi’an Jiaotong Univ. (Med. Sci.) 2019 40 640 645 10.7652/jdyxb201904029 69. Chan K.W. Kwong A.S.K. Tsui P.N. Chan G.C.W. Choi W.F. Yiu W.H. Cheung S.C.Y. Wong M.M.Y. Zhang Z.J. Tan K.C.B. Add-on astragalus in type 2 diabetes and chronic kidney disease: A multi-center, assessor-blind, randomized controlled trial Phytomedicine 2024 130 155457 10.1016/j.phymed.2024.155457 38810556 70. Zhang Y. Xu G. Huang B. Chen D. Ye R. Astragaloside IV Regulates Insulin Resistance and Inflammatory Response of Adipocytes via Modulating CTRP3 and PI3K/AKT Signaling Diabetes Ther. 2022 13 1823 1834 10.1007/s13300-022-01312-1 36103112 PMC9663774 71. Hoo R.L. Wong J.Y. Qiao C. Xu A. Xu H. Lam K.S. The effective fraction isolated from Radix Astragali alleviates glucose intolerance, insulin resistance and hypertriglyceridemia in db/db diabetic mice through its anti-inflammatory activity Nutr. Metab. 2010 7 67 10.1186/1743-7075-7-67 PMC2936435 20735814 72. Zhou L. Zhang R. Yang S. Zhang Y. Shi D. Astragaloside IV alleviates placental oxidative stress and inflammation in GDM mice Endocr. Connect. 2020 9 939 945 10.1530/EC-20-0295 33006955 PMC7583135 73. Zhang R. Zhang X. Xing B. Zhao J. Zhang P. Shi D. Yang F. Astragaloside IV attenuates gestational diabetes mellitus via targeting NLRP3 inflammasome in genetic mice Reprod. Biol. Endocrinol. 2019 17 77 10.1186/s12958-019-0522-7 31558153 PMC6764134 74. Liu Y.L. Zhang Q.Z. Wang Y.R. Fu L.N. Han J.S. Zhang J. Wang B.M. Astragaloside IV Improves High-Fat Diet-Induced Hepatic Steatosis in Nonalcoholic Fatty Liver Disease Rats by Regulating Inflammatory Factors Level via TLR4/NF-κB Signaling Pathway Front. Pharmacol. 2020 11 605064 10.3389/fphar.2020.605064 33708118 PMC7941269 75. Zhong M. Yan Y. Yuan H. A R. Xu G. Cai F. Yang Y. Wang Y. Zhang W. Astragalus mongholicus Food Funct. 2022 13 7287 7301 10.1039/D2FO01009G 35726797 76. Fu L. Wu Z. Chu Y. Chen W. Gao L. Mu S. Zhao J. Explore the Mechanism of Astragalus mongholicus Gastroenterol. Res. Pract. 2022 2022 4745042 10.1155/2022/4745042 35422858 PMC9005278 77. Jiang P. Ma D. Wang X. Wang Y. Bi Y. Yang J. Wang X. Li X. Astragaloside IV Prevents Obesity-Associated Hypertension by Improving Pro-Inflammatory Reaction and Leptin Resistance Mol. Cells 2018 41 244 255 10.14348/molcells.2018.2156 29562733 PMC5881098 78. Silveira Rossi J.L. Barbalho S.M. Reverete de Araujo R. Bechara M.D. Sloan K.P. Sloan L.A. Metabolic syndrome and cardiovascular diseases: Going beyond traditional risk factors Diabetes Metab. Res. Rev. 2022 38 e3502 10.1002/dmrr.3502 34614543 79. Zhang Y. Du M. Wang J. Liu P. Astragaloside IV Relieves Atherosclerosis and Hepatic Steatosis via MAPK/NF-κB Signaling Pathway in LDLR(-/-) Mice Front. Pharmacol. 2022 13 828161 10.3389/fphar.2022.828161 35264962 PMC8899310 80. Ma C. Zhang J. Yang S. Hua Y. Su J. Shang Y. Wang Z. Feng K. Zhang J. Yang X. Astragalus Flavone Ameliorates Atherosclerosis and Hepatic Steatosis Via Inhibiting Lipid-Disorder and Inflammation in apoE(-/-) Mice Front. Pharmacol. 2020 11 610550 10.3389/fphar.2020.610550 33381046 PMC7768082 81. Sun C. Zeng G. Wang T. Ren H. An H. Lian C. Liu J. Guo L. Li W. Astragaloside IV Ameliorates Myocardial Infarction Induced Apoptosis and Restores Cardiac Function Front. Cell Dev. Biol. 2021 9 671255 10.3389/fcell.2021.671255 34395418 PMC8358605 82. You Y. Duan Y. Liu S.W. Zhang X.L. Zhang X.L. Feng J.T. Yan C.H. Han Y.L. Anti-atherosclerotic function of Astragali Radix extract: Downregulation of adhesion molecules in vitro and in vivo BMC Complement. Altern. Med. 2012 12 54 10.1186/1472-6882-12-54 22536886 PMC3478196 83. Sun B. Rui R. Pan H. Zhang L. Wang X. Effect of Combined Use of Astragaloside IV (AsIV) and Atorvastatin (AV) on Expression of PPAR-γ and Inflammation-Associated Cytokines in Atherosclerosis Rats Med. Sci. Monit. 2018 24 6229 6236 10.12659/MSM.908480 30190450 PMC6139110 84. Zhu Z. Li J. Zhang X. Astragaloside IV Protects Against Oxidized Low-Density Lipoprotein (ox-LDL)-Induced Endothelial Cell Injury by Reducing Oxidative Stress and Inflammation Med. Sci. Monit. 2019 25 2132 2140 10.12659/MSM.912894 30901320 PMC6441302 85. Fernandez M.L. Thomas M.S. Lemos B.S. DiMarco D.M. Missimer A. Melough M. Chun O.K. Murillo A.G. Alyousef H.M. Medina-Vera I. TA-65, A Telomerase Activator improves Cardiovascular Markers in Patients with Metabolic Syndrome Curr. Pharm. Des. 2018 24 1905 1911 10.2174/1381612824666180316114832 29546832 86. Chen X. Chen C. Fu X. Hypoglycemic effect of the polysaccharides from Astragalus membranaceus Food Funct. 2022 13 10121 10133 10.1039/D2FO02300H 36106494 87. Ma L. La X. Zhang B. Xu W. Tian C. Fu Q. Wang M. Wu C. Chen Z. Chang H. Total Astragalus saponins can reverse type 2 diabetes mellitus-related intestinal dysbiosis and hepatic insulin resistance in vivo Front. Endocrinol. 2023 14 1190827 10.3389/fendo.2023.1190827 PMC10694298 38053727 88. Xu G. Yuan H. Liu J. Wang X. Ma L. Wang Y. Dong G. Astragalus mongholicus Int. J. Mol. Sci. 2025 26 1470 10.3390/ijms26041470 40003935 PMC11855448 89. Yang B. Xiong Z. Lin M. Yang Y. Chen Y. Zeng J. Jia X. Feng L. Astragalus polysaccharides alleviate type 1 diabetes via modulating gut microbiota in mice Int. J. Biol. Macromol. 2023 234 123767 10.1016/j.ijbiomac.2023.123767 36812962 90. Song Q. Cheng S.W. Li D. Cheng H. Lai Y.S. Han Q. Wu H.Y. Shaw P.C. Zuo Z. Gut microbiota mediated hypoglycemic effect of Astragalus membranaceus Front. Pharmacol. 2022 13 1043527 10.3389/fphar.2022.1043527 36452223 PMC9703139 91. Song Q. Zou J. Li D. Cheng S.W. Li K.L.S. Yang X. Shaw P.C. Zuo Z. Gastrointestinal metabolism of Astragalus membranaceus Int. J. Biol. Macromol. 2024 280 135847 10.1016/j.ijbiomac.2024.135847 39307509 92. Gong P. Xiao X. Wang S. Shi F. Liu N. Chen X. Yang W. Wang L. Chen F. Hypoglycemic effect of astragaloside IV via modulating gut microbiota and regulating AMPK/SIRT1 and PI3K/AKT pathway J. Ethnopharmacol. 2021 281 114558 10.1016/j.jep.2021.114558 34438030 93. He X.Y. He J.J. Zheng N.N. Wang S.C. Li H.K. Study on Anti-Obesity Effect and Modulation of Gut Microbiota by Astragalus Polysaccharides in Mice World Chin. Med. 2016 11 2379 2384+2388 10.3969/j.issn.1673-7202.2016.11.046 94. Mohammad N.H.L. Mohamed A.S.R. Mohamed S.M. Abdelsalam H.M. Abdel-Wahab M.D. Maher S.M. Diet, Serum Short Chain Fatty Acids, and Potential Molecular Associations in Obesity QJM 2021 114 pi52 10.1093/qjmed/hcab088.006 95. Zhao W. Duan C. Liu Y. Lu G. Lyu Q. Liu X. Zheng J. Zhao X. Wang S. Zhao H. Modulating effects of Astragalus polysaccharide on immune disorders via gut microbiota and the TLR4/NF-κB pathway in rats with syndrome of dampness stagnancy due to spleen deficiency J. Zhejiang Univ. Sci. B 2023 24 650 662 10.1631/jzus.B2200491 37455140 PMC10350370 96. Zhai Y.Y. Mechanism of Astragaloside IV Alleviating Diet-Induced Obesity by Regulating Intestinal Flora Master’s Thesis Hebei University Baoding, China 2022 97. Wang L. Dong X.L. Qin X.M. Li Z.Y. Investigating the inter-individual variability of Astragali Radix against cisplatin-induced liver injury via 16S rRNA gene sequencing and LC/MS-based metabolomics Phytomedicine 2022 101 154107 10.1016/j.phymed.2022.154107 35561503 98. Li X. Li Z. Dong X. Wu Y. Li B. Kuang B. Chen G. Zhang L. Astragaloside IV attenuates myocardial dysfunction in diabetic cardiomyopathy rats through downregulation of CD36-mediated ferroptosis Phytother. Res. 2023 37 3042 3056 10.1002/ptr.7798 36882189 99. Wu J. Liu X.G. Feng X.C. Wang Y.H. Lei X.L. Effects Mechanism of Astragalus Polysaccharide on the Disorder of Glucose and Lipid Metabolism in Diabetes Rats via Wnt1 Signaling J. Liaoning Univ. Chin. Med. 2024 26 43 51 10.13194/j.issn.1673-842X.2024.11.009 100. Wang Y. Chen S.Y. Yang Z.M. Chinese Journal of Experimental Traditional Medical Formulae Intestine of Rat Model Induced by High-sugar and High-fat Diet Chin. J. Exp. Tradit. Med. Formulae 2019 25 64 68 10.13422/j.cnki.syfjx.20191037 101. Guo S. Ma B. Jiang X. Li X. Jia Y. Astragalus Polysaccharides Inhibits Tumorigenesis and Lipid Metabolism Through miR-138-5p/SIRT1/SREBP1 Pathway in Prostate Cancer Front. Pharmacol. 2020 11 598 10.3389/fphar.2020.00598 32431616 PMC7214922 102. Wang Z. Li X.L. Hong K.F. Zhao T.T. Dong R.X. Wang W.M. Li Y.T. Zhang G.L. Lin J. Gui D.K. Total flavonoids of Astragalus Ameliorated Bile Acid Metabolism Dysfunction in Diabetes Mellitus Evid. Based Complement. Altern. Med. 2021 2021 6675567 10.1155/2021/6675567 PMC8057874 33953787 103. Huang Y.C. Tsay H.J. Lu M.K. Lin C.H. Yeh C.W. Liu H.K. Shiao Y.J. Astragalus membranaceus Int. J. Mol. Sci. 2017 18 2746 10.3390/ijms18122746 29258283 PMC5751345 104. Li B. Hong Y. Gu Y. Ye S. Hu K. Yao J. Ding K. Zhao A. Jia W. Li H. Functional Metabolomics Reveals that Astragalus Polysaccharides Improve Lipids Metabolism through Microbial Metabolite 2-Hydroxybutyric Acid in Obese Mice Engineering 2022 9 111 122 10.1016/j.eng.2020.05.023 105. Wu H. Gao Y. Shi H.L. Qin L.Y. Huang F. Lan Y.Y. Zhang B.B. Hu Z.B. Wu X.J. Astragaloside IV improves lipid metabolism in obese mice by alleviation of leptin resistance and regulation of thermogenic network Sci. Rep. 2016 6 30190 10.1038/srep30190 27444146 PMC4957129 106. Jin Z. Gao W. Guo F. Liao S. Hu M. Yu T. Yu S. Shi Q. Astragaloside IV alleviates neuronal ferroptosis in ischemic stroke by regulating fat mass and obesity-associated-N6-methyladenosine-acyl-CoA synthetase long-chain family member 4 axis J. Neurochem. 2023 166 328 345 10.1111/jnc.15871 37300304 107. Dhondge R.H. Agrawal S. Patil R. Kadu A. Kothari M. A Comprehensive Review of Metabolic Syndrome and Its Role in Cardiovascular Disease and Type 2 Diabetes Mellitus: Mechanisms, Risk Factors, and Management Cureus 2024 16 e67428 10.7759/cureus.67428 39310549 PMC11416200 108. Wu Y. Ou-Yang J.P. Wu K. Wang Y. Zhou Y.F. Wen C.Y. Hypoglycemic effect of Astragalus polysaccharide and its effect on PTP1B Acta Pharmacol. Sin. 2005 26 345 352 10.1111/j.1745-7254.2005.00062.x 15715932 109. Xu W. Shen H. Chen M. Qian M. Effect of astragalus polysaccharide nanoliposomes on lipid metabolism and insulin resistance in pregnant rats with gestational diabetes by regulating AMPK pathway via protein-tyrosine phosphatase 1B inhibition Mater. Express 2022 12 831 838 10.1166/mex.2022.2214 110. Liu H. Bai J. Weng X. Wang T. Li M. Amelioration of insulin resistance in rat cells by Astragalus polysaccharides and associated mechanisms Exp. Ther. Med. 2014 7 1599 1604 10.3892/etm.2014.1626 24926351 PMC4043571 111. Zhang C. Zhu Y. Wang M. Chen R. Sun X. Comparison of chemical composition between imitation wild and transplanted Astragali Radix and their therapeutic effects on heart failure J. Ethnopharmacol. 2025 337 118827 10.1016/j.jep.2024.118827 39293703 112. Yue X. Hao W. Wang M. Fu Y. Astragalus polysaccharide ameliorates insulin resistance in HepG2 cells through activating the STAT5/IGF-1 pathway Immun. Inflamm. Dis. 2023 11 e1071 10.1002/iid3.1071 38018587 PMC10664394 113. Liu M. Qin J. Hao Y. Liu M. Luo J. Luo T. Wei L. Astragalus polysaccharide suppresses skeletal muscle myostatin expression in diabetes: Involvement of ROS-ERK and NF-κB pathways Oxid. Med. Cell Longev. 2013 2013 782497 10.1155/2013/782497 24454989 PMC3880770 114. Wei Z. Weng S. Wang L. Mao Z. Mechanism of Astragalus polysaccharides in attenuating insulin resistance in Rats with type 2 diabetes mellitus via the regulation of liver microRNA-203a-3p Mol. Med. Rep. 2018 17 1617 1624 10.3892/mmr.2017.8084 29257218 PMC5780102 115. Gu C. Zeng Y. Tang Z. Wang C. He Y. Feng X. Zhou L. Astragalus polysaccharides affect insulin resistance by regulating the hepatic SIRT1-PGC-1α/PPARα-FGF21 signaling pathway in male Sprague Dawley rats undergoing catch-up growth Mol. Med. Rep. 2015 12 6451 6460 10.3892/mmr.2015.4245 26323321 PMC4626146 116. Ye X. Xing X. Yuan K. Wang D. Wu D. Chen J. Yu J. Astragaloside IV ameliorates insulin induced insulin resistance in HepG2 cells through reactive oxygen species mediated c-Jun N-terminal kinase pathway J. Tradit. Chin. Med. 2023 43 60 67 10.19852/j.cnki.jtcm.2023.01.007 36639996 PMC9924701 117. Xu A. Wang H. Hoo R.L. Sweeney G. Vanhoutte P.M. Wang Y. Wu D. Chu W. Qin G. Lam K.S. Selective elevation of adiponectin production by the natural compounds derived from a medicinal herb alleviates insulin resistance and glucose intolerance in obese mice Endocrinology 2009 150 625 633 10.1210/en.2008-0999 18927219 PMC2732290 118. Zhou X. Wang L.L. Tang W.J. Tang B. Astragaloside IV inhibits protein tyrosine phosphatase 1B and improves insulin resistance in insulin-resistant HepG2 cells and triglyceride accumulation in oleic acid (OA)-treated HepG2 cells J. Ethnopharmacol. 2021 268 113556 10.1016/j.jep.2020.113556 33157223 119. Dutta B. Loo S. Kam A. Tam J.P. Plant-derived cell-penetrating microprotein α-astratide aM1 targets Akt signaling and alleviates insulin resistance Cell Mol. Life Sci. 2023 80 293 10.1007/s00018-023-04937-y 37715850 PMC10505102 120. Deng S. Yang L. Ma K. Bian W. Astragalus polysaccharide improve the proliferation and insulin secretion of mouse pancreatic β cells induced by high glucose and palmitic acid partially through promoting miR-136-5p and miR-149-5p expression Bioengineered 2021 12 9872 9884 10.1080/21655979.2021.1996314 34699323 PMC8810136 121. Zou F. Mao X.Q. Wang N. Liu J. Ou-Yang J.P. Astragalus polysaccharides alleviates glucose toxicity and restores glucose homeostasis in diabetic states via activation of AMPK Acta Pharmacol. Sin. 2009 30 1607 1615 10.1038/aps.2009.168 19960007 PMC4007496 122. Ren X. Dai Y. Shan M. Zheng J. Zhang Z. Shen T. Astragalus polysaccharide restores insulin secretion impaired by lipopolysaccharides through the protein kinase B/mammalian target of rapamycin/glucose transporter 2 pathway BMC Complement. Med. Ther. 2023 23 358 10.1186/s12906-023-04188-1 37817130 PMC10563267 123. Jiang Z. Wang G. Meng L. Tang Y. Yang M. Ni C. Protective Effects of Astragaloside IV on Uric Acid-Induced Pancreatic β-Cell Injury through PI3K/AKT Pathway Activation Evid. Based Complement. Altern. Med. 2022 2022 2429162 10.1155/2022/2429162 PMC8763508 35047042 124. Lin Y. Xu Y. Zheng X. Zhang J. Liu J. Wu G. Astragaloside IV Ameliorates Streptozotocin Induced Pancreatic β-Cell Apoptosis and Dysfunction Through SIRT1/P53 and Akt/GSK3β/Nrf2 Signaling Pathways Diabetes Metab. Syndr. Obes. 2022 15 131 140 10.2147/DMSO.S347650 35046684 PMC8763261 125. Huang C. Yang H.F. Effect of Astragaloside IV on GLP-1 secretion in type 2 diabetic rats J. Tradit. Chin. Vet. Med. 2022 41 1 6 10.13823/j.cnki.jtcvm.2022.04.001 126. Yang Z.M. Wang Y. Chen S.Y. Astragalus polysaccharide alleviates type 2 diabetic rats by reversing the glucose transporters and sweet taste receptors/GLP-1/GLP-1 receptor signaling pathways in the intestine-pancreatic axis J. Funct. Foods 2021 76 104310 10.1016/j.jff.2020.104310 127. Li X. Zhao T. Gu J. Wang Z. Lin J. Wang R. Duan T. Li Z. Dong R. Wang W. Intake of flavonoids from Astragalus membranaceus Chin. Med. 2022 17 22 10.1186/s13020-022-00578-8 35151348 PMC8840557 128. Eslam M. Sanyal A.J. George J. MAFLD: A Consensus-Driven Proposed Nomenclature for Metabolic Associated Fatty Liver Disease Gastroenterology 2020 158 1999–2014.e1991 10.1053/j.gastro.2019.11.312 32044314 129. Montemayor S. Mascaró C.M. Ugarriza L. Casares M. Llompart I. Abete I. Zulet M. Martínez J.A. Tur J.A. Bouzas C. Adherence to Mediterranean Diet and NAFLD in Patients with Metabolic Syndrome: The FLIPAN Study Nutrients 2022 14 3186 10.3390/nu14153186 35956364 PMC9370227 130. Lonardo A. Ballestri S. Marchesini G. Angulo P. Loria P. Nonalcoholic fatty liver disease: A precursor of the metabolic syndrome Dig. Liver Dis. 2015 47 181 190 10.1016/j.dld.2014.09.020 25739820 131. Zhao X. Lv W.L. Liu S. Cao Z.M. Xu L. Chen j. Li J.M. Mechanism of Astragali Radix in treatment of metabolic associated fatty liver disease based on network pharmacology Drug Eval. Res. 2021 44 89 97 10.1186/s13020-019-0251-z 132. Zhou B. Zhou D.L. Wei X.H. Zhong R.Y. Xu J. Sun L. Astragaloside IV attenuates free fatty acid-induced ER stress and lipid accumulation in hepatocytes via AMPK activation Acta Pharmacol. Sin. 2017 38 998 1008 10.1038/aps.2016.175 28344322 PMC5519246 133. Wei X.H. Yang X.Y. Hu F. Liang A.M. Guo Y.F. Sun L. Astragaloside IV Activates AMPK to Alleviate Liver Lipid Deposition of Nonalcoholic Fatty Liver Disease in Mice Drug Eval. 2021 18 1230 1234 10.19939/j.cnki.1672-2809.2021.20.04 134. Yang X.Y. Hu F. Wei X.H. HEAN P. Sun L. Effect of astragaloside IV on liver lipid metabolism of nonalcoholic fatty liver disease in mice J. Pract. Med. 2018 34 4064 4067+4071 10.3969/j.issn.1006-5725.2018.24.012 135. Zheng N. Wang H. Zhu W. Li Y. Li H. Astragalus polysaccharide attenuates nonalcoholic fatty liver disease through THDCA in high-fat diet-fed mice J. Ethnopharmacol. 2024 320 117401 10.1016/j.jep.2023.117401 37967775 136. Gu M. Zhang S. Zhao Y. Huang J. Wang Y. Li Y. Fan S. Yang L. Ji G. Tong Q. Cycloastragenol improves hepatic steatosis by activating farnesoid X receptor signalling Pharmacol. Res. 2017 121 22 32 10.1016/j.phrs.2017.04.021 28428116 137. Koenen M. Hill M.A. Cohen P. Sowers J.R. Obesity, Adipose Tissue and Vascular Dysfunction Circ. Res. 2021 128 951 968 10.1161/CIRCRESAHA.121.318093 33793327 PMC8026272 138. Ma D. Wu T. Qu Y. Yang J. Cai L. Li X. Wang Y. Astragalus polysaccharide prevents heart failure-induced cachexia by alleviating excessive adipose expenditure in white and brown adipose tissue Lipids Health Dis. 2023 22 9 10.1186/s12944-022-01770-3 36670439 PMC9863193 139. Zhang S.H. Effects of Astragalus Polysacharins on Brown Adipogenesis in C3H10T 1/2 Cells Master’s Thesis Shanxi Agricultural University Taiyuan, China 2021 140. Cao Y. Deng B. Zhang S. Gao H. Song P. Zhang J. Zhao J. Astragalus polysaccharide regulates brown adipogenic differentiation through miR-1258-5p-modulated cut-like homeobox 1 expression Acta Biochim. Biophys. Sin. 2021 53 1713 1722 10.1093/abbs/gmab151 34718370 141. Nie T. Zhao S. Mao L. Yang Y. Sun W. Lin X. Liu S. Li K. Sun Y. Li P. The natural compound, formononetin, extracted from Astragalus membranaceus Br. J. Pharmacol. 2018 175 1439 1450 10.1111/bph.14139 29315511 PMC5900995 142. Long Y. Zhang X.X. Chen T. Gao Y. Tian H.M. Radix Astragali Improves Dysregulated Triglyceride Metabolism and Attenuates Macrophage Infiltration in Adipose Tissue in High-Fat Diet-Induced Obese Male Rats through Activating mTORC1-PPARγ Signaling Pathway PPAR Res. 2014 2014 189085 10.1155/2014/189085 24817881 PMC4000987 143. Kim J.T. Chen J. Zhou Y. Son M.J. Jeon D.H. Kwon J.W. Lee G.Y. Lee H.J. Cycloastragenol inhibits adipogenesis and fat accumulation in vitro and in vivo through activating Hedgehog signaling Food Sci. Biotechnol. 2024 33 711 720 10.1007/s10068-023-01403-0 38274180 PMC10805729 144. Muscogiuri G. Verde L. Vetrani C. Barrea L. Savastano S. Colao A. Obesity: A gender-view J. Endocrinol. Investig. 2024 47 299 306 10.1007/s40618-023-02196-z 37740888 PMC10859324 145. Litwin M. Kułaga Z. Obesity, metabolic syndrome, and primary hypertension Pediatr. Nephrol. 2021 36 825 837 10.1007/s00467-020-04579-3 32388582 PMC7910261 146. Li X. The effect of astragalus extract tablets on cardiac and vascular function in patients with hypertension and metabolic syndrome J. Hypertens. 2018 36 pe141 10.1097/01.hjh.0000548568.45734.4e 147. Liu X.R. Li J. The antihypertensive and lipid-lowering functions of the active components of Astragalus membranaceus Chin. J. Gerontol. 2015 35 4800 4801 10.3969/j.issn.1005-9202.2015.17.029 148. Zheng W. Huang T. Tang Q.Z. Li S. Qin J. Chen F. Astragalus Polysaccharide Reduces Blood Pressure, Renal Damage, and Dysfunction Through the TGF-β1-ILK Pathway Front. Pharmacol. 2021 12 706617 10.3389/fphar.2021.706617 34690754 PMC8527034 149. Li X. Ma D. Wang X. Wang Y. Yang J. Jiang P. Astragaloside IV Ameliorates Obesity-Associated Hypertension by Up-Regulating α7 Nicotinic Acetylcholine Receptor J. Am. Coll. Cardiol. 2017 70 C43 10.1016/j.jacc.2017.07.148 150. Li N.Y. Li X.L. Zhai X.P. Wang Q.Y. Zhang X.W. Zhao F. Wang X.F. Fan J.Y. Bai F. Yu J. Effects of Mongolia Astragali Radix in protecting early cardiac and nephritic functions of patients of hypertension with metabolic syndrome Zhongguo Zhong Yao Za Zhi 2016 41 4051 4059 10.4268/cjcmm20162126 28929695 151. Li J. Liu W. Li H. Ye X. Qin J.J. Changes of metabolic syndrome status alter the risks of cardiovascular diseases, stroke and all cause mortality Sci. Rep. 2025 15 5448 10.1038/s41598-025-86385-1 39952953 PMC11828854 152. Li M.R. Yu Y.R. Deng G. Astragalus membranaceus J. South. Med. Univ. 2010 30 7 10 10.12122/j.issn.1673-4254.2010.01.002 20117973 153. Meng P. Yang R. Jiang F. Guo J. Lu X. Yang T. He Q. Molecular Mechanism of Astragaloside IV in Improving Endothelial Dysfunction of Cardiovascular Diseases Mediated by Oxidative Stress Oxid. Med. Cell Longev. 2021 2021 1481236 10.1155/2021/1481236 34840664 PMC8626190 154. Lyu X. Yi Z. He Y. Zhang C. Zhu P. Liu C. Astragaloside IV induces endothelial progenitor cell angiogenesis in deep venous thrombosis through inactivation of PI3K/AKT signaling Histol. Histopathol. 2024 39 1149 1157 10.14670/hh-18-704 38275076 155. Qiu L.H. Zhang B.Q. Lian M.J. Xie X.J. Chen P. Vascular protective effects of Astragalus membranaceus Exp. Ther. Med. 2017 14 2401 2407 10.3892/etm.2017.4739 28962174 PMC5609140 156. Li N.Y. Yu H. Li X.L. Wang Q.Y. Zhang X.W. Ma R.X. Zhao Y. Xu H. Liang W. Bai F. Astragalus membranaceus Chin. Med. J. 2018 131 516 526 10.4103/0366-6999.226077 29483384 PMC5850666 157. Yang M. Zhang Y. Ren J. Autophagic Regulation of Lipid Homeostasis in Cardiometabolic Syndrome Front. Cardiovasc. Med. 2018 5 38 10.3389/fcvm.2018.00038 29774216 PMC5943591 158. Wang Q. Yang X. Song Y. Sun X. Li W. Zhang L. Hu X. Wang H. Zhao N. Zhuang R. Astragaloside IV-targeting miRNA-1 attenuates lipopolysaccharide-induced cardiac dysfunction in rats through inhibition of apoptosis and autophagy Life Sci. 2021 275 119414 10.1016/j.lfs.2021.119414 33774032 159. Zhang T. Wang H. Lu M. Zhao K. Yin J. Liu Y. Sun Y. Astragaloside IV prevents myocardial hypertrophy induced by mechanical stress by activating autophagy and reducing inflammation Am. J. Transl. Res. 2020 12 5332 5342 33042423 PMC7540164 160. Yang J.J. Zhang X.H. Ma X.H. Duan W.J. Xu N.G. Chen Y.J. Liang L. Astragaloside IV enhances GATA-4 mediated myocardial protection effect in hypoxia/reoxygenation injured H9c2 cells Nutr. Metab. Cardiovasc. Dis. 2020 30 829 842 10.1016/j.numecd.2020.01.009 32278611 161. Deng S. Cai K. Pei C. Zhang X. Xiao X. Chen Y. Chen Y. Liang R. Chen Y. Li P. 16S rRNA and Metagenomics Combined with UPLC-Q/TOF-MS Metabolomics Analysis Reveals the Potential Mechanism of Radix Astragali Against Hyperuricemia in Mice Drug Des. Devel. Ther. 2023 17 1371 1386 10.2147/DDDT.S407983 PMC10171225 37181826 162. He K.Q. Li W.Z. Chai X.Q. Yin Y.Y. Jiang Y. Li W.P. Astragaloside IV prevents kidney injury caused by iatrogenic hyperinsulinemia in a streptozotocin-induced diabetic rat model Int. J. Mol. Med. 2018 41 1078 1088 10.3892/ijmm.2017.3265 29207011 163. Wang R. Lin F. Ye C. Aihemaitijiang S. Halimulati M. Huang X. Jiang Z. Li L. Zhang Z. Multi-omics analysis reveals therapeutic effects of Bacillus subtilis Astragalus membranaceus Food Chem. 2023 399 133993 10.1016/j.foodchem.2022.133993 36029678 164. Zhang M.Q. Sun K.X. Guo X. Chen Y.Y. Feng C.Y. Chen J.S. Barreira J.C.M. Prieto M.A. Sun J.Y. Zhang J.D. The antihyperuricemia activity of Astragali Radix through regulating the expression of uric acid transporters via PI3K/Akt signalling pathway J. Ethnopharmacol. 2023 317 116770 10.1016/j.jep.2023.116770 37308029 165. Zhang W. Cui Y. Zhang J. Multi metabolomics-based analysis of application of Astragalus membranaceus Front. Pharmacol. 2022 13 948939 10.3389/fphar.2022.948939 35935868 PMC9355468 166. Wang H. Tao Y. Cui Y. Lan X. Song S. Zhang Z. Wang S. Yang A. Zhang J. Integrated metabolomics and transcriptomics to study mechanisms of Paecilomyces cicadae Food Biosci. 2024 59 104136 10.1016/j.fbio.2024.104136 167. Nejati A. Shahri M.P.K. Farahvash T. Astragalus hamosus Endocr. Metab. Immune Disord. Drug Targets 2022 22 348 356 10.2174/1871530321666211110123931 34758721 168. Li R. Hu R. Huang Y. Li D. Ma X. Yang Y. Astragalus polysaccharide alleviates polycystic ovary syndrome by reducing insulin resistance and oxidative stress and increasing the diversity of gut microbiota Endocrine 2024 83 783 797 10.1007/s12020-023-03553-x 37824046 169. Wen M. Chen W. Zhou Q. Dou X. Astragaloside IV regulates autophagy-mediated proliferation and apoptosis in a rat model of PCOS by activating the PPARγ pathway Iran. J. Basic. Med. Sci. 2022 25 882 889 10.22038/ijbms.2022.64475.14179 36033957 PMC9392570 170. Cui L. Ma Z. Wang D. Niu Y. Ultrasound-assisted extraction, optimization, isolation, and antioxidant activity analysis of flavonoids from Astragalus membranaceus Ultrason. Sonochemistry 2022 90 106190 10.1016/j.ultsonch.2022.106190 PMC9554832 36215890 171. Cui L. Ma Z. Li W. Ma H. Guo S. Wang D. Niu Y. Inhibitory activity of flavonoids fraction from Astragalus membranaceus Bacillus cereus Front. Pharmacol. 2023 14 1183393 10.3389/fphar.2023.1183393 37538180 PMC10395332 172. Samuel A.O. Huang B.T. Chen Y. Guo F.X. Yang D.D. Jin J.Q. Antioxidant and antibacterial insights into the leaves, leaf tea and medicinal roots from Astragalus membranaceus Sci. Rep. 2021 11 19625 10.1038/s41598-021-97109-6 34608170 PMC8490359 173. Rao T. Gong Y.F. Peng J.B. Wang Y.C. He K. Zhou H.H. Tan Z.R. Lv L.Z. Comparative pharmacokinetic study on three formulations of Astragali Radix by an LC-MS/MS method for determination of formononetin in human plasma Biomed. Chromatogr. 2019 33 e4563 10.1002/bmc.4563 31025385 174. Xiang L.H. Guo X.Y. Feng M.G. Zhang J. Zhang J. Feng Z.M. Li Y. Lv Y. Liu G.X. Cai S.Q. Phenomenological pharmacokinetics of traditional Chinese medicines: A proof-of-concept study of the Paeoniae Radix Rubra and Astragali Radix-Saposhnikoviae Radix herb pair J. Ethnopharmacol. 2025 348 119875 10.1016/j.jep.2025.119875 40287114 175. Wang X.H. Li P.X. Gong T.T. Lu Y.Q. Yang B. Wang X.T. Pharmacokinetics and tissue distribution of fluorescent-labeled Astragalus polysaccharides in mice Zhongguo Zhong Yao Za Zhi 2025 50 1959 1968 10.19540/j.cnki.cjcmm.20250111.201 40350888 176. Du W. Hu J. Liang J. Yang X. Fang B. Ma G. Effect of Astragali radix extract on pharmacokinetic behavior of dapagliflozin in healthy and type 2 diabetic rats Front. Pharmacol. 2023 14 1214658 10.3389/fphar.2023.1214658 37881186 PMC10597649 177. Zhao Z.X. Tang X.H. Jiang S.L. Pang J.Q. Xu Y.B. Yuan D.D. Zhang L.L. Liu H.M. Fan Q. Astragaloside IV improves the pharmacokinetics of febuxostat in rats with hyperuricemic nephropathy by regulating urea metabolism in gut microbiota Front. Pharmacol. 2022 13 1031509 10.3389/fphar.2022.1031509 36605404 PMC9807765 178. Stępnik K. Kukula-Koch W. Plazinski W. Gawel K. Gaweł-Bęben K. Khurelbat D. Boguszewska-Czubara A. Significance of Astragaloside IV from the Roots of Astragalus mongholicus Int. J. Mol. Sci. 2023 24 9152 10.3390/ijms24119152 37298103 PMC10252989 179. Wu Y.J. Li Z.H. Li J.Y. Zhou Y. Wang R.Y. Chen X.Y. Qing L.S. Luo P. Elucidation of the binding mechanism of astragaloside IV derivative with human serum albumin and its cardiotoxicity in zebrafish Front. Pharmacol. 2022 13 987882 10.3389/fphar.2022.987882 36210826 PMC9537572 Figure 1 Some flavonoids isolated from AM (Numbers ( 1 28 Figure 2 Some saponin compounds isolated from the leaves of AM (Numbers ( 29 40 Figure 3 Some saponin compounds isolated from the aerial parts of AM (Numbers ( 41 52 Figure 4 Some saponin compounds isolated from the leaves of AM (Numbers ( 53 68 Figure 5 Some saponin compounds isolated from the stems and leaves of AM (Numbers ( 69 86 Figure 6 Regulation mechanisms of AM on GLP-1 (Green ↑ means increase). Figure 7 Mechanism of AM multi-target intervention in NAFLD (Green ↑ means increase; red ↓ means decrease). Figure 8 Mechanisms of AM in treating MetS (Green ↑ means increase; red ↓ means decrease/suppress). ",
  "metadata": {
    "Title of this paper": "Elucidation of the binding mechanism of astragaloside IV derivative with human serum albumin and its cardiotoxicity in ",
    "Journal it was published in:": "Molecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472940/"
  }
}