{
  "title": "Paper_41",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490238 PMC12490238.1 12490238 12490238 40961921 10.1016/j.xcrm.2025.102355 S2666-3791(25)00428-8 102355 1 Article ATM deficiency drives phenotypic diversity and Purkinje cell degeneration in a macaque model of ataxia-telangiectasia Xu Kaiyu 1 7 Zhang Ying 1 7 Chen Yongxuan 1 2 7 Zhu Xiaojia 1 2 7 Li Yu 1 7 Lv Longbao 1 2 7 He Xiechao 1 Hu Zhengfei 1 Li Yifan 1 Ye Maosen 1 Jiang Dewei 1 He Zhanlong 3 Jin Weihua 3 Li Yanyan 3 Yu Xiaomei 1 Zhang Deng-Feng 1 Herrup Karl 4 8 Zheng Ping 1 2 8 Yao Yong-Gang yaoyg@mail.kiz.ac.cn 1 2 ∗ Wu Dong-Dong wudongdong@mail.kiz.ac.cn 1 2 ∗∗ Li Jiali jiali.li@hmhn.org 1 5 6 9 ∗∗∗ 1 2 3 4 5 ∗ yaoyg@mail.kiz.ac.cn ∗∗ wudongdong@mail.kiz.ac.cn ∗∗∗ jiali.li@hmhn.org 6 Present address: JFK Neuroscience Institute, Hackensack Meridian Health JFK University Medical Center, Edison, NJ, USA 7 These authors contributed equally 8 Senior author 9 Lead contact 16 9 2025 16 9 2025 6 9 498186 102355 29 10 2024 11 5 2025 14 8 2025 16 09 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary Ataxia-telangiectasia (A-T) is a hereditary neurodegenerative disorder caused by mutations in the ATM (ataxia-telangiectasia mutated) gene. Although existing rodent models reproduce some of the multi-systemic features of A-T, they notably fail to recapitulate the severe neurological manifestations, particularly the profound cerebellar atrophy and associated ataxia. To address this limitation, we have generated ATM-deficient rhesus macaques using CRISPR-Cas9. These macaques exhibit hallmark features of A-T, including growth retardation, lymphopenia, elevated a-fetoprotein levels, oculocutaneous telangiectasias, heightened sensitivity to ionizing radiation, and most critically, cerebellar atrophy, Purkinje cell loss, and early-stage cerebellar neurodegeneration leading to significant motor impairments. Single-nucleus transcriptomic profiling of the cerebellum revealed pronounced gene expression changes associated with ATM deficiency, particularly in molecular layer interneurons (MLIs), which are implicated in Purkinje cell loss. This non-human primate model provides deeper insights into the pathogenesis of A-T and represents a promising and valuable platform for developing therapeutic strategies. Graphical abstract Highlights • CRISPR-Cas9-generated ATM deficiency in macaque models human A-T • ATM-deficient macaques faithfully recapitulate key phenotypes of human A-T • Progressive cerebellar atrophy with early onset is observed in ATM-deficient macaques • ATM deficiency causes Purkinje cell loss and transcriptomic shifts in cerebellar cell types Xu et al. report that CRISPR-Cas9-engineered ATM-deficient rhesus macaques model key features of ataxia-telangiectasia, including growth retardation, immune deficiency, and most critically, early-onset cerebellar atrophy. This model provides deeper insights into the pathogenesis of A-T and represents a promising and valuable platform for developing therapeutic strategies. Keywords ataxia-telangiectasia ATM deficiency Nonhuman primate disease model cerebellar atrophy CRISPR-Cas9 magnetic resonance imaging, MRI snRNA-seq Purkinje cell degeneration pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: September 16, 2025 Introduction Ataxia-telangiectasia (A-T) is a rare autosomal recessive disorder characterized by a spectrum of clinical features, including progressive cerebellar neurodegeneration (ataxia), oculocutaneous telangiectasias, immunodeficiency, growth retardation, incomplete sexual maturation, endocrine abnormalities, heightened sensitivity to radiation, and elevated cancer risk. 1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 ATM 9 , 10 ATM 11 ATM 12 , 13 4 , 9 14 , 15 , 16 , 17 , 18 , 19 , 20 21 22 , 23 24 , 25 , 26 4 , 27 Developing physiologically relevant animal models remains a critical priority for studying this complex disorder. Notably, murine models expressing kinase-dead ATM variants display embryonic lethality, highlighting the challenges of recapitulating human pathology in rodent systems. 28 Atm 29 , 30 , 31 29 27 , 28 , 29 32 , 33 , 34 35 , 36 , 37 , 38 39 , 40 , 41 42 , 43 The rhesus macaques ( Macaca mulatta 44 45 , 46 47 , 48 33 , 49 The application of CRISPR-Cas9 genome editing in non-human primates (NHPs) has enabled precise modeling of human genetic disorders. 33 , 49 , 50 51 , 52 PSEN1 53 SHANK3 32 ANK2 34 PDX1 54 Here, we aimed to establish an NHP model of A-T by generating ATM-deficient rhesus macaques using CRISPR-Cas9 gene editing. Firstly, we observed classical A-T phenotypes in the mutant animals, including growth retardation, lymphopenia, elevated alpha-fetoprotein (AFP), oculocutaneous telangiectasias, motor dysfunction, progressive cerebellar degeneration, and Purkinje cell loss. Subsequently, we applied single-nucleus transcriptomic profiling to reveal ATM deficiency-associated gene expression changes across diverse cerebellar cell types. Finally, we demonstrated that this NHP model offers critical insights into the molecular basis of A-T neuropathogenesis and provides a valuable platform for therapeutic development. Results Generation of ATM-deficient rhesus macaques using CRISPR-Cas9-mediated gene targeting in one-cell embryos The ATM Figure S1 ATM ATM Figure 1 Figure 1 Generation of ATM-deficient macaques (A) Schematic representation of the wild-type macaque ATM (B) Detailed information of all macaques (ATM-deficient macaques, A1, A2, and A3; wild-type control macaques, C1, C2, and C3) in this study. (C) Photographs of all macaques at 3 months of age. The images include controls (C1, C2, and C3; ATM +/+ ATM −/− (D) Partial sequence alignment of the ATM (E) PCR detection of sgRNA/Cas9-mediated cleavage at the ATM (F) Immunoblot analysis showing the absence of ATM protein in fibroblasts collected from all macaques. β-actin served as a loading control. (G) Illustration of animal experiment workflow in all macaques. Following these in vitro Figure S1 ATM Figures S1 Figure S1 Figure S1 in vitro Figure S1 Figures 1 To confirm the success of the gene editing, ear punch tissues and peripheral blood samples were collected from the three gene-manipulated macaques. Analysis revealed the anticipated frameshift mutations in exon 3 of the ATM Figures 1 55 ATM western blotting Figure 1 All animal experiments were conducted in strict accordance with established ethical and welfare guidelines. At two years of age, individuals A1 and C1 were euthanized for pathological evaluation ( Figure S1 Figure 1 ATM-deficient macaques exhibit phenotypes resembling A-T patients Our initial assessments focused on early developmental metrics, such as body weight and head circumference. ATM-deficient macaques showed no statistically significant differences in these parameters when compared to their counterparts during early development ( Figures 2 Figure 2 29 Figure 2 9 , 56 Figure 2 ATM-deficiency in macaques recapitulates canonical A-T phenotypes in humans (A and B) Body weight (A) and head circumference (B) of control ( ATM +/+ ATM −/− n (C) Representative photographs of control (C1; ATM +/+ ATM −/− (D) Ocular telangiectasia observed in ATM-deficient macaques (A1, A2, and A3) but not in controls (C1, C2, and C3). Yellow arrows indicate the presence of telangiectasia. Scale bars, 2 mm. (E) Serum levels of alpha-fetoprotein (AFP) in control and ATM-deficient macaques. Data are presented as mean ± SEM, with n p p (F and G) Western blot analysis showing the expression of PARP in fibroblasts from ATM-deficient macaques and controls (F) and quantification (G). GAPDH was used as a loading control. (H) The survival rate of fibroblasts from ATM-deficient macaques and controls after irradiation at different doses. Data in (G and H) are presented as mean ± SEM, with n p p Additionally, we identified hyperactivation of PARP in fibroblasts derived from ATM-deficient macaques compared to those of controls ( Figures 2 57 Figures S2 Figures 2 S2 ATM deficiency leads to significant immune system impairments Immune system dysfunction is a hallmark of A-T, a condition caused by mutations in the ATM 58 , 59 , 60 Figures S3 Figure 3 Figure 3 Figure 3 ATM −/− ATM +/+ Figures 3 S3 Figures S3 60 Figure 3 ATM deficiency in macaques results in reduced immune function (A–C) Peripheral blood analyses of ATM-deficient and control macaques. ATM-deficient macaques exhibited significantly lower counts of white blood cells (A) and lymphocytes (B) during development compared to controls. The lymphocyte ratio (C) was also reduced in ATM-deficient macaques. Data are presented as mean ± SEM, with n p p (D and E) Representative hematoxylin and eosin (H&E) stained sections showing tissue architecture in an ATM-deficient macaques (A1, ATM −/− ATM −/− (F and G) Elevated serum immunoglobulin IgM (F) and IgA (G) levels in ATM-deficient macaques compared to controls. Data are presented as mean ± SEM, with n p p p In addition to these lymphoid abnormalities, a detailed histological analysis of liver, kidney, and muscle tissues from both ATM −/− ATM +/+ Figure S3 ATM −/− Figure 3 Figures 3 S3 Figure 3 58 , 61 Cerebellum-related neurobehavioral deficits in ATM-deficient macaques Progressive impairment in the coordination of voluntary movement is a hallmark feature of A-T in patients. 62 , 63 Figures S4 Figures 4 Figure 4 Behavioral abnormalities indicative of cerebellar dysfunction in ATM-deficient macaques (A) ATM-deficient macaques exhibited reduced activity in their home cages at 3 months of age. Data are presented as mean ± SEM, with n p (B) ATM-deficient macaques primarily moved within the lower regions of the cage, indicating the limited range of motion. (C) Representative footprint patterns from three controls (C1, C2, and C3; ATM +/+ ATM −/− (D) Photographs illustrating the bipedal gait of a control macaque (C1; ATM +/+ ATM −/− (E–H) Significant behavioral abnormalities in ATM-deficient macaques, including increased cadence (E), shortened gait cycle (F), reduced stride length (G), and increased stride width (H), compared to controls. Data are presented as mean ± SEM, with n p p p (I and J) Fine motor abilities of the upper limbs in ATM-deficient macaques were not significantly impaired, as assessed by the Klüver board (I) and vertical slit (J) tasks at 15 months of age. (I) Schematic of the Klüver board ( top botttom (J) Schematic of the vertical slit task (window size: 30 × 6 mm) ( left x y right n (K) Learning and memory were not impaired in ATM-deficient macaques relative to controls. The delayed-response task in a modified Wisconsin General Test Apparatus (WGTA) suitable for young macaques ( left right n To further investigate motor coordination, we employed the Kinema Tracer 3D gait analysis system (Kissei, Japan) 64 Figures 4 Figures 4 Videos S1 S2 S3 S4 S5 S6 65 , 66 Figures 4 S4  Video S1. Related to Figure 3, bipedal gait of macaque (A1, ATM −/−  Video S2. Related to Figure 3, bipedal gait of macaque (A2, ATM −/−  Video S3. Related to Figure 3, bipedal gait of macaque (A3, ATM −/−  Video S4. Related to Figure 3, bipedal gait of macaque (C1, ATM +/+  Video S5. Related to Figure 3, bipedal gait of macaque (C2, ATM +/+  Video S6. Related to Figure 3, bipedal gait of macaque (C3, ATM +/+ To evaluate cognitive functions related to the cerebrum, particularly learning and memory, we used the delayed-response task, a well-established test linked to prefrontal cortex activity. 67 , 68 , 69 Figure 4 Figures 4 S4 Brain MRI tracking reveals progressive cerebellar atrophy and altered cerebellum connectivity in ATM-deficient macaques Neurodegeneration, particularly early-onset cerebellar atrophy, is one of the most debilitating aspects of A-T in patients. 70 Figure 5 Figure 5 Figures S5 Figure S5 Figure 5 Figure 5 Figure 5 MRI scans reveal progressive cerebellar atrophy and degeneration in ATM-deficient macaques (A) T1-weighted structural images of the brain at 21 months of age from a control macaque (C2; top bottom (B and C) Volume (B) and growth rate analysis of the cerebellum (C) in control macaques ( ATM +/+ blue ATM −/− red n p p (D) Temporal differences in cerebellar volume between ATM-deficient and control macaques. The 3D maps above and below the dot plots illustrate the degree of atrophy across different cerebellar compartments (expressed as the percentage difference in volume relative to controls). Bars represent the average volume reduction in specific subregions over time. The schematic diagram provides the spatial distribution of cerebellar subregions from anterior and posterior views. Labels: A (anterior), P (posterior), R (right), L (left), and D (dorsal). (E) Average functional connectivity (FC) within the cerebellum, comparing ATM-deficient macaques to controls. The graph on the right shows differences in intracerebellar functional connectivity between the two groups. As the macaques aged, cerebellar atrophy in ATM-deficient individuals became increasingly pronounced. This atrophy was most rapid during the first 12 months of life, after which it continued at a slower pace, reaching its peak severity by 21 months ( Figure 5 71 Figure 5 Brain function is closely linked with the brain’s geometry, such as its shape (contour and curvature). 72 72 Figure S5 Altered functional connectivity has recently been recognized as a key biomarker of neuropathological states in a range of neurological and psychiatric disorders. 32 Figures 5 S5 Figure S5 ATM deficiency induces vulnerability and degenerative changes in macaque cerebellar Purkinje cells To identify neuropathological differences, we performed detailed histological analyses at both the light and ultrastructural levels. Gross histological examination revealed a reduction in cerebellar volume and abnormal morphology in the ATM-deficient macaque (A1) compared to the control (C1) ( Figure 6 Figures S6 73 , 74 Figures 6 75 Figure S6 Figures S6 Figures 6 Figure 6 ATM deficiency leads to Purkinje cell vulnerability and degenerative changes (A) Immunohistochemical staining for DARPP32, a marker for Purkinje cells, in cerebellar hemispheres and vermis sections from a control (C1; ATM +/+ ATM −/− left right (B and C) A significant reduction of the number of DARPP32-positive Purkinje cells (PCs) in cerebellar hemispheres (B) and vermis (C) in ATM-deficient macaque (A1) compared to control (C1). Data are presented as mean ± SEM, with counts from at least two sections and ten visual fields per section. ∗∗∗∗ p (D–H) Examination of Purkinje cell structure and dendritic spines in control and ATM-deficient macaque (A1) by Golgi staining. (D) Representative images of Purkinje cells. Scale bars, 20 μm. (E) Sholl analysis depicting the number of intersections of Purkinje cell branches and branchlets with concentric spheres centered on the cell soma. (F) Quantification of Purkinje cell body area. (G) Representative images showing dendritic spines of Purkinje cells. Scale bars, 10 μm. (H) Quantification of dendritic spine density. Data are presented as mean ± SEM from at least five sections, with counts from five different Purkinje cells per section; n.s., no significance; unpaired t test. (I–P) Ultrastructural abnormalities in Purkinje cells due to ATM deficiency. (I) Representative electron microscopy images showing Purkinje cell ultrastructure in the cerebellar vermis. Mit, mitochondria; ER, endoplasmic reticulum. Scale bars, 10 μm. (J) Number of mitochondria in Purkinje cells. (K) Mitochondrial area. (L) Mitochondrial width. (M) Mitochondrial length. (N) Mitochondrial aspect ratio. (O) Percentage of different mitochondrial categories. Data include n (P) Endoplasmic reticulum lumen width. Data include n p p (Q–U) Cerebellar myelin degeneration in ATM-deficient macaque (A1). (Q) Ultrastructural images of myelin in the cerebellar vermis. Scale bars, 5 μm. (R) Scatterplots of G-ratio indicating myelin thinning. (S) Calculation of G-ratio showing decreased myelin thickness. (T) Axon diameter measurements. (U) Axon density analysis. ∗ p p Given the critical role of mitochondria in cellular metabolism, particularly in high-energy-demanding cells such as neurons, we examined the impact of ATM deficiency on mitochondrial integrity. Previous studies have reported impaired mitochondrial function in ATM-deficient cultured cells. 9 , 76 Figures 6 Figures 6 To further explore the impact of ATM deficiency on cerebellar function, we assessed the state of cerebellar white matter. We measured the g-ratio, axon diameter, and myelin thickness-key metrics for evaluating axonal myelination. 77 Figures 6 Figures S6 Moreover, in vivo Figure S6 p n p n Figure S6 Single-nucleus transcriptome profiling of cerebellum in ATM-deficient macaque To gain a deeper understanding of the molecular and cellular mechanisms underlying cerebellar dysfunction in ATM-deficient macaques, we conducted a comprehensive snRNA-seq analysis across various cerebellar regions, including the superior vermis (SV), anterior lobe (AL), posterior lobe (PL), and flocculus (FL) ( Figure 7 Figures S7 Figure 7 78 , 79 , 80 Figure 7 81 Figure 7 Figure 7 Single-cell transcriptomic atlas of neural cell types in the cerebellum of ATM-deficient and C1 macaques (A) 3D visualization of all collected samples. A total of four cerebellar subregions (SV, AL, PL, and FL) were isolated and profiled using snRNA-seq. (B) UMAP visualization of snRNA-seq profiles for all cell types, with colors representing different cell populations. AS, astrocyte; Endo, endothelial cell; Mic, microglia; MLI, molecular layer interneuron; PLI, Purkinje layer interneuron; OL, oligodendrocyte; OPC, oligodendrocyte precursor cell; BG, Bergmann glia; Granule, granule neuron; Golgi, Golgi neuron; Purkinje, Purkinje cell. (C) Expression patterns of cell-type-specific markers from the snRNA-seq data shown in (B). (D) Relative proportions of each cell type in control (C1; ATM +/+ ATM −/− (E) Gene ontology (GO) ( top bottom p (F) Differentially expressed genes (DEGs) between ATM-deficient (A1) and control (C1) macaques across various cell types. Blue bars represent down-regulated genes while pink bars represent up-regulated genes in ATM-deficient macaque (A1) relative to control according to the criteria |log2FoldChange| > 0, p (G) GO terms associated with downregulated genes in MLI1 ( top bottom p (H) Overview of the intercellular communication networks among cells measured by network centrality analysis. Different cell populations are illustrated with different colors, and the blue edge represents a decrease in the number of interactions in ATM-deficient cerebellum compared with C1 ( top bottom (I) Heatmaps of the overall signaling flows for each cell population mediated by individual signaling axes in ATM-deficient cerebellum (A1) and control (C1). One of the most striking findings from our analysis was the marked reduction in the proportion of Purkinje cells in the ATM-deficient macaque (A1) compared to the control (C1), providing strong evidence of Purkinje cell loss ( Figure 7 Figure 7 Table S3 Figure 7 Additionally, we performed a comprehensive differential gene expression analysis across twelve distinct cell types identified in our snRNA-seq dataset, comparing the ATM-deficient (A1) and control (C1) conditions. Using a threshold of |log 2 p Figure 7 41 To better understand the functional implications of the observed gene expression changes in MLI1 and MLI2, we conducted gene set enrichment analysis on the downregulated genes. This analysis revealed significant enrichment of pathways related to protein metabolism, synaptic vesicle cycling, and neurotransmitter release ( Figures 7 S7 As Purkinje cell loss and MLIs dysfunction in the cerebellum significantly correlate with the pathological progression of ATM-deficient cerebellum, we conducted a cell-cell communication analysis to map coordinated differences in the cerebellar cellular communications underlying the ATM-deficient and healthy control conditions. We compared the global communication atlas between ATM-deficient (A1) and control (C1) cerebellums. We found that the total inferred interactions between cells decreased in the ATM-deficient cerebellum in terms of both the number and strength of the interactions ( Figures 7 S7 Figure S7 Figure 7 ATM kinase plays a crucial role in the DNA damage response pathway. 82 , 83 , 84 85 , 86 , 87 , 88 , 89 Figure S7 Discussion A-T is a complex genetic disorder associated with mutations in the ATM 1 , 5 , 73 4 , 90 In this study, a CRISPR-Cas9-engineered ATM-deficient rhesus macaque model, which overcomes several critical shortcomings of rodent models, was successfully generated. This NHP system more faithfully mimics the clinical and pathological progression of human A-T, particularly regarding cerebellar degeneration. ATM deficiency was confirmed through genetic and functional analyses in three macaques, all of which developed hallmark features of A-T, including elevated AFP, conjunctival telangiectasias, and hypersensitivity to radiation-induced DNA damage. 62 , 91 33 , 92 , 93 , 94 , 95 Longitudinal multimodal analyses including molecular assays, MRI brain imaging, and behavioral testing revealed significant cerebellar atrophy localized to the vermis and hemispheres, with relatively preserved volumes in the cerebral cortex and hippocampus. This cerebellar-specific degeneration correlated with early-onset motor dysfunction (e.g., ataxic gait and stance), phenocopying human A-T. 62 , 91 8 To elucidate the molecular underpinnings of cerebellar dysfunction, we performed snRNA-seq on over 121,000 cerebellar cells. Twelve distinct cell types were identified, including a substantial reduction in Purkinje cells in ATM-deficient animals. Although most cell types exhibited global transcriptional downregulation, Purkinje cells showed surprisingly few DEGs. In contrast, MLIs (MLI1 and MLI2), which modulate cerebellar circuitry and provide critical support for Purkinje cells, 41 38 In summary, this ATM-deficient macaque model faithfully recapitulates the neurodevelopmental, neurodegenerative, and systemic features of A-T, bridging a long-standing gap between murine models and human disease. The identification of primate-specific cellular and molecular signatures offers insights into A-T pathogenesis and establishes a robust platform for therapeutic discovery. Future studies leveraging this model to evaluate targeted therapies or gene therapy strategies could significantly advance treatment development for A-T and related cerebellar disorders. Limitations of the study We developed ATM-deficient macaques that mimic early-stage features of human A-T, including motor deficits, cerebellar atrophy, and altered cerebellar gene expression. However, a key limitation is the current focus on early manifestations. Understanding the full course of A-T will require longitudinal studies capturing late-stage phenotypes and broader systemic dysfunction, including the deep cerebellar nuclei, other brain regions, spinal cord, immune system, tumor susceptibility, and reproductive health. Additionally, due to model availability and ethical considerations, pathological and snRNA-seq analysis were conducted at a single time point and restricted to male macaques. This might preclude assessment of age- and sex-dependent pathophysiological variations in A-T progression. While we observed transcriptomic changes across cerebellar cell types, the mechanisms underlying Purkinje cell vulnerability remain unclear. Future work should dissect ATM-dependent DNA repair, metabolic regulation, oxidative stress pathways, and electrophysiological properties in specific neuronal and glial populations to identify targets for preventing motor decline. The rarity of A-T presents challenges for therapy development and biomarker validation, underscoring the value of robust preclinical models. Despite the limited number of surviving ATM-deficient macaques, this model lays essential groundwork for large-scale phenotypic screens and therapeutic discovery. Finally, the absence of high-throughput, clinically translatable readouts—such as serum biomarkers or non-invasive imaging—limits the bridge to human applications. Future studies should prioritize scalable, cross-species assays to enhance translational potential. Resource availability Lead contact Further information and requests for resources and reagents should be directed to and will be fulfilled by the lead contact, Jiali Li ( jiali.li@hmhn.org Materials availability This study did not generate new unique reagents. Data and code availability  • Single-nucleus RNA-seq data have been deposited in the National Genomics Data Center under the GSA code GSA: CRA018614 ( https://ngdc.cncb.ac.cn/gsa/search?searchTerm=CRA018614 • This paper does not report the original code. • Any additional information required to reanalyze the data reported in this paper is available from the lead contact Acknowledgments We would like to thank the National Research Facility of Phenotypic & Genetic Analysis of Model Animals (Primate Facility) ( http://cstr.cn/31137.02.NPRC 10.13039/501100002855 Ministry of Science and Technology (China) of China 2021ZD0200900 2022YFF0710900 2015CB755605 10.13039/501100001809 National Natural Science Foundation of China 91649119 92049105 82401697 E039030401 202401AT070259 202305AH340006 202305AF150160 CAS Special Research Assistant Project, Academician Expert Workstation of Yunnan Kunming YSZJGZZ-2022063 CAS Light of West China Program xbzg-zdsys-202213 Author contributions J.L., K.X., and Y.Z. provided the conceptual framework for this project and oversaw the execution of the experiments in their entirety. Yu Li, X.H., Z. Hu., and P.Z. performed embryo manipulation. K.X., X.Z., Y.Z., and L.L. performed an MRI scan and analyzed the data. K.X., Y.Z., Z. He., W.J., and Yanyan Li performed behavioral experiments. K.X., Y.Z., and Yifan Li performed molecular and pathological experiments. Y.C., M.Y., and D.-D.W. performed snRNA-seq and analyzed the data. D.J., X.Y., D.-F.Z., K.H., P.Z., and Y.-G.Y. provided technical and resource support in the experiments and financially supported this project. K.X., Y.Z., and J.L. wrote the manuscript. K.X., Y.Z., D.J., K.H., P.Z., Y.-G.Y., D.-D.W., and J. L. contributed to reviewing and editing the manuscript. J.L. supervised the project. Declaration of interests The authors declare no competing interests. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies Anti -CD3 Rabbit pAb Servicebio Cat# GB11014; RRID: AB_3083642 Anti -CD20 Rabbit pAb Servicebio Cat# GB11540 AB_3698721 Anti-DARPP-32 Rabbit mAb Cell Signaling Technology Cat# 2306; RRID: AB_2169007 Anti-ATM antibody Abcam Cat# Ab32420; RRID: AB_725574 Anti-PSD95 antibody Invitrogen Cat# MA1-046 AB_2092361 Anti-Synapsin I antibody Abcam Cat# Ab64581; RRID: AB_1281135 Anti-PARP antibody Cell Signaling Technology Cat# 9542; RRID: AB_2160739 Anti-Aldoc antibody Oasis biofarm Cat# OB-PRT030; RRID: AB_2938960 Anti-Cleaved Caspase-3 Cell Signaling Technology Cat# 9661; RRID: AB_2341188 Anti-Iba1 antibody Wako Cat# 019–19741; RRID: AB_839504 Anti-GFAP antibody Abcam Cat# Ab254083 AB_3698724 Anti-beta Actin antibody Abcam Cat# Ab8226; RRID: AB_306371 Anti-GAPDH antibody [6C5] Abcam Cat# Ab8245; RRID: AB_2107448 Goat anti-mouse lgG (H + L) secondary antibody, HRP Invitrogen Cat# 31430; RRID: AB_228307 Goat anti-Rabbit lgG (H + L) cross-adsorbed secondary antibody, HRP Invitrogen Cat# G-21234; RRID: AB_1500696 Bacterial and virus strains Trelief 5α Chemically Competent Cell TSINGKE Cat# TSC-C01 Chemicals, peptides, and recombinant proteins Recombinant human follitropin alpha (r-hFSH) Merck Serono Cat# AU026521 Recombinant human chorionic gonadotropin alpha (rHCG) Merck Serono Cat# BA054379 TrueCutTM Cas9 Protein v2 Invitrogen Cat# A36496 Etoposide Sigma Cat# E1383 Proteinase K Roche Cat# 15891840 Dulbecco’s Modification of Eagle’s Medium (DMEM) Gibco Cat# 12430054 Dulbecco’s Modified Eagle Medium/Nutrient Mixture F-12 (DMEM/F12) Gibco Cat# 11320033 Fetal Bovine Serum (FBS) Gibco Cat# 10091148 Trypsin-EDTA Gibco Cat# 25200072 GlutaMAX Gibco Cat# 35050061 37% formaldehyde Sigma-Aldrich Cat# F1635 BbsI-HF NEB Cat# R3539M T4 DNA ligase NEB Cat# M0202 T4 DNA polymerase NEB Cat# M0203 Lipofectamine 3000 Thermo Fisher Cat# L3000015 TRIzol reagent Invitrogen Cat# 15596026 PicoPure DNA Extraction Kit Invitrogen Cat# KIT0103 Hematoxylin-eosin (H&E) HD Constant Dye Kit Servicebio Cat# G1076 T-Vector pMD19 TaKaRa Cat# 3271 Ketamine hydrochloride Gutian pharmaceutical Cat# 1505242 Dexmedetomidine HCl Aladdin Cat# D129813 Critical commercial assays Rapid GolgiStain Kit FD NeuroTechnologies Cat# PK401 Annexin V FITC Apoptosis Kit BD Biosciences Cat# 556547 YF®488 TUNEL Acros Organics Cat# T6013S Deposited data Raw data for snRNA-seq This paper GSA: CRA018614 Experimental models: Cell lines COS-7 Conservation Genetics CAS Kunming Cell Bank Cat# KCB 93019YJ Macaque skin fibroblasts This study N/A Experimental models: Organisms/strains Rhesus macaques Kunming Primate Research Center, Chinese Academy of Sciences N/A Oligonucleotides sgRNA1: UUGUUUCAGGAUCUCGAAUC This study N/A sgRNA2: CGGCAUUCAGAUUCCAAACA This study N/A mmATM-exon3 (forward): TGCTGCCGTCAACTAGAACA This study N/A mmATM-exon3 (reverse): TGCCAAATTCATATGCAAGGCA This study N/A Recombinant DNA PX459 Addgene Addgene plasmid # 62988 Software and algorithms ImageJ NIH https://imagej.nih.gov/ij/ GraphPad Prism 9.0 GraphPad Software https://www.graphpad.com/scientific-software/prism/ Adobe Illustrator Adobe https://www.adobe.com/products/illustrator.html MATLAB version 2020a MathWorks https://www.mathworks.com ITK-SNAP Version 3.8.0 Yushkevich et al. 96 http://www.itksnap.org/pmwiki/pmwiki.php Connectome Workbench Version 1.4.2 Marcus et al. 97 https://www.humanconnectome.org/software/connectome-workbench AFNI Version 22.1.10 Cox et al. 98 https://afni.nimh.nih.gov/ Freesurfer Version 3.0 Fischl et al. 99 https://surfer.nmr.mgh.harvard.edu/ R R Core Team https://www.r-project.org/ Python Python Software Foundation https://www.python.org/ Seurat v4.3.0.1 Hao et al. 100 https://satijalab.org/seurat/ DoubletFinder v2.0.3 McGinnis et al. 78 https://github.com/chris-mcginnis-ucsf/DoubletFinder Harmony (v1.2.0) Korsunsky et al. 79 https://github.com/immunogenomics/harmony Gprofiler2 (v0.2.3) Kolberg et al. 80 https://CRAN.R-project.org/package=gprofiler2 CellChat (v1.6.1) Jin et al. 101 https://github.com/sqjin/CellChat Other Nuclear Magnetic Resonance Imaging United Imaging uMR770/3.0 T Automatic blood cell analyzer (veterinary) Mindray BC-5000 Vet Automatic animal 3D gait analysis system Kinema Tracer for Animal Kinema Tracer for Animal Automatic chemiluminescence image analysis system Tanon 5200 X-ray irradiation instrument Xstrahl CIX3 Flow cytometer BD Biosciences LSR Fortessa NanoDrop Life technologies ND-1000 Microscope slide scanner Pannoramic 250 Flash III Laser scanning confocal microscope Olympus FV1000 Experimental model and study participant details Ethical statement All experimental processes in this study comply with the Animal Care and Use Institutional Committee of the Institutional Animal Care and Use Committee of Kunming Institute of Zoology (IACUC20005), Chinese Academy of Sciences (CAS). Animals Throughout the experiment, the rhesus macaque (Macaca mulatta) was housed in a conditioned environment (temperature: 22 ± 1°C, relative humidity: 50% ± 5%) with 12 h light/dark cycle. All animals were given a commercial monkey diet twice a day with tap water and were fed fruits and vegetables once daily. Routine veterinary care was provided by professional keepers and veterinarians during the entire process of experiments. Cells COS-7 cells (African Green Monkey Kidney Cell) were obtained from Conservation Genetics CAS Kunming Cell Bank and were cultured at 37°C with DMEM media (Corning), 10% Fetal Bovine Serum (FBS) (Gibco), and 100 U/mL penicillin-streptomycin (Gibco). Primary fibroblasts were derived from macaque ear skin and were cultured at 37°C with DMEM media (Corning), 10% FBS (Gibco), and 100 U/mL penicillin-streptomycin (Gibco). Method details Preparation of gRNAs The sgRNAs that target the ATM https://www.zlab.bio/resources RNP preparation Guide RNA1 5′- UUGUUUCAGGAUCUCGAAUC CGGCAUUCAGAUUCCAAACA Oocyte collection and in vitro Oocyte collection and fertilization were performed as previously described. 102 2 Genotyping of mutant monkeys To genotype ATM mutation in newborn macaques, a PCR product flanking the desired mutation site was amplified using high-fidelity polymerase from blood and skin genomic DNA of all macaques, using primer forward: 5′-TGCTGCCGTCAACTAGAACA-3′ and reverse: 5′-TGCCTTGCATATGAATTTGGCA-3′. PCR products from individual macaques were TA-cloned into T-vector (Takara). Ligation mixtures were transformed into competent Escherichia coli and plated onto plates with ampicillin selectivity. Individual bacterial colonies were picked up, and plasmid DNA was subjected to Sanger sequencing using M13 primer to examine various types of indels and their percentages. Fibroblast isolation and cell culture The macaque skin obtained from the ear rim was disinfected with 75% ethanol, hair and fat tissue were removed, washed with PBS, and then cut into small pieces and pasted on a Petri dish. Fibroblasts can be grown within a week. All cells were cultured in DMEM high-glucose (Corning) medium containing 10% FBS (Gibco), 1% glutamine (Gibco), and 1% penicillin/streptomycin (Gibco). Culture at 37°C in 5% CO 2 Blood analysis Before feeding in the morning, a professional veterinarian collected fresh whole blood from the monkeys' upper arms. Whole blood was immediately used for routine blood analysis after EDTA anticoagulation, and supernatant was centrifuged for alpha-fetoprotein and immunoassay. Behavior observation and analysis Behavioral observation and analysis were performed by two independent trained observers with at least 80% inter-observer reliability. None of the observers knew the genotype of the macaques. Analysis of locomotive behaviors The monkeys were observed alone in observation cages after weaning. The observation cage is similar to their home cage. 34 Kinematics analyses of bipedal locomotion The bipedal movement of animals was characterized by gait test and footprints. In a nutshell, each group of monkeys ( n 103 Manual dexterity training and testing Monkeys were trained on manual dexterity with a Klüver board, which contains cylindrical wells of five different sizes (10, 10.5, 11, 12, and 13 mm in diameter, 7 mm in depth). 104 ad libitum Wisconsin General Test Apparatus According to the WGTA protocol, 66 MRI data acquisition The brain of rhesus macaques was scanned regularly by a 3.0 T MRI machine (uMR 770, United Imaging Healthcare), and the changes in brain volume were analyzed at the same time. To prevent gastric regurgitation caused by the anesthetic, each animal was fasted for at least 6 h before MRI scanning. The animals in each group ( n Structural image processing For structural image processing, we averaged all the T1 or T2 image of each subject using the ‘AverageImages’ function of software ‘ANTs’ 105 106 96 71 98 Surface reconstruction and geometric analysis The cerebellar outer contour surface were extracted by the cerebellar mask using the ‘mri_tessellate’ and ‘mris_extract_main_component’ methods of Freesurfer, 99 97 107 Functional MRI analysis For the fMRI data, spike artifacts removing, slice-timing correction, head-motion correction were performed using 3dDespike, 3dTshift and 3dvolreg function of AFNI, 98 Analysis of survival rate and apoptosis Primary fibroblasts from macaque skin were plated in 6-multiwell plates different densities and treated after 48 h with increasing doses of irradiation. After 5 days, cells were fixed and stained with crystal violet for cell counting. Apoptosis was identified by using FITC Annexin V Apoptosis Detection Kit I (BD). Fibroblasts were plated in 6-multiwell plates and treated after 48 h with the indicated treatments. After 12 h, cells were incubated as described by the manufacturers. Briefly, cells were rinsed three times in 1× PBS and then incubated in 1× PBS supplemented with Annexin V-FITC and PI for 30 min at room temperature. FACS analysis for each sample was carried out on an LSR Fortessa flow cytometer (BD Biosciences). Up to 30,000 cells were analyzed for each condition, and data analysis was performed using FlowJo software. Tissue collection Following a 24-month postnatal observation, a pair of sex- and age-matched macaques were anesthetized, and subsequently, a saline solution was perfused systematically through heart. The tissues from different systems were then collected. Fresh tissues were sampled and stored in freezing tubes in liquid nitrogen. The remaining tissues were fixed with 4% paraformaldehyde, embedded in OTC (Leica) and cryopreserved in −80°C freezers. Immunohistochemical and fluorescent staining Animals were deeply anesthetized with dexmedetomidine (0.05 mg/kg, i.m.) and perfused with PBS (0.1 M). For immunohistochemical analysis, the brain tissue was sectioned in paraffin slicer (Leica, HistoCore BIOCUT) at a thickness of 10 microns. Immunohistochemical staining and hematoxylin-eosin (HE) staining were performed. Digital images taken using a slide scanner (Pannoramic, 250 Flash III). Immunohistochemical sections were washed three times with 0.01 M phosphate buffered saline (PBS, pH 7.4) and incubated with primary antibody at 4°C overnight. After incubation of the primary antibody, the corresponding secondary antibody incubated slices were left in the dark at room temperature for 3 h. Sections were covered with a lid containing DAPI (Abcam) and scanned under a fluorescence microscope (Leica TCS SP8). The staining results were analyzed using the ImageJ software. Western blotting Tissues were homogenized in RIPA buffer (containing 50 mM Tris-HCl, pH 7.4, 150 mM NaCl, 1% Triton X-100, 0.1% SDS, 1% sodium deoxycholate, protease inhibitor cocktail and phosphatase inhibitor cocktail) on ice and then centrifuged at 1,000 g for 10 min at 4°C. The supernatant was stored at −80°C until use. Protein concentration was measured with BCA method. Approximately 30 μg protein of each sample was loaded in on 10% SDS–PAGE and run at 120 V constant voltage. A constant current of 0.36 mA was used for transblotting. Blots were probed with primary antibodies overnight at 4°C. After washing three times, blots were then incubated with secondary antibody at room temperature for 2 h. Chemiluminescence was used to visualize protein bands. In situ To measure damaged DNA in macaque cerebellum, a terminal deoxynucleotidyl transferase-mediated-dUTP nick-end labeling (TUNEL) staining was used following the manufacturers protocol. As a positive C1, brain slides were treated with DNase to induce DNA damage. Images were obtained by fluorescence microscopy. Golgi stain Tissue preparation and tissue staining were performed according to the manufacturer’s instructions, using the FD Rapid GolgiStain kit (FD NeuroTechnologies, Inc.; PK401 Cell Systems Biology). 72 Transmission electron microscopy method The samples were fixed overnight at 4°C using 2.5% glutaraldehyde in 0.1 M PBS (PH7.2), then washed with 0.1M PBS (PH7.2) three times for 7 min. Afterward, samples were postfixed with 1% OsO 4 2 Nuclei isolation The collected tissues were washed by 1× PBS, then quickly frozen and stored in liquid nitrogen. Nuclei extraction was separated by mechanical extraction method. 108 Single-nucleus RNA library construction and sequencing DNBelab C Series High-throughput Single-Cell RNA Library (MGI) was utilized for snRNA-seq library preparation. In brief, the single-nucleus suspensions were converted to barcoded snRNA-seq libraries through steps including droplet encapsulation, emulsion breakage, mRNA captured beads collection, reverse transcription, cDNA amplification, and purification. cDNA production was sheared to short fragments with 250–400 bp, and indexed sequencing libraries were constructed according to the manufacturer’s protocol. Qualification was performed using Qubit ssDNA Assay Kit (Thermo Fisher Scientific) and Agilent Bioanalyzer 2100. All libraries were further sequenced by the DNBSEQ-T7(MGI) sequencing platform with pair-end sequencing. The sequencing reads contained 30-bp read 1 (including the 10-bp cell barcode 1, 10-bp cell barcode 2, and 10-bp UMIs (UMI)), 100-bp read 2 for gene sequences and 10-bp barcodes read for sample index. Single-cell sequencing data processing We used the DNBC4tools, which is a Python package for DNBelab Series Single-Cell analysis workflow to process the sequencing reads of single-cell transcriptomics and align to rhesus macaque reference genome (Mmul_10), resulting in a preliminarily filtered gene-by-cell expression matrix. The output was processed using Seurat v4.3.0.1. 100 Figure S7 78 Table S1 Figure S1 102 Figure 7 Figure 7 81 , 109 Genes were differentially expressed between A1 and C1 were defined for each cluster using the FindMarkers function of Seurat. And we performed GO enrichment analysis based on DEGs using enrich GO function of clusterProfiler (v4.6.0) package. 41 80 104 Quantification and statistical analysis For cellular and animal experiments, statistical parameters including statistical analysis and statistical significance reported in the figure legends and supplementary figure legends were determined by two-tailed Student’s t test. GraphPad Prism 9 was used to perform the bar graphs or line graphs. MRI analyses and visualizations were performed in MATLAB version 2020a (MathWorks), ITK-SNAP Version 3.8.0, Connectome Workbench Version 1.4.2, AFNI Version 22.1.10, and Freesurfer Version 3.0. Bioinformatic quantitative and statistical analyses of snRNA-seq data were performed using the R and python computational environment and packages. More details can be found in the relevant sections of the method details. Additional resources This study did not generate any additional resources. References 1 Boder E. Ataxia-telangiectasia: some historic, clinical and pathologic observations Birth Defects Orig. Artic. Ser. 11 1975 255 270 1096982 2 Swift M. Morrell D. Massey R.B. Chase C.L. Incidence of cancer in 161 families affected by ataxia-telangiectasia N. Engl. J. Med. 325 1991 1831 1836 1961222 10.1056/NEJM199112263252602 3 Ambrose M. Gatti R.A. Pathogenesis of ataxia-telangiectasia: the next generation of ATM functions Blood 121 2013 4036 4045 23440242 10.1182/blood-2012-09-456897 PMC3709651 4 McKinnon P.J. ATM and the molecular pathogenesis of ataxia telangiectasia Annu. Rev. Pathol. 7 2012 303 321 22035194 10.1146/annurev-pathol-011811-132509 5 Sedgwick R.P. Boder E. Progressive ataxia in childhood with particular reference to ataxia-telangiectasia Neurology 10 1960 705 715 14444443 10.1212/wnl.10.7.705 6 Lavin M.F. Ataxia-telangiectasia: from a rare disorder to a paradigm for cell signalling and cancer Nat. Rev. Mol. Cell Biol. 9 2008 759 769 18813293 10.1038/nrm2514 7 Amirifar P. Ranjouri M.R. Lavin M. Abolhassani H. Yazdani R. Aghamohammadi A. Ataxia-telangiectasia: epidemiology, pathogenesis, clinical phenotype, diagnosis, prognosis and management Expert Rev. Clin. Immunol. 16 2020 859 871 32791865 10.1080/1744666X.2020.1810570 8 Dineen R.A. Whitehouse W.P. Ataxia Telangiectasia Gruol D.L. Koibuchi N. Manto M. Molinari M. Schmahmann J.D. Shen Y. Essentials of Cerebellum and Cerebellar Disorders: A Primer For Graduate Students 2023 Springer International Publishing 621 630 9 Lee J.H. Paull T.T. Cellular functions of the protein kinase ATM and their relevance to human disease Nat. Rev. Mol. Cell Biol. 22 2021 796 814 34429537 10.1038/s41580-021-00394-2 10 Savitsky K. Bar-Shira A. Gilad S. Rotman G. Ziv Y. Vanagaite L. Tagle D.A. Smith S. Uziel T. Sfez S. A single ataxia telangiectasia gene with a product similar to PI-3 kinase Science 268 1995 1749 1753 7792600 10.1126/science.7792600 11 Lavin M.F. Shiloh Y. The genetic defect in ataxia-telangiectasia Annu. Rev. Immunol. 15 1997 177 202 9143686 10.1146/annurev.immunol.15.1.177 12 Marechal A. Zou L. DNA damage sensing by the ATM and ATR kinases Cold Spring Harb Perspect Biol 5 2013 a012716 10.1101/cshperspect.a012716 PMC3753707 24003211 13 Matsuoka S. Ballif B.A. Smogorzewska A. McDonald E.R. 3rd Hurov K.E. Luo J. Bakalarski C.E. Zhao Z. Solimini N. Lerenthal Y. ATM and ATR substrate analysis reveals extensive protein networks responsive to DNA damage Science 316 2007 1160 1166 17525332 10.1126/science.1140321 14 Paull T.T. Mechanisms of ATM Activation Annu. Rev. Biochem. 84 2015 711 738 25580527 10.1146/annurev-biochem-060614-034335 15 Zhang J. Tripathi D.N. Jing J. Alexander A. Kim J. Powell R.T. Dere R. Tait-Mulder J. Lee J.H. Paull T.T. ATM functions at the peroxisome to induce pexophagy in response to ROS Nat. Cell Biol. 17 2015 1259 1269 26344566 10.1038/ncb3230 PMC4589490 16 Guo Z. Kozlov S. Lavin M.F. Person M.D. Paull T.T. ATM activation by oxidative stress Science 330 2010 517 521 10.1126/science.1192912 20966255 17 Jiang D. Zhang Y. Hart R.P. Chen J. Herrup K. Li J. Alteration in 5-hydroxymethylcytosine-mediated epigenetic regulation leads to Purkinje cell vulnerability in ATM deficiency Brain 138 2015 3520 3536 26510954 10.1093/brain/awv284 PMC4668921 18 Li J. Chen J. Ricupero C.L. Hart R.P. Schwartz M.S. Kusnecov A. Herrup K. Nuclear accumulation of HDAC4 in ATM deficiency promotes neurodegeneration in ataxia telangiectasia Nat. Med. 18 2012 783 790 22466704 10.1038/nm.2709 PMC3378917 19 Li J. Hart R.P. Mallimo E.M. Swerdel M.R. Kusnecov A.W. Herrup K. EZH2-mediated H3K27 trimethylation mediates neurodegeneration in ataxia-telangiectasia Nat. Neurosci. 16 2013 1745 1753 24162653 10.1038/nn.3564 PMC3965909 20 Lee J.H. Oxidative stress and the multifaceted roles of ATM in maintaining cellular redox homeostasis Redox Biol. 75 2024 103269 10.1016/j.redox.2024.103269 PMC11301354 39018798 21 Shiloh Y. ATM and related protein kinases: safeguarding genome integrity Nat. Rev. Cancer 3 2003 155 168 12612651 10.1038/nrc1011 22 Cheng A. Tse K.H. Chow H.M. Gan Y. Song X. Ma F. Qian Y.X.Y. She W. Herrup K. ATM loss disrupts the autophagy-lysosomal pathway Autophagy 17 2021 1998 2010 32757690 10.1080/15548627.2020.1805860 PMC8386711 23 Chow H.M. Shi M. Cheng A. Gao Y. Chen G. Song X. So R.W.L. Zhang J. Herrup K. Age-related hyperinsulinemia leads to insulin resistance in neurons and cell-cycle-induced senescence Nat. Neurosci. 22 2019 1806 1819 31636448 10.1038/s41593-019-0505-1 24 Aguado J. Gómez-Inclán C. Leeson H.C. Lavin M.F. Shiloh Y. Wolvetang E.J. The hallmarks of aging in Ataxia-Telangiectasia Ageing Res. Rev. 79 2022 101653 10.1016/j.arr.2022.101653 35644374 25 Kuhn K. Lederman H.M. McGrath-Morrow S.A. Ataxia-telangiectasia clinical trial landscape and the obstacles to overcome Expert Opin. Investig. Drugs 32 2023 693 704 10.1080/13543784.2023.2249399 PMC10530584 37622329 26 Zielen S. Crawford T. Benatti L. Magnani M. Kieslich M. Ryan M. Meyts I. Gulati S. Borgohain R. Yadav R. Safety and efficacy of intra-erythrocyte dexamethasone sodium phosphate in children with ataxia telangiectasia (ATTeST): a multicentre, randomised, double-blind, placebo-controlled phase 3 trial Lancet Neurol. 23 2024 871 882 39152028 10.1016/S1474-4422(24)00220-5 27 Lavin M.F. The appropriateness of the mouse model for ataxia-telangiectasia: neurological defects but no neurodegeneration DNA Repair 12 2013 612 619 23731731 10.1016/j.dnarep.2013.04.014 28 Tal E. Alfo M. Zha S. Barzilai A. De Zeeuw C.I. Ziv Y. Shiloh Y. Inactive Atm abrogates DSB repair in mouse cerebellum more than does Atm loss, without causing a neurological phenotype DNA Repair 72 2018 10 17 30348496 10.1016/j.dnarep.2018.10.001 PMC7985968 29 Barlow C. Hirotsune S. Paylor R. Liyanage M. Eckhaus M. Collins F. Shiloh Y. Crawley J.N. Ried T. Tagle D. Wynshaw-Boris A. Atm-deficient mice: a paradigm of ataxia telangiectasia Cell 86 1996 159 171 8689683 10.1016/s0092-8674(00)80086-0 30 Campbell A. Krupp B. Bushman J. Noble M. Pröschel C. Mayer-Pröschel M. A novel mouse model for ataxia-telangiectasia with a N-terminal mutation displays a behavioral defect and a low incidence of lymphoma but no increased oxidative burden Hum. Mol. Genet. 24 2015 6331 6349 26310626 10.1093/hmg/ddv342 PMC5007607 31 Perez H. Abdallah M.F. Chavira J.I. Norris A.S. Egeland M.T. Vo K.L. Buechsenschuetz C.L. Sanghez V. Kim J.L. Pind M. A novel, ataxic mouse model of ataxia telangiectasia caused by a clinically relevant nonsense mutation eLife 10 2021 e64695 10.7554/eLife.64695 PMC8601662 34723800 32 Zhou Y. Sharma J. Ke Q. Landman R. Yuan J. Chen H. Hayden D.S. Fisher J.W. Jiang M. Menegas W. Atypical behaviour and connectivity in SHANK3-mutant macaques Nature 570 2019 326 331 31189958 10.1038/s41586-019-1278-0 33 Pan M.T. Zhang H. Li X.J. Guo X.Y. Genetically modified non-human primate models for research on neurodegenerative diseases Zool. Res. 45 2024 263 274 38287907 10.24272/j.issn.2095-8137.2023.197 PMC11017080 34 Liu Z. Li X. Zhang J.-T. Cai Y.-J. Cheng T.-L. Cheng C. Wang Y. Zhang C.-C. Nie Y.-H. Chen Z.-F. Autism-like behaviours and germline transmission in transgenic monkeys overexpressing MeCP2 Nature 530 2016 98 102 26808898 10.1038/nature16533 35 Liu X. d'Oleire Uquillas F. Viaene A.N. Zhen Z. Gomez J. A multifaceted gradient in human cerebellum of structural and functional development Nat. Neurosci. 25 2022 1129 1133 35982153 10.1038/s41593-022-01136-z 36 Kebschull J.M. Richman E.B. Ringach N. Friedmann D. Albarran E. Kolluru S.S. Jones R.C. Allen W.E. Wang Y. Cho S.W. Cerebellar nuclei evolved by repeatedly duplicating a conserved cell-type set Science 370 2020 eabd5059 10.1126/science.abd5059 PMC8510508 33335034 37 Zhu X. Yan H. Zhan Y. Feng F. Wei C. Yao Y.G. Liu C. An anatomical and connectivity atlas of the marmoset cerebellum Cell Rep. 42 2023 112480 10.1016/j.celrep.2023.112480 37163375 38 Hao S. Zhu X. Huang Z. Yang Q. Liu H. Wu Y. Zhan Y. Dong Y. Li C. Wang H. Cross-species single-cell spatial transcriptomic atlases of the cerebellar cortex Science 385 2024 eado3927 10.1126/science.ado3927 39325889 39 Aldinger K.A. Thomson Z. Phelps I.G. Haldipur P. Deng M. Timms A.E. Hirano M. Santpere G. Roco C. Rosenberg A.B. Spatial and cell type transcriptional landscape of human cerebellar development Nat. Neurosci. 24 2021 1163 1175 34140698 10.1038/s41593-021-00872-y PMC8338761 40 De Zeeuw C.I. Lisberger S.G. Raymond J.L. Diversity and dynamism in the cerebellum Nat. Neurosci. 24 2021 160 167 33288911 10.1038/s41593-020-00754-9 41 Wu T. Hu E. Xu S. Chen M. Guo P. Dai Z. Feng T. Zhou L. Tang W. Zhan L. clusterProfiler 4.0: A universal enrichment tool for interpreting omics data Innovation 2 2021 100141 10.1016/j.xinn.2021.100141 PMC8454663 34557778 42 Chen X. Du Y. Broussard G.J. Kislin M. Yuede C.M. Zhang S. Dietmann S. Gabel H. Zhao G. Wang S.S.H. Transcriptomic mapping uncovers Purkinje neuron plasticity driving learning Nature 605 2022 722 727 35545673 10.1038/s41586-022-04711-3 PMC9887520 43 Chen Z. Zhang R. Huo H. Liu P. Zhang C. Feng T. Functional connectome of human cerebellum Neuroimage 251 2022 119015 10.1016/j.neuroimage.2022.119015 35189360 44 Dunbar D.C. Badam G.L. Development of posture and locomotion in free-ranging primates Neurosci. Biobehav. Rev. 22 1998 541 546 9595567 10.1016/s0149-7634(97)00042-0 45 Hinde K. Richer milk for sons but more milk for daughters: Sex-biased investment during lactation varies with maternal life history in rhesus macaques Am. J. Hum. Biol. 21 2009 512 519 19384860 10.1002/ajhb.20917 46 Golub M.S. Keen C.L. Gershwin M.E. Styne D.M. Takeuchi P.T. Ontell F. Walter R.M. Hendrickx A.G. Adolescent growth and maturation in zinc-deprived rhesus monkeys Am. J. Clin. Nutr. 64 1996 274 282 [see comment] 8780334 10.1093/ajcn/64.3.274 47 Colman R.J. Anderson R.M. Johnson S.C. Kastman E.K. Kosmatka K.J. Beasley T.M. Allison D.B. Cruzen C. Simmons H.A. Kemnitz J.W. Weindruch R. Caloric restriction delays disease onset and mortality in rhesus monkeys Science 325 2009 201 204 19590001 10.1126/science.1173635 PMC2812811 48 Huber H.F. Ainsworth H.C. Quillen E.E. Salmon A. Ross C. Azhar A.D. Bales K. Basso M.A. Coleman K. Colman R. Comparative lifespan and healthspan of nonhuman primate species common to biomedical research Geroscience 47 2025 135 151 39585646 10.1007/s11357-024-01421-8 PMC11872815 49 Feng G. Jensen F.E. Greely H.T. Okano H. Treue S. Roberts A.C. Fox J.G. Caddick S. Poo M.M. Newsome W.T. Morrison J.H. Opportunities and limitations of genetically modified nonhuman primate models for neuroscience research Proc. Natl. Acad. Sci. USA 117 2020 24022 24031 32817435 10.1073/pnas.2006515117 PMC7533691 50 Schmidt J.K. Jones K.M. Van Vleck T. Emborg M.E. Modeling genetic diseases in nonhuman primates through embryonic and germline modification: Considerations and challenges Sci. Transl. Med. 14 2022 eabf4879 10.1126/scitranslmed.abf4879 PMC9373237 35235338 51 Chen Y. Zheng Y. Kang Y. Yang W. Niu Y. Guo X. Tu Z. Si C. Wang H. Xing R. Functional disruption of the dystrophin gene in rhesus monkey using CRISPR/Cas9 Hum. Mol. Genet. 24 2015 3764 3774 25859012 10.1093/hmg/ddv120 PMC5007610 52 Ren S. Fu X. Guo W. Bai R. Li S. Zhang T. Liu J. Wang Z. Zhao H. Suo S. Profound cellular defects attribute to muscular pathogenesis in the rhesus monkey model of Duchenne muscular dystrophy Cell 187 2024 6669 6686 39305903 10.1016/j.cell.2024.08.041 53 Li M. Guan M. Lin J. Zhu K. Zhu J. Guo M. Li Y. Chen Y. Chen Y. Zou Y. Early blood immune molecular alterations in cynomolgus monkeys with a PSEN1 mutation causing familial Alzheimer's disease Alzheimer's Dement. 20 2024 5492 5510 38973166 10.1002/alz.14046 PMC11350033 54 Zhang W.H. Zhuang J.H. Guo Y.Y. Chen X.Y. Li Y.Q. Xu J.Q. Zhang A.R. Chen B.Y. Meng W. Zhu Y.H. Pancreatic agenesis and altered m6A methylation in the pancreas of PDX1-mutant cynomolgus macaques Zool. Res. 45 2024 1188 1200 39318126 10.24272/j.issn.2095-8137.2024.044 PMC11668947 55 Bae S. Park J. Kim J.S. Cas-OFFinder: a fast and versatile algorithm that searches for potential off-target sites of Cas9 RNA-guided endonucleases Bioinformatics 30 2014 1473 1475 24463181 10.1093/bioinformatics/btu048 PMC4016707 56 Renaud M. Tranchant C. Koenig M. Anheim M. Autosomal Recessive Cerebellar Ataxias With Elevated Alpha-Fetoprotein: Uncommon Diseases, Common Biomarker Mov. Disord. 35 2020 2139 2149 33044027 10.1002/mds.28307 57 Hoch N.C. Hanzlikova H. Rulten S.L. Tétreault M. Komulainen E. Ju L. Hornyak P. Zeng Z. Gittens W. Rey S.A. XRCC1 mutation is associated with PARP1 hyperactivation and cerebellar ataxia Nature 541 2017 87 91 28002403 10.1038/nature20790 PMC5218588 58 van Os N.J.H. Jansen A.F.M. van Deuren M. Haraldsson A. van Driel N.T.M. Etzioni A. van der Flier M. Haaxma C.A. Morio T. Rawat A. Ataxia-telangiectasia: Immunodeficiency and survival Clin. Immunol. 178 2017 45 55 28126470 10.1016/j.clim.2017.01.009 59 Graafen L. Heinze A. Albinger N. Salzmann-Manrique E. Ganß F. Hünecke S. Cappel C. Wölke S. Donath H. Trischler J. Immune profiling and functional analysis of NK and T cells in ataxia telangiectasia Front. Immunol. 15 2024 1377955 10.3389/fimmu.2024.1377955 PMC11333214 39165363 60 Zielen S. Duecker R.P. Woelke S. Donath H. Bakhtiar S. Buecker A. Kreyenberg H. Huenecke S. Bader P. Mahlaoui N. Simple Measurement of IgA Predicts Immunity and Mortality in Ataxia-Telangiectasia J. Clin. Immunol. 41 2021 1878 1892 34477998 10.1007/s10875-021-01090-8 PMC8604875 61 Takada S. Weitering T.J. van Os N.J.H. Du L. Pico-Knijnenburg I. Kuipers T.B. Mei H. Salzer E. Willemsen M.A.A.P. Weemaes C.M.R. Causative mechanisms and clinical impact of immunoglobulin deficiencies in ataxia telangiectasia J. Allergy Clin. Immunol. 153 2024 1392 1405 38280573 10.1016/j.jaci.2023.12.029 62 Levy A. Lang A.E. Ataxia-telangiectasia: A review of movement disorders, clinical features, and genotype correlations Mov. Disord. 33 2018 1238 1247 29436738 10.1002/mds.27319 63 Schon K. van Os N.J.H. Oscroft N. Baxendale H. Scoffings D. Ray J. Suri M. Whitehouse W.P. Mehta P.R. Everett N. Genotype, extrapyramidal features, and severity of variant ataxia-telangiectasia Ann. Neurol. 85 2019 170 180 30549301 10.1002/ana.25394 PMC6590299 64 Rao J.S. Zhao C. Zhang A. Duan H. Hao P. Wei R.H. Shang J. Zhao W. Liu Z. Yu J. NT3-chitosan enables de novo regeneration and functional recovery in monkeys after spinal cord injury Proc. Natl. Acad. Sci. USA 115 2018 E5595 E5604 29844162 10.1073/pnas.1804735115 PMC6004491 65 Shi L. Luo X. Jiang J. Chen Y. Liu C. Hu T. Li M. Lin Q. Li Y. Huang J. Transgenic rhesus monkeys carrying the human MCPH1 gene copies show human-like neoteny of brain development Natl. Sci. Rev. 6 2019 480 493 34691896 10.1093/nsr/nwz043 PMC8291473 66 Funahashi S. Functions of delay-period activity in the prefrontal cortex and mnemonic scotomas revisited Front. Syst. Neurosci. 9 2015 2 25698942 10.3389/fnsys.2015.00002 PMC4318271 67 Carlen M. What constitutes the prefrontal cortex? Science 358 2017 478 482 29074767 10.1126/science.aan8868 68 Liu Z. Li X. Zhang J.T. Cai Y.J. Cheng T.L. Cheng C. Wang Y. Zhang C.C. Nie Y.H. Chen Z.F. Autism-like behaviours and germline transmission in transgenic monkeys overexpressing MeCP2 Nature 530 2016 98 102 26808898 10.1038/nature16533 69 Nakagami A. Yasue M. Nakagaki K. Nakamura M. Kawai N. Ichinohe N. Reduced childhood social attention in autism model marmosets predicts impaired social skills and inflexible behavior in adulthood Front. Psychiatry 13 2022 885433 10.3389/fpsyt.2022.885433 PMC9357878 35958665 70 Dineen R.A. Raschke F. McGlashan H.L. Pszczolkowski S. Hack L. Cooper A.D. Prasad M. Chow G. Whitehouse W.P. Auer D.P. Multiparametric cerebellar imaging and clinical phenotype in childhood ataxia telangiectasia Neuroimage. Clin. 25 2020 102110 10.1016/j.nicl.2019.102110 PMC6926372 31855653 71 Paxinos G. Huang X.F. Toga A.W. The Rhesus Monkey Brain in Stereotaxic Coordinates 2000 Academic Press 72 Dudink I. White T.A. Ardalan M. Mallard C. Ballerin G. Creed S.J. Pham Y. Sutherland A.E. Castillo-Melendez M. Allison B.J. Miller S.L. An Optimized and Detailed Step-by-Step Protocol for the Analysis of Neuronal Morphology in Golgi-Stained Fetal Sheep Brain Dev. Neurosci. 44 2022 344 362 35447627 10.1159/000524055 73 Ouimet C.C. LaMantia A.S. Goldman-Rakic P. Rakic P. Greengard P. Immunocytochemical localization of DARPP-32, a dopamine and cyclic-AMP-regulated phosphoprotein, in the primate brain J. Comp. Neurol. 323 1992 209 218 1328330 10.1002/cne.903230206 74 Cutando L. Puighermanal E. Castell L. Tarot P. Belle M. Bertaso F. Arango-Lievano M. Ango F. Rubinstein M. Quintana A. Cerebellar dopamine D2 receptors regulate social behaviors Nat. Neurosci. 25 2022 900 911 35710984 10.1038/s41593-022-01092-8 75 Hawkes R. Herrup K. Aldolase C/zebrin II and the regionalization of the cerebellum J. Mol. Neurosci. 6 1995 147 158 8672398 10.1007/BF02736761 76 Lee J.H. Paull T.T. Mitochondria at the crossroads of ATM-mediated stress signaling and regulation of reactive oxygen species Redox Biol. 32 2020 101511 10.1016/j.redox.2020.101511 PMC7115119 32244177 77 Ibrahim M. Butt A.M. Berry M. Relationship between myelin sheath diameter and internodal length in axons of the anterior medullary velum of the adult rat J. Neurol. Sci. 133 1995 119 127 8583214 10.1016/0022-510x(95)00174-z 78 McGinnis C.S. Murrow L.M. Gartner Z.J. DoubletFinder: Doublet Detection in Single-Cell RNA Sequencing Data Using Artificial Nearest Neighbors Cell Syst. 8 2019 329 337 30954475 10.1016/j.cels.2019.03.003 PMC6853612 79 Korsunsky I. Millard N. Fan J. Slowikowski K. Zhang F. Wei K. Baglaenko Y. Brenner M. Loh P.R. Raychaudhuri S. Fast, sensitive and accurate integration of single-cell data with Harmony Nat. Methods 16 2019 1289 1296 31740819 10.1038/s41592-019-0619-0 PMC6884693 80 Kolberg L. Raudvere U. Kuzmin I. Vilo J. Peterson H. gprofiler2 -- an R package for gene list functional enrichment analysis and namespace conversion toolset g:Profiler F1000Res. 9 2020 ELIXIR-709 10.12688/f1000research.24956.1 PMC7859841 33564394 81 Kozareva V. Martin C. Osorno T. Rudolph S. Guo C. Vanderburg C. Nadaf N. Regev A. Regehr W.G. Macosko E. A transcriptomic atlas of mouse cerebellar cortex comprehensively defines cell types Nature 598 2021 214 219 34616064 10.1038/s41586-021-03220-z PMC8494635 82 Blackford A.N. Jackson S.P. ATM, ATR, and DNA-PK: The Trinity at the Heart of the DNA Damage Response Mol. Cell 66 2017 801 817 28622525 10.1016/j.molcel.2017.05.015 83 Prasad A. Kanakkanthara A. An ATM D-compartmentalization in DNA damage response Trends Cell Biol. 34 2024 173 175 38160123 10.1016/j.tcb.2023.12.003 PMC10939911 84 Cuella-Martin R. Hayward S.B. Fan X. Chen X. Huang J.W. Taglialatela A. Leuzzi G. Zhao J. Rabadan R. Lu C. Functional interrogation of DNA damage response variants with base editing screens Cell 184 2021 1081 1097 33606978 10.1016/j.cell.2021.01.041 PMC8018281 85 Jiang M. Jia K. Wang L. Li W. Chen B. Liu Y. Wang H. Zhao S. He Y. Zhou C. Alterations of DNA damage response pathway: Biomarker and therapeutic strategy for cancer immunotherapy Acta Pharm. Sin. B 11 2021 2983 2994 34729299 10.1016/j.apsb.2021.01.003 PMC8546664 86 Wang Y. Qin J. MSH2 and ATR form a signaling module and regulate two branches of the damage response to DNA methylation Proc. Natl. Acad. Sci. USA 100 2003 15387 15392 14657349 10.1073/pnas.2536810100 PMC307577 87 Lou Z. Minter-Dykhouse K. Wu X. Chen J. MDC1 is coupled to activated CHK2 in mammalian DNA damage response pathways Nature 421 2003 957 961 12607004 10.1038/nature01447 88 Gupta R. Somyajit K. Narita T. Maskey E. Stanlie A. Kremer M. Typas D. Lammers M. Mailand N. Nussenzweig A. DNA Repair Network Analysis Reveals Shieldin as a Key Regulator of NHEJ and PARP Inhibitor Sensitivity Cell 173 2018 972 988 29656893 10.1016/j.cell.2018.03.050 PMC8108093 89 Karakostis K. Malbert-Colas L. Thermou A. Vojtesek B. Fåhraeus R. The DNA damage sensor ATM kinase interacts with the p53 mRNA and guides the DNA damage response pathway Mol. Cancer 23 2024 21 38263180 10.1186/s12943-024-01933-z PMC10804554 90 Bundey S. Clinical and genetic features of ataxia-telangiectasia Int. J. Radiat. Biol. 66 1994 S23 S29 7836849 91 van Os N.J.H. Hensiek A. van Gaalen J. Taylor A.M.R. van Deuren M. Weemaes C.M.R. Willemsen M.A.A.P. van de Warrenburg B.P.C. Trajectories of motor abnormalities in milder phenotypes of ataxia telangiectasia Neurology 92 2019 e19 e29 30504431 10.1212/WNL.0000000000006700 92 Phillips K.A. Bales K.L. Capitanio J.P. Conley A. Czoty P.W. t Hart B.A. Hopkins W.D. Hu S.L. Miller L.A. Nader M.A. Why primate models matter Am. J. Primatol. 76 2014 801 827 24723482 10.1002/ajp.22281 PMC4145602 93 Tarantal A.F. Noctor S.C. Hartigan-O'Connor D.J. Nonhuman Primates in Translational Research Annu. Rev. Anim. Biosci. 10 2022 441 468 35167321 10.1146/annurev-animal-021419-083813 PMC9339229 94 Yang Y. Lu X. Liu N. Ma S. Zhang H. Zhang Z. Yang K. Jiang M. Zheng Z. Qiao Y. Metformin decelerates aging clock in male monkeys Cell 187 2024 6358 6378 39270656 10.1016/j.cell.2024.08.021 95 Li H. Su L.Y. Yang L. Li M. Liu Q. Li Z. Hu Y. Li H. Wu S. Wang W. A cynomolgus monkey with naturally occurring Parkinson's disease Natl. Sci. Rev. 8 2021 nwaa292 10.1093/nsr/nwaa292 PMC8288342 34691601 96 Yushkevich P.A. Piven J. Hazlett H.C. Smith R.G. Ho S. Gee J.C. Gerig G. User-guided 3D active contour segmentation of anatomical structures: Significantly improved efficiency and reliability Neuroimage 31 2006 1116 1128 16545965 10.1016/j.neuroimage.2006.01.015 97 Marcus D.S. Harwell J. Olsen T. Hodge M. Glasser M.F. Prior F. Jenkinson M. Laumann T. Curtiss S.W. Van Essen D.C. Informatics and data mining tools and strategies for the human connectome project Front. Neuroinform. 5 2011 4 21743807 10.3389/fninf.2011.00004 PMC3127103 98 Cox R.W. AFNI: What a long strange trip it's been Neuroimage 62 2012 743 747 21889996 10.1016/j.neuroimage.2011.08.056 PMC3246532 99 Fischl B. FreeSurfer Neuroimage 62 2012 774 781 22248573 10.1016/j.neuroimage.2012.01.021 PMC3685476 100 Hao Y. Stuart T. Kowalski M.H. Choudhary S. Hoffman P. Hartman A. Srivastava A. Molla G. Madad S. Fernandez-Granda C. Satija R. Dictionary learning for integrative, multimodal and scalable single-cell analysis Nat. Biotechnol. 42 2024 293 304 37231261 10.1038/s41587-023-01767-y PMC10928517 101 Jin S. Guerrero-Juarez C.F. Zhang L. Chang I. Ramos R. Kuan C.H. Myung P. Plikus M.V. Nie Q. Inference and analysis of cell-cell communication using CellChat Nat. Commun. 12 2021 1088 33597522 10.1038/s41467-021-21246-9 PMC7889871 102 Qin D.D. Zhou J.K. He X.C. Shen X.Y. Li C. Chen H.Z. Yan L.Z. Hu Z.F. Li X. Lv L.B. Depletion of giant ANK2 in monkeys causes drastic brain volume loss Cell Discov. 7 2021 113 34845196 10.1038/s41421-021-00336-4 PMC8629971 103 Rao J.-S. Zhao C. Zhang A. Duan H. Hao P. Wei R.-H. Shang J. Zhao W. Liu Z. Yu J. NT3-chitosan enables de novo regeneration and functional recovery in monkeys after spinal cord injury Proc. Natl. Acad. Sci. USA 115 2018 E5595 E5604 29844162 10.1073/pnas.1804735115 PMC6004491 104 Sugiyama Y. Higo N. Yoshino-Saito K. Murata Y. Nishimura Y. Oishi T. Isa T. Effects of early versus late rehabilitative training on manual dexterity after corticospinal tract lesion in macaque monkeys J. Neurophysiol. 109 2013 2853 2865 23515793 10.1152/jn.00814.2012 105 Tustison N. Avants B. Cook P. Kim J. Whyte J. Gee J. Ahlers S. Stone J. Multivariate Analysis of Diffusion Tensor Imaging and Cortical Thickness Maps in a Traumatic Brain Injury (Tbi) Cohort Using Advanced Normalization Tools (Ants) J Neurotraum 28 2011 A111 106 Yu Z. Han X. Xu W. Zhang J. Marr C. Shen D. Peng T. Zhang X.Y. Feng J. A generalizable brain extraction net (BEN) for multimodal MRI data from rodents, nonhuman primates, and humans eLife 11 2022 e81217 10.7554/eLife.81217 PMC9937657 36546674 107 Pang J.C. Aquino K.M. Oldehinkel M. Robinson P.A. Fulcher B.D. Breakspear M. Fornito A. Geometric constraints on human brain function Nature 618 2023 566 574 37258669 10.1038/s41586-023-06098-1 PMC10266981 108 Chen A. Sun Y. Lei Y. Li C. Liao S. Meng J. Bai Y. Liu Z. Liang Z. Zhu Z. Single-cell spatial transcriptome reveals cell-type organization in the macaque cortex Cell 186 2023 3726 3743 37442136 10.1016/j.cell.2023.06.009 109 Ament S.A. Cortes-Gutierrez M. Herb B.R. Mocci E. Colantuoni C. McCarthy M.M. A single-cell genomic atlas for maturation of the human cerebellum during early childhood Sci. Transl. Med. 15 2023 eade1283 10.1126/scitranslmed.ade1283 37824600 Supplemental information  Document S1. Figures S1–S7 and Tables S1 and S2 Table S3. Differentially expressed genes among 12 types of cells in ATM-deficient and healthy control cerebellums, related to Figure 7 Table S4. GO and KEGG analysis in Purkinje cells and MLIs, related to Figure 7 Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102355 ",
  "metadata": {
    "Title of this paper": "A single-cell genomic atlas for maturation of the human cerebellum during early childhood",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490238/"
  }
}