{
  "title": "Paper_365",
  "abstract": "pmc Front Pharmacol Front Pharmacol 1524 frontpharmacol Front. Pharmacol. Frontiers in Pharmacology 1663-9812 Frontiers Media SA PMC12487020 PMC12487020.1 12487020 12487020 41041639 10.3389/fphar.2025.1644029 1644029 1 Pharmacology Study Protocol Esketamine versus fentanyl as adjuncts to hepatic hilar nerve block for ambulatory percutaneous liver tumor ablation focusing on respiratory safety: protocol for a randomized controlled trial Wang et al. 10.3389/fphar.2025.1644029 Wang Xiao  1  †  ‡ Yan Lijuan  2  †  ‡ Cai Jiaying  3 Wei Jianfei  4 Zhang Zuobing  1 * Yang Bin  2  † *  1 Department of Ultrasound, The First Affiliated Hospital of Xiamen University, School of Medicine, Xiamen University Xiamen China  2 Department of Anesthesiology, The First Affiliated Hospital of Xiamen University, School of Medicine, Xiamen University Xiamen China  3 Department of Scientific Research, The First Affiliated Hospital of Xiamen University Xiamen China  4 Department of Anesthesiology, The First Hospital of Zhangzhou China Merchants Economic and Technological Development Zone Zhangzhou China  Edited by: Vassilis Martiadis  Reviewed by: Fabiola Raffone  Marilena Georgiades * yangbin4332@outlook.com zzuobing@163.com  † ORCID: Xiao Wang, orcid.org/0000-0002-6539-9732 orcid.org/0000-0003-1143-2733 orcid.org/0000-0002-6604-5565  ‡ These authors have contributed equally to this work and share first authorship 17 9 2025 2025 16 480654 1644029 27 6 2025 27 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Wang, Yan, Cai, Wei, Zhang and Yang. 2025 Wang, Yan, Cai, Wei, Zhang and Yang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Opioid-induced respiratory depression (OIRD) is a critical safety concern during ambulatory percutaneous liver tumor thermal ablation. Esketamine has been shown to offer a promising opioid-sparing alternative with the potential to provide respiratory stability benefits. We hypothesize that hepatic hilar nerve block (HHNB) combined with esketamine will reduce the incidence of respiratory depression when compared to HHNB in conjunction with fentanyl in this particular context. Methods This single-center, prospective, double-blind, randomized controlled trial (RCT) will enroll patients undergoing ambulatory ultrasound-guided percutaneous liver thermal ablation. Patients will be randomly assigned to receive either intravenous esketamine 0.37 mg kg −1 − −1 Results and analysis The primary outcome is the incidence of respiratory depression, defined as SpO 2 2 Conclusion and discussion This trial aims to provide Level I evidence comparing the respiratory depression risk between esketamine-based and fentanyl-based analgesia during HHNB-guided liver ablation. Should esketamine prove to be demonstrably superior in terms of respiratory safety, HHNB-esketamine has the potential to be a viable treatment option. esketamine thermal ablation hepatic hilar nerve block ambulatory anesthesia opioid-sparing analgesia The author(s) declare that financial support was received for the research and/or publication of this article. This work is supported by Fujian Research and Training Grants for Young and Middle-aged Leaders in Healthcare (Bin Yang), and Scientific Research Special Grant Fund Project of Wu Jieping Medical Foundation (grant number: 320.6750.2024-05-50). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Neuropharmacology 1 Introduction Percutaneous thermal ablation is a minimally invasive treatment for early-stage hepatocellular carcinoma and oligometastatic liver disease. Its application in ambulatory settings is expanding rapidly due to advantages in patient recovery and healthcare resource utilization ( Shamim et al., 2017 He et al., 2021 Georgiades et al., 2025 He et al., 2021 Georgiades et al., 2025 Wah et al., 2005 Lee et al., 2009 He et al., 2021 Georgiades et al., 2025 The hepatic hilar nerve block (HHNB) has been introduced more recently as a complementary regional technique to enhance visceral analgesia with higher liver-specificity compared to celiac or paravertebral blocks. However, HHNB alone is often insufficient to provide complete analgesia during the procedure ( He et al., 2021 Georgiades et al., 2025 Watkinson et al., 2002 Jonkman et al., 2018 Gali et al., 2019 Baldo and Rose, 2022 2 Olsen et al., 2024 Gali et al., 2019 Ramirez et al., 2021 McLott and Stahel, 2022 Liu et al., 2020 Esketamine (S-ketamine), a potent N-methyl-d-aspartate (NMDA) receptor antagonist, not only manages treatment-resistant depression but also offers a mechanistically distinct approach to analgesia and sedation ( Martinotti et al., 2022 Song et al., 2023 Di Vincenzo et al., 2024 Rosso et al., 2025 Jonkman et al., 2018 Li et al., 2022 Miao et al., 2024 Jonkman et al., 2018 −1 −1 −1 Despite this promising profile and a defined effective dose, a critical evidence gap remains. There is a lack of high-quality randomized controlled trials (RCTs) directly comparing the incidence of respiratory depression (the most consequential safety endpoint) between an esketamine-based regimen (HHNB + esketamine 0.37 mg·kg −1 −1 2 Methods 2.1 Study design This RCT will be carried out in the department of Ultrasound at the First Affiliated Hospital of Xiamen University. The present protocol has been designed under the principles of the Declaration of Helsinki and is consistent with the Standard Protocol Items ( Chan et al., 2013 Figure 1 Table 1 FIGURE 1 Flow chart of the study. Flowchart depicting a randomized controlled trial process. It starts with enrollment, where potential participants are recruited based on inclusion criteria, exclusion criteria, and informed consent, totaling 52 recruits. Randomization occurs with 52 participants divided into intervention and control groups. Each group undergoes allocation, follow-up, and analysis phases. For each phase, the chart specifies actions like receiving interventions, study completion, loss to follow-up, and data analysis. Placeholder numbers are indicated for each step. TABLE 1 The schedule of enrollment, interventions, and assessments . Study period Screening Allocation Intervention and procedure PACU Follow-up T1 T2, T3, T4 T5 T6 T7 T8 Enrollment: Inclusion criteria X Exclusion criteria X Informed consent X Randomization X Demographic data X Physical examination data X Interventions: The intervention group  The control group  Assessments: Clinical monitoring Vital signs X X X NRS X X X Outcome assessment The incidence of respiratory depression X X The success rate of anesthesia X The consumption of remedial analgesia X X X Induction duration X Awakening duration X X The detained time in hospital X X X X X X Sonographer satisfaction score X Patient satisfaction score X Adverse events X X X X X All participants will receive a standardized premedication consisting of midazolam at a dose of 0.03 mg·kg -1 −1 −1 2.2 Timeline and assessments Key time points for physiological data collection are as follows: T1: Prior to anesthesia (10 min after positioning); T2: 60 s after esketamine injection; T3: 5 min after HHNB; T4: During thermal ablation of liver tumors; and T5: In the PACU. Postoperative pain assessments (for providing remedial analgesia) will be conducted at T6: 2 h, T7: 6 h, and T8: 24 h after the procedure. These time points will be chosen to capture the analgesic requirements during the early recovery phase. 2.3 Study sample 2.3.1 Participant enrollment The identification and enrolment of subjects suitable for ultrasound-guided percutaneous hepatic thermal ablation will take place at the outpatient clinic of the Department of Ultrasound from December 2025 to June 2028. The department is responsible for handling a yearly volume of over 100 patients who undergo ultrasound-guided percutaneous hepatic thermal ablation. Before undergoing the procedure, patients will undergo a comprehensive evaluation and will be informed of the potential benefits and common complications. Before enrolment, written informed consent will be obtained from the patient. It is imperative to note that all participants are entitled to withdraw from the study at any time. In the event of patient refusal to participate in the study, or in the event of suspension or withdrawal from the study midway, this will be completed following the alternative anesthetic plan for subsequent treatment. The quality of medical care will not be affected by any of these eventualities. 2.3.2 Participants’ inclusion criteria All subjects deemed eligible will be subjected to a screening process based on the following inclusion criteria. • Aged 18–70 years; • ASA physical status I or III; • Body mass index (BMI) 18–28 kg·m -2 • Scheduled for elective ultrasound-guided thermal ablation of solitary liver tumors under HHNB. 2.3.3 Participants’ exclusion criteria The following section outlines the exclusion criteria that will be applied to participants in this study. • Known hypersensitivity to study medications (esketamine, midazolam); • Opioid or benzodiazepine dependence; • Using analgesics within the last 24 h preoperatively; • Participation in other investigational drug trials within 90 days. • Multifocal hepatic lesions requiring concurrent ablation; • Patients after liver transplantation; • Active upper respiratory tract infection within 14 days; • Severe cardiopulmonary diseases (New York Heart Association [NYHA] class III-IV, FEV 1 • Decompensated hepatic insufficiency (Child-Pugh C); • Uncontrolled hypertension (≥180/110 mmHg), elevated intracranial/intraocular pressure, or hyperthyroidism; • Major neuropsychiatric disorders (epilepsy, schizophrenia, major depressive disorder, and cognitive impairment). • Anticipated difficult airway (Mallampati III-IV, thyromental distance <6 cm) or anatomical airway obstruction; • Inadequate preoperative fasting (solid intake <8 h, clear fluids <2 h). 2.3.4 Participants’ withdrawal criteria Participants will be withdrawn from the study if any of the following conditions apply: • Voluntary withdrawal of consent. • Significant deviation from established anesthesia or surgical protocols. • Concomitant surgical interventions that alter study parameters. 2.4 Sample size As demonstrated in earlier research, the incidence of respiratory depression in the intervention group was found to be approximately 0.01, while in the control group, it was 0.3, with α = 0.05 and β = 0.1. The sample size was calculated to be 23 cases using R (v4.4.3; R Foundation) within the RStudio environment (v2024.12.1 + 563). In light of the observed dropout rate, estimated at approximately 10%, the sample size was determined to be 52 cases. 2.5 Randomization The present study adopted a simple randomization procedure. The randomization process utilizes computer-generated random numbers, and the allocation ratio of patients is 1:1. The grouping information was sealed and stored by the research assistants, who were not involved in the study, in opaque envelopes according to the grouping numbers. Access to the randomization code is limited to specific researchers responsible for preparing the research drug and handling emergencies during the process to ensure the safety of the participants. 2.6 Blinding In the design and implementation of the current study, the researchers, subjects, and followers had no knowledge of the intervention and control drugs, will be unaware of the grouping of the cases and whether the drug used is esketamine or fentanyl, and remained blinded throughout. In this experiment, esketamine and fentanyl will be administered by a research assistant who will not be involved in the design and implementation of the study. The same syringes will be utilized for each injection, and the specified dose of the drug according to the study protocol and grouping allocation will be diluted to the same volume (20 mL) with 0.9% normal saline. The syringes will be labeled with unique identifiers and assigned to the attending anesthesiologist. The anesthesiologist will perform the anesthesia following the stipulated instructions in the envelope. The patient will be rendered blind for the duration of the present study, as they will be in a sedated state and unaware of medical information. The designated follow-up personnel will undertake the requisite follow-up and record data accordingly. The subsequent results should be uploaded to the data center and must not be disclosed to anyone. 2.7 Intervention Once the participant has been identified, a schedule for the intervention will be established based on group allocation. The schedule of enrolment, interventions, and assessments is shown in Table 1 Figure 2 FIGURE 2 Graphic abstract. HHNB: hepatic hilar nerve block. Flowchart depicting a medical procedure comparing two groups: intervention and control. Both groups start with anesthesia using midazolam. The intervention group receives esketamine, while the control group receives fentanyl. Both groups undergo HHNB and thermal ablation on the liver. The process concludes with the end of the procedure and anesthesia, illustrated by a patient on a hospital bed connected to monitoring equipment. All patients will be consciously sedated using midazolam combined with esketamine/fentanyl before undergoing ultrasound-guided HHNB. The intervention group will be administered midazolam at a dose of 0.03 mg·kg -1 -1 -1 -1 2.8 Monitoring and standard practice-based anesthesia protocol Standardized preoperative fasting protocols will be strictly enforced, requiring abstinence from solid intake for ≥8 h and clear fluids for ≥2 h before the procedure. Upon transfer to the operating room, patients will be positioned supine and instrumented with standard monitoring. Oxygen supplementation will be administered through a Venturi mask at a fixed flow rate of 5 L·min -1 2  Ultrasound-guided Percutaneous HHNB Technique Wang and Kao, 2015 Bhagavatula et al., 2017 He et al., 2021 Figure 3 Supplementary Video S1 ® Figure 4 Supplementary Video S2 ® Liu et al., 2020 Figure 5 Supplementary Video S2 FIGURE 3 The 22G puncture needle guided to puncture the Glisson’s capsule in the grayscale mode. Under grayscale ultrasound mode, a 22G puncture needle is guided into Grayson’s capsule, with the real-time position of the needle tip clearly visualized in the image. FIGURE 4 Ultrasound-guided HHNB. HHNB: hepatic hilar nerve block. Ultrasound-guided hepatic hilar nerve block (HHNB). A local anesthetic mixed with contrast agent is injected into Grayson’s capsule. On contrast-enhanced ultrasound, fluid spread within Grayson’s capsule is clear, with no contrast agent perfusion in the liver parenchyma, portal vein, or accompanying hepatic artery—confirming accurate drug injection. FIGURE 5 Ultrasound imaging of Glisson’s capsule after the administration of ultrasound-guided HHNB in dual-screen Doppler mode. HHNB: hepatic hilar nerve block. After hepatic hilar nerve block (HHNB), the spread of the mixed solution within Grayson’s capsule was continuously observed under contrast-enhanced mode to ensure that the solution was not injected into the portal vein, hepatic artery, or surrounding liver parenchyma. Each rescue dose of remifentanil will be 0.5 μg·kg -1 Respiratory compromise management will also follow a stepwise protocol: respiratory depression (SpO 2 2 Bradycardia (heart rate [HR] <45 bpm) will be treated with atropine 0.5 mg intravenously. Hypotension (mean arterial pressure [MAP] <80% baseline) will trigger the administration of phenylephrine 50 μg intravenous boluses, repeated every minute until the target MAP is achieved. All intraoperative events will be subjected to blind adjudication and timestamped by an independent research assistant. The onset duration, severity grading, and intervention frequency will be documented using case report forms. 2.9 Data collection, handling, and monitoring All patient and procedure-related variables will be systematically extracted from electronic medical records using a standardized case report form (CRF). The following variables will be included: (i) Baseline characteristics of the subjects: age, sex, height, weight, ASA status; (ii) Data about the primary and secondary outcomes; (iii) Standard Monitoring: electrocardiographic (ECG), MAP, SpO 2 2 All adverse events (AEs) will be meticulously documented in the source file and actively monitored until such events are resolved or stabilized. Serious adverse events (SAEs) and suspected and unexpected serious adverse reactions (SUSARs) must be reported within 24 h. It is imperative to ensure that all information is accurate, complete, and submitted on time. Meanwhile, data records must be clear and comprehensible to ensure accurate interpretation and facilitate traceability. 3 Outcomes The primary outcome is the incidence of respiratory depression, which is defined as SpO 2 2 Anesthesia success will be defined as inadequate analgesia requiring ≤3 rescue doses of remifentanil within 10 min throughout the procedure. The success rate of anesthesia will be calculated by dividing the number of successful anesthesia cases by 26. The Numeric Rating Scale (NRS) will be utilized to assess postoperative pain, with a range of 0 representing no pain and 10 representing severe pain. This scale will be administered at 2, 6, and 24 h following the procedure. The consumption of remedial analgesia will be the total consumption of acetaminophen documented at 2, 6, and 24 h after the procedure. The satisfaction score of the sonographer will be collected post-operatively, using a scale ranging from 0 to 10, with 0 representing dissatisfaction and 10 representing very satisfied. The patient’s satisfaction will be assessed on the first day after the procedure ( Yan et al., 2024 Adverse events will encompass a range of systems, including the cardiovascular system (eg. high/low blood pressure and sinus tachycardia/bradycardia), as well as symptoms such as nausea, vomiting, dizziness, and mental symptoms. 4 Statistical analysis All statistical analyses will be conducted using SPSS Statistics (v20.0; IBM Corp) and R (v4.4.3; R Foundation) within the RStudio environment (v2024.12.1 + 563), under the supervision of an independent biostatistician. The last observation carried forward method will be used to impute missing data, and the interim analyses will not be performed in this study. Continuous variables will undergo a process of normality assessment by the Kolmogorov-Smirnov test. In the case of normally distributed data, the following statistical procedures are to be employed: the data will be expressed as the mean ± standard deviation and analyzed with independent samples t-tests for between-group comparisons, paired t-tests for within-group assessments, and repeated-measures analysis of variance ANOVA for longitudinal measurements. In the event of non-normally distributed data, this will be reported as the median [interquartile range] using the Mann-Whitney U test for intergroup and the Wilcoxon signed-rank test for intragroup comparisons. Categorical variables will be summarized as frequencies (%), and these will be compared via chi-square tests or Fisher’s exact tests. A p-value of less than 0.05 will be considered statistically significant. 5 Discussion This RCT protocol addresses a critical safety gap in ambulatory percutaneous liver tumor ablation by directly comparing the incidence of respiratory depression–the paramount anesthesia-related adverse event in ASCs–between two mechanistically distinct analgesic strategies: hepatic hilar nerve block (HHNB) augmented with either esketamine (0.37 mg·kg -1 -1 Palkovic et al., 2020 Jansen et al., 2025 In the event of confirmation of our hypothesis, the clinical implications will extend beyond statistical significance. The mitigation of respiratory depression can predictably reduce the cascade of ambulatory care disruptions, including the administration of naloxone, emergent airway management, prolonged PACU stays, unplanned admissions, and additional medical burdens ( Gali et al., 2019 Laporta et al., 2021 5.1 Strengths of the study The methodological strengths of the trial enhance the validity of its findings. (i) In contrast to studies utilizing arbitrary and unvalidated “low-dose” esketamine regimens, the present study employed a dose-finding trial within the same clinical context to determine the esketamine dosage for the intervention group, thereby ensuring analgesic efficacy comparable to that of the standard fentanyl protocol. (ii) The process of double-blinding serves to minimize performance and detection bias, while the utilization of an active-controlled design ensures the maintenance of clinical relevance. The utilization of continuous respiratory monitoring through the implementation of standardized capnography and oximetry techniques facilitates the objective assessment of the primary endpoint. 5.2 Limitations It is imperative to acknowledge the limitations of this study. (i) The single-center design is predicated on the principle of internal validity, with the potential consequence of diminished generalizability. Nevertheless, the rigorous standardization of the HHNB technique, anesthetic protocols, surgical procedures, and monitoring safeguards ensures consistency. (ii) As indicated by the exclusion of Child-Pugh C cirrhosis or severe cardiopulmonary disease, the initial safety assessment is focused on typical ambulatory candidates. Nevertheless, further investigation into higher-risk cohorts is considered essential. (iii) The psychoactive effects of esketamine, despite being mitigated by the administration of a standard dose of midazolam before the commencement of the trial and by assessors who were unaware of the treatment allocation, may compromise the integrity of the blinding process. 5.3 Future and direction It is recommended that future research explore the impact of esketamine on long-term recovery metrics, cost-effectiveness, and its utility in comorbid populations (eg. advanced liver disease or severe sleep apnea). Beyond its well-established analgesic properties, esketamine has demonstrated significant efficacy in the treatment of depressive disorders ( Martinotti et al., 2022 Di Vincenzo et al., 2024 Rosso et al., 2025 We should also explore combining esketamine with targeted nerve blocks to achieve truly opioid-free ablation while testing this approach in similar outpatient procedures like kidney tumor ( Dubut et al., 2016 Wang et al., 2025 Yan et al., 2024 Although preclinical evidence indicates that μ-opioid receptor (MOR) activation might promote tumor progression in hepatocellular carcinoma ( Li et al., 2019 Additionally, artificial intelligence and machine learning tools could enable precise predictions of analgesic requirements during anesthesia for these outpatient procedures ( Salama et al., 2024 6 Conclusion The objective of this trial is to provide Level I evidence to inform the selection of analgesics for ambulatory percutaneous liver ablation procedures. Should esketamine prove to be a more efficacious agent in terms of respiratory safety, it has the potential to establish HHNB-esketamine as a new standard for same-day discharge pathways in ASCs, thereby aligning analgesic efficacy with enhanced recovery after surgery (ERAS). We thank BioRender.com https://BioRender.com Ethics statement The studies involving humans were approved by This study has been approved by the Ethics Committee of the First Affiliated Hospital of Xiamen University (Approval No. 097; 2025). The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Written informed consent was obtained from the individual(s) for the publication of any potentially identifiable images or data included in this article. Author contributions XW: Writing – review and editing, Project administration, Conceptualization, Writing – original draft, Methodology, Visualization. LY: Writing – original draft, Conceptualization, Funding acquisition, Writing – review and editing, Project administration, Methodology, Visualization. JC: Writing – review and editing. JW: Writing – review and editing. ZZ: Writing – review and editing, Project administration, Visualization. BY: Project administration, Funding acquisition, Writing – review and editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fphar.2025.1644029/full#supplementary-material References Baldo B. A. Rose M. A. 2022 Mechanisms of opioid-induced respiratory depression Arch. Toxicol. 96 2247 2260 10.1007/s00204-022-03300-7 35471232 Bhagavatula S. K. Chick J. F. Chauhan N. R. Shyn P. B. 2017 Artificial ascites and pneumoperitoneum to facilitate thermal ablation of liver tumors: a pictorial essay Abdom. Radiol. (NY) 42 620 630 10.1007/s00261-016-0910-9 27665483 Chan A. W. Tetzlaff J. M. Gotzsche P. C. Altman D. G. Mann H. Berlin J. A. 2013 SPIRIT 2013 explanation and elaboration: guidance for protocols of clinical trials BMJ 346 e7586 10.1136/bmj.e7586 23303884 PMC3541470 Di Vincenzo M. Martiadis V. Della Rocca B. Arsenio E. D'arpa A. Volpicelli A. 2024 Facts and myths about use of esketamine for treatment-resistant depression: a narrative clinical review Front. Psychiatry 15 1394787 10.3389/fpsyt.2024.1394787 38812489 PMC11133709 Dubut J. Kastler B. Delabrousse E. Nardin C. Chenet J. Kleinclauss F. 2016 CT-guided paravertebral block for microwave ablation of kidney tumors: a new technique Abdom. Radiol. (NY) 41 1197 1202 10.1007/s00261-016-0738-3 27108128 Gali B. Gritzner S. R. Henderson A. J. Warner M. E. Sibanda S. L. Sprung J. 2019 Respiratory depression following ambulatory urogynecologic procedures: a retrospective analysis Mayo Clin. Proc. Innov. Qual. Outcomes 3 169 175 10.1016/j.mayocpiqo.2019.02.002 31193899 PMC6543496 Georgiades M. March C. Barajas Ordonez F. Omari J. Powerski M. Grosser O. S. 2025 Hepatic hilar nerve block for adjunctive analgesia in thermal ablation of liver tumors: a prospective randomized controlled trial Rofo 10.1055/a-2528-7037 39978353 He K. S. Fernando R. Cabrera T. Valenti D. Algharras A. Martinez N. 2021 Hepatic hilar nerve block for hepatic interventions: anatomy, technique, and initial clinical experience in thermal ablation of liver tumors Radiology 301 223 228 10.1148/radiol.2021203410 34254852 Jansen S. C. Van Velzen M. Sarton E. Dahan A. Niesters M. Van Der Schrier R. 2025 Acute effects of esketamine on hypoxic ventilatory response, haemodynamics, and brain function in healthy volunteers Br. J. Anaesth. 134 557 563 10.1016/j.bja.2024.08.040 39516125 Jonkman K. Van Rijnsoever E. Olofsen E. Aarts L. Sarton E. Van Velzen M. 2018 Esketamine counters opioid-induced respiratory depression Br. J. Anaesth. 120 1117 1127 10.1016/j.bja.2018.02.021 29661389 Laporta M. L. Sprung J. Weingarten T. N. 2021 Respiratory depression in the post-anesthesia care unit: Mayo clinic experience Bosn. J. Basic Med. Sci. 21 221 228 10.17305/bjbms.2020.4816 32415817 PMC7982067 Lee S. Rhim H. Kim Y. S. Choi D. Lee W. J. Lim H. K. 2009 Percutaneous radiofrequency ablation of hepatocellular carcinomas: factors related to intraprocedural and postprocedural pain AJR Am. J. Roentgenol. 192 1064 1070 10.2214/AJR.08.1350 19304715 Li Y. Li G. Tao T. Kang X. Liu C. Zhang X. 2019 The mu-opioid receptor (MOR) promotes tumor initiation in hepatocellular carcinoma Cancer Lett. 453 1 9 10.1016/j.canlet.2019.03.038 30928385 Li J. Wang Z. Wang A. Wang Z. 2022 Clinical effects of low-dose esketamine for anaesthesia induction in the elderly: a randomized controlled trial J. Clin. Pharm. Ther. 47 759 766 10.1111/jcpt.13604 35018643 Liu D. M. Hadjivassiliou A. Valenti D. Ho S. G. Klass D. Chung J. B. 2020 Optimized nerve block techniques while performing percutaneous hepatic ablation: literature review and practical use J. Interv. Med. 3 161 166 10.1016/j.jimed.2020.06.002 34557322 PMC7420394 Martinotti G. Vita A. Fagiolini A. Maina G. Bertolino A. Dell'osso B. 2022 Real-world experience of esketamine use to manage treatment-resistant depression: a multicentric study on safety and effectiveness (REAL-ESK study) J. Affect. Disord. 319 646 654 10.1016/j.jad.2022.09.043 36167246 Mclott J. Stahel P. F. 2022 Opioid-free anesthesia: the next frontier in surgical patient safety Patient Saf. Surg. 16 38 10.1186/s13037-022-00346-5 36461121 PMC9719141 Miao Y. Zheng M. Li Q. Xiong L. Feng J. Liu X. 2024 Comparison of propofol-esketamine versus propofol-sufentanil for deep sedation and analgesia in children with autism: a randomized double-blind clinical trial Autism Res. 17 1356 1364 10.1002/aur.3172 38850067 Olsen W. L. Hayes J. A. Shuman D. Morris K. F. Bolser D. C. 2024 Modeling insights into potential mechanisms of opioid-induced respiratory depression within medullary and pontine networks bioRxiv 2024.12.19.628766 10.1101/2024.12.19.628766 39763818 PMC11702709 Palkovic B. Marchenko V. Zuperku E. J. Stuth E. a.E. Stucke A. G. 2020 Multi-level regulation of opioid-induced respiratory depression Physiol. (Bethesda) 35 391 404 10.1152/physiol.00015.2020 33052772 PMC7864237 Ramirez J. M. Burgraff N. J. Wei A. D. Baertsch N. A. Varga A. G. Baghdoyan H. A. 2021 Neuronal mechanisms underlying opioid-induced respiratory depression: our current understanding J. Neurophysiol. 125 1899 1919 10.1152/jn.00017.2021 33826874 PMC8424565 Rosso G. D'andrea G. Barlati S. Di Nicola M. Andriola I. Marcatili M. 2025 Esketamine treatment trajectory of patients with treatment-resistant depression in the mid and long-term run: data from REAL-ESK Study group Curr. Neuropharmacol. 23 612 619 10.2174/011570159X337670241029062524 39810448 PMC12163464 Salama V. Godinich B. Geng Y. Humbert-Vidan L. Maule L. Wahid K. A. 2024 Artificial intelligence and machine learning in cancer pain: a systematic review J. Pain Symptom Manage. 68 e462 e490 10.1016/j.jpainsymman.2024.07.025 39097246 PMC11534522 Shamim F. Asghar A. Tauheed S. Yahya M. 2017 Radiofrequency ablation of hepatocellular carcinomas: a new spectrum of anesthetic experience at a tertiary care hospital in Pakistan Saudi J. Anaesth. 11 21 25 10.4103/1658-354X.197367 28217048 PMC5292847 Song N. Yang Y. Zheng Z. Shi W. C. Tan A. P. Shan X. S. 2023 Effect of esketamine added to propofol sedation on desaturation and hypotension in bidirectional endoscopy: a randomized clinical trial JAMA Netw. Open 6 e2347886 10.1001/jamanetworkopen.2023.47886 38117498 PMC10733809 Wah T. M. Arellano R. S. Gervais D. A. Saltalamacchia C. A. Martino J. Halpern E. F. 2005 Image-guided percutaneous radiofrequency ablation and incidence of post-radiofrequency ablation syndrome: prospective survey Radiology 237 1097 1102 10.1148/radiol.2373042008 16304121 Wang C. C. Kao J. H. 2015 Artificial ascites is feasible and effective for difficult-to-ablate hepatocellular carcinoma Hepatol. Int. 9 514 519 10.1007/s12072-015-9639-8 26108302 Wang Y. F. Bie Z. Li Y. Xu S. Guo R. Li X. G. 2025 Microwave ablation for subpleural stage I non-small cell lung cancer: a prospective, single-center study comparing three anesthesia models Int. J. Hyperth. 42 2498649 10.1080/02656736.2025.2498649 40326025 Watkinson A. F. Francis I. S. Torrie P. Platts A. D. 2002 Commentary: the role of anaesthesia in interventional radiology Br. J. Radiol. 75 105 106 10.1259/bjr.75.890.750105 11893632 Yan L. Wang X. Zhang Z. Li Z. Chi L. Wang L. 2024 Safety and efficacy of ultrasound-guided superior hypogastric plexus block combined with conscious sedation in ambulatory patients undergoing percutaneous microwave ablation of uterine myomas: study protocol for a single-center, double-blinded, randomized controlled trial Heliyon 10 e26421 10.1016/j.heliyon.2024.e26421 38434068 PMC10906327 ",
  "metadata": {
    "Title of this paper": "Safety and efficacy of ultrasound-guided superior hypogastric plexus block combined with conscious sedation in ambulatory patients undergoing percutaneous microwave ablation of uterine myomas: study protocol for a single-center, double-blinded, randomized controlled trial",
    "Journal it was published in:": "Frontiers in Pharmacology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487020/"
  }
}