{
  "title": "Paper_973",
  "abstract": "pmc Brief Bioinform Brief Bioinform 721 bib bib Briefings in Bioinformatics 1467-5463 1477-4054 Oxford University Press PMC12476841 PMC12476841.1 12476841 12476841 41016012 10.1093/bib/bbaf505 bbaf505 1 Review AcademicSubjects/SCI01060 Streamline automated biomedical discoveries with agentic bioinformatics Zhou Juexiao  Syneron Opal 10281 Cayman Island  Computer Science Program King Abdullah University of Science and Technology (KAUST) Thuwal 23955-6900 Kingdom of Saudi Arabia  Center of Excellence for Smart Health, King Abdullah University of Science and Technology (KAUST) Thuwal 23955-6900 Kingdom of Saudi Arabia  Center of Excellence on Generative AI, King Abdullah University of Science and Technology (KAUST) Thuwal 23955-6900 Kingdom of Saudi Arabia  School of Data Science, The Chinese University of Hong Kong Shenzhen (CUHK-Shenzhen), Guangdong 518172 P.R. China Jiang Jindong  Department of Statistics, Nanjing University Nanjing 210008 China Han Zhongyi  Computer Science Program King Abdullah University of Science and Technology (KAUST) Thuwal 23955-6900 Kingdom of Saudi Arabia  Center of Excellence for Smart Health, King Abdullah University of Science and Technology (KAUST) Thuwal 23955-6900 Kingdom of Saudi Arabia  Center of Excellence on Generative AI, King Abdullah University of Science and Technology (KAUST) Thuwal 23955-6900 Kingdom of Saudi Arabia  School of Software, Shandong University Jinan 250101 China Wang Zijian  School of Data Science P.R. China Gao Xin  Computer Science Program Kingdom of Saudi Arabia  Center of Excellence for Smart Health Kingdom of Saudi Arabia  Center of Excellence on Generative AI Kingdom of Saudi Arabia Corresponding author. Computer Science Program, Computer, Electrical and Mathematical Sciences and Engineering Division, King Abdullah University of Science and Technology (KAUST), Thuwal 23955-6900, Kingdom of Saudi Arabia. E-mail: xin.gao@kaust.edu.sa Juexiao Zhou, Jindong Jiang and Zhongyi Han contributed equally. 9 2025 28 9 2025 26 5 495954 bbaf505 30 4 2025 14 8 2025 31 8 2025 28 09 2025 29 09 2025 29 09 2025 © The Author(s) 2025. Published by Oxford University Press. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract The emergence of artificial intelligence agents powered by large language models marks a transformative shift in computational biology. In this new paradigm, autonomous, adaptive, and intelligent agents are deployed to tackle complex biological challenges, leading to a new research field named agentic bioinformatics. Here, we explore the core principles, evolving methodologies, and diverse applications of agentic bioinformatics. We examine how agentic bioinformatics systems work synergistically to facilitate data-driven decision-making and enable self-directed exploration of biological datasets. Furthermore, we highlight the integration of agentic frameworks in key areas such as personalized medicine, drug discovery, and synthetic biology, illustrating their potential to revolutionize healthcare and biotechnology. In addition, we address the ethical, technical, and scalability challenges associated with agentic bioinformatics, identifying key opportunities for future advancements. By emphasizing the importance of interdisciplinary collaboration and innovation, we envision agentic bioinformatics as a major force in overcoming the grand challenges of modern biology, ultimately advancing both research and clinical applications. AI agents bioinformatics large language models King Abdullah University of Science and Technology (KAUST) Office of Research Administration (ORA) REI/1/5234-01-01 REI/1/5414-01-01 REI/1/5289-01-01 REI/1/5404-01-01 REI/1/5992-01-01 URF/1/4663-01-01 Center of Excellence for Smart Health 5932 Center of Excellence on Generative AI 5940 Chinese University of Hong Kong, Shenzhen 10.13039/100022813 UDF01004172 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Main Bioinformatics, a discipline rooted at the intersection of biology, computer science, and mathematics, has undergone remarkable evolution since its inception in the mid-20th century [ 1 2 3 4 5 6 7–10 11 12 Today, bioinformatics stands as the cornerstone of modern biology and medicine, driving discoveries in areas ranging from evolutionary biology and structural genomics to personalized medicine and synthetic biology [ 13 14 15–17 18 19 20 21 The use of agent-based approaches in bioinformatics has a well-established history. As early as the NETTAB 2001 and 2002 workshops [ 22 23 et al 24 25 Conventional bioinformatics approaches have relied heavily on manual curation and rigid workflows [ 26–28 29 21 29 30 Thus, we define and envision agentic bioinformatics Agentic bioinformatics represents a fundamental shift that introduces a multi-agent, adaptive framework that aligns more closely with the open-ended, exploratory nature of biological research, where goals evolve and data contexts shift. Tasks that once demanded extensive human expertise and time are now streamlined, facilitating rapid hypothesis iteration and validation. Furthermore, this paradigm promotes inclusivity by democratizing access to advanced analytical tools, allowing researchers with varying levels of computational expertise to leverage state-of-the-art methods. In contrast to traditional LLM-based workflow automation, agentic bioinformatics entails a system-level rethinking of how biological knowledge is generated, transforming agents from tools into autonomous collaborators capable of hypothesis generation, experimental design, and iterative refinement. This systemic view enables enhanced scalability, inclusivity, and accessibility, allowing researchers with diverse backgrounds to leverage sophisticated methods through intelligent mediation. By bridging disciplines, agentic bioinformatics could empower collaborative efforts across the biological sciences, fostering innovation and accelerating discovery. Here, we comprehensively explore the concept and implications of agentic bioinformatics, with key terminology defined in Table 1 Table 1 Glossary of key terms in agentic bioinformatics Term Definition AI agent An autonomous or semi-autonomous computational entity capable of perceiving its environment, processing information, and taking actions to achieve specific goals. In the context of bioinformatics, AI agents operate across both wet-lab and dry-lab settings. LLM A type of AI model trained on large corpora of text to perform natural language processing tasks. In this framework, LLMs are used as foundational components for agents such as Literature Review Agents and Reasoning Agents, enabling sophisticated language understanding and generation. Agentic bioinformatics An interdisciplinary paradigm that integrates autonomous AI agents into the bioinformatics lifecycle, from hypothesis generation and experimental execution to data analysis and interpretation, across both wet-lab and dry-lab environments. Wet-lab AI agent An AI-driven system, often embodied in hardware or interfaced with physical lab equipment, that performs experimental tasks such as sample preparation, PCR, microscopy, or animal testing. These agents support experimental throughput, precision, and reproducibility. Dry-lab AI agent A software-based AI entity that handles computational tasks, including data mining, statistical analysis, machine learning, and hypothesis generation, using digital datasets such as genomic sequences or imaging data. Search agent A type of dry-lab agent designed to retrieve relevant scientific information from structured and unstructured databases, assisting in the knowledge-gathering phase of research. Literature review agent An AI agent powered by LLMs that synthesizes insights from scientific literature to support experiment planning and contextualization of results. Database agent A dry-lab AI agent that manages and queries large-scale biological databases, enabling efficient access to structured biological data. Innovative AI agent An AI agent that can design forward-thinking AI applications, such as the design of novel algorithms and the development of novel applications. Reasoning agent An advanced dry-lab AI agent that applies logic, inference, and probabilistic modeling to derive insights from complex datasets and guide decision-making. Agentic bioinformatics As illustrated in Fig. 1 Figure 1  Conceptual framework for agentic bioinformatics. Brainstorming and experiment design: Wet-lab AI Agents: in vivo Dry-lab AI Agents: Innovative AI agents: Workflow of Different Types of Agents in Bioinformatics Experiments. Agents in bioinformatics operate under two primary paradigms: single-agent systems and multi-agent systems. Each paradigm serves distinct purposes and offers unique advantages depending on the complexity and scope of the task. Single-agent systems comprise a stand-alone AI agent that executes specific tasks independently. They are designed for high specialization and focus, excelling in tasks that require in-depth expertise or precision. Such systems are particularly effective for compartmentalized tasks that can be solved in isolation, offering simplicity and efficiency in implementation. However, their stand-alone nature limits their ability to address interconnected or multifaceted problems. In contrast, multi-agent systems consist of multiple intelligent agents working collaboratively to tackle complex challenges. These systems are characterized by their ability to distribute responsibilities, coordinate actions, and adapt dynamically to evolving tasks. The adaptability and scalability of multi-agent systems make them ideal for addressing the intricate and dynamic nature of modern bioinformatics challenges. They enable researchers to model complex systems, explore multidimensional datasets, and solve problems that exceed the capabilities of stand-alone agents. By leveraging the strengths of both single-agent and multi-agent systems, bioinformatics researchers can tailor their approaches to the specific demands of their work, ensuring optimal efficiency and innovation. Single AI agent in bioinformatics Single agent in bioinformatics is typically designed to handle specific tasks such as data analysis or experiment control. These agents have proven highly effective in managing well-defined tasks, offering significant advantages in simplicity, cost-effectiveness, and task specialization, as shown in Table 2 Table 3 Table 2 Single-agent systems for agentic bioinformatics. An asterisk (*) indicates a non-peer-reviewed paper Method name Year Journal Model Task Key feature Reproducibility BioMANIA 2023 bioRxiv* GPT4 omics data analysis A chatbot generation pipeline with a user-friendly back-end service for seamless interaction  https://github.com/batmen-lab/BioMANIA AutoBA 2023 Advanced Science Multiple LLMs omics data analysis Automated multi-omics analysis with minimal user input while providing detailed, step-by-step analysis plans  https://github.com/JoshuaChou2018/AutoBA BioInformatics Agent (BIA) 2024 bioRxiv* GPT4 scRNA-seq data analysis Autonomous bioinformatic analysis through natural language  https://github.com/biagent-dev/bia BRAD 2024 Bioinformatics GPT4 Various biological tasks Enable tasks such as Retrieval-Augmented Generation, searches across bioinformatics databases, and the execution of software pipelines  https://github.com/jpickard1/brad LM-ABC 2024 bioRxiv* GPT4 enzyme engineering A computational tool that merges LLMs with biocatalysis-specific modules to streamline enzyme engineering  https://github.com/GT4SD/lm-assistant-for-biocatalysis CRISPR-GPT 2024 bioRxiv* GPT4 CRISPR genome engineering Assist nonexpert researchers in designing gene-editing experiments and validates effectiveness in real-world use cases  https://github.com/cong-lab/crispr-gpt-pub BioDiscoveryAgent 2024 ICLR Claude 3.5 Sonnet design genetic perturbation experiments Design new experiments, reasons about their outcomes, and efficiently navigates the hypothesis space to reach desired solutions  https://github.com/snap-stanford/BioDiscoveryAgent SpatialAgent 2025 bioRxiv* GPT-4o, Claude 3.5 Sonnet conduct spatial genomics research Process multimodal inputs, incorporate external databases, and support human-in-the-loop interactions, enabling both fully automated and collaborative discovery  https://github.com/Genentech/SpatialAgent MDCrow 2025 arXiv* GPT-4o, llama3-405b Molecular dynamics simulations Consist of an environment of tools that emit observations and an LLM that selects actions  https://github.com/ur-whitelab/MDCrow Table 3  Feature comparison of single-agent systems for agentic bioinformatics Method name Automated Human interaction Experiment design Data analysis BioMANIA   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document} AutoBA   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document} BioInformatics Agent (BIA)   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document} BRAD   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document} LM-ABC   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document} CRISPR-GPT   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document} BioDiscoveryAgent   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document} SpatialAgent   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document} MDCrow   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document} Traditional bioinformatics data analysis requires multiple tools and substantial programming expertise, which limits accessibility to experimental researchers due to the steep learning curve. BioMANIA [ 31 BIA [ 32 AutoBA [ 18 BRAD [ 33 34 CRISPRGPT [ 35 In spatial genomics research, autonomous agents hold significant potential to drive innovation. SpatialAgent [ 36 However, while the simplicity and specialization of single agents offer clear benefits, they also present distinct challenges. Focusing on specific tasks can limit their ability to handle complex, multifaceted problems that require cross-domain knowledge or collaboration between multiple agents. Moreover, the lack of synergy between isolated agents can lead to inefficiencies, particularly when dealing with tasks that require multiple steps or diverse methodologies. Multi AI agents in bioinformatics Multi-agent systems have emerged as indispensable tools for tackling complex biological problems. These challenges include data processing in genomics, drug discovery, and protein design. By collaborating, different agents can effectively share tasks, improve productivity, and adapt to new challenges. This section will explore the collaboration models of multi-agent systems in bioinformatics, focusing on collaborative task-solving, dynamic task allocation, and continuous learning and adaptability ( Table 4 Table 5 Table 4 Multi-agent systems for agentic bioinformatics. An asterisk (*) indicates a non-peer-reviewed paper Method name Year Journal Model Task Key feature Reproducibility CellAgent 2024 bioRxiv* GPT4, GPT-4V scRNA-seq data analysis A hierarchical decision-making mechanism to coordinate these biological experts, effectively driving the planning and step-by-step execution of complex data analysis tasks  http://cell.agent4science.cn The Virtual Lab 2024 bioRxiv* GPT4 Design nanobody binders to recent variants of SARS-CoV-2 An LLM principal investigator agent guiding a team of LLM agents with different scientific backgrounds, with a human researcher providing high-level feedback  https://github.com/zou-group/virtual-lab Bio-Copilot 2024 bioRxiv* Multiple LLMs Large-scale omics studies Bio-Copilot decomposes a bioinformatics task into modular, hierarchical steps, configures agent groups, and specifies roles according to step characteristics, while formulating rules for task allocation and scheduling. Researchers collaborate with agent groups to generate explicit execution plans, and execution agent groups gather resources and carry out plans  https://github.com/lyyang01/Bio-Copilot ProtAgents 2024 Digital Discovery GPT-4 Protein design and analysis A platform for de novo protein design based on LLMs, where multiple AI agents with distinct capabilities collaboratively address complex tasks within a dynamic environment  https://github.com/lamm-mit/ProtAgents BioMaster 2025 bioRXiv* GPT-4 Various bioinformatics tasks Integration of a tailored memory mechanism and specialized agents to optimize input/output handling and management in complex bioinformatics workflows  https://github.com/ai4nucleome/BioMaster BioAgents 2025 arXiv* Phi-3 Assist users in designing complex bioinformatics pipelines Multi-agent system built on small language models, fine-tuned on bioinformatics data, and enhanced with retrieval augmented generation close-sourced Table 5  Feature comparison of multi-agent systems for agentic bioinformatics Method name Specialized roles Self-optimization Human-guided collaboration CellAgent   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document} The Virtual Lab   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document} Bio-Copilot   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document} ProtAgents   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document} BioMaster   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document} BioAgents   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\times $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document}   \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\checkmark $\\end{document} Multiple agents work together to solve complex tasks, often by decomposing them into smaller sub-tasks and distributing them among different agents. In the CellAgent [ 37 38 In complex bioinformatics tasks, new challenges and unforeseen issues may arise during the experiment. Multi-agent systems are equipped with continuous learning and adaptability mechanisms to optimize their strategies and behaviors over time. CellAgent also incorporates a self-iterative optimization mechanism that integrates automated evaluation results and adjusts the execution strategy to address potential technical problems or experimental anomalies. This self-improvement capability enables the system to adapt to changes and maintain high efficiency in execution quickly. However, CellAgent also faces several challenges. Its memory systems can become excessively large, leading to performance degradation in LLMs when handling overly long contexts. CellAgent’s main limitation lies in its restricted self-evaluation capability. While the GPT-4-based evaluation enables autonomous optimization, it currently lacks flexibility for diverse analytical objectives, requiring manual adjustment for specialized needs. Multi-agent systems often need to dynamically allocate tasks based on the complexity, priority, and real-time needs of the tasks, enhancing system efficiency and ensuring optimal resource utilization. In the Bio-Copilot framework [ 39 Multi-agent systems have been successfully applied to a wide range of bioinformatics tasks. For example, ProtAgent [ 40 The Virtual Lab [ 41 Challenges of agentic bioinformatics Despite its transformative potential, agentic bioinformatics faces several critical challenges that must be addressed to ensure its effective deployment in biological research. These challenges span technical, ethical, and collaborative aspects, each of which requires targeted solutions. Below, we outline the key challenges specific to agentic bioinformatics. Integration and standardization Agentic bioinformatics systems rely on a diverse ecosystem of AI agents, bioinformatics tools, and laboratory automation devices. However, the lack of standardized protocols for communication between AI-driven components impedes seamless interoperability. Existing bioinformatics workflows use heterogeneous data formats, software environments, and computational frameworks, making it difficult to integrate AI agents across different platforms. Standardization of APIs, data exchange formats, and agent communication protocols is essential to enable collaborative AI agents that operate across multiple bioinformatics tasks [ 42 High-dimensional biological data and multimodal integration Biological data are inherently high-dimensional, spanning genomics, transcriptomics, proteomics, metabolomics, and imaging modalities [ 43 Out-of-distribution generalization and anomaly detection A significant challenge for AI-driven bioinformatics is generalization to unseen data distributions, particularly when analyzing datasets from different species, cell types, or experimental conditions [ 44 45 46 47 Hallucinations in AI-driven bioinformatics AI agents, particularly LLMs and generative AI systems, may produce biologically implausible results or hallucinations when making predictions or generating hypotheses. In bioinformatics, hallucinations could manifest as incorrect sequence alignments, erroneous functional annotations, or false protein–ligand interactions. Unlike hallucinations in natural language processing, which are often a minor inconvenience, incorrect AI-driven bioinformatics predictions can mislead experimental designs and result in wasted resources. Implementing confidence scoring mechanisms, uncertainty quantification, and expert validation is crucial to mitigating AI hallucinations in bioinformatics [ 18 48 49 50 51 Bias, inclusivity, and security Bioinformatics datasets are often biased due to limited sample diversity in publicly available repositories. AI agents trained on biased datasets may produce unfair or misleading conclusions, particularly in applications such as disease biomarker discovery and drug response predictions. Bias mitigation strategies, such as adversarial debiasing and fairness-aware learning, are necessary to ensure that AI-driven insights are equitable across diverse populations [ 52 53 54 55 Data privacy and limited annotations Many bioinformatics applications involve sensitive genomic and clinical data, raising concerns about data privacy and regulatory compliance. Ensuring that AI agents comply with data protection regulations (e.g. GDPR, HIPAA) is crucial for their adoption in biomedical research. Federated learning and privacy-preserving AI techniques, such as differential privacy and homomorphic encryption, can help mitigate data privacy risks [ 56 57 58 Interpretability and explainability in AI-driven bioinformatics Interpretability remains a major bottleneck in deploying AI-driven bioinformatics models in real-world applications. Many DL-based bioinformatics models function as black boxes, making it difficult for researchers to understand the reasoning behind their predictions. AI agents used in bioinformatics must incorporate explainability techniques to improve model transparency [ 59 60 61 Ethical considerations The integration of AI agents in bioinformatics raises several ethical concerns. AI-generated biological hypotheses and experimental designs must be evaluated to ensure that they do not lead to unintended consequences, such as unethical genetic modifications or dual-use research applications. Ethical AI frameworks should be developed to guide the responsible use of AI agents in bioinformatics research, ensuring alignment with bioethical principles [ 62 63 21 Human–AI collaboration in bioinformatics AI-driven bioinformatics should augment, rather than replace human expertise. However, achieving effective human–AI collaboration remains a challenge due to the steep learning curve associated with AI-driven tools. Researchers must be trained to interact with AI agents, interpret AI-driven insights, and validate computational predictions experimentally. Additionally, AI systems must be designed to communicate their findings in a manner that is comprehensible to domain experts with varying levels of computational expertise [ 64 65 21 Methods Selection of agentic systems As the notion of agentic systems in bioinformatics is still nascent but rapidly advancing, the body of literature explicitly using this terminology remains limited. Therefore, we adopted an exploratory and integrative survey methodology aimed at capturing the current landscape of relevant technologies. We performed a targeted search of relevant literature from January 2020 to March 2025 using major academic and preprint databases, including PubMed, arXiv, bioRxiv, Google Scholar, and IEEE Xplore. Our search employed combinations of the following keywords: “AI agent,” “autonomous system,” “LLM in biology,” “wet-lab automation,” “robot scientist,” “bioinformatics pipeline,” “multi-agent system,” and “agent-based AI in science”. We included studies, tools, and platforms that met the following criteria: Explicit or implicit use of autonomous or semi-autonomous AI systems that support tasks across the bioinformatics workflow. Relevance to biological data acquisition, analysis, or interpretation in either wet-lab or dry-lab contexts. Availability through peer-reviewed publications, preprints, or reputable open-source platforms with community recognition. Systems that exhibit agentic characteristics, such as goal-directed behavior, contextual reasoning, perception-action loops, or integration with physical or digital environments. Discussion The prospect of an end-to-end automated biological discovery system powered by agentic bioinformatics represents a revolutionary shift in how biological research is conducted. In this forward-thinking model, intelligent AI agents are fully integrated throughout the research pipeline, autonomously managing every phase, from data generation and experimental design to execution, data acquisition, and analysis. This transformation has the potential to significantly reduce the time and resources needed for scientific discovery while increasing precision, reproducibility, and scalability. However, realizing this vision requires addressing the diversity of biological research, the iterative nature of experimental design, and the technical and ethical challenges of integrating AI into laboratory workflows. The AI-driven laboratory: a vision for automation In the envisioned AI-driven laboratory, intelligent agents operate across all stages of the experimental workflow[ 66 67 68 69 70 29 Types of experiments amenable to automation While the potential of AI-driven laboratories is immense, it is important to recognize that biological research is highly diverse, and not all experiments are equally suited to automation. High-throughput approaches, such as multi-omics profiling, are particularly well-suited for automation due to their parallelizable nature and reliance on large-scale data generation [ 71 29 72 Moreover, the iterative nature of biological research poses a unique challenge for automation. Experimental design often depends on the results of prior experiments, requiring a feedback loop where hypotheses are refined and protocols are adjusted based on new data. AI agents can play a critical role in this process by rapidly analyzing results, suggesting modifications, and optimizing experimental parameters in real-time. However, this requires robust integration between AI systems and laboratory equipment, as well as the ability to adapt to unexpected outcomes [ 73 Multi-agent systems: collaboration and scalability A key development in this paradigm is the use of multi-agent systems, where multiple AI agents collaborate to accomplish complex tasks. In such systems, each agent focuses on a specific aspect of the research process, such as data collection, analysis, or resource management. For instance, one agent may preprocess data from biological samples, while another runs machine learning algorithms to identify key biomarkers, and yet another optimizes experimental protocols in real-time. This collaborative approach allows for the efficient execution of multifaceted research tasks that would be impossible for a single agent to accomplish in isolation. Multi-agent systems also enhance the adaptability of the research process. As new challenges or research questions arise, agents can autonomously adjust their behavior or cooperate to address emerging issues without significant human intervention. This adaptability is particularly valuable in dynamic research environments, where experimental conditions and objectives may evolve over time. Technical challenges and solutions Despite the promise of AI-driven laboratories, several technical challenges must be addressed to realize their full potential. One major challenge is the integration and standardization of diverse AI systems [ 74 75 Another challenge is the integration of AI agents with physical laboratory equipment. Ensuring that AI systems can control and interact with devices such as robotic arms, sensors, and microscopes requires robust hardware-software interfaces and real-time feedback mechanisms. Advances in the Internet of Things (IoT) and edge computing may provide solutions to these challenges, enabling seamless communication between AI agents and laboratory devices. Ethical and regulatory considerations The adoption of AI-driven laboratories also raises important ethical and regulatory questions. Issues such as data privacy, the interpretability of experimental results, and the transparency of AI decision-making must be carefully addressed. For example, AI-generated insights must be explainable and reproducible to maintain scientific rigor and public trust. Additionally, the use of AI in sensitive areas such as personalized medicine and genetic engineering requires robust ethical guidelines to prevent misuse and ensure equitable access to technological advancements. Implications for scientific discovery The implications of fully automated, multi-agent research environments are profound. By automating routine and labor-intensive tasks, researchers can focus on higher level scientific thinking and hypothesis generation. The speed and efficiency of AI-driven experiments would enable the exploration of previously infeasible research questions, accelerating the pace of scientific discovery. Moreover, the scalability of automated systems means that the volume and complexity of experiments that can be conducted would increase exponentially, potentially revolutionizing fields such as genomics, drug discovery, and personalized medicine. This new paradigm also has the potential to democratize access to cutting-edge experimental capabilities. Researchers with limited expertise in computational methods could harness the power of AI for their work, broadening participation in scientific research and accelerating progress across the biological sciences. By combining the strengths of AI-driven automation with human creativity and insight, the future of biological discovery holds unprecedented promise. Conclusion Agentic bioinformatics has emerged as a groundbreaking paradigm that integrates AI agents into the bioinformatics pipeline, ushering in a new era of precision, efficiency, and innovation in biological research. AI agents are now playing a key role in various aspects of bioinformatics, from data generation and experimental design to data analysis and interpretation. Their ability to autonomously perform complex tasks has the potential to drastically reduce human error, accelerate discovery, and enable researchers to address questions that were previously out of reach. This development marks a significant shift in how biological research is conducted, with AI agents now complementing, and in some cases replacing, traditional human-centered workflows. Despite the remarkable advancements, there remain significant challenges to overcome in the field of agentic bioinformatics. One of the primary hurdles is the continued improvement of AI agents’ intelligence and capabilities. Current systems often face limitations, such as biases in algorithms, poor-quality data, and challenges in generalizing across diverse biological contexts. Enhancing the robustness, adaptability, and accuracy of these AI systems will be critical in ensuring their reliability and scalability for a wide range of biological research applications. Additionally, as AI agents become more integral to bioinformatics, there is an increasing need for more advanced integration techniques that allow these systems to work seamlessly across various domains, from machine learning and data analysis to laboratory automation. The future of agentic bioinformatics also lies in fostering cross-disciplinary collaboration. The convergence of AI, computational biology, and experimental sciences is essential for advancing the field. Realizing the full potential of AI-driven research requires close collaboration among bioinformaticians, data scientists, experimental biologists, and AI experts. This collaboration must ensure AI systems incorporate biological understanding while experimental workflows optimize AI agents’ utilization. This collaborative effort will be pivotal in overcoming the current technological limitations and will lead to the development of more intuitive, flexible, and powerful systems. Looking ahead, we can anticipate that AI agents will become increasingly ubiquitous in bioinformatics over the next few years. As the technology continues to evolve, the role of AI agents in the field will expand from supporting individual tasks to orchestrating entire research workflows, leading to a future where end-to-end automated biological discovery is a reality. This evolution will likely revolutionize not only research but also clinical applications, particularly in areas like personalized medicine, drug discovery, and disease modeling. By automating complex processes and offering more precise, data-driven insights, AI agents will empower researchers to make faster and more informed decisions, ultimately leading to breakthroughs that have profound implications for human health and our understanding of biology. In conclusion, agentic bioinformatics holds great promise, but achieving its full potential will require overcoming technical, ethical, and collaborative challenges. As AI technologies advance and integrate further into biological research, the field will undoubtedly experience a transformation. AI agents will play a critical role in the next wave of scientific discovery and clinical innovation. Key Points  Agentic bioinformatics  Agentic bioinformatics  Agentic bioinformatics personalized medicine, drug discovery, and synthetic biology This review outlines key technical, ethical, and scalability challenges, emphasizing the need for robust infrastructure and responsible deployment of agentic systems. Author contributions Juexiao Zhou (Conceptualization, Writing—original draft, Writing—review & editing), Jindong Jiang (Writing—original draft, Writing—review & editing), Zhongyi Han (Writing—original draft, Writing—review & editing), Zijian Wang (Writing—review & editing), and Xin Gao (Conceptualization, Writing—original draft, Writing—review & editing) Conflict of interest: The authors have declared no competing interests. Funding This work is supported by the King Abdullah University of Science and Technology (KAUST) Office of Research Administration (ORA) under Award No REI/1/5234-01-01, REI/1/5414-01-01, REI/1/5289-01-01, REI/1/5404-01-01, REI/1/5992-01-01, URF/1/4663-01-01, Center of Excellence for Smart Health (KCSH), under award number 5932, and Center of Excellence on Generative AI, under award number 5940. This work is supported by The Chinese University of Hong Kong, Shenzhen (CUHK-Shenzhen), under Award No UDF01004172. Data availability No new data were generated or analysed in support of this research. References 1. Ouzounis CA Valencia A Early bioinformatics: the birth of a discipline—a personal view Bioinformatics 2003 19 2176 90 10.1093/bioinformatics/btg309 14630646 2. Hesper B Hogeweg P Bioinformatica: Een werkconcept Kameleon 1970 1 28 9 3. Shendure J Balasubramanian S Church GM et al DNA sequencing at 40: past, present and future Nature 2017 550 345 53 10.1038/nature24286 29019985 4. Jeanmougin F Thompson JD Gouy M et al Multiple sequence alignment with Clustal x Trends Biochem Sci 1998 23 403 5 10.1016/S0968-0004(98)01285-7 9810230 5. Werrett DJ The national DNA database Forensic Sci Int 1997 88 33 42 10.1016/S0379-0738(97)00081-9 6. Hubbard T Barker D Birney E et al The Ensembl genome database project Nucleic Acids Res 2002 30 38 41 10.1093/nar/30.1.38 11752248 PMC99161 7. Vihinen M Bioinformatics in proteomics Biomol Eng 2001 18 241 8 10.1016/S1389-0344(01)00099-5 11911091 8. Min S Lee B Yoon S Deep learning in bioinformatics Brief Bioinform 2017 18 851 69 10.1093/bib/bbw068 27473064 9. Gauthier J Vincent AT Charette SJ et al A brief history of bioinformatics Brief Bioinform 2019 20 1981 96 10.1093/bib/bby063 30084940 10. Procopio A Cesarelli G Donisi L et al Combined mechanistic modeling and machine-learning approaches in systems biology—a systematic literature review Comput Methods Programs Biomed 2023 240 107681 10.1016/j.cmpb.2023.107681 37385142 11. Zhang S Fan R Liu Y et al Applications of transformer-based language models in bioinformatics: a survey Bioinf Adv 2023 3 vbad001 10.1093/bioadv/vbad001 PMC9950855 36845200 12. Guo Z Liu J Wang Y et al Diffusion models in bioinformatics and computational biology Nat Rev Bioeng 2024 2 136 54 10.1038/s44222-023-00114-9 38576453 PMC10994218 13. Ramsden J Bioinformatics: An Introduction Springer Nature 2023 10.1007/978-3-030-45607-8 14. LeCun Y Bengio Y Hinton G Deep learning Nature 2015 521 436 44 10.1038/nature14539 26017442 15. Cao Y Geddes TA Yang JYH et al Ensemble deep learning in bioinformatics Nat Mach Intell 2020 2 500 8 10.1038/s42256-020-0217-y 16. Le NQK Leveraging transformers-based language models in proteome bioinformatics Proteomics 2023 23 2300011 10.1002/pmic.202300011 37381841 17. Tran T-O Le NQK Sa-TTCA: an SVM-based approach for tumor t-cell antigen classification using features extracted from biological sequencing and natural language processing Comput Biol Med 2024 174 108408 10.1016/j.compbiomed.2024.108408 38636332 18. Zhou J Li H Chen S et al Large language models in biomedicine and healthcare Caduceus 29 77 19. Cheng Y Zhang C Zhang Z et al Exploring large language model based intelligent agents: definitions, methods, and prospects 2024 https://arxiv.org/abs/2401.03428 20. Qiu J Lam K Li G et al LLM-based agentic systems in medicine and healthcare Nat Mach Intell 2024 6 1418 20 10.1038/s42256-024-00944-1 21. Gao S Fang A Huang Y et al Empowering biomedical discovery with ai agents Cell 2024 187 6125 51 10.1016/j.cell.2024.09.022 39486399 22. N. O. Committee Nettab 2001 Workshop on Agents in Bioinformatics http://www.nettab.org/2001/progr.html 2001 (12 July 2024, date last accessed) 23. N. O. Committee Nettab 2002 Workshop: Agents in Bioinformatics http://www.nettab.org/2002/ 2002 (12 July 2024, date last accessed) 24. Merelli E Armano G Cannata N et al Agents in bioinformatics, computational and systems biology Brief Bioinform 2007 8 45 59 10.1093/bib/bbl014 16772270 25. Maestri S Merelli E Pettini M Agent-based models for detecting the driving forces of biomolecular interactions Sci Rep 2022 12 1878 10.1038/s41598-021-04205-8 35115584 PMC8814177 26. Oinn T Addis M Ferris J et al Taverna: a tool for the composition and enactment of bioinformatics workflows Bioinformatics 2004 20 3045 54 10.1093/bioinformatics/bth361 15201187 27. Köster J Rahmann S Snakemake—a scalable bioinformatics workflow engine Bioinformatics 2012 28 2520 2 10.1093/bioinformatics/bts480 22908215 28. Wratten L Wilm A Göke J Reproducible, scalable, and shareable analysis pipelines with bioinformatics workflow managers Nat Methods 2021 18 1161 8 10.1038/s41592-021-01254-9 34556866 29. Zhou J Zhang B Li G et al An AI agent for fully automated multi-omic analyses Adv Sci 2024 11 e2407094 10.1002/advs.202407094 PMC11600294 39361263 30. Hu G Liu L Xu D On the responsible use of chatbots in bioinformatics Genomics Proteomics Bioinf 2024 22 qzae002 10.1093/gpbjnl/qzae002 PMC11104453 38862428 31. Dong Z Zhou H Jiang Y et al Simplifying bioinformatics data analysis through conversation [Online]. Available: 10.1101/2023.10.29.564479 32. Xin Q Kong Q Ji H et al Bioinformatics agent (BIA): unleashing the power of large language models to reshape bioinformatics workflow [Online]. Available: 10.1101/2024.05.22.595240 33. Pickard J Prakash R Choi MA et al Automatic biomarker discovery and enrichment with BRAD Bioinformatics 2025 41 btaf159 10.1093/bioinformatics/btaf159 40323323 PMC12064167 34. Nana Teukam YG Grisoni F Manica M A language model assistant for biocatalysis [Online]. Available: 10.1101/2024.11.15.623739 35. Qu Y Huang K Cousins H et al CRISPR-GPT: an LLM agent for automated design of gene-editing experiments [Online]. Available: 10.1101/2024.04.25.591003 36. Wang H He Y Coelho PP et al SpatialAgent: an autonomous AI agent for spatial biology bioRxiv 2025 [Online]. Available: https://www.biorxiv.org/content/early/2025/04/06/2025.04.03.646459 37. Xiao Y Liu J Zheng Y et al CellAgent: an LLM-driven multi-agent framework for automated single-cell data analysis [Online]. Available: 10.1101/2024.05.13.593861 38. Su H Long W Zhang Y BioMaster: multi-agent system for automated bioinformatics analysis workflow bioRxiv 2025 [Online]. Available: https://www.biorxiv.org/content/early/2025/01/26/2025.01.23.634608 39. Liu Y Shen R Zhou L et al A data-intelligence-intensive bioinformatics copilot system for large-scale omics researches and scientific insights [Online]. Available: 10.1101/2024.05.19.594895 PMC12245162 40639418 40. Ghafarollahi A Buehler MJ ProtAgents: protein discovery via large language model multi-agent collaborations combining physics and machine learning [Online]. Available: http://arxiv.org/abs/2402.04268 10.1039/d4dd00013g PMC11235180 38993729 41. Swanson K Wu W Bulaong NL et al The virtual lab: AI agents design new SARS-CoV-2 nanobodies with experimental validation [Online]. Available: 10.1101/2024.11.11.623004 40730228 42. Long RA Ballard S Shah S et al A new AI-assisted data standard accelerates interoperability in biomedical research medRxiv 2024 2024 10 43. Li Y Wu F-X Ngom A A review on machine learning principles for multi-view biological data integration Brief Bioinform 2018 19 325 40 10.1093/bib/bbw113 28011753 44. Sharifi-Noghabi H Harjandi PA Zolotareva O et al Out-of-distribution generalization from labelled and unlabelled gene expression data for drug response prediction Nat Mach Intell 2021 3 962 72 10.1038/s42256-021-00408-w 45. Su W Wang F Han Z et al Transferable discriminative learning for medical open-set domain adaptation: application to pneumonia classification 2022 IEEE International Conference on Bioinformatics and Biomedicine (BIBM) 1185 92 IEEE 2022 https://ieeexplore.ieee.org/abstract/document/9995571?casa_token=ZatKpLwZ54kAAAAA:etv6t-RMBQ-3xiH8ZJdMKrxkz_esbkNIQcpTEoeRgVQD27nGnKamXEgJzq9-BOQPB1iwV2_B4gRn 46. He R Han Z Nie X et al Visual out-of-distribution detection in open-set noisy environments Int J Comput Vision 2024 132 5453 70 10.1007/s11263-024-02139-y 47. Han Z Zhou G He R et al How well does GPT-4V (ision) adapt to distribution shifts? A preliminary investigation 2023 48. Liévin V Hother CE Motzfeldt AG et al Can large language models reason about medical questions? Patterns 2024 5 100943 10.1016/j.patter.2024.100943 38487804 PMC10935498 49. Ji Z Lee N Frieske R et al Survey of hallucination in natural language generation ACM Comput Surv 2023 55 1 38 10.1145/3571730 50. Lewis P Perez E Piktus A et al Retrieval-augmented generation for knowledge-intensive NLP tasks Advances in neural information processing systems 2020 33 9459 74 https://proceedings.neurips.cc/paper/2020/hash/6b493230205f780e1bc26945df7481e5-Abstract.html 51. Ghafarollahi A Buehler MJ ProtAgents: protein discovery via large language model multi-agent collaborations combining physics and machine learning Digital Discovery 2024 3 1389 409 10.1039/D4DD00013G 38993729 PMC11235180 52. Mehrabi N Morstatter F Saxena N et al A survey on bias and fairness in machine learning ACM Comput Surv 2021 54 1 35 10.1145/3457607 53. Gurdasani D Barroso I Zeggini E et al Genomics of disease risk in globally diverse populations Nat Rev Genet 2019 20 520 35 10.1038/s41576-019-0144-0 31235872 54. Jiang J Lu Z Learning fairness in multi-agent systems Advances in Neural Information Processing Systems 2019 32 https://proceedings.neurips.cc/paper_files/paper/2019/hash/10493aa88605cad5ab4752b04a63d172-Abstract.html 55. Duddu V A survey of adversarial machine learning in cyber warfare Def Sci J 2018 68 356 10.14429/dsj.68.12371 56. Al-Rubaie M Chang JM Privacy-preserving machine learning: threats and solutions IEEE Security Privacy 2019 17 49 58 10.1109/MSEC.2018.2888775 57. Cho H Wu DJ Berger B Secure genome-wide association analysis using multiparty computation Nat Biotechnol 2018 36 547 51 10.1038/nbt.4108 29734293 PMC5990440 58. Chen Z Wei L Gao G Foundation models for bioinformatics Quant Biol 2024 12 339 44 10.1002/qub2.69 59. Dwivedi K Rajpal A Rajpal S et al An explainable AI-driven biomarker discovery framework for non-small cell lung cancer classification Comput Biol Med 2023 153 106544 10.1016/j.compbiomed.2023.106544 36652866 60. Lundberg S Lee S-I A unified approach to interpreting model predictions Advances in Neural Information Processing Systems 2017 30 https://proceedings.neurips.cc/paper/2017/hash/8a20a8621978632d76c43dfd28b67767-Abstract.html 61. Tao Y Ma X Palmer D et al Interpretable deep learning for chromatin-informed inference of transcriptional programs driven by somatic alterations across cancers Nucleic Acids Res 2022 50 10869 10.1093/nar/gkac881 36243974 PMC9638905 62. Jobin A Ienca M Vayena E The global landscape of AI ethics guidelines Nat Mach Intell 2019 1 389 99 10.1038/s42256-019-0088-2 63. Urbina F Lentzos F Invernizzi C et al Dual-use of artificial-intelligence-powered drug discovery Nat Mach Intelli 2022 4 189 91 10.1038/s42256-022-00465-9 PMC9544280 36211133 64. Park SY Kuo P-Y Barbarin A et al Identifying challenges and opportunities in human-AI collaboration in healthcare Companion Publication of the 2019 Conference on Computer Supported Cooperative Work and Social Computing 506 10 2019 https://dl.acm.org/doi/abs/10.1145/3311957.3359433?casa_token=kfDuyl1xCgAAAAAA:vNJU_OTPsphSXmNkWG3DXkiUJqgJbTs0P_VdzAWwpLHjlU3ZazdlGV_pMiHaYh6lK8w8MCzZff6N 65. Zednik C Boelsen H Scientific exploration and explainable artificial intelligence Minds Mach 2022 32 219 39 10.1007/s11023-021-09583-6 66. O’Neill S AI-driven robotic laboratories show promise Engineering 2021 7 1351 3 10.1016/j.eng.2021.08.006 67. C. Science T. Board E. National Academies of Sciences AI-enabled biological design and the risks of synthetic biology The Age of AI in the Life Sciences: Benefits and Biosecurity Considerations National Academies Press (US) 2025 40392968 68. Roohani Y Lee A Huang Q et al Biodiscoveryagent: An AI agent for designing genetic perturbation experiments 2024 69. Swanson K Wu W Bulaong NL et al The virtual lab: AI agents design new SARS-CoV-2 nanobodies with experimental validation bioRxiv 2024 2024 10.1038/s41586-025-09442-9 40730228 70. Khan SU Møller VK Frandsen RJN et al Real-time AI-driven quality control for laboratory automation: a novel computer vision solution for the opentrons OT-2 liquid handling robot Appl Intell 2025 55 1 14 10.1007/s10489-025-06334-3 71. Yetgin A Revolutionizing multi-omics analysis with artificial intelligence and data processing Quant Biol 2025 13 e70002 10.1002/qub2.70002 72. Zhang G Song C Liu L et al TransAgent: dynamizing transcriptional regulation analysis via multi-omics-aware AI agent bioRxiv 2025 2025 04 73. Adam D The automated lab of tomorrow Proc Natl Acad Sci 2024 121 e2406320121 10.1073/pnas.2406320121 38630717 PMC11046582 74. Golenkov V Guliakina N Golovko V et al Artificial intelligence standardization is a key challenge for the technologies of the future International Conference on Open Semantic Technologies for Intelligent Systems 1 21 Springer 2020 10.1007/978-3-030-60447-9_1 75. Hou X Zhao Y Wang S et al Model context protocol (MCP): landscape, security threats, and future research directions 2025 ",
  "metadata": {
    "Title of this paper": "Model context protocol (MCP): landscape, security threats, and future research directions",
    "Journal it was published in:": "Briefings in Bioinformatics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476841/"
  }
}