{
  "title": "Paper_210",
  "abstract": "pmc Cell Commun Signal Cell Commun Signal 221 cellcom Cell Communication and Signaling : CCS 1478-811X BMC PMC12490064 PMC12490064.1 12490064 12490064 41035012 10.1186/s12964-025-02416-4 2416 1 Review Review: Progress of the NLRP3 inflammasome in tumours and perspectives for cholangiocarcinoma Zhuo Zhaoqin 1 Xie Yuwei 1 Zou Hao 1 Tan Bin 1 Dong Qian 2 3 Dong Bingzi dongbingzi@qdu.edu.cn 2 4 Zhu Chengzhan zhuchengz@qduhospital.cn 1 2 1 https://ror.org/026e9yy16 grid.412521.1 0000 0004 1769 1119 Department of Hepatobiliary and Pancreatic Surgery, The Affiliated Hospital of Qingdao University, 2 https://ror.org/026e9yy16 grid.412521.1 0000 0004 1769 1119 Shandong Key Laboratory of Digital Medicine and Computer Assisted Surgery, The Affiliated Hospital of Qingdao University, 3 https://ror.org/026e9yy16 grid.412521.1 0000 0004 1769 1119 Department of Pediatric Surgery, The Affiliated Hospital of Qingdao University, 4 https://ror.org/026e9yy16 grid.412521.1 0000 0004 1769 1119 Department of Endocrinology and Metabolism, The Affiliated Hospital of Qingdao University, 2 10 2025 2025 23 478354 405 28 5 2025 23 8 2025 02 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ The NLRP3 inflammasome is a multi-protein complex that mediates intense inflammatory responses. Its activation and function are influenced by various factors, including the recognition of pathogen-associated molecular patterns and damage-associated molecular patterns, cellular stress responses, and metabolic disorders. Recent research has extensively studied the role of the NLRP3 inflammasome in tumors. Findings indicate that tumor cells and macrophages can regulate the activation of the NLRP3 inflammasome, promoting tumor development and progression. Conversely, the NLRP3 inflammasome can also exhibit anti-tumor effects through immune cells, such as dendritic cells. This has led to the development of treatment strategies, creating a comprehensive treatment system that includes sensitizers for radiotherapy and chemotherapy, inhibitors of the NLRP3 inflammasome pathway, and direct targeting of the NLRP3 inflammasome.Cholangiocarcinoma is a highly invasive and heterogeneous malignant tumor. Due to its non-specific symptoms, patients often present with advanced stages of the disease, and the mortality rate continues to rise annually. A deeper exploration of the mechanisms underlying cholangiocarcinoma’s occurrence and development is essential for improving diagnosis and treatment strategies. The application of multi-omics analysis in cholangiocarcinoma research lays a foundation for understanding its pathogenesis and potential treatments. This article systematically reviews the latest advancements in NLRP3 inflammasome research, including its regulatory mechanisms, role in promoting tumor development, and effects in anti-tumor immunotherapy. Additionally, by summarizing the mechanisms involved in cholangiocarcinoma, we hypothesize that the NLRP3 inflammasome may play a significant role in the occurrence and development of cholangiocarcinoma. Therefore, we conduct a multi-angle analysis of the potential relationship between the two and propose a hypothesis model. The goal of this article is to explore the role of the NLRP3 inflammasome in tumors and its potential relationship with cholangiocarcinoma, offering new insights for research on the link between cholangiocarcinoma-related inflammation and the disease itself. Keywords NLRP3 inflammasome Cholangiocarcinoma Tumour Inflammation and cancer transformation https://doi.org/10.13039/501100001809 National Natural Science Foundation of China 82370890 Dong Bingzi Taishan Scholars Program of Shandong Province 2019010668 Zhu Chengzhan https://doi.org/10.13039/501100007129 Natural Science Foundation of Shandong Province ZR2021MH171 Zhu Chengzhan Shandong Higher Education Young Science and Technology Support Program 2020KJL005 Zhu Chengzhan pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction More than a century ago, Rudolf Virchow observed white blood cells in tumour tissue and first proposed a link between inflammation and cancer [ 1 2 3 4 In 2002, Martinon et al. first proposed the concept of the inflammasome [ 5 6 8 9 11 12 13 14 15 Cholangiocarcinoma (CCA) can be categorized based on its anatomical location into three types: intrahepatic Cholangiocarcinoma (iCCA), perihilar Cholangiocarcinoma (pCCA), and distal Cholangiocarcinoma (dCCA). Typically, pCCA and dCCA are considered forms of extrahepatic Cholangiocarcinoma (eCCA) [ 16 17 18 20 21 This article summarizes the latest research on the NLRP3 inflammasome, exploring its regulatory mechanisms, its role in promoting tumor development, and its implications for anti-tumor immunotherapy. By examining the effects of factors such as the nuclear factor-kappa B (NF-κB) pathway, phosphatase and tensin homolog (PTEN) deficiency, cholangitis, and bile acid stasis on CCA progression, we propose that the NLRP3 inflammasome may be crucial in the development of cholangiocarcinoma. Hence, we conducted an in-depth analysis of the relationship between these factors and suggested a hypothesis model. This article aims to investigate the role of the NLRP3 inflammasome in tumors and its potential connection to cholangiocarcinoma, offering new insights into the transition from cholangial inflammation to cholangiocarcinoma. Recent advances in the assembly, activation, and regulation of the NLRP3 inflammasome The structure of the NLRP3 inflammasome has been detailed in several excellent reviews. Thus, we will briefly describe its structure and summarize the latest advancements in its assembly, activation, and regulation. The NLRP3 inflammasome is a trimeric protein complex made up of NLRP3, apoptosis-associated speck-like protein containing a CARD (ASC), and Pro-caspase-1 [ 22 23 24 24 25 26 27 27 Although NLRP3 is expressed in various cells, its expression level is relatively low in the resting state [ 28 28 29 29 29 + 30 30 31 1  Fig. 1 The role of NLRP3 in the assembly and activation of inflammasomes. NLRP3 is upregulated and oligomerised to form an open octameric structure. NEK7 forms a NEK7/NLRP3 complex with NLRP3 in a dimer/monomer equilibrium state, promoting assembly of the NLRP3 inflammasome. The formation of GSDMD pores and the outward flow of K + The function of the NLRP3 inflammasome is heavily influenced by its activators. The primary activators of NLRP3 disrupt the membrane contact sites between the endoplasmic reticulum(ER) and endosomes (EECS) and impair the trafficking of endosomes to the trans-Golgi network (ETT). This disruption leads to the accumulation of phosphatidylinositol 4-phosphate (PI4P) within the endosome [ 32 32 34 35 36 36 36 37 2+ 37 2+ 37 The initiation and assembly of the NLRP3 inflammasome are tightly regulated by various post-translational modifications (PTMs), such as acetylation, phosphorylation, and palmitoylation [ 38 40 41 41 2 In summary, the combination of these studies elucidates the molecular mechanisms involved in the composition and activation of the NLRP3 inflammasome, providing a valuable theoretical foundation for understanding the pathological mechanisms of diseases and guiding targeted treatments.  Fig. 2 The NLRP3 inflammasome’s regulatory mechanism. During the initiation stage, the NACHT domain of NLRP3 undergoes UFMization, which maintains the stability of NLRP3 by inhibiting its ubiquitination and autophagic degradation, while also activating the NLRP3 inflammasome through two separate signals. Additional signals: NLRP3 activators induce dissociation of HK2 and promote oligomerisation of VDAC and release of mtDNA through the ER pathway, thereby recruiting NLRP3 to VDAC. Meanwhile, NLRP3 is activated by PI4P and transported to the MTOC, where it interacts with NEK7 to form the NLRP3 inflammasome. Mitochondrial signals: NLRP3 activators inhibit the OXPHOS pathway, suppress apoptosis and act with additional signals to activate the NLRP3 inflammasome NLRP3 inflammasome and tumours Recent studies have shown that the NLRP3 inflammasome is a double-edged sword that can both promote tumour development and exert anti-tumour protective effects. We will now explore the tumour-promoting and anti-tumour mechanisms of the NLRP3 inflammasome in tumours. The tumourigenic mechanism of the NLRP3 inflammasome Matusiak M was the first to demonstrate, through histological analysis, that the NLRP3 inflammasome aggregates in human cancers. NLRP3 + 42 43 44 45 46 47 47 48 49 50 5 Classical cancer genes also correlate highly with the activation of the NLRP3 inflammasome. One study found that the deficiency of the breast cancer susceptibility gene 1 (BRCA1) upregulated the expression of mitofusin 1/2 (MFN1/2), causing mitochondrial dynamics dysfunction. This deficiency also inhibited mitochondrial division, disrupted stress-induced mitochondrial autophagy, and triggered NLRP3 inflammasome activation, creating a tumor-related microenvironment that promotes tumor proliferation and metastasis [ 51 52 53 53 Inhibiting the assembly and activation of the NLRP3 inflammatory body also exacerbates tumor progression. It was found that overexpression of Snail in lung cancer cells can induce epithelial-mesenchymal transition (EMT) in cancer cells, and then deliver miR-21 through exosomes to tumor-associated macrophages, promoting the M2-like polarization of macrophages [ 54 55 54 56 2+ 57 3 1 In conclusion, we believe that the role of the NLRP3 inflammasome in tumor progression is indispensable, and its specific effect depends on the tumor type, microenvironment status, and molecular interaction network. Targeted regulation of the NLRP3 inflammasome is expected to become a new strategy for cancer treatment, but it needs to be intervened in combination with specific pathological backgrounds.  Fig. 3 Mechanism diagram of how the NLRP3 inflammasome promotes tumor development  Table 1 The NLRP3 inflammasome promotes tumor progression Type of cancer Mechanism Effect on tumor References Colon Cancer Activate the NLRP3 inflammasome in tumors promoting effect [ 42 Lung Cancer Activate the NLRP3 inflammasome of M2 type macrophages promoting effect [ 43 MM β2m activates the NLRP3 inflammasome promoting effect [ 44 Breast Cancer Disruption of the balance between mitochondrial autophagy and NLRP3 inflammasome promoting effect [ 45 51 Lymphoma The NLRP3 inflammasome upregulates the expression of PD-L1 promoting effect [ 46 Liver Cancer Activate the NF-ΚB-NLRP3 inflammasome pathway promoting effect [ 47 48 Pancreatic Cancer Activate the TLR4-NLRP3 inflammasome pathway promoting effect [ 49 Pancreatic Cancer Depletion of TREM2 promotes the NLRP3 inflammasome promoting effect [ 50 Leukemia Activate the RAC1/ROS/NLRP3/IL-1β axis promoting effect [ 52 Lung Cancer Melanoma The PML-P2 × 7R-NLRP3 axis has been disrupted. promoting effect [ 53 HNSCC Breast Cancer miR-21 promotes the phosphorylation of NLRP3 and the lysine-63 ubiquitination process. promoting effect [ 54 Endometrial Carcinoma Inhibit the Caspase-1/GSDMD pathway promoting effect [ 56 Liver Cancer Inhibit the activation of the NLRP3 inflammasome promoting effect [ 57 Colorectal Cancer Hexokinase 2 inhibits the activation of NLRP3 inflammasome promoting effect [ 58 Colorectal Cancer 5-Hydroxytryptamine enhances the activation of NLRP 3 inflammasome promoting effect [ 59 OSCC IL-6 regulates the JAK 2/STAT 3/Sox 4/NLRP3 axis promoting effect [ 60 Breast Cancer Melanoma The S1PR1/C3/PPIL1/NLRP3 pathway promoting effect [ 61 Breast Cancer Activation of NLRP3 in astrocytes promoting effect [ 62 Colorectal Cancer Alu RNA activates the NLRP3 inflammasome promoting effect [ 63 Note:To enhance readers’ understanding of the role of the NLRP3 inflammasome in tumor development, this table summarizes not only the literature discussed in the main text but also includes additional studies that were not covered in that section The anti-tumour mechanism of the NLRP3 inflammasome The activation of the NLRP3 inflammasome plays a crucial role in regulating the anti-tumor immune response. Research has shown that tumor-associated macrophages can upregulate CD146 during short-term stimulation, which inhibits the expression of the transmembrane protein 176B (TMEM176B). This process subsequently promotes the activation of the NLRP3 inflammasome, thereby enhancing anti-tumor immunity [ 64 65 65 + 66 67 67 68 69 70 70 4 2 In summary, it is evident that the activation of the NLRP3 inflammasome in various immune cells can lead to significant anti-tumor effects. Additionally, regulating the structural composition of the NLRP3 inflammasome to influence its function is an important aspect of its anti-tumor mechanism. Combining NLRP3 inflammasome regulation with other tumor treatments can help in designing more effective tumor treatment strategies targeting NLRP3.  Fig. 4 Mechanism diagram of NLRP3 inflammasome’s role in preventing tumor development  Table 2 Anti-tumor mechanisms of the NLRP3 inflammasome Type of cancer Mechanism Effect on tumor References Liver Cancer Inhibit the expression of TMEM176B and activate the NLRP3 inflammasome suppressor effect [ 64 Colon Cancer Melanoma Radiation-induced activation of the NLRP3 inflammasome suppressor effect [ 65 Colon Cancer Melanoma Activate the NLRP3-IL-1β pathway of DCs suppressor effect [ 66 Lung cancer Colon cancer TIM-3 deletion activates the NLRP3 inflammasome suppressor effect [ 67 Lung Cancer MC activates the NLRP3 inflammasome suppressor effect [ 68 Colorectal Cancer NCF4 regulates ASC suppressor effect [ 70 The potential of the NLRP3 inflammasome as a therapy in cancer treatment The NLRP3 inflammasome plays a significant role in enhancing the sensitivity of tumors to radiotherapy and chemotherapy. R-spondin 3 (RSPO3), which is closely related to the Wnt/β-catenin pathway, is crucial in regulating radioresistance in non-small cell lung cancer (NSCLC) [ 71 72 73 73 74 5 Inhibitors of the NLRP3 inflammasome pathway exhibit promising anti-tumor effects. For instance, Sirtuin 7 (SIRT7) inhibits the assembly of the NLRP3 inflammasome and downregulates the activated ERK1/2 signaling pathway, thereby reversing acquired resistance to sorafenib [ 75 76 46 Immune checkpoint blockade therapy (ICB) has long garnered significant attention; however, it is often associated with drug resistance [ 77 77 78 79 3 Therefore, whether used as an adjunct to radiotherapy and chemotherapy or as an independent anti-tumor approach, the NLRP3 inflammasome demonstrates beneficial effects. The development of tumor-targeted treatments and drugs that focus on the NLRP3 inflammasome holds significant theoretical and practical importance.  Table 3 Therapeutic progress of NLRP3 inflammasome in tumor treatment Therapy methods Activation or inhibition of the NLRP3 inflammasome Type of cancer References RSPO3 upregulation Activation Lung Cancer [ 72 IRE1a inhibitor Activation Breast Cancer [ 73 TMZ Activation Glioblastoma [ 74 SIRT7 inhibitor Inhibition Liver Cancer [ 75 IL-1R inhibitor Inhibition CMML [ 76 Targeting NLRP3 Activation Lung Cancer Melanoma [ 77 Metal-ion-chelating phenylalanine nanostructures Activation Breast Cancer Colorectal Cancer [ 78 MDSC-targeting gold nanoparticles Inhibition Colon Cancer [ 79 tBSA/Cas9-PAR 2 Inhibition Breast Cancer [ 80 Bacopa monnieri Inhibition OSCC [ 81 Shuanghua decoction Activation Liver Cancer [ 82 Inflammasome-Activating Nanovaccine Activation Melanoma Liver Cancer [ 83 Hydroxyapatite nanoparticles Activation Colorectal Cancer [ 84 schottky heterojunction Activation OSCC [ 85 Novel Aryl Sulfonamide Derivatives Inhibition Melanoma [ 86 Golgi Apparatus-Targeted Photodynamic Therapy Activation Lung Cancer [ 87 Analysis of the potential relationship between cholangiocarcinoma and the NLRP3 inflammasome Progress in multimodal omics research on the microenvironment of cholangiocarcinoma In recent years, multi-omics analysis of the TME has emerged as a prominent area of research, particularly in cholangiocarcinoma. To better understand the heterogeneity of T cells in different subtypes of biliary tract cancer (BTC), Nie et al. conducted a systematic comparison of the transcriptomic characteristics of tumor-infiltrating T cells across three BTC subtypes: iCCA, eCCA, and gallbladder cancer. This analysis was performed at both the single-cell and spatial levels [ 88 4 + + + 88 89 90 91 + 91 92 92 93 94 95 96 NF-κB pathway NF-κB is a critical regulatory factor in inflammatory responses and plays a significant role in the development and progression of tumors [ 97 98 98 99 100 100 101 Current research indicates that the classical NF-κB-NLRP3 inflammasome pathway operates as follows: Various PAMPs and DAMPs bind to toll-like receptors (TLRs), activating the NF-κB pathway, which in turn promotes the transcription of NLRP3, Pro-IL-1β, and Pro-IL-18 [ 102 103 104 105 106 5 107  Fig. 5 Activation pattern diagram of the classical NF-κB-NLRP3 inflammasome signaling pathway PTEN PTEN is a tumor suppressor gene that frequently undergoes mutations in human cancers [ 108 109 109 110 111 111 112 112 112 Primary sclerosing cholangitis (PSC) PSC is a liver disease characterized by idiopathic bile duct inflammation and fibrosis, leading to narrowing and damage of the bile ducts [ 113 114 115 116 114 117 118 119 Bile acid CCA, a malignant tumor that originates in the bile duct, is closely associated with the accumulation of bile acids [ 120 121 2+ 122 124 The possible role of NLRP3 inflammasome in the occurrence and development of cholangiocarcinoma In the previous section, we summarized the “double-edged sword” role of the NLRP3 inflammasome in tumor progression. We discussed the risk factors that contribute to CCA and the various mechanisms by which inflammatory factors, such as NF-κB, are involved in the progression of CCA. Additionally, we provided an in-depth analysis of the CCA microenvironment through multi-omics approaches. Bile acid accumulation and PSC promote the development of CCA via the NLRP3 inflammasome. In biliary epithelial cells affected by PSC, the expression of TLRs is increased. Under continuous stimulation from LPS and DNA fragments, the NLRP3 inflammasome is overly activated, resulting in heightened secretion of IL-1β and IL-18, which creates a chronic inflammatory environment. The accumulated bile acids act as typical DAMPs and continuously trigger the activation of the NLRP3 inflammasome in biliary epithelial cells through the NF-κB pathway(Figure 5 Macrophages can be classified into two types: M1, which have an anti-tumor phenotype, and M2, which have a pro-tumor phenotype [ 125 + We propose that the NLRP3 inflammasome may play a critical role in the processes of CCA occurrence and development based on these hypotheses. It is important to note that this hypothesis model is a reasoned speculation grounded in existing research and carries some ideal qualities. Further investigation by researchers is needed to verify the specific mechanisms involving the NLRP3 inflammasome in the development of CCA. Conclusion and prospects In this review, we have elaborated on the latest regulatory mechanisms of the NLRP3 inflammasome. Through a systematic analysis of recent research on the NLRP3 inflammasome in various TME states, we have revealed the complexity of its mechanisms and its “double-edged sword” effect on tumor development. Although the role of the NLRP3 inflammasome in CCA has not been extensively studied, preliminary evidence suggests relationships between the NLRP3 inflammasome and factors such as cholangitis, bile stasis, NF-κB, and PTEN. These factors are significant contributors to the development of CCA. Therefore, we believe there is a crucial connection between the NLRP3 inflammasome and the onset and progression of CCA. Further exploration of this relationship is important for understanding the transformation of cholangial inflammation into cholangiocarcinoma. Abbreviations PAMPs pathogen-associated molecular patterns DAMPs damage-associated molecular patterns CCA Cholangiocarcinoma iCCA intrahepatic Cholangiocarcinoma pCCA perihilar Cholangiocarcinoma dCCA distal Cholangiocarcinoma eCCA extrahepatic Cholangiocarcinoma PTEN phosphatase and tensin homolog ASC apoptosis-associated speck-like protein containing a CARD LRR leucine-rich repeat PYD N-terminal PYRIN domain CARD caspase recruitment domain GSDMD gasdermin D NEK7 NIMA-related kinase 7 JNK1 c-Jun N-terminal Kinase 1 LPS lipopolysaccharide EECS endoplasmic reticulum-endosome membrane contact sites ETT endosome-to-trans-Golgi network trafficking PI4P phosphatidylinositol 4-phosphate TGN trans-Golgi network MTOC microtubule-organizing center OXPHOS oxidative phosphorylation HK2 Hexokinase 2 VDAC voltage-dependent anion channel ER endoplasmic reticulum mtDNA mitochondrial DNA PTM post-translational modification UFM1 ubiquitin-fold modifier 1 MM Multiple Myeloma β2m β2-Microglobulin ROS reactive oxygen species ULK1 Unc-51 Like autophagy activating kinase 1 PD-L1 programmed death-ligand 1 CTL Cytotoxic T Lymphocyte HA hyaluronic acid S.maltophilia Stenotrophomonas maltophilia HSC hepatic stellate cells PSC pancreatic stellate cell TREM2 triggering receptor expressed on myeloid cells 2 BRCA1 The breast cancer susceptibility gene 1 MFN1/2 mitofusin1/2 MAMs mitochondria-associated endoplasmic reticulum membrane PML promyelocytic leukemia protein P2X7R P2X7 receptor EMT epithelial-mesenchymal transition ERRα estrogen-related receptor α Sorcin Soluble resistance-related calcium-binding protein TMEM176B transmembrane protein 176B DC dendritic cells TIM-3 T cell immunoglobulin and mucin-containing molecule 3 MC mast cells RSPO3 R-spondin 3 TMZ Temozolomide HMGB1 high mobility group box 1 protein RAGE receptor for advanced glycation end products SIRT7 Sirtuin 7 CMML chronic myelomonocytic leukemia ICB immune checkpoint blockade therapy 2GBI 2-guanidinobezimidazole TME tumor microenvironment BTC biliary tract cancer circRNA circular RNA LOX lysyl oxidase Traf3 TNF receptor-associated factor 3 NIK NF-κB-Inducing Kinase TLRs toll-like receptors TFEB transcription factor EB PRDX1 peroxiredoxin 1 Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Zhaoqin Zhuo and Yuwei Xie contributed equally to this work. Acknowledgements Not applicable. Authors’ contributions ZQZ: Writing – original draft, review and editingYWX: Writing – original draft HZ: Writing – original draft BT: Writing – original draft QD: Writing – review and editing BZD: Writing – review and editing CZZ: Writing – review and editing, study concept or design All authors reviewed the manuscript. Funding The study was supported by National Natural Science Foundation of China (Grant No. 82370890), Taishan Scholars Program of Shandong Province (grant number 2019010668 and NO. tsqn202312382), Natural Science Foundation of Shandong Province (grant number ZR2021MH171, ZR2023MH243), Shandong Higher Education Young Science and Technology Support Program (grant number 2020KJL005 and 2023KJ224). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Balkwill F Mantovani A Inflammation and cancer: back to virchow?? Lancet 2001 357 9255 539 45 10.1016/S0140-6736(00)04046-0 11229684 Balkwill F, Mantovani A. Inflammation and cancer: back to virchow?? Lancet. 2001;357(9255):539–45. 11229684 10.1016/S0140-6736(00)04046-0 2. Medzhitov R Origin and physiological roles of inflammation Nature 2008 454 7203 428 35 10.1038/nature07201 18650913 Medzhitov R. Origin and physiological roles of inflammation. Nature. 2008;454(7203):428–35. 18650913 10.1038/nature07201 3. Atretkhany KN Drutskaya MS Nedospasov SA Grivennikov SI Kuprash DV Chemokines, cytokines and exosomes help tumors to shape inflammatory microenvironment Pharmacol Ther 2016 168 98 112 10.1016/j.pharmthera.2016.09.011 27613100 Atretkhany KN, Drutskaya MS, Nedospasov SA, Grivennikov SI, Kuprash DV. Chemokines, cytokines and exosomes help tumors to shape inflammatory microenvironment. Pharmacol Ther. 2016;168:98–112. 27613100 10.1016/j.pharmthera.2016.09.011 4. Colotta F Allavena P Sica A Garlanda C Mantovani A Cancer-related inflammation, the seventh hallmark of cancer: links to genetic instability Carcinogenesis 2009 30 7 1073 81 10.1093/carcin/bgp127 19468060 Colotta F, Allavena P, Sica A, Garlanda C, Mantovani A. Cancer-related inflammation, the seventh hallmark of cancer: links to genetic instability. Carcinogenesis. 2009;30(7):1073–81. 19468060 10.1093/carcin/bgp127 5. Martinon F Burns K Tschopp J The inflammasome: a molecular platform triggering activation of inflammatory caspases and processing of proIL-beta Mol Cell 2002 10 2 417 26 10.1016/S1097-2765(02)00599-3 12191486 Martinon F, Burns K, Tschopp J. The inflammasome: a molecular platform triggering activation of inflammatory caspases and processing of proIL-beta. Mol Cell. 2002;10(2):417–26. 12191486 10.1016/s1097-2765(02)00599-3 6. Mariathasan S Weiss DS Newton K McBride J O’Rourke K Roose-Girma M Cryopyrin activates the inflammasome in response to toxins and ATP Nature 2006 440 7081 228 32 10.1038/nature04515 16407890 Mariathasan S, Weiss DS, Newton K, McBride J, O’Rourke K, Roose-Girma M, et al. Cryopyrin activates the inflammasome in response to toxins and ATP. Nature. 2006;440(7081):228–32. 16407890 10.1038/nature04515 7. Sutterwala FS Ogura Y Szczepanik M Lara-Tejero M Lichtenberger GS Grant EP Critical role for NALP3/CIAS1/cryopyrin in innate and adaptive immunity through its regulation of caspase-1 Immunity 2006 24 3 317 27 10.1016/j.immuni.2006.02.004 16546100 Sutterwala FS, Ogura Y, Szczepanik M, Lara-Tejero M, Lichtenberger GS, Grant EP, et al. Critical role for NALP3/CIAS1/cryopyrin in innate and adaptive immunity through its regulation of caspase-1. Immunity. 2006;24(3):317–27. 16546100 10.1016/j.immuni.2006.02.004 8. Kanneganti TD Ozören N Body-Malapel M Amer A Park JH Franchi L Bacterial RNA and small antiviral compounds activate caspase-1 through cryopyrin/Nalp3 Nature 2006 440 7081 233 6 10.1038/nature04517 16407888 Kanneganti TD, Ozören N, Body-Malapel M, Amer A, Park JH, Franchi L, et al. Bacterial RNA and small antiviral compounds activate caspase-1 through cryopyrin/Nalp3. Nature. 2006;440(7081):233–6. 16407888 10.1038/nature04517 9. Martinon F Pétrilli V Mayor A Tardivel A Tschopp J Gout-associated uric acid crystals activate the NALP3 inflammasome Nature 2006 440 7081 237 41 10.1038/nature04516 16407889 Martinon F, Pétrilli V, Mayor A, Tardivel A, Tschopp J. Gout-associated uric acid crystals activate the NALP3 inflammasome. Nature. 2006;440(7081):237–41. 16407889 10.1038/nature04516 10. Papin S Cuenin S Agostini L Martinon F Werner S Beer HD The SPRY domain of pyrin, mutated in Familial mediterranean fever patients, interacts with inflammasome components and inhibits proIL-1beta processing Cell Death Differ 2007 14 8 1457 66 10.1038/sj.cdd.4402142 17431422 Papin S, Cuenin S, Agostini L, Martinon F, Werner S, Beer HD, et al. The SPRY domain of pyrin, mutated in Familial mediterranean fever patients, interacts with inflammasome components and inhibits proIL-1beta processing. Cell Death Differ. 2007;14(8):1457–66. 17431422 10.1038/sj.cdd.4402142 11. Halle A Hornung V Petzold GC Stewart CR Monks BG Reinheckel T The NALP3 inflammasome is involved in the innate immune response to amyloid-beta Nat Immunol 2008 9 8 857 65 10.1038/ni.1636 18604209 PMC3101478 Halle A, Hornung V, Petzold GC, Stewart CR, Monks BG, Reinheckel T, et al. The NALP3 inflammasome is involved in the innate immune response to amyloid-beta. Nat Immunol. 2008;9(8):857–65. 18604209 10.1038/ni.1636 PMC3101478 12. Ghiringhelli F Apetoh L Tesniere A Aymeric L Ma Y Ortiz C Activation of the NLRP3 inflammasome in dendritic cells induces IL-1beta-dependent adaptive immunity against tumors Nat Med 2009 15 10 1170 8 10.1038/nm.2028 19767732 Ghiringhelli F, Apetoh L, Tesniere A, Aymeric L, Ma Y, Ortiz C, et al. Activation of the NLRP3 inflammasome in dendritic cells induces IL-1beta-dependent adaptive immunity against tumors. Nat Med. 2009;15(10):1170–8. 19767732 10.1038/nm.2028 13. Rathinam VA Fitzgerald KA Inflammasome complexes: emerging mechanisms and effector functions Cell 2016 165 4 792 800 10.1016/j.cell.2016.03.046 27153493 PMC5503689 Rathinam VA, Fitzgerald KA. Inflammasome complexes: emerging mechanisms and effector functions. Cell. 2016;165(4):792–800. 27153493 10.1016/j.cell.2016.03.046 PMC5503689 14. Huang Y Xu W Zhou R Nlrp3 inflammasome activation and cell death Cell Mol Immunol 2021 18 9 2114 27 10.1038/s41423-021-00740-6 34321623 PMC8429580 Huang Y, Xu W, Zhou R. Nlrp3 inflammasome activation and cell death. Cell Mol Immunol. 2021;18(9):2114–27. 34321623 10.1038/s41423-021-00740-6 PMC8429580 15. Sharma BR Kanneganti TD Nlrp3 inflammasome in cancer and metabolic diseases Nat Immunol 2021 22 5 550 9 10.1038/s41590-021-00886-5 33707781 PMC8132572 Sharma BR, Kanneganti TD. Nlrp3 inflammasome in cancer and metabolic diseases. Nat Immunol. 2021;22(5):550–9. 33707781 10.1038/s41590-021-00886-5 PMC8132572 16. Brindley PJ Bachini M Ilyas SI Khan SA Loukas A Sirica AE Cholangiocarcinoma Nat Rev Dis Primers 2021 7 1 65 10.1038/s41572-021-00300-2 34504109 PMC9246479 Brindley PJ, Bachini M, Ilyas SI, Khan SA, Loukas A, Sirica AE, et al. Cholangiocarcinoma. Nat Rev Dis Primers. 2021;7(1):65. 34504109 10.1038/s41572-021-00300-2 PMC9246479 17. Valle JW Kelley RK Nervi B Oh DY Zhu AX Biliary tract cancer Lancet 2021 397 10272 428 44 10.1016/S0140-6736(21)00153-7 33516341 Valle JW, Kelley RK, Nervi B, Oh DY, Zhu AX. Biliary tract cancer. Lancet. 2021;397(10272):428–44. 33516341 10.1016/S0140-6736(21)00153-7 18. Razumilava N Gores GJ Cholangiocarcinoma Lancet 2014 383 9935 2168 79 10.1016/S0140-6736(13)61903-0 24581682 PMC4069226 Razumilava N, Gores GJ. Cholangiocarcinoma. Lancet. 2014;383(9935):2168–79. 24581682 10.1016/S0140-6736(13)61903-0 PMC4069226 19. Yang H Li TW Peng J Tang X Ko KS Xia M A mouse model of cholestasis-associated cholangiocarcinoma and transcription factors involved in progression Gastroenterology 2011 141 1 378 88 10.1053/j.gastro.2011.03.044 21440549 PMC3129489 Yang H, Li TW, Peng J, Tang X, Ko KS, Xia M, et al. A mouse model of cholestasis-associated cholangiocarcinoma and transcription factors involved in progression. Gastroenterology. 2011;141(1):378–88. 88.e1-4. 21440549 10.1053/j.gastro.2011.03.044 PMC3129489 20. Clements O Eliahoo J Kim JU Taylor-Robinson SD Khan SA Risk factors for intrahepatic and extrahepatic cholangiocarcinoma: a systematic review and meta-analysis J Hepatol 2020 72 1 95 103 10.1016/j.jhep.2019.09.007 31536748 Clements O, Eliahoo J, Kim JU, Taylor-Robinson SD, Khan SA. Risk factors for intrahepatic and extrahepatic cholangiocarcinoma: a systematic review and meta-analysis. J Hepatol. 2020;72(1):95–103. 31536748 10.1016/j.jhep.2019.09.007 21. Nakagawa H Hayata Y Yamada T Kawamura S Suzuki N Koike K Peribiliary glands as the cellular origin of biliary tract cancer Int J Mol Sci 2018 10.3390/ijms19061745 29895797 PMC6032423 Nakagawa H, Hayata Y, Yamada T, Kawamura S, Suzuki N, Koike K. Peribiliary glands as the cellular origin of biliary tract cancer. Int J Mol Sci. 2018. 10.3390/ijms19061745. 29895797 10.3390/ijms19061745 PMC6032423 22. Seoane PI Lee B Hoyle C Yu S Lopez-Castejon G Lowe M The NLRP3-inflammasome as a sensor of organelle dysfunction J Cell Biol 2020 10.1083/jcb.202006194 33044555 PMC7543090 Seoane PI, Lee B, Hoyle C, Yu S, Lopez-Castejon G, Lowe M, et al. The NLRP3-inflammasome as a sensor of organelle dysfunction. J Cell Biol. 2020. 10.1083/jcb.202006194. 33044555 10.1083/jcb.202006194 PMC7543090 23. Toldo S Mezzaroma E Buckley LF Potere N Di Nisio M Biondi-Zoccai G Targeting the NLRP3 inflammasome in cardiovascular diseases Pharmacol Ther 2022 236 108053 10.1016/j.pharmthera.2021.108053 34906598 PMC9187780 Toldo S, Mezzaroma E, Buckley LF, Potere N, Di Nisio M, Biondi-Zoccai G, et al. Targeting the NLRP3 inflammasome in cardiovascular diseases. Pharmacol Ther. 2022;236:108053. 34906598 10.1016/j.pharmthera.2021.108053 PMC9187780 24. Zhen Y Zhang H NLRP3 inflammasome and inflammatory bowel disease Front Immunol 2019 10 276 10.3389/fimmu.2019.00276 30873162 PMC6403142 Zhen Y, Zhang H. NLRP3 inflammasome and inflammatory bowel disease. Front Immunol. 2019;10:276. 30873162 10.3389/fimmu.2019.00276 PMC6403142 25. Meyers AK Zhu X The NLRP3 inflammasome: metabolic regulation and contribution to inflammaging Cells 2020 10.3390/cells9081808 32751530 PMC7463618 Meyers AK, Zhu X. The NLRP3 inflammasome: metabolic regulation and contribution to inflammaging. Cells. 2020. 10.3390/cells9081808. 32751530 10.3390/cells9081808 PMC7463618 26. Paik S Kim JK Silwal P Sasakawa C Jo EK An update on the regulatory mechanisms of NLRP3 inflammasome activation Cell Mol Immunol 2021 18 5 1141 60 10.1038/s41423-021-00670-3 33850310 PMC8093260 Paik S, Kim JK, Silwal P, Sasakawa C, Jo EK. An update on the regulatory mechanisms of NLRP3 inflammasome activation. Cell Mol Immunol. 2021;18(5):1141–60. 33850310 10.1038/s41423-021-00670-3 PMC8093260 27. Fu J Wu H Structural mechanisms of NLRP3 inflammasome assembly and activation Annu Rev Immunol 2023 41 301 16 10.1146/annurev-immunol-081022-021207 36750315 PMC10159982 Fu J, Wu H. Structural mechanisms of NLRP3 inflammasome assembly and activation. Annu Rev Immunol. 2023;41:301–16. 36750315 10.1146/annurev-immunol-081022-021207 PMC10159982 28. Fu J Schroder K Wu H Mechanistic insights from inflammasome structures Nat Rev Immunol 2024 24 7 518 35 10.1038/s41577-024-00995-w 38374299 PMC11216901 Fu J, Schroder K, Wu H. Mechanistic insights from inflammasome structures. Nat Rev Immunol. 2024;24(7):518–35. 38374299 10.1038/s41577-024-00995-w PMC11216901 29. Yu X Matico RE Miller R Chauhan D Van Schoubroeck B Grauwen K Structural basis for the oligomerization-facilitated NLRP3 activation Nat Commun 2024 15 1 1164 10.1038/s41467-024-45396-8 38326375 PMC10850481 Yu X, Matico RE, Miller R, Chauhan D, Van Schoubroeck B, Grauwen K, et al. Structural basis for the oligomerization-facilitated NLRP3 activation. Nat Commun. 2024;15(1):1164. 38326375 10.1038/s41467-024-45396-8 PMC10850481 30. Xu J Zhang L Duan Y Sun F Odeh N He Y NEK7 phosphorylation amplifies NLRP3 inflammasome activation downstream of potassium efflux and gasdermin D Sci Immunol 2025 10 103 eadl2993 10.1126/sciimmunol.adl2993 39752537 PMC12020992 Xu J, Zhang L, Duan Y, Sun F, Odeh N, He Y, et al. NEK7 phosphorylation amplifies NLRP3 inflammasome activation downstream of potassium efflux and gasdermin D. Sci Immunol. 2025;10(103):eadl2993. 39752537 10.1126/sciimmunol.adl2993 PMC12020992 31. Zhang Z Chen C Liu C Sun P Liu P Fang S Isocyanic acid-mediated NLRP3 carbamoylation reduces NLRP3-NEK7 interaction and limits inflammasome activation Sci Adv 2025 11 10 eadq4266 10.1126/sciadv.adq4266 40053593 PMC11887815 Zhang Z, Chen C, Liu C, Sun P, Liu P, Fang S, et al. Isocyanic acid-mediated NLRP3 carbamoylation reduces NLRP3-NEK7 interaction and limits inflammasome activation. Sci Adv. 2025;11(10):eadq4266. 40053593 10.1126/sciadv.adq4266 PMC11887815 32. Zhang Z Venditti R Ran L Liu Z Vivot K Schürmann A Distinct changes in endosomal composition promote NLRP3 inflammasome activation Nat Immunol 2023 24 1 30 41 10.1038/s41590-022-01355-3 36443515 PMC9810532 Zhang Z, Venditti R, Ran L, Liu Z, Vivot K, Schürmann A, et al. Distinct changes in endosomal composition promote NLRP3 inflammasome activation. Nat Immunol. 2023;24(1):30–41. 36443515 10.1038/s41590-022-01355-3 PMC9810532 33. Andreeva L David L Rawson S Shen C Pasricha T Pelegrin P NLRP3 cages revealed by full-length mouse NLRP3 structure control pathway activation Cell 2021 184 26 6299 e31222 10.1016/j.cell.2021.11.011 34861190 PMC8763037 Andreeva L, David L, Rawson S, Shen C, Pasricha T, Pelegrin P, et al. NLRP3 cages revealed by full-length mouse NLRP3 structure control pathway activation. Cell. 2021;184(26):6299–e31222. 34861190 10.1016/j.cell.2021.11.011 PMC8763037 34. Chen J Chen ZJ PtdIns4P on dispersed trans-Golgi network mediates NLRP3 inflammasome activation Nature 2018 564 7734 71 6 10.1038/s41586-018-0761-3 30487600 PMC9402428 Chen J, Chen ZJ. PtdIns4P on dispersed trans-Golgi network mediates NLRP3 inflammasome activation. Nature. 2018;564(7734):71–6. 30487600 10.1038/s41586-018-0761-3 PMC9402428 35. Xiao L Magupalli VG Wu H Cryo-EM structures of the active NLRP3 inflammasome disc Nature 2023 613 7944 595 600 10.1038/s41586-022-05570-8 36442502 PMC10091861 Xiao L, Magupalli VG, Wu H. Cryo-EM structures of the active NLRP3 inflammasome disc. Nature. 2023;613(7944):595–600. 36442502 10.1038/s41586-022-05570-8 PMC10091861 36. Saller BS Wöhrle S Fischer L Dufossez C Ingerl IL Kessler S Acute suppression of mitochondrial ATP production prevents apoptosis and provides an essential signal for NLRP3 inflammasome activation Immunity 2025 58 1 90 e10711 10.1016/j.immuni.2024.10.012 39571574 Saller BS, Wöhrle S, Fischer L, Dufossez C, Ingerl IL, Kessler S, et al. Acute suppression of mitochondrial ATP production prevents apoptosis and provides an essential signal for NLRP3 inflammasome activation. Immunity. 2025;58(1):90–e10711. 39571574 10.1016/j.immuni.2024.10.012 37. Baik SH Ramanujan VK Becker C Fett S Underhill DM Wolf AJ Hexokinase dissociation from mitochondria promotes oligomerization of VDAC that facilitates NLRP3 inflammasome assembly and activation Sci Immunol 2023 8 84 eade7652 10.1126/sciimmunol.ade7652 37327321 PMC10360408 Baik SH, Ramanujan VK, Becker C, Fett S, Underhill DM, Wolf AJ. Hexokinase dissociation from mitochondria promotes oligomerization of VDAC that facilitates NLRP3 inflammasome assembly and activation. Sci Immunol. 2023;8(84):eade7652. 37327321 10.1126/sciimmunol.ade7652 PMC10360408 38. Zhang Y Luo L Xu X Wu J Wang F Lu Y Acetylation is required for full activation of the NLRP3 inflammasome Nat Commun 2023 14 1 8396 10.1038/s41467-023-44203-0 38110429 PMC10728138 Zhang Y, Luo L, Xu X, Wu J, Wang F, Lu Y, et al. Acetylation is required for full activation of the NLRP3 inflammasome. Nat Commun. 2023;14(1):8396. 38110429 10.1038/s41467-023-44203-0 PMC10728138 39. Nie L Fei C Fan Y Dang F Zhao Z Zhu T Consecutive palmitoylation and phosphorylation orchestrates NLRP3 membrane trafficking and inflammasome activation Mol Cell 2024 84 17 3336 e537 10.1016/j.molcel.2024.08.001 39173637 Nie L, Fei C, Fan Y, Dang F, Zhao Z, Zhu T, et al. Consecutive palmitoylation and phosphorylation orchestrates NLRP3 membrane trafficking and inflammasome activation. Mol Cell. 2024;84(17):3336–e537. 39173637 10.1016/j.molcel.2024.08.001 40. Yang S Li M Lian G Wu Y Cui J Wang L ABHD8 antagonizes inflammation by facilitating chaperone-mediated autophagy-mediated degradation of NLRP3 Autophagy 2025 21 2 338 51 10.1080/15548627.2024.2395158 39225180 PMC11759624 Yang S, Li M, Lian G, Wu Y, Cui J, Wang L. ABHD8 antagonizes inflammation by facilitating chaperone-mediated autophagy-mediated degradation of NLRP3. Autophagy. 2025;21(2):338–51. 39225180 10.1080/15548627.2024.2395158 PMC11759624 41. Jing J Yang F Wang K Cui M Kong N Wang S UFMylation of NLRP3 prevents its autophagic degradation and facilitates inflammasome activation Adv Sci 2025 10.1002/advs.202406786 PMC12005806 39985286 Jing J, Yang F, Wang K, Cui M, Kong N, Wang S, et al. UFMylation of NLRP3 prevents its autophagic degradation and facilitates inflammasome activation. Adv Sci. 2025. 10.1002/advs.202406786. 10.1002/advs.202406786 PMC12005806 39985286 42. Matusiak M Hickey JW van Lu IDGP Kidziński G Zhu L Spatially segregated macrophage populations predict distinct outcomes in colon cancer Cancer Discov 2024 14 8 1418 39 10.1158/2159-8290.CD-23-1300 38552005 PMC11294822 Matusiak M, Hickey JW, van Lu IDGP, Kidziński G, Zhu L. Spatially segregated macrophage populations predict distinct outcomes in colon cancer. Cancer Discov. 2024;14(8):1418–39. 38552005 10.1158/2159-8290.CD-23-1300 PMC11294822 43. Chen J Sun W Zhang H Ma J Xu P Yu Y Macrophages reprogrammed by lung cancer microparticles promote tumor development via release of IL-1β Cell Mol Immunol 2020 17 12 1233 44 10.1038/s41423-019-0313-2 31649305 PMC7784894 Chen J, Sun W, Zhang H, Ma J, Xu P, Yu Y, et al. Macrophages reprogrammed by lung cancer microparticles promote tumor development via release of IL-1β. Cell Mol Immunol. 2020;17(12):1233–44. 31649305 10.1038/s41423-019-0313-2 PMC7784894 44. Hofbauer D Mougiakakos D Broggini L Zaiss M Büttner-Herold M Bach C β(2)-microglobulin triggers NLRP3 inflammasome activation in tumor-associated macrophages to promote multiple myeloma progression Immunity 2021 54 8 1772 e879 10.1016/j.immuni.2021.07.002 34289378 Hofbauer D, Mougiakakos D, Broggini L, Zaiss M, Büttner-Herold M, Bach C, et al. β(2)-microglobulin triggers NLRP3 inflammasome activation in tumor-associated macrophages to promote multiple myeloma progression. Immunity. 2021;54(8):1772–e879. 34289378 10.1016/j.immuni.2021.07.002 45. Deng R Zhang HL Huang JH Cai RZ Wang Y Chen YH MAPK1/3 kinase-dependent ULK1 degradation attenuates mitophagy and promotes breast cancer bone metastasis Autophagy 2021 17 10 3011 29 10.1080/15548627.2020.1850609 33213267 PMC8526010 Deng R, Zhang HL, Huang JH, Cai RZ, Wang Y, Chen YH, et al. MAPK1/3 kinase-dependent ULK1 degradation attenuates mitophagy and promotes breast cancer bone metastasis. Autophagy. 2021;17(10):3011–29. 33213267 10.1080/15548627.2020.1850609 PMC8526010 46. Lu F Zhao Y Pang Y Ji M Sun Y Wang H NLRP3 inflammasome upregulates PD-L1 expression and contributes to immune suppression in lymphoma Cancer Lett 2021 497 178 89 10.1016/j.canlet.2020.10.024 33091534 Lu F, Zhao Y, Pang Y, Ji M, Sun Y, Wang H, et al. NLRP3 inflammasome upregulates PD-L1 expression and contributes to immune suppression in lymphoma. Cancer Lett. 2021;497:178–89. 33091534 10.1016/j.canlet.2020.10.024 47. Mu M Huang CX Qu C Li PL Wu XN Yao W Targeting ferroptosis-elicited inflammation suppresses hepatocellular carcinoma metastasis and enhances sorafenib efficacy Cancer Res 2024 84 6 841 54 10.1158/0008-5472.CAN-23-1796 38231484 Mu M, Huang CX, Qu C, Li PL, Wu XN, Yao W, et al. Targeting ferroptosis-elicited inflammation suppresses hepatocellular carcinoma metastasis and enhances sorafenib efficacy. Cancer Res. 2024;84(6):841–54. 38231484 10.1158/0008-5472.CAN-23-1796 48. Liu B Zhou Z Jin Y Lu J Feng D Peng R Hepatic stellate cell activation and senescence induced by intrahepatic microbiota disturbances drive progression of liver cirrhosis toward hepatocellular carcinoma J Immunother Cancer 2022 10.1136/jitc-2021-003069 34996812 PMC8744134 Liu B, Zhou Z, Jin Y, Lu J, Feng D, Peng R, et al. Hepatic stellate cell activation and senescence induced by intrahepatic microbiota disturbances drive progression of liver cirrhosis toward hepatocellular carcinoma. J Immunother Cancer. 2022. 10.1136/jitc-2021-003069. 34996812 10.1136/jitc-2021-003069 PMC8744134 49. Das S Shapiro B Vucic EA Vogt S Bar-Sagi D Tumor cell-derived IL1β promotes desmoplasia and immune suppression in pancreatic cancer Cancer Res 2020 80 5 1088 101 10.1158/0008-5472.CAN-19-2080 31915130 PMC7302116 Das S, Shapiro B, Vucic EA, Vogt S, Bar-Sagi D. Tumor cell-derived IL1β promotes desmoplasia and immune suppression in pancreatic cancer. Cancer Res. 2020;80(5):1088–101. 31915130 10.1158/0008-5472.CAN-19-2080 PMC7302116 50. Yang D Sun X Wang H Wistuba II Wang H Maitra A TREM2 depletion in pancreatic cancer elicits pathogenic inflammation and accelerates tumor progression via enriching IL-1β(+) macrophages Gastroenterology 2025 168 6 1153 69 10.1053/j.gastro.2025.01.244 39956331 PMC12103993 Yang D, Sun X, Wang H, Wistuba II, Wang H, Maitra A, et al. TREM2 depletion in pancreatic cancer elicits pathogenic inflammation and accelerates tumor progression via enriching IL-1β(+) macrophages. Gastroenterology. 2025;168(6):1153–69. 39956331 10.1053/j.gastro.2025.01.244 PMC12103993 51. Chen Q Lei JH Bao J Wang H Hao W Li L BRCA1 Adv Sci 2020 7 6 1903616 10.1002/advs.201903616 PMC7080549 32195105 Chen Q, Lei JH, Bao J, Wang H, Hao W, Li L, et al. BRCA1 10.1002/advs.201903616 PMC7080549 32195105 52. Hamarsheh S Osswald L Saller BS Unger S De Feo D Vinnakota JM Oncogenic Kras(G12D) causes myeloproliferation via NLRP3 inflammasome activation Nat Commun 2020 11 1 1659 10.1038/s41467-020-15497-1 32246016 PMC7125138 Hamarsheh S, Osswald L, Saller BS, Unger S, De Feo D, Vinnakota JM, et al. Oncogenic Kras(G12D) causes myeloproliferation via NLRP3 inflammasome activation. Nat Commun. 2020;11(1):1659. 32246016 10.1038/s41467-020-15497-1 PMC7125138 53. Missiroli S Perrone M Gafà R Nicoli F Bonora M Morciano G PML at mitochondria-associated membranes governs a trimeric complex with NLRP3 and P2 × 7R that modulates the tumor immune microenvironment Cell Death Differ 2023 30 2 429 41 10.1038/s41418-022-01095-9 36450825 PMC9713080 Missiroli S, Perrone M, Gafà R, Nicoli F, Bonora M, Morciano G, et al. PML at mitochondria-associated membranes governs a trimeric complex with NLRP3 and P2X7R that modulates the tumor immune microenvironment. Cell Death Differ. 2023;30(2):429–41. 36450825 10.1038/s41418-022-01095-9 PMC9713080 54. Cheng HY Hsieh CH Lin PH Chen YT Hsu DS Tai SK Snail-regulated exosomal microRNA-21 suppresses NLRP3 inflammasome activity to enhance cisplatin resistance J Immunother Cancer 2022 10.1136/jitc-2022-004832 36002186 PMC9413180 Cheng HY, Hsieh CH, Lin PH, Chen YT, Hsu DS, Tai SK, et al. Snail-regulated exosomal microRNA-21 suppresses NLRP3 inflammasome activity to enhance cisplatin resistance. J Immunother Cancer. 2022. 10.1136/jitc-2022-004832. 36002186 10.1136/jitc-2022-004832 PMC9413180 55. Hsieh CH Tai SK Yang MH Snail-overexpressing cancer cells promote M2-like polarization of tumor-associated macrophages by delivering miR-21-abundant exosomes Neoplasia 2018 20 8 775 88 10.1016/j.neo.2018.06.004 29981499 PMC6031090 Hsieh CH, Tai SK, Yang MH. Snail-overexpressing cancer cells promote M2-like polarization of tumor-associated macrophages by delivering miR-21-abundant exosomes. Neoplasia. 2018;20(8):775–88. 29981499 10.1016/j.neo.2018.06.004 PMC6031090 56. Su P Mao X Ma J Huang L Yu L Tang S ERRα promotes glycolytic metabolism and targets the NLRP3/caspase-1/GSDMD pathway to regulate pyroptosis in endometrial cancer J Exp Clin Cancer Res 2023 42 1 274 10.1186/s13046-023-02834-7 37864196 PMC10588109 Su P, Mao X, Ma J, Huang L, Yu L, Tang S, et al. ERRα promotes glycolytic metabolism and targets the NLRP3/caspase-1/GSDMD pathway to regulate pyroptosis in endometrial cancer. J Exp Clin Cancer Res. 2023;42(1):274. 37864196 10.1186/s13046-023-02834-7 PMC10588109 57. Li Z Yang Z Zhu Y Fu C Li N Peng F Sorcin regulate pyroptosis by interacting with NLRP3 inflammasomes to facilitate the progression of hepatocellular carcinoma Cell Death Dis 2023 14 10 678 10.1038/s41419-023-06096-1 37833249 PMC10575890 Li Z, Yang Z, Zhu Y, Fu C, Li N, Peng F. Sorcin regulate pyroptosis by interacting with NLRP3 inflammasomes to facilitate the progression of hepatocellular carcinoma. Cell Death Dis. 2023;14(10):678. 37833249 10.1038/s41419-023-06096-1 PMC10575890 58. Yan H Wang Z Teng D Chen X Zhu Z Chen H Hexokinase 2 senses Fructose in tumor-associated macrophages to promote colorectal cancer growth Cell Metab 2024 36 11 2449 e676 10.1016/j.cmet.2024.10.002 39471815 Yan H, Wang Z, Teng D, Chen X, Zhu Z, Chen H, et al. Hexokinase 2 senses Fructose in tumor-associated macrophages to promote colorectal cancer growth. Cell Metab. 2024;36(11):2449–e676. 39471815 10.1016/j.cmet.2024.10.002 59. Li T Fu B Zhang X Zhou Y Yang M Cao M Overproduction of gastrointestinal 5-HT promotes colitis-associated colorectal cancer progression via enhancing NLRP3 inflammasome activation Cancer Immunol Res 2021 9 9 1008 23 10.1158/2326-6066.CIR-20-1043 34285037 Li T, Fu B, Zhang X, Zhou Y, Yang M, Cao M, et al. Overproduction of gastrointestinal 5-HT promotes colitis-associated colorectal cancer progression via enhancing NLRP3 inflammasome activation. Cancer Immunol Res. 2021;9(9):1008–23. 34285037 10.1158/2326-6066.CIR-20-1043 60. Xiao L Li X Cao P Fei W Zhou H Tang N Interleukin-6 mediated inflammasome activation promotes oral squamous cell carcinoma progression via JAK2/STAT3/Sox4/NLRP3 signaling pathway J Exp Clin Cancer Res 2022 41 1 166 10.1186/s13046-022-02376-4 35513871 PMC9069786 Xiao L, Li X, Cao P, Fei W, Zhou H, Tang N, et al. Interleukin-6 mediated inflammasome activation promotes oral squamous cell carcinoma progression via JAK2/STAT3/Sox4/NLRP3 signaling pathway. J Exp Clin Cancer Res. 2022;41(1):166. 35513871 10.1186/s13046-022-02376-4 PMC9069786 61. Janneh AH Kassir MF Atilgan FC Lee HG Sheridan M Oleinik N Crosstalk between pro-survival sphingolipid metabolism and complement signaling induces inflammasome-mediated tumor metastasis Cell Rep 2022 41 10 111742 10.1016/j.celrep.2022.111742 36476873 PMC9791981 Janneh AH, Kassir MF, Atilgan FC, Lee HG, Sheridan M, Oleinik N, et al. Crosstalk between pro-survival sphingolipid metabolism and complement signaling induces inflammasome-mediated tumor metastasis. Cell Rep. 2022;41(10):111742. 36476873 10.1016/j.celrep.2022.111742 PMC9791981 62. Mészáros Á Molnár K Fazakas C Nógrádi B Lüvi A Dudás T Inflammasome activation in peritumoral astrocytes is a key player in breast cancer brain metastasis development Acta Neuropathol Commun 2023 11 1 155 10.1186/s40478-023-01646-2 37749707 PMC10521486 Mészáros Á, Molnár K, Fazakas C, Nógrádi B, Lüvi A, Dudás T, et al. Inflammasome activation in peritumoral astrocytes is a key player in breast cancer brain metastasis development. Acta Neuropathol Commun. 2023;11(1):155. 37749707 10.1186/s40478-023-01646-2 PMC10521486 63. Magliacane Trotta S Adinolfi A D’Orsi L Panico S Mercadante G Mehlen P Cancer-derived exosomal Alu RNA promotes colorectal cancer progression Exp Mol Med 2024 56 3 700 10 10.1038/s12276-024-01166-6 38486106 PMC10984964 Magliacane Trotta S, Adinolfi A, D’Orsi L, Panico S, Mercadante G, Mehlen P, et al. Cancer-derived exosomal Alu RNA promotes colorectal cancer progression. Exp Mol Med. 2024;56(3):700–10. 38486106 10.1038/s12276-024-01166-6 PMC10984964 64. Jing L An Y Cai T Xiang J Li B Guo J A subpopulation of CD146(+) macrophages enhances antitumor immunity by activating the NLRP3 inflammasome Cell Mol Immunol 2023 20 8 908 23 10.1038/s41423-023-01047-4 37308559 PMC10387481 Jing L, An Y, Cai T, Xiang J, Li B, Guo J, et al. A subpopulation of CD146(+) macrophages enhances antitumor immunity by activating the NLRP3 inflammasome. Cell Mol Immunol. 2023;20(8):908–23. 37308559 10.1038/s41423-023-01047-4 PMC10387481 65. Han C Godfrey V Liu Z Han Y Liu L Peng H The AIM2 and NLRP3 inflammasomes trigger IL-1-mediated antitumor effects during radiation Sci Immunol 2021 10.1126/sciimmunol.abc6998 33963060 Han C, Godfrey V, Liu Z, Han Y, Liu L, Peng H, et al. The AIM2 and NLRP3 inflammasomes trigger IL-1-mediated antitumor effects during radiation. Sci Immunol. 2021. 10.1126/sciimmunol.abc6998. 33963060 10.1126/sciimmunol.abc6998 66. Zhivaki D Kennedy SN Park J Boriello F Devant P Cao A Correction of age-associated defects in dendritic cells enables CD4(+) T cells to eradicate tumors Cell 2024 187 15 3888 e90318 10.1016/j.cell.2024.05.026 38870946 PMC11283364 Zhivaki D, Kennedy SN, Park J, Boriello F, Devant P, Cao A, et al. Correction of age-associated defects in dendritic cells enables CD4(+) T cells to eradicate tumors. Cell. 2024;187(15):3888–e90318. 38870946 10.1016/j.cell.2024.05.026 PMC11283364 67. Dixon KO Tabaka M Schramm MA Xiao S Tang R Dionne D TIM-3 restrains anti-tumour immunity by regulating inflammasome activation Nature 2021 595 7865 101 6 10.1038/s41586-021-03626-9 34108686 PMC8627694 Dixon KO, Tabaka M, Schramm MA, Xiao S, Tang R, Dionne D, et al. TIM-3 restrains anti-tumour immunity by regulating inflammasome activation. Nature. 2021;595(7865):101–6. 34108686 10.1038/s41586-021-03626-9 PMC8627694 68. Fan F Wang J Liu K Zhang S Gao J Li X Mast cells boost anti-tumor potency of MAIT cells via inflammasome-dependent secretion of IL-18 Nat Commun 2025 16 1 6074 10.1038/s41467-025-61324-w 40603850 PMC12222788 Fan F, Wang J, Liu K, Zhang S, Gao J, Li X, et al. Mast cells boost anti-tumor potency of MAIT cells via inflammasome-dependent secretion of IL-18. Nat Commun. 2025;16(1):6074. 40603850 10.1038/s41467-025-61324-w PMC12222788 69. Moghadam ZM Henneke P Kolter J From flies to men: ROS and the NADPH oxidase in phagocytes Front Cell Dev Biol 2021 9 628991 10.3389/fcell.2021.628991 33842458 PMC8033005 Moghadam ZM, Henneke P, Kolter J. From flies to men: ROS and the NADPH oxidase in phagocytes. Front Cell Dev Biol. 2021;9:628991. 33842458 10.3389/fcell.2021.628991 PMC8033005 70. Li L Mao R Yuan S Xie Q Meng J Gu Y NCF4 attenuates colorectal cancer progression by modulating inflammasome activation and immune surveillance Nat Commun 2024 15 1 5170 10.1038/s41467-024-49549-7 38886341 PMC11183137 Li L, Mao R, Yuan S, Xie Q, Meng J, Gu Y, et al. NCF4 attenuates colorectal cancer progression by modulating inflammasome activation and immune surveillance. Nat Commun. 2024;15(1):5170. 38886341 10.1038/s41467-024-49549-7 PMC11183137 71. He Z Zhang J Ma J Zhao L Jin X Li H R-spondin family biology and emerging linkages to cancer Ann Med 2023 55 1 428 46 10.1080/07853890.2023.2166981 36645115 PMC9848353 He Z, Zhang J, Ma J, Zhao L, Jin X, Li H. R-spondin family biology and emerging linkages to cancer. Ann Med. 2023;55(1):428–46. 36645115 10.1080/07853890.2023.2166981 PMC9848353 72. Li H Zhang J Yu B Yang T Liu B Li F Rspo3 regulates the radioresistance of non-small cell lung cancer cells via NLRP3 inflammasome-mediated pyroptosis Radiother Oncol 2024 200 110528 10.1016/j.radonc.2024.110528 39245068 Li H, Zhang J, Yu B, Yang T, Liu B, Li F, et al. Rspo3 regulates the radioresistance of non-small cell lung cancer cells via NLRP3 inflammasome-mediated pyroptosis. Radiother Oncol. 2024;200:110528. 39245068 10.1016/j.radonc.2024.110528 73. Xu L Peng F Luo Q Ding Y Yuan F Zheng L IRE1α silences DsRNA to prevent taxane-induced pyroptosis in triple-negative breast cancer Cell 2024 187 25 7248 e6634 10.1016/j.cell.2024.09.032 39419025 PMC11645245 Xu L, Peng F, Luo Q, Ding Y, Yuan F, Zheng L, et al. IRE1α silences DsRNA to prevent taxane-induced pyroptosis in triple-negative breast cancer. Cell. 2024;187(25):7248–e6634. 39419025 10.1016/j.cell.2024.09.032 PMC11645245 74. Li Z Fu WJ Chen XQ Wang S Deng RS Tang XP Autophagy-based unconventional secretion of HMGB1 in glioblastoma promotes chemosensitivity to Temozolomide through macrophage M1-like polarization J Exp Clin Cancer Res 2022 41 1 74 10.1186/s13046-022-02291-8 35193644 PMC8862393 Li Z, Fu WJ, Chen XQ, Wang S, Deng RS, Tang XP, et al. Autophagy-based unconventional secretion of HMGB1 in glioblastoma promotes chemosensitivity to Temozolomide through macrophage M1-like polarization. J Exp Clin Cancer Res. 2022;41(1):74. 35193644 10.1186/s13046-022-02291-8 PMC8862393 75. Kim Y Jung KY Kim YH Xu P Kang BE Jo Y Inhibition of SIRT7 overcomes Sorafenib acquired resistance by suppressing ERK1/2 phosphorylation via the DDX3X-mediated NLRP3 inflammasome in hepatocellular carcinoma Drug Resist Updat 2024 73 101054 10.1016/j.drup.2024.101054 38277756 PMC10935544 Kim Y, Jung KY, Kim YH, Xu P, Kang BE, Jo Y, et al. Inhibition of SIRT7 overcomes Sorafenib acquired resistance by suppressing ERK1/2 phosphorylation via the DDX3X-mediated NLRP3 inflammasome in hepatocellular carcinoma. Drug Resist Updat. 2024;73:101054. 38277756 10.1016/j.drup.2024.101054 PMC10935544 76. Hurtado-Navarro L Cuenca-Zamora EJ Zamora L Bellosillo B Such E Soler-Espejo E NLRP3 inflammasome activation and symptom burden in KRAS-mutated CMML patients is reverted by IL-1 blocking therapy Cell Rep Med 2023 4 12 101329 10.1016/j.xcrm.2023.101329 38118408 PMC10772462 Hurtado-Navarro L, Cuenca-Zamora EJ, Zamora L, Bellosillo B, Such E, Soler-Espejo E, et al. NLRP3 inflammasome activation and symptom burden in KRAS-mutated CMML patients is reverted by IL-1 blocking therapy. Cell Rep Med. 2023;4(12):101329. 38118408 10.1016/j.xcrm.2023.101329 PMC10772462 77. Liu X He H Qi M Jiang Z Lin B Wang X A small molecule directly targets NLRP3 to promote inflammasome activation and antitumor immunity Cell Death Dis 2025 16 1 252 10.1038/s41419-025-07578-0 40185713 PMC11971322 Liu X, He H, Qi M, Jiang Z, Lin B, Wang X, et al. A small molecule directly targets NLRP3 to promote inflammasome activation and antitumor immunity. Cell Death Dis. 2025;16(1):252. 40185713 10.1038/s41419-025-07578-0 PMC11971322 78. Tan M Cao G Wang R Cheng L Huang W Yin Y Metal-ion-chelating phenylalanine nanostructures reverse immune dysfunction and sensitize breast tumour to immune checkpoint blockade Nat Nanotechnol 2024 19 12 1903 13 10.1038/s41565-024-01758-3 39187583 Tan M, Cao G, Wang R, Cheng L, Huang W, Yin Y, et al. Metal-ion-chelating phenylalanine nanostructures reverse immune dysfunction and sensitize breast tumour to immune checkpoint blockade. Nat Nanotechnol. 2024;19(12):1903–13. 39187583 10.1038/s41565-024-01758-3 79. Zhu Y Chen P Hu B Zhong S Yan K Wu Y MDSC-targeting gold nanoparticles enhance PD-1 tumor immunotherapy by inhibiting NLRP3 inflammasomes Biomaterials 2024 307 122533 10.1016/j.biomaterials.2024.122533 38493671 Zhu Y, Chen P, Hu B, Zhong S, Yan K, Wu Y, et al. MDSC-targeting gold nanoparticles enhance PD-1 tumor immunotherapy by inhibiting NLRP3 inflammasomes. Biomaterials. 2024;307:122533. 38493671 10.1016/j.biomaterials.2024.122533 80. Fu X Li J Wu Y Mao C Jiang Y PAR2 deficiency tunes inflammatory microenvironment to magnify STING signalling for mitigating cancer metastasis via anionic CRISPR/Cas9 nanoparticles J Control Release 2023 363 733 46 10.1016/j.jconrel.2023.10.017 37827223 Fu X, Li J, Wu Y, Mao C, Jiang Y. PAR2 deficiency tunes inflammatory microenvironment to magnify STING signalling for mitigating cancer metastasis via anionic CRISPR/Cas9 nanoparticles. J Control Release. 2023;363:733–46. 37827223 10.1016/j.jconrel.2023.10.017 81. Mishra SR Behera BP Singh VK Mahapatra KK Mundkinajeddu D Bhat D Anticancer activity of Bacopa monnieri Phytomedicine 2024 123 155157 10.1016/j.phymed.2023.155157 37951147 Mishra SR, Behera BP, Singh VK, Mahapatra KK, Mundkinajeddu D, Bhat D, et al. Anticancer activity of Bacopa monnieri 37951147 10.1016/j.phymed.2023.155157 82. Dai B Fan M Huang X Gong Z Cao H Hu Y Shuanghua decoction exerts anticancer activity by activating NLRP3 inflammasome via ROS and inhibiting NF-κB signaling in hepatocellular carcinoma cells Phytomedicine 2022 103 154249 10.1016/j.phymed.2022.154249 35716538 Dai B, Fan M, Huang X, Gong Z, Cao H, Hu Y, et al. Shuanghua decoction exerts anticancer activity by activating NLRP3 inflammasome via ROS and inhibiting NF-κB signaling in hepatocellular carcinoma cells. Phytomedicine. 2022;103:154249. 35716538 10.1016/j.phymed.2022.154249 83. Zhou Y Pang L Ding T Chen K Liu J Wu M Precise in situ delivery of a photo-enhanceable inflammasome-activating nanovaccine activates anticancer immunity Cancer Res 2024 84 22 3834 47 10.1158/0008-5472.CAN-24-0220 39288074 PMC11565167 Zhou Y, Pang L, Ding T, Chen K, Liu J, Wu M, et al. Precise in situ delivery of a photo-enhanceable inflammasome-activating nanovaccine activates anticancer immunity. Cancer Res. 2024;84(22):3834–47. 39288074 10.1158/0008-5472.CAN-24-0220 PMC11565167 84. Yang Y Yang J Zhu N Qiu H Feng W Chen Y Tumor-targeting hydroxyapatite nanoparticles for remodeling tumor immune microenvironment (TIME) by activating mitoDNA-pyroptosis pathway in cancer J Nanobiotechnol 2023 21 1 470 10.1186/s12951-023-02231-4 PMC10704647 38062467 Yang Y, Yang J, Zhu N, Qiu H, Feng W, Chen Y, et al. Tumor-targeting hydroxyapatite nanoparticles for remodeling tumor immune microenvironment (TIME) by activating mitoDNA-pyroptosis pathway in cancer. J Nanobiotechnol. 2023;21(1):470. 10.1186/s12951-023-02231-4 PMC10704647 38062467 85. Li C Zhang N Xu Z Rong Z Song C Zhang Y Inflammasome mediated in situ cancer vaccine activated by Schottky heterojunction for augmented immunotherapy J Control Release 2025 380 1184 97 10.1016/j.jconrel.2025.02.059 39988306 Li C, Zhang N, Xu Z, Rong Z, Song C, Zhang Y, et al. Inflammasome mediated in situ cancer vaccine activated by Schottky heterojunction for augmented immunotherapy. J Control Release. 2025;380:1184–97. 39988306 10.1016/j.jconrel.2025.02.059 86. Albanese V Missiroli S Perrone M Fabbri M Boncompagni C Pacifico S Novel aryl sulfonamide derivatives as NLRP3 inflammasome inhibitors for the potential treatment of cancer J Med Chem 2023 66 7 5223 41 10.1021/acs.jmedchem.3c00175 36972104 Albanese V, Missiroli S, Perrone M, Fabbri M, Boncompagni C, Pacifico S, et al. Novel aryl sulfonamide derivatives as NLRP3 inflammasome inhibitors for the potential treatment of cancer. J Med Chem. 2023;66(7):5223–41. 36972104 10.1021/acs.jmedchem.3c00175 87. Hu ZC Wang B Zhou XG Liang HF Liang B Lu HW Golgi apparatus-targeted photodynamic therapy for enhancing tumor immunogenicity by eliciting NLRP3 protein-dependent pyroptosis ACS Nano 2023 17 21 21153 69 10.1021/acsnano.3c05005 37921421 Hu ZC, Wang B, Zhou XG, Liang HF, Liang B, Lu HW, et al. Golgi apparatus-targeted photodynamic therapy for enhancing tumor immunogenicity by eliciting NLRP3 protein-dependent pyroptosis. ACS Nano. 2023;17(21):21153–69. 37921421 10.1021/acsnano.3c05005 88. Nie J Zhang S Guo Y Liu C Shi J Wu H Mapping of the T-cell landscape of biliary tract cancer unravels anatomic subtype-specific heterogeneity Cancer Res 2025 85 4 704 22 10.1158/0008-5472.CAN-24-1173 39570809 Nie J, Zhang S, Guo Y, Liu C, Shi J, Wu H, et al. Mapping of the T-cell landscape of biliary tract cancer unravels anatomic subtype-specific heterogeneity. Cancer Res. 2025;85(4):704–22. 39570809 10.1158/0008-5472.CAN-24-1173 89. Martin-Serrano MA Kepecs B Torres-Martin M Bramel ER Haber PK Merritt E Novel microenvironment-based classification of intrahepatic cholangiocarcinoma with therapeutic implications Gut 2023 72 4 736 48 10.1136/gutjnl-2021-326514 35584893 PMC10388405 Martin-Serrano MA, Kepecs B, Torres-Martin M, Bramel ER, Haber PK, Merritt E, et al. Novel microenvironment-based classification of intrahepatic cholangiocarcinoma with therapeutic implications. Gut. 2023;72(4):736–48. 35584893 10.1136/gutjnl-2021-326514 PMC10388405 90. Esnaola NF Meyer JE Karachristos A Maranki JL Camp ER Denlinger CS Evaluation and management of intrahepatic and extrahepatic cholangiocarcinoma Cancer 2016 122 9 1349 69 10.1002/cncr.29692 26799932 Esnaola NF, Meyer JE, Karachristos A, Maranki JL, Camp ER, Denlinger CS. Evaluation and management of intrahepatic and extrahepatic cholangiocarcinoma. Cancer. 2016;122(9):1349–69. 26799932 10.1002/cncr.29692 91. Hong L, Mei J, Sun X, Wu Y, Dong Z, Jin Y et al. Spatial single-cell proteomics landscape decodes the tumor microenvironmental ecosystem of intrahepatic cholangiocarcinoma. Hepatology. 2025. 10.1097/HEP.0000000000001283. 10.1097/HEP.0000000000001283 39999448 92. Ruan J Li Q Jin Y Yin J Ye C Cheng F Multiple-omics analysis reveals a dedifferentiation-immune loop in intrahepatic cholangiocarcinoma Mol Ther 2025 33 4 1803 24 10.1016/j.ymthe.2025.02.019 39943686 PMC11997497 Ruan J, Li Q, Jin Y, Yin J, Ye C, Cheng F, et al. Multiple-omics analysis reveals a dedifferentiation-immune loop in intrahepatic cholangiocarcinoma. Mol Ther. 2025;33(4):1803–24. 39943686 10.1016/j.ymthe.2025.02.019 PMC11997497 93. Liu W Wang H Zhao Q Tao C Qu W Hou Y Multiomics analysis reveals metabolic subtypes and identifies diacylglycerol kinase α (DGKA) as a potential therapeutic target for intrahepatic cholangiocarcinoma Cancer Commun 2024 44 2 226 50 10.1002/cac2.12513 PMC10876206 38143235 Liu W, Wang H, Zhao Q, Tao C, Qu W, Hou Y, et al. Multiomics analysis reveals metabolic subtypes and identifies diacylglycerol kinase α (DGKA) as a potential therapeutic target for intrahepatic cholangiocarcinoma. Cancer Commun. 2024;44(2):226–50. 10.1002/cac2.12513 PMC10876206 38143235 94. Zuyin L Zhao L Qian C Changkun Z Delin M Jialing H Single-cell and spatial transcriptomics delineate the microstructure and immune landscape of intrahepatic cholangiocarcinoma in the leading-edge area Adv Sci 2024 12 7 e2412740 10.1002/advs.202412740 PMC11831447 39716897 Zuyin L, Zhao L, Qian C, Changkun Z, Delin M, Jialing H, et al. Single-cell and spatial transcriptomics delineate the microstructure and immune landscape of intrahepatic cholangiocarcinoma in the leading-edge area. Adv Sci. 2024;12(7):e2412740. 10.1002/advs.202412740 PMC11831447 39716897 95. Liao H Chen X Wang H Lin Y Chen L Yuan K Whole-genome DNA methylation profiling of intrahepatic cholangiocarcinoma reveals prognostic subtypes with distinct biological drivers Cancer Res 2024 84 11 1747 63 10.1158/0008-5472.CAN-23-3298 38471085 PMC11148548 Liao H, Chen X, Wang H, Lin Y, Chen L, Yuan K, et al. Whole-genome DNA methylation profiling of intrahepatic cholangiocarcinoma reveals prognostic subtypes with distinct biological drivers. Cancer Res. 2024;84(11):1747–63. 38471085 10.1158/0008-5472.CAN-23-3298 PMC11148548 96. Zhou ZJ Ye YH Hu ZQ Hou YR Liu KX Sun RQ Whole-exome sequencing reveals genomic landscape of intrahepatic cholangiocarcinoma and identifies SAV1 as a potential driver Nat Commun 2024 15 1 9960 10.1038/s41467-024-54387-8 39551842 PMC11570600 Zhou ZJ, Ye YH, Hu ZQ, Hou YR, Liu KX, Sun RQ, et al. Whole-exome sequencing reveals genomic landscape of intrahepatic cholangiocarcinoma and identifies SAV1 as a potential driver. Nat Commun. 2024;15(1):9960. 39551842 10.1038/s41467-024-54387-8 PMC11570600 97. Hoesel B Schmid JA The complexity of NF-κB signaling in inflammation and cancer Mol Cancer 2013 12 86 10.1186/1476-4598-12-86 23915189 PMC3750319 Hoesel B, Schmid JA. The complexity of NF-κB signaling in inflammation and cancer. Mol Cancer. 2013;12:86. 23915189 10.1186/1476-4598-12-86 PMC3750319 98. Guan C Gao J Zou X Shi W Hao Y Ge Y A novel 167-amino acid protein encoded by CircPCSK6 inhibits intrahepatic cholangiocarcinoma progression via IKBα ubiquitination Adv Sci 2025 12 10 e2409173 10.1002/advs.202409173 PMC11904980 39836545 Guan C, Gao J, Zou X, Shi W, Hao Y, Ge Y, et al. A novel 167-amino acid protein encoded by CircPCSK6 inhibits intrahepatic cholangiocarcinoma progression via IKBα ubiquitination. Adv Sci. 2025;12(10):e2409173. 10.1002/advs.202409173 PMC11904980 39836545 99. Lewinska M Zhuravleva E Satriano L Martinez MB Bhatt DK Oliveira D Fibroblast-Derived Lysyl oxidase increases oxidative phosphorylation and stemness in cholangiocarcinoma Gastroenterology 2024 166 5 886 e9017 10.1053/j.gastro.2023.11.302 38096955 Lewinska M, Zhuravleva E, Satriano L, Martinez MB, Bhatt DK, Oliveira D, et al. Fibroblast-Derived Lysyl oxidase increases oxidative phosphorylation and stemness in cholangiocarcinoma. Gastroenterology. 2024;166(5):886–e9017. 38096955 10.1053/j.gastro.2023.11.302 100. Shiode Y Kodama T Shigeno S Murai K Tanaka S Newberg JY TNF receptor-related factor 3 inactivation promotes the development of intrahepatic cholangiocarcinoma through NF-κB-inducing kinase-mediated hepatocyte transdifferentiation Hepatology 2023 77 2 395 410 10.1002/hep.32317 34995376 PMC9869956 Shiode Y, Kodama T, Shigeno S, Murai K, Tanaka S, Newberg JY, et al. TNF receptor-related factor 3 inactivation promotes the development of intrahepatic cholangiocarcinoma through NF-κB-inducing kinase-mediated hepatocyte transdifferentiation. Hepatology. 2023;77(2):395–410. 34995376 10.1002/hep.32317 PMC9869956 101. Zhen Y Liu K Shi L Shah S Xu Q Ellis H Fgfr inhibition blocks NF-ĸB-dependent glucose metabolism and confers metabolic vulnerabilities in cholangiocarcinoma Nat Commun 2024 15 1 3805 10.1038/s41467-024-47514-y 38714664 PMC11076599 Zhen Y, Liu K, Shi L, Shah S, Xu Q, Ellis H, et al. Fgfr inhibition blocks NF-ĸB-dependent glucose metabolism and confers metabolic vulnerabilities in cholangiocarcinoma. Nat Commun. 2024;15(1):3805. 38714664 10.1038/s41467-024-47514-y PMC11076599 102. McKee CM Coll RC Nlrp3 inflammasome priming: a riddle wrapped in a mystery inside an enigma J Leukoc Biol 2020 108 3 937 52 10.1002/JLB.3MR0720-513R 32745339 McKee CM, Coll RC. Nlrp3 inflammasome priming: a riddle wrapped in a mystery inside an enigma. J Leukoc Biol. 2020;108(3):937–52. 32745339 10.1002/JLB.3MR0720-513R 103. Swanson KV Deng M Ting JP The NLRP3 inflammasome: molecular activation and regulation to therapeutics Nat Rev Immunol 2019 19 8 477 89 10.1038/s41577-019-0165-0 31036962 PMC7807242 Swanson KV, Deng M, Ting JP. The NLRP3 inflammasome: molecular activation and regulation to therapeutics. Nat Rev Immunol. 2019;19(8):477–89. 31036962 10.1038/s41577-019-0165-0 PMC7807242 104. Xu J Núñez G The NLRP3 inflammasome: activation and regulation Trends Biochem Sci 2023 48 4 331 44 10.1016/j.tibs.2022.10.002 36336552 PMC10023278 Xu J, Núñez G. The NLRP3 inflammasome: activation and regulation. Trends Biochem Sci. 2023;48(4):331–44. 36336552 10.1016/j.tibs.2022.10.002 PMC10023278 105. Rashidi M Wicks IP Vince JE Inflammasomes and cell death: common pathways in microparticle diseases Trends Mol Med 2020 26 11 1003 20 10.1016/j.molmed.2020.06.005 32646646 Rashidi M, Wicks IP, Vince JE. Inflammasomes and cell death: common pathways in microparticle diseases. Trends Mol Med. 2020;26(11):1003–20. 32646646 10.1016/j.molmed.2020.06.005 106. Bai B Yang Y Wang Q Li M Tian C Liu Y NLRP3 inflammasome in endothelial dysfunction Cell Death Dis 2020 11 9 776 10.1038/s41419-020-02985-x 32948742 PMC7501262 Bai B, Yang Y, Wang Q, Li M, Tian C, Liu Y, et al. NLRP3 inflammasome in endothelial dysfunction. Cell Death Dis. 2020;11(9):776. 32948742 10.1038/s41419-020-02985-x PMC7501262 107. Zhang T Zhu LX Sun QK Chen LJ Qian YB CARD9 promotes cholangiocarcinoma by regulating the IL-17A/Hedgehog and the THEM4/AKT/mTOR signaling pathways Int Immunopharmacol 2024 143 Pt 2 113399 10.1016/j.intimp.2024.113399 39418733 Zhang T, Zhu LX, Sun QK, Chen LJ, Qian YB. CARD9 promotes cholangiocarcinoma by regulating the IL-17A/Hedgehog and the THEM4/AKT/mTOR signaling pathways. Int Immunopharmacol. 2024;143(Pt 2):113399. 39418733 10.1016/j.intimp.2024.113399 108. Worby CA Dixon JE PTEN Annu Rev Biochem 2014 83 641 69 10.1146/annurev-biochem-082411-113907 24905788 Worby CA, Dixon JE. PTEN. Annu Rev Biochem. 2014;83:641–69. 24905788 10.1146/annurev-biochem-082411-113907 109. Jiang TY Shi YY Cui XW Pan YF Lin YK Feng XF Pten deficiency facilitates exosome secretion and metastasis in cholangiocarcinoma by impairing TFEB-mediated lysosome biogenesis Gastroenterology 2023 164 3 424 38 10.1053/j.gastro.2022.11.025 36436593 Jiang TY, Shi YY, Cui XW, Pan YF, Lin YK, Feng XF, et al. Pten deficiency facilitates exosome secretion and metastasis in cholangiocarcinoma by impairing TFEB-mediated lysosome biogenesis. Gastroenterology. 2023;164(3):424–38. 36436593 10.1053/j.gastro.2022.11.025 110. Liao W Du J Li L Wu X Chen X Feng Q CircZNF215 promotes tumor growth and metastasis through inactivation of the PTEN/AKT pathway in intrahepatic cholangiocarcinoma J Exp Clin Cancer Res 2023 42 1 125 10.1186/s13046-023-02699-w 37198696 PMC10193609 Liao W, Du J, Li L, Wu X, Chen X, Feng Q, et al. CircZNF215 promotes tumor growth and metastasis through inactivation of the PTEN/AKT pathway in intrahepatic cholangiocarcinoma. J Exp Clin Cancer Res. 2023;42(1):125. 37198696 10.1186/s13046-023-02699-w PMC10193609 111. Yang Y Wang J Wan J Cheng Q Cheng Z Zhou X PTEN J Hepatol 2024 81 1 120 34 10.1016/j.jhep.2024.02.018 38428643 PMC11259013 Yang Y, Wang J, Wan J, Cheng Q, Cheng Z, Zhou X, et al. PTEN 38428643 10.1016/j.jhep.2024.02.018 PMC11259013 112. Huang Y Wang H Hao Y Lin H Dong M Ye J Myeloid PTEN promotes chemotherapy-induced NLRP3-inflammasome activation and antitumour immunity Nat Cell Biol 2020 22 6 716 27 10.1038/s41556-020-0510-3 32367047 Huang Y, Wang H, Hao Y, Lin H, Dong M, Ye J, et al. Myeloid PTEN promotes chemotherapy-induced NLRP3-inflammasome activation and antitumour immunity. Nat Cell Biol. 2020;22(6):716–27. 32367047 10.1038/s41556-020-0510-3 113. Lazaridis KN LaRusso NF Primary sclerosing cholangitis N Engl J Med 2016 375 12 1161 70 10.1056/NEJMra1506330 27653566 PMC5553912 Lazaridis KN, LaRusso NF. Primary sclerosing cholangitis. N Engl J Med. 2016;375(12):1161–70. 27653566 10.1056/NEJMra1506330 PMC5553912 114. Ilyas SI Eaton JE Gores GJ Primary sclerosing cholangitis as a premalignant biliary tract disease: surveillance and management Clin Gastroenterol Hepatol 2015 13 12 2152 65 10.1016/j.cgh.2015.05.035 26051390 PMC4618039 Ilyas SI, Eaton JE, Gores GJ. Primary sclerosing cholangitis as a premalignant biliary tract disease: surveillance and management. Clin Gastroenterol Hepatol. 2015;13(12):2152–65. 26051390 10.1016/j.cgh.2015.05.035 PMC4618039 115. Rizvi S Gores GJ Current diagnostic and management options in perihilar cholangiocarcinoma Digestion 2014 89 3 216 24 10.1159/000360791 24860985 PMC4086311 Rizvi S, Gores GJ. Current diagnostic and management options in perihilar cholangiocarcinoma. Digestion. 2014;89(3):216–24. 24860985 10.1159/000360791 PMC4086311 116. Boonstra K Weersma RK van Erpecum KJ Rauws EA Spanier BW Poen AC Population-based epidemiology, malignancy risk, and outcome of primary sclerosing cholangitis Hepatology 2013 58 6 2045 55 10.1002/hep.26565 23775876 Boonstra K, Weersma RK, van Erpecum KJ, Rauws EA, Spanier BW, Poen AC, et al. Population-based epidemiology, malignancy risk, and outcome of primary sclerosing cholangitis. Hepatology. 2013;58(6):2045–55. 23775876 10.1002/hep.26565 117. Maroni L Agostinelli L Saccomanno S Pinto C Giordano DM Rychlicki C Nlrp3 activation induces Il-18 synthesis and affects the epithelial barrier function in reactive cholangiocytes Am J Pathol 2017 187 2 366 76 10.1016/j.ajpath.2016.10.010 27912077 Maroni L, Agostinelli L, Saccomanno S, Pinto C, Giordano DM, Rychlicki C, et al. Nlrp3 activation induces Il-18 synthesis and affects the epithelial barrier function in reactive cholangiocytes. Am J Pathol. 2017;187(2):366–76. 27912077 10.1016/j.ajpath.2016.10.010 118. Nakagawa H Hikiba Y Hirata Y Font-Burgada J Sakamoto K Hayakawa Y Loss of liver E-cadherin induces sclerosing cholangitis and promotes carcinogenesis Proc Natl Acad Sci U S A 2014 111 3 1090 5 10.1073/pnas.1322731111 24395807 PMC3903249 Nakagawa H, Hikiba Y, Hirata Y, Font-Burgada J, Sakamoto K, Hayakawa Y, et al. Loss of liver E-cadherin induces sclerosing cholangitis and promotes carcinogenesis. Proc Natl Acad Sci U S A. 2014;111(3):1090–5. 24395807 10.1073/pnas.1322731111 PMC3903249 119. Matsushita H Miyake Y Takaki A Yasunaka T Koike K Ikeda F TLR4, TLR9, and NLRP3 in biliary epithelial cells of primary sclerosing cholangitis: relationship with clinical characteristics J Gastroenterol Hepatol 2015 30 3 600 8 10.1111/jgh.12711 25160604 Matsushita H, Miyake Y, Takaki A, Yasunaka T, Koike K, Ikeda F, et al. TLR4, TLR9, and NLRP3 in biliary epithelial cells of primary sclerosing cholangitis: relationship with clinical characteristics. J Gastroenterol Hepatol. 2015;30(3):600–8. 25160604 10.1111/jgh.12711 120. Wu N Bayatpour S Hylemon PB Aseem SO Brindley PJ Zhou H Gut microbiome and bile acid interactions: mechanistic implications for cholangiocarcinoma development, immune resistance, and therapy Am J Pathol 2025 195 3 397 408 10.1016/j.ajpath.2024.11.004 39730075 PMC11841492 Wu N, Bayatpour S, Hylemon PB, Aseem SO, Brindley PJ, Zhou H. Gut microbiome and bile acid interactions: mechanistic implications for cholangiocarcinoma development, immune resistance, and therapy. Am J Pathol. 2025;195(3):397–408. 39730075 10.1016/j.ajpath.2024.11.004 PMC11841492 121. Xu K Kessler A Nichetti F Hoffmeister-Wittmann P Scherr AL Nader L Lymphotoxin beta-activated LTBR/NIK/RELB axis drives proliferation in cholangiocarcinoma Liver Int 2024 44 11 2950 63 10.1111/liv.16069 39164890 Xu K, Kessler A, Nichetti F, Hoffmeister-Wittmann P, Scherr AL, Nader L, et al. Lymphotoxin beta-activated LTBR/NIK/RELB axis drives proliferation in cholangiocarcinoma. Liver Int. 2024;44(11):2950–63. 39164890 10.1111/liv.16069 122. Qu J Yuan Z Wang G Wang X Li K The selective NLRP3 inflammasome inhibitor MCC950 alleviates cholestatic liver injury and fibrosis in mice Int Immunopharmacol 2019 70 147 55 10.1016/j.intimp.2019.02.016 30802677 Qu J, Yuan Z, Wang G, Wang X, Li K. The selective NLRP3 inflammasome inhibitor MCC950 alleviates cholestatic liver injury and fibrosis in mice. Int Immunopharmacol. 2019;70:147–55. 30802677 10.1016/j.intimp.2019.02.016 123. Hao H Cao L Jiang C Che Y Zhang S Takahashi S Farnesoid X receptor regulation of the NLRP3 inflammasome underlies Cholestasis-Associated sepsis Cell Metab 2017 25 4 856 e675 10.1016/j.cmet.2017.03.007 28380377 PMC6624427 Hao H, Cao L, Jiang C, Che Y, Zhang S, Takahashi S, et al. Farnesoid X receptor regulation of the NLRP3 inflammasome underlies Cholestasis-Associated sepsis. Cell Metab. 2017;25(4):856–e675. 28380377 10.1016/j.cmet.2017.03.007 PMC6624427 124. Cai SY Ge M Mennone A Hoque R Ouyang X Boyer JL Inflammasome is activated in the liver of cholestatic patients and aggravates hepatic injury in bile duct-ligated mouse Cell Mol Gastroenterol Hepatol 2020 9 4 679 88 10.1016/j.jcmgh.2019.12.008 31887435 PMC7160576 Cai SY, Ge M, Mennone A, Hoque R, Ouyang X, Boyer JL. Inflammasome is activated in the liver of cholestatic patients and aggravates hepatic injury in bile duct-ligated mouse. Cell Mol Gastroenterol Hepatol. 2020;9(4):679–88. 31887435 10.1016/j.jcmgh.2019.12.008 PMC7160576 125. Nasir I McGuinness C Poh AR Ernst M Darcy PK Britt KL Tumor macrophage functional heterogeneity can inform the development of novel cancer therapies Trends Immunol 2023 44 12 971 85 10.1016/j.it.2023.10.007 37995659 Nasir I, McGuinness C, Poh AR, Ernst M, Darcy PK, Britt KL. Tumor macrophage functional heterogeneity can inform the development of novel cancer therapies. Trends Immunol. 2023;44(12):971–85. 37995659 10.1016/j.it.2023.10.007 ",
  "metadata": {
    "Title of this paper": "Tumor macrophage functional heterogeneity can inform the development of novel cancer therapies",
    "Journal it was published in:": "Cell Communication and Signaling : CCS",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490064/"
  }
}