{
  "title": "Paper_147",
  "abstract": "pmc Respirol Case Rep Respirol Case Rep 2562 respcasrep RCR2 Respirology Case Reports 2051-3380 Wiley PMC12488395 PMC12488395.1 12488395 12488395 10.1002/rcr2.70366 RCR270366 RCR-25-357.R1 1 Case Report Case Report Aspirated Soybean Mimicking Endobronchial Tumour Removed With a Cryoprobe Matsumoto Shoichiro  1 Takigawa Yuki https://orcid.org/0000-0003-0613-0423  1 tacky1024@gmail.com Sato Ken  1 Honda Kodai  1 Otsuki Mariko  1 Ido Satoko  1 Goda Mayu  1 Shiraha Keisuke https://orcid.org/0009-0005-2383-9532  1 Ichikawa Takeru  1 Matsuoka Suzuka https://orcid.org/0000-0003-0492-4019  1 Nishimura Jun  1 Watanabe Hiromi  1 Kudo Kenichiro  1 Fujiwara Keiichi  1 Shibayama Takuo  1   1 Department of Respiratory Medicine NHO Okayama Medical Center Okayama Japan * Correspondence: tacky1024@gmail.com 01 10 2025 10 2025 13 10 497535 10.1002/rcr2.v13.10 e70366 15 9 2025 22 8 2025 21 9 2025 01 10 2025 03 10 2025 03 10 2025 © 2025 The Author(s). Respirology Case Reports https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Adult airway foreign bodies are misdiagnosed as endobronchial tumours on imaging. A 77‐year‐old man with asbestosis presented with a worsening cough. Computed tomography (CT) showed a 12‐mm low‐attenuation right upper‐lobe bronchial lesion with distal bronchiectasis and infiltrates. Magnetic resonance imaging (MRI) suggested a fat‐containing tumour (lipoma or hamartoma). Flexible bronchoscopy revealed a yellowish polypoid mass; poor sedation tolerance necessitated rigid bronchoscopy under general anaesthesia. Using a 1.7‐mm cryoprobe, the lesion was cryoactivated for 10 s and removed en bloc. It proved to be a foreign body resembling a legume and was later confirmed to be an aspirated soybean from 1 month earlier. The fat and water content of soybeans can yield MRI appearances similar to fatty tumours. Distinguishing tumours from foreign bodies by imaging or bronchoscopy alone is challenging. Cryoprobe extraction is effective for hydrated foreign bodies, and aspiration should be considered in the differential diagnosis of endobronchial tumours. We present a case of an airway foreign body removed by cryoprobe that was initially considered to be endotracheal lipoma or endobronchial hamartoma based on imaging findings. accidental aspiration airway foreign bodies cryotherapy rigid bronchoscopy soybean pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  S. Matsumoto Y. Takigawa K. Sato Aspirated Soybean Mimicking Endobronchial Tumour Removed With a Cryoprobe Respirology Case Reports 13 10 2025 e70366 10.1002/rcr2.70366  Associate Editor:  Funding: 1 Introduction Airway foreign bodies are more commonly found in the right lower lobe, and only approximately 5% are impacted in the right upper lobe [ 1 2 2 Case Report A 77‐year‐old man presented with a chief complaint of worsening cough. His medical history included asbestosis, postoperative adhesive small bowel obstruction, and postoperative acute appendicitis. He had never smoked. He had a known history of asbestosis and chronic cough. However, his cough worsened in late April 2025, prompting a visit to a respiratory specialist at a previous hospital in May 2025. He was subsequently referred to our department for further evaluation because of abnormal chest computed tomography (CT) findings. The CT demonstrated a 12‐mm endobronchial tumour with low attenuation in the right upper‐lobe bronchus. Bronchiectasis and some infiltrative shadows suggestive of obstructive pneumonia were observed distally (Figure 1A 1B FIGURE 1 Imaging obtained before bronchoscopy. (A) The CT demonstrated a 12‐mm endobronchial tumour with low attenuation in the right upper lobe bronchus. Bronchiectasis and some infiltrative shadows, suggestive of obstructive pneumonia, were observed. (B) The tumour in the right upper lobe bronchus appeared hyperintense on T1‐weighted magnetic resonance imaging (MRI) and underwent signal suppression on fat‐suppressed T1‐weighted images. The lesion appeared hypointense on STIR images. The radiologist interpreted these findings as suggestive of a fat‐containing tumour. Diagnostic resection of the lesion at the proximal right upper‐lobe bronchus was deemed necessary. Flexible bronchoscopy was performed under intravenous and topical anaesthesia on day two of hospitalisation. A yellowish tumour covered with mucus was observed at the proximal right upper‐lobe bronchus (Figure 2A 2B,C 2D 2E FIGURE 2 Imaging obtained during bronchoscopy. A yellowish tumour covered with mucus was observed at the proximal right upper lobe bronchus (A). A 1.7‐mm single‐use cryoprobe was applied to the surface of the tumour to freeze it for 10 s. The tumour unexpectedly split in half during this process. Each half was subsequently frozen for 10 s and removed from the airway (B–D). The lesion was found to be a foreign body resembling a legume rather than the initially suspected fat‐containing tumour (D). Residual findings of the foreign body were not observed. The airway was patent, with only mild granulation observed (E). 3 Discussion Airway foreign bodies are often identified before bronchoscopy in 30%–50% of cases. Many adult aspiration events remain undiagnosed because patients are unaware of the incident. Even when patients are conscious and oriented, aspiration of small food items may go unrecognised. If a foreign body lodges in the peripheral bronchi, symptoms are often mild and nonspecific—such as cough or chest discomfort—leading to frequent misinterpretation as upper respiratory infection or bronchitis. Habitual alcohol consumption increases aspiration risk even in individuals without a history of cerebrovascular disease, neuromuscular disorders, or aspiration pneumonia; this risk is often unrecognised by patients [ 3 At our institution, in addition to performing CT for endobronchial tumours, patients also undergo MRI to help predict intra‐tumoral characteristics and assess submucosal and extramural extension, thereby informing treatment planning. Fat‐suppressed sequences are diagnostic for lipoma, and in carcinoid tumours, combining MRI with CT has been reported to improve diagnostic accuracy [ 4 5 The yellowish polypoid tumour covered with mucus observed during bronchoscopy was consistent with previously reported cases of yellowish polyps observed in endobronchial lipomas. The preoperative diagnosis of a bronchial tumour rich in fatty components, such as an endobronchial lipoma or lipomatous hamartoma, was made based on preoperative bronchoscopy, CT, and MRI findings. However, the specimen obtained via cryoprobe was later identified as a soybean. Soybeans generally have a high fat content. The soybean in this case had been boiled, presumably giving it a high‐water content. Mixtures of water and oil produce significant artefacts on MRI [ 6 7 8 Bronchial tumours are typically removed using a high‐frequency snare or cryoprobe at our institution. In our institution's interventional pulmonology practice, peripheral pulmonary lesions are typically frozen for 4–8 s using a 1.7‐mm cryoprobe. For central airway lesions with a high risk of bleeding, freezing is initiated for 3–5 s and then adjusted (3–10 s) based on bleeding status and specimen adequacy [ 9 Organic foreign bodies such as peanuts and beans contain moisture, and their surfaces freeze readily, allowing firm adhesion to the cryoprobe. They can therefore often be removed en bloc, reducing the risk of fragmentation or residual material. By contrast, inorganic foreign bodies (e.g., plastic or metal) lack moisture, making adhesion by freezing unlikely; in such cases, forceps or baskets are usually more effective. The soybean was incidentally split into two, and both pieces were completely removed in two passes. Attempting removal with forceps would likely have caused fragmentation, scattering, and retention within the airway; thus, cryoprobe removal was advantageous. The use of a cryoprobe is recommended for effective treatment when differentiating between a tumour and a foreign body, particularly an organic foreign body, is difficult. In conclusion, a bronchial foreign body (soybean) that was initially considered to be a fat content endobronchial tumour and was safely and completely removed under general anaesthesia using a cryoprobe. This case highlights the need to consider airway foreign bodies when a bronchial tumour is included in the differential diagnosis. Clinicians should obtain detailed clinical history preoperatively and ensure that devices for removing foreign bodies are readily available during bronchoscopic removal. Author Contributions Shoichiro Matsumoto and Yuki Takigawa wrote the manuscript, which was reviewed by all co‐authors. All authors have approved the final version of the manuscript for submission. Consent The authors declare that written informed consent was obtained for the publication of this manuscript and accompanying images and attest that the form used to obtain consent from the patient complies with the journal requirements as outlined in the author guidelines. Conflicts of Interest Yuki Takigawa received lecture fees from AMCO, Japan. Acknowledgements We would like to thank Editage ( www.editage.com Data Availability Statement The data that support the findings of this study are available from the corresponding author upon reasonable request. References 1 S. Kaddah S. Ahmed Management of Airway Foreign Body Using Flexible Bronchoscopy: Experience With 80 Cases During 2011‐2013 Egyptian Journal of Chest Diseases and Tuberculosis 64 1 2015 261 267 10.1016/j.ejcdt.2014.11.020 2 Y. Guan T. Yang X. Chen P. Zhuang Y. Li L. Li A Rare Case of Foreign Body Inhalation Masquerading as Calcification in the Right Upper Lobe Suggestive of Tuberculosis Respiratory Medicine Case Reports 51 2024 102102 10.1016/j.rmcr.2024.102102 39286408 PMC11404072 3 P. Ish N. Kumar S. Mohan Hidden in Plain Sight: Unraveling the Mystery of Hemoptysis Journal of Advanced Lung Health 5 2 2025 109 110 10.4103/jalh.jalh_16_24 4 A. Bedayat E. Yang S. Ghandili Tracheobronchial Tumors: Radiologic‐Pathologic Correlation of Tumors and Mimics Current Problems in Diagnostic Radiology 49 4 2020 275 284 10.1067/j.cpradiol.2019.04.003 31076268 PMC7115773 5 M. Maehara K. Ikeda N. Ohmura H. Kurokawa N. Sakaida S. Sawada Leiomyoma of the Trachea: CT and MRI Findings Radiation Medicine 24 9 2006 643 645 10.1007/s11604-006-0081-7 17111275 6 Y. S. Hong J. H. Cho N. R. Kim Artifacts in the Measurement of Water Distribution in Soybeans Using MR Imaging Food Chemistry 112 1 2009 267 272 10.1016/j.foodchem.2008.05.109 7 J. H. Ha B. H. Jeong Airway Foreign Body Mimicking an Endobronchial Tumor Presenting With Pneumothorax in an Adult: A Case Report Medicina (Kaunas, Lithuania) 57 1 2021 50 10.3390/medicina57010050 33430107 PMC7827418 8 A. Cara A. Mazzella L. Spaggiari Exceptional Case of Endobronchial Foreign Body Mimicking Primitive Lung Cancer Archivos de Bronconeumología 58 9 2022 662 10.1016/j.arbres.2022.01.012 35287997 9 Y. Takigawa K. Sato T. Inoue M. Takada K. Fujiwara Image of a Thawed Frozen Specimen Obtained Using a Cryoprobe Floated With Oil Droplets in Normal Saline: An Endobronchial Lipomatous Hamartoma Image Respirology Case Reports 12 3 2024 e01318 10.1002/rcr2.1318 38445221 PMC10914470 ",
  "metadata": {
    "Title of this paper": "Image of a Thawed Frozen Specimen Obtained Using a Cryoprobe Floated With Oil Droplets in Normal Saline: An Endobronchial Lipomatous Hamartoma Image",
    "Journal it was published in:": "Respirology Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488395/"
  }
}