{
  "title": "Paper_721",
  "abstract": "pmc Jpn J Radiol Jpn J Radiol 365 springeropen Japanese Journal of Radiology 1867-1071 1867-108X pmc-is-collection-domain yes pmc-collection-title Springer PMC12479586 PMC12479586.1 12479586 12479586 40580273 10.1007/s11604-025-01811-8 1811 1 Invited Review Comprehensive review of pulmonary embolism imaging: past, present and future innovations in computed tomography (CT) and other diagnostic techniques Triggiani Sonia 1 Pellegrino Giuseppe 1 http://orcid.org/0009-0004-3735-5494 Mortellaro Sveva sveva.mortellaro@unimi.it 1 Bubba Alessandra 1 Lanza Carolina 2 Carriero Serena 2 Biondetti Pierpaolo 2 Angileri Salvatore Alessio 2 Fusco Roberta 3 Granata Vincenza 3 Carrafiello Gianpaolo 1 2 1 https://ror.org/00wjc7c48 grid.4708.b 0000 0004 1757 2822 Postgraduation School in Radiodiagnostics, University of Milan, 2 https://ror.org/016zn0y21 grid.414818.0 0000 0004 1757 8749 Radiology Department, Fondazione IRCCS Cà Granda, Policlinico di Milano Ospedale Maggiore, 3 https://ror.org/0506y2b23 grid.508451.d 0000 0004 1760 8805 Division of Radiology, Istituto Nazionale per lo studio e la cura dei Tumori “Fondazione G. Pascale”, 28 6 2025 2025 43 10 497829 1575 1589 15 5 2025 21 5 2025 28 06 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Pulmonary embolism (PE) remains a critical condition that demands rapid and accurate diagnosis, for which computed tomographic pulmonary angiography (CTPA) is widely recognized as the diagnostic gold standard. However, recent advancements in imaging technologies—such as dual-energy computed tomography (DECT), photon-counting CT (PCD-CT), and artificial intelligence (AI)—offer promising enhancements to traditional diagnostic methods. This study reviews past, current and emerging technologies, focusing on their potential to optimize diagnostic accuracy, reduce contrast volumes and radiation doses, and streamline clinical workflows. DECT, with its dual-energy imaging capabilities, enhances image clarity even with lower contrast media volumes, thus reducing patient risk. Meanwhile, PCD-CT has shown potential for dose reduction and superior image resolution, particularly in challenging cases. AI-based tools further augment diagnostic speed and precision by assisting radiologists in image analysis, consequently decreasing workloads and expediting clinical decision-making. Collectively, these innovations hold promise for improved clinical management of PE, enabling not only more accurate diagnoses but also safer, more efficient patient care. Further research is necessary to fully integrate these advancements into routine clinical practice, potentially redefining diagnostic workflows for PE and enhancing patient outcomes. Keywords Pulmonary embolism (EP) Computed tomographic pulmonary angiography (CTPA) Dual-energy computed tomography (DECT) Photon-counting detector CT (PCD-CT) Artificial intelligence (AI) Computer-aid detection (CAD) pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Japan Radiological Society 2025 Introduction Pulmonary embolism (PE) is a thrombotic vascular disease that can fall under venous thromboembolism (VTE) along with deep vein thrombosis [ 1 2 3 4 5 9 The etiopathogenesis of PE and VTE is due to the so-called ‘Virchow triad’, named for the physician who, in the nineteenth century, identified three factors as responsible for thrombus formation: blood flow stasis, vascular endothelial damage, and hypercoagulability [ 10 11 12 13 14 13 14 13 14 13 14 5 7 15 16 5 17 20 6 21 22 23 24 26 27 28 29 1 2 3 30 31 11 14 32 33 14 29 34 35 36 14 37 14 37 38 14 37 39 40 14 37 14 37 41 43 44 14 45 46 47 Fig. 1 Coronal CTA scan that reveals massive arterial occlusion with failure to enhance the entire lumen due to a substantial filling defect of the right lobar arteries Fig. 2 Axial CTA scan shows massive arterial occlusion with failure to enhance the entire lumen due to a substantial filling defect of both left and right lobar arteries Fig. 3 Axial CTA scan reveals submassive PE of a right subsegmental lobar artery Our aim is then to highlight the importance of CTPA in the diagnosis, follow-up, and evaluation of PE and to shed light on new technologies and perspectives that currently are or have future potential to improve the overall management of this condition. Imaging techniques Past and current imaging To achieve a more comprehensive review of the literature, diagnostic techniques no longer commonly used in clinical practice were included, as they nonetheless represented important milestones in the diagnosis of pulmonary embolism prior to the advent of CTPA. Chest radiography Chest radiography represents the first radiological tool employed in patients with dyspnea, allowing the diagnosis of clinical conditions such as pneumonia or pulmonary edema [ 48 30 49 All over the years, several research studies have identified some radiological findings in PE patients with high specificity but with low sensitivity: in 1938, Westermark described for the first time a difference between embolism with and without infarction on an X-ray examination. When an area of infarct is present, it appears as a wedge-shaped, dense, homogeneous shadow, whereas in cases of PE without infarction, ischemia occurs in the branches of the pulmonary artery on the distal side of the embolus and manifests as a clarified area with reduced vascular markings that correspond to the territory supplied by the affected artery. Despite this, vascularization remains intact in the central regions of the lung. However, the vascular structures abruptly terminate at the boundary of the area of non-vascularization [ 50 51 52 48 53 54 Ventilation/perfusion (V/Q) lung scintigraphy Another imaging technique that should be mentioned, which is not specific to the detection of PE since its introduction in the mid-1960s, is V/Q lung scintigraphy [ 48 55 56 49 48 57 48 57 59 55 60 61 55 56 56 Angiography The role of conventional angiography is usually not appropriate for diagnosing PE due to the lower overall accuracy compared to CTPA [ 49 48 Magnetic resonance imaging (MRI) A limited application in the detection of PE is currently reserved also for MRI. According to the American College of Radiology (ACR), Appropriateness Criteria® MR angiography pulmonary arteries without and with intravenous contrast may be appropriate as initial imaging in suspected PE both at low or intermediate pretest probability with a positive D-dimer and at high pretest probability [ 49 62 63 60 48 64 60 60 64 Compression ultrasonography (CUS) A cheaper and faster imaging technique is the CUS duplex doppler of the lower extremity, which may be appropriate as initial imaging in high pretest probability PE. However, not all authors agree with this statement [ 31 65 66 49 48 67 48 66 49 55 48 Positron emission tomography (PET) The utility of PET in detecting pulmonary embolism PE has been investigated, highlighting its potential advantages. Gallium-68 V/Q PET/CT offers lower radiation exposure, improved resolution, and shorter acquisition times compared to SPECT, making it particularly beneficial for cancer patients where CTPA fails to provide definitive or conclusive results for suspected acute PE [ 68 69 70 71 Computed tomographic pulmonary angiography (CTPA) Over the years, the previously mentioned techniques have found their role in the diagnosis of PE, but nowadays, the gold standard is represented by CTPA. In 2006 the Prospective Investigation of Pulmonary Embolism Diagnosis II (PIOPED II) trial demonstrated that multidetector CT angiography (CTA)—CT venography (CTV) has higher sensitivity for diagnosis of PE compared to CTA alone, with comparable specificity and either CTA or CTA-CTV, have high predictive accuracy when supported by a consistent clinical assessment [ 44 49 48 60 72 48 60 72 73 48 72 74 72 75 72 75 76 72 77 72 78 72 72 20 79 82 CTPA technical optimization: dose and contrast reduction Chest X-ray has historically had a role in the diagnosis of PE with specific radiographic findings (e.g., Westermark sign) [ 83 86 87 88 89 92 93 94 95 96 97 98 99 100 101 102 103 1 Table 1 Literature about the methods of dose and contrast reduction in the detection of PE Author Year Type of study Number of CTPA Performance score Kaul et al. [ 99 2014 Retrospective 44 Overall diagnosability = 4.54 ± 0.45 Lu et al. [ 100 2014 Prospective 100 Sensitivity = 93.3% [95% CI: 68.1–99.8] Specificity = 97.1% [95% CI: 85.1–99.9] PPV = 93.3% [95% CI: 68.1–99.8] NPV = 97.1% [95% CI: 85.1–99.9] Szucs-Farkas et al. [ 95 2011 Retrospective 3350 Sensitivity = 81.3% [95% CI: 78–84]; Specificity = 98.2% [95% CI: 98–99]; PPV = 44.4 [95% CI: 33–59] NPV = 0.19 [95% CI: 0.16–0.22] New CT technologies In recent years, different innovations in CT technology have developed, intending to increase imaging quality (making diagnosis more accurate) and, at the same time, reduce impairing CT image defects (movement/breathing artifacts, image noise). As previously shown, these innovations also cut radiation exposure and the use of high contrast volume. Among these CT innovations, the most studied technologies include DECT and PCD-CT. DECT offers the possibility to provide both morphological and functional pulmonary information of the lung in a single contrast-enhanced examination through different post-processing techniques (like linear blending, iodine maps, and virtual monoenergetic (VM) reconstructions), which have been shown to improve image quality and visualization of vascular structures [ 46 104 106 107 108 PCD-CT is an innovative imaging technology that utilizes photon-counting detectors instead of conventional energy-integrating detectors used in traditional CT scanners [ 109 110 111 112 113 Artificial intelligence Decoding CTPA to detect PE is laborious and mentally challenging for radiologists, given the extensive number of CT images and vessels that necessitate evaluation. Radiologists must meticulously track down to the sub-branch of the sixth stage of the pulmonary artery or even smaller for potential abnormalities [ 114 115 116 120 47 121 121 122 123 132 133 137 115 47 138 139 140 140 114 141 142 143 144 144 In the context of PE detection, it becomes evident that a deep learning system can effectively function as a secondary reader, providing immediate interpretation and prioritization of positive studies. Ultimately, an AI-based tool holds the potential to speed up PE diagnosis. Given the critical importance of timely diagnosis, the integration of a triage model can significantly enhance the overall quality of care of the patient. Table 2 Table 2 Literature about AI’s application in PE detection Author Year Type of study Number of CTPA Performance score Topff et al. [ 141 2023 Prospective, Single center 11,736 Sensitivity: 91.6% [95% CI: 86.7, 95.8]; Specificity: 99.7% [95% CI: 99.6, 99.8]; PPV: 80.9% [95% CI: 74.7, 86.4]; NPV: 99.9% [95% CI: 99.8, 99.9]; Accuracy: 99.6% [95% CI: 99.5, 99.7] Langius‐Wiffen et al. [ 139 2023 Retrospective, single center 3316 Sensitivity: 96.8% [95% CI: 95.5–98.1]; specificity: 99.9% [95% CI: 99.8–100]; PPV: 99.7 [95% CI: 99.3–100.0]; NPV: 99.1 [95% CI: 98.8–99.5] Grenier et al. [ 138 2023 Retrospective, multicenter 109 Sensitivity: 91.4% [95% CI: 86.4–95.0%]; specificity: 91.5% [95% CI: 86.8–95.0%]; accuracy: 91.5% Batra et al. [ 142 2022 Retrospective, single center 3016 Sensitivity: 82.5 [95% CI: 67.2–92.7]; Specificity 99.8 [95% CI: 99.5–99.9]; PPV: 86.8 [95% CI: 73.1–94.1] NPV: 99.8 [95% CI: 99.5–99.9] Schmuelling et al. [ 114 2021 Retrospective, single center 1808 Sensitivity 79.6% (95% CI: 70.8–87.2%); specificity 95.0% (95% CI: 92.0–97.1%); PPV 82.2% (95% CI: 73.9–88.3); NPV 94.1% (95% CI: 91.4–96%) Li et al. [ 115 2021 Retrospective, single center 85 Sensitivity: 90.9%; average number of false positives per case: 2.0 Liu et al. [ 140 2020 Retrospective, single center 590 Sensitivity: 94.6%; Specificity: 76.5% AUC: 0.926 (95% CI: 0.884–0.968) Lahiji et al. [ 47 2014 Retrospective, Single center 66 Sensitivity 70.3% for FBP; Specificity 30.3% for FBP; Accuracy 77.3% Özkan et al. [ 121 2013 Retrospective, Single center 33 Sensitivity of 95.1% Future challenges Prospective multicenter studies are essential to validate the efficacy of emerging technologies such as DECT, PDCT, and AI algorithms for the automated detection of PE. These investigations should aim to enhance radiologist performance and improve patient clinical outcomes. Moreover, future studies should include data such as comorbidities and laboratory results to improve the performance of AI tools. In addition, future research should investigate the impact of timely identification of incidental pulmonary emboli on both morbidity and mortality. Another interesting future application could be the introduction of radiomics in the workflow of PE imaging. Applications in the field of vascular pathology have already been studied in other districts for the density classification of thrombotic and embolic findings [ 145 149 150 151 163 Conclusions Pulmonary embolism represents an extremely urgent condition that requires a precise and detailed diagnosis. Technological progress has ensured the use of increasingly high-performance diagnostic tools both in the acquisition and post-processing phases. CTPA is the main diagnostic tool, and thanks to the optimization techniques that reduce contrast and radiation dose, it is a safe approach for the patient. In addition, DECT and PDCT are not employed during routine diagnostic procedures, but they have proven to be highly accurate methods in PE diagnosis. AI approaches could improve the diagnostic workflow either in risk assessment or to assess PE during CT studies obtained with no dedicated protocol to increase PPV in cancer patients. Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions Conceptualization, ST and GP; methodology, ST, GP, CL; validation, VG, PB, SAA; formal analysis, ST; investigation, ST, GP, SM, AB; resources, ST, GP,SM, AB; data curation, ST, SM; writing—original draft preparation, ST, SM, AB, GP, CL, SC; writing—review and editing, RF, VG; visualization and supervision, GC; project administration, ST, SM. All authors have read and agreed to the published version of the manuscript. Funding This research received no external funding. Declarations Conflict of interest The authors declare no conflicts of interest. References 1. Saghazadeh A Hafizi S Rezaei N Inflammation in venous thromboembolism: cause or consequence? Int Immunopharmacol 2015 28 655 665 10.1016/j.intimp.2015.07.044 26253657 Saghazadeh A, Hafizi S, Rezaei N. Inflammation in venous thromboembolism: cause or consequence? Int Immunopharmacol. 2015;28:655–65. 10.1016/j.intimp.2015.07.044. 26253657 10.1016/j.intimp.2015.07.044 2. Di Nisio M van Es N Büller HR Deep vein thrombosis and pulmonary embolism Lancet 2016 388 3060 3073 10.1016/S0140-6736(16)30514-1 27375038 Di Nisio M, van Es N, Büller HR. Deep vein thrombosis and pulmonary embolism. Lancet. 2016;388:3060–73. 10.1016/S0140-6736(16)30514-1. 27375038 10.1016/S0140-6736(16)30514-1 3. Dalen JE Pulmonary embolism: what have we learned since Virchow? Chest 2002 122 1440 1456 10.1378/chest.122.4.1440 12377877 Dalen JE. Pulmonary embolism: what have we learned since Virchow? Chest. 2002;122:1440–56. 10.1378/chest.122.4.1440. 12377877 10.1378/chest.122.4.1440 4. Raskob G Angchaisuksiri P Blanco A Thrombosis: a major contributor to global disease burden Semin Thromb Hemost 2014 40 724 735 10.1055/s-0034-1390325 25302681 Raskob G, Angchaisuksiri P, Blanco A, et al. Thrombosis: a major contributor to global disease burden. Semin Thromb Hemost. 2014;40:724–35. 10.1055/s-0034-1390325. 25302681 10.1055/s-0034-1390325 5. Suh YJ Hong H Ohana M Pulmonary embolism and deep vein thrombosis in COVID-19: a systematic review and meta-analysis Radiology 2021 298 E70 E80 10.1148/radiol.2020203557 33320063 PMC7745997 Suh YJ, Hong H, Ohana M, et al. Pulmonary embolism and deep vein thrombosis in COVID-19: a systematic review and meta-analysis. Radiology. 2021;298:E70–80. 10.1148/radiol.2020203557. 33320063 10.1148/radiol.2020203557 PMC7745997 6. Riyahi S Dev H Behzadi A Pulmonary embolism in hospitalized patients with COVID-19: a multicenter study Radiology 2021 301 E426 E433 10.1148/radiol.2021210777 34254850 PMC8294351 Riyahi S, Dev H, Behzadi A, et al. Pulmonary embolism in hospitalized patients with COVID-19: a multicenter study. Radiology. 2021;301:E426–33. 10.1148/radiol.2021210777. 34254850 10.1148/radiol.2021210777 PMC8294351 7. Miró Ò Jiménez S Mebazaa A Pulmonary embolism in patients with COVID-19: incidence, risk factors, clinical characteristics, and outcome Eur Heart J 2021 42 3127 3142 10.1093/eurheartj/ehab314 34164664 PMC8344714 Miró Ò, Jiménez S, Mebazaa A, et al. Pulmonary embolism in patients with COVID-19: incidence, risk factors, clinical characteristics, and outcome. Eur Heart J. 2021;42:3127–42. 10.1093/eurheartj/ehab314. 34164664 10.1093/eurheartj/ehab314 PMC8344714 8. Kho J Ioannou A Van den Abbeele K Pulmonary embolism in COVID-19: clinical characteristics and cardiac implications Am J Emerg Med 2020 38 2142 2146 10.1016/j.ajem.2020.07.054 33046316 PMC7378013 Kho J, Ioannou A, Van den Abbeele K, et al. Pulmonary embolism in COVID-19: clinical characteristics and cardiac implications. Am J Emerg Med. 2020;38:2142–6. 10.1016/j.ajem.2020.07.054. 33046316 10.1016/j.ajem.2020.07.054 PMC7378013 9. Yousaf M Thomas MM Almughalles S Pulmonary embolism in COVID-19, risk factors and association with inflammatory biomarkers Medicine (Baltimore) 2023 102 e32887 10.1097/MD.0000000000032887 36800623 PMC9936004 Yousaf M, Thomas MM, Almughalles S, et al. Pulmonary embolism in COVID-19, risk factors and association with inflammatory biomarkers. Medicine (Baltimore). 2023;102: e32887. 10.1097/MD.0000000000032887. 36800623 10.1097/MD.0000000000032887 PMC9936004 10. Cronenwett JL Anderson FA Physician practices in the management of venous thromboembolism: a community-wide survey J Vasc Surg 1992 16 a41080 10.1067/mva.1992.41080 1433658 Cronenwett JL, Anderson FA. Physician practices in the management of venous thromboembolism: a community-wide survey. J Vasc Surg. 1992;16: a41080. 10.1067/mva.1992.41080. 10.1067/mva.1992.41080 1433658 11. Fox EA Kahn SR The relationship between inflammation and venous thrombosis Thromb Haemost 2005 94 362 365 10.1160/TH05-04-0266 16113826 Fox EA, Kahn SR. The relationship between inflammation and venous thrombosis. Thromb Haemost. 2005;94:362–5. 10.1160/TH05-04-0266. 16113826 10.1160/TH05-04-0266 12. Riva N Donadini MP Ageno W Epidemiology and pathophysiology of venous thromboembolism: similarities with atherothrombosis and the role of inflammation Thromb Haemost 2015 113 1176 1183 10.1160/TH14-06-0563 25472800 Riva N, Donadini MP, Ageno W. Epidemiology and pathophysiology of venous thromboembolism: similarities with atherothrombosis and the role of inflammation. Thromb Haemost. 2015;113:1176–83. 10.1160/TH14-06-0563. 25472800 10.1160/TH14-06-0563 13. Turetz M Sideris AT Friedman OA Epidemiology, pathophysiology, and natural history of pulmonary embolism Semin Intervent Radiol 2018 35 92 98 10.1055/s-0038-1642036 29872243 PMC5986574 Turetz M, Sideris AT, Friedman OA, et al. Epidemiology, pathophysiology, and natural history of pulmonary embolism. Semin Intervent Radiol. 2018;35:92–8. 10.1055/s-0038-1642036. 29872243 10.1055/s-0038-1642036 PMC5986574 14. Konstantinides SV Meyer G Becattini C 2019 ESC guidelines for the diagnosis and management of acute pulmonary embolism developed in collaboration with the European Respiratory Society (ERS) Eur Heart J 2020 41 543 603 10.1093/eurheartj/ehz405 31504429 Konstantinides SV, Meyer G, Becattini C, et al. 2019 ESC guidelines for the diagnosis and management of acute pulmonary embolism developed in collaboration with the European Respiratory Society (ERS). Eur Heart J. 2020;41:543–603. 10.1093/eurheartj/ehz405. 31504429 10.1093/eurheartj/ehz405 15. Hughes K Hussaini Z Shah MK COVID-19 and acute pulmonary embolism: a case series and brief review Am J Med Sci 2021 361 646 649 10.1016/j.amjms.2020.12.005 33773760 PMC7874943 Hughes K, Hussaini Z, Shah MK, et al. COVID-19 and acute pulmonary embolism: a case series and brief review. Am J Med Sci. 2021;361:646–9. 10.1016/j.amjms.2020.12.005. 33773760 10.1016/j.amjms.2020.12.005 PMC7874943 16. Dane B Smereka P Wain R Hypercoagulability in patients with coronavirus disease (COVID-19): identification of arterial and venous thromboembolism in the abdomen, pelvis, and lower extremities AJR Am J Roentgenol 2021 216 104 105 10.2214/AJR.20.23617 32603220 Dane B, Smereka P, Wain R, et al. Hypercoagulability in patients with coronavirus disease (COVID-19): identification of arterial and venous thromboembolism in the abdomen, pelvis, and lower extremities. AJR Am J Roentgenol. 2021;216:104–5. 10.2214/AJR.20.23617. 32603220 10.2214/AJR.20.23617 17. Masci GM Izzo A Bonito G Chest CT features of COVID-19 in vaccinated versus unvaccinated patients: use of CT severity score and outcome analysis Radiol Med 2023 128 934 943 10.1007/s11547-023-01664-z 37354309 PMC10338619 Masci GM, Izzo A, Bonito G, et al. Chest CT features of COVID-19 in vaccinated versus unvaccinated patients: use of CT severity score and outcome analysis. Radiol Med. 2023;128:934–43. 10.1007/s11547-023-01664-z. 37354309 10.1007/s11547-023-01664-z PMC10338619 18. Varadarajan V Shabani M AmbaleVenkatesh B Lima JAC Role of imaging in diagnosis and management of COVID-19: a multiorgan multimodality imaging review Front Med (Lausanne) 2021 10.3389/fmed.2021.765975 34820400 PMC8606587 Varadarajan V, Shabani M, AmbaleVenkatesh B, Lima JAC. Role of imaging in diagnosis and management of COVID-19: a multiorgan multimodality imaging review. Front Med (Lausanne). 2021. 10.3389/fmed.2021.765975. 34820400 10.3389/fmed.2021.765975 PMC8606587 19. Pezzutti DL Wadhwa V Makary MS COVID-19 imaging: diagnostic approaches, challenges, and evolving advances World J Radiol 2021 13 171 191 10.4329/wjr.v13.i6.171 34249238 PMC8245752 Pezzutti DL, Wadhwa V, Makary MS. COVID-19 imaging: diagnostic approaches, challenges, and evolving advances. World J Radiol. 2021;13:171–91. 10.4329/wjr.v13.i6.171. 34249238 10.4329/wjr.v13.i6.171 PMC8245752 20. Kanne JP Bai H Bernheim A COVID-19 imaging: what we know now and what remains unknown Radiology 2021 299 E262 E279 10.1148/radiol.2021204522 33560192 PMC7879709 Kanne JP, Bai H, Bernheim A, et al. COVID-19 imaging: what we know now and what remains unknown. Radiology. 2021;299:E262–79. 10.1148/radiol.2021204522. 33560192 10.1148/radiol.2021204522 PMC7879709 21. Trunz LM Lee P Lange SM Imaging approach to COVID-19 associated pulmonary embolism Int J Clin Pract 2021 10.1111/ijcp.14340 33966326 PMC8237008 Trunz LM, Lee P, Lange SM, et al. Imaging approach to COVID-19 associated pulmonary embolism. Int J Clin Pract. 2021. 10.1111/ijcp.14340. 33966326 10.1111/ijcp.14340 PMC8237008 22. Wismüller A DSouza AM Abidin AZ Early-stage COVID-19 pandemic observations on pulmonary embolism using nationwide multi-institutional data harvesting NPJ Digit Med 2022 5 120 10.1038/s41746-022-00653-2 35986059 PMC9388980 Wismüller A, DSouza AM, Abidin AZ, et al. Early-stage COVID-19 pandemic observations on pulmonary embolism using nationwide multi-institutional data harvesting. NPJ Digit Med. 2022;5: 120. 10.1038/s41746-022-00653-2. 35986059 10.1038/s41746-022-00653-2 PMC9388980 23. Dalpiaz G Gamberini L Carnevale A Clinical implications of microvascular CT scan signs in COVID-19 patients requiring invasive mechanical ventilation Radiol Med 2022 127 162 173 10.1007/s11547-021-01444-7 35034320 PMC8761248 Dalpiaz G, Gamberini L, Carnevale A, et al. Clinical implications of microvascular CT scan signs in COVID-19 patients requiring invasive mechanical ventilation. Radiol Med. 2022;127:162–73. 10.1007/s11547-021-01444-7. 35034320 10.1007/s11547-021-01444-7 PMC8761248 24. Brandi N Ciccarese F Balacchi C Co-infections and superinfections in COVID-19 critically ill patients are associated with CT imaging abnormalities and the worst outcomes Diagnostics 2022 12 1617 10.3390/diagnostics12071617 35885522 PMC9323920 Brandi N, Ciccarese F, Balacchi C, et al. Co-infections and superinfections in COVID-19 critically ill patients are associated with CT imaging abnormalities and the worst outcomes. Diagnostics. 2022;12:1617. 10.3390/diagnostics12071617. 35885522 10.3390/diagnostics12071617 PMC9323920 25. Chong WH Saha BK Ramani A Chopra A State-of-the-art review of secondary pulmonary infections in patients with COVID-19 pneumonia Infection 2021 49 591 605 10.1007/s15010-021-01602-z 33709380 PMC7951131 Chong WH, Saha BK, Ramani A, Chopra A. State-of-the-art review of secondary pulmonary infections in patients with COVID-19 pneumonia. Infection. 2021;49:591–605. 10.1007/s15010-021-01602-z. 33709380 10.1007/s15010-021-01602-z PMC7951131 26. Naranje P Bhalla AS Jana M Imaging of pulmonary superinfections and co-infections in COVID-19 Curr Probl Diagn Radiol 2022 51 768 778 10.1067/j.cpradiol.2021.09.009 34903396 PMC8580558 Naranje P, Bhalla AS, Jana M, et al. Imaging of pulmonary superinfections and co-infections in COVID-19. Curr Probl Diagn Radiol. 2022;51:768–78. 10.1067/j.cpradiol.2021.09.009. 34903396 10.1067/j.cpradiol.2021.09.009 PMC8580558 27. Wada N Li Y Gagne S Incidence and severity of pulmonary embolism in COVID-19 infection: ancestral, Alpha, Delta, and Omicron variants Medicine (Baltimore) 2023 102 e36417 10.1097/MD.0000000000036417 38050198 PMC10695578 Wada N, Li Y, Gagne S, et al. Incidence and severity of pulmonary embolism in COVID-19 infection: ancestral, Alpha, Delta, and Omicron variants. Medicine (Baltimore). 2023;102: e36417. 10.1097/MD.0000000000036417. 38050198 10.1097/MD.0000000000036417 PMC10695578 28 Katsoularis I Fonseca-Rodríguez O Farrington P Risks of deep vein thrombosis, pulmonary embolism, and bleeding after covid-19: nationwide self-controlled cases series and matched cohort study BMJ 2022 10.1136/bmj-2021-069590 35387772 PMC8984137 Katsoularis I, Fonseca-Rodríguez O, Farrington P, et al. Risks of deep vein thrombosis, pulmonary embolism, and bleeding after covid-19: nationwide self-controlled cases series and matched cohort study. BMJ. 2022. 10.1136/bmj-2021-069590. 35387772 10.1136/bmj-2021-069590 PMC8984137 29. Kearon C Akl EA Comerota AJ Antithrombotic therapy for VTE disease Chest 2012 141 e419S e496S 10.1378/chest.11-2301 22315268 PMC3278049 Kearon C, Akl EA, Comerota AJ, et al. Antithrombotic therapy for VTE disease. Chest. 2012;141:e419S-e496S. 10.1378/chest.11-2301. 22315268 10.1378/chest.11-2301 PMC3278049 30. Sista AK Kuo WT Schiebler M Madoff DC Stratification, imaging, and management of acute massive and submassive pulmonary embolism Radiology 2017 284 5 24 10.1148/radiol.2017151978 28628412 Sista AK, Kuo WT, Schiebler M, Madoff DC. Stratification, imaging, and management of acute massive and submassive pulmonary embolism. Radiology. 2017;284:5–24. 10.1148/radiol.2017151978. 28628412 10.1148/radiol.2017151978 31. Giri J Sista AK Weinberg I Interventional therapies for acute pulmonary embolism: current status and principles for the development of novel evidence: a scientific statement from the American Heart Association Circulation 2019 10.1161/CIR.0000000000000707 31585051 Giri J, Sista AK, Weinberg I, et al. Interventional therapies for acute pulmonary embolism: current status and principles for the development of novel evidence: a scientific statement from the American Heart Association. Circulation. 2019. 10.1161/CIR.0000000000000707. 31585051 10.1161/CIR.0000000000000707 32. Jaff MR McMurtry MS Archer SL Management of massive and submassive pulmonary embolism, iliofemoral deep vein thrombosis, and chronic thromboembolic pulmonary hypertension Circulation 2011 123 1788 1830 10.1161/CIR.0b013e318214914f 21422387 Jaff MR, McMurtry MS, Archer SL, et al. Management of massive and submassive pulmonary embolism, iliofemoral deep vein thrombosis, and chronic thromboembolic pulmonary hypertension. Circulation. 2011;123:1788–830. 10.1161/CIR.0b013e318214914f. 21422387 10.1161/CIR.0b013e318214914f 33 Higazi MM Fattah RARA Abdelghany EA Ghany HSA Efficacy of computed tomography pulmonary angiography as non-invasive imaging biomarker for risk stratification of acute pulmonary embolism J Clin Imaging Sci 2020 10 49 10.25259/JCIS_75_2020 32874754 PMC7451145 Higazi MM, Fattah RARA, Abdelghany EA, Ghany HSA. Efficacy of computed tomography pulmonary angiography as non-invasive imaging biomarker for risk stratification of acute pulmonary embolism. J Clin Imaging Sci. 2020;10:49. 10.25259/JCIS_75_2020. 32874754 10.25259/JCIS_75_2020 PMC7451145 34. Meyer G Vicaut E Danays T Fibrinolysis for patients with intermediate-risk pulmonary embolism N Engl J Med 2014 370 1402 1411 10.1056/NEJMoa1302097 24716681 Meyer G, Vicaut E, Danays T, et al. Fibrinolysis for patients with intermediate-risk pulmonary embolism. N Engl J Med. 2014;370:1402–11. 10.1056/NEJMoa1302097. 24716681 10.1056/NEJMoa1302097 35. Cosmi B Nijkeuter M Valentino M Residual emboli on lung perfusion scan or multidetector computed tomography after a first episode of acute pulmonary embolism Intern Emerg Med 2011 6 521 528 10.1007/s11739-011-0577-8 21461909 Cosmi B, Nijkeuter M, Valentino M, et al. Residual emboli on lung perfusion scan or multidetector computed tomography after a first episode of acute pulmonary embolism. Intern Emerg Med. 2011;6:521–8. 10.1007/s11739-011-0577-8. 21461909 10.1007/s11739-011-0577-8 36. Sanchez O Helley D Couchon S Perfusion defects after pulmonary embolism: risk factors and clinical significance J Thromb Haemost 2010 8 1248 1255 10.1111/j.1538-7836.2010.03844.x 20236393 Sanchez O, Helley D, Couchon S, et al. Perfusion defects after pulmonary embolism: risk factors and clinical significance. J Thromb Haemost. 2010;8:1248–55. 10.1111/j.1538-7836.2010.03844.x. 20236393 10.1111/j.1538-7836.2010.03844.x 37. Bĕlohlávek J Dytrych V Linhart A Pulmonary embolism, part I: epidemiology, risk factors and risk stratification, pathophysiology, clinical presentation, diagnosis and nonthrombotic pulmonary embolism Exp Clin Cardiol 2013 18 129 138 23940438 PMC3718593 Bĕlohlávek J, Dytrych V, Linhart A. Pulmonary embolism, part I: epidemiology, risk factors and risk stratification, pathophysiology, clinical presentation, diagnosis and nonthrombotic pulmonary embolism. Exp Clin Cardiol. 2013;18:129–38. 23940438 PMC3718593 38. Stein PD Henry JW Clinical characteristics of patients with acute pulmonary embolism stratified according to their presenting syndromes Chest 1997 112 974 979 10.1378/chest.112.4.974 9377961 Stein PD, Henry JW. Clinical characteristics of patients with acute pulmonary embolism stratified according to their presenting syndromes. Chest. 1997;112:974–9. 10.1378/chest.112.4.974. 9377961 10.1378/chest.112.4.974 39. Barco S Ende-Verhaar YM Becattini C Differential impact of syncope on the prognosis of patients with acute pulmonary embolism: a systematic review and meta-analysis Eur Heart J 2018 39 4186 4195 10.1093/eurheartj/ehy631 30339253 Barco S, Ende-Verhaar YM, Becattini C, et al. Differential impact of syncope on the prognosis of patients with acute pulmonary embolism: a systematic review and meta-analysis. Eur Heart J. 2018;39:4186–95. 10.1093/eurheartj/ehy631. 30339253 10.1093/eurheartj/ehy631 40. Pollack CV Schreiber D Goldhaber SZ Clinical characteristics, management, and outcomes of patients diagnosed with acute pulmonary embolism in the emergency department J Am Coll Cardiol 2011 57 700 706 10.1016/j.jacc.2010.05.071 21292129 Pollack CV, Schreiber D, Goldhaber SZ, et al. Clinical characteristics, management, and outcomes of patients diagnosed with acute pulmonary embolism in the emergency department. J Am Coll Cardiol. 2011;57:700–6. 10.1016/j.jacc.2010.05.071. 21292129 10.1016/j.jacc.2010.05.071 41. Zantonelli G Cozzi D Bindi A Acute pulmonary embolism: prognostic role of computed tomography pulmonary angiography (CTPA) Tomography 2022 8 529 539 10.3390/tomography8010042 35202207 PMC8880178 Zantonelli G, Cozzi D, Bindi A, et al. Acute pulmonary embolism: prognostic role of computed tomography pulmonary angiography (CTPA). Tomography. 2022;8:529–39. 10.3390/tomography8010042. 35202207 10.3390/tomography8010042 PMC8880178 42. Estrada-Y-Martin RM Oldham SA CTPA as the gold standard for the diagnosis of pulmonary embolism Int J Comput Assist Radiol Surg 2011 6 557 563 10.1007/s11548-010-0526-4 20689999 Estrada-Y-Martin RM, Oldham SA. CTPA as the gold standard for the diagnosis of pulmonary embolism. Int J Comput Assist Radiol Surg. 2011;6:557–63. 10.1007/s11548-010-0526-4. 20689999 10.1007/s11548-010-0526-4 43. Agnelli G Becattini C Acute pulmonary embolism N Engl J Med 2010 363 266 274 10.1056/NEJMra0907731 20592294 Agnelli G, Becattini C. Acute pulmonary embolism. N Engl J Med. 2010;363:266–74. 10.1056/NEJMra0907731. 20592294 10.1056/NEJMra0907731 44. Stein PD Fowler SE Goodman LR Multidetector computed tomography for acute pulmonary embolism N Engl J Med 2006 354 2317 2327 10.1056/NEJMoa052367 16738268 Stein PD, Fowler SE, Goodman LR, et al. Multidetector computed tomography for acute pulmonary embolism. N Engl J Med. 2006;354:2317–27. 10.1056/NEJMoa052367. 16738268 10.1056/NEJMoa052367 45. Xiong W Zhao Y Xu M The relationship between tumor markers and pulmonary embolism in lung cancer Oncotarget 2017 8 41412 41421 10.18632/oncotarget.17916 28575869 PMC5522295 Xiong W, Zhao Y, Xu M, et al. The relationship between tumor markers and pulmonary embolism in lung cancer. Oncotarget. 2017;8:41412–21. 10.18632/oncotarget.17916. 28575869 10.18632/oncotarget.17916 PMC5522295 46. Martin SS van Assen M Griffith LP Dual-energy CT pulmonary angiography: quantification of disease burden and impact on management Curr Radiol Rep 2018 6 36 10.1007/s40134-018-0297-1 Martin SS, van Assen M, Griffith LP, et al. Dual-energy CT pulmonary angiography: quantification of disease burden and impact on management. Curr Radiol Rep. 2018;6:36. 10.1007/s40134-018-0297-1. 47. Lahiji K Kligerman S Jeudy J White C Improved accuracy of pulmonary embolism computer-aided detection using iterative reconstruction compared with filtered back projection AJR Am J Roentgenol 2014 203 763 771 10.2214/AJR.13.11838 25247942 Lahiji K, Kligerman S, Jeudy J, White C. Improved accuracy of pulmonary embolism computer-aided detection using iterative reconstruction compared with filtered back projection. AJR Am J Roentgenol. 2014;203:763–71. 10.2214/AJR.13.11838. 25247942 10.2214/AJR.13.11838 48. Yazdani M Lau CT Lempel JK Historical evolution of imaging techniques for the evaluation of pulmonary embolism: RSNA centennial article Radiographics 2015 35 1245 1262 10.1148/rg.2015140280 26172362 Yazdani M, Lau CT, Lempel JK, et al. Historical evolution of imaging techniques for the evaluation of pulmonary embolism: RSNA centennial article 26172362 10.1148/rg.2015140280 49. Kirsch J Wu CC Bolen MA ACR appropriateness criteria® suspected pulmonary embolism: 2022 update J Am Coll Radiol 2022 19 S488 S501 10.1016/j.jacr.2022.09.014 36436972 Kirsch J, Wu CC, Bolen MA, et al. ACR appropriateness criteria® suspected pulmonary embolism: 2022 update. J Am Coll Radiol. 2022;19:S488–501. 10.1016/j.jacr.2022.09.014. 36436972 10.1016/j.jacr.2022.09.014 50. Westermark N On the roentgen diagnosis of lung embolism Acta radiol 1938 19 357 372 10.3109/00016923809137770 Westermark N. On the roentgen diagnosis of lung embolism. Acta radiol. 1938;19:357–72. 10.3109/00016923809137770. 51. Hampton AO Castleman BL Correlation of postmortem chest teleroentgenograms with autopsy findings with special reference to pulmonary embolism and infarction Am J Roentgenol 1940 43 305 325 Hampton AO, Castleman BL. Correlation of postmortem chest teleroentgenograms with autopsy findings with special reference to pulmonary embolism and infarction. Am J Roentgenol. 1940;43:305–25. 52. Fleischner FG Unilateral pulmonary embolism with increased compensatory circulation through the unoccluded lung Radiology 1959 73 591 597 10.1148/73.4.591 13823426 Fleischner FG. Unilateral pulmonary embolism with increased compensatory circulation through the unoccluded lung. Radiology. 1959;73:591–7. 10.1148/73.4.591. 13823426 10.1148/73.4.591 53. Fleischner FG Pulmonary embolism Clin Radiol 1962 13 169 182 10.1016/S0009-9260(62)80070-1 13893510 Fleischner FG. Pulmonary embolism. Clin Radiol. 1962;13:169–82. 10.1016/S0009-9260(62)80070-1. 13893510 10.1016/s0009-9260(62)80070-1 54. BARON MG Fleischner lines and pulmonary emboli Circulation 1972 45 1 171 178 10.1161/01.CIR.45.1.171 5007031 BARON MG. Fleischner lines and pulmonary emboli. Circulation. 1972;45(1):171–8. 10.1161/01.CIR.45.1.171. 5007031 10.1161/01.cir.45.1.171 55. Righini M Robert-Ebadi H Le Gal G Diagnosis of acute pulmonary embolism J Thromb Haemost 2017 15 1251 1261 10.1111/jth.13694 28671347 Righini M, Robert-Ebadi H, Le Gal G. Diagnosis of acute pulmonary embolism. J Thromb Haemost. 2017;15:1251–61. 10.1111/jth.13694. 28671347 10.1111/jth.13694 56. Leblanc M Leveillée F Turcotte E Prospective evaluation of the negative predictive value of V/Q SPECT using 99mTc-Technegas Nucl Med Commun 2007 28 667 672 10.1097/MNM.0b013e32827a8e99 17625390 Leblanc M, Leveillée F, Turcotte E. Prospective evaluation of the negative predictive value of V/Q SPECT using 99mTc-Technegas. Nucl Med Commun. 2007;28:667–72. 10.1097/MNM.0b013e32827a8e99. 17625390 10.1097/MNM.0b013e32827a8e99 57 Barr RG Parr DG Vogel-Claussen J Imaging 2015 European Respiratory Society Barr RG, Parr DG, Vogel-Claussen J. Imaging. European Respiratory Society; 2015. 58. Leung AN Bull TM Jaeschke R An official American Thoracic Society/Society of Thoracic Radiology clinical practice guideline: evaluation of suspected pulmonary embolism in pregnancy Am J Respir Crit Care Med 2011 184 1200 1208 10.1164/rccm.201108-1575ST 22086989 Leung AN, Bull TM, Jaeschke R, et al. An official American Thoracic Society/Society of Thoracic Radiology clinical practice guideline: evaluation of suspected pulmonary embolism in pregnancy. Am J Respir Crit Care Med. 2011;184:1200–8. 10.1164/rccm.201108-1575ST. 22086989 10.1164/rccm.201108-1575ST 59. Makowska A Treumann T Venturini S Christ M Pulmonary embolism in pregnancy: a review for clinical practitioners J Clin Med 2024 13 2863 10.3390/jcm13102863 38792409 PMC11121909 Makowska A, Treumann T, Venturini S, Christ M. Pulmonary embolism in pregnancy: a review for clinical practitioners. J Clin Med. 2024;13:2863. 10.3390/jcm13102863. 38792409 10.3390/jcm13102863 PMC11121909 60. Han D Lee KS Franquet T Thrombotic and nonthrombotic pulmonary arterial embolism: spectrum of imaging findings Radiographics 2003 23 1521 1539 10.1148/rg.1103035043 14615562 Han D, Lee KS, Franquet T, et al. Thrombotic and nonthrombotic pulmonary arterial embolism: spectrum of imaging findings. Radiographics. 2003;23:1521–39. 10.1148/rg.1103035043. 14615562 10.1148/rg.1103035043 61. Stein PD Gottschalk A Review of criteria appropriate for a very low probability of pulmonary embolism on ventilation-perfusion lung scans: a position paper Radiographics 2000 20 99 105 10.1148/radiographics.20.1.g00ja1399 10682775 Stein PD, Gottschalk A. Review of criteria appropriate for a very low probability of pulmonary embolism on ventilation-perfusion lung scans: a position paper. Radiographics. 2000;20:99–105. 10.1148/radiographics.20.1.g00ja1399. 10682775 10.1148/radiographics.20.1.g00ja1399 62. Kluge A Mueller C Strunk J Experience in 207 combined MRI examinations for acute pulmonary embolism and deep vein thrombosis AJR Am J Roentgenol 2006 186 1686 1696 10.2214/AJR.05.0756 16714660 Kluge A, Mueller C, Strunk J, et al. Experience in 207 combined MRI examinations for acute pulmonary embolism and deep vein thrombosis. AJR Am J Roentgenol. 2006;186:1686–96. 10.2214/AJR.05.0756. 16714660 10.2214/AJR.05.0756 63. Stein PD Chenevert TL Fowler SE Author manuscript; available in PMC Ann Intern Med 2011 152 434 143 10.1059/0003-4819-152-7-201004060-00008 Stein PD, Chenevert TL, Fowler SE, et al. Author manuscript; available in PMC. Ann Intern Med. 2011;152:434–143. 10.1059/0003-4819-152-7-201004060-00008. 64. Hochhegger B Ley-Zaporozhan J Marchiori E Magnetic resonance imaging findings in acute pulmonary embolism Br J Radiol 2011 84 282 287 10.1259/bjr/26121475 21224294 PMC3473863 Hochhegger B, Ley-Zaporozhan J, Marchiori E, et al. Magnetic resonance imaging findings in acute pulmonary embolism. Br J Radiol. 2011;84:282–7. 10.1259/bjr/26121475. 21224294 10.1259/bjr/26121475 PMC3473863 65. Sheiman RG McArdle CR Clinically suspected pulmonary embolism: use of bilateral lower extremity US as the initial examination—a prospective study Radiology 1999 212 75 78 10.1148/radiology.212.1.r99jl4475 10405724 Sheiman RG, McArdle CR. Clinically suspected pulmonary embolism: use of bilateral lower extremity US as the initial examination—a prospective study. Radiology. 1999;212:75–8. 10.1148/radiology.212.1.r99jl4475. 10405724 10.1148/radiology.212.1.r99jl4475 66. Lewis BD James EM Welch TJ Diagnosis of acute deep venous thrombosis of the lower extremities: prospective evaluation of color Doppler flow imaging versus venography Radiology 1994 192 651 655 10.1148/radiology.192.3.8058929 8058929 Lewis BD, James EM, Welch TJ, et al. Diagnosis of acute deep venous thrombosis of the lower extremities: prospective evaluation of color Doppler flow imaging versus venography. Radiology. 1994;192:651–5. 10.1148/radiology.192.3.8058929. 8058929 10.1148/radiology.192.3.8058929 67. Murphy TP Cronan JJ Evolution of deep venous thrombosis: a prospective evaluation with US Radiology 1990 177 543 548 10.1148/radiology.177.2.2217798 2217798 Murphy TP, Cronan JJ. Evolution of deep venous thrombosis: a prospective evaluation with US. Radiology. 1990;177:543–8. 10.1148/radiology.177.2.2217798. 2217798 10.1148/radiology.177.2.2217798 68. Le Roux P-Y Iravani A Callahan J Independent and incremental value of ventilation/perfusion PET/CT and CT pulmonary angiography for pulmonary embolism diagnosis: results of the PECAN pilot study Eur J Nucl Med Mol Imaging 2019 46 1596 1604 10.1007/s00259-019-04338-z 31044265 Le Roux P-Y, Iravani A, Callahan J, et al. Independent and incremental value of ventilation/perfusion PET/CT and CT pulmonary angiography for pulmonary embolism diagnosis: results of the PECAN pilot study. Eur J Nucl Med Mol Imaging. 2019;46:1596–604. 10.1007/s00259-019-04338-z. 31044265 10.1007/s00259-019-04338-z 69. Le Pennec R Iravani A Woon B Gallium-68 ventilation/perfusion PET-CT and CT pulmonary angiography for pulmonary embolism diagnosis: an interobserver agreement study Front Med (Lausanne) 2021 10.3389/fmed.2020.599901 33665194 PMC7921798 Le Pennec R, Iravani A, Woon B, et al. Gallium-68 ventilation/perfusion PET-CT and CT pulmonary angiography for pulmonary embolism diagnosis: an interobserver agreement study. Front Med (Lausanne). 2021. 10.3389/fmed.2020.599901. 33665194 10.3389/fmed.2020.599901 PMC7921798 70. Singh D Foessel R Nagra N Acute saddle pulmonary embolism on 18 Respirol Case Rep 2019 10.1002/rcr2.476 31452895 PMC6702316 Singh D, Foessel R, Nagra N, et al. Acute saddle pulmonary embolism on 18 31452895 10.1002/rcr2.476 PMC6702316 71. Wittram C Scott JA 18 AJR Am J Roentgenol 2007 189 171 176 10.2214/AJR.06.0640 17579168 Wittram C, Scott JA. 18 17579168 10.2214/AJR.06.0640 72. Wittram C Maher MM Yoo AJ CT angiography of pulmonary embolism: diagnostic criteria and causes of misdiagnosis Radiographics 2004 24 1219 1238 10.1148/rg.245045008 15371604 Wittram C, Maher MM, Yoo AJ, et al. CT angiography of pulmonary embolism: diagnostic criteria and causes of misdiagnosis. Radiographics. 2004;24:1219–38. 10.1148/rg.245045008. 15371604 10.1148/rg.245045008 73. Contractor S Maldjian PD Sharma VK Gor DM Role of helical CT in detecting right ventricular dysfunction secondary to acute pulmonary embolism J Comput Assist Tomogr 2002 26 587 591 10.1097/00004728-200207000-00020 12218825 Contractor S, Maldjian PD, Sharma VK, Gor DM. Role of helical CT in detecting right ventricular dysfunction secondary to acute pulmonary embolism. J Comput Assist Tomogr. 2002;26:587–91. 10.1097/00004728-200207000-00020. 12218825 10.1097/00004728-200207000-00020 74. Wu AS Pezzullo JA Cronan JJ CT pulmonary angiography: quantification of pulmonary embolus as a predictor of patient outcome—initial experience Radiology 2004 230 831 835 10.1148/radiol.2303030083 14739314 Wu AS, Pezzullo JA, Cronan JJ, et al. CT pulmonary angiography: quantification of pulmonary embolus as a predictor of patient outcome—initial experience. Radiology. 2004;230:831–5. 10.1148/radiol.2303030083. 14739314 10.1148/radiol.2303030083 75. Washington L Goodman LR Gonyo MB CT for thromboembolic disease Radiol Clin North Am 2002 40 751 771 10.1016/S0033-8389(02)00018-0 12171183 Washington L, Goodman LR, Gonyo MB. CT for thromboembolic disease. Radiol Clin North Am. 2002;40:751–71. 10.1016/S0033-8389(02)00018-0. 12171183 10.1016/s0033-8389(02)00018-0 76. Gottschalk A Stein PD Goodman LR Sostman HD Overview of prospective investigation of pulmonary embolism diagnosis II Semin Nucl Med 2002 32 173 182 10.1053/snuc.2002.124177 12105798 Gottschalk A, Stein PD, Goodman LR, Sostman HD. Overview of prospective investigation of pulmonary embolism diagnosis II. Semin Nucl Med. 2002;32:173–82. 10.1053/snuc.2002.124177. 12105798 10.1053/snuc.2002.124177 77. Edwards PD Bull RK Coulden R CT measurement of main pulmonary artery diameter Br J Radiol 1998 71 1018 1020 10.1259/bjr.71.850.10211060 10211060 Edwards PD, Bull RK, Coulden R. CT measurement of main pulmonary artery diameter. Br J Radiol. 1998;71:1018–20. 10.1259/bjr.71.850.10211060. 10211060 10.1259/bjr.71.850.10211060 78. Baque-Juston MC Wells AU Hansell DM Pericardial thickening or effusion in patients with pulmonary artery hypertension: a CT study AJR Am J Roentgenol 1999 172 361 364 10.2214/ajr.172.2.9930782 9930782 Baque-Juston MC, Wells AU, Hansell DM. Pericardial thickening or effusion in patients with pulmonary artery hypertension: a CT study. AJR Am J Roentgenol. 1999;172:361–4. 10.2214/ajr.172.2.9930782. 9930782 10.2214/ajr.172.2.9930782 79. Hirner S Pigoga JL Naidoo AV Potential solutions for screening, triage, and severity scoring of suspected COVID-19 positive patients in low-resource settings: a scoping review BMJ Open 2021 11 e046130 10.1136/bmjopen-2020-046130 34526332 PMC8449848 Hirner S, Pigoga JL, Naidoo AV, et al. Potential solutions for screening, triage, and severity scoring of suspected COVID-19 positive patients in low-resource settings: a scoping review. BMJ Open. 2021;11: e046130. 10.1136/bmjopen-2020-046130. 34526332 10.1136/bmjopen-2020-046130 PMC8449848 80. Gilbert A Ghuysen A Triage in the time of COVID-19 Lancet Digit Health 2022 4 e210 e211 10.1016/S2589-7500(22)00001-2 35279398 PMC8906812 Gilbert A, Ghuysen A. Triage in the time of COVID-19. Lancet Digit Health. 2022;4:e210–1. 35279398 10.1016/S2589-7500(22)00001-2 PMC8906812 81. Algorithm for COVID-19 Triage and Referral 2 2. Patient triage and referral during community transmission 2.1 Patient entry to triage pathway 82. Picasso R Cozzi A Picasso V Immune checkpoint inhibitor-related pneumonitis and COVID-19: a case-matched comparison of CT findings Radiol Med 2023 128 212 221 10.1007/s11547-023-01598-6 36680711 PMC9862244 Picasso R, Cozzi A, Picasso V, et al. Immune checkpoint inhibitor-related pneumonitis and COVID-19: a case-matched comparison of CT findings. Radiol Med. 2023;128:212–21. 10.1007/s11547-023-01598-6. 36680711 10.1007/s11547-023-01598-6 PMC9862244 83. Velusamy M Patel N Talley JD The chest X-ray in the diagnosis of acute pulmonary embolism: Westermark’s sign J Ark Med Soc 1995 91 501 502 7737950 Velusamy M, Patel N, Talley JD. The chest X-ray in the diagnosis of acute pulmonary embolism: Westermark’s sign. J Ark Med Soc. 1995;91:501–2. 7737950 84. LU P CHIN BB Simultaneous chest radiographic findings of Hampton’s hump, Westermark’s sign, and vascular redistribution in pulmonary embolism Clin Nucl Med 1998 23 701 702 10.1097/00003072-199810000-00014 9790050 LU P, CHIN BB. Simultaneous chest radiographic findings of Hampton’s hump, Westermark’s sign, and vascular redistribution in pulmonary embolism. Clin Nucl Med. 1998;23:701–2. 10.1097/00003072-199810000-00014. 9790050 10.1097/00003072-199810000-00014 85. Talbot S Worthington BS Roebuck EJ Radiographic signs of pulmonary embolism and pulmonary infarction Thorax 1973 28 198 203 10.1136/thx.28.2.198 4731114 PMC470015 Talbot S, Worthington BS, Roebuck EJ. Radiographic signs of pulmonary embolism and pulmonary infarction. Thorax. 1973;28:198–203. 10.1136/thx.28.2.198. 4731114 10.1136/thx.28.2.198 PMC470015 86. Zubairi ABS Chest radiographs in acute pulmonary embolism JAMC 2007 19 1 29 31 17867476 Zubairi ABS et al. Chest radiographs in acute pulmonary embolism. JAMC 2007;19(1):29–31. 17867476 87. Berrington de González A Projected cancer risks from computed tomographic scans performed in the United States in 2007 Arch Intern Med 2009 169 2071 10.1001/archinternmed.2009.440 20008689 PMC6276814 Berrington de González A. Projected cancer risks from computed tomographic scans performed in the United States in 2007. Arch Intern Med. 2009;169:2071. 10.1001/archinternmed.2009.440. 20008689 10.1001/archinternmed.2009.440 PMC6276814 88. Hendee WR Marc Edwards F ALARA and an integrated approach to radiation protection Semin Nucl Med 1986 16 142 150 10.1016/S0001-2998(86)80027-7 3961515 Hendee WR, Marc Edwards F. ALARA and an integrated approach to radiation protection. Semin Nucl Med. 1986;16:142–50. 10.1016/S0001-2998(86)80027-7. 3961515 10.1016/s0001-2998(86)80027-7 89. Nagayama Y Oda S Nakaura T Radiation dose reduction at pediatric CT: use of low tube voltage and iterative reconstruction Radiographics 2018 38 1421 1440 10.1148/rg.2018180041 30207943 Nagayama Y, Oda S, Nakaura T, et al. Radiation dose reduction at pediatric CT: use of low tube voltage and iterative reconstruction. Radiographics. 2018;38:1421–40. 10.1148/rg.2018180041. 30207943 10.1148/rg.2018180041 90. Hara AK Paden RG Silva AC Iterative reconstruction technique for reducing body radiation dose at CT: feasibility study AJR Am J Roentgenol 2009 193 764 771 10.2214/AJR.09.2397 19696291 Hara AK, Paden RG, Silva AC, et al. Iterative reconstruction technique for reducing body radiation dose at CT: feasibility study. AJR Am J Roentgenol. 2009;193:764–71. 10.2214/AJR.09.2397. 19696291 10.2214/AJR.09.2397 91. Lee KH Lee JM Moon SK Attenuation-based automatic tube voltage selection and tube current modulation for dose reduction at contrast-enhanced liver CT Radiology 2012 265 437 447 10.1148/radiol.12112434 23012467 Lee KH, Lee JM, Moon SK, et al. Attenuation-based automatic tube voltage selection and tube current modulation for dose reduction at contrast-enhanced liver CT. Radiology. 2012;265:437–47. 10.1148/radiol.12112434. 23012467 10.1148/radiol.12112434 92. Lv P Liu J Zhang R Combined use of automatic tube voltage selection and current modulation with iterative reconstruction for CT evaluation of small hypervascular hepatocellular carcinomas: effect on lesion conspicuity and image quality Korean J Radiol 2015 16 531 10.3348/kjr.2015.16.3.531 25995682 PMC4435983 Lv P, Liu J, Zhang R, et al. Combined use of automatic tube voltage selection and current modulation with iterative reconstruction for CT evaluation of small hypervascular hepatocellular carcinomas: effect on lesion conspicuity and image quality. Korean J Radiol. 2015;16:531. 10.3348/kjr.2015.16.3.531. 25995682 10.3348/kjr.2015.16.3.531 PMC4435983 93. Yu L Li H Fletcher JG McCollough CH Automatic selection of tube potential for radiation dose reduction in CT: a general strategy Med Phys 2010 37 234 243 10.1118/1.3264614 20175486 Yu L, Li H, Fletcher JG, McCollough CH. Automatic selection of tube potential for radiation dose reduction in CT: a general strategy. Med Phys. 2010;37:234–43. 10.1118/1.3264614. 20175486 10.1118/1.3264614 94. Kubo T Lin P-JP Stiller W Radiation dose reduction in chest CT: a review AJR Am J Roentgenol 2008 190 335 343 10.2214/AJR.07.2556 18212218 Kubo T, Lin P-JP, Stiller W, et al. Radiation dose reduction in chest CT: a review. AJR Am J Roentgenol. 2008;190:335–43. 10.2214/AJR.07.2556. 18212218 10.2214/AJR.07.2556 95. Szucs-Farkas Z Schibler F Cullmann J Diagnostic accuracy of pulmonary CT angiography at low tube voltage: intraindividual comparison of a normal-dose protocol at 120 kVp and a low-dose protocol at 80 kVp using reduced amount of contrast medium in a simulation study AJR Am J Roentgenol 2011 197 W852 W859 10.2214/AJR.11.6750 22021532 Szucs-Farkas Z, Schibler F, Cullmann J, et al. Diagnostic accuracy of pulmonary CT angiography at low tube voltage: intraindividual comparison of a normal-dose protocol at 120 kVp and a low-dose protocol at 80 kVp using reduced amount of contrast medium in a simulation study. AJR Am J Roentgenol. 2011;197:W852–9. 10.2214/AJR.11.6750. 22021532 10.2214/AJR.11.6750 96. Szucs-Farkas Z Verdun FR von Allmen G Effect of X-ray tube parameters, iodine concentration, and patient size on image quality in pulmonary computed tomography angiography: a chest-phantom-study Invest Radiol 2008 43 374 381 10.1097/RLI.0b013e3181690042 18496042 Szucs-Farkas Z, Verdun FR, von Allmen G, et al. Effect of X-ray tube parameters, iodine concentration, and patient size on image quality in pulmonary computed tomography angiography: a chest-phantom-study. Invest Radiol. 2008;43:374–81. 10.1097/RLI.0b013e3181690042. 18496042 10.1097/RLI.0b013e3181690042 97. Szucs-Farkas Z Strautz T Patak MA Is body weight the most appropriate criterion to select patients eligible for low-dose pulmonary CT angiography? Analysis of objective and subjective image quality at 80 kVp in 100 patients Eur Radiol 2009 19 1914 1922 10.1007/s00330-009-1385-7 19333605 Szucs-Farkas Z, Strautz T, Patak MA, et al. Is body weight the most appropriate criterion to select patients eligible for low-dose pulmonary CT angiography? Analysis of objective and subjective image quality at 80 kVp in 100 patients. Eur Radiol. 2009;19:1914–22. 10.1007/s00330-009-1385-7. 19333605 10.1007/s00330-009-1385-7 98. De Santis D Polidori T Tremamunno G Deep learning image reconstruction algorithm: impact on image quality in coronary computed tomography angiography Radiol Med 2023 128 434 444 10.1007/s11547-023-01607-8 36847992 PMC10119038 De Santis D, Polidori T, Tremamunno G, et al. Deep learning image reconstruction algorithm: impact on image quality in coronary computed tomography angiography. Radiol Med. 2023;128:434–44. 10.1007/s11547-023-01607-8. 36847992 10.1007/s11547-023-01607-8 PMC10119038 99. Kaul D Grupp U Kahn J Reducing radiation dose in the diagnosis of pulmonary embolism using adaptive statistical iterative reconstruction and lower tube potential in computed tomography Eur Radiol 2014 24 2685 2691 10.1007/s00330-014-3290-y 25007868 Kaul D, Grupp U, Kahn J, et al. Reducing radiation dose in the diagnosis of pulmonary embolism using adaptive statistical iterative reconstruction and lower tube potential in computed tomography. Eur Radiol. 2014;24:2685–91. 10.1007/s00330-014-3290-y. 25007868 10.1007/s00330-014-3290-y 100. Lu GM Luo S Meinel FG High-pitch computed tomography pulmonary angiography with iterative reconstruction at 80 kVp and 20 mL contrast agent volume Eur Radiol 2014 24 3260 3268 10.1007/s00330-014-3365-9 25100336 Lu GM, Luo S, Meinel FG, et al. High-pitch computed tomography pulmonary angiography with iterative reconstruction at 80 kVp and 20 mL contrast agent volume. Eur Radiol. 2014;24:3260–8. 10.1007/s00330-014-3365-9. 25100336 10.1007/s00330-014-3365-9 101. Petersilka M Bruder H Krauss B Technical principles of dual source CT Eur J Radiol 2008 68 362 368 10.1016/j.ejrad.2008.08.013 18842371 Petersilka M, Bruder H, Krauss B, et al. Technical principles of dual source CT. Eur J Radiol. 2008;68:362–8. 10.1016/j.ejrad.2008.08.013. 18842371 10.1016/j.ejrad.2008.08.013 102. Kelcz F Joseph PM Hilal SK Noise considerations in dual energy CT scanning Med Phys 1979 6 418 425 10.1118/1.594520 492076 Kelcz F, Joseph PM, Hilal SK. Noise considerations in dual energy CT scanning. Med Phys. 1979;6:418–25. 10.1118/1.594520. 492076 10.1118/1.594520 103. Schönfeld T Seitz P Krieghoff C High-pitch CT pulmonary angiography (CTPA) with ultra-low contrast medium volume for the detection of pulmonary embolism: a comparison with standard CTPA Eur Radiol 2023 34 1921 1931 10.1007/s00330-023-10101-8 37656178 PMC10873234 Schönfeld T, Seitz P, Krieghoff C, et al. High-pitch CT pulmonary angiography (CTPA) with ultra-low contrast medium volume for the detection of pulmonary embolism: a comparison with standard CTPA. Eur Radiol. 2023;34:1921–31. 10.1007/s00330-023-10101-8. 37656178 10.1007/s00330-023-10101-8 PMC10873234 104. Ozawa Y Ohno Y Nagata H Advances for pulmonary functional imaging: dual-energy computed tomography for pulmonary functional imaging Diagnostics 2023 13 2295 10.3390/diagnostics13132295 37443688 PMC10340383 Ozawa Y, Ohno Y, Nagata H, et al. Advances for pulmonary functional imaging: dual-energy computed tomography for pulmonary functional imaging. Diagnostics. 2023;13: 2295. 10.3390/diagnostics13132295. 37443688 10.3390/diagnostics13132295 PMC10340383 105. Vlahos I Jacobsen MC Godoy MC Dual-energy CT in pulmonary vascular disease Br J Radiol 2022 10.1259/bjr.20210699 34538091 PMC8722250 Vlahos I, Jacobsen MC, Godoy MC, et al. Dual-energy CT in pulmonary vascular disease. Br J Radiol. 2022. 10.1259/bjr.20210699. 34538091 10.1259/bjr.20210699 PMC8722250 106. Hamid S Nasir MU So A Clinical applications of dual-energy CT Korean J Radiol 2021 22 970 10.3348/kjr.2020.0996 33856133 PMC8154785 Hamid S, Nasir MU, So A, et al. Clinical applications of dual-energy CT. Korean J Radiol. 2021;22:970. 10.3348/kjr.2020.0996. 33856133 10.3348/kjr.2020.0996 PMC8154785 107. Kröger JR Hickethier T Pahn G Influence of spectral detector CT based monoenergetic images on the computer-aided detection of pulmonary artery embolism Eur J Radiol 2017 95 242 248 10.1016/j.ejrad.2017.08.034 28987675 Kröger JR, Hickethier T, Pahn G, et al. Influence of spectral detector CT based monoenergetic images on the computer-aided detection of pulmonary artery embolism. Eur J Radiol. 2017;95:242–8. 10.1016/j.ejrad.2017.08.034. 28987675 10.1016/j.ejrad.2017.08.034 108. Lenga L Trapp F Albrecht MH Single- and dual-energy CT pulmonary angiography using second- and third-generation dual-source CT systems: comparison of radiation dose and image quality Eur Radiol 2019 29 4603 4612 10.1007/s00330-018-5982-1 30666446 Lenga L, Trapp F, Albrecht MH, et al. Single- and dual-energy CT pulmonary angiography using second- and third-generation dual-source CT systems: comparison of radiation dose and image quality. Eur Radiol. 2019;29:4603–12. 10.1007/s00330-018-5982-1. 30666446 10.1007/s00330-018-5982-1 109. Nakamura Y Higaki T Kondo S An introduction to photon-counting detector CT (PCD CT) for radiologists Jpn J Radiol 2022 10.1007/s11604-022-01350-6 36255601 PMC9974724 Nakamura Y, Higaki T, Kondo S, et al. An introduction to photon-counting detector CT (PCD CT) for radiologists. Jpn J Radiol. 2022. 10.1007/s11604-022-01350-6. 36255601 10.1007/s11604-022-01350-6 PMC9974724 110. Scarfato E Stile S Maiello V De Feo G The revolution of photon-counting CT towards new horizons of diagnostic imaging J Adv Health Care 2024 10.36017/jahc202462333 Scarfato E, Stile S, Maiello V, De Feo G. The revolution of photon-counting CT towards new horizons of diagnostic imaging. J Adv Health Care. 2024. 10.36017/jahc202462333. 111. Pallasch FB Rau A Reisert M Photon-counting detector computed tomography for metal artifact reduction: a comparative study of different artifact reduction techniques in patients with orthopedic implants Radiol Med 2024 129 890 900 10.1007/s11547-024-01822-x 38689182 PMC11168992 Pallasch FB, Rau A, Reisert M, et al. Photon-counting detector computed tomography for metal artifact reduction: a comparative study of different artifact reduction techniques in patients with orthopedic implants. Radiol Med. 2024;129:890–900. 10.1007/s11547-024-01822-x. 38689182 10.1007/s11547-024-01822-x PMC11168992 112. Ota T Onishi H Itoh T Investigation of abdominal artery delineation by photon-counting detector CT Radiol Med 2024 129 1265 1274 10.1007/s11547-024-01858-z 39043979 PMC11379784 Ota T, Onishi H, Itoh T, et al. Investigation of abdominal artery delineation by photon-counting detector CT. Radiol Med. 2024;129:1265–74. 10.1007/s11547-024-01858-z. 39043979 10.1007/s11547-024-01858-z PMC11379784 113. Pannenbecker P Huflage H Grunz J-P Photon-counting CT for diagnosis of acute pulmonary embolism: potential for contrast medium and radiation dose reduction Eur Radiol 2023 33 7830 7839 10.1007/s00330-023-09777-9 37311805 PMC10598187 Pannenbecker P, Huflage H, Grunz J-P, et al. Photon-counting CT for diagnosis of acute pulmonary embolism: potential for contrast medium and radiation dose reduction. Eur Radiol. 2023;33:7830–9. 10.1007/s00330-023-09777-9. 37311805 10.1007/s00330-023-09777-9 PMC10598187 114. Schmuelling L Franzeck FC Nickel CH Deep learning-based automated detection of pulmonary embolism on CT pulmonary angiograms: no significant effects on report communication times and patient turnaround in the emergency department nine months after technical implementation Eur J Radiol 2021 141 109816 10.1016/j.ejrad.2021.109816 34157638 Schmuelling L, Franzeck FC, Nickel CH, et al. Deep learning-based automated detection of pulmonary embolism on CT pulmonary angiograms: no significant effects on report communication times and patient turnaround in the emergency department nine months after technical implementation. Eur J Radiol. 2021;141: 109816. 10.1016/j.ejrad.2021.109816. 34157638 10.1016/j.ejrad.2021.109816 115. Li X Wang X Yang X Preliminary study on artificial intelligence diagnosis of pulmonary embolism based on computer in-depth study Ann Transl Med 2021 9 838 838 10.21037/atm-21-975 34164472 PMC8184458 Li X, Wang X, Yang X, et al. Preliminary study on artificial intelligence diagnosis of pulmonary embolism based on computer in-depth study. Ann Transl Med. 2021;9:838–838. 10.21037/atm-21-975. 34164472 10.21037/atm-21-975 PMC8184458 116. Neri E Aghakhanyan G Zerunian M Explainable AI in radiology: a white paper of the Italian Society of Medical and Interventional Radiology Radiol Med 2023 128 755 764 10.1007/s11547-023-01634-5 37155000 PMC10264482 Neri E, Aghakhanyan G, Zerunian M, et al. Explainable AI in radiology: a white paper of the Italian Society of Medical and Interventional Radiology. Radiol Med. 2023;128:755–64. 10.1007/s11547-023-01634-5. 37155000 10.1007/s11547-023-01634-5 PMC10264482 117. Pu J Gezer NS Ren S Automated detection and segmentation of pulmonary embolisms on computed tomography pulmonary angiography (CTPA) using deep learning but without manual outlining Med Image Anal 2023 89 102882 10.1016/j.media.2023.102882 37482032 PMC10528048 Pu J, Gezer NS, Ren S, et al. Automated detection and segmentation of pulmonary embolisms on computed tomography pulmonary angiography (CTPA) using deep learning but without manual outlining. Med Image Anal. 2023;89: 102882. 10.1016/j.media.2023.102882. 37482032 10.1016/j.media.2023.102882 PMC10528048 118. Pan I Deep learning for pulmonary embolism detection: tackling the RSNA 2020 AI challenge Radiol Artif Intell 2021 3 e210068 10.1148/ryai.2021210068 34617031 PMC8489447 Pan I. Deep learning for pulmonary embolism detection: tackling the RSNA 2020 AI challenge. Radiol Artif Intell. 2021;3: e210068. 10.1148/ryai.2021210068. 34617031 10.1148/ryai.2021210068 PMC8489447 119. Huang S-C Kothari T Banerjee I PENet—a scalable deep-learning model for automated diagnosis of pulmonary embolism using volumetric CT imaging NPJ Digit Med 2020 3 61 10.1038/s41746-020-0266-y 32352039 PMC7181770 Huang S-C, Kothari T, Banerjee I, et al. PENet—a scalable deep-learning model for automated diagnosis of pulmonary embolism using volumetric CT imaging. NPJ Digit Med. 2020;3: 61. 10.1038/s41746-020-0266-y. 32352039 10.1038/s41746-020-0266-y PMC7181770 120. Yanagawa M Ito R Nozaki T New trend in artificial intelligence-based assistive technology for thoracic imaging Radiol Med 2023 128 1236 1249 10.1007/s11547-023-01691-w 37639191 PMC10547663 Yanagawa M, Ito R, Nozaki T, et al. New trend in artificial intelligence-based assistive technology for thoracic imaging. Radiol Med. 2023;128:1236–49. 10.1007/s11547-023-01691-w. 37639191 10.1007/s11547-023-01691-w PMC10547663 121. Özkan H Osman O Şahin S Boz AF A novel method for pulmonary embolism detection in CTA images Comput Methods Programs Biomed 2014 113 757 766 10.1016/j.cmpb.2013.12.014 24440133 Özkan H, Osman O, Şahin S, Boz AF. A novel method for pulmonary embolism detection in CTA images. Comput Methods Programs Biomed. 2014;113:757–66. 10.1016/j.cmpb.2013.12.014. 24440133 10.1016/j.cmpb.2013.12.014 122. Sun Z Qu L Luo J Label correlation transformer for automated chest X-ray diagnosis with reliable interpretability Radiol Med 2023 128 726 733 10.1007/s11547-023-01647-0 37233906 Sun Z, Qu L, Luo J, et al. Label correlation transformer for automated chest X-ray diagnosis with reliable interpretability. Radiol Med. 2023;128:726–33. 10.1007/s11547-023-01647-0. 37233906 10.1007/s11547-023-01647-0 123. Jacob J Bartholmai BJ Rajagopalan S Automated quantitative computed tomography versus visual computed tomography scoring in idiopathic pulmonary fibrosis J Thorac Imaging 2016 31 304 311 10.1097/RTI.0000000000000220 27262146 Jacob J, Bartholmai BJ, Rajagopalan S, et al. Automated quantitative computed tomography versus visual computed tomography scoring in idiopathic pulmonary fibrosis. J Thorac Imaging. 2016;31:304–11. 10.1097/RTI.0000000000000220. 27262146 10.1097/RTI.0000000000000220 124. Wu X Kim GH Salisbury ML Computed tomographic biomarkers in idiopathic pulmonary fibrosis. The future of quantitative analysis Am J Respir Crit Care Med 2019 199 12 21 10.1164/rccm.201803-0444PP 29986154 Wu X, Kim GH, Salisbury ML, et al. Computed tomographic biomarkers in idiopathic pulmonary fibrosis. The future of quantitative analysis. Am J Respir Crit Care Med. 2019;199:12–21. 10.1164/rccm.201803-0444PP. 29986154 10.1164/rccm.201803-0444PP 125. Thillai M Oldham JM Ruggiero A Deep learning–based segmentation of computed tomography scans predicts disease progression and mortality in idiopathic pulmonary fibrosis Am J Respir Crit Care Med 2024 210 465 472 10.1164/rccm.202311-2185OC 38452227 PMC11351794 Thillai M, Oldham JM, Ruggiero A, et al. Deep learning–based segmentation of computed tomography scans predicts disease progression and mortality in idiopathic pulmonary fibrosis. Am J Respir Crit Care Med. 2024;210:465–72. 10.1164/rccm.202311-2185OC. 38452227 10.1164/rccm.202311-2185OC PMC11351794 126. Wang T-W Hong J-S Huang J-W Systematic review and meta-analysis of deep learning applications in computed tomography lung cancer segmentation Radiother Oncol 2024 197 110344 10.1016/j.radonc.2024.110344 38806113 Wang T-W, Hong J-S, Huang J-W, et al. Systematic review and meta-analysis of deep learning applications in computed tomography lung cancer segmentation. Radiother Oncol. 2024;197: 110344. 10.1016/j.radonc.2024.110344. 38806113 10.1016/j.radonc.2024.110344 127. Borghesi A Coviello FL Scrimieri A Software-based quantitative CT analysis to predict the growth trend of persistent nonsolid pulmonary nodules: a retrospective study Radiol Med 2023 128 734 743 10.1007/s11547-023-01648-z 37227661 PMC10264528 Borghesi A, Coviello FL, Scrimieri A, et al. Software-based quantitative CT analysis to predict the growth trend of persistent nonsolid pulmonary nodules: a retrospective study. Radiol Med. 2023;128:734–43. 10.1007/s11547-023-01648-z. 37227661 10.1007/s11547-023-01648-z PMC10264528 128. Chen Y Hou X Yang Y A novel deep learning model based on multi-scale and multi-view for detection of pulmonary nodules J Digit Imaging 2022 36 688 699 10.1007/s10278-022-00749-x 36544067 PMC10039158 Chen Y, Hou X, Yang Y, et al. A novel deep learning model based on multi-scale and multi-view for detection of pulmonary nodules. J Digit Imaging. 2022;36:688–99. 10.1007/s10278-022-00749-x. 36544067 10.1007/s10278-022-00749-x PMC10039158 129. Lee P Tahmasebi A Dave JK Comparison of gray-scale inversion to improve detection of pulmonary nodules on chest X-rays between radiologists and a deep convolutional neural network Curr Probl Diagn Radiol 2023 52 180 186 10.1067/j.cpradiol.2022.11.004 36470698 Lee P, Tahmasebi A, Dave JK, et al. Comparison of gray-scale inversion to improve detection of pulmonary nodules on chest X-rays between radiologists and a deep convolutional neural network. Curr Probl Diagn Radiol. 2023;52:180–6. 10.1067/j.cpradiol.2022.11.004. 36470698 10.1067/j.cpradiol.2022.11.004 130. Song X Duan X He X Computer-aided diagnosis of distal metastasis in non-small cell lung cancer by low-dose CT based radiomics and deep learning signatures Radiol Med 2024 129 239 251 10.1007/s11547-024-01770-6 38214839 Song X, Duan X, He X, et al. Computer-aided diagnosis of distal metastasis in non-small cell lung cancer by low-dose CT based radiomics and deep learning signatures. Radiol Med. 2024;129:239–51. 10.1007/s11547-024-01770-6. 38214839 10.1007/s11547-024-01770-6 131. Li T Mao J Yu J Fully automated classification of pulmonary nodules in positron emission tomography-computed tomography imaging using a two-stage multimodal learning approach Quant Imaging Med Surg 2024 14 5526 5540 10.21037/qims-24-234 39144014 PMC11320548 Li T, Mao J, Yu J, et al. Fully automated classification of pulmonary nodules in positron emission tomography-computed tomography imaging using a two-stage multimodal learning approach. Quant Imaging Med Surg. 2024;14:5526–40. 10.21037/qims-24-234. 39144014 10.21037/qims-24-234 PMC11320548 132. Huo J Min X Luo T Computed tomography-based 3D convolutional neural network deep learning model for predicting micropapillary or solid growth pattern of invasive lung adenocarcinoma Radiol Med 2024 129 776 784 10.1007/s11547-024-01800-3 38512613 PMC11088553 Huo J, Min X, Luo T, et al. Computed tomography-based 3D convolutional neural network deep learning model for predicting micropapillary or solid growth pattern of invasive lung adenocarcinoma. Radiol Med. 2024;129:776–84. 10.1007/s11547-024-01800-3. 38512613 10.1007/s11547-024-01800-3 PMC11088553 133. Lin A Manral N McElhinney P Deep learning-enabled coronary CT angiography for plaque and stenosis quantification and cardiac risk prediction: an international multicentre study Lancet Digit Health 2022 4 e256 e265 10.1016/S2589-7500(22)00022-X 35337643 PMC9047317 Lin A, Manral N, McElhinney P, et al. Deep learning-enabled coronary CT angiography for plaque and stenosis quantification and cardiac risk prediction: an international multicentre study. Lancet Digit Health. 2022;4:e256–65. 10.1016/S2589-7500(22)00022-X. 35337643 10.1016/S2589-7500(22)00022-X PMC9047317 134. Sharkey MJ Taylor JC Alabed S Fully automatic cardiac four chamber and great vessel segmentation on CT pulmonary angiography using deep learning Front Cardiovasc Med 2022 10.3389/fcvm.2022.983859 36225963 PMC9549370 Sharkey MJ, Taylor JC, Alabed S, et al. Fully automatic cardiac four chamber and great vessel segmentation on CT pulmonary angiography using deep learning. Front Cardiovasc Med. 2022. 10.3389/fcvm.2022.983859. 36225963 10.3389/fcvm.2022.983859 PMC9549370 135. van der Bijl P Bax JJ Using deep learning to diagnose pulmonary hypertension Eur Heart J Cardiovasc Imaging 2022 23 1457 1458 10.1093/ehjci/jeac148 35906842 van der Bijl P, Bax JJ. Using deep learning to diagnose pulmonary hypertension. Eur Heart J Cardiovasc Imaging. 2022;23:1457–8. 10.1093/ehjci/jeac148. 35906842 10.1093/ehjci/jeac148 136. Liu J Zeng B Chen X Heart and great vessels segmentation in congenital heart disease via CNN and conditioned energy function postprocessing Int J Comput Assist Radiol Surg 2024 19 1597 1605 10.1007/s11548-024-03182-3 38814529 Liu J, Zeng B, Chen X. Heart and great vessels segmentation in congenital heart disease via CNN and conditioned energy function postprocessing. Int J Comput Assist Radiol Surg. 2024;19:1597–605. 10.1007/s11548-024-03182-3. 38814529 10.1007/s11548-024-03182-3 137. Polidori T De Santis D Rucci C Radiomics applications in cardiac imaging: a comprehensive review Radiol Med 2023 128 922 933 10.1007/s11547-023-01658-x 37326780 PMC10338589 Polidori T, De Santis D, Rucci C, et al. Radiomics applications in cardiac imaging: a comprehensive review. Radiol Med. 2023;128:922–33. 10.1007/s11547-023-01658-x. 37326780 10.1007/s11547-023-01658-x PMC10338589 138. Grenier PA Ayobi A Quenet S Deep learning-based algorithm for automatic detection of pulmonary embolism in chest CT angiograms Diagnostics 2023 13 1324 10.3390/diagnostics13071324 37046542 PMC10093638 Grenier PA, Ayobi A, Quenet S, et al. Deep learning-based algorithm for automatic detection of pulmonary embolism in chest CT angiograms. Diagnostics. 2023;13:1324. 10.3390/diagnostics13071324. 37046542 10.3390/diagnostics13071324 PMC10093638 139. Langius-Wiffen E de Jong PA Hoesein FAM Retrospective batch analysis to evaluate the diagnostic accuracy of a clinically deployed AI algorithm for the detection of acute pulmonary embolism on CTPA Insights Imaging 2023 10.1186/s13244-023-01454-1 37278961 PMC10244304 Langius-Wiffen E, de Jong PA, Hoesein FAM, et al. Retrospective batch analysis to evaluate the diagnostic accuracy of a clinically deployed AI algorithm for the detection of acute pulmonary embolism on CTPA. Insights Imaging. 2023. 10.1186/s13244-023-01454-1. 37278961 10.1186/s13244-023-01454-1 PMC10244304 140. Liu W Liu M Guo X Evaluation of acute pulmonary embolism and clot burden on CTPA with deep learning Eur Radiol 2020 30 3567 3575 10.1007/s00330-020-06699-8 32064559 Liu W, Liu M, Guo X, et al. Evaluation of acute pulmonary embolism and clot burden on CTPA with deep learning. Eur Radiol. 2020;30:3567–75. 10.1007/s00330-020-06699-8. 32064559 10.1007/s00330-020-06699-8 141. Topff L Ranschaert ER Bartels-Rutten A Artificial intelligence tool for detection and worklist prioritization reduces time to diagnosis of incidental pulmonary embolism at CT Radiol Cardiothorac Imaging 2023 10.1148/ryct.220163 37124638 PMC10141443 Topff L, Ranschaert ER, Bartels-Rutten A, et al. Artificial intelligence tool for detection and worklist prioritization reduces time to diagnosis of incidental pulmonary embolism at CT. Radiol Cardiothorac Imaging. 2023. 10.1148/ryct.220163. 37124638 10.1148/ryct.220163 PMC10141443 142. Batra K Xi Y Al-Hreish KM Detection of incidental pulmonary embolism on conventional contrast-enhanced chest CT: comparison of an artificial intelligence algorithm and clinical reports AJR Am J Roentgenol 2022 219 895 902 10.2214/AJR.22.27895 35822644 Batra K, Xi Y, Al-Hreish KM, et al. Detection of incidental pulmonary embolism on conventional contrast-enhanced chest CT: comparison of an artificial intelligence algorithm and clinical reports. AJR Am J Roentgenol. 2022;219:895–902. 10.2214/AJR.22.27895. 35822644 10.2214/AJR.22.27895 143. Gawlitza J Endres S Fries P Machine learning assisted feature identification and prediction of hemodynamic endpoints using computed tomography in patients with CTEPH Int J Cardiovasc Imaging 2023 40 569 577 10.1007/s10554-023-03026-2 38143250 PMC10950991 Gawlitza J, Endres S, Fries P, et al. Machine learning assisted feature identification and prediction of hemodynamic endpoints using computed tomography in patients with CTEPH. Int J Cardiovasc Imaging. 2023;40:569–77. 10.1007/s10554-023-03026-2. 38143250 10.1007/s10554-023-03026-2 PMC10950991 144. Abdulaal L Maiter A Salehi M A systematic review of artificial intelligence tools for chronic pulmonary embolism on CT pulmonary angiography Front Radiol 2024 10.3389/fradi.2024.1335349 38654762 PMC11035730 Abdulaal L, Maiter A, Salehi M, et al. A systematic review of artificial intelligence tools for chronic pulmonary embolism on CT pulmonary angiography. Front Radiol. 2024. 10.3389/fradi.2024.1335349. 38654762 10.3389/fradi.2024.1335349 PMC11035730 145. Jiang B Guo N Ge Y Development and application of artificial intelligence in cardiac imaging Br J Radiol 2020 10.1259/bjr.20190812 32017605 PMC7465846 Jiang B, Guo N, Ge Y, et al. Development and application of artificial intelligence in cardiac imaging. Br J Radiol. 2020. 10.1259/bjr.20190812. 32017605 10.1259/bjr.20190812 PMC7465846 146. Yu L Yu Y Li M Deep learning reconstruction for coronary CT angiography in patients with origin anomaly, stent or bypass graft Radiol Med 2024 129 1173 1183 10.1007/s11547-024-01846-3 39023665 Yu L, Yu Y, Li M, et al. Deep learning reconstruction for coronary CT angiography in patients with origin anomaly, stent or bypass graft. Radiol Med. 2024;129:1173–83. 10.1007/s11547-024-01846-3. 39023665 10.1007/s11547-024-01846-3 147. Aldana-Bitar J Cho GW Anderson L Artificial intelligence using a deep learning versus expert computed tomography human reading in calcium score and coronary artery calcium data and reporting system classification Coron Artery Dis 2023 34 448 452 10.1097/MCA.0000000000001244 37139562 Aldana-Bitar J, Cho GW, Anderson L, et al. Artificial intelligence using a deep learning versus expert computed tomography human reading in calcium score and coronary artery calcium data and reporting system classification. Coron Artery Dis. 2023;34:448–52. 10.1097/MCA.0000000000001244. 37139562 10.1097/MCA.0000000000001244 148. Mu D Bai J Chen W Calcium scoring at coronary CT angiography using deep learning Radiology 2022 302 309 316 10.1148/radiol.2021211483 34812674 Mu D, Bai J, Chen W, et al. Calcium scoring at coronary CT angiography using deep learning. Radiology. 2022;302:309–16. 10.1148/radiol.2021211483. 34812674 10.1148/radiol.2021211483 149. Booz C Bucolo GM D’Angelo T Carotid artery assessment in dual-source photon-counting CT: impact of low-energy virtual monoenergetic imaging on image quality, vascular contrast and diagnostic assessability Radiol Med 2024 129 1633 1643 10.1007/s11547-024-01889-6 39287697 PMC11554704 Booz C, Bucolo GM, D’Angelo T, et al. Carotid artery assessment in dual-source photon-counting CT: impact of low-energy virtual monoenergetic imaging on image quality, vascular contrast and diagnostic assessability. Radiol Med. 2024;129:1633–43. 10.1007/s11547-024-01889-6. 39287697 10.1007/s11547-024-01889-6 PMC11554704 150. Yang F Chen R Yang Y Computed tomography-based radiomics model to predict adverse clinical outcomes in acute pulmonary embolism J Thromb Thrombolysis 2024 57 428 436 10.1007/s11239-023-02929-0 38280936 Yang F, Chen R, Yang Y, et al. Computed tomography-based radiomics model to predict adverse clinical outcomes in acute pulmonary embolism. J Thromb Thrombolysis. 2024;57:428–36. 10.1007/s11239-023-02929-0. 38280936 10.1007/s11239-023-02929-0 151. Mallio CA Sertorio AC Bernetti C Beomonte Zobel B Radiology, structured reporting and large language models: who is running faster? Radiol Med 2023 128 1443 1444 10.1007/s11547-023-01689-4 37501049 Mallio CA, Sertorio AC, Bernetti C, Beomonte Zobel B. Radiology, structured reporting and large language models: who is running faster? Radiol Med. 2023;128:1443–4. 10.1007/s11547-023-01689-4. 37501049 10.1007/s11547-023-01689-4 152. Burns J Catanzano TM Schaefer PW Structured reports and radiology residents: friends or foes? Acad Radiol 2022 29 S43 S47 10.1016/j.acra.2020.10.014 33160861 Burns J, Catanzano TM, Schaefer PW, et al. Structured reports and radiology residents: friends or foes? Acad Radiol. 2022;29:S43–7. 10.1016/j.acra.2020.10.014. 33160861 10.1016/j.acra.2020.10.014 153. Tölle M Burger L Kelm H André F Bannas P Diller G Frey N Garthe P Groß S Hennemuth A Kaderali L Krüger N Leha A Martin S Meyer A Nagel E Orwat S Scherer C Seiffert M Seliger JM Simm S Friede T Seidler T Engelhardt S Multi-modal dataset creation for federated learning with DICOM-structured reports Int J Comput Assist Radiol Surg 2025 10.1007/s11548-025-03327-y 39899185 PMC11929732 Tölle M, Burger L, Kelm H, André F, Bannas P, Diller G, Frey N, Garthe P, Groß S, Hennemuth A, Kaderali L, Krüger N, Leha A, Martin S, Meyer A, Nagel E, Orwat S, Scherer C, Seiffert M, Seliger JM, Simm S, Friede T, Seidler T, Engelhardt S. Multi-modal dataset creation for federated learning with DICOM-structured reports. Int J Comput Assist Radiol Surg. 2025. 10.1007/s11548-025-03327-y. 39899185 10.1007/s11548-025-03327-y PMC11929732 154. Parillo M Vaccarino F Beomonte Zobel B Mallio CA ChatGPT and radiology report: potential applications and limitations Radiol Med 2024 129 1849 1863 10.1007/s11547-024-01915-7 39508933 Parillo M, Vaccarino F, Beomonte Zobel B, Mallio CA. ChatGPT and radiology report: potential applications and limitations. Radiol Med. 2024;129:1849–63. 10.1007/s11547-024-01915-7. 39508933 10.1007/s11547-024-01915-7 155. European Society of Radiology (ESR) ESR paper on structured reporting in radiology Insights Imaging 2018 9 1 7 10.1007/s13244-017-0588-8 PMC5825315 29460129 European Society of Radiology (ESR). ESR paper on structured reporting in radiology. Insights Imaging. 2018;9:1–7. 10.1007/s13244-017-0588-8. 10.1007/s13244-017-0588-8 PMC5825315 29460129 156. Yang Q Peng R Ma L Han Y Yuan L Yin D Li A Wang Y Zheng M Huang Y Ren J “3 + X D” structured report in radiology standardized resident training: can it meet high-level teaching objectives? Eur J Radiol 2024 181 111780 10.1016/j.ejrad.2024.111780 39423779 Yang Q, Peng R, Ma L, Han Y, Yuan L, Yin D, Li A, Wang Y, Zheng M, Huang Y, Ren J. “3 + X D” structured report in radiology standardized resident training: can it meet high-level teaching objectives? Eur J Radiol. 2024;181: 111780. 10.1016/j.ejrad.2024.111780. 39423779 10.1016/j.ejrad.2024.111780 157. Leithner D Sala E Neri E Schlemmer HP D’Anastasi M Weber M Avesani G Caglic I Caruso D Gabelloni M Goh V Granata V Kunz WG Nougaret S Russo L Woitek R Mayerhoefer ME Perceptions of radiologists on structured reporting for cancer imaging-a survey by the European Society of Oncologic Imaging (ESOI) Eur Radiol 2024 34 8 5120 5130 10.1007/s00330-023-10397-6 38206405 PMC11254975 Leithner D, Sala E, Neri E, Schlemmer HP, D’Anastasi M, Weber M, Avesani G, Caglic I, Caruso D, Gabelloni M, Goh V, Granata V, Kunz WG, Nougaret S, Russo L, Woitek R, Mayerhoefer ME. Perceptions of radiologists on structured reporting for cancer imaging-a survey by the European Society of Oncologic Imaging (ESOI). Eur Radiol. 2024;34(8):5120–30. 10.1007/s00330-023-10397-6. ( Epub 2024 Jan 11 38206405 10.1007/s00330-023-10397-6 PMC11254975 158. Ferrari R Trinci M Casinelli A Radiomics in radiology: what the radiologist needs to know about technical aspects and clinical impact Radiol Med 2024 129 1751 1765 10.1007/s11547-024-01904-w 39472389 Ferrari R, Trinci M, Casinelli A, et al. Radiomics in radiology: what the radiologist needs to know about technical aspects and clinical impact. Radiol Med. 2024;129:1751–65. 10.1007/s11547-024-01904-w. 39472389 10.1007/s11547-024-01904-w 159. Nobel JM van Geel K Robben SGF Structured reporting in radiology: a systematic review to explore its potential Eur Radiol 2022 32 2837 2854 10.1007/s00330-021-08327-5 34652520 PMC8921035 Nobel JM, van Geel K, Robben SGF. Structured reporting in radiology: a systematic review to explore its potential. Eur Radiol. 2022;32:2837–54. 10.1007/s00330-021-08327-5. 34652520 10.1007/s00330-021-08327-5 PMC8921035 160. Pesapane F Tantrige P De Marco P Carriero S Zugni F Nicosia L Bozzini AC Rotili A Latronico A Abbate F Origgi D Santicchia S Petralia G Carrafiello G Cassano E Advancements in standardizing radiological reports: a comprehensive review Medicina (Kaunas) 2023 59 1679 10.3390/medicina59091679 37763797 PMC10535385 Pesapane F, Tantrige P, De Marco P, Carriero S, Zugni F, Nicosia L, Bozzini AC, Rotili A, Latronico A, Abbate F, Origgi D, Santicchia S, Petralia G, Carrafiello G, Cassano E. Advancements in standardizing radiological reports: a comprehensive review. Medicina (Kaunas). 2023;59: 1679. 10.3390/medicina59091679. 37763797 10.3390/medicina59091679 PMC10535385 161. Jorg T Kämpgen B Feiler D Müller L Düber C Mildenberger P Jungmann F Efficient structured reporting in radiology using an intelligent dialogue system based on speech recognition and natural language processing Insights Imaging 2023 14 1 47 10.1186/s13244-023-01392-y 36929101 PMC10019433 Jorg T, Kämpgen B, Feiler D, Müller L, Düber C, Mildenberger P, Jungmann F. Efficient structured reporting in radiology using an intelligent dialogue system based on speech recognition and natural language processing. Insights Imaging. 2023;14(1): 47. 10.1186/s13244-023-01392-y. 36929101 10.1186/s13244-023-01392-y PMC10019433 162. Moezzi SAR Ghaedi A Rahmanian M Mousavi SZ Sami A Application of deep learning in generating structured radiology reports: a transformer-based technique J Digit Imaging 2023 36 1 80 90 10.1007/s10278-022-00692-x 36002778 PMC9984654 Moezzi SAR, Ghaedi A, Rahmanian M, Mousavi SZ, Sami A. Application of deep learning in generating structured radiology reports: a transformer-based technique. J Digit Imaging. 2023;36(1):80–90. 10.1007/s10278-022-00692-x. ( Epub 2022 Aug 24 36002778 10.1007/s10278-022-00692-x PMC9984654 163. Giurazza F Niola R Interventional radiology in the 3rd millennium: past, present and future perspectives Radiol Med 2024 129 1429 1430 10.1007/s11547-024-01894-9 39361116 Giurazza F, Niola R. Interventional radiology in the 3rd millennium: past, present and future perspectives. Radiol Med. 2024;129:1429–30. 10.1007/s11547-024-01894-9. 39361116 10.1007/s11547-024-01894-9 ",
  "metadata": {
    "Title of this paper": "Interventional radiology in the 3rd millennium: past, present and future perspectives",
    "Journal it was published in:": "Japanese Journal of Radiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479586/"
  }
}