{
  "title": "Paper_585",
  "abstract": "pmc Adv Radiat Oncol Adv Radiat Oncol 3239 adro Advances in Radiation Oncology 2452-1094 Elsevier PMC12482625 PMC12482625.1 12482625 12482625 41036186 10.1016/j.adro.2025.101891 S2452-1094(25)00178-2 101891 1 Scientific Article Dosimetric Performance of Orthogonal Dual-Layer Multi-Leaf Collimator System on Locally Advanced Lung Cancer: Cardiac Substructures Sparing Plans Feng AiHui MS a b c Duan YanHua MS a b c Yang ZhangRu MD a Wang Hao PhD a Chen Hua PhD a Gu HengLe MS a Huang Ying MS a b c Shen ZhenJiong MS a Wang XuFei PhD wangxufei@fudan.edu.cn b c ⁎ Xu ZhiYong PhD xzyong12vip@sina.com a ⁎ a b c ⁎ wangxufei@fudan.edu.cn ⁎ xzyong12vip@sina.com 11 2025 19 9 2025 10 11 497594 101891 11 10 2024 20 6 2025 19 09 2025 01 10 2025 02 10 2025 © 2025 Published by Elsevier Inc. on behalf of American Society for Radiation Oncology. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Purpose This study aims to reduce the risk of cardiovascular incidents and radiation pneumonia (RP) by improving the dose distribution to cardiac substructures through the use of a dual-layer multileaf collimator (MLC) accelerator- VenusX. Methods and Materials Eighteen patients with advanced-stage lung cancer were selected for this study. The total lung, spinal cord, whole heart, and specific cardiac substructures (including the left ventricle [LV], pulmonary artery, left anterior descending artery, left circumflex artery [LCX], and coronary artery) were delineated as organs at risk and incorporated into the optimization process of the avoidance plan. Single-layer MLC plans optimized for the whole heart, referred to as S-WH plans (where WH denotes whole heart), were developed alongside single-layer MLC plans specifically designed to avoid cardiac substructures, known as S-CS plans (where CS denotes cardiac substructures). Additionally, dual-layer MLC avoidance plans, designated as D-CS plans, were created for each patient. We evaluated the relative risk of coronary artery disease, chronic heart failure, acute cardiac events, and RP, as well as the effective dose to the immune system. Results D-CS plans significantly reduced the dose metrics of LV, pulmonary artery, left anterior descending artery, LCX, and the coronary, while maintaining target coverage and achieving comparable conformity index to the S-WH plans. Additionally, the D-CS plans significantly decreased the volume receiving 5 Gy (V 5Gy 15Gy Conclusions The dual-layer MLC system demonstrated superior performance compared to the single-layer MLC system in CS-avoidance plans, providing new opportunities for subsequent immunotherapy in patients with locally advanced lung cancer. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Heart disease is the leading cause of mortality overall, while lung cancer is the primary cause of cancer-related deaths. 1 2 3 4 5 6 Locoregional recurrence continues to pose a significant challenge to improving survival rates in patients with locally advanced non-small cell lung cancer (LA-NSCLC). The dose escalation trial conducted by the Radiation Therapy Oncology Group 0617 demonstrated that the high-dose arm was associated with worse survival. 7 Mean heart dose (MHD) has been proven to be a poor surrogate for cardiotoxicity. Several studies have evaluated the relationship between the dose delivered to cardiac substructures and clinical outcomes. Atkins et al 8 9 5Gy 10 11 Feng et al 12 The MLC system for medical linear accelerators (Linacs) is typically categorized into single-layer and multilayer configurations. Currently, the majority of linacs are equipped with single-layer MLCs, while a limited number feature dual-layer MLCs. The 3-layer MLC system remains in the conceptual phase. The unique self-shielding design of the multilayer MLC can simplify the structure of the gantry head. Notably, dual-layer MLCs can be further classified into parallel and orthogonal configurations. A standard example is the Halcyon linac (Varian Medical Systems, Palo Alto, CA). 13 14 15 The dual-layer MLC system exhibits lower leakage characteristics, which may enhance treatment strategies aimed at sparing cardiac substructures. Given the advancements and limitations of this novel linac, it is essential to understand how this system operates in comparison to other linac-based delivery configurations for lung cancer RT. Consequently, we conducted this study to provide a benchmark dosimetry evaluation that compares dual-layer treatment plans with single-layer techniques for sparing substructures. The objective was to determine whether the dual-layer MLC system can outperform the single-layer MLC system in reducing the dose to cardiac substructures while maintaining comparable target coverage and other OAR metrics. Methods and Materials Patient population We identified 18 patients with locally advanced lung cancer who underwent radical RT at Shanghai Chest Hospital between January and June 2023. Because of the retrospective nature of the research, the requirement for informed consent was waived. Common radiation dose prescription: 60 Gy delivered in 2-Gy fractions once daily in RT. This study was approved by the Ethics Committee of Shanghai Chest Hospital (the committee’s reference Number: KS24287) Contour delineations For each patient, a standard computed tomographic (CT) scan of the chest was obtained for treatment planning. The scan was performed without contrast enhancement, electrocardiographic triggering, or breath-holding. The parameters included 120 kVp, a slice thickness of 3 mm, and a slice spacing of 3 mm. An experienced thoracic radiation oncologist delineated the clinical target volume and OARs on the CT images using MIM software (MIM Software Inc). The PTV was generated by an 8 mm expansion of the clinical target volume. Cardiac substructures, including the aortic arch, coronary arteries (left main artery [LMA], LAD, left circumflex artery [LCX], and right coronary artery [RCA]), and the heart chambers (left atrium [LA], right atrium [RA], left ventricle [LV], and right ventricle [RV]), as well as the ascending aorta (AA), descending aorta (DA), superior vena cava (SVC), inferior vena cava, pulmonary artery (PA), and pulmonary veins (PV), were manually delineated on archived planning CT scans using MIM, in accordance with Feng's guidelines. 16 RT technique Original clinical plans were conducted using an Edge linear accelerator (Varian Medical Systems, Palo Alto, CA), which is equipped with a 120 single-layer MLC system, featuring 32 pairs of 2.5 mm leaf width and 28 pairs of 5 mm leaf width. Recently, LinaTech introduced a newly developed linac with a unique jawless orthogonal dual-layer MLC. The VenusX linac operates using 6 MV flattening filter-free x-rays. As depicted in the physical attributes of the VenusX ( Fig. 1 Fig. 1 Figure 2 Figure 1 (a) Schematic drawing of the gantry head in VenusX linac, and (b) schematic illustrations of the stacked-and-orthogonal dual-layer MLC system. Abbreviations Figure 1 Figure 2 Comparison of VensuX dual-layer MLC system (a) and single-layer MLC system (b). The red shadow represents PTV. Abbreviations Figure 2 Treatment planning Notably, cardiac motion significantly impacts dosimetric evaluation. Previous research has established specific margins for the coronary arteries to compensate for displacements related to cardiac motion. Cardiac motion is assessed using electrocardiogram-gated CT scanning. 17 For each patient, 3 treatment plans were developed: the clinical plan using a single MLC with constraints applied to the whole heart (S-WH plan, where WH stands for whole heart), the plan using a single MLC with constraints on the cardiac substructures (S-CS plan, where CS refers to cardiac substructures), and the plan employing a dual MLC with constraints on the cardiac substructures (D-CS plan). The S-WH plans incorporated target and OAR optimization settings from our institution ( Table E1 Table E2 S-WH and S-CS plans were developed using the Pinnacle treatment planning system (TPS, v9.10, Philips Medical Systems) with the autoplanning module. All OARs including the heart, and PTV contours were extracted from the original S-WH plans. Intensity modulated RT was employed for the patients discussed in this paper, using 5 to 8 coplanar 6-MV flat beams. The beam directions were tailored to each individual patient, and the jaw tracking method was implemented. Intensity modulation was performed using the direct machine parameter optimization algorithm, with the maximum number of MLC segments set to 10. For each plan, dose distributions were calculated using the collapsed cone convolution algorithm with a calculation grid of 3 mm. The D-CS plans were generated using the TiGRT treatment planning system (TiGRT, V7.2.24, LinaTech (Beijing) TF Medical Science and Technology Co., Ltd., Beijing, China), employing the same beam setups and optimization objectives as the S-CS plans. The dose grid was configured to 3 mm, and the dose calculation algorithm used was the generalized Dirichlet Process Mixture Model Monte Carlo method. Statistical analysis To evaluate the dose distribution of the target, parameters were calculated for PTV: the absolute dose received by the 2% (D 2 98 C I = ( P T V P I S ) 2 V P T V × V P I S P T V P I S V P T V V P I S H I = D 2 − D 98 D 50 The ideal value of the HI is 1. As heterogeneity decreases, the HI increases. For the OARs, the maximum dose (D max 0.03cc 30Gy 40Gy 5Gy 20Gy For each cardiac substructure, the dose-volume histogram points of V 5Gy 15Gy 35Gy 15Gy max 15Gy Meantime, the risk of coronary artery disease (CAD), chronic heart failure (CHF), ACE, and RP was calculated. The CAD prediction adopts the Hodgkin lymphoma survivor risk assessment model published by van Nimwegen et al. 18 19 For the estimation of CHF, we adopted the risk model of van Nimwegen et al, 20 For ACE estimation, we exploited the risk model recently published by van den et al, 9 5Gy R i s k S c o r e A C E = 0.017 × L V _ V 5 G y + 0.063 × A g e + 0.711 × R i s k S c o r e R i s k S c o r e For the calculation of RP risk, the Cox single-factor regression model proposed by Tomita et al 21 35Gy We also evaluated the effective radiation dose to the immune cells (EDIC) of 3 plans according to Jin’s model. 22 23 E D I C = 0.12 × M L D + 0.08 × M H D + [ 0.45 + 0.35 * 0.85 * ( N u m b e r o f f r a c t i o n s 45 ) 1 2 ] × M B D The major parameters were determined to follow a normal distribution, as evaluated by the Shapiro-Francia test. Consequently, a paired Student's t-test was employed to compare the dose metrics of the S-WH, S-CS, and D-CS plans. All statistical analyses were conducted using SPSS (version 16.0; SPSS Inc). P Result Patient and tumor characteristics A total of 18 patients with LA-NSCLC were included in the study. The median age of the participants was 63 years, with a range of 20 to 88 years. Among the patients, 15 (83.33%) were male. One patient had a history of cardiac issues, 1 had type II diabetes, and 3 had hypertensions. Additionally, 44.44% of the patients were either former or current smokers. Patient characteristics are presented in Table 1 Table 1 Tumor and treatment characteristics Table 1 Characteristic Number % Patients 18 100 Age (y) Range 20-88 Median 63 Sex Male 15 83.33 Female 3 16.67 Clinical tumor stage IIIa 7 38.89 IIIb 7 38.89 IV 4 22.22 Histopathology Squamous 12 66.67 Nonsquamous 6 33.33 Smoker Yes 8 44.44 No 10 55.56 Any cardiac history Yes 1 5.56 No 17 94.44 Hypertension Yes 3 16.67 No 15 83.33 Diabetes mellitus Yes 1 5.56 No 17 94.44 Tumor location Left 9 50 Right 9 50 Dose (Gy) 60 100 Comparisons between S-WH plan, S-CS plan, and D-CS plan S-WH, S-CS, and D-CS plans were successfully generated for 18 patients, with all 54 plans meeting clinical requirements. D max mean Table 2 2 P 98 P P P P Table 2 Dose metrics of PTV and OARs Table 2 P Contour Metrics S-WH plan S-CS plan D-CS plan S-WH vs S-CS S-WH vs D-CS S-CS vs D-CS PTV D 2 6491.86 ± 6549.69 ± 6568.38 ± .001 .002 .267 D 98 5853.26 ± 65.28 5803.12 ± 68.37 5793.64 ± 78.66 .001 .008 .586 CI 0.73 ± 0.65 ± 0.72 ± <.001 .602 .001 HI 10.19 ± 1.84 11.83 ± 1.81 12.28 ± 1.98 <.001 .002 <.001 Total lung V 5Gy 37.71 ± 6.49 37.70 ± 6.24 38.30 ± 5.88 .327 .647 .267 V 20G 20.38 ± 4.38 20.68 ± 4.69 20.65 ± 5.30 .350 .472 .896 MLD (cGy) 1143.13 ± 217.98 1150.6 ± 216.24 1151.06 ± 220.74 .384 .449 .948 Heart V 30Gy 28.35 ± 5.66 25.26 ± 9.94 22.09 ± 7.63 .035 .002 .002 V 40Gy 20.22 ± 4.58 18.08 ± 9.06 15.66 ± 7.60 .018 .003 .002 MHD (cGy) 2073.37 ± 337.47 1908.87 ± 465.90 1765.69 ± 359.46 .003 .003 .002 Spinal cord D max 4019.35 ± 994.90 4366.47 ± 879.86 4137.56 ± 952.71 .005 .557 <.001 Planning time Minute 22.19 ± 10.34 24.12 ± 12.10 32.40 ± 11.55 .06 .035 .027 Abbreviations S-CS plan = plan of single MLC with the constraints of the cardiac substructures. The mean dose and dose-volume metrics received by the total lung were comparable across all 3 plans ( P Table 2 max P P The dose reduction of cardiac substructures Table 3 35Gy P 5Gy 15Gy P Table 3 Dose metrics of heart substructures Table 3 P Cardiac substructures Metrics S-WH plan S-CS plan D-CS plan S-WH vs S-CS S-WH vs D-CS S-CS vs D-CS PA V 35Gy 51.83 ± 25.83 42.66 ± 26.63 38.17 ± 24.34 <.001 <.001 .001 D mean 3532.59 ± 1121.85 3214.32 ± 1271.81 3024.04 ± 1208.55 .002 <.001 .001 LV V 5Gy 51.08 ± 31.68 41.18 ± 31.52 45.12 ± 32.55 <.001 .004 .078 V 15Gy 29.87 ± 30.45 23.10 ± 27.69 22.40 ± 26.88 <.001 <.001 .605 V 23Gy 22.31 ± 26.85 16.53 ± 21.38 14.50 ± 19.49 <.001 <.001 .109 D mean 1352.70 ± 1193.96 1071.35 ± 1041.1 1052.49 ± 985.683 <.001 <.001 .983 LAD V 15Gy 76.36 ± 35.77 54.84 ± 46.18 53.75 ± 45.32 .005 .003 .176 D mean 3051.24 ± 1703.27 2236.37 ± 1636.45 2085 ± 1587.68 .001 <.001 .014 LCX V 15Gy 61.75 ± 42.87 52.13 ± 47.48 52.52 ± 47.71 .012 .028 .715 Dmean(cGy) 3090.97 ± 2296.24 2572.14 ± 2141.7 2394.6 ± 1962.9 <.001 <.001 .231 Coronary sum D mean 2932.29 ± 1193.17 2257.48 ± 1276.16 2109.86 ± 1192.01 <.001 <.001 .006 LMA D mean 3615.22 ± 1730.71 2890 ± 1866.49 2980.09 ± 1895.49 <.001 <.001 .053 RA D mean 2511.72 ± 1554.67 2407.51 ± 1563.88 2507.23 ± 1550.67 .391 .765 .709 RV D mean 1035.57 ± 573.28 800.15 ± 437.42 810.27 ± 520.78 <.001 .023 .060 DA D mean 2486.20 ± 1258.54 2770.75 ± 1534.18 2670.57 ± 1489.41 .002 .811 .007 AA D mean 3903.76 ± 1266.99 3842.01 ± 1338.88 3629.37 ± 1282.63 .349 .020 .012 SVC D mean 3473.05 ± 2040.60 3510.94 ± 2011.43 3433.27 ± 2012.15 .248 .472 .048 PV D mean 3506.52 ± 1239.86 3486.72 ± 1466.0 3506.43 ± 1466.58 .008 .184 .286 LA D mean 2707.29 ± 873.86 2727.81 ± 1248.51 2690.23 ± 1202.98 .018 .018 .396 IVC D mean 861.03 ± 1345.23 857.21 ± 1255.08 761.17 ± 1074. 19 .879 .500 .372 RCA D mean 2358.37 ± 1165.72 1760.69 ± 917.71 1605.86 ± 817.70 .004 .002 .133 Pericardium D mean 2339.48 ± 319.64 2439.94 ± 1090.51 2273.91 ± 1050.41 .025 .004 <.001 Abbreviations It was observed that the performance of D-CS plans in reducing the dose to cardiac substructures was superior to that of S-CS plans, with the exception of the V 5Gy 15Gy 35Gy mean P P P As for the other cardiac substructures, most of them received a dose reduction. In the D-CS plans, LMA, AA, RV, SVC, and pericardium experienced a significant decrease in dose, while the dose to DA was significantly higher than that in the S-WH plans. Meanwhile, the mean doses to the RA, PV, LA, inferior vena cava, and RCA were comparable across the 3 plans. The assessment of cardiac disease prediction In the patient cohort, the dosimetric improvement in cardiac substructures associated with D-CS has resulted in a lower RR for CAD compared to S-WH (2.48 vs 3.05, P P P P Under the same optimization objectives and beam configurations, D-CS plans delivered superior doses to cardiac substructures compared to S-CS plans. As illustrated in Fig. 3 P Figure 3 The risk assessments of CAD, CHF, ACE, and RP. (ns) Represents a significance level >0.05, (*) represents a significance level <0.05, (**) represents a significance level <0.01, and (***) represents a significance level <0.001. Abbreviations Figure 3 The assessment of EDIC EDICs of 3 plans are presented in Fig. 4 Figure 4 The effective radiation dose to the immune system of the 3 plans. Abbreviations Figure 4 Discussion Patients with lung cancer often have coexisting cardiovascular issues. The proportional burden of cardiovascular disease among lung cancer survivors is increasing alongside improvements in oncologic outcomes. Currently, the primary research focus is on the relationship between the radiation dose to cardiac substructures and tumor prognosis. Notably, the close associations between LAD, 7 , 24 25 Levis et al 26 27 5Gy 15Gy 35Gy 15Gy 15Gy With the same beam setups and optimization objectives, D-CS plans significantly reduced the PA V 35Gy mean The inter- and intrafraction heart motions significantly impact dose assessment, potentially leading to discrepancies between the actual dose distribution and the planned dose for patients. This can result in exceeding the dose limits for organs at risk. Given that the heart has a relatively large beating amplitude, this study specifically examines the dilation of the coronary artery, PA, LV, and left circumflex artery based on the positioning data of the ventricle and the amplitude of heart movement. Additionally, the study proposes dose limits that pose a risk to these organs, and the associated dose correction loops help quantify the uncertainty in dose analysis and compensate for cardiac motion, thereby enhancing the protection of cardiac substructures. The VenusX linac is equipped with a stacked-and-orthogonal MLC system, which offers several advantages over a single-layer MLC system. The vertical collaboration between the upper and lower leaves facilitates the coordination of the MLC with tumor borders, significantly enhancing conformity. As illustrated in Fig. 2 With advancements in medicine, patients with lung cancer now have improved treatment options. Durvalumab, administered after chemoradiotherapy, has emerged as a significant treatment choice for patients with stage III NSCLC. 28 29 , 30 This study has several limitations. First, we can only simulate the clinical benefits of avoidance plans using biological models that have been validated by previous researchers with clinical data. The effects on cardiac toxicity and OS need to be confirmed through the prospective enrollment of patients. Second, the absence of a validation cohort and the retrospective design are 2 significant shortcomings of the study. Consequently, prospective confirmation of these recently identified cardiac limitations is essential, and comprehensive clinical data sets that include complete dosimetry of cardiac substructures, as well as validated and/or standardized cardiac event endpoints, are urgently required. Additionally, the variations in dose among the 3 plans may be partially attributed to the use of different dose calculation algorithms, particularly the flattening filter-free clinac. Finally, the manual delineation of cardiac substructures is both time-consuming and labor intensive. Fortunately, advancements in technology have led to significant progress in automatic segmentation algorithms based on atlas methods and deep learning, as proposed by Duane et al 31 32 Conclusions Overall, this study provides valuable insights into dosimetry, machine efficiency, and the biological aspects of dual-MLC RT for locally advanced lung cancer. For the first time, our research demonstrated that D-CS plans outperformed S-CS plans in sparing cardiac substructures, while the CI of D-CS plans was found to be comparable to that of S-WH plans. The results confirmed the superiority of the dual-layer MLC system in dose painting and its impact on the immune system. Further clinical trials exploring the feasibility of avoiding cardiac substructures while maintaining adequate tumor coverage during RT are warranted. References 1 Siegel R.L. Miller K.D. Wagle N.S. Jemal A. Cancer statistics, 2023 CA Cancer J Clin 73 2023 17 48 36633525 10.3322/caac.21763 2 World Health Organization Fact Sheets: https://www.who.int/news-room/fact-sheets/detail/cardiovascular-diseases-(cvds) 3 Tammemagi C.M. Neslund-Dudas C. Simoff M. Kvale P. Impact of comorbidity on lung cancer survival Int J Cancer 103 2003 792 802 12516101 10.1002/ijc.10882 4 Islam K.M.M. Jiang X. Anggondowati T. Comorbidity and survival in lung cancer patients Cancer Epidemiol Biomark Prev 24 2015 1079 1085 10.1158/1055-9965.EPI-15-0036 26065838 5 Kocher F. Fiegl M. Mian M. Hilbe W. Cardiovascular comorbidities and events in NSCLC: Often underestimated but worth considering Clin Lung Cancer 16 2015 305 312 25659438 10.1016/j.cllc.2014.12.007 6 Hirsch F.R. Scagliotti G.V. Mulshine J.L. Lung cancer: Current therapies and new targeted treatments Lancet 389 2017 299 311 27574741 10.1016/S0140-6736(16)30958-8 7 Bradley J.D. Paulus R. Komaki R. Standard-dose versus high-dose conformal radiotherapy with concurrent and consolidation carboplatin plus paclitaxel with or without cetuximab for patients with stage IIIA or IIIB non-small-cell lung cancer (RTOG 0617): A randomised, two-by-two factorial phase 3 study Lancet Oncol 16 2015 187 199 25601342 10.1016/S1470-2045(14)71207-0 PMC4419359 8 Atkins K.M. Chaunzwa T.L. Lamba N. Association of left anterior descending coronary artery radiation dose with major adverse cardiac events and mortality in patients with non-small cell lung cancer JAMA Oncol 7 2021 206 219 33331883 10.1001/jamaoncol.2020.6332 PMC7747040 9 van den Bogaard V.A. Ta B.D. van der Schaaf A. Validation and modification of a prediction model for acute cardiac events in patients with breast cancer treated with radiotherapy based on three-dimensional dose distributions to cardiac substructures J Clin Oncol 35 2017 1171 1178 28095159 10.1200/JCO.2016.69.8480 PMC5455600 10 Hahn E. Jiang H. Ng A. Late cardiac toxicity after mediastinal radiation therapy for Hodgkin lymphoma: Contributions of coronary artery and whole heart dose-volume variables to risk prediction Int J Radiat Oncol Biol Phys 98 2017 1116 1123 28721895 10.1016/j.ijrobp.2017.03.026 11 Jacob S. Camilleri J. Derreumaux S. Is mean heart dose a relevant surrogate parameter of left ventricle and coronary arteries exposure during breast cancer radiotherapy: A dosimetric evaluation based on individually-determined radiation dose (BACCARAT study) Radiat Oncol 14 2019 29 30732640 10.1186/s13014-019-1234-z PMC6367844 12 Feng A. Duan Y. Yang Z. A planning strategy may reduce the risk of heart diseases and radiation pneumonia: Avoiding the specific heart substructures J Appl Clin Med Phys 24 2023 e14119 10.1002/acm2.14119 PMC10691619 37568269 13 De Roover R. Crijns W. Poels K. Validation and IMRT/VMAT delivery quality of a preconfigured fast-rotating O-ring linac system Med Phys 46 2019 328 339 30417523 10.1002/mp.13282 14 Wang Q. Li Q. Wang Z. Characterization of a novel VenusX orthogonal dual-layer multileaf collimator J Appl Clin Med Phys 25 2024 e14357 10.1002/acm2.14357 PMC11087167 38620027 15 Liu Q.Q. Chen X.M. Hu Z.K. Clinical application of LinaTech linear accelerator VenusX for hippocampal protection in whole brain radiotherapy Chin J Radiol Med Prot 43 2023 351 356 16 Feng M. Moran J.M. Koelling T. Development and validation of a heart atlas to study cardiac exposure to radiation following treatment for breast cancer Int J Radiat Oncol Biol Phys 79 2011 10 18 20421148 10.1016/j.ijrobp.2009.10.058 PMC2937165 17 Levis M. De Luca V. Fiandra C. Plan optimization for mediastinal radiotherapy: Estimation of coronary arteries motion with ECG-gated cardiac imaging and creation of compensatory expansion margins Radiother Oncol 127 2018 481 486 29729845 10.1016/j.radonc.2018.04.014 18 van Nimwegen F.A. Schaapveld M. Cutter D.J. Radiation dose-response relationship for risk of coronary heart disease in survivors of Hodgkin lymphoma J Clin Oncol 34 2016 235 243 26573075 10.1200/JCO.2015.63.4444 19 Darby S.C. Ewertz M. McGale P. Risk of ischemic heart disease in women after radiotherapy for breast cancer N Engl J Med 368 2013 987 998 23484825 10.1056/NEJMoa1209825 20 van Nimwegen F.A. Ntentas G. Darby S.C. Risk of heart failure in survivors of Hodgkin lymphoma: effects of cardiac exposure to radiation and anthracyclines Blood 129 2017 2257 2265 28143884 10.1182/blood-2016-09-740332 PMC5418626 21 Tomita N. Okuda K. Ogawa Y. Relationship between radiation doses to heart substructures and radiation pneumonitis in patients with thymic epithelial tumors Sci Rep 10 2020 11191 10.1038/s41598-020-68168-y PMC7340766 32636439 22 Jin J.Y. Hu C. Xiao Y. Higher radiation dose to immune system is correlated with poorer survival in patients with stage III non-small cell lung cancer: a secondary study of a phase 3 cooperative group trial (NRG Oncology RTOG 0617) Int J Radiat Oncol Biol Phys 99 2017 S151-S152 23 Jin J.Y. Hu C. Xiao Y. Higher radiation dose to the immune cells correlates with worse tumor control and overall survival in patients with stage III NSCLC: A secondary analysis of RTOG0617 Cancers (Basel) 13 2021 6193 34944813 10.3390/cancers13246193 PMC8699524 24 No H.J. Guo F.B. Park N.J.I. Predicting adverse cardiac events after radiotherapy for locally advanced non–small cell lung cancer JACC CardioOncl 5 2023 775 787 10.1016/j.jaccao.2023.08.007 PMC10774791 38205000 25 Jang B.S. Cha M.J. Kim H.J. Heart substructural dosimetric parameters and risk of cardiac events after definitive chemoradiotherapy for stage III non-small cell lung cancer Radiother Oncol 152 2020 126 132 33058951 10.1016/j.radonc.2020.09.050 26 Levis M. Filippi A R Fiandra C. Inclusion of heart substructures in the optimization process of volumetric modulated arc therapy techniques may reduce the risk of heart disease in Hodgkin's lymphoma patients Radiother Oncol 138 2019 52 58 31146071 10.1016/j.radonc.2019.05.009 27 Morris E.D. Aldridge K. Ghanem A.I. Zhu S. Glide-Hurst C.K. Incorporating sensitive cardiac substructure sparing into radiation therapy planning J Appl Clin Med Phys 21 2020 195 204 33073454 10.1002/acm2.13037 PMC7701109 28 Antonia S.J. Villegas A. Daniel D. Durvalumab after chemoradiotherapy in stage III non-small-cell lung cancer N Engl J Med 377 2017 1919 1929 28885881 10.1056/NEJMoa1709937 29 Yu Y. Fu P. Jin J.Y. Impact of effective dose to immune cells (EDIC) on lymphocyte nadir and survival in limited-stage SCLC Radiother Oncol 162 2021 26 33 34139210 10.1016/j.radonc.2021.06.020 30 Ladbury C.J. Rusthoven C.G. Camidge D.R. Kavanagh B.D. Nath SK. Impact of radiation dose to the host immune system on tumor control and survival for stage III non-small cell lung cancer treated with definitive radiation therapy Int J Radiat Oncol Biol Phys 105 2019 346 355 31175902 10.1016/j.ijrobp.2019.05.064 31 Duane F. Aznar M.C. Bartlett F. A cardiac contouring atlas for radiotherapy Radiother Oncol 122 2017 416 422 28233564 10.1016/j.radonc.2017.01.008 PMC5356506 32 Morris E.D. Ghanem A.I. Dong M. Cardiac substructure segmentation with deep learning for improved cardiac sparing Med Phys 47 2020 576 586 31794054 10.1002/mp.13940 PMC7282198 Appendix Supplementary materials  Supplemental Material Image, application 1 Disclosures The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Sources of support: This study was supported by the National Natural Science Foundation of China (grant nos. 82203976, 12375346, and 82403785), and the Research and Progress in Precision Radiotherapy for Cancer Research Project (grant no. J202305E038A04). Research data are stored in an institutional repository and will be shared on request to the corresponding author. Supplementary material associated with this article can be found in the online version at doi:10.1016/j.adro.2025.101891 ",
  "metadata": {
    "Title of this paper": "Cardiac substructure segmentation with deep learning for improved cardiac sparing",
    "Journal it was published in:": "Advances in Radiation Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482625/"
  }
}