{
  "title": "Paper_116",
  "abstract": "pmc Strahlenther Onkol Strahlenther Onkol 365 springeropen Strahlentherapie Und Onkologie 0179-7158 1439-099X pmc-is-collection-domain yes pmc-collection-title Springer PMC12488809 PMC12488809.1 12488809 12488809 40029351 10.1007/s00066-025-02374-3 2374 1 Original Article Tumor volume change at radiation boost planning to estimate the response to chemoradiotherapy in stage III unresectable NSCLC (TORCH): a multicenter retrospective observational study Trommer Simon simon.trommer@uk-halle.de 1 http://orcid.org/0000-0003-0843-7373 Müller Jörg Andreas joerg-andreas.mueller@uk-halle.de 1 Oertel Michael 2 Ehret Felix 3 4 Roohani Siyer 3 4 5 Ha Hai Minh 6 Ha Quynh Ngo 6 Hering Kathrin 7 8 Nägler Franziska 7 8 Lange Tim 9 Mäurer Matthias 10 11 Weissmann Thomas 12 Putz Florian 12 Trommer Maike 13 14 Baues Christian 15 Dobiasch Sophie 16 17 18 Waltenberger Maria 16 18 Skripcak Tomas 19 20 Vordermark Dirk 1 Medenwald Daniel 1 6 1 https://ror.org/04fe46645 grid.461820.9 0000 0004 0390 1701 Department of Radiation Oncology, University Hospital Halle (Saale), 2 https://ror.org/01856cw59 grid.16149.3b 0000 0004 0551 4246 Clinic for Radiotherapy—Radiooncology, University Hospital Münster, 3 https://ror.org/001w7jn25 grid.6363.0 0000 0001 2218 4662 Clinic for Radiooncology and Radiation Therapy, Charité—Universitätsmedizin Berlin, 4 https://ror.org/04cdgtt98 grid.7497.d 0000 0004 0492 0584 German Cancer Consortium (DKTK), partner site Berlin, a partnership between DKFZ and Charité—Universitätsmedizin Berlin, 5 https://ror.org/001w7jn25 grid.6363.0 0000 0001 2218 4662 BIH Biomedical Innovation Academy, BIH Charité (Junior) Clinician Scientist Program, Berlin Institute of Health, Charité—Universitätsmedizin Berlin, 6 https://ror.org/03m04df46 grid.411559.d 0000 0000 9592 4695 University Clinic for Radiation Therapy, University Hospital Magdeburg A. ö. R, 7 https://ror.org/03s7gtk40 grid.9647.c 0000 0004 7669 9786 Department of Radiation Oncology, University of Leipzig, 8 https://ror.org/03s7gtk40 grid.9647.c 0000 0004 7669 9786 Comprehensive Cancer Center Central Germany (CCCG), University of Leipzig Medical Center, 9 https://ror.org/00f2yqf98 grid.10423.34 0000 0001 2342 8921 Department of Radiotherapy, 10 https://ror.org/05qpz1x62 grid.9613.d 0000 0001 1939 2794 Department for Radiotherapy and Radiation Oncology, University Hospital Jena, Friedrich-Schiller-University, 11 https://ror.org/035rzkx15 grid.275559.9 0000 0000 8517 6224 Clinician Scientist Program OrganAge, Interdisciplinary Center for Clinical Research (IZKF), Jena University Hospital, 12 https://ror.org/00f7hpc57 grid.5330.5 0000 0001 2107 3311 Department of Radiation Oncology, Universitätsklinikum Erlangen, Friedrich-Alexander-Universität Erlangen-Nürnberg, 13 https://ror.org/00rcxh774 grid.6190.e 0000 0000 8580 3777 Department of Radiation Oncology, Faculty of Medicine and University Hospital Cologne, University of Cologne, 14 https://ror.org/01ej9dk98 grid.1008.9 0000 0001 2179 088X Department of Radiation Oncology, Olivia Newton-John Cancer Wellness & Research Centre, University of Melbourne, 15 https://ror.org/04tsk2644 grid.5570.7 0000 0004 0490 981X Department of Radiooncology, Marien Hospital Herne, University Hospital, Ruhr-University Bochum, 16 https://ror.org/02kkvpp62 grid.6936.a 0000000123222966 Department of Radiation Oncology and Radiotherapy at the Klinikum rechts der Isar, Technical University of Munich, 17 https://ror.org/00cfam450 grid.4567.0 0000 0004 0483 2525 Institute of Radiation Medicine (IRM), Helmholtz Zentrum München, 18 https://ror.org/02kkvpp62 grid.6936.a 0000000123222966 German Cancer Consortium (DKTK), partner site Munich, a partnership between DKFZ and Klinikum rechts der Isar, Technical University of Munich, Munich, Germany German Cancer Consortium (DKTK) Dresden and German Cancer Research Center (DKFZ) Heidelberg, 19 https://ror.org/02pqn3g31 0000 0004 7865 6683 German Cancer Consortium (DKTK), Partner Site Dresden, and German Cancer Research Center (DKFZ), Heidelberg, 20 https://ror.org/042aqky30 grid.4488.0 0000 0001 2111 7257 Department of Radiotherapy and Radiation Oncology, Faculty of Medicine and University Hospital Carl Gustav Carus, TUD Dresden University of Technology, 3 3 2025 2025 201 10 498144 1001 1013 10 8 2024 8 1 2025 03 03 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/  Open Access http://creativecommons.org/licenses/by/4.0/ Background Progression-free (PFS) and overall survival (OS) in UICC stage III non-small cell lung cancer (NSCLC) after definitive concurrent chemoradiotherapy (CRT) can be increased with consolidating immunotherapy. Recent studies have shown a strong predictive value of gross tumor volume (GTV) changes during CRT on OS. The TORCH trial investigated the prognostic impact of GTV changes during CRT as a predictor for a response to immunotherapy. Methods This retrospective non-interventional observational multicenter trial included n Results The mean GTV1 before radiation therapy (RT) was 145.29 ml with the 25th, 50th, and 75th percentiles being 61.36 ml, 145.29 ml, and 204.93 ml, respectively. Before initiation of the radiation boost, the mean GTV2 was 99.58 ml, with the 25th, 50th, and 75th percentiles at 32.93 ml, 70.45 ml, and 126.85 ml. The HR for the impact of GTV1 on survival was 0.99 per ml (95% confidence interval [CI] 0.99–1.00; p p p p Conclusion Pretreatment GTV and absolute GTV volume changes did not significantly correlate with OS. However, the absolute volume change between the pretreatment and replanning GTV was associated with longer OS in patients treated with durvalumab. Histological subtype, grading, UICC stage, age at onset, pulmonary comorbidities, and smoking status had no significant association with OS. Durvalumab treatment was associated with improved OS. Supplementary Information The online version of this article (10.1007/s00066-025-02374-3) contains supplementary material, which is available to authorized users. Keywords Non-small cell lung cancer Gross tumor volume Immunotherapy Durvalumab Stage III lung cancer http://dx.doi.org/10.13039/100004325 AstraZeneca Universitätsklinikum Halle (Saale) (8960) Open Access funding enabled and organized by Projekt DEAL. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer-Verlag GmbH Germany, part of Springer Nature 2025 Introduction Locally advanced non-small cell lung cancer (NSCLC) UICC stage III accounts for approximately one third of all NSCLC patients [ 1 2 3 4 5 6 The prognostic value of the gross tumor volume (GTV) in CRT of stage III NSCLC is under debate. Despite the correlation between increasing tumor volume and higher T stages in the TNM system, stage was found to be a poor predictor of primary tumor volume [ 7 8 9 10 11 [ 18 12 13 12 The “young DEGRO” working group of the German Society of Radiation Oncology (DEGRO) conducted a multicenter study to evaluate the impact of PET/CT-based treatment planning on the prognosis of patients with NSCLC stage III. The use of PET/CT co-registration in radiation planning tended to result in better oncologic outcomes, although no significant association could be shown [ 14 In the phase III randomized NCT02125461 15 Recently, the NCT03055715 n n 16 In most cases, TNM staging derives from surgical interventions. However, initial tumor volume might be more important than T stage in patients treated with CRT without surgery. Such relations were also shown by other studies [ 17 The primary objective of our multicenter study was to validate the predictive role of tumor volume change under CRT in stage III NSCLC as a predictor for a response to immunotherapy. Methods Study population, treatment, and participating institutions This retrospective observational cohort study was conducted as a follow-up study of the NCT03055715 n 16 Ten university centers participated in the present study (eight of these centers were part of the previous study). The inclusion period was 2015–2023. The data-generating process is depicted in Fig. 1 Fig. 1 Overview of the data-generating process; CTX app. GTV CRT Inclusion criteria were 1) an age of at least 18 years, 2) biopsy-proven locally advanced NSCLC (patients treated by primary CRT; stage III as determined by CT or PET scan), 3) at least two cycles of platinum-based chemotherapy concurrent with radiation therapy, 4) CT-based imaging of tumor volume during CRT, 5) a World Health Organization (WHO) performance status of 0–1, and 6) an estimated life expectancy of more than 12 weeks. Patients with prior exposure to any anti-PD‑1 or anti-PD-L1 antibody therapy; patients with an active or prior autoimmune disease or history of immunodeficiency; patients with evidence of severe or uncontrolled systemic diseases, including active bleeding, diatheses, or active infections including hepatitis B, C, and HIV; patients with evidence of uncontrolled illnesses such as symptomatic congestive heart failure, uncontrolled hypertension, or unstable angina pectoris; patients with any unresolved toxicity CTCAE > grade 2 from the prior CRT; and patients with active or prior documented inflammatory bowel disease (e.g. Crohn’s disease, ulcerative colitis) were excluded from the study. The local ethics (reference number: 2016-122) and data protection committees of the participating institutions approved the study protocol and gave their positive vote, which was carried out in accordance with the declaration of Helsinki of 1975 (as revised in 2008). Patient, treatment, and clinical data were extracted from the patients’ clinical records at the participating sites and collected using electronic case report forms (eCRF) which were stored in the RadPlanBio database of the German Cancer Consortium (DKTK) and the German Cancer Research Center (DKFZ) [ 18 19 Detection and definition of gross tumor volume and toxicity The GTV included the gross tumor volume (without lymph nodes) as detectable in the planning CT or FDG-PET/CT and was reported in milliliters. Where FDG-PET was available, FDG-PET-CT co-registration was hardware (integrated PET-CT scanner) or software based (with the need for repositioning of the patient), according to the equipment situation of the institutions. The baseline GTV1 was delineated in the planning CT, which was obtained before the start of RT and correlated with PET, if existing. GTV2 was obtained from the re-planning CT after the patients had received 40–50 Gy. The assessment of tumor response after chemoradiotherapy was based on the first routine follow-up scan using the RECIST 1.1 criteria. In survival plots, we defined low and high values according to the 25% and 75% quantile. Statistics To account for heterogeneity in GTV contouring, we used frailty survival methods with study center as the shared frailty. This method includes a random term to account for systematic institutional variation in delineation. Absolute and relative GTV changes before/during CRT were correlated with OS to predict the response to CRT with sequential immunotherapy. This association was assessed by computing hazard ratios (HR) from Cox regression models using the coxph() function of the R survival package. Here, an HR of 0.96 of the absolute volume change can be interpreted as a reduction in the risk of experiencing an event of 4% per milliliter tumor shrinkage. If the tumor shrinks by more than 1 ml, the corresponding risk reduction is higher. All other analyses are secondary. Our models were additionally adjusted for UICC stage, chemotherapy, age, RT dose (given by treatment), histology (adenocarcinoma or squamous cell carcinoma), grading, and pulmonary comorbidities. For illustrative purposes, we plotted Kaplan–Meier curves. The 25%, 50%, and 75% quantiles were used to define the patient groups with low, intermediate, and high GTV values as well as strong, intermediate, and weak GTV decreases from GTV1 before RT and GTV2 during RT. For survival comparisons, HR values are reported with a 95% confidence interval (CI). Deviations from the assumption of random residuals were assessed visually by plotting the Martingale residuals. In addition, we computed the linear metric association of tumor volume and its alteration during treatment by applying linear regression models. Further, the statistical analyses also include models considering only complete observations without missing data. A significance level of 5% was used. All statistical analyses were performed using R 4.1.2 (R Core Team 2021). Results Patient characteristics The dataset consists of 203 patients characterized by various demographic and clinical attributes. After excluding implausible values, 189 patients remained for analysis, as detailed in Table 1 n Regarding tobacco use, 18% were non-smokers, 36% were smokers, and 32% were ex-smokers; 13% had unknown smoking status. The durvalumab group had similar smoking proportions. Table 1 Patient characteristics All patients Durvalumab-treated patients Patients without durvalumab treatment GTV1 (ml) 1st quartile 61.36 50.75 75.59 Median 102.79 88.70 143.00 Mean 145.29 14.90 162.11 3rd quartile 204.93 175.21 216.54 GTV2 (ml) 1st quartile 32.93 26.59 38.70 Median 70.45 55.50 83.40 Mean 99.58 82.82 113.40 3rd quartile 126.85 106.83 153.10 Absolute volume change (ml) 1st quartile 5.598 4.00 6.45 Median 25.715 24.79 26.48 Mean 45.701 42.08 48.69 3rd quartile 66.347 59.80 78.96 Radiation dose (Gy) 1st quartile 60.00 62.25 60.00 Median 66.00 66.00 66.00 Mean 63.75 64.60 63.03 3rd quartile 66.00 66.60 66.00 Radiation technique (n) VMAT 120 51 69 IMRT 59 30 29 Other 8 5 3 Chemotherapy (n) Cisplatin 105 53 52 Vinorelbine 111 55 56 Paclitaxel 54 11 43 Etoposide 11 10 1 Carboplatin 84 31 53 Histology (n) Squamous cell carcinoma 105 44 61 Adenocarcinoma 76 37 39 Unknown 8 5 3 Grading (n) G1 2 0 2 G2 64 33 31 G3 62 36 26 G4 2 1 1 Unknown 59 16 43 PD-L1 (n) < 1% 38 4 34 ≥ 1% 103 77 26 Unknown 48 5 43 UICC (n) III 6 0 6 IIIA 70 32 38 IIIB 92 42 50 IIIC 21 12 9 T stage (n) T1 11 6 5 T2 10 5 5 T2a 7 2 5 T2b 10 3 7 T3 44 25 19 T4 104 44 60 N stage (n) Nx 6 2 4 N0 27 12 15 N+ 3 1 2 N1 21 11 10 N2 77 35 42 N3 54 24 30 PET-based planning (n) No 9 3 6 Yes 180 83 97 Age at onset (years) 1st quartile 59.00 69.00 59.00 Median 65.50 64.00 66.50 Mean 65.07 64.67 65.41 3rd quartile 71.25 71.00 72.00 Pulmonary comorbidities (n) Yes 82 49 33 No 106 37 69 Unknown 1 0 1 Gender (n) Female 66 33 33 Male 123 53 70 Smoking (n) Never 35 18 17 Current 69 28 41 Past 60 34 26 Unknown 25 6 19 Durvalumab (n) Yes 86 86 0 No 79 0 79 Unknown 24 0 24 GTV1 GTV2 VMAT IMRT Cancer staging according to the Union for International Cancer Control (UICC) showed 49% in stage IIIB, 37% in stage IIIA, and 11% in stage IIIC, with similar distributions in both groups. Squamous cell carcinoma (SCC) was the most common histological subtype, present in 55% of all patients and in 51% of those treated with durvalumab. Adenocarcinoma (AC) was diagnosed in 40% of patients. The histological subtype was unknown for 5% overall and for 6% in the durvalumab subgroup. Regarding PD-L1 status, 20% had less than 1% expression, 54% had 1% or greater, and 25% were unknown. In the durvalumab group, 90% had PD-L1 expression of ≥ 1%. Four patients (5%) with PD-L1 levels below 1% were treated with durvalumab. Overall, 86 patients (45%) were treated with durvalumab, while 79 patients (42%) did not receive durvalumab therapy. The majority of tumors were classified as grade G2 (34% or 64 patients) and grade G3 (33% or 62 patients), with similar proportions in the durvalumab-treated group. Grades G1 and G4 were less common, each accounting for 1% of the patients (2 patients each). Tumor grading was unknown for a substantial portion (59 patients; 31%). Regarding T status, T4 stage tumors were most prevalent, found in 104 patients (55%) treated with or without durvalumab and in 44 patients (51%) receiving durvalumab. Other T stages ranged widely from T1 to T3. The most common N stage was N2 with 77 patients (41%), followed by N3 with 54 patients (29%). An N0 status was observed in 27 patients (14%) and N1 in 21 patients (11%). Pulmonary comorbidities were present in 82 patients (43%) considering all included cases and in 49 patients (56%) in the durvalumab-treated group, with slightly fewer patients without pulmonary comorbidities in this group. Radiation planning was FDG-PET/CT based in the majority of cases for both treatment groups (all patients 95%; durvalumab group 96%). The most frequently used radiation technique was VMAT (all patients: n n Chemotherapy regimens showed that cisplatin was the most commonly used chemotherapeutic drug in combination with vinorelbine (all patients: n n Intra-therapeutic GTV changes and the association with overall survival The median OS for the entire cohort was 13.7 months (Table 2 Table 2 Median overall survival (months) All patients Durvalumab treated patients GTV1 Low 19.77 17.80 Intermediate 12.95 17.52 High 13.37 15.60 GTV2 Low 14.37 17.80 Intermediate 13.42 17.52 High 14.47 15.60 Absolute volume change Low 14.47 21.57 Intermediate 13.78 14.83 High 13.00 15.90 Total 13.70 15.75 The mean GTV1 before RT was 145.29 ml, with 25th, 50th, and 75th percentiles of 61.36 ml, 145.29 ml, and 204.93 ml, respectively. Before initiation of the radiation boost, the mean GTV2 was 99.58 ml, with the 25th, 50th, and 75th percentiles at 32.93 ml, 70.45 ml, and 126.85 ml, respectively. The mean absolute difference between the two volumes was 45.70 ml, with the 25th, 50th, and 75th percentiles at 5.59 ml, 25.71 ml, and 66.34 ml, respectively, for all patients and 42.08 ml with an IQR of 4.00–59.8 ml for patients treated with durvalumab after CRT. Figure 2 Fig. 2 Martingale residual plot of the absolute differences between GTV1 and GTV2 Median OS was 19.77 months, 12.95 months, and 13.37 months for patients with a low, intermediate, and high baseline GTV1 before RT, respectively. Moreover, the median OS was 14.47 months, 13.42 months, and 14.37 months for patients with a high, intermediate, and low GTV2, respectively, before the initiation of boost RT. The respective HR values can be found in Tables 3 4 p p 15 p Table 3 Hazard ratios for all patients with the outcome of overall survival Hazard ratio 95% confidence interval p GTV1 – 0.999 0.996–1.002 0.49 Absolute volume change – 1.004 0.997–1.011 0.26 Radiation dose – 0.954 0.878–1.037 0.27 Histology Squamous cell carcinoma 1 (reference) – – Adenocarcinoma 0.675 0.339–1.344 0.26 Grading G1/2 1 (reference) – – G3/4 1.210 0.573–2.556 0.62 UICC IIIA 1 (reference) – – IIIB/C 1.639 0.812–3.305 0.17 Age at onset – 0.992 0.956–1.030 0.69 Pulmonary comorbidities Yes 0.927 0.468–1.838 0.83 No 1 (reference) – – Smoking Never 1 (reference) – – Current 1.118 0.338–3.705 0.85 Past 2.180 0.649–7.323 0.21 Durvalumab Yes 0.454 0.209–0.990 0.047 No 1 (reference) – – Table 4 Hazard ratios for durvalumab treated patients with the outcome of overall survival Hazard ratio 95% confidence interval p GTV1 – 1.013 0.979–1.048 0.46 Absolute volume change – 0.955 0.916–0.996 0.03 Radiation dose – 0.969 0.744–1.263 0.82 Histology Squamous cell carcinoma 1 (reference) – – Adenocarcinoma 0.659 0.098–4.429 0.67 Grading G1/2 1 (reference) – – G3/4 0.870 0.094–8.100 0.90 UICC IIIA 1 (reference) – – IIIB/C 1.220 0.217–6.854 0.17 Age at onset – 0.935 0.828–1.055 0.27 Pulmonary comorbidities Yes 1.193 0.144–9.853 0.87 No 1 (reference) – – Smoking Never 1 (reference) – – Current 0.027 0.0003–2.497 0.12 Past 0.341 0.004–28.718 0.63 Figure 3 4 5 6 Fig. 3 Kaplan–Meier plot of OS according to absolute GTV difference quantiles before radiotherapy of the durvalumab subgroup. High, intermediate, and low GTV differences referring to the 25% and 75% quantiles Fig. 4 Kaplan–Meier plot of OS according to absolute GTV1 before radiotherapy of the durvalumab subgroup. High, intermediate, and low GTV1 referring to the 25% and 75% quantiles Fig. 5 Kaplan–Meier plot of OS according to absolute GTV2 before radiotherapy boost of the durvalumab subgroup. High, intermediate, and low GTV2 referring to the 25% and 75% quantiles Fig. 6 Kaplan–Meier plot of OS according to relative GTV change during radiotherapy (from GTV1 to GTV 2) of the durvalumab subgroup. Low, intermediate, and high GTV decrease referring to the 25 and 75% quantiles The HRs regarding administered radiation dose, histology, and grading can be found in Tables 3 4 In short, UICC stage, age at onset, pulmonary comorbidities, and smoking status were not found to be prognostic factors in terms of survival. Only durvalumab treatment was significantly associated with improved OS, with an HR of 0.454 (95% CI 0.209–0.990; p 3 4 We performed an additional patterns-of-failure analysis to examine the distribution of recurrences in all patients and specifically in those treated with durvalumab. Among all patients, 25 experienced local recurrence, 3 had regional recurrence, and 29 developed distant metastases (Table 5 6 Table 5 Sites of treatment failure All patients Durvalumab-treated patients Local recurrence 25 9 Regional recurrence 3 1 Distant metastasis 29 17 Discussion In our analysis there was no evidence of an impact of the pre-treatment GTV on OS in either treatment group. These findings are consistent with the results of the study by Ball et al., who, after adjusting for the T and N stages, also did not find a significant association between pre-treatment GTV and survival after radical RT [ 20 In a study by Kanzaki et al., a significant impact of the pre-treatment GTV on OS was reported after RT for a continuous increase of 10 cm 3 21 To the authors’ knowledge, the TORCH study, which includes a total of n Comparable studies often include only a small number of patients, and data quality is limited due to heterogeneous GTV definition and the methodology of tumor volume detection. Moreover, most studies include patients whose GTVs were determined after neoadjuvant chemotherapy. In three studies, the tumor volumes of the primary tumor were combined with the affected lymph nodes [ 22 24 In our data, patients treated with durvalumab with high pre-RT GTVs had inferior median OS rates compared to patients with intermediate and low pre-RT GTVs. These results correspond to other studies evaluating the pre-treatment GTV and its impact on outcome after RT such as analyses form Martel, Kim, and Bradley et al., who reported a strong influence of the baseline GTV on OS and tumor control [ 17 25 Treatment with durvalumab became the standard of care after the PACIFIC trial had demonstrated that PFS and OS in patients with UICC stage III non-small cell lung cancer (NSCLC) can be improved with consolidative immunotherapy following definitive concurrent chemoradiotherapy (CRT) [ 15 Further, Kanzaki et al. found baseline GTV before RT to be an independent prognostic factor in patients with adenocarcinoma [ 21 16 While the summarized evidence favors the prognostic value of the pre-treatment GTV overall, the predictive value of the GTV detected during RT is still unclear [ 17 26 27 16 We re-evaluated GTV changes during RT between 40 and 50 Gy. By contrast, the GTV measurement timepoints in the literature vary between 2 weeks after the start of RT and 4 weeks after the end of RT [ 17 28 29 The prediction of outcomes based on GTV changes remains indecisive in the literature [ 17 21 27 29 30 30 The large number of included stage III NSCLC patients ( n Although the patient cohort in this study was relatively homogenous in terms of treatment, with a majority of 87% of patients having received more than 60 Gy and conventional fractionation in 96% with simultaneous CRT in 100% of patient cases, a certain heterogeneity level regarding radiation dose, fractionation dose, and CT timing needs to be considered. Additionally, the initiation of immunotherapy after CRT might also be heterogeneous between the study centers due to differing treatment workflows. Furthermore, the retrospective design of this study limits its explanatory power compared to a prospective study. Our study focused on a cohort of UICC stage III patients in an unequal distribution. Moreover, potential variability could be caused by inter-center inconsistencies and treatment regimen variability, and differing imaging methods for GTV re-evaluation could contribute to noisy data. This was addressed by including the study center as the frailty. Furthermore, the initial size of the tumor differed between patients with and without durvalumab treatment. This was addressed by including the initial GTV1 as a covariate in the Cox regression model. GTV definition and 3D radiation planning in this study were uniform, and imaging for GTV1 and GTV2 detection was performed similarly at the centers. However, potential variations in FDG-PET/CT co-registration methods need to be taken into consideration. FDG uptake was evaluated during thoracic RT to determine whether significant changes in FDG uptake or tumor volume could be measured early enough to adapt the RT plan. During RT, PET/CTs were performed every 7 fractions. An average 50% decrease in maximal standard uptake value (SUVmax) was observed around 40–45 Gy (i.e., during week 5 of RT) [ 31 Nevertheless, a certain level of uncertainty and difficulty caused by the definition of the GTV excluding lymph nodes remained, leading to a difficult delineation process for the trialists. Especially in stage III NSCLC, the separation between the GTV and the adjunct lymph nodes can be challenging, even for experienced radiation oncologists [ 32 In our study we did not measure volume changes in lymph nodes which might also respond to radiotherapy. However, the primary tumor volume is a more suitable surrogate, as false classifications due to inflammatory nodes are less likely to bias our results. In addition, lymph nodes contribute only minorly to the total tumor volume, even more as they are encapsulated. In our cohort, only three patients experienced a progression in lymph nodes, which underscores their subordinate role compared to the primary tumor when it comes to the estimation of total tumor burden. The prospective phase II RTEP7-IFCT-1402 study investigated local tumor control rates for patients treated with adaptive RT (up to 74 Gy) or standard RT (66 Gy) according to FDG-PET residual tumor uptake at 42 Gy. In their findings, the PET-guided RT boost improved local control without increased severe adverse events compared to standard RCT. Additionally, both groups underwent induction chemotherapy followed by concurrent RCT with platinum-based regimens [ 33 33 In our study, the absolute tumor volume reduction had a predictive value in terms of survival for durvalumab-treated patients. To our knowledge, there are only a few studies dealing with the predictive role of GTV changes for the survival outcome of patients treated with durvalumab. This could be explained by the fact that most studies on this topic were conducted in the period before the era of immunotherapy [ 17 34 Conclusion High absolute GTV shrinkage was associated with improved median OS in our patient cohort treated with durvalumab. We did not observe an association between absolute volume change and OS during RT in the overall cohort. This finding did not completely confirm our initial hypothesis; on the contrary, it gives hope to patients without a good tumor response during the first phase of RT. Our study also highlighted that histological subtype, grading, UICC stage, age at onset, pulmonary comorbidities, and smoking status did not significantly impact survival, contrasting with the significance of durvalumab treatment. Our findings support the notion that tumor volume reduction during RT can be a promising predictor of survival, especially since consolidative treatment with durvalumab is the current standard of care in the treatment of locally advanced NSCLC. Future research is needed to further investigate the prognostic role of GTV changes, particularly in the era of immune checkpoint inhibitor treatment, to optimize therapeutic strategies for patients with stage III unresectable NSCLC. Supplementary Information  The supplementary figures provide additional insights into the impact of tumor volume on survival outcomes. Figure S1presents a Kaplan–Meier plot of overall survival (OS) based on absolute GTV1 before radiotherapy, categorized into high, intermediate, and low groups according to the 25th and 75th percentiles. Similarly, Figure S2 illustrates OS based on absolute GTV2 before the radiotherapy boost, following the same categorization. Figure S3 shows OS in relation to relative GTV changes during radiotherapy (from GTV1 to GTV2), with low, intermediate, and high GTV decreases defined by the 25th and 75th percentiles. Figure S4 depicts intrathoracic progression-free survival (PFS) in patients treated with durvalumab, stratified according to absolute tumor volume reduction. Lastly, Figure S5 presents distant metastasis-free survival (DMFS) in durvalumab-treated patients, also stratified by absolute tumor volume reduction. Abbreviations AC Adenocarcinoma CHT Chemotherapy CI Confidence interval CRF Case report form CRT Chemoradiotherapy CT Computer tomography DEGRO German Society of Radiation Oncology DKFZ German Cancer Research Center DKTK German Cancer Consortium ECOG Eastern Cooperative Oncology Group FDG-PET/CT Fluorodeoxyglucose positron-emission tomography GTV Gross tumor volume HR Hazard ratio IMRT Intensity-modulated radiation therapy NSCLC Non-small cell lung cancer OS Overall survival PD-L1 Programmed death-ligand 1 RECIST Response Evaluation Criteria in Solid Tumors RKI Robert Koch Institute RT Radiation therapy SCC Small cell carcinoma SCLC Small cell lung cancer SD Standard deviation SIB Simultaneous integrated boost TNM Tumor node metastasis UICC Union of International Cancer Control VMAT Volume modulated arc therapy The authors Simon Trommer and Jörg Andreas Müller contributed equally to the manuscript. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Funding This study was conducted with support from AstraZeneca GmbH. Author Contribution All authors contributed to study conception, data collection and design. Material preparation and analysis were performed by Simon Trommer, Jörg Andreas Müller, and Daniel Medenwald. The first draft of the manuscript was written by Jörg Andreas Müller and Simon Trommer, and all authors commented on previous versions of the manuscript. All authors read and approved the final manuscript. Funding Open Access funding enabled and organized by Projekt DEAL. Declarations Conflict of interest S. Roohani is a participant in the BIH Charité Junior Clinician Scientist Program funded by the Charité—Universitätsmedizin Berlin and the Berlin Institute of Health (BIH). S. Trommer, J.A. Müller, M. Oertel, F. Ehret, H.M. Ha, Q.N. Ha, K. Hering, F. Nägler, T. Lange, M. Mäurer, T. Weissmann, F. Putz, M. Trommer, C. Baues, S. Dobiasch, M. Waltenberger, T. Skripcak, D. Vordermark, D. Medenwald, and E.J. Schmidt-Riese declare that they have no competing interests. Ethical standards The local ethics (reference number: 2016-122) and data protection committees of the participating institutions approved the study protocol and gave their positive vote for the study, which was carried out in accordance with the declaration of Helsinki of 1975 (as revised in 2008). Informed consent was obtained from all individual participants included in the study. References 1. Hansen RN Zhang Y Seal B Long-term survival trends in patients with unresectable stage III non-small cell lung cancer receiving chemotherapy and radiation therapy: a SEER cancer registry analysis BMC Cancer 2020 20 1 276 10.1186/s12885-020-06734-3 32248816 PMC7132866 Hansen RN, Zhang Y, Seal B et al (2020) Long-term survival trends in patients with unresectable stage III non-small cell lung cancer receiving chemotherapy and radiation therapy: a SEER cancer registry analysis. BMC Cancer 20(1):276. 10.1186/s12885-020-06734-3 32248816 10.1186/s12885-020-06734-3 PMC7132866 2. Miller KD Nogueira L Devasia T Cancer treatment and survivorship statistics, 2022 CA A Cancer J Clinicians 2022 72 5 409 436 10.3322/caac.21731 35736631 Miller KD, Nogueira L, Devasia T et al (2022) Cancer treatment and survivorship statistics, 2022. CA A Cancer J Clinicians 72(5):409–436. 10.3322/caac.21731 10.3322/caac.21731 35736631 3. Garg S Gielda BT Kiel K Patterns of locoregional failure in stage III non-small cell lung cancer treated with definitive chemoradiation therapy Pract Radiat Oncol 2014 4 5 342 348 10.1016/j.prro.2013.12.002 25194104 Garg S, Gielda BT, Kiel K et al (2014) Patterns of locoregional failure in stage III non-small cell lung cancer treated with definitive chemoradiation therapy. Pract Radiat Oncol 4(5):342–348. 10.1016/j.prro.2013.12.002 25194104 10.1016/j.prro.2013.12.002 4. Ahn JS Ahn YC Kim J-H Multinational randomized phase III trial with or without consolidation chemotherapy using docetaxel and cisplatin after concurrent chemoradiation in inoperable stage III non-small-cell lung cancer: KCSG-LU05-04 J Clin Oncol 2015 33 24 2660 2666 10.1200/JCO.2014.60.0130 26150444 Ahn JS, Ahn YC, Kim J‑H et al (2015) Multinational randomized phase III trial with or without consolidation chemotherapy using docetaxel and cisplatin after concurrent chemoradiation in inoperable stage III non-small-cell lung cancer: KCSG-LU05-04. J Clin Oncol 33(24):2660–2666. 10.1200/JCO.2014.60.0130 26150444 10.1200/JCO.2014.60.0130 5. Lau SCM Ryan M Weiss J Concurrent chemoradiation with or without durvalumab in elderly patients with unresectable stage III NSCLC: safety and efficacy JTO Clin Res Reports 2021 2 12 100251 10.1016/j.jtocrr.2021.100251 PMC8665356 34917991 Lau SCM, Ryan M, Weiss J et al (2021) Concurrent chemoradiation with or without durvalumab in elderly patients with unresectable stage III NSCLC: safety and efficacy. JTO Clin Res Reports 2(12):100251. 10.1016/j.jtocrr.2021.100251 10.1016/j.jtocrr.2021.100251 PMC8665356 34917991 6. Zaborowska-Szmit M Olszyna-Serementa M Kowalski DM Elderly patients with locally advanced and unresectable non-small-cell lung cancer may benefit from sequential chemoradiotherapy Cancers 2021 10.3390/cancers13184534 34572760 PMC8466795 Zaborowska-Szmit M, Olszyna-Serementa M, Kowalski DM et al (2021) Elderly patients with locally advanced and unresectable non-small-cell lung cancer may benefit from sequential chemoradiotherapy. Cancers. 10.3390/cancers13184534 34572760 10.3390/cancers13184534 PMC8466795 7. Martel MK Strawderman M Hazuka MB Volume and dose parameters for survival of non-small cell lung cancer patients Radiother Oncol 1997 44 1 23 29 10.1016/s0167-8140(97)00081-9 9288853 Martel MK, Strawderman M, Hazuka MB et al (1997) Volume and dose parameters for survival of non-small cell lung cancer patients. Radiother Oncol 44(1):23–29. 10.1016/s0167-8140(97)00081-9 9288853 10.1016/s0167-8140(97)00081-9 8. Mahmoud HA Oteify W Elkhayat H Volumetric parameters of the primary tumor and whole-body tumor burden derived from baseline 18F-FDG PET/CT can predict overall survival in non-small cell lung cancer patients: initial results from a single institution Eur J Hybrid Imaging 2022 6 1 37 10.1186/s41824-022-00158-x 36575330 PMC9794406 Mahmoud HA, Oteify W, Elkhayat H et al (2022) Volumetric parameters of the primary tumor and whole-body tumor burden derived from baseline 18F-FDG PET/CT can predict overall survival in non-small cell lung cancer patients: initial results from a single institution. Eur J Hybrid Imaging 6(1):37. 10.1186/s41824-022-00158-x 36575330 10.1186/s41824-022-00158-x PMC9794406 9. Dubben HH Thames HD Beck-Bornholdt HP Tumor volume: a basic and specific response predictor in radiotherapy Radiother Oncol 1998 47 2 167 174 10.1016/s0167-8140(97)00215-6 9683365 Dubben HH, Thames HD, Beck-Bornholdt HP (1998) Tumor volume: a basic and specific response predictor in radiotherapy. Radiother Oncol 47(2):167–174. 10.1016/s0167-8140(97)00215-6 9683365 10.1016/s0167-8140(97)00215-6 10. Reymen B van Loon J van Baardwijk A Total gross tumor volume is an independent prognostic factor in patients treated with selective nodal irradiation for stage I to III small cell lung cancer Int J Radiat Oncol Biol Phys 2013 85 5 1319 1324 10.1016/j.ijrobp.2012.10.003 23200174 Reymen B, van Loon J, van Baardwijk A et al (2013) Total gross tumor volume is an independent prognostic factor in patients treated with selective nodal irradiation for stage I to III small cell lung cancer. Int J Radiat Oncol Biol Phys 85(5):1319–1324. 10.1016/j.ijrobp.2012.10.003 23200174 10.1016/j.ijrobp.2012.10.003 11. Guckenberger M Richter A Wilbert J Adaptive radiotherapy for locally advanced non-small-cell lung cancer does not underdose the microscopic disease and has the potential to increase tumor control Int J Radiat Oncol Biol Phys 2011 81 4 e275 82 10.1016/j.ijrobp.2011.01.067 21497450 Guckenberger M, Richter A, Wilbert J et al (2011) Adaptive radiotherapy for locally advanced non-small-cell lung cancer does not underdose the microscopic disease and has the potential to increase tumor control. Int J Radiat Oncol Biol Phys 81(4):e275–82. 10.1016/j.ijrobp.2011.01.067 21497450 10.1016/j.ijrobp.2011.01.067 12. Nestle U Schimek-Jasch T Kremp S Imaging-based target volume reduction in chemoradiotherapy for locally advanced non-small-cell lung cancer (PET-Plan): a multicentre, open-label, randomised, controlled trial Lancet Oncol 2020 21 4 581 592 10.1016/S1470-2045(20)30013-9 32171429 Nestle U, Schimek-Jasch T, Kremp S et al (2020) Imaging-based target volume reduction in chemoradiotherapy for locally advanced non-small-cell lung cancer (PET-Plan): a multicentre, open-label, randomised, controlled trial. Lancet Oncol 21(4):581–592. 10.1016/S1470-2045(20)30013-9 32171429 10.1016/S1470-2045(20)30013-9 13. Simoff MJ Lally B Slade MG Symptom management in patients with lung cancer: diagnosis and management of lung cancer, 3rd ed: American college of chest physicians evidence-based clinical practice guidelines Chest 2013 143 5 e455S e497S 10.1378/chest.12-2366 23649452 Simoff MJ, Lally B, Slade MG et al (2013) Symptom management in patients with lung cancer: diagnosis and management of lung cancer, 3rd ed: American college of chest physicians evidence-based clinical practice guidelines. Chest 143(5):e455S–e497S. 10.1378/chest.12-2366 23649452 10.1378/chest.12-2366 14. Mäurer M Käsmann L Fleischmann DF PET/CT-based adaptive radiotherapy of locally advanced non-small cell lung cancer in multicenter yDEGRO ARO 2017-01 cohort study Radiat Oncol 2022 17 1 29 10.1186/s13014-022-01997-5 35139856 PMC8827193 Mäurer M, Käsmann L, Fleischmann DF et al (2022) PET/CT-based adaptive radiotherapy of locally advanced non-small cell lung cancer in multicenter yDEGRO ARO 2017-01 cohort study. Radiat Oncol 17(1):29. 10.1186/s13014-022-01997-5 35139856 10.1186/s13014-022-01997-5 PMC8827193 15. Antonia SJ Villegas A Daniel D Durvalumab after chemoradiotherapy in stage III non-small-cell lung cancer N Engl J Med 2017 377 20 1919 1929 10.1056/NEJMoa1709937 28885881 Antonia SJ, Villegas A, Daniel D et al (2017) Durvalumab after chemoradiotherapy in stage III non-small-cell lung cancer. N Engl J Med 377(20):1919–1929. 10.1056/NEJMoa1709937 28885881 10.1056/NEJMoa1709937 16. Ostheimer C Mäurer M Ebert N Prognostic impact of gross tumor volume during radical radiochemotherapy of locally advanced non-small cell lung cancer-results from the NCT03055715 Strahlenther Onkol 2021 197 5 385 395 10.1007/s00066-020-01727-4 33410959 PMC8062351 Ostheimer C, Mäurer M, Ebert N et al (2021) Prognostic impact of gross tumor volume during radical radiochemotherapy of locally advanced non-small cell lung cancer-results from the NCT03055715 33410959 10.1007/s00066-020-01727-4 PMC8062351 17. Käsmann L Niyazi M Blanck O Prädiktiver und prognostischer Wert des Tumorvolumens und seiner Veränderungen während radikaler Strahlentherapie beim nicht-kleinzelligen Bronchialkarzinom im Stadium III : Ein systematischer Review Strahlenther Onkol 2018 194 2 79 90 10.1007/s00066-017-1221-y 29030654 Käsmann L, Niyazi M, Blanck O et al (2018) Prädiktiver und prognostischer Wert des Tumorvolumens und seiner Veränderungen während radikaler Strahlentherapie beim nicht-kleinzelligen Bronchialkarzinom im Stadium III : Ein systematischer Review. Strahlenther Onkol 194(2):79–90. 10.1007/s00066-017-1221-y 29030654 10.1007/s00066-017-1221-y 18. Skripcak T Belka C Bosch W Creating a data exchange strategy for radiotherapy research: towards federated databases and anonymised public datasets Radiother Oncol 2014 113 3 303 309 10.1016/j.radonc.2014.10.001 25458128 PMC4648243 Skripcak T, Belka C, Bosch W et al (2014) Creating a data exchange strategy for radiotherapy research: towards federated databases and anonymised public datasets. Radiother Oncol 113(3):303–309. 10.1016/j.radonc.2014.10.001 25458128 10.1016/j.radonc.2014.10.001 PMC4648243 19. Skripcak T Just U Simon M Toward distributed conduction of large-scale studies in radiation therapy and oncology: open-source system integration approach IEEE J Biomed Health Inform 2016 20 5 1397 1403 10.1109/JBHI.2015.2450833 Skripcak T, Just U, Simon M et al (2016) Toward distributed conduction of large-scale studies in radiation therapy and oncology: open-source system integration approach. IEEE J Biomed Health Inform 20(5):1397–1403. 10.1109/JBHI.2015.2450833 20. Ball DL Fisher RJ Burmeister BH The complex relationship between lung tumor volume and survival in patients with non-small cell lung cancer treated by definitive radiotherapy: a prospective, observational prognostic factor study of the Trans-Tasman Radiation Oncology Group (TROG 99.05) Radiother Oncol 2013 106 3 305 311 10.1016/j.radonc.2012.12.003 23333017 Ball DL, Fisher RJ, Burmeister BH et al (2013) The complex relationship between lung tumor volume and survival in patients with non-small cell lung cancer treated by definitive radiotherapy: a prospective, observational prognostic factor study of the Trans-Tasman Radiation Oncology Group (TROG 99.05). Radiother Oncol 106(3):305–311. 10.1016/j.radonc.2012.12.003 23333017 10.1016/j.radonc.2012.12.003 21. Kanzaki H Kataoka M Nishikawa A Impact of early tumor reduction on outcome differs by histological subtype in stage III non-small-cell lung cancer treated with definitive radiotherapy Int J Clin Oncol 2016 21 5 853 861 10.1007/s10147-016-0982-0 27125214 Kanzaki H, Kataoka M, Nishikawa A et al (2016) Impact of early tumor reduction on outcome differs by histological subtype in stage III non-small-cell lung cancer treated with definitive radiotherapy. Int J Clin Oncol 21(5):853–861. 10.1007/s10147-016-0982-0 27125214 10.1007/s10147-016-0982-0 22. Werner-Wasik M Xiao Y Pequignot E Assessment of lung cancer response after nonoperative therapy: tumor diameter, bidimensional product, and volume. A serial CT scan-based study Int J Radiat Oncol Biol Phys 2001 51 1 56 61 10.1016/s0360-3016(01)01615-7 11516851 Werner-Wasik M, Xiao Y, Pequignot E et al (2001) Assessment of lung cancer response after nonoperative therapy: tumor diameter, bidimensional product, and volume. A serial CT scan-based study. Int J Radiat Oncol Biol Phys 51(1):56–61. 10.1016/s0360-3016(01)01615-7 11516851 10.1016/s0360-3016(01)01615-7 23. Dehing-Oberije C de Ruysscher D van der Weide H Tumor volume combined with number of positive lymph node stations is a more important prognostic factor than TNM stage for survival of non-small-cell lung cancer patients treated with (chemo)radiotherapy Int J Radiat Oncol Biol Phys 2008 70 4 1039 1044 10.1016/j.ijrobp.2007.07.2323 17889446 Dehing-Oberije C, de Ruysscher D, van der Weide H et al (2008) Tumor volume combined with number of positive lymph node stations is a more important prognostic factor than TNM stage for survival of non-small-cell lung cancer patients treated with (chemo)radiotherapy. Int J Radiat Oncol Biol Phys 70(4):1039–1044. 10.1016/j.ijrobp.2007.07.2323 17889446 10.1016/j.ijrobp.2007.07.2323 24. Etiz D Marks LB Zhou S-M Influence of tumor volume on survival in patients irradiated for non-small-cell lung cancer Int J Radiat Oncol Biol Phys 2002 53 4 835 846 10.1016/s0360-3016(02)02814-6 12095548 Etiz D, Marks LB, Zhou S‑M et al (2002) Influence of tumor volume on survival in patients irradiated for non-small-cell lung cancer. Int J Radiat Oncol Biol Phys 53(4):835–846. 10.1016/s0360-3016(02)02814-6 12095548 10.1016/s0360-3016(02)02814-6 25. Basaki K Abe Y Aoki M Prognostic factors for survival in stage III non-small-cell lung cancer treated with definitive radiation therapy: impact of tumor volume Int J Radiat Oncol Biol Phys 2006 64 2 449 454 10.1016/j.ijrobp.2005.07.967 16226400 Basaki K, Abe Y, Aoki M et al (2006) Prognostic factors for survival in stage III non-small-cell lung cancer treated with definitive radiation therapy: impact of tumor volume. Int J Radiat Oncol Biol Phys 64(2):449–454. 10.1016/j.ijrobp.2005.07.967 16226400 10.1016/j.ijrobp.2005.07.967 26. Kwint M Stam B Proust-Lima C The prognostic value of volumetric changes of the primary tumor measured on Cone Beam-CT during radiotherapy for concurrent chemoradiation in NSCLC patients Radiother Oncol 2020 146 44 51 10.1016/j.radonc.2020.02.002 32114265 Kwint M, Stam B, Proust-Lima C et al (2020) The prognostic value of volumetric changes of the primary tumor measured on Cone Beam-CT during radiotherapy for concurrent chemoradiation in NSCLC patients. Radiother Oncol 146:44–51. 10.1016/j.radonc.2020.02.002 32114265 10.1016/j.radonc.2020.02.002 27. Koo TR, Moon SH, Lim YJ et al The effect of tumor volume and its change on survival in stage III non-small cell lung cancer treated with definitive concurrent chemoradiotherapy. Radiat Oncol. 10.1186/s13014-014-0283-6 10.1186/s13014-014-0283-6 PMC4268851 25498887 28. Fox J Ford E Redmond K Quantification of tumor volume changes during radiotherapy for non-small-cell lung cancer Int J Radiat Oncol Biol Phys 2009 74 2 341 348 10.1016/j.ijrobp.2008.07.063 19038504 Fox J, Ford E, Redmond K et al (2009) Quantification of tumor volume changes during radiotherapy for non-small-cell lung cancer. Int J Radiat Oncol Biol Phys 74(2):341–348. 10.1016/j.ijrobp.2008.07.063 19038504 10.1016/j.ijrobp.2008.07.063 29. Ostheimer C Schweyer F Reese T The relationship between tumor volume changes and serial plasma osteopontin detection during radical radiotherapy of non-small-cell lung cancer Oncol Lett 2016 12 5 3449 3456 10.3892/ol.2016.5104 27900019 PMC5103967 Ostheimer C, Schweyer F, Reese T et al (2016) The relationship between tumor volume changes and serial plasma osteopontin detection during radical radiotherapy of non-small-cell lung cancer. Oncol Lett 12(5):3449–3456. 10.3892/ol.2016.5104 27900019 10.3892/ol.2016.5104 PMC5103967 30. van Elmpt W Ollers M Dingemans A-MC Response assessment using 18F-FDG PET early in the course of radiotherapy correlates with survival in advanced-stage non-small cell lung cancer J Nucl Med 2012 53 10 1514 1520 10.2967/jnumed.111.102566 22879081 PMC4667805 van Elmpt W, Ollers M, Dingemans A‑MC et al (2012) Response assessment using 18F-FDG PET early in the course of radiotherapy correlates with survival in advanced-stage non-small cell lung cancer. J Nucl Med 53(10):1514–1520. 10.2967/jnumed.111.102566 22879081 10.2967/jnumed.111.102566 PMC4667805 31. Edet-Sanson A Dubray B Doyeux K Serial assessment of FDG-PET FDG uptake and functional volume during radiotherapy (RT) in patients with non-small cell lung cancer (NSCLC) Radiother Oncol 2012 102 2 251 257 10.1016/j.radonc.2011.07.023 21885145 Edet-Sanson A, Dubray B, Doyeux K et al (2012) Serial assessment of FDG-PET FDG uptake and functional volume during radiotherapy (RT) in patients with non-small cell lung cancer (NSCLC). Radiother Oncol 102(2):251–257. 10.1016/j.radonc.2011.07.023 21885145 10.1016/j.radonc.2011.07.023 32. Giraud P Elles S Helfre S Conformal radiotherapy for lung cancer: different delineation of the gross tumor volume (GTV) by radiologists and radiation oncologists Radiother Oncol 2002 62 1 27 36 10.1016/s0167-8140(01)00444-3 11830310 Giraud P, Elles S, Helfre S et al (2002) Conformal radiotherapy for lung cancer: different delineation of the gross tumor volume (GTV) by radiologists and radiation oncologists. Radiother Oncol 62(1):27–36. 10.1016/s0167-8140(01)00444-3 11830310 10.1016/s0167-8140(01)00444-3 33. Vera P Thureau S Le Tinier F Adaptive radiotherapy (up to 74 Gy) or standard radiotherapy (66 Gy) for patients with stage III non-small-cell lung cancer, according to 18FFDG-PET tumour residual uptake at 42 Gy (RTEP7-IFCT-1402): a multicentre, randomised, controlled phase 2 trial Lancet Oncol 2024 25 9 1176 1187 10.1016/S1470-2045(24)00320-6 39134086 Vera P, Thureau S, Le Tinier F et al (2024) Adaptive radiotherapy (up to 74 Gy) or standard radiotherapy (66 Gy) for patients with stage III non-small-cell lung cancer, according to 18FFDG-PET tumour residual uptake at 42 Gy (RTEP7-IFCT-1402): a multicentre, randomised, controlled phase 2 trial. Lancet Oncol 25(9):1176–1187. 10.1016/S1470-2045(24)00320-6 39134086 10.1016/S1470-2045(24)00320-6 34. Lee HI Choi EK Kim SS Predictive value of primary tumor volume change during concurrent chemoradiotherapy in patients with unresectable stage III non-small cell lung cancer Radiother Oncol 2024 198 110383 10.1016/j.radonc.2024.110383 38879129 Lee HI, Choi EK, Kim SS et al (2024) Predictive value of primary tumor volume change during concurrent chemoradiotherapy in patients with unresectable stage III non-small cell lung cancer. Radiother Oncol 198:110383. 10.1016/j.radonc.2024.110383 38879129 10.1016/j.radonc.2024.110383 ",
  "metadata": {
    "Title of this paper": "Predictive value of primary tumor volume change during concurrent chemoradiotherapy in patients with unresectable stage III non-small cell lung cancer",
    "Journal it was published in:": "Strahlentherapie Und Onkologie",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488809/"
  }
}