{
  "title": "Paper_550",
  "abstract": "Am J Hematol Am J Hematol 319 nihpa American journal of hematology 0361-8609 1096-8652 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12483468 PMC12483468.1 12483468 12483468 NIHMS2110183 39777927 10.1002/ajh.27581 NIHMS2110183 NIHPA2110183 1 Article Budesonide, Added to PTCy-Based Regimen, for Prevention of Acute GI GVHD After Allogeneic Stem Cell Transplantation Kongtim Piyanuch 1 Chumnumsiriwath Piyatida 1 http://orcid.org/0000-0002-1131-5564 Vittayawacharin Pongthep 1 Jeyakumar Deepa 1 http://orcid.org/0000-0002-1678-1345 Lee Benjamin J. 2 3 Doh Jean 2 Griffin Shawn P. 2 3 Van Etten Richard A. 1 http://orcid.org/0000-0001-8597-3271 Ciurea Stefan 1 1 2 3 Correspondence: sciurea@hs.uci.edu Author Contributions The authors confirm their contribution to the paper as follows: study conception and design: SC; data collection and verification: PK, PC, PV; statistical design and data analysis: PK; interpretation of results: PK, SC; draft manuscript preparation: PK, SC; patient cares: PK, SC, DJ, BL, JD, SG, RVE; review of the results, manuscript revisions and final manuscript approval: all authors. Conflicts of Interest The authors declare no conflicts of interest. 3 2025 08 1 2025 100 3 497820 383 392 20 09 2025 30 09 2025 01 10 2025 01 10 2025 Oral budesonide exerts local effects with negligible systemic glucocorticoid activity, due to rapid first-pass metabolism, therefore, could potentially be efficacious in preventing gastrointestinal (GI) acute GVHD (aGVHD). We explored the use of budesonide, added to posttransplant cyclophosphamide (PTCy), tacrolimus, and mycophenolate mofetil, for prevention of GI aGVHD after allogeneic hematopoietic stem cell transplantation (AHSCT) in a prospective observational study and treated 80 patients with a median age of 53 years (range 19–74). Results were compared with a publicly available CIBMTR dataset of 646 patients who received PTCy-based GVHD prophylaxis (CIBMTR Study # GV17-02) (control). Cumulative incidence (CI) of 3-month grade 2–4 and grade 3–4 aGVHD in the budesonide and control groups were 3.8% vs. 34.4% ( p p p p p p p p p p p allogeneic stem cell transplantation gastrointestinal GVHD GVHD algorithm oral budesonide posttransplant cyclophosphamide Reg3α ST2 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Budesonide, Added to PTCy-Based Regimen, for Prevention of Acute GI GVHD After Allogeneic Stem Cell Transplantation",
    "Journal it was published in:": "American journal of hematology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483468/"
  }
}