{
  "title": "Paper_594",
  "abstract": "pmc World J Surg Oncol World J Surg Oncol 199 wjsurgonc World Journal of Surgical Oncology 1477-7819 BMC PMC12482376 PMC12482376.1 12482376 12482376 41024184 10.1186/s12957-025-03969-x 3969 1 Research Application of preoperative three-dimensional reconstruction in single-port video-assisted thoracoscopic complex segmentectomy: a propensity matching analysis Chen Hao 1 2 3 4 Yuan Wenjie 1 2 3 4 Wu Zhonghua 1 2 3 4 Liang Wenxin 1 2 3 4 Wei Yuanpu 1 2 3 4 Huang Yu 1 2 3 4 Chen Chun chenchun0209@fjmu.edu.cn 1 2 3 4 Xu Guobing 76465455@qq.com 1 2 3 4 1 https://ror.org/055gkcy74 grid.411176.4 0000 0004 1758 0478 Department of Thoracic Surgery, Fujian Medical University Union Hospital, 2 https://ror.org/050s6ns64 grid.256112.3 0000 0004 1797 9307 Key Laboratory of Cardio-Thoracic Surgery, Fujian Medical University, 3 4 29 9 2025 2025 23 478195 349 4 6 2024 28 7 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background With the popularity of LDCT screening, more and more small lung cancers have been found, and segmentectomy has been widely used because of its advantages in the treatment of early lung cancer, but the feasibility of segmentectomy is still controversial because of the increased complexity of the operation. Especially in complex lung segment surgery, it is more controversial. Preoperative three-dimensional reconstruction (3DR) is one of the effective methods to ensure the smooth operation, but its role in complex segmentectomy has not yet been verified. This article aims to evaluate the value of preoperative three-dimensional reconstruction in complex pulmonary segmentectomy by retrospective analysis of preoperative three-dimensional reconstruction assisted single-port video-assisted thoracoscopic complex pulmonary segmentectomy and comparison of surgical related indicators. Methods The clinical data of patients with lung cancers who underwent single-port thoracoscopic complex segmentectomy ( n Results There were 125 patients in each group after PSM, and the baseline characteristics of patients were comparable. There were no significant differences in age, sex, BMI, smoking history, tumor histology and tumor size between the two groups (all P P Conclusion This is the first study to evaluate the usefulness of preoperative 3D reconstruction in complex segmentectomy. The results showed that the use of preoperative three-dimensional reconstruction for complex pulmonary segmentectomy was a safe and effective method, which could significantly reduce the operation time and blood loss. Keywords Lung cancers Complex segmentectomy Three-dimensional reconstruction Single-port thoracoscopy Joint Funds for the innovation of Science and Technology，Fujian province 2020CXA023 2020CXA023 2020CXA023 2020CXA023 Chen Hao Yuan Wenjie Chen Chun Xu Guobing college student innovation and entrepreneurship training program JC2022110 JC2022110 JC2022110 JC2022110 Chen Hao Yuan Wenjie Chen Chun Xu Guobing pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Lung cancer is the cancer with the highest morbidity and mortality; in recent decades, with the development of imaging (CT) and the popularity of lung cancer screening, more early lung cancer (< 2 cm) has been found [ 1 2 5 3 5 3 1 6 7 Fig. 1 Left upper lung nodule reconstruction Operation include the accurate location of lung cancers, the avoidance of misdivision of bronchi and blood vessels, the assurance of surgical margins and the prevention and control of complications. Therefore, it is particularly important to understand the anatomical characteristics of the patients around the lesions and the planning of the operation before the operation. Although many experienced doctors can have a general understanding of the structure of segmental bronchi by reading CT images, there are great limitations in understanding the target segment of blood vessels, because the shape of blood vessels is not as regular as that of bronchi, and they are prone to variation. Artificial intelligence three-dimensional reconstruction (3DR) system is favored by many doctors because it can display the anatomical structure of pulmonary segmental hilum stereoscopically and intuitively, and accurately identify the potential variation and tumor location, especially in complex pulmonary segmental resection. A different imaging interpretation and analysis system (IQQA-3D; developed by IQQA-Chest, EDDA Technology, Princeton Junction, New Jersey, USA) was first applied and reported in China by our unit, which can perform three-dimensional reconstruction of lung trachea and pulmonary vessels with satisfactory results [ 8 The objective of this single-center, retrospective study was to assess the value of 3D reconstruction in complex segmentectomy by comparing the operation-related indicators and short-term survival outcomes with and without preoperative 3D reconstruction by propensity score-matching (PSM) analysis. Patients and methods Study population This study retrospectively analyzed the clinical data of 299 patients with single or multiple lung cancers admitted to Union Hospital Affiliated to Fujian Medical University from August 2015 to February 2019. The Institutional Review Board of our hospital approved the study. All enrolled patients had pathologically confirmed primary lung cancer (including pre-invasive lesions AAH/CIS). The term ‘pulmonary nodule’ has been replaced with ‘lung cancer’ throughout. All patients underwent single-port video-assisted thoracoscopic complex segmentectomy. The decision to perform preoperative 3DR was at the surgeon’s discretion, primarily based on: (1) Nodule location near segmental borders; (2) Suspected vascular anomalies on CT; (3) Planned combined subsegmentectomy. We divided the patients into two groups according to whether they had 3D reconstruction before operation: reconstruction group (3DR) and non-reconstruction group (non-3DR). Indications for segmentectomy include: (1) inability to tolerate lobectomy due to poor pulmonary function or other severe comorbidities; (2) at least one of the following 3 conditions in patients with lung cancers ≤ 2 cm: ① AIS on pathology; ② GGO ratio ≥ 50% on CT imaging; and ③ doubling time ≥ 400 days on radiological monitoring [ 9 Inclusion criteria included (I) performing a single type of complex segmental surgery regardless of the number of lung cancers. (II) All procedures (lung segment, subsegment, combined lung segment or subsegment, lung segment + subsegment) were performed under single-port thoracoscopy. (III) meet the indications for segmental resection of the lung. Exclusion criteria included (I) patients with extensive pleural adhesions. (II) simple segmentectomy. (III) simultaneous lobectomy or segmental lobectomy. (IV) Non-single-port thoracoscopic surgery (such as conventional thoracoscopy, Da Vinci robot, etc.). (V) Patients with right middle lung nodules. (VI) incomplete data. When the patient’s informed consent was obtained, we performed an anatomical segmentectomy. We retrospectively analyzed all 299 patients who underwent single-port video-assisted thoracoscopic complex segmentectomy to compare the impact of preoperative three-dimensional reconstruction on perioperative outcomes. Ethics approval This study was conducted in accordance with the Declaration of Helsinki. The Institutional Review Board (IRB) of Union Hospital Affiliated to Fujian Medical University approved this study (Approval No: 2020WSJK072). Written informed consent was obtained from all individual participants after detailed explanation of surgical procedures and data usage. Preoperative evaluation All patients underwent preoperative enhanced thin-slice CT scan (slice thickness 0.625 mm), as well as necessary cardiopulmonary function tests. If the surgeon deems it necessary, he will consider the whole body examination such as bone scan, head magnetic resonance, whole abdomen ultrasound and supraclavicular lymph ultrasound. Refer to the eighth edition of UICC/AJCC for tumor type, lymph node and metastasis staging of malignant tumors [ 10 Surgical technique: In our institution, anatomical segmentectomy was performed using the single-port thoracoscopic technique we have previously reported [ 8 11 12 12 Patients in the three-dimention reconstruction group (3DR) need to import the enhanced thin-layer CT scan image data into the three-dimensional reconstruction system before operation, locate the lung cancers through the reconstruction system, and generate the three-dimensional structure of the bronchus, artery and vein of the target pulmonary segment to obtain the precise anatomical structure of the target pulmonary segment; According to the anatomical characteristics of different individuals, on the premise of ensuring the resection margin of the tumor, the target lung segment to be resected was determined, and the surgical path, surgical resection process and resection range were planned. After surgical resection, the surgeon needs to confirm the complete resection of the tumor by naked eye, ensure adequate resection margin, and confirm the negative resection of lung segments and subsegmental bronchi and lymph nodes by intraoperative frozen examination. When the surgical margin is insufficient, further resection of the adjacent (sub-) pulmonary segments is required. We included only patients with complete resection confirmed by intraoperative and postoperative pathology who underwent complex segmentectomy only. Because we intended to evaluate the effect of preoperative 3D reconstruction on the short-term surgical outcome of complex segmentectomy, we excluded patients who required additional lobectomy due to upregulation of pathologic stage or malignant histologic causes. Follow-up evaluation Perioperative data were collected from hospital medical records, anesthesia and operating room records, and electronic medical records for each patient. Perioperative mortality was defined as death within 30 days after surgery. All patients were followed up every 3–6 months from the day of surgery until death or the last follow-up. Final follow-up data were collected through December 2023. Statistical analysis To reduce bias caused by non-random patient selection, Propensity Score Matching (PSM) analysis was performed using R project software (v. 2.14.1; http://www.r-project.org Results Patient and tumor characteristics Between August 2015 and February 2019, 299 patients underwent single-port video-assisted thoracoscopic complex segmentectomy for non-3DR ( n n 1 Table 1 Patient and tumor characteristics Indicator Before PSM After PSM non-3DR( n 3DR( n P non-3DR( n 3DR( n P Age 53.4 ± 11.2 51.9 ± 11.8 0.276 53.4 ± 11.2 52.4 ± 11.0 0.502 Sex 0.582 0.685 Male 47(32.9) 56(35.9) … 42(33.6) 39(31.2) … Female 96(67.1) 100(64.1) … 83(66.4) 86(68.8) … Weight(kg) 61.9 ± 9.9 61.1 ± 10.0 0.480 61.3 ± 9.7 61.3 ± 9.4 0.968 BMI 23.3 ± 3.1 22.7 ± 2.8 0.135 22.9 ± 2.8 23.1 ± 2.8 0.652 Smoked number 2,34 ± 7.61 1.97 ± 6.93 0.646 2.82 ± 7.75 1.57 ± 5.93 0.187 Lung function … … … … … … FEV1 2.5 ± 0.6 2.6 ± 0.7 0.132 2.5 ± 0.6 2.5 ± 0.6 0.872 FEV1% 92.5 ± 14.3 94.2 ± 15.2 0.332 92.8 ± 14.4 93.5 ± 16.0 0.722 Tumor size 0.89 ± 0.37 0.97 ± 0.66 0.175 0.90 ± 0.36 0.89 ± 0.32 0.818 Tumor components … … 0.239 … … 0.246 GGO 112(78.3) 113(72.4) … 97(77.6) 89(71.2) … Solid 31(21.7) 43(27.6) … 28(22.4) 36(28.8) … Pathology … … 0.746 … … 0.748 AAH 1(0.7) 1(0.6) … 1(0.8) 1(0.8) … CIS 1(0.7) 3(1.9) … 1(0.8) 3(2.4) … MIA 113(79.0) 119(76.3) … 101(80.8) 94(75.2) … Invasive Adenocarcinoma 25(17.5) 31(19.9) … 21(16.8) 25(20.0) … SCC 0(0) 1(0.6) … 0(0) 0(0) … Others 3(2.1) 1(0.6) … 1(0.8) 2(1.6) … Data presented as mean ± SD or n(%); IQR Type of segmentectomy For the sake of comparability of the data analyzed, we only counted patients who underwent complex segmental resection of a single lobe, that is, excluding cases in which the number of segments resected was greater than or equal to 2. Combined en bloc resection of adjacent pulmonary segments may be considered as a single segmental resection. Table 2 13 P Table 2 Type and location of resected segments Type of segmentectomy Before PSM After PSM Non 3D( n 3D ( n P Non 3D( n 3D ( n P Variables 0.007 <0.001 Fairly difficult 127(88.8) 120(76.9) 110(88.0) 93(74.4) Right Lung S1 28 24 22 20 S2 19 18 16 13 S3 18 9 18 7 S8 4 9 4 6 S1 + 2 20 12 17 10 S1 + 3 2 5 2 4 Left Lung S1 + 2 31 24 28 17 S3 3 5 3 4 S8 2 14 … 12 Difficult 16(11.2) 36(23.1) 15(12.0) 32(25.6) Right Lung S7 1 … 1 … S9 2 … 2 … S10 1 … 1 … S7 + 8 … 1 … 1 S8 + 9 1 1 1 1 S1 + 3a … 1 … 1 S1a + 2a … 2 … 1 S2 + 3a … 1 … 1 S2b + 3a 2 5 2 5 S3b 1 … 1 … S6 + 9a … 1 … 1 S8a + 9a … 1 … 1 Left Lung S* 1 … 1 … S9 2 1 1 1 S10 1 2 1 2 S1 + 2a … 1 … 1 S1 + 2b 1 … 1 … S1 + 2c … 4 … 4 S1 + 2a + b … 13 … 12 S1 + 2b + c 3 … 3 … S8a … 1 … … S9 + 10 … 1 … … Operation and postoperative results Table 3 P P P P Table 3 Operative and postoperative outcomes in 3DR and non-3DR groups Indicator Before PSM After PSM non-3DR( n 3DR( n P non-3DR( n 3DR( n P Results of operation … … … … … … Time(min) 198.7 ± 50.3 177.3 ± 49.9 < 0.001 202.1 ± 51.4 178.6 ± 50.5 < 0.001 Loss of blood(ml) 57.1 ± 34.8 46.7 ± 35.1 0.011 58.4 ± 36.2 47.6 ± 37.9 0.023 LN stations 4.6 ± 1.9 4.8 ± 1.5 0.220 4.7 ± 1.9 4.7 ± 1.4 0.850 Number of LN 9.9 ± 6.5 10.2 ± 5.6 0.681 10.6 ± 7.0 9.4 ± 5.1 0.126 Perioperative outcomes … … … … … … Time in hospital(Day) 4.8 ± 2.7 4.5 ± 2.3 0.289 4.9 ± 2.9 4.4 ± 1.6 0.100 Drainage volume(Day) 519.4 ± 357.6 527.1 ± 289.7 0.839 528.7 ± 379.4 510.5 ± 279.4 0.667 Drainage time(Day) 2.4 ± 1.3 2.5 ± 1.6 0.865 2.5 ± 1.6 2.3 ± 1.1 0.391 Mortality(30 days) 0(0) 0(0) 1.00 0(0) 0(0) 1.00 Complications … … 0.901 … … 0.703 Lung infection 3(2.1) 3(1.3) 0.915 3(2.4) 2(1.6) 0.653 Chylothorax 1(0.7) 0(0) 0.297 1(0.8) 0(0) 0.318 Long-term air leakage 2(1.4) 2(1.3) 0.930 2(1.6) 1(0.8) 0.563 Pulmonary embolism 1(0.7) 0(0) 0.297 1(0.8) 0(0) 0.318 Hospitalization costs(USD) 58055.6 ± 11610.6 57386.9 ± 7287.5 0.556 59051.4 ± 12065.7 56791.2 ± 7212.9 0.073 Data presented as mean ± SD or n(%); IQR = interquartile range In the postoperative analysis, there were no perioperative deaths in either group, and the postoperative hospital stay between the two groups was 4.4 ± 1.6 days vs. 4.9 ± 2.9d, P P P P P 3 Discussion While the diagnostic rate of early lung cancer continues to improve, the effectiveness of anatomical segmentectomy for patients with small peripheral NSCLC has been fully demonstrated [ 14 16 17 Compared with traditional lobectomy, the biggest advantage of segmentectomy is that through our selection of cases, the appropriate patients can be completely resected while preserving normal lung tissue and lung function to the maximum extent, so segmentectomy is of great significance for patients with poor lung function and multiple lung cancers. Previous multicenter and prospective studies have shown that when the distance from the tumor to the resection margin is greater than the tumor diameter, no malignant positive margin is found [ 18 Pulmonary segmental surgery is similar to lobectomy, which requires segmental bronchus and the root of segmental artery and vein to be cut off, but the position of segmental door is often deep in the lung parenchyma, and the operation process is like “digging the lung”, which increases the difficulty of quickly and correctly identifying the structure of pulmonary segment during the operation, and then leads to prolonged operation time and increased complications; In addition, complex pulmonary segmentectomy is more difficult because of the more complex segmental structure and intersegmental plane, as well as the tricky operation angle. In order to effectively solve the problems associated with pulmonary segmentectomy and ensure the smooth implementation of the operation, our unit introduced a three-dimensional reconstruction system to assist single-port thoracoscopic pulmonary segmentectomy, and generated three-dimensional anatomical images of the bronchi, arteries and veins of the target lung through preoperative three-dimensional reconstruction, which provided more accurate positioning of lung cancers before operation. It can determine the distribution and shape of bronchi and arteries and veins around the lesion in advance, and then plan the scope and process of surgical resection to ensure the safe, effective and rapid implementation of the operation [ 11 Our analysis compared the surgical and surgical outcomes of complex segmentectomies with and without preoperative 3D reconstruction. To the best of our knowledge, this is the first analysis to date of the effects of a 3D reconstruction system alone on complex segmentectomies. The results of our study demonstrate that in single-port thoracoscopic complex segmentectomy, the operation time was shorter and the blood loss was less in the three-dimensional reconstruction group than in the non-reconstruction group, and the difference was statistically significant. It is considered that this is because after three-dimensional reconstruction, we have enough prediction and planning for the anatomical structure of the segment door before operation, and have a full understanding and preparation for the potential anatomical variations. During the operation, we only need to fully dissociate the target blood vessels and bronchi, which greatly reduces the identification of the surrounding non-target blood vessels and bronchi, shortens the operation time and reduces the wound bleeding. In the non-reconstruction group, the operation time was prolonged and the wound bleeding was increased due to the large range of anatomic segmental portal structure caused by the identification of anatomic variations, the inadequate resection margin caused by the misestimation of the lesion location in the lung segment to be resected, and the “wedge resection” had to be added to the original resection margin of the lung segment to ensure the resection margin. Notably, the spatial understanding gained through 3DR appeared transferable to non-3DR cases. Surgeons reported improved ability to mentally reconstruct complex anatomy based on conventional CT images after repeated 3DR exposure, suggesting a persistent learning effect beyond specific 3DR-guided procedures. Under the guidance of preoperative three-dimensional reconstruction results, we can better understand the anatomical structure of the target lung segment before and during the operation, and reduce the difficulty of learning thoracoscopy-assisted lung segmentectomy, which is of great significance to young doctors; Especially for lung cancers at the junction of pulmonary segments, as shown in Fig. 1 In addition, in the statistics of the hospitalization costs of the two groups of patients, the hospitalization costs of the 3DR group were lower than those of the non-3DR group before and after PSM, which was considered to be due to the fact that the 3DR group reduced the use of titanium clips and other materials due to the accurate identification of anatomical structures during the operation. And that incidence rate of complication such as air leakage and the like is reduced and the hospitalization cost is further reduce due to the fact that the door structure of a large-range anatomical section is avoided. In this retrospective study, there was no statistical difference between the reconstruction group and the non-reconstruction group in terms of mortality, complication rate, hospital stay, drainage time, drainage volume, and hospital costs. The number of dissected lymph nodes in the non-reconstruction group was slightly more than that in the reconstruction group, but there was no statistical significance. It was considered that the number of dissected lymph nodes in the non-reconstruction group was more than that in the reconstruction group because more anatomical exposure of hilar and segmental structures was needed. This also illustrates the advantages of three-dimensional reconstruction in simplifying surgery. Regarding surgical training, artificial simulation labs using 3DR technology offer significant advantages: (1) Risk-free rehearsal of complex anatomic variations; (2) Standardized assessment of surgical planning skills. However, limitations include high setup costs and potential discrepancies between virtual and intraoperative anatomy. Future studies should evaluate whether such simulation translates to improved operative outcomes.” This study has several limitations. First, because of its retrospective and single-institution nature, and second, because the patients in the reconstruction group were not randomly selected, there was a selection bias between the two groups, which could not be ruled out by PSM. Thirdly, because our sample size is relatively small, the confidence interval is large, and there is a large likelihood of positive or negative effects, we hope that this problem can be solved by accumulating more data through multi-center studies in the future. In conclusion, our study shows that the use of preoperative 3D reconstruction system for reconstruction and planning is a safe and effective way for patients requiring complex pulmonary segmentectomy, which can significantly reduce the operation time and blood loss, and is worthy of recommendation. However, the long-term effect of complex segmental resection assisted by preoperative three-dimensional reconstruction in the treatment of non-small cell lung cancer remains to be further studied. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements we thank Angela Morben, DVM, ELS, from Liwen Bianji (Edanz) (www.liwenbianji.cn) for editing the English text of a draft of this manuscript. Authors' contributions CC， GBX and HC conceived and designed this study. YC，WJY，ZHW, WXL performed the literature search. YH，ZHW and WXL performed the data analysis. YH and HC wrote the paper，WZ, BZ, CX supported the paper revision，All authors read and approved the final manuscript. Funding This work was supported by college student innovation and entrepreneurship training program(JC2022110); Joint Funds for the innovation of Science and Technology, Fujian province(2020CXA023). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate This study was conducted in accordance with the Declaration of Helsinki. The Institutional Review Board (IRB) of Union Hospital Affiliated to Fujian Medical University approved this study (Approval No: 2020WSJK072). Written informed consent was obtained from all individual participants after detailed explanation of surgical procedures and data usage. Consent for publication All authors consent to the publication of this manuscript. Competing interests The authors declare no competing interests. References 1. Humphrey LL Deffebach M Pappas M Screening for lung cancer with low-dose computed tomography: a systematic review to update the US preventive services task force recommendation Ann Intern Med 2013 159 411 20 10.7326/0003-4819-159-6-201309170-00690 23897166 Humphrey LL, Deffebach M, Pappas M, et al. Screening for lung cancer with low-dose computed tomography: a systematic review to update the US preventive services task force recommendation. Ann Intern Med. 2013;159:411–20. 23897166 10.7326/0003-4819-159-6-201309170-00690 2. Okada M Sakamoto T Nishio W Uchino K Tsubota N Characteristics and prognosis of patients after resection of nonsmall cell lung carcinoma measuring 2 cm or less in greatest dimension Cancer 2003 98 535 41 10.1002/cncr.11530 12879471 Okada M, Sakamoto T, Nishio W, Uchino K, Tsubota N. Characteristics and prognosis of patients after resection of nonsmall cell lung carcinoma measuring 2 cm or less in greatest dimension. Cancer. 2003;98:535–41. 12879471 10.1002/cncr.11530 3. Schuchert MJ Pettiford BL Keeley S Anatomic segmentectomy in the treatment of stage I non–small cell lung cancer Ann Thorac Surg 2007 84 926 32 10.1016/j.athoracsur.2007.05.007 17720401 Schuchert MJ, Pettiford BL, Keeley S, et al. Anatomic segmentectomy in the treatment of stage I non–small cell lung cancer. Ann Thorac Surg. 2007;84:926–32. discussion 932–3. 17720401 10.1016/j.athoracsur.2007.05.007 4. Yang CF D’Amico TA Thoracoscopic segmentectomy for lung cancer Ann Thorac Surg 2012 94 668 81 10.1016/j.athoracsur.2012.03.080 22748648 Yang CF, D’Amico TA. Thoracoscopic segmentectomy for lung cancer. Ann Thorac Surg. 2012;94:668–81. 22748648 10.1016/j.athoracsur.2012.03.080 5. Yang CF D’Amico TA Open, thoracoscopic and robotic segmentectomy for lung cancer Ann Cardiothorac Surg 2014 3 142 52 24790837 10.3978/j.issn.2225-319X.2014.02.05 PMC3988303 Yang CF, D’Amico TA. Open, thoracoscopic and robotic segmentectomy for lung cancer. Ann Cardiothorac Surg. 2014;3:142–52. 24790837 10.3978/j.issn.2225-319X.2014.02.05 PMC3988303 6. Handa T Tsutani Y Mimae T Tasaki T Miyata Y Okada M Surgical outcomes of complex versus simple segmentectomy for stage I non-small cell lung cancer Ann Thorac Surg 2019 107 1032 1039 10.1016/j.athoracsur.2018.11.018 30550801 Handa Y, Tsutani Y, Mimae T, Tasaki T, Miyata Y, Okada M. Surgical outcomes of complex versus simple segmentectomy for stage I non-small cell lung cancer. Ann Thorac Surg. 2019;107:1032–9. 30550801 10.1016/j.athoracsur.2018.11.018 7. Handa Yoshinori Tsutani Yasuhiro Mimae Takahiro Complex segmentectomy in the treatment of stage IA non-small-cell lung cancer Eur J Cardiothorac Surg 2020 57 114 21 10.1093/ejcts/ezz185 31230086 Handa Yoshinori, Tsutani Yasuhiro, Mimae Takahiro. Complex segmentectomy in the treatment of stage IA non-small-cell lung cancer. Eur J Cardiothorac Surg. 2020;57:114–21. 31230086 10.1093/ejcts/ezz185 8. Xu G Chen C Zheng W IQQA-3D imaging interpretation and analysis system-guided single-port videoassisted thoracic surgery for anatomical sub-segmentectomy(LS1 + 2a + b) J Thorac Dis 2018 10 5515 21 10.21037/jtd.2018.08.109 30416801 PMC6196196 Xu G, Chen C, Zheng W, et al. IQQA-3D imaging interpretation and analysis system-guided single-port videoassisted thoracic surgery for anatomical sub-segmentectomy(LS1 + 2a + b). J Thorac Dis. 2018;10:5515–21. 30416801 10.21037/jtd.2018.08.109 PMC6196196 9. Ettinger DavidS Wood DouglasE Aggarwal Charu NCCN guidelines insights: non-small cell lung cancer, version 1.2020 J Natl Compr Canc Netw 2019 17 1464 72 10.6004/jnccn.2019.0059 31805526 Ettinger David S, Wood Douglas E, Aggarwal Charu, et al. NCCN guidelines insights: non-small cell lung cancer, version 1.2020. J Natl Compr Canc Netw. 2019;17:1464–72. 31805526 10.6004/jnccn.2019.0059 10. Goldstraw P Chansky K Crowley J Rami-Porta R Asamura H Eberhardt WE The IASLC lung cancer staging project: proposals for revision of the TNM stage groupings in the forthcoming (Eighth) edition of the TNM classification for lung cancer J Thorac Oncol 2016 11 39 51 10.1016/j.jtho.2015.09.009 26762738 Goldstraw P, Chansky K, Crowley J, Rami-Porta R, Asamura H, Eberhardt WE, et al. The IASLC lung cancer staging project: proposals for revision of the TNM stage groupings in the forthcoming (Eighth) edition of the TNM classification for lung cancer. J Thorac Oncol. 2016;11:39–51. 26762738 10.1016/j.jtho.2015.09.009 11. Guobing Xu C Chen Application of the IQQA-3D imaging interpretation and analysis system in uniportal video-assisted thoracoscopic anatomical segmentectomy: a series study[ J] J Thorac Dis 2019 11 5 2058 66 10.21037/jtd.2019.04.83 31285899 PMC6588742 Guobing Xu C, Chen, et al. Application of the IQQA-3D imaging interpretation and analysis system in uniportal video-assisted thoracoscopic anatomical segmentectomy: a series study[. J] J Thorac Dis. 2019;11(5):2058–66. 31285899 10.21037/jtd.2019.04.83 PMC6588742 12. Zheng B Xu G Fu X Management of the inter-segmental plane using the combined dimensional reduction method is safe and viable in Uniport video-assisted thoracoscopic pulmonary segmentectomy[J] Transl Lung Cancer Res 2019 8 5 658 66 10.21037/tlcr.2019.09.12 31737501 PMC6835099 Zheng B, Xu G, Fu X, et al. Management of the inter-segmental plane using the combined dimensional reduction method is safe and viable in Uniport video-assisted thoracoscopic pulmonary segmentectomy[J]. Transl Lung Cancer Res. 2019;8(5):658–66. 31737501 10.21037/tlcr.2019.09.12 PMC6835099 13. Oizumi H Kanauchi N Kato H Anatomic thoracoscopic pulmonary segmentectomy under 3-dimensional multidetector computed tomography simulation: a report of 52 consecutive cases J Thorac Cardiovasc Surg 2011 141 678 82 10.1016/j.jtcvs.2010.08.027 20884021 Oizumi H, Kanauchi N, Kato H, et al. Anatomic thoracoscopic pulmonary segmentectomy under 3-dimensional multidetector computed tomography simulation: a report of 52 consecutive cases. J Thorac Cardiovasc Surg. 2011;141:678–82. 20884021 10.1016/j.jtcvs.2010.08.027 14. Goya T Asamura H Yoshimura H Prognosis of 6644 resected non-small cell lung cancers in japan: a Japanese lung cancer registry study Lung Cancer 2005 50 227 34 10.1016/j.lungcan.2005.05.021 16061304 Goya T, Asamura H, Yoshimura H, et al. Prognosis of 6644 resected non-small cell lung cancers in japan: a Japanese lung cancer registry study. Lung Cancer. 2005;50:227–34. 16061304 10.1016/j.lungcan.2005.05.021 15. Tsutani Y Miyata Y Nakayama H Okumura S Adachi S Okada M Oncologic outcomes of segmentectomy compared with lobectomy for clinical stage IA lung adenocarcinoma: propensity score-matched analysis in a multicenter study J Thorac Cardiovasc Surg 2013 146 358 64 10.1016/j.jtcvs.2013.02.008 23477694 Tsutani Y, Miyata Y, Nakayama H, Okumura S, Adachi S, Okada M, et al. Oncologic outcomes of segmentectomy compared with lobectomy for clinical stage IA lung adenocarcinoma: propensity score-matched analysis in a multicenter study. J Thorac Cardiovasc Surg. 2013;146:358–64. 23477694 10.1016/j.jtcvs.2013.02.008 16. Tsutani Y Miyata Y Nakayama H Okumura S Adachi S Okada M Appropriate sublobar resection choice for ground glass opacitydominant clinical stage IA lung adenocarcinoma: wedge resection or segmentectomy Chest 2014 145 66 71 10.1378/chest.13-1094 24551879 Tsutani Y, Miyata Y, Nakayama H, Okumura S, Adachi S, Okada M, et al. Appropriate sublobar resection choice for ground glass opacitydominant clinical stage IA lung adenocarcinoma: wedge resection or segmentectomy. Chest. 2014;145:66–71. 24551879 10.1378/chest.13-1094 17. Soukiasian HJ Hong E McKenna RJ Jr Video-assisted thoracoscopic trisegmentectomy and left upper lobectomy provide equivalent survivals for stage IA and IB lung cancer J Thorac Cardiovasc Surg 2012 144 S23 6 10.1016/j.jtcvs.2012.05.071 22898524 Soukiasian HJ, Hong E, McKenna RJ Jr. Video-assisted thoracoscopic trisegmentectomy and left upper lobectomy provide equivalent survivals for stage IA and IB lung cancer. J Thorac Cardiovasc Surg. 2012;144:S23–6. 22898524 10.1016/j.jtcvs.2012.05.071 18. Sawabata N Ohta M Matsumura A Optimal distance of malignant negative margin in excision of non-small cell lung cancer: a multicenter prospective study Ann Thorac Surg 2004 77 415 20 10.1016/S0003-4975(03)01511-X 14759408 Sawabata N, Ohta M, Matsumura A, et al. Optimal distance of malignant negative margin in excision of non-small cell lung cancer: a multicenter prospective study. Ann Thorac Surg. 2004;77:415–20. 14759408 10.1016/S0003-4975(03)01511-X ",
  "metadata": {
    "Title of this paper": "Optimal distance of malignant negative margin in excision of non-small cell lung cancer: a multicenter prospective study",
    "Journal it was published in:": "World Journal of Surgical Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482376/"
  }
}