{
  "title": "Paper_764",
  "abstract": "J Nucl Med J Nucl Med 3060 jnucmed jnm Journal of Nuclear Medicine 0161-5505 1535-5667 Society of Nuclear Medicine and Molecular Imaging PMC11960603 PMC11960603.1 11960603 11960603 40015916 10.2967/jnumed.124.267852 267852 1 Focus on Molecular Imaging Molecular Imaging of Pulmonary Fibrosis Allison Margaret B.  1  2 Catana Ciprian  3  4  5 Zhou Iris Y.  3  4  5 Caravan Peter  3  4  5 Montesi Sydney B.  1  2 1 2 3 4 5 For correspondence or reprints, contact Sydney B. Montesi ( sbmontesi@mgb.org Published online Feb. 27, 2025. 4 2025 66 4 485728 502 505 31 10 2024 03 2 2025 01 10 2025 01 10 2025 02 04 2025 01 10 2025 © 2025 by the Society of Nuclear Medicine and Molecular Imaging. 2025 Fibrosing lung diseases affect over 160,000 individuals in the United States alone and can carry a prognosis that is worse than many cancers. Antifibrotic treatments modify only the rate of fibrosis progression, and more effective therapies are urgently needed. Molecular imaging enables visualization of disease pathogenesis in progress. It provides a noninvasive means to monitor and quantify dysregulated molecular fibrotic pathways and shows great promise in aiding the diagnosis and disease activity monitoring of pulmonary fibrosis. Here, we review molecular imaging probes under development for use in pulmonary fibrosis. We provide our opinion on current challenges in translating preclinical molecular imaging probes into clinical successes, as well as future directions for expanding their use in drug development. interstitial lung disease pulmonary fibrosis molecular imaging pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Molecular Imaging of Pulmonary Fibrosis",
    "Journal it was published in:": "Journal of Nuclear Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11960603/"
  }
}