{
  "title": "Paper_558",
  "abstract": "pmc Arch Endocrinol Metab Arch Endocrinol Metab 4353 archem aem Archives of Endocrinology and Metabolism 2359-3997 2359-4292 Sociedade Brasileira de Endocrinologia e Metabologia PMC12483169 PMC12483169.1 12483169 12483169 41004667 10.20945/2359-4292-2025-0103 01500 1 Brief Report Tertiary lymphoid structures in thyroid cancer http://orcid.org/0009-0001-1887-801X Nakadaira Katia Sakimi 1 http://orcid.org/0000-0001-6397-6754 Saito Kelly Cristina 1 http://orcid.org/0000-0002-0567-5432 Fuziwara Cesar Seigi 1 http://orcid.org/0000-0003-2564-7903 Magalhães Patricia Künzle Ribeiro 2 http://orcid.org/0000-0002-3486-5294 Ramalho Leandra Naira Zambelli 3 http://orcid.org/0000-0002-8427-6869 Ricarte-Filho Julio C. 4 http://orcid.org/0000-0003-1447-0794 Maciel Lea Maria Zanini 2 http://orcid.org/0000-0001-8403-4459 Kimura Edna Teruko 1  1  2  3  4 Correspondence to: etkimura@usp.br 22 9 2025 2025 69 5 497634 e250103 10 3 2025 11 8 2025 22 09 2025 01 10 2025 01 10 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the\nCreative Commons Attribution License, which permits unrestricted use,\ndistribution, and reproduction in any medium, provided the original work is\nproperly cited. Objective This study aimed to investigate the presence of tertiary lymphoid structures\n(TLSs) and tumor-infiltrating B cells within the germinal centers of TLSs in\nthe tumor microenvironment of thyroid cancer, utilizing a morphological\napproach. Materials and methods Histological samples from patients with papillary thyroid carcinoma (PTC) (n\n= 112) stained with hematoxylin and eosin were examined. The presence of\nlymphoid neogenesis in PTC was determined based on morphological features\nand classified according to TLS location and maturation status.\nImmunofluorescence staining was performed on selected cases to identify B\ncells within mature TLSs. Additionally, 499 scanned slides from the PTC\ncohort in The Cancer Genome Atlas - Thyroid Carcinoma (TCGA-THCA) dataset\nwere accessed via cBioPortal to assess the presence of TLSs and compare the\nclinical and molecular characteristics of PTC cases with and without\nTLSs. Results Tertiary lymphoid structures, resembling ectopic lymph nodes, were identified\nin 41% (46/112) of the histological PTC samples. Among these, 63% (29/46)\nwere located in peritumoral regions, while 13% (6/46) were found within the\nintratumoral area. Mature TLSs containing germinal centers, in which B cells\nwere detected, were observed in 15% (7/46) of cases. Immature TLSs were\ndetected in 52% (24/46) of PTC cases with TLSs. Analysis of PTC scanned\nimages from cBioPortal revealed TLSs in 8.4% of cases, of which 62% harbored\nthe BRAFV600E mutation, along with upregulation of immune cell markers and SLC5A5 Conclusion The identification of TLSs across multiple malignancies underscores their\nfunctional significance in modulating tumor-immune interactions with\nclinical implications. Therefore, the identification and morphological\ncharacterization of TLSs in PTC may provide valuable insights into their\npotential as immunobiomarkers in thyroid cancer. Papillary thyroid carcinoma tertiary lymphoid structure maturation tumor-infiltrating B cells morphological analysis lymphoid neogenesis CNPq 409443/2021-2 311210/2021-0 Fapesp 2019/25116-8 2019/17282-5 2020/10403-9 Funding: Conselho Nacional de Desenvolvimento Científico e\nTecnológico Fundação de Amparo à Pesquisa do Estado de\nSão Paulo pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Thyroid cancer is the most common endocrine malignancy, with papillary thyroid\ncarcinoma (PTC) accounting for approximately 84% of all cases ( 1 2 3 4 The complex network comprising malignant cells, stromal cells, and tumor-infiltrating\nimmune cells within the tumor microenvironment has been extensively studied\n( 5 6 8 9 10 11 12 In thyroid tissue, the presence of infiltrating leukocytes and TLSs is commonly\nassociated with autoimmune diseases, especially Hashimoto’s thyroiditis ( 3 12 MATERIALS AND METHODS Papillary thyroid carcinoma samples were obtained from the archival of the Department\nof Pathology at Ribeirão Preto Medical School and the Department of Cell and\nDevelopmental Biology at the Institute of Biomedical Sciences at the University of\nSão Paulo. The study was carried out in accordance with the guidelines of the\nHuman Ethics Committee of the Institute of Biomedical Science (CAAE no.\n65317522.3.00000.5467). The 112 hematoxylin and eosin-stained slides of PTC were examined under light\nmicroscopy for TLSs detection and classification based on their localization and\nmaturation ( 10 ® https://www.cBioPortal.org 13 14 The PTC cases with detected TLS were stratified according to BRAF and RAS mutation\nstatus. The expression of molecular markers, including B and T cell markers and SLC5A5 p Supplementary Figure 1 RESULTS One hundred and twelve tissue specimens from patients with PTC were screened for TLSs\npresence, which were identified in 46 of the 112 cases (41.0%) within the PTC\nmicroenvironment ( Figure 1A Figure 1B Figure 1C  Figure 1 Tertiary lymphoid structures (TLSs) associated with papillary thyroid\ncarcinoma (PTC): photomicrography of TLSs detected in formalin-fixed\nparaffin-embedded tumor sections stained by hematoxylin and eosin (A-E)\nand by immunofluorescence assay (F-H). A B C D E F G H The maturation of TLSs is characterized by the absence or presence of an organized\nstructure rich in B lymphocytes within the central core, known as the GC. Immature\nTLSs, lacking a GC, were identified in 24 out of 46 (52%) of PTC cases, while mature\nmorphology, with the presence of a GC, was identified in 7 out of 46 (15%) cases\n( Figures 1D 1E Immunofluorescence staining confirmed the pre-sence of B cells within GCs of TLSs in\nselected cases ( Figures 1F 1H Supplementary\nFigure 2 Table\n1 Table 1 Distribution of clinical characteristics of TCGA - PTC cohort with or without\nTLSs Clinical Characteristics Variable TLS+ n (%) TLS- n (%) Chi-square Test Gender Male 12 (28.6) 122 (26.7) 0.793 Female 30 (71.4) 335 (73.3) Age ≤ 55 31 (73.8) 320 (70.0) 0.607 > 55 11 (26.2) 137 (30.0) PTC subtype Classic 31 (73.8) 323 (70.7) 0.368 Tall cell 6 (14.3) 97 (21.2) Follicular 5 (11.9) 30 (6.6) Other 0 (0) 7 (1.5) BRAF mutation status BRAFV600E 26 (61.9) 257 (56.2) 0.478 BRAF WT 16 (38.1) 200 (43.8) RAS mutation status N/H/KRAS 0 (0) 59 (12.9) 0.013 N/H/KRAS WT 42 (100) 398 (87.1) AJCC Neoplasm Stage I 23 (54.8) 259 (56.7) 0.064 Stage II 0 (0) 51 (11.2) Stage III 15 (35.7) 95 (20.8) Stage IV 0 (0) 2 (0.4) Stage IVA 3 (7.1) 42 (9.2) Stage IVC 0 (0) 6 (1.3) NA 1 (2.4) 2 (0.4) Tumor stage pT1 6 (14.3) 37 (8.1) 0.468 pT1A 3 (7.1) 17 (3.7) pT1B 9 (21.4) 71 (15.5) pT2 11 (26.2) 155 (33.9) pT3 13 (31.0) 153 (33.5) pT4 0 (0) 8 (1.8) pT4A 0 (0) 14 (3.1) pTX 0 (0) 2 (0.4) Lymph node metastasis pN0 19 (45.2) 208 (45.5) 0.118 pN1 3 (7.1) 55 (12.0) pN1A 13 (31.0) 79 (17.3) pN1B 6 (14.3) 66 (14.4) pNx 1 (2.4) 49 (10.7) Distant metastasis M0 29 (69.0) 248 (54.3) 0.276 M1 0 (0) 9 (2.0) MX 13 (31.0) 199 (43.5) NA 0 (0) 1 (0.2) Disease free status Disease free 30 (71.4) 299 (65.4) 0.722 Recurred/progressed 2 (4.8) 23 (5.0) NA 10 (23.8) 135 (29.5) Given the high prevalence of BRAFV600E mutations in TLSs-positive PTCs, we compared\nBRAFV600E-mutant PTC cases with (+) and without ( 11 16 17 Supplementary Figure 2G CD19, CD20/MS4A1 CD79A FOXP3, CD4 CD8A/CD8B 15 17 SLC5A5 Supplementary Figure 3 DISCUSSION This study investigated TLSs in the PTC tissue samples. The morphological\ncharacteristics of TLSs observed in PTC are consistent with those found in other\ntypes of tumors. Tertiary lymphoid structures have been widely reported in the tumor\nmicroenvironments of various cancers, including pancreatic, colorectal, and lung\ncancers ( 8 10 11 Depending on their maturation state, TLSs exhibi-ted stages of maturation, displaying\nmorphological heterogeneity in the tumor microenvironment. TLSs are composed\nprimarily of T and B cells, which expand and organize into distinct compartments,\nresembling a lymph node. The m-TLSs are characterized by the presence of GCs, which\nare B cell-rich areas within the TLSs core ( 18 In this study, B cells within the GCs of m-TLSs in PTC tissue were identified using\nan immunofluorescence approach, confirming the identity of m-TLSs. T cells are\ntraditionally considered the primary mediators of anti-tumor immunity, leading to\nthe development of immune checkpoint therapies. However, these treatments, designed\nto enhance T cell activity, do not benefit many patients, often due to T cell\ndysfunction and tumor immune escape mechanisms ( 19 In this context, B cells within the GCs of m-TLSs are increasingly recognized for\ntheir crucial role in effective anti-tumor immune responses and as potential\nbiomarkers for the efficacy of immunotherapy ( 7 9 20 21 23 In our study, the detection rate of TLSs in formalin-fixed paraffin-embedded archival\nsamples was 41.9%, whereas the analysis of TCGA PTC scanned slides showed a\nsignificantly lower frequency (8.4%). This discrepancy may be attributed to the\nlimitation that only one scanned slide per patient was available on the cBioPortal\nplatform, possibly not representing the entire tumor. Additionally, the available\nimages primarily depict the tumor parenchyma, excluding the invasive margins and\nsurrounding tissue areas where TLSs are more commonly found. The clinicopathological characteristics of 42 PTC patients with TLSs detected in TCGA\nimages revealed that 62% harbored the BRAFV600E mutation ( Table 1 Supplementary Figure 1 1 24 26 In this context, BRAFV600E TLS-positive cases may be associated with a better\nprognosis compared to those without TLSs, especially when considering distant\nmetastasis (M stage) ( Supplementary Figure\n2H SLC5A5 7 27 28 The growing evidence of TLS detection in various cancers with favorable prognoses\nunderscores their potential as prognostic biomarkers ( 20 5 Acknowledgments: the authors thank the Histological Techniques Facility of Department of Cellular and\nDevelopmental Biology and the Centro de Facilidades de Apoio à\nPesquisa Funding: Conselho Nacional de\nDesenvolvimento Científico e Tecnológico Fundação de Amparo\nà Pesquisa do Estado de São Paulo Disclosure: Data availability: datasets related to this article will be available upon request to the corresponding\nauthor. SUPPLEMENTARY MATERIAL  Supplementary Figure 1 Flowchart of the study of Tertiary Lymphoid Structures (TLSs) in\nPapillary Thyroid Carcinoma. PTC: papillary thyroid carcinoma. TLS: TCGA: THCA: GC: BRAFV600E: SLC5A5  Supplementary Figure 2 TCGA Thyroid Carcinoma (THCA) digital histological samples obtained from\ncBioPortal and clinical prognosis. A and B: C D: E and F: G H: M0: M1: MX: NA:  Supplementary Figure 3 Comparison of Molecular Marker Expression Between BRAFV600E PTCs with and\nwithout TLSs. A: Tumor purity. B: SLC5A5 C: CD19 D: CD20/MS4A1 E CD79A F: FOXP3 G: CD4 H: CD8B www.cbioportal.org REFERENCES 1 Boucai L Zafereo M Cabanillas ME. Thyroid Cancer: A Review JAMA 2024 331 5 425 435 10.1001/jama.2023.26348 38319329 2 Christofer Juhlin C Mete O Baloch ZW. The 2022 WHO classification of thyroid tumors: novel concepts in\nnomenclature and grading Endocr Relat Cancer 2023 30 2 10.1530/ERC-22-0293 36445235 3 Tischler AS LiVolsi VA Asa SL. Insights Obtained from the Nontumorous Glandular Tissue in\nPatients with Endocrine Tumors Endocr Pathol 2023 34 4 393 405 10.1007/s12022-023-09759-z 36943629 4 Gupta S Patel A Folstad A Fenton C Dinauer CA Tuttle RM Infiltration of differentiated thyroid carcinoma by proliferating\nlymphocytes is associated with improved disease-free survival for children\nand young adults J Clin Endocrinol Metab 2001 86 3 1346 1354 10.1210/jcem.86.3.7310 11238531 5 Cunha LL Ward LS. Translating the immune microenvironment of thyroid cancer into\nclinical practice Endocr Relat Cancer 2022 29 6 R67 R83 10.1530/ERC-21-0414 35289765 6 Goc J Fridman WH Sautes-Fridman C Dieu-Nosjean MC. Characteristics of tertiary lymphoid structures in primary\ncancers Oncoimmunology 2013 2 12 e26836 10.4161/onci.26836 24498556 PMC3912008 7 Sautes-Fridman C Petitprez F Calderaro J Fridman WH. Tertiary lymphoid structures in the era of cancer\nimmunotherapy Nat Rev Cancer 2019 19 6 307 325 10.1038/s41568-019-0144-6 31092904 8 Schumacher TN Thommen DS. Tertiary lymphoid structures in cancer Science 2022 375 6576 eabf9419 10.1126/science.abf9419 34990248 9 Ruffin AT Bruno TC. Harnessing B Cells and Tertiary Lymphoid Structures for Antitumor\nImmunity In: Cancer Immunotherapy Principles and Practice 2nd USA Demos Medical 2021 10 Vanhersecke L Bougouin A Crombe A Brunet M Sofeu C Parrens M Standardized Pathology Screening of Mature Tertiary Lymphoid\nStructures in Cancers Lab Invest 2023 103 5 100063 10.1016/j.labinv.2023.100063 36801637 11 Kinker GS Vitiello GAF Ferreira WAS Chaves AS Cordeiro de Lima VC Medina TDS B Cell Orchestration of Anti-tumor Immune Responses: A Matter of\nCell Localization and Communication Front Cell Dev Biol 2021 9 678127 10.3389/fcell.2021.678127 34164398 PMC8215448 12 Nosé V. Diagnostic Pathology: Endocrine 3rd Philadelphia, USA Elsevier; 2022 13 Cancer Genome Atlas Research N Integrated genomic characterization of papillary thyroid\ncarcinoma Cell 2014 159 3 676 690 10.1016/j.cell.2014.09.050 25417114 PMC4243044 14 Gao J Aksoy BA Dogrusoz U Dresdner G Gross B Sumer SO Integrative analysis of complex cancer genomics and clinical\nprofiles using the cBioPortal Sci Signal 2013 6 269 pl1 10.1126/scisignal.2004088 23550210 PMC4160307 15 Kinker GS Vitiello GAF Diniz AB Cabral-Piccin MP Pereira PHB Carvalho MLR Mature tertiary lymphoid structures are key niches of\ntumour-specific immune responses in pancreatic ductal\nadenocarcinomas Gut 2023 72 10 1927 1941 10.1136/gutjnl-2022-328697 37230755 16 Di Caro G Bergomas F Grizzi F Doni A Bianchi P Malesci A Occurrence of tertiary lymphoid tissue is associated with T-cell\ninfiltration and predicts better prognosis in early-stage colorectal\ncancers Clin Cancer Res 2014 20 8 2147 2158 10.1158/1078-0432.CCR-13-2590 24523438 17 Silina K Soltermann A Attar FM Casanova R Uckeley ZM Thut H Germinal Centers Determine the Prognostic Relevance of Tertiary\nLymphoid Structures and Are Impaired by Corticosteroids in Lung Squamous\nCell Carcinoma Cancer Res 2018 78 5 1308 1320 10.1158/0008-5472.CAN-17-1987 29279354 18 Lee PP Yee C Savage PA Fong L Brockstedt D Weber JS Characterization of circulating T cells specific for\ntumor-associated antigens in melanoma patients Nat Med 1999 5 6 677 685 10.1038/9525 10371507 19 Italiano A Bessede A Pulido M Bompas E Piperno-Neumann S Chevreau C Pembrolizumab in soft-tissue sarcomas with tertiary lymphoid\nstructures: a phase 2 PEMBROSARC trial cohort Nat Med 2022 28 6 1199 1206 10.1038/s41591-022-01821-3 35618839 20 Li YY Li SJ Liu MC Chen Z Li L Shen F B cells and tertiary lymphoid structures are associated with\nsurvival in papillary thyroid cancer J Endocrinol Invest 2023 46 11 2247 2256 10.1007/s40618-023-02072-w 37004696 21 Fagin JA Nikiforov YE. Progress in Thyroid Cancer Genomics: A 40-Year\nJourney Thyroid 2023 33 11 1271 1286 10.1089/thy.2023.0045 37668657 PMC10664575 22 Kimura ET Nikiforova MN Zhu Z Knauf JA Nikiforov YE Fagin JA. High prevalence of BRAF mutations in thyroid cancer: genetic\nevidence for constitutive activation of the RET/PTC-RAS-BRAF signaling\npathway in papillary thyroid carcinoma Cancer Res 2003 63 7 1454 1457 12670889 23 Yarchoan M LiVolsi VA Brose MS. BRAF mutation and thyroid cancer recurrence J Clin Oncol 2015 33 1 7 8 10.1200/JCO.2014.59.3657 25422487 24 Durante C Haddy N Baudin E Leboulleux S Hartl D Travagli JP Long-term outcome of 444 patients with distant metastases from\npapillary and follicular thyroid carcinoma: benefits and limits of\nradioiodine therapy J Clin Endocrinol Metab 2006 91 8 2892 2899 10.1210/jc.2005-2838 16684830 25 Oh JM Ahn BC. Molecular mechanisms of radioactive iodine refractoriness in\ndifferentiated thyroid cancer: Impaired sodium iodide symporter (NIS)\nexpression owing to altered signaling pathway activity and intracellular\nlocalization of NIS Theranostics 2021 11 13 6251 6277 10.7150/thno.57689 33995657 PMC8120202 26 Riesco-Eizaguirre G Gutierrez-Martinez P Garcia-Cabezas MA Nistal M Santisteban P. The oncogene BRAF V600E is associated with a high risk of\nrecurrence and less differentiated papillary thyroid carcinoma due to the\nimpairment of Na+/I- targeting to the membrane Endocr Relat Cancer 2006 13 1 257 269 10.1677/erc.1.01119 16601293 27 Fridman WH Meylan M Petitprez F Sun CM Italiano A Sautes-Fridman C. B cells and tertiary lymphoid structures as determinants of\ntumour immune contexture and clinical outcome Nat Rev Clin Oncol 2022 19 7 441 457 10.1038/s41571-022-00619-z 35365796 28 Vanhersecke L Brunet M Guegan JP Rey C Bougouin A Cousin S Mature tertiary lymphoid structures predict immune checkpoint\ninhibitor efficacy in solid tumors independently of PD-L1\nexpression Nat Cancer 2021 2 8 794 802 10.1038/s43018-021-00232-6 35118423 PMC8809887 ",
  "metadata": {
    "Title of this paper": "Mature tertiary lymphoid structures predict immune checkpoint\ninhibitor efficacy in solid tumors independently of PD-L1\nexpression",
    "Journal it was published in:": "Archives of Endocrinology and Metabolism",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483169/"
  }
}