{
  "title": "Paper_1006",
  "abstract": "pmc Glob Qual Nurs Res Glob Qual Nurs Res 3140 gqn GQN Global Qualitative Nursing Research 2333-3936 SAGE Publications PMC12476496 PMC12476496.1 12476496 12476496 41024860 10.1177/23333936251375182 10.1177_23333936251375182 1 Special Collection: Palliative Care and Caring Practices Single-Method Research Article Older People’s Voices Matter!: Possibilities and Limitations for Providing Dignified Palliative Care with Wearable Devices https://orcid.org/0000-0001-7543-3642 Sandic Spaho Rada 1 Uhrenfeldt Lisbeth 1 2 3 Fotis Theofanis 4 Bjerkan Jorunn 5 Kymre Ingjerd Gåre 1 1 2 3 4 5 Rada Sandic Spaho, Faculty for Nursing and Health Sciences, Nord University, Universitetsalléen 11, Bodo 8026, Norway. Email: rada.sandic-spaho@nord.no 27 9 2025 Jan-Dec 2025 12 478152 23333936251375182 5 12 2024 22 7 2025 23 7 2025 27 09 2025 29 09 2025 30 09 2025 © The Author(s) 2025 2025 SAGE Publications https://creativecommons.org/licenses/by/4.0/ This article is distributed under the terms of the Creative Commons Attribution 4.0 License ( https://creativecommons.org/licenses/by/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage This study aimed to gain insight into the phenomenon of how wearable devices affect the sense of dignity of older patients (above 65 years of age) in palliative care settings using remote monitoring health services. Five interviews were carried out using reflective lifeworld research approach. A phenomenological analysis showed that the essence of older adults’ sense of dignity in palliative care is vulnerable and, therefore, at stake when using wearable devices for remote monitoring. This essence is reflected in the following constituents: a simultaneous sense of regained and diminished quality of life; mixed feelings ranging from strengthened self-identity and independence to vulnerability and dependence; shifting care responsibilities within the context of life’s finitude; and uncertainty about being valued, seen, and empowered while navigating relational expectations. The phenomenon was illuminated through the lens of various forms of dignity, offering insight into how it is experienced and challenged. These findings underscore the importance of recognising and addressing threats to dignity as digital health technologies continue to evolve in palliative care settings. Interprofessional collaboration among various stakeholders, including patients as active informants and participants, is necessary for designing future dignified remote care using wearable devices. aged dignity patient attitudes digital health digital monitoring pain management interprofessional collaboration peer-support Norway H2020 Marie Skłodowska-Curie Actions https://doi.org/10.13039/100010665 813928 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date January-December 2025 typesetter ts1 Introduction Having a vulnerable or frail body, depending on others, and being unable to maintain one’s own standards may affect older patients’ sense of dignity in palliative care settings. Older people with multiple comorbidities and cancer patients are especially sensitive and may be easily affected ( Galvin & Todres, 2013 2015 Söderman et al., 2020 Fernando & Hughes, 2019 Melby & Håland, 2021 Mertens et al., 2021 Teoli et al., 2023 WHO, 2020 Considering that dignity and palliative care are human rights, maintaining a patient’s dignity is very important in palliative care ( Östlund et al., 2019 Söderman et al., 2020 Galvin & Todres, 2015 Söderman et al., 2020 Åberg et al. (2020) Åberg et al., 2020 Bovero et al., 2024 Östlund et al., 2019 However, 86% of people in need of palliative care are being overlooked in receiving the care they need because of ongoing worldwide obstacles, including inadequate access to care, medications, resources, insufficient training of healthcare professionals, and lack of or inadequate implementation of national policies ( Söderman et al., 2020 WHO, 2020 European Commission, 2018b Siemens et al., 2020 United Nations, 2019 Liu et al., 2017 WHO, n.d Digital health comprises eHealth, mHealth, wearable devices, the Internet of Things, telemedicine, and telehealth ( WHO, 2018 European Commission, 2018a Maguraushe & Ndlovu, 2024 Nene et al., 2023 Ovid Technologies Inc., 1993 Rejeb et al., 2023 Remote home monitoring can be offered via various health services, such as enabling patients to use wearable devices, read measurements, communicate with healthcare professionals via mobile applications, and adjust their treatments accordingly. It can also involve video or telephone consultations, messaging between patients and healthcare professionals, and/or patients’ reporting their own measurements ( Haase et al., 2020 Helsedirektoratet [Ministry of Health Department], 2021 Schmalz et al., 2020 Walton et al., 2022 Cardona et al., 2021 Koszalinski et al., 2019 Cannon, 2018 Cardona et al., 2021 Koszalinski et al., 2019 Patel et al., 2015 Sandic Spaho et al., 2023 Cannon, 2018 Cardona et al., 2021 Sandic Spaho et al., 2023 Walton et al., 2022 Walton et al., 2022 However, patients may experience this kind of healthcare in different ways. While they may feel empowered to manage their own symptoms, they may also feel pressured and unprepared for such responsibility ( Schmalz et al., 2020 Walton et al., 2022 Helsedirektoratet [Ministry of Health Department], 2021 LeBaron et al., 2022 Schmalz et al., 2020 Nene et al., 2023 Pavic, Klaas, Theile, Kraft, Tröster, Blum, & Guckenberger, 2020 Pavic, Klaas, Theile, Kraft, Tröster, & Guckenberger, 2020 Sandic Spaho et al., 2023 The aim of this study is to gain insight into the phenomenon of how wearable devices affect the sense of dignity of older patients (above 65 years of age) in palliative care settings using remote monitoring health services. Increasing our knowledge about patients’ lived experiences with wearable devices could enhance our understanding of the phenomenon and the ability to provide personalised, dignified palliative care. Method To gain insight into the phenomenon of how wearable devices affect the sense of dignity of older patients in palliative care settings using remote monitoring health services, Reflective Lifeworld research was applied as an approach ( Dahlberg et al., 2008 Dahlberg et al., 2008 Dahlberg et al., 2008 Dahlberg et al., 2008 Participants and Data Collection The inclusion criteria specified that participants should be patients older than 65 who used a wearable device and received palliative care. Participants were recruited through different healthcare institutions and their gatekeepers. The recruitment period, which spanned from October 2021 to June 2023, was limited by the COVID-19 pandemic and the project’s duration, which concluded in June 2023. The process was lengthy and limited by restricted access to appointments during the COVID-19 pandemic. Fourteen patients were recruited, but before the interviews were held, three patients died, four patients’ health conditions worsened, and two patients withdrew before the interview, leaving a total of five interviewed patients. All patients were contacted and interviewed 1 to 3 days after their contact details were obtained, at a time and place of their choice. One patient gave consent, but in the meantime got worse and died before he could be interviewed. A semi-structured interview with open and reflective attitude was enabled by asking questions, directing to the phenomena of patients’ sense of dignity, asking additional follow-up questions, as well as asking patients to give examples and to reflect on what they said, and what it means to them, in order to gain rich data about the phenomenon. Patients’ descriptions of lived experiences should be comprehensive, specific, and as explicit as possible ( Dahlberg et al., 2008 The five interviewed patients were three women and two men, aged 67 to 93 years, with a mean age of 78.6 years. One patient was interviewed at home; two were interviewed in their assisted living facilities, which had a small number of HCPs available, only during the day shift, for all the residents; one was interviewed at the short-stay municipal hospital; and one was interviewed at the apartment provided by the specialist hospital immediately after hospital discharge. All participants received care at the primary care level, organised by the municipality, which included short-stay municipal hospitals, home care services, family physicians, and limited specialist care services ( La Rocca & Hoholm, 2017 Spaho et al., 2024 Details of the participants’ characteristics and the types of wearable devices they were using are presented in Table 1 Table 1. Participants’ Characteristics and the Types of Wearable Devices They Used. Patient number Age Sex Marital status Place Receiving home care Blood pressure device Weight scale Safety alarm Pain pump Medication dispenser 1 72 M Married ALF x x x x X 2 67 F Married Hospital x x 3 93 F Widow ALF x x 4 80 F Married Home x x X 5 81 M Married ALF x x Note The first (RSS) and last (IGK) authors developed a semi-structured interview guide allowing for flexibility and dialogue. The questions were adapted to match the types of wearable devices and remote care services used by participants. A digital monitoring department provided remote care for blood pressure and weight scales, monitoring daily measurements. Home care services provided pain pumps. Safety alarms were provided by remote healthcare services, which sometimes cooperated with home care. The first author conducted all the interviews, in two cases assisted by a fellow researcher who took notes. The interviews were held between November 2022 and June 2023. Each interview lasted approximately 60 min and was held at a time and place chosen by the participant. In lifeworld research, there is no saturation of data, as ontologically and epistemologically, meanings are never-ending and constantly expanding. Accounting for variation in data collection, such as differences in age and culture, is essential to ensure richness and relevance in the findings ( Dahlberg et al., 2008 Analysis After data gathering, the same open approach was applied in the further analysis of the material. In this study, bridling is used to let the phenomenon of how wearable devices affect the sense of dignity of older patients in palliative care settings using remote monitoring health services shows itself and its constituents. By bridling researcher is striving for openness to the myriad meanings, not just the immediate ones. Researchers search for profound meanings behind patients’ words while shifting between objectivity and subjectivity, taking the time to reflect on the data material during analysis. Phenomenological analysis was conducted with the aim of providing a description of the phenomenon’s essence and its constituents, as well as how wearable devices affect the sense of dignity in older patients (above 65 years of age) in palliative care settings using remote monitoring health services. Since the Reflective lifeworld research approach implies “bridling openness” ( Dahlberg et al., 2008 Dahlberg et al. (2008 essences are their phenomena, the phenomena are their essences Validity, objectivity, and quality of the study were ensured by bridling, separating the researchers’ previous knowledge by striving for being open and reflective throughout the data gathering, data analysis, transparency, and going back and being sensitive to “things themselves” and the phenomenon. Numerous hours were spent in reflections and discussions between the first (RSS) and last (IGK) authors about the meanings and the phenomenon ( Dahlberg et al., 2008 Results The phenomenon of older patients’ sense of dignity in palliative care, as experienced through the use of wearable devices, was explored through phenomenological analysis. The analysis showed that the essence of older adults’ sense of dignity in palliative care is vulnerable and, therefore, at stake when using wearable devices for remote monitoring. This experience is marked by ambivalence, expressed through mixed emotions and conflicting perceptions of whether the care is dignified. These tensions are further illustrated in the following constituents: Simultaneous sense of regained and diminished quality of life. Mixed feelings ranging from strengthened self-identity and independence to vulnerability and dependence. Shifting care responsibilities within the context of life’s finitude. Uncertainty about being valued, seen, and empowered while navigating relational expectations. Simultaneous Sense of Regained and Diminished Quality of Life Wearable devices and remote monitoring introduce a new dimension to quality of life, supporting a sense of dignity by enhancing safety and enabling timely assistance. They allow individuals greater autonomy, such as the freedom to travel, walk without pain, and better understand their health, measurements, and medications, thereby reinforcing a sense of control and self-respect in care. Ambivalence emerges from the feeling that one aspect of quality of life is regained, when another is diminished. Senses of dignity fluctuate from regained life possibilities and control to feeling vulnerable, frail, and restricted in noting diminished ability to do things as usual. A patient wearing a pain pump describes the possibility of a new quality of life as follows: “ If I don’t press the button for an extra dose in time, my whole world falls apart in pain. But the pain pump adds to my quality of life, relieving all the pain and not just cancer pain. It is giving me not just a feeling of safety but a whole new world of possibilities In contrast, a loss of quality of life is expressed in this way: “ The pain pump made me pain-free, and that’s good. But now, because of morphine, I can’t drive anymore. I feel depressed because I’ve lost the ability to drive, and driving was a huge part of my life that I enjoyed Mixed Feelings Ranging from Strengthened Self-Identity and Independence to Vulnerability and Dependence Wearable devices represent a renewed sense of autonomy, feelings of safety, and opportunities to go on with their lives without depending on others. Maintaining self-identity is appreciated by the possibility to ask for help, when and how much they want. However, a question arises concerning the autonomy they had gained when reflecting on their health deterioration and whether wearable devices will continue to be helpful. The sense of dignity oscillated between feeling worthy, having a deep sense of self-identity, independence, and self-ability on the one hand, and feeling vulnerable and constrained, both bodily and by the devices, on the other. A sense of enhanced autonomy is expressed through feelings of responsibility, advantage, and empowerment gained by using wearable devices, including the ability to maintain life routines and reduced dependence on healthcare professionals. Autonomy is also expressed through renewed satisfaction with oneself, despite diseases, and through the ability to receive care at home or in a facility that enables independence. Digital monitoring gives insight into own measurements. As an example, one patient felt self-contained, independent, and in charge of their own health, knowing and trusting that the HCPs monitoring team would react if measurements went outside the normal range. Similarly, medication dispensers help patients stick to their medication intake routines by alerting them to take their medications at the recommended times at home. Pain pumps permit them to adjust their own morphine doses as needed to stay pain-free and self-sufficient. Safety alarms allow treatments to be adjusted and disease complications to be resolved without requiring a trip to a healthcare setting, also enabling immediate help in case of a fall, severe health deterioration, or even when simply not feeling well. In such a case, they can press a button to initiate contact with healthcare services.  I have had enough [experience with the safety alarm] with cancer, fractures, treatments. . . I fell a few times in the bathroom, and paramedics came and took me to the hospital [after I activated the safety alarm]. I feel safe when I see my measurements, knowing I am [digitally] monitored and can call and get help. (P1) However, not everyone seems to accept wearable devices to the same extent. An older patient said that the residents of their assisted living facility felt diminished and downgraded when safety alarms replaced the HCPs’ night shifts. They felt their opinions and protests had not been considered in the decision-making process. Each patient resides in their own apartment, which features one bedroom. The speakerphones for the safety alarms were installed in the hallways of the patients’ apartments, and not in the bedrooms, to ensure that patients can talk with HCPs via speakerphones from their whole apartment. Other patients express concerns about what will happen when their health status deteriorates and they become too sick to yell from their bedrooms, and the HCPs can’t hear them on the speakerphone. Furthermore, the experience of a device suddenly not working created confusion and fear. A patient described an episode of infection followed by confusion, when she was not rational and didn’t remember to activate the safety alarm. As she put it, “So no point in a safety alarm then. Then you can count only on people Shifting Care Responsibilities Within the Context of Life’s Finitude Wearing a device on the body creates a special bond between the wearer and the device, which can evoke mixed emotions. The participants expressed ambivalence: on the one hand, they treated their devices as treasures and felt responsible for them; on the other, they felt frustration due to technical issues or because the devices were seen as reminders of the finitude of their lives. Accordingly, the patients’ sense of dignity fluctuated, sometimes reflecting a sense of mutual care between themselves and their wearable devices, resulting in a bond they valued, and at other times dominated by poignant and sobering thoughts about the finitude of life potentiated by the devices’ limitations or dysfunctionalities. A special bond was expressed through paying particular attention to and cherishing wearable devices, for instance, keeping safety alarms and pain pumps close by and protected when showering or taking notes on daily medication dosages dispensed through pain pumps. One patient said about her safety alarm: “It’s worth its weight in gold. I never take it off, not when showering, washing dishes, never” (P3). Wearable devices were experienced as a guarantee of safety, accepting responsibility for own health, as well as enabling help to be sought in critical situations or when simply wanting to get in touch with HCPs for a checkup. The constant wearing of pain pumps was compared to the regular carrying of a mobile phone. Wearable devices as a regular part of care can also be a burden. In this example, the patient’s feeling of responsibility for the device caused him to be vigilant at night: I can’t sleep because I must watch that the pain pump doesn’t disconnect and leave me in pain. So, I take care of the pump, and it takes care of me. I also expected it not to be so heavy to wear. (P5) Even though patients are satisfied with the renewed ability to go to a restaurant, travel, or go for a walk instead of just lying in bed, for some, the device feels like a constant reminder of the finitude of life: “ Should I wear it till I die? We are old, but we still have our privacy Uncertainty About Being Valued, Seen, and Empowered While Navigating Relational Expectations Older patients in palliative care feel supported by HCPs and encouraged to use wearable devices without worrying about making mistakes with them. This creates a trusting relationship between them and a sense of being seen as a whole person, receiving holistic care. Patients, however, wonder if there is an unspoken limit to the care they can expect. They feel they should manage many things by themselves and be “good patients” rather than burdens. Contradictions in patients’ sense of dignity, such as feeling seen, valued, and empowered, yet aware of their vulnerability, put their sense of dignity at stake. A need to balance relational expectations to avoid becoming an encumbrance or making excessive demands is present. HCPs working with wearable devices encourage patients to text, call, or activate safety alarms whenever they need help or an answer. They assure the patients they can’t make mistakes. This lays the foundation for patients’ feelings of safety, reliability, and trust in HCPs and wearable devices. For example, safety alarms can be activated by chance, but HCPs reassure patients that these are not treated as false alarms; instead, they are viewed as “try-outs.” Patients report feeling that they receive holistic care thanks to the mix of wearable devices and HCPs, in contrast to the example of visiting a cardiologist who looks at their heart and nothing else and doesn’t include them in the decision-making. Remote monitoring care gives a feeling of being seen not as anonymous patients but as whole persons, dignified, and in control. Patients insisted that “care by using technology without HCPs would be cold. It might lead to separation and desocialisation from other people and feeling treated as a number. Without HCPs, care would not be humanised or dignified.” At the same time, out of respect for HCPs and a desire not to depend too much on others, the patients in this study try to do what they can on their own by giving themselves injections, ensuring an adequate medication supply, “being a good patient,” and avoiding unduly burdening the HCPs. Older patients in palliative care in this study expected that all HCPs would have access to all patients’ health data. “ I gave them (HCPs) permission to send my measurements and all of my health data to everyone that needs them Discussion The aim of the study was to gain insight into the phenomenon of how wearable devices affect the sense of dignity of older patients in palliative care settings using remote monitoring health services. The essence of the phenomenon that the sense of dignity is at stake for older adults over 65 in palliative care using wearable devices for remote health monitoring highlights the need to understand better what is at risk for these patients. Their experiences are marked by ambivalence, reflecting mixed and sometimes contradictory feelings about whether this type of care supports their dignity. In the Norwegian palliative care context, these older patients’ sense of dignity was deeply influenced by their perceptions of independence and dependence, which were closely tied to the progression of their illnesses and, in turn, impacted their sense of identity. The ambivalence in patients’ moods and attitudes towards wearable devices and remote home monitoring care might lead to ambiguity in HCPs’ understanding of patients’ sense of dignity. This, in turn, could challenge how HCPs acknowledged levels of dependency in the context of offering dignified care. According to the framework of Galvin and Todres’ (2015), dignity is a complex phenomenon, derived from lived perceptions that encompass all variations from vulnerability, respect, autonomy, honour, and kinship. The essential structure of dignity as described by Galvin and Todres (2015) Galvin & Todres, 2015 Galvin & Todres, 2015 Our findings indicate that these patients believed that holistic and dignified palliative remote care cannot be provided without trustful relationships between patients and HCPs. Patients saw wearable devices as means to receive care and treatments from their homes (which supported spatial dignity), through contact with HCPs; they considered that they could rely on HCPs even when they had technical issues or felt limited by their bodies and illnesses. Encouragement, empowerment, and holistic care they got from HCPs are examples of supported interpersonal dignity. Interpersonal dignity is experienced in relationships characterised by mutual valuing expressed through safeguarding and respecting vulnerability ( Galvin & Todres, 2015 Interpersonal dignity requires HCPs to recognise nuances in patients’ understanding of dignified care. Viftrup et al. (2021) Spaho et al. (2024) Other studies have underlined HCPs’ role in remote monitoring via wearable devices and telehealth, emphasising that HCPs can empower patients to be active partakers in their own health, enable feelings of safety, provide individual, patient-centred care, and early interventions in cases of changing health, prevent unnecessary readmissions through constant patient involvement ( Hentschel et al., 2016 Kang & Exworthy, 2022 Vaismoradi et al., 2024 Kang & Exworthy, 2022 Hentschel et al., 2016 Kang & Exworthy, 2022 Ott et al., 2023 Temporal dignity is supported when the patients feel satisfied with their place in the world and time ( Galvin & Todres, 2015 Haase et al., 2020 LeBaron et al., 2022 Raja et al., 2023 Walton et al., 2022 Galvin and Todres (2015) Galvin & Todres, 2015 Wearable devices can directly affect patients’ embodied dignity, bodily “I can.” When a patient’s health status changes, the patient experiences corresponding changes in several kinds of dignity, including identity, embodiment, and finitude dignity. Bodily limitations and sudden health deteriorations (embodiment) act as reminders of the finitude of life for patients in palliative care and can make them more dependent on HCPs. However, this dependence was tacit, as patients were aware of these sudden health changes. Even though patients’ levels of independence and dependence were changing, their identity dignity was salvaged by experiencing empowerment and interpersonal dignity in their interactions with HCPs. Patients not only relied on but also expected help from HCPs, especially in these critical moments. This was reflected by their showing trust in HCPs and feeling supported, in control, and empowered. The use of wearable devices was causing feelings of pressure and responsibility in COVID-19 patients in cases of health deterioration ( Walton et al., 2022 Kang & Exworthy, 2022 Vaismoradi et al., 2024 Empowerment happens when persons believe in own abilities and in control to do tasks that reflect their personal values ( Nelson et al., 2024 Zhang et al., 2024 Nelson et al., 2024 Nelson et al. (2024) Our findings, although based on a small sample, underline that patients want to be active participants in treatment decision-making, view their own measurements and results, and take responsibility for and control over their own lives. They believe that remote home monitoring care provides holistic care, in contrast to the narrow “regular” care, where they feel like anonymous patients. Although remote home care places responsibility on patients, they experience a supported sense of dignity both through the involvement of healthcare professionals and their own active participation in managing their health. Patients from other studies also emphasised the importance of having insight into their own symptom progression by using digital health technology, which enables them to feel empowered, in control, and secure in evaluating their own symptoms ( Knotnerus et al., 2024 LeBaron et al., 2022 Our findings demonstrate that dignity in remote monitoring by wearable devices is a multifaceted experience. By understanding the complexity of dignity as a phenomenon, healthcare professionals (HCPs) can be guided towards implementing practical interventions that promote meaningful and dignified care. This is particularly pertinent in palliative care settings. Strengths and Limitations The strength of this study lies in its focus on the dignity at stake for this vulnerable group of older patients using wearable devices, while also raising important questions about individual and group identity dignity in palliative care. By deepening our understanding of how wearable devices influence the sense of dignity among older patients in remote monitoring settings, the study fosters greater awareness and supports the delivery of more dignified palliative care. The report on the effects of the pilot implementation of digital monitoring departments in Norway was published in 2022 ( Helsedirektoratet [Ministry of Health Department], 2022 Bodø kommune, n.d Helsedirektoratet [Ministry of Health Department], 2022 Maagerø & Simonsen, 2021 Helsedirektoratet [Ministry of Health Department], 2022 Raja et al., 2023 Kang & Exworthy, 2022 Maguraushe & Ndlovu, 2024 Nelson et al., 2024 A strength of the study is that it includes the experiences of patients in this vulnerable group, all of whom were already receiving some form of remote monitoring care. Attrition is not uncommon in palliative care research, as seen in our study and others ( Dunleavy et al., 2023 Froggatt et al., 2020 Oriani et al., 2020 Slev et al., 2020 Oriani et al., 2020 Wright et al. (2018) Lowe et al. (2020) Froggatt et al., 2020 Conclusion and Future Implications This phenomenological study explored how wearable devices influence the sense of dignity among older patients receiving palliative care through remote home monitoring in Norway. The findings highlight that dignity is a multifaceted experience shaped by identity, mood, finitude, and interpersonal relationships and is deeply impacted by digital health technologies. These insights can help healthcare professionals deliver more individualised, patient-centred, and cost-effective remote palliative care. As remote care technologies evolve, recognising the possibilities and limitations for supporting dignity is essential. Further research with larger, more diverse samples is needed to expand understanding and inform actionable strategies. Stakeholders, including software developers, policymakers, care providers, and patients themselves, must collaborate to ensure remote home care systems protect and promote dignity in ageing and dying. The first author thanks her research colleagues, Jannike Karlstad and Terhi Holster, who helped with conducting the interviews, the stakeholders who recruited the participants, and the participants for their valuable insights. Abbreviations: WHO: World Health Organisation ORCID iD: https://orcid.org/0000-0001-7543-3642 Ethical Considerations: Author Contributions: Funding:  The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Data Availability Statements: http://creativecommons.org/licenses/by/4.0/ Consortia: www.innovatedignity.eu Author Biographies Rada Sandic Spaho Lisbeth Uhrenfeldt Theofanis Fotis Jorunn Bjerkan Ingjerd Gåre Kymre References Åberg C. Gillsjö C. Hallgren J. Berglund M. 2020 “It is like living in a diminishing world”: Older persons’ experiences of living with long-term health problems – Prior to the STRENGTH intervention International Journal of Ǫualitative Studies on Health and Well-Being 15 1 1747251 10.1080/17482631.2020.1747251 PMC7178864 32275201 Bodø kommune Digital hjemmeoppfølging (Digital home monitoring) Bodø kommune https://bodo.kommune.no/tjenester/helse-og-mestring/tjenester-til-hjemmeboende/digital-hjemmeoppfolging-dho/ Bovero A. Botto R. Mellano E. Gottardo F. Berchialla P. Carletto S. Geminiani G. C. 2024 Loss of personal autonomy and dignity-related distress in end-of-life cancer patients American Journal of Hospice and Palliative Medicine® 41 2 179 186 https://journals.sagepub.com/doi/abs/10.1177/10499091231166373 36974952 10.1177/10499091231166373 Cannon C. 2018 Telehealth, mobile applications, and wearable devices are expanding cancer care beyond walls Seminars in Oncology Nursing 34 2 118 125 10.1016/j.soncn.2018.03.002 29627143 Cardona M. Solanki V. K. Cena C. E. G. 2021 Internet of medical things: Paradigm of wearable devices CRC Press Dahlberg K. Dahlberg H. Nyström M. 2008 Reffective lifeworld research Studentlitteratur Dunleavy L. Preston N. Walshe C. 2023 Health care professional recruitment of patients and family carers to palliative care randomised controlled trials: A qualitative multiple case study Palliative Medicine 37 10 1540 1553 https://journals.sagepub.com/doi/abs/10.1177/02692163231197917 37753865 10.1177/02692163231197917 PMC10657513 European Commission 2018 Communication on enabling the digital transformation of health and care in the Digital Single Market; empowering citizens and building a healthier society [COM (2018) 233 final https://digital-strategy.ec.europa.eu/en/library/communication-enabling-digital-transformation-health-and-care-digital-single-market-empowering European Commission 2018 Fact Sheet, The digital transformation of healthcare, Brussels, 25 April European Commission https://ec.europa.eu/commission/presscorner/detail/en/MEMO_18_3367 Fernando G. V. M. C. Hughes S. 2019 Team approaches in palliative care: A review of the literature International Journal of Palliative Nursing 25 9 444 451 10.12968/ijpn.2019.25.9.444 31585054 Froggatt K. Best A. Bunn F. Burnside G. Coast J. Dunleavy L. Goodman C. Hardwick B. Jackson C. Kinley J. Davidson Lund A. Lynch J. Mitchell P. Myring G. Patel S. Algorta G. P. Preston N. Scott D. Silvera K. Walshe C. 2020 A group intervention to improve quality of life for people with advanced dementia living in care homes: The Namaste feasibility cluster RCT Health Technology Assessment (Winchester, England) 24 6 1 140 10.3310/hta24060 PMC7008353 31971506 Galvin K. Todres L. 2013 Caring and well-being: A lifeworld approach Routledge Galvin K. Todres L. 2015 Dignity as honour-wound: An experiential and relational view Journal of Evaluation in Clinical Practice 21 3 410 418 10.1111/jep.12278 25345355 PMC4674983 Haase K. R. Drury A. Puts M. 2020 Supportive Care and eHealth: A narrative review of technologies, interventions, and opportunities for optimizing care in patients with cancer Clinical Journal of Oncology Nursing 24 32 41 10.1188/20.cjon.s1.32-41 32441699 Helsedirektoratet [Ministry of Health Department] 2021 Digital hjemmeoppfølging [nettdokument].( Digital home monitoring) Helsedirektoratet December 15 2022 https://www.helsedirektoratet.no/tema/teknologi-i-v%C3%A5r-felles-helsetjeneste/digital-hjemmeoppfolging Helsedirektoratet [Ministry of Health Department] 2022 Digital hjemmeoppfølging - Sluttrapport fra nasjonal utprøving 2018–2021; Nasjonalt velferdsteknologiprogram Digital home monitoring- final report from national trial 2018–2021; National welfare technology programme https://www.helsedirektoratet.no/rapporter/digital-hjemmeoppfolging-sluttrapport-fra-nasjonal-utproving-2018-2021/pdf-av-rapporten/Digital%20hjemmeoppf%C3%B8lging%20-%20sluttrapport%20fra%20nasjonal%20utpr%C3%B8ving%202018-2021.pdf/_/attachment/inline/67a250f2-a124-42bd-a854-41dd95acf9b6:3a571bca31bc233dc2a0247cb40ed60fff42976f/Digital%20hjemmeoppf%C3%B8lging%20-%20sluttrapport%20fra%20nasjonal%20utpr%C3%B8ving%202018-2021.pdf Hentschel M. A. Haaksma M. L. van de Belt T. H. 2016 Wearable technology for the elderly: Underutilized solutions European Geriatric Medicine 7 5 399 401 10.1016/j.eurger.2016.07.008 Kang H. S. Exworthy M. 2022 Wearing the future—Wearables to empower users to take greater responsibility for their health and care: Scoping review JMIR Mhealth Uhealth 10 7 10.2196/35684 PMC9330198 35830222 Knotnerus H. R. Ngo H. T. N. Maarsingh O. R. van Vugt V. A. 2024 Understanding older adults’ experiences with a digital health platform in general practice: Qualitative interview study JMIR Aging 7 10.2196/59168 PMC11378695 39212599 Koszalinski R. S. Kelley M. M. O’Brien T. R. 2019 Digital health: mHealth, Telehealth, and wearables Hardy L. R. Fast facts in health informatics for nurses 119 136 Springer Publishing Company 10.1891/9780826142269.0009 La Rocca A. Hoholm T. 2017 Coordination between primary and secondary care: The role of electronic messages and economic incentives BMC Health Services Research 17 1 1 14 28212653 10.1186/s12913-017-2096-4 PMC5316199 LeBaron V. Alam R. Bennett R. Blackhall L. Gordon K. Hayes J. Homdee N. Jones R. Lichti K. Martinez Y. Mohammadi S. Ogunjirin E. Patel N. Lach J. 2022 Deploying the behavioral and environmental sensing and intervention for cancer smart health system to support patients and family caregivers in managing pain: Feasibility and acceptability study JMIR Cancer 8 3 10.2196/36879 PMC9399893 35943791 Liu J. X. Goryakin Y. Maeda A. Bruckner T. Scheffler R. 2017 Global health workforce labor market projections for 2030 Human Resources for Health 15 1 11 10.1186/s12960-017-0187-2 28159017 PMC5291995 Lowe S. S. Milligan C. Brearley S. G. 2020 Activity and advanced cancer: A grounded theory Palliative Medicine 34 2 231 244 https://journals.sagepub.com/doi/abs/10.1177/0269216319888989 31752602 10.1177/0269216319888989 Maagerø E. Simonsen B. 2021 Norway—Society and culture 3rd ed. 2nd printing 2022 ed. Cappelen Damm Akademisk Maguraushe K. Ndlovu B. M. 2024 The use of smart technologies for enhancing palliative care: A systematic review Digital Health 10 1 20 10.1177/20552076241271835 PMC11528824 39493628 Melby L. Håland E. 2021 When time matters: A qualitative study on hospital staff’s strategies for meeting the target times in cancer patient pathways BMC Health Services Research 21 1 1 12 10.1186/s12913-021-06224-7 33750379 PMC7941937 Mertens F. Debrulle Z. Lindskog E. Deliens L. Deveugele M. Pype P. 2021 Healthcare professionals’ experiences of inter-professional collaboration during patient’s transfers between care settings in palliative care: A focus group study Palliative Medicine 35 2 355 366 https://journals.sagepub.com/doi/abs/10.1177/0269216320968741 33126837 10.1177/0269216320968741 Nelson E. C. Verhagen T. Vollenbroek-Hutten M. M. R. Noordzij M. L. 2024 When it is part of me, I can do it: Using embodied empowerment to predict adherence to wearable self-care technology Computers in Human Behavior 158 108314 Nene S. Rauch M. Belanger D. Bennett R. Berry G. Saad N. Wall M. José A. M. Morin S. N. 2023 Personalized telehealth: Redesigning complex care delivery for the 65+ during the COVID pandemic: A survey of patients, caregivers, and health-care providers Canadian Geriatrics Journal 2c 1 150 175 https://cgjonline.ca/index.php/cgj/article/view/641 10.5770/cgj.26.641 PMC9953506 36865400 Oriani A. Dunleavy L. Sharples P. Perez Algorta G. Preston N. J. 2020 Are the MORECare guidelines on reporting of attrition in palliative care research populations appropriate? A systematic review and meta-analysis of randomised controlled trials BMC Palliative Care 1S 1 1 6 10.1186/s12904-019-0506-6 PMC6953282 31918702 Östlund U. Blomberg K. Söderman A. Werkander Harstäde C. 2019 How to conserve dignity in palliative care: Suggestions from older patients, significant others, and healthcare professionals in Swedish municipal care BMC Palliative Care 18 1 10 10.1186/s12904-019-0393-x 30678669 PMC6346549 Ott T. Heckel M. Öhl N. Steigleder T. Albrecht N. C. Ostgathe C. Dabrock P. 2023 Palliative care and new technologies. The use of smart sensor technologies and its impact on the total care principle BMC Palliative Care 22 1 50 10.1186/s12904-023-01174-9 37101258 PMC10131446 Ovid Technologies Inc 1993 MeSH heading: Telemedicine Walter Kluwer https://ovidsp-dc1-ovid-com.ezproxy.nord.no/ovid-new-a/ovidweb.cgi Patel M. S. Asch D. A. Volpp K. G. 2015 Wearable devices as facilitators, not drivers, of health behavior change JAMA 313 5 459 460 10.1001/jama.2014.14781 25569175 Pavic M. Klaas V. Theile G. Kraft J. Tröster G. Blum D. Guckenberger M. 2020 Mobile health technologies for continuous monitoring of cancer patients in palliative care aiming to predict health status deterioration: A feasibility study Journal of Palliative Medicine 23 5 678 685 10.1089/jpm.2019.0342 31873052 Pavic M. Klaas V. Theile G. Kraft J. Tröster G. Guckenberger M. 2020 Feasibility and usability aspects of continuous remote monitoring of health status in palliative cancer patients using wearables Oncology S8 6 386 395 10.1159/000501433 31336377 Raja M. Kymre I. G. Bjerkan J. Galvin K. T. Uhrenfeldt L. 2023 National digital strategies and innovative eHealth policies concerning older adults’ dignity: A document analysis in three Scandinavian countries BMC Health Services Research 23 1 848 10.1186/s12913-023-09867-w 37563599 PMC10416358 Rejeb A. Rejeb K. Treiblmaier H. Appolloni A. Alghamdi S. Alhasawi Y. Iranmanesh M. 2023 The Internet of Things (IoT) in healthcare: Taking stock and moving forward Internet of Things 22 100721 Sandic Spaho R. Uhrenfeldt L. Fotis T. Kymre I. G. 2023 Wearable devices in palliative care for people 65 years and older: A scoping review Digital Health 9 1 19 10.1177/20552076231181212 PMC10328013 37426582 Schmalz O. Jacob C. Ammann J. Liss B. Iivanainen S. Kammermann M. Koivunen J. Klein A. Popescu R. A. 2020 Digital monitoring and management of patients with advanced or metastatic non-small cell lung cancer treated with cancer immunotherapy and its impact on quality of clinical care: Interview and survey study among health care professionals and patients Journal of Medical Internet Research 22 12 10.2196/18655 PMC7781800 33346738 Siemens W. Boehlke C. Bennett M. I. Offner K. Becker G. Gaertner J. 2020 Transcutaneous electrical nerve stimulation for advanced cancer pain inpatients in specialist palliative care-a blinded, randomized, sham-controlled pilot cross-over trial [Randomized Controlled Trial] Supportive Care in Cancer 28 11 5323 5333 32128614 10.1007/s00520-020-05370-8 PMC7547037 Slev V. N. Molenkamp C. M. Eeltink C. M. Roeline W Pasman H. Verdonck-de Leeuw I. M. Francke A. L. van Uden-Kraan C. F. 2020 A nurse-led self-management support intervention for patients and informal caregivers facing incurable cancer: A feasibility study from the perspective of nurses European Journal of Oncology Nursing 45 101716 32023503 10.1016/j.ejon.2019.101716 Söderman A. Östlund U. Harstäde C. W. Blomberg K. 2020 Dignity-conserving care for persons with palliative care needs - identifying outcomes studied in research: An integrative review Palliative & Supportive Care 18 6 722 740 10.1017/S1478951520000139 32131926 Spaho R. S. Uhrenfeldt L. Fotis T. Bjerkan J. Gåre Kymre I. 2024 Healthcare professionals’ experiences of eHealth in palliative care for older people: Challenges, compromises and the price of dignity International Journal of Qualitative Studies on Health and Well-being 1S 1 2374733 10.1080/17482631.2024.2374733 PMC11249141 38988233 Teoli D. Schoo C. Kalish V. 2023 Palliative care StatPearls Publishing 30725798 United Nations 2019 World population ageing 2019: Highlights Department of Economic and Social Affairs (ST/ESA/SER.A/430 https://www.un.org/en/development/desa/population/publications/pdf/ageing/WorldPopulationAgeing2019-Highlights.pdf University in Oslo 2023 February 3 Nettskjema-dictaphone https://www.uio.no/english/services/it/adm-services/nettskjema/help/nettskjema-dictaphone.html Vaismoradi M. Rae J. Turunen H. Logan P. A. 2024 Specialized nurses’ role in ensuring patient safety within the context of telehealth in home care: A scoping review Digital Health 10 1 19 https://journals.sagepub.com/doi/abs/10.1177/20552076241287272 10.1177/20552076241287272 PMC11459674 39381815 Viftrup D. T. Hvidt N. C. Prinds C. 2021 Dignity in end-of-life care at hospice: An action research study Scandinavian Journal of Caring Sciences 35 2 420 429 https://onlinelibrary.wiley.com/doi/abs/10.1111/scs.12872 32419195 10.1111/scs.12872 Walton H. Vindrola-Padros C. Crellin N. E. Sidhu M. S. Herlitz L. Litchfield I. Ellins J. Ng P. L. Massou E. Tomini S. M. Fulop N. J. 2022 Patients’ experiences of, and engagement with, remote home monitoring services for COVID-19 patients: A rapid mixed-methods study Health Expectations 25 5 2386 2404 10.1111/hex.13548 35796686 PMC9349790 WHO 2018 Digital technologies: Shaping the future of primary health care https://www.who.int/docs/default-source/primary-health-care-conference/digital-technologies.pdf WHO 2020 5th August 2020 Palliative care; Key facts World Health Organisation https://www.who.int/news-room/fact-sheets/detail/palliative-care WHO 2022 Digital health World Health Organization Regional office for Europe https://www.who.int/europe/health-topics/digital-health WHO Health workforce World Health Organisation https://www.who.int/health-topics/health-workforce#tab=tab_1 Wright A. A. Raman N. Staples P. Schonholz S. Cronin A. Carlson K. Keating N. L. Onnela J.-P. 2018 The HOPE pilot study: Harnessing patient-reported outcomes and biometric data to enhance cancer care 2 1 12 10.1200/CCI.17.00149 PMC6556148 30652585 Zhang Y. Ma Y. Liang C. 2024 Understanding older adults’ continuance intention toward wearable health technologies: An empowerment perspective Behaviour & Information Technology 44 6 1277 1294 10.1080/0144929X.2024.2350674 ",
  "metadata": {
    "Title of this paper": "Understanding older adults’ continuance intention toward wearable health technologies: An empowerment perspective",
    "Journal it was published in:": "Global Qualitative Nursing Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476496/"
  }
}