{
  "title": "Paper_122",
  "abstract": "pmc Front Cell Dev Biol Front Cell Dev Biol 2593 frontcdb Front. Cell Dev. Biol. Frontiers in Cell and Developmental Biology 2296-634X Frontiers Media SA PMC12488709 PMC12488709.1 12488709 12488709 10.3389/fcell.2025.1657720 1657720 1 Cell and Developmental Biology Mini Review Advancing therapeutic target discovery in pulmonary diseases: evolution and application of space exploration technologies Yang et al. 10.3389/fcell.2025.1657720 Yang Bo  1  2  † Zheng Quan  3  † Li Guozheng  1 Liao Bingnan  1 Lin Zhongxiao  1 * He Hao  4 *  1 Guangzhou Municipal and Guangdong Provincial Key Laboratory of Molecular Target and Clinical Pharmacology, The NMPA and State Key Laboratory of Respiratory Disease, School of Pharmaceutical Sciences, Guangzhou Medical University Guangzhou China  2 Zhengda Tianqing Pharmaceutical Group Co., LTD Lianyungang China  3 School of Pharmacy, Macau University of Science and Technology Macau China  4 Shenzhen Longgang Second People’s Hospital Shenzhen Guangdong China  Edited by: Kazuhiko Nakabayashi  Reviewed by: Junko Tomikawa *Correspondence: Zhongxiao Lin, lzxjob@163.com hehao2003050@163.com  † These authors have contributed equally to this work 18 9 2025 2025 13 480890 1657720 01 7 2025 22 8 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Yang, Zheng, Li, Liao, Lin and He. 2025 Yang, Zheng, Li, Liao, Lin and He https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Epigenetic alterations are associated with various pulmonary diseases. In recent years, the concept of epigenetic inheritance influenced by spatial variations has garnered increasing attention. Alterations in three-dimensional (3D) chromatin architecture have been demonstrated to play a crucial role in regulating gene expression and influencing the pathogenesis and progression of lung-related diseases. Techniques such as high-throughput chromosome conformation capture (Hi-C) have emerged as powerful tools for detecting spatial chromatin conformational changes. In this review, we summarize key targets identified through Hi-C and related methodologies in the context of pulmonary diseases and explore their potential implications for epigenetic therapies. epigenetics pulmonary diseases chromatin structure Hi-C technology therapeutic targets National Institutes of Natural Sciences 10.13039/501100006321 The author(s) declare that financial support was received for the research and/or publication of this article. This work is supported by the National Institutes of Natural Sciences (82204393). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Epigenomics and Epigenetics 1 Introduction Pulmonary disease, which encompass a variety of conditions such as chronic obstructive pulmonary disease (COPD), asthma, pulmonary fibrosis, and lung cancer, have become significant contributors to mortality and health burdens worldwide. The development of these diseases is influenced by a multitude of factors, including genetics, environmental exposures, lifestyle choices, and immune responses ( Wang et al., 2025 Casas-Recasens et al., 2024 Environmental factors, including air pollution, tobacco smoke, and occupational exposures, can induce epigenetic changes that affect gene expression. For instance, certain pollutants can lead to inflammatory responses in the lungs and promote the development of chronic pulmonary disease by altering the methylation status of relevant genes ( Jurkowska, 2024 Ritzmann et al., 2025 Klibaner-Schiff et al., 2024 With advancements in technology, research tools in epigenetics, such as chromatin immunoprecipitation sequencing (ChIP-seq), assay for transposase-accessible chromatin using sequencing (ATAC-seq), DNA methylation sequencing (methyl-seq), and transcriptome sequencing (RNA-seq) ( Goodwin et al., 2016 van Berkum et al., 2010 First, Hi-C and relative technologies capture the 3D structure of chromatin, revealing the interactions between long-range regulatory elements and their target genes within the genome. This spatial relationship is often difficult to detect through traditional sequence analysis; however, in the context of pulmonary disease, the spatial relationships among different genes and regulatory elements often directly influence the onset and progression of these conditions. For example, in cases of COPD or lung cancer, specific enhancers may promote the expression of precursor genes through 3D interactions, and 3D-caputre technology help researchers identify these critical regulatory elements, thereby providing new strategies for targeted therapies ( Yoon et al., 2024 Guo et al., 2024 Ritzmann et al., 2025 Martino et al., 2023 Zhang et al., 2024 By better understanding and modulating the epigenetic changes associated with pulmonary diseases, this review will summarize the integration of Hi-C and related data in pulmonary diseases (COPD, asthma, pulmonary fibrosis, and lung cancer) ( Figure 1 FIGURE 1 Hi-C-based therapeutic targets discovery in pulmonary disease. At the nuclear level in pulmonary diseases, chromatin is organized into spatially segregated compressed and transcriptionally active compartments. Within these active compartments, numerous regulatory elements orchestrate gene expression programs that drive disease phenotypes. Through three-dimensional genomic profiling, we can systematically map long-range chromatin interactions at nucleotide resolution. This approach enables mechanistic dissection of pathogenic processes in asthma, COPD, and lung cancer, while simultaneously facilitating the identification of novel therapeutic targets. Diagram illustrating chromosomal interactions related to pulmonary diseases, with a focus on asthma, COPD, and lung cancers. It shows the nucleus with chromosomal territories and Transcriptional Alteration. Details include chromosomal distal and internal interactions, as well as active and repressed TAD compartments with boundaries and nuclear lamina. Regulatory elements and gene interactions within an active TAD compartment are also depicted. 2 The history and the usage of Hi-C-based technology In the 1980s and 1990s, scientists achieved a comprehensive understanding of the linear sequences of genomes; however, research on the spatial organization of chromosomes within the cell nucleus and their interactions was comparatively limited ( Shendure et al., 2017 Dekker et al., 2002 Subsequent advancements led to the development of several derivative techniques, including 4C (Chromosome Conformation Capture-on-Chip), which examines neighboring genomic regions of particular genes, and 5C (Chromosome Conformation Capture Carbon Copy), which is appropriate for large-scale analysis of interactions among multiple DNA fragments. Hi-C, an extension of 3C technology, merges chromosome conformation capture with high-throughput sequencing. In this technique, DNA is first treated with formaldehyde to crosslink it with proteins and stabilize its conformation, followed by digestion, biotin incorporation, ligation, and extraction. The processed nucleic acids undergo library construction and high-throughput sequencing, ultimately providing interaction information between chromosomal fragments through the analysis of sequencing data. This method assesses relationships in spatial positioning throughout the entire chromatin within the genome ( Jiang et al., 2024 Hi-C technology not only facilitates the study of interactions between chromosomal segments and the modeling of genomic folding, but it also has applications in genome assembly, haplotype mapping, and aiding in metagenome assembly ( Jiang et al., 2024 Lan et al., 2012 Feng et al., 2021 Kukat et al., 2015 With the advancement of Hi-C technology and its derivatives, researchers are uncovering how genomic spatial organization influences gene expression regulation, chromosomal structure alterations, and their roles in diseases such as cancer and genetic disorders. These investigations have significantly enhanced our understanding of genomic biology and genetic regulatory mechanisms, proving valuable for elucidating disease pathogenesis and predicting disease occurrence. In addition, various related techniques have emerged based on Hi-C. 1. Capture Hi-C: Capture Hi-C technology enhances the conventional Hi-C library by introducing a specific probe-capture process ( Martin et al., 2015 2. Promoter Capture Hi-C: Promoter Capture Hi-C builds upon the conventional Hi-C library by adding a step specifically aimed at capturing promoter regions ( Orlando et al., 2018 3. Diploid Chromatin Conformation Capture (Dip-C): Dip-C is a sequencing technique designed to study the 3D genome structure of single cells ( Tan et al., 2018 4. Significant progress has been made in single-cell Hi-C protocols. Gridina M et al. Gridina et al., 2022 et al. Li et al., 2023 Moreover, ChIA-Drop (Chromatin Interaction Analysis by Droplet) was developed as a polychromatin interaction analysis strategy ( Kempfer and Pombo, 2020 Beagrie et al., 2017 Quinodoz et al., 2018 Currently, additional technologies derived from Hi-C include in situ Mumbach et al., 2016 Lin et al., 2018 Rao et al., 2014 3 The target discovery ability of Hi-C technology in pulmonary diseases 3.1 COPD and asthma COPD is one of the leading causes of morbidity and mortality worldwide, imposing a substantial burden on the utilization of healthcare resources ( Christenson et al., 2022 Yang et al., 2022 Rabe and Watz, 2017 Asthma is a common chronic non-communicable disease characterized by variable respiratory symptoms and airflow limitation. Its pathogenesis involves complex interactions between genetic and environmental factors, leading to heterogeneous manifestations of airway inflammation and remodeling ( Papi et al., 2018 Shaw et al., 2021 Ramsahai et al., 2019 Guo et al., 2024 HHIP HHIP EMT Hi-C technology, by capturing spatial interactions of chromatin, has revealed the relationship between the 3D structure of the genome and gene expression regulation, providing a new perspective for elucidating the epigenetic mechanisms underlying pulmonary diseases. The pathogenesis of COPD and asthma is complex, involving interactions between multiple genetic and environmental factors. GWAS have identified several genetic loci associated with these two diseases, but the functions of these loci and their specific roles in disease are not yet fully understood. For example, a genetic locus on 17q12-q21 is significantly associated with childhood-onset asthma, while a region on 4q31 is closely linked to the susceptibility of COPD ( Washington et al., 2022 Mak et al., 2020 KITLG SCF KITLG KITLG KITLG Stuart et al. utilized Hi-C technology combined with CRISPRi (CRISPR interference) to study the functions of non-coding regions associated with asthma, cystic fibrosis (CF), COPD, and idiopathic pulmonary fibrosis (IPF) ( Stuart et al., 2020 ANXA1 Yoon et al., 2024 Granel et al., 2023 ANXA1 DNAH5 Joo et al., 2022 A recent study integrated epigenetic markers with genomic interactions in asthma research. Morin et al. identified allergic asthma-related CpGs via whole-genome bisulfite sequencing and in silico Morin et al., 2023 The application of Hi-C technology in COPD and asthma research not only provides new tools for elucidating the regulatory mechanisms of disease-related genes but also offers a new perspective for understanding gene-environment interactions. By analyzing chromosomal interactions, Hi-C technology can identify distal regulatory elements and their interactions with target genes, which is of great significance for understanding the genetic basis of complex diseases. For example, in the studies of COPD and asthma, Hi-C technology has revealed the functions of several non-coding regions associated with disease, which may influence disease pathogenesis by regulating the expression of key genes ( Guo et al., 2024 Šimková et al., 2024 As a powerful genomic tool, Hi-C technology has shown broad application prospects in pulmonary disease research. By revealing the 3D structure of the genome and its regulatory effects on gene expression, Hi-C technology provides a new perspective for understanding the pathogenesis of COPD and asthma. In the future, with further development and application of the technology, Hi-C is expected to play an important role in the genomic research of more pulmonary diseases, offering new strategies for diagnosis, treatment, and prevention. 3.2 Lung cancer Lung cancer is one of the most common malignant tumors globally and the leading cause of cancer-related mortality. It is estimated that there are approximately two million new cases and 1.76 million deaths annually ( Thai et al., 2021 Liu et al., 2024 Gao et al., 2019 The development and progression of lung cancer are closely associated with a variety of genetic alterations, including gene mutations, copy number variations (CNVs), chromosomal rearrangements, and epigenetic modifications. These genetic changes not only affect gene expression but may also promote tumor initiation and progression by altering chromatin structure and gene regulatory networks ( Li et al., 2021 Ji et al., 2020 Among these advancements, 3D genomics, particularly Hi-C technology, has provided a new perspective for elucidating genomic structural changes in lung cancer. Hi-C technology offers a powerful tool for studying genomic structural changes in lung cancer, especially in revealing the relationship between chromatin structure and gene expression regulation. For example, Ji et al. integrated Hi-C data from lung cancer cell lines with GWAS data from Asian populations to systematically analyze the association between genetic variations in chromatin interaction regions and lung cancer risk. This study identified four new lung cancer susceptibility loci located at 1q21.1, 2p23.3, 2p15, and 17q21.2 46 rs9309336 CHD1L Li et al. used Hi-C technology to analyze the 3D genomic structure of paired tumor and normal tissue samples from lung cancer patients ( Li et al., 2021 MAPK PI3K-AKT Ras Wnt SYT16 NCEH1 NXPE3 MB21D2 DZIP1L Song et al., 2023 Adeel et al., 2022 Fan et al., 2022 In addition to its applications in basic research, Hi-C technology has also provided new insights into lung cancer treatment. For example, by analyzing the 3D genomic structure of lung cancer cells, potential therapeutic targets and biomarkers can be identified. Wu et al. developed a computational method for quantifying enhancer RNAs (eRNAs) and revealed the association between transcriptional enhancers and lung cancer markers or oncogenes by integrating Hi-C, ChIP-seq, and RNA-seq data. These findings offer new directions for lung cancer treatment based on 3D genomic structure ( Wu et al., 2020 Guo et al., 2021 Hi-C technology provides a powerful tool for studying the genomic structure and regulatory mechanisms of lung cancer. By elucidating the 3D genomic structure of lung cancer cells, Hi-C technology not only helps identify new lung cancer susceptibility loci but also reveals the relationship between chromatin structural changes and the occurrence and development of lung cancer. Moreover, Hi-C technology shows great potential in detecting chromosomal translocations and identifying potential therapeutic targets. Future research can further utilize Hi-C technology in combination with multi-omics data to deeply explore the genomic structural characteristics of lung cancer, providing new strategies for diagnosis, treatment, and prognosis. 4 Discussion The advent of high-throughput sequencing technologies has revolutionized our understanding of genomic architecture and function. One such technology, Hi-C enables researchers to analyze the 3D organization of the genome at an unprecedented resolution. Recent studies have highlighted the potential of Hi-C in rapidly identifying therapeutic targets in various contexts, including pulmonary diseases, which encompass a range of pathologies such as COPD, asthma, and lung cancer. Pulmonary diseases are complex and multifactorial, often involving intricate interactions between genetic predispositions and environmental factors. Traditional approaches to identifying therapeutic targets have relied heavily on linear genomic analyses, which may overlook the spatial relationships that are essential for understanding gene regulation and expression in the context of specific diseases ( Table 1 TABLE 1 Summarization of Hi-C-based therapeutic targets discovery. Study Study model Hi-C application Novel targets or site of detection Epigenetic mechanisms  Mak et al. (2020) African American children with asthma Identification of genetic variants associated with lung function (FEV1)  KITLG SCF Hi-C data and expression QTL analysis showed that the variant is associated with increased KITLG STAT3 IRF1 KITLG  Stuart et al. (2020) Asthma, cystic fibrosis (CF), COPD, and idiopathic pulmonary fibrosis (IPF) loci Integration of Hi-C, ChIP-seq, and eQTL to predict non-coding region functions SNPs in regions 19q13, 17q21, and 11p15 Hi-C predicted that these non-coding regions interact with nearby genes and function as enhancers, with CRISPRi validating the regulatory role of some regions on gene expression  Joo et al. (2022) Minority children with asthma Identification of genetic variants associated with bronchodilator response (BDR)  rs35661809 LINC02220 Hi-C data showed long-range interactions between this region and the DNAH5 DNAH5  Washington et al. (2022) African American children and adults with asthma Identification of African-specific alleles associated with asthma susceptibility Nine novel variants in the 17q12-q21 region pcHi-C data narrowed the association to two candidate causal variants, which are associated with T2-low severe asthma traits  Morin et al. (2023) Nasal epithelial cells from children with allergic asthma Design of a custom array for high-value CpG sites CpG sites in the custom Asthma and Allergy array Hi-C data identified CpG sites associated with gene expression, revealing epigenetic regulatory mechanisms in allergic asthma  Granell et al. (2023) GWAS of childhood wheezing phenotypes Identification of genetic loci associated with persistent wheezing  ANXA1 Promoter capture Hi-C data identified rs75260654 ANXA1  Guo et al. (2024) Human lung epithelial cells Identification of distal enhancers regulating HHIP Distal enhancer in the 4q31 region Hi-C data revealed chromatin interactions between this enhancer and the HHIP HHIP  Ji et al. (2020) Integration of lung cancer cell lines and GWAS data Identification of lung cancer susceptibility loci 1q21.1 (rs17160062), 2p23.3 (rs670343), 2p15 (rs9309336), 17q21.2 (rs9252) Affected transcription factor binding sites (e.g., FOXP1), regulating lung cancer-related gene expression (e.g., PUS10 CHD1L  Wu et al. (2020) Lung cancer samples and cell lines Analysis of enhancer transcriptional activity  LcsMYC-1 Enrichment of transcription factor binding sites (e.g., JUNB Hand1-Tcf3 GATA4  Li et al. (2021) Lung cancer clinical samples (paired tumor and normal cells) Analysis of 3D genome structural changes Copy number variations (CNVs) and point mutations 3D genome structure affects gene expression by altering regulatory chromatin structures  Guo et al. (2021) Small cell lung cancer (SCLC) cell lines Identification of dysregulated genes associated with TAD boundary changes >100 candidate genes (24 validated by NanoString) Chromatin structural changes at the A/B compartment and TAD boundary levels lead to gene dysregulation  Fan et al. (2022) Cancer cells with high PD-L1 and PD-L2 expression Revealing the regulatory mechanisms of PD-L1/PD-L2 New TAD in the chr9: 5,400,000-5,600,000 region Transcription factors (e.g., STAT3 IRF1  Adeel et al. (2022) Lung cancer (A549), chronic myeloid leukemia (K562), and acute monocytic leukemia (THP-1) cell lines Detection of chromosomal translocations Translocation sites consistent with WGS validation 3D genome structural changes impact gene expression and cancer mechanisms  Song et al. (2023) Non-smoking lung adenocarcinoma (LUAD) tumors and paired normal tissues Analysis of chromatin structural changes 216 tumor-specific TADs, 41 enhancer-promoter loops A/B compartment switching (A→B), with key genes (e.g., NCEH1 MB21D2 SYT16 Hi-C technology allows for the comprehensive mapping of chromosomal interactions, revealing how different regions of the genome communicate with one another. This spatial perspective provides insights into gene regulation that linear sequencing cannot offer. For instance, in the context of pulmonary diseases, Hi-C can uncover interactions between regulatory elements, like enhancers and their target genes, which may be pivotal in the pathogenesis of diseases such as asthma, where inflammatory gene expression is tightly controlled by these interactions. The application of Hi-C in pulmonary disease research starts with the identification of regions of interest that are associated with disease phenotypes. For instance, researchers can compare Hi-C data from lung tissues of healthy individuals against those from patients with COPD or lung cancer. This comparative approach facilitates the identification of disrupted chromatin interactions that may contribute to aberrant gene expression profiles. Once potential target regions are identified through Hi-C analysis, researchers can prioritize them for further functional validation. This expeditious workflow is particularly advantageous in the context of lung cancer, where traditional methods of target identification can be both time-consuming and costly. By leveraging the spatial data provided by Hi-C, researchers can focus their efforts on specific interactions that are likely to drive disease, thus streamlining the drug discovery process. Recent studies have demonstrated the utility of Hi-C in identifying therapeutic targets in pulmonary disease. For example, in lung cancer, researchers have mapped chromatin interactions in cancerous versus Cigrang et al., 2025 He et al., 2024 Mak et al., 2020 Granell et al., 2023 Lan et al., 2012 Wu et al., 2020 Moreover, integrating Hi-C with epigenomics, such as DNA methylation and histone modification profiling, can uncover the regulatory mechanisms driving pulmonary diseases. This multi-dimensional approach enables a more comprehensive understanding of the interplay between genomic architecture and gene regulation. While the application of Hi-C in the rapid identification of therapeutic targets in pulmonary diseases is promising, there are challenges to consider. One limitation is the resolution of Hi-C data, which, although significantly improved, may still obscure interactions occurring at small genomic distances ( Rao et al., 2014 Jin et al., 2013 Additionally, the complexity of pulmonary diseases means that a one-size-fits-all approach may not be feasible. Personalized medicine, which tailors treatments based on individual genomic and environmental profiles, will benefit significantly from Hi-C and complementing technologies. In summary, Hi-C technology represents a powerful tool for rapidly identifying therapeutic targets in pulmonary disease by elucidating the 3D structure of the genome and its impact on gene regulation. By leveraging insights gained from chromatin interactions, researchers can streamline the target identification process, paving the way for novel therapeutic developments. As the field continues to evolve, the integration of Hi-C with other genomic technologies will undoubtedly enhance our understanding of pulmonary diseases and the complex mechanisms underlying their pathogenesis, ultimately contributing to more effective treatments and improved patient outcomes. Author contributions BY: Writing – original draft. QZ: Writing – review and editing. GL: Investigation, Writing – review and editing. BL: Investigation, Writing – review and editing. ZL: Writing – review and editing, Funding acquisition. HH: Writing – review and editing. Conflict of interest Author BY was employed by Zhengda Tianqing Pharmaceutical Group Co., LTD. The remaining authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Adeel M. M. Rehman K. Zhang Y. Arega Y. Li G. 2022 Chromosomal translocations detection in cancer cells using chromosomal conformation capture data Genes (Basel) 13 1170 10.3390/genes13071170 35885953 PMC9319866 Beagrie R. A. Scialdone A. Schueler M. Kraemer D. C. A. Chotalia M. Xie S. Q. 2017 Complex multi-enhancer contacts captured by genome architecture mapping Nature 543 519 524 10.1038/nature21411 28273065 PMC5366070 Casas-Recasens S. Cassim R. Mendoza N. Agusti A. Lodge C. Li S. 2024 Epigenome-wide association studies of chronic obstructive pulmonary disease and lung function: a systematic review Am. J. Respir. Crit. Care Med. 210 766 778 10.1164/rccm.202302-0231OC 38422471 Christenson S. A. Smith B. M. Bafadhel M. Putcha N. 2022 Chronic obstructive pulmonary disease Lancet. 399 2227 2242 10.1016/S0140-6736(22)00470-6 35533707 Cigrang M. Obid J. Nogaret M. Seno L. Ye T. Davidson G. 2025 Pan-inhibition of super-enhancer-driven oncogenic transcription by next-generation synthetic ecteinascidins yields potent anti-cancer activity Nat. Commun. 16 512 10.1038/s41467-024-55667-z 39779693 PMC11711318 Dekker J. Rippe K. Dekker M. Kleckner N. 2002 Capturing chromosome conformation Science. 295 1306 1311 10.1126/science.1067799 11847345 Fan Z. Wu C. Chen M. Jiang Y. Wu Y. Mao R. 2022 The generation of PD-L1 and PD-L2 in cancer cells: from nuclear chromatin reorganization to extracellular presentation Acta Pharm. Sin. B 12 1041 1053 10.1016/j.apsb.2021.09.010 35530130 PMC9069407 Feng Y. Huang W. Paul C. Liu X. Sadayappan S. Wang Y. 2021 Mitochondrial nucleoid in cardiac homeostasis: bidirectional signaling of mitochondria and nucleus in cardiac diseases Basic Res. Cardiol. 116 49 10.1007/s00395-021-00889-1 34392401 PMC8364536 Gao Q. Zhu H. Dong L. Shi W. Chen R. Song Z. 2019 Integrated proteogenomic characterization of HBV-related Hepatocellular Carcinoma Cell 179 1240 10.1016/j.cell.2019.10.038 31730861 Goodwin S. McPherson J. D. McCombie W. R. 2016 Coming of age: ten years of next-generation sequencing technologies Nat. Rev. Genet. 17 333 351 10.1038/nrg.2016.49 27184599 PMC10373632 Granell R. Curtin J. A. Haider S. Kitaba N. T. Mathie S. A. Gregory L. G. 2023 A meta-analysis of genome-wide association studies of childhood wheezing phenotypes identifies ANXA1 as a susceptibility locus for persistent wheezing Elife 12 e84315 10.7554/eLife.84315 37227431 PMC10292845 Gridina M. Taskina A. Lagunov T. Nurislamov A. Kulikova T. Krasikova A. 2022 Comparison and critical assessment of single-cell Hi-C protocols Heliyon 8 e11023 10.1016/j.heliyon.2022.e11023 36281413 PMC9587272 Guo D. Xie Q. Jiang S. Xie T. Li Y. Huang X. 2021 Synergistic alterations in the multilevel chromatin structure anchor dysregulated genes in small cell lung cancer Comput. Struct. Biotechnol. J. 19 5946 5959 10.1016/j.csbj.2021.11.003 34849199 PMC8604672 Guo F. Zhang L. Yu Y. Gong L. Tao S. Werder R. B. 2024 Identification of a distal enhancer regulating hedgehog interacting protein gene in human lung epithelial cells EBioMedicine 101 105026 10.1016/j.ebiom.2024.105026 38417378 PMC10944180 He Y. Li H. Ju X. Gong B. 2024 Developing pioneering pharmacological strategies with CRISPR/Cas9 library screening to overcome cancer drug resistance Biochim. Biophys. Acta Rev. Cancer 1879 189212 10.1016/j.bbcan.2024.189212 39521293 Ji P. Ding D. Qin N. Wang C. Zhu M. Li Y. 2020 Systematic analyses of genetic variants in chromatin interaction regions identified four novel lung cancer susceptibility loci J. Cancer 11 1075 1081 10.7150/jca.35127 31956354 PMC6959073 Jiang L. Quail M. A. Fraser-Govil J. Wang H. Shi X. Oliver K. 2024 The Bioinformatic applications of Hi-C and linked reads Genomics Proteomics Bioinforma. 22 qzae048 10.1093/gpbjnl/qzae048 38905513 PMC11580686 Jin F. Li Y. Dixon J. R. Selvaraj S. Ye Z. Lee A. Y. 2013 A high-resolution map of the three-dimensional chromatin interactome in human cells Nature 503 290 294 10.1038/nature12644 24141950 PMC3838900 Joo J. Mak A. C. Y. Xiao S. Sleiman P. M. Hu D. Huntsman S. 2022 Genome-wide association study in minority children with asthma implicates DNAH5 in bronchodilator responsiveness Sci. Rep. 12 12514 10.1038/s41598-022-16488-6 35869121 PMC9307508 Jurkowska R. Z. 2024 Role of epigenetic mechanisms in the pathogenesis of chronic respiratory diseases and response to inhaled exposures: from basic concepts to clinical applications Pharmacol. Ther. 264 108732 10.1016/j.pharmthera.2024.108732 39426605 Kempfer R. Pombo A. 2020 Methods for mapping 3D chromosome architecture Nat. Rev. Genet. 21 207 226 10.1038/s41576-019-0195-2 31848476 Klibaner-Schiff E. Simonin E. M. Akdis C. A. Cheong A. Johnson M. M. Karagas M. R. 2024 Environmental exposures influence multigenerational epigenetic transmission Clin. Epigenetics 16 145 10.1186/s13148-024-01762-3 39420431 PMC11487774 Kukat C. Davies K. M. Wurm C. A. Spåhr H. Bonekamp N. A. Kühl I. 2015 Cross-strand binding of TFAM to a single mtDNA molecule forms the mitochondrial nucleoid Proc. Natl. Acad. Sci. U. S. A. 112 11288 11293 10.1073/pnas.1512131112 26305956 PMC4568684 Lan X. Witt H. Katsumura K. Ye Z. Wang Q. Bresnick E. H. 2012 Integration of Hi-C and ChIP-seq data reveals distinct types of chromatin linkages Nucleic Acids Res. 40 7690 7704 10.1093/nar/gks501 22675074 PMC3439894 Li T. Li R. Dong X. Shi L. Lin M. Peng T. 2021 Integrative analysis of genome, 3D genome, and transcriptome alterations of clinical lung cancer samples Genomics Proteomics Bioinforma. 19 741 753 10.1016/j.gpb.2020.05.007 34116262 PMC9170781 Li W. Lu J. Lu P. Gao Y. Bai Y. Chen K. 2023 scNanoHi-C: a single-cell long-read concatemer sequencing method to reveal high-order chromatin structures within individual cells Nat. Methods 20 1493 1505 10.1038/s41592-023-01978-w 37640936 Lin D. Hong P. Zhang S. Xu W. Jamal M. Yan K. 2018 Digestion-ligation-only Hi-C is an efficient and cost-effective method for chromosome conformation capture Nat. Genet. 50 754 763 10.1038/s41588-018-0111-2 29700467 Liu Q. Zhang J. Guo C. Wang M. Wang C. Yan Y. 2024 Proteogenomic characterization of small cell lung cancer identifies biological insights and subtype-specific therapeutic strategies Cell 187 184 203.e28 10.1016/j.cell.2023.12.004 38181741 Mak A. C. Y. Sajuthi S. Joo J. Xiao S. Sleiman P. M. White M. J. 2020 Lung function in African American children with asthma is associated with novel regulatory variants of the KIT ligand KITLG/SCF and gene-by-air-pollution interaction Genetics 215 869 886 10.1534/genetics.120.303231 32327564 PMC7337089 Martin P. McGovern A. Orozco G. Duffus K. Yarwood A. Schoenfelder S. 2015 Capture Hi-C reveals novel candidate genes and complex long-range interactions with related autoimmune risk loci Nat. Commun. 6 10069 10.1038/ncomms10069 26616563 PMC4674669 Martino D. J. Bui D. S. Li S. Idrose S. Perret J. Lowe A. J. 2023 Genetic and epigenetic associations with Pre-chronic obstructive pulmonary disease lung function Trajectories Am. J. Respir. Crit. Care Med. 208 1135 1137 10.1164/rccm.202306-1025LE 37610423 Morin A. Thompson E. E. Helling B. A. Shorey-Kendrick L. E. Faber P. Gebretsadik T. 2023 A functional genomics pipeline to identify high-value asthma and allergy CpGs in the human methylome J. Allergy Clin. Immunol. 151 1609 1621 10.1016/j.jaci.2022.12.828 36754293 PMC10859971 Mumbach M. R. Rubin A. J. Flynn R. A. Dai C. Khavari P. A. Greenleaf W. J. 2016 HiChIP: efficient and sensitive analysis of protein-directed genome architecture Nat. Methods 13 919 922 10.1038/nmeth.3999 27643841 PMC5501173 Orlando G. Law P. J. Cornish A. J. Dobbins S. E. Chubb D. Broderick P. 2018 Promoter capture Hi-C-based identification of recurrent noncoding mutations in colorectal cancer Nat. Genet. 50 1375 1380 10.1038/s41588-018-0211-z 30224643 PMC6380472 Papi A. Brightling C. Pedersen S. E. Reddel H. K. 2018 Asthma Lancet. 391 783 800 10.1016/S0140-6736(17)33311-1 29273246 Quinodoz S. A. Ollikainen N. Tabak B. Palla A. Schmidt J. M. Detmar E. 2018 Higher-order Inter-chromosomal Hubs Shape 3D genome organization in the nucleus Cell 174 744 757 10.1016/j.cell.2018.05.024 29887377 PMC6548320 Rabe K. F. Watz H. 2017 Chronic obstructive pulmonary disease Lancet. 389 1931 1940 10.1016/S0140-6736(17)31222-9 28513453 Ramsahai J. M. Hansbro P. M. Wark P. A. B. 2019 Mechanisms and management of asthma exacerbations Am. J. Respir. Crit. Care Med. 199 423 432 10.1164/rccm.201810-1931CI 30562041 Rao S. S. P. Huntley M. H. Durand N. C. Stamenova E. K. Bochkov I. D. Robinson J. T. 2014 A 3D map of the human genome at kilobase resolution reveals principles of chromatin looping Cell 159 1665 1680 10.1016/j.cell.2014.11.021 25497547 PMC5635824 Ritzmann F. Brand M. Bals R. Wegmann M. Beisswenger C. 2025 Role of epigenetics in chronic lung disease Cells 14 251 10.3390/cells14040251 39996724 PMC11853132 Shendure J. Balasubramanian S. Church G. M. Gilbert W. Rogers J. Schloss J. A. 2017 DNA sequencing at 40: past, present and future Nature 550 345 353 10.1038/nature24286 29019985 Shaw D. E. Heaney L. G. Thomas M. Beasley R. Gibson P. G. Pavord I. D. 2021 Balancing the needs of the many and the few: where next for adult asthma guidelines? Lancet Respir. Med. 9 786 794 10.1016/S2213-2600(21)00021-7 33639099 Šimková H. Câmara A. S. Mascher M. 2024 Hi-C techniques: from genome assemblies to transcription regulation J. Exp. Bot. 75 5357 5365 10.1093/jxb/erae085 38430521 Song T. Yao M. Yang Y. Liu Z. Zhang L. Li W. 2023 Integrative identification by Hi-C revealed distinct advanced structural variations in lung Adenocarcinoma tissue Phenomics 3 390 407 10.1007/s43657-023-00103-3 37589026 PMC10425312 Stuart W. D. Guo M. Fink-Baldauf I. M. Coleman A. M. Clancy J. P. Mall M. A. 2020 CRISPRi-mediated functional analysis of lung disease-associated loci at non-coding regions Nar. Genom Bioinform 2 lqaa036 10.1093/nargab/lqaa036 32500120 PMC7252574 Tan L. Xing D. Chang C.-H. Li H. Xie X. S. 2018 Three-dimensional genome structures of single diploid human cells Science 361 924 928 10.1126/science.aat5641 30166492 PMC6360088 Thai A. A. Solomon B. J. Sequist L. V. Gainor J. F. Heist R. S. 2021 Lung cancer Lancet 398 535 554 10.1016/S0140-6736(21)00312-3 34273294 van Berkum N. L. Lieberman-Aiden E. Williams L. Imakaev M. Gnirke A. Mirny L. A. 2010 Hi-C: a method to study the three-dimensional architecture of genomes J. Vis. Exp. 1869 10.3791/1869 20461051 PMC3149993 Wang R. Li Y. Jiang Y. Liu X. Feng H. Jiao Z. 2025 Interaction study of the effects of environmental exposure and gene polymorphisms of inflammatory and immune-active factors on chronic obstructive pulmonary disease Respir. Res. 26 5 10.1186/s12931-024-03079-4 39780163 PMC11707857 Washington C. Dapas M. Biddanda A. Magnaye K. M. Aneas I. Helling B. A. 2022 African-specific alleles modify risk for asthma at the 17q12-q21 locus in African Americans Genome Med. 14 112 10.1186/s13073-022-01114-x 36175932 PMC9520885 Wu Y. Yang Y. Gu H. Tao B. Zhang E. Wei J. 2020 Multi-omics analysis reveals the functional transcription and potential translation of enhancers Int. J. Cancer 147 2210 2224 10.1002/ijc.33132 32573785 Yang I. A. Jenkins C. R. Salvi S. S. 2022 Chronic obstructive pulmonary disease in never-smokers: risk factors, pathogenesis, and implications for prevention and treatment Lancet Respir. Med. 10 497 511 10.1016/S2213-2600(21)00506-3 35427530 Yoon I. Kim U. Jung K. O. Song Y. Park T. Lee D.-S. 2024 3C methods in cancer research: recent advances and future prospects Exp. Mol. Med. 56 788 798 10.1038/s12276-024-01236-9 38658701 PMC11059347 Zhang F. Cui Y. Zhang T. Yin W. 2024 Epigenetic regulation of macrophage activation in chronic obstructive pulmonary disease Front. Immunol. 15 1445372 10.3389/fimmu.2024.1445372 39206196 PMC11349576 ",
  "metadata": {
    "Title of this paper": "Epigenetic regulation of macrophage activation in chronic obstructive pulmonary disease",
    "Journal it was published in:": "Frontiers in Cell and Developmental Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488709/"
  }
}