{
  "title": "Paper_379",
  "abstract": "J Phys Act Health J Phys Act Health 319 nihpa Journal of physical activity & health 1543-3080 1543-5474 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12486770 PMC12486770.1 12486770 12486770 NIHMS2109067 31553947 10.1123/jpah.2018-0220 NIHMS2109067 NIHPA2109067 1 Article The Association of Cardiorespiratory Fitness and Ideal Cardiovascular Health in the Aerobics Center Longitudinal Study Ross Leanna M. Department of Exercise Science, University of South Carolina, Columbia, SC, USA. Duke Molecular Physiology Institute, Duke University School of Medicine, Durham, NC, USA. Barber Jacob L. Department of Exercise Science, University of South Carolina, Columbia, SC, USA. McLain Alexander C. Department of Epidemiology and Biostatistics, University of South Carolina, Columbia, SC, USA. Weaver R. Glenn Department of Exercise Science, University of South Carolina, Columbia, SC, USA. Sui Xuemei Department of Exercise Science, University of South Carolina, Columbia, SC, USA. Blair Steven N. Department of Exercise Science, University of South Carolina, Columbia, SC, USA. Sarzynski Mark A. Department of Exercise Science, University of South Carolina, Columbia, SC, USA. L.M.R. and J.L.B. are equal first authors. Sarzynski ( sarz@mailbox.sc.edu 01 11 2019 24 9 2019 16 11 498036 968 975 17 09 2025 01 10 2025 02 10 2025 02 10 2025 Background: This study examined the cross-sectional and longitudinal associations of cardiorespiratory fitness (CRF) and ideal cardiovascular health (CVH). Methods: CRF and the 7 CVH components were measured in 11,590 (8865 males; 2725 females) adults at baseline and in 2532 (2160 males; 372 females) adults with at least one follow-up examination from the Aerobics Center Longitudinal Study. Ideal CVH score was calculated as a composite of 7 measures, each scored 0 to 2. CVH groups were based on participant point score: ≤7 (poor), 8 to 11 (intermediate), and 12 to 14 (ideal). Analyses included general linear, logistic regression, and linear mixed models. Results: At baseline, participants in the high CRF category had 21% and 45% higher mean CVH scores than those in the moderate and poor CRF categories ( P P P Conclusions: Higher CRF is associated with better CVH profiles, and improving CRF over time is independently associated with greater improvements in CVH. public health epidemiology health behavior physical activity nutrition obesity pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "The Association of Cardiorespiratory Fitness and Ideal Cardiovascular Health in the Aerobics Center Longitudinal Study",
    "Journal it was published in:": "Journal of physical activity & health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486770/"
  }
}