{
  "title": "Paper_1042",
  "abstract": "pmc Respir Med Case Rep Respir Med Case Rep 2304 rmcr Respiratory Medicine Case Reports 2213-0071 Elsevier PMC12475407 PMC12475407.1 12475407 12475407 41018725 10.1016/j.rmcr.2025.102293 S2213-0071(25)00129-7 102293 1 Case Report Endobronchial ultrasound-guided transbronchial cryobiopsy through a working channel potentially improving safety and efficacy Suzuki Mikito mikito.suzuki.a@gmail.com ⁎ Yano Kaito Imoto Tomohiro Shimizu Reiko Nakagawa Kazuo Department of Thoracic Surgery, Tokyo Metropolitan Cancer and Infectious Diseases Center Komagome Hospital, 3-18-22 Honkomagome, Bunkyo-ku, Tokyo, 113-8677, Japan ⁎ mikito.suzuki.a@gmail.com 2025 15 9 2025 58 497695 102293 19 8 2025 13 9 2025 13 9 2025 15 09 2025 28 09 2025 29 09 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article under the CC BY-NC license (http://creativecommons.org/licenses/by-nc/4.0/). Endobronchial ultrasound (EBUS)-guided transbronchial cryobiopsy (TBCB) is a novel method for the biopsy of hilar and mediastinal lesions. Conventional cryobiopsy requires simultaneous removal of the cryoprobe and EBUS scope from the airway, resulting in delayed observation of the biopsy site and application of hemostasis, which may lead to an increased risk of complications, especially bleeding. Moreover, during repeated passes of the cryoprobe, re-identification of the lesion is time-consuming. We developed a novel method for direct collection through a working channel during EBUS-TBCB. We performed the procedure under local anesthesia without intubation. After EBUS-transbronchial needle aspiration, the cryoprobe was introduced into the target lesion through the puncture tract for real-time EBUS visualization. A freezing time of up to 4 s allowed the cryobiopsy specimens to pass through the working channel. Retaining the EBUS scope within the airway allowed immediate observation of the biopsy site, and to immediately suction and apply hemostasis using an EBUS balloon, which led to safer cryobiopsy even without intubation. The next cryopass could then be performed. In our two representative cases, we made a definite diagnosis with three and four cryobiopsy specimens, with procedure lengths of 2.2 and 3.0 min, respectively. Only mild bleeding was observed in both cases. Highlights • EBUS-TBCB is a novel biopsy method for hilar and mediastinal lesions. • The conventional method needs simultaneous removal of the cryoprobe and EBUS scope. • We developed a novel technique of direct collection through a working channel. • We perform EBUS-TBCB with a freezing time up to 4 s without removal of the scope. • This technique allows a safe and prompt EBUS-TBCB procedure. Keywords Direct collection through working channel Endobronchial ultrasound-guided intranodal forceps biopsy Endobronchial ultrasound-guided transbronchial cryobiopsy Endobronchial ultrasound-guided transbronchial needle aspiration pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations CT computed tomography DC direct collection EBUS-IFB endobronchial ultrasound-guided intranodal forceps biopsy EBUS-TBCB endobronchial ultrasound-guided transbronchial cryobiopsy EBUS-TBNA endobronchial ultrasound-guided transbronchial needle aspiration LN lymph node Handling Editor: DR AC Amit Chopra 1 Introduction Recently, endobronchial ultrasound (EBUS)-guided transbronchial cryobiopsy (TBCB) was developed as an advanced technique for EBUS-transbronchial needle aspiration (TBNA) and intranodal forceps biopsy (IFB) [ [1] [2] [3] [4] [5] [6] [7] 6 6 7 4 6 In contrast, unlike EBUS-TBNA and IFB, conventional EBUS-TBCB requires simultaneous rapid removal of the cryoprobe along with the EBUS scope for specimen collection and subsequent bronchoscope reinsertion to assess bleeding and other complications [ [1] [2] [3] [4] [5] [6] Recently, in transbronchial lung cryobiopsy (TBLC) for peripheral pulmonary lesions, the effectiveness of non-intubated cryobiopsy has been reported [ 8 2 Case presentation  Case 1 A 68-year-old man was diagnosed with bilateral hilar and mediastinal lymphadenopathy using chest radiography and computed tomography (CT) ( Fig. 1 Fig. 1 Case 1 Fig. 1 The patient received intravenous midazolam and fentanyl for sedation and analgesia, respectively. We approached the station 4R LN using a EBUS scope (UC-260FW; Olympus, Tokyo, Japan). Lidocaine 2 % was administered to the airways through a working channel. Swelling at the station 4R LN was evaluated using EBUS, and three passes of TBNA were performed using a 22-gauge needle (NA-U401SX, Olympus, Japan). This procedure also created an airway tract for EBUS-IFB and TBCB. Subsequently, EBUS-IFB was performed three times using 1.2-mm miniforceps (CoreDx, Boston Scientific, Boston, MA, USA), followed by the DC method of EBUS-TBCB ( Fig. 1 Fig. 2 Fig. 1 Fig. 2 Direct collection through the working channel in EBUS-TBCB. After removal of the biopsy valve, the 1.1-mm cryoprobe passes through the working channel, and enters the target lesion via an airway tract created by the EBUS needle. After cooling, the cryoprobe is immediately retrieved though the working channel. EBUS-TBCB, endobronchial ultrasound-guided transbronchial cryobiopsy. Fig. 2 On pathological examination, granulomas with clusters of histiocytes without necrosis were observed in all EBUS-TBNA, IFB, and TBCB specimens, suggesting a diagnosis of sarcoidosis ( Fig. 1 2 Case 2 An 81-year-old male with a history of heavy smoking complained of difficulty swallowing. He had undergone colectomy for stage III colon cancer seven months prior and was subsequently lost to follow-up. CT revealed a mediastinal tumor extending to the left hilum and compressing the esophagus and left main bronchus, with no other abnormal findings ( Fig. 3 case 1 Fig. 3 Fig. 3 Case 2 Fig. 3 On pathological examination, atypical cells with increased chromatin and irregular nuclei were observed proliferating and forming glandular structures; consistent with poorly differentiated adenocarcinoma ( Fig. 3 2 3 Discussion This report describes two representative cases in which non-intubated EBUS-TBCB was performed using the DC method. EBUS-TBCB is a novel transbronchial biopsy method for hilar and mediastinal lesions [ [1] [2] [3] [4] [5] [6] [1] [2] [3] [4] [5] [6] case 1 case 2 Conventional EBUS-TBCB is performed by simultaneously retrieving the EBUS scope and cryoprobe [ [1] [2] [3] [4] [5] [6] Our DC method is similar to that of EBUS-IFB. EBUS-IFB and TBCB require insertion of the forceps and cryoprobe through the small airway tract created by the TBNA needle or high-frequency needle-knife [ [1] [2] [3] [4] [5] [6] [7] [9] [10] [11] 9 12 1 2 Case 1 Case 2 Cryobiopsy allows for sample size adjustment based on freezing time. Most previous prospective studies on conventional EBUS-TBCB have set freezing times at 3–7 s [ [1] [2] [3] [4] 12 8 2 2 4 11 Bleeding is a critical problem with cryobiopsy. The major bleeding rate in TBLC (16.2 %) was significantly higher than that with forceps biopsy (4.2 %) [ 13 [1] [2] [3] [4] [5] [6] 1 3 14 5 4 Conclusion  • We developed a novel method for direct collection through a working channel in an EBUS-TBCB with 1.1-mm ultrathin cryoprobe. • We have performed non-intubated cryobiopsy with a freezing time up to 4 s without removal of the scope, allowing a safe and prompt procedure. • A prospective trial to assess the diagnostic yield, complication rate, procedure time, and cost-effectiveness of EBUS-IFB and conventional TBCB is necessary to further demonstrate that the DC method is an effective and safe procedure for EBUS-TBCB. CRediT authorship contribution statement Mikito Suzuki: Kaito Yano: Tomohiro Imoto: Reiko Shimizu: Kazuo Nakagawa: Formatting of funding sources This study did not receive any specific grants from funding agencies in the public, commercial, or not-for-profit sectors. Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Zhang J. Guo J.R. Huang Z.S. Fu W.L. Transbronchial mediastinal cryobiopsy in the diagnosis of mediastinal lesions: a randomised trial Eur. Respir. J. 58 2021 2100055 10.1183/13993003.00055-2021 33958432 2 Ariza-Prota M. Pérez-Pallarés J. Fernández-Fernández A. Endobronchial ultrasound-guided transbronchial mediastinal cryobiopsy in the diagnosis of mediastinal lesions: safety, feasibility and diagnostic yield - experience in 50 cases ERJ. Open. Res. 9 2023 448 2022 10.1183/23120541.00448-2022 PMC10107076 37077551 3 Fan Y. Zhang A.M. Wu X.L. Transbronchial needle aspiration combined with cryobiopsy in the diagnosis of mediastinal diseases: a multicentre, open-label, randomised trial Lancet Respir. Med. 11 2023 256 264 10.1016/S2213-2600(22)00392-7 36279880 4 Cheng T.L. Huang Z.S. Zhang J. Comparison of cryobiopsy and forceps biopsy for the diagnosis of mediastinal lesions: A randomised clinical trial Pulmonology 30 2024 466 474 10.1016/j.pulmoe.2023.12.002 38182469 5 Romero A.O. Kho S.S. Transbronchial mediastinal cryobiopsy—literature review and practice recommendations AME. Med. J. 9 2024 35 10.21037/amj-23-120 6 Chalhoub M. Joseph B. Acharya S. A review of endobronchial-ultrasound-guided transbronchial intranodal forceps biopsy and cryobiopsy Diagnostics 14 2024 965 10.3390/diagnostics14090965 38732379 PMC11083244 7 Agrawal A. Ghori U. Chaddha U. Combined EBUS-IFB and EBUS-TBNA vs EBUS-TBNA alone for intrathoracic adenopathy: a meta-analysis Ann. Thorac. Surg. 114 2022 340 348 10.1016/j.athoracsur.2020.12.049 33485918 8 Nakai T. Watanabe T. Kaimi Y. Diagnostic utility and safety of non-intubated cryobiopsy technique using a novel ultrathin cryoprobe in addition to conventional biopsy techniques for peripheral pulmonary lesions Respiration 102 2023 503 514 10.1159/000531010 37379810 9 Rüber F. Wiederkehr G. Steinack C. Endobronchial ultrasound-guided transbronchial forceps biopsy: a retrospective bicentric study using the Olympus 1.5 mm mini-forceps J. Clin. Med. 11 2022 4700 10.3390/jcm11164700 36012940 PMC9410050 10 Konno-Yamamoto A. Matsumoto Y. Imabayashi T. Feasibility of modified endobronchial ultrasound-guided intranodal forceps biopsy: a retrospective analysis Respiration 102 2023 143 153 10.1159/000528644 36543151 11 Nakai T. Matsumoto Y. Ueda T. Comparison of the specimen quality of endobronchial ultrasound-guided intranodal forceps biopsy using standard-sized forceps versus mini forceps for lung cancer: a prospective study Respirology 29 2024 396 404 10.1111/resp.14659 38246887 12 Kho S.S. Tan S.H. Soo C.I. An explorative analysis on the optimal cryo-passes and freezing time of the ultrathin cryoprobe in endobronchial ultrasound-guided transbronchial mediastinal cryobiopsy Sci. Rep. 14 2024 18653 10.1038/s41598-024-69702-y PMC11319585 39134712 13 Hetzel J. Eberhardt R. Petermann C. Bleeding risk of transbronchial cryobiopsy compared to transbronchial forceps biopsy in interstitial lung disease - a prospective, randomized, multicentre cross-over trial Respir. Res. 20 2019 140 10.1186/s12931-019-1091-1 31277659 PMC6612220 14 Du Rand I.A. Blaikley J. Booton R. British Thoracic Society guideline for diagnostic flexible bronchoscopy in adults: accredited by NICE Thorax 68 Suppl 1 2013 i1 i44 10.1136/thoraxjnl-2013-203618 23860341 Acknowledgement None. ",
  "metadata": {
    "Title of this paper": "British Thoracic Society guideline for diagnostic flexible bronchoscopy in adults: accredited by NICE",
    "Journal it was published in:": "Respiratory Medicine Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475407/"
  }
}