{
  "title": "Paper_443",
  "abstract": "pmc Haematologica Haematologica 820 haematol HAEMA Haematologica 0390-6078 1592-8721 Ferrata Storti Foundation PMC12485351 PMC12485351.1 12485351 12485351 40400463 10.3324/haematol.2025.287685 1 Article - Hemostasis The pivotal role of von Willebrand factor binding to platelet αIIbβ3 in stabilizing the formation of a platelet plug at sites of injury Shi Qizhen  1-4 Mattson Jeremy G.  1 Morateck Patricia A.  1 Christopherson Pamela A.  1 Schroeder Jocelyn A.  1-4 Fahs Scot A.  1 Rapten Jessica  1 Schulte Marie L.  1 Weiler Hartmut  1  2 Zhu Jieqing  1  2 Haberichter Sandra L.  1  2 Flood Veronica H.  1-4 Montgomery Robert R.  1  2 Contributions QS designed experiments, analyzed data, and wrote the manuscript. JGM, PAM, PAC, JAS and SAF designed and performed experiments, analyzed data, and edited the manuscript. JR maintained mouse colonies and performed genotyping. MLS helped with the laser injury model study. JZ provided critical reagents and edited the manuscript. HW helped to generate VWF-RGES mouse model. SLH helped in designing research. VHF helped in designing research and edited the manuscript. RRM designed and supervised research, and edited the manuscript. 1 2 3 Children’s Research Institute 4 USA Q. Shi qshi@versiti.org  Disclosures  No conflicts of interest to disclose. 22 5 2025 01 10 2025 110 10 498052 2343 2355 26 2 2025 09 5 2025 22 05 2025 02 10 2025 02 10 2025 Copyright© 2025 Ferrata Storti Foundation https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution Noncommercial License ( by-nc 4.0 The interaction between von Willebrand factor (VWF) and platelet αIIbβ3 is thought to be essential for clot formation at injury sites, but its biological properties remain poorly understood due to the complexity and overlap with other αIIbβ3 ligands. Here, we developed a novel binding assay using a recombinant αIIbβ3 headpiece to evaluate VWF-αIIbβ3 binding in plasma from 441 Zimmerman Program participants. The VWF:αIIbβ3 to VWF:Ag ratio was significantly lower in patients with type-1, 2A, and 2B VWD than healthy controls. We identified five index cases with the p.R2464C variant in the VWF-C-domain, where affected family members displayed significantly reduced VWF:αIIbβ3/VWF:Ag ratios. To investigate the function of the VWF-αIIbβ3 interaction, we created a mouse model (VWF RGES/RGES RGES/RGES RGES Funding This work was supported by the National Heart, Lung, and Blood Institute, National Institutes of Health grants HL139847 (to RRM), HL081588 (to RRM), HL144457 (to RRM), HL112614 (to RRM), and HL102035 (to QS), and support from the Versiti Blood Research Foundation, the Children’s Hospital of Wisconsin Foundation (to QS), the Midwest Athletes Against Childhood Cancer and Bleeding Disorders Fund (to QS). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction von Willebrand factor (VWF) is a large multimeric glycoprotein that plays multiple roles in hemostasis and thrombosis. 1 IIb 3 2 3 IIb 3 4 5 IIb 3 6 IIb 3 IIb 3 7 IIb 3 8 IIb 3 9 , 10 IIb 3 IIb 3 11 IIb 3 12 13 In addition to these biochemical challenges, experimental systems often fail to capture the dynamic flow conditions under which VWF-α IIb 3 14 in vitro IIb 3 15 IIb 3 In vivo In this study, we developed a novel ELISA-based assay using recombinant α IIb 3 IIb 3 IIb 3 IIb 3 Methods The details of antibodies and reagents, as well as the methods and statistics used in this study, are provided in the Online Supplementary Appendix Patient populations and phenotype characterization A total of 441 subjects, including VWD index cases and healthy controls (HC), were initially analyzed from clinical hematology centers as part of the Zimmerman Program for the Molecular and Clinical Biology of VWD 16 Online Supplementary Appendix 17 18 19 VWF-α IIb 3 The biological function of VWF in binding to α IIb 3 IIb 3 IIb 3 20 Figure 1A IIb 3 Biotinylated anti-hVWF antibody AVW15 detected bound human VWF (hVWF). Two protocols determined mouse VW-F:α IIb 3 IIb 3 IIb 3 IIb 3 IIb 3 Generation of von Willebrand disease with RGES variant mouse models All animal studies were performed according to protocols approved by the Institutional Animal Care and Use Committee of the Medical College of Wisconsin. The change of VWF in vitro 21 22 RGES /+ RGES /RGES RGES /RGES /- 23 Δ5/γΔ5 24 -/- RGES/RGES γΔ5/γΔ5 RGES/RGES von Willebrand factor antigen and von Willebrand factor-collagen binding activity assays Mouse blood samples were collected and plasma was isolated as reported. 25 26 27-29 RGES /RGES Phenotypic assessments The functional phenotype in VWF-RGES mice was assessed by in vitro 30 32 In vivo 33 34 3 35 36 Results The competency of a novel functional VWF/α IIb 3 To evaluate the binding capacity of VWF to the α IIb 3 IIb 3 IIb 3 Figure 1A IIb 3 (Online Supplementary Figure S1). IIb 3 16 IIb 3 Table 1 Figure 1B IIb 3 IIb 3 Figure 1C 37 37 IIb 3 Figure 1D We then used the VWF:α IIb 3 IIb 3 IIb 3 38 Table 2 Figure 2A IIb 3 IIb 3 Figure 2A versus IIb 3 vs P Figure 2B vs P Figure 2C These data demonstrated that the functional VWF-α IIb 3 IIb 3 in vivo Establishing a VWF-RGES model To investigate the functional properties of the interaction between VWF and α IIb 3 Online Supplementary Figure S2A RGES Online Supplementary Figure S2B +/+ RGES/ RGES RGES/+ Online Supplementary Figure S2C Table 1. Comparison of the ratio of the von Willebrand factor’s α IIb 3 Table 2. The characteristics of family members with and without the p.R2464C variant in the Zimmerman Program. Figure 1. Developing the functional assay to assess von Willebrand factor binding to platelet IIb 3 integrin in human plasma from subjects with von Willebrand disease. IIb 3 IIb 3 3 IIb 3 IIb 3 IIb 3 IIb 3 IIb 3 IIb 3 IIb 3 IIb 3 IIb 3 IIb 3 To characterize VWF RGES 25 26 39 IIb 3 RGES/RGES RGES/+ +/+ Figure 3A RGES/RGES data not shown IIb 3 RGES/RGES RGES/+ +/+ Figure 3B IIb 3 RGES +/+ Online Supplementary Figure S3A-D RGES Figure 3C Online Supplementary Figure S3E IIb 3 RGES /- IIb 3 /- Figure 3D /- RGES/+ /- RGES/RGES /- /- RGES IIb 3 Figure 2. Using functional von Willebrand factor binding to platelet IIb 3 integrin activity assay to characterize von Willebrand disease subjects with the R2464C variant. IIb 3 IIb 3 IIb 3 IIb 3 IIb 3 IIb 3 P P P IIb 3 IIb 3 IIb 3 Assessment of the functional properties VWF-RGES in whole blood assays of VWF RGES To determine how VWF-RGES affects hemostatic properties in whole blood, we used native ROTEM 30 31 RGES/ +/+ RGES/+ (Online Supplementary Figures S4 S5). 27 γΔ5/γΔ5 RGES/RGES -/- RGES/RGES -/- -/- -/- /- -/- Online Supplementary Figure S6A, B). We tested the anti-GPIIb/IIIa antibody LeoH4, blocking the α IIb 3 -/- -/- Online Supplementary Figure S6C, D Together, these data demonstrate that even though the VWF-α IIb 3 Assessment of the in vivo RGES To investigate how RGES-VWF affects the bleeding phenotype in mice, we used five In vivo 33 22 34 3 40 35 RGES/RGES Figure 4A RGES/ RGES Figure 4C -/- RGES/RGES Figure 3. Characterization of von Willebrand factor and its functional binding activity to αIIbb3 in RGES variant von Willebrand factor model mice. RGES +/+ RGES/+ /- IIb 3 IIb 3 3 IIb 3 IIb 3 IIb 3 RGES/RGES IIb 3 IIb 3 RGES -/ IIb 3 IIb 3 -/ RGES /- +/+ +/ P IIb 3 In the TTT model, there were no significant differences in bleeding time and blood loss between the VWF RGES/RGES -/- RGES/RGES Figure 5A RGES/RGES RGES/RGES Figure 6B 3 RGES/RGES Figure 5C Together, these data demonstrate that the VWF-RGES variant does not result in prolonged bleeding times regardless of arterial or venous injury models in mice. However, VWF RGES/ RGES Figure 4. Assessment of the bleeding phenotype in RGES variant von Willebrand disease model mice using lateral tail vein transection injury model. RGES/RGES -/- P P P Assessment of the in vivo RGES We performed laser injury on cremaster arterioles to explore how the RGES variant of VWF affects clot stability. We quantified thrombus formation by measuring the fluorescence intensity of accumulated platelets and fibrin and monitored emboli downstream of the thrombus. The total fluorescence intensity of accumulated platelets in thrombi formed in the laser-injured cremaster arterioles was similar between the VWF RGES/RGES Figure 6A RGES/RGES Figure 6C RGES/ RGES Figure 5. Assessment of the bleeding phenotype in RGES variant von Willebrand disease model mice using tail tip transaction and FeCl3-induced carotid artery injury models. 2 -/- 3 P P 3 RGES Figure 6. Assessment of the bleeding and embolism phenotype in RGES variant von Willebrand disease model mice using the cremaster intravital laser injury model. RGES RGES RGES RGES RGES RGES RGES P In contrast, the accumulated platelets in the thrombi/clots formed in the cremaster laser injury model exhibited striking instability, with frequent fragmentation and embolization of thrombus material (platelet-plugs) observed downstream in VWF RGES/RGES Online Supplementary Videos RGES/RGES Figure 6G RGES/RGES 6 4 Figure 6I RGES/RGES P Figure 6J RGES/RGES IIb 3 Discussion In this study, we developed a novel ELISA-based assay using the recombinant α IIb 3 IIb 3 IIb 3 IIb 3 IIb 3 IIb 3 IIb 3 1 13 IIb 3 41 IIb 3 42 IIb 3 IIb 3 IIb 3 15 IIb 3 Using the recombinant α IIb 3 IIb 3 IIb 3 IIb 3 15 43 44 IIb 3 IIb 3 45 IIb 3 IIb 3 The clinical implication of this assay extends beyond diagnostics. It provides a framework for assessing the impact of variants in the C-domains, helping to refine genotype-phenotype correlations in VWD. This assay could also be valuable for personalized treatment strategies in clinical settings by identifying patients whose bleeding tendencies stem from impaired VWF-α IIb 3 44 46 IIb 3 We found that the ratio of VWF:α IIb 3 IIb 3 IIb 3 VWF IIb 3 IIb 3 IIb 3 VWF IIb 3 To rigorously investigate the functional properties of the VWF-α IIb 3 IIb 3 RGES IIb 3 IIb 3 Platelets play fundamental roles in hemostasis following all types of vessel injury, but they are more critical in arterial than venous environments. 47-49 RGES IIb 3 In vivo IIb 3 -/- 3 50 IIb 3 Our results also shed light on the redundant or complementary roles of fibrinogen and VWF in platelet aggregation and blood coagulation. Crossing the VWF variant mice onto a Fib -/- -/- -/- -/- RGES/RGES IIb 3 In conclusion, our study shows that VWF-α IIb 3 IIb 3 IIb 3 Supplementary Material Supplementary Appendix  Acknowledgments We thank Dr. Mathew Flick at the University of North Carolina at Chapel Hill for providing fibrinogen knockout and γΔ5 variant mice. We thank Dr. Peter Newman at the Versiti Blood Research Institute for providing HEK293F cells stably expressing murine IIb 3 . We thank the Zimmerman Program investigators and participating clinical hematology centers (see Online Supplementary Appendix). The authors thank the Versiti Blood Research Institute Shared Resources (RRID: SCR_025503) for their services, instrumentation, and specialist support. Data-sharing statement  The authors confirm that the data supporting the findings of this study are available within the article and/or its Online Supplementary Appendix. For additional information, please contact the corresponding author. References 1. Lenting PJ Denis CV Christophe OD Von Willebrand factor: how unique structural adaptations support and coordinate its complex function Blood 2024 144 21 2174 2184 38968155 10.1182/blood.2023023277 2. Bryckaert M Rosa JP Denis CV Lenting PJ Of von Willebrand factor and platelets Cell Mol Life Sci 2015 72 2 307 326 25297919 10.1007/s00018-014-1743-8 PMC4284388 3. Brill A Fuchs TA Chauhan AK von Willebrand factor-mediated platelet adhesion is critical for deep vein thrombosis in mouse models Blood 2011 117 4 1400 1407 20959603 10.1182/blood-2010-05-287623 PMC3056477 4. Reininger AJ Function of von Willebrand factor in haemostasis and thrombosis Haemophilia. 2008 14 Suppl 5 11 26 10.1111/j.1365-2516.2008.01848.x 18786007 5. Kasirer-Friede A Cozzi MR Mazzucato M De Marco L Ruggeri ZM Shattil SJ Signaling through GP Ib-IX-V activates alpha IIb beta 3 independently of other receptors Blood 2004 103 9 3403 3411 14726383 10.1182/blood-2003-10-3664 6. Reininger AJ Heijnen HF Schumann H Specht HM Schramm W Ruggeri ZM Mechanism of platelet adhesion to von Willebrand factor and microparticle formation under high shear stress Blood 2006 107 9 3537 3545 16449527 10.1182/blood-2005-02-0618 PMC1895770 7. Nesbitt WS Kulkarni S Giuliano S Distinct glycoprotein Ib/V/IX and integrin alpha IIbbeta 3-dependent calcium signals cooperatively regulate platelet adhesion under flow J Biol Chem 2002 277 4 2965 2972 11713259 10.1074/jbc.M110070200 8. Plow EF McEver RP Coller BS Woods VL Jr Marguerie GA Ginsberg MH Related binding mechanisms for fibrinogen, fibronectin, von Willebrand factor, and thrombospondin on thrombin-stimulated human platelets Blood 1985 66 3 724 727 3875376 9. Schullek J Jordan J Montgomery RR Interaction of von Willebrand factor with human platelets in the plasma milieu J Clin Invest 1984 73 2 421 428 6230372 10.1172/JCI111228 PMC425033 10. Nachman RL Leung LL Complex formation of platelet membrane glycoproteins IIb and IIIa with fibrinogen J Clin Invest 1982 69 2 263 269 6460044 10.1172/JCI110448 PMC370974 11. Adelman B Carlson P Powers P. von Willebrand factor is present on the surface of platelets stimulated in plasma by ADP Blood 1987 70 5 1362 1366 2822171 12. Pieters M Wolberg AS Fibrinogen and fibrin: an illustrated review Res Pract Thromb Haemost 2019 3 2 161 172 31011700 10.1002/rth2.12191 PMC6462751 13. Springer TA von Willebrand factor, Jedi knight of the bloodstream Blood 2014 124 9 1412 1425 24928861 10.1182/blood-2014-05-378638 PMC4148764 14. Tovar-Lopez FJ Rosengarten G Westein E A microfluidics device to monitor platelet aggregation dynamics in response to strain rate micro-gradients in flowing blood Lab Chip 2010 10 3 291 302 20091000 10.1039/b916757a 15. Konig G Obser T Marggraf O Alteration in GPIIb/IIIa binding of VWD-associated von Willebrand factor variants with C-terminal missense mutations Thromb Haemost 2019 119 7 1102 1111 31035301 10.1055/s-0039-1687878 16. Montgomery RR Flood VH What have we learned from large population studies of von Willebrand disease? Hematology Am Soc Hematol Educ Program 2016 2016 1 670 677 27913545 10.1182/asheducation-2016.1.670 PMC5518316 17. Rodeghiero F Tosetto A Abshire T ISTH/SSC bleeding assessment tool: a standardized questionnaire and a proposal for a new bleeding score for inherited bleeding disorders J Thromb Haemost 2010 8 9 2063 2065 20626619 10.1111/j.1538-7836.2010.03975.x 18. Christopherson PA Tijet N Haberichter SL The common VWF variant p.Y1584C: detailed pathogenic examination of an enigmatic sequence change J Thromb Haemost 2024 22 3 666 675 38040335 10.1016/j.jtha.2023.11.016 PMC10922911 19. Sadler B Christopherson PA Haller G Montgomery RR Di Paola J. von Willebrand factor antigen levels are associated with burden of rare nonsynonymous variants in the VWF gene Blood 2021 137 23 3277 3283 33556167 10.1182/blood.2020009999 PMC8351900 20. Zhu J Zhu J Negri A Closed headpiece of integrin alphaIIbbeta3 and its complex with an alphaIIbbeta3-specific antagonist that does not induce opening Blood 2010 116 23 5050 5059 20679525 10.1182/blood-2010-04-281154 PMC3012599 21. Beacham DA Wise RJ Turci SM Handin RI Selective inactivation of the Arg-Gly-Asp-Ser (RGDS) binding site in von Willebrand factor by site-directed mutagenesis J Biol Chem 1992 267 5 3409 3415 1737795 22. Shi Q Fahs SA Mattson JG A novel mouse model of type 2N VWD was developed by CRISPR/Cas9 gene editing and recapitulates human type 2N VWD Blood Adv 2022 6 9 2778 2790 35015821 10.1182/bloodadvances.2021006353 PMC9092403 23. Suh TT Holmback K Jensen NJ Resolution of spontaneous bleeding events but failure of pregnancy in fibrinogen-deficient mice Genes Dev 1995 9 16 2020 2033 7649481 10.1101/gad.9.16.2020 24. Holmback K Danton MJ Suh TT Daugherty CC Degen JL Impaired platelet aggregation and sustained bleeding in mice lacking the fibrinogen motif bound by integrin alpha IIb beta 3 EMBO J 1996 15 21 5760 5771 8918453 PMC452323 25. Shi Q Fahs SA Kuether EL Cooley BC Weiler H Montgomery RR Targeting FVIII expression to endothelial cells regenerates a releasable pool of FVIII and restores hemostasis in a mouse model of hemophilia A Blood 2010 116 16 3049 3057 20606161 10.1182/blood-2010-03-272419 PMC2974610 26. Shi Q Schroeder JA Kuether EL Montgomery RR The important role of von Willebrand factor in platelet-derived FVIII gene therapy for murine hemophilia A in the presence of inhibitory antibodies J Thromb Haemost 2015 13 7 1301 1309 25955153 10.1111/jth.13001 PMC4496307 27. Flood VH Schlauderaff AC Haberichter SL Crucial role for the VWF A1 domain in binding to type IV collagen Blood 2015 125 14 2297 2304 25662333 10.1182/blood-2014-11-610824 PMC4383803 28. Flood VH Gill JC Christopherson PA Comparison of type I, type III and type VI collagen binding assays in diagnosis of von Willebrand disease J Thromb Haemost 2012 10 7 1425 1432 22507643 10.1111/j.1538-7836.2012.04747.x PMC3809762 29. Slobodianuk TL Kochelek C Foeckler J Kalloway S Weiler H Flood VH Defective collagen binding and increased bleeding in a murine model of von Willebrand disease affecting collagen IV binding J Thromb Haemost 2019 17 1 63 71 30565388 10.1111/jth.14341 PMC6743498 30. Zhang G Shi Q Fahs SA Kuether EL Walsh CE Montgomery RR Factor IX ectopically expressed in platelets can be stored in alpha-granules and corrects the phenotype of hemophilia B mice Blood 2010 116 8 1235 1243 20445020 10.1182/blood-2009-11-255612 PMC2938234 31. Baumgartner CK Zhang G Kuether EL Weiler H Shi Q Montgomery RR Comparison of platelet-derived and plasma factor VIII efficacy using a novel native whole blood thrombin generation assay J Thromb Haemost 2015 13 12 2210 2219 26453193 10.1111/jth.13169 PMC4715732 32. Kanaji S Fahs SA Shi Q Haberichter SL Montgomery RR Contribution of platelet vs. endothelial VWF to platelet adhesion and hemostasis J Thromb Haemost 2012 10 8 1646 1652 22642380 10.1111/j.1538-7836.2012.04797.x PMC3419786 33. Johansen PB Tranholm M Haaning J Knudsen T. Development of a tail vein transection bleeding model in fully anaesthetized haemophilia A mice - characterization of two novel FVIII molecules Haemophilia 2016 22 4 625 631 26936336 10.1111/hae.12907 34. Chen Y Schroeder JA Kuether EL Zhang G Shi Q. Platelet gene therapy by lentiviral gene delivery to hematopoietic stem cells restores hemostasis and induces humoral immune tolerance in FIX(null) mice Mol Ther 2014 22 1 169 177 24042561 10.1038/mt.2013.197 PMC3978792 35. Kim KH Barazia A Cho J. Real-time imaging of heterotypic platelet-neutrophil interactions on the activated endothelium during vascular inflammation and thrombus formation in live mice J Vis Exp 2013 74 50329 23609348 10.3791/50329 PMC3643153 36. Neyman M Gewirtz J Poncz M. Analysis of the spatial and temporal characteristics of platelet-delivered factor VIII-based clots Blood 2008 112 4 1101 1108 18559671 10.1182/blood-2008-04-152959 PMC2515146 37. Flood VH Gill JC Friedman KD Collagen binding provides a sensitive screen for variant von Willebrand disease Clin Chem 2013 59 4 684 691 23340442 10.1373/clinchem.2012.199000 PMC3852672 38. Christopherson PA Haberichter SL Flood VH Ristocetin dependent cofactor activity in von Willebrand disease diagnosis: limitations of relying on a single measure Res Pract Thromb Haemost 2022 6 7 e12807 36381287 10.1002/rth2.12807 PMC9637542 39. Shi Q Kuether EL Schroeder JA Fahs SA Montgomery RR Intravascular recovery of VWF and FVIII following intraperitoneal injection and differences from intravenous and subcutaneous injection in mice Haemophilia 2012 18 4 639 646 22221819 10.1111/j.1365-2516.2011.02735.x PMC3323668 40. Baumgartner CK Mattson JG Weiler H Shi Q Montgomery RR Targeting factor VIII expression to platelets for hemophilia A gene therapy does not induce an apparent thrombotic risk in mice J Thromb Haemost 2017 15 1 98 109 27496751 10.1111/jth.13436 PMC5280575 41. Seidizadeh O Eikenboom JCJ Denis CV von Willebrand disease Nat Rev Dis Primers 2024 10 1 51 39054329 10.1038/s41572-024-00536-8 42. Kalot MA Husainat N Abughanimeh O Laboratory assays of VWF activity and use of desmopressin trials in the diagnosis of VWD: a systematic review and meta-analysis Blood Adv 2022 6 12 3735 3745 35192687 10.1182/bloodadvances.2021005431 PMC9631556 43. Veyradier A Jumilly AL Ribba AS New assay for measuring binding of platelet glycoprotein IIb/IIIa to unpurified von Willebrand factor Thromb Haemost 1999 82 1 134 139 10456467 44. Schneppenheim R Hellermann N Brehm MA The von Willebrand factor Tyr2561 allele is a gain-of-function variant and a risk factor for early myocardial infarction Blood 2019 133 4 356 365 30366922 10.1182/blood-2018-04-843425 PMC6347094 45. Ruggeri ZM Platelet and von Willebrand factor interactions at the vessel wall Hamostaseologie 2004 24 1 1 11 15029268 10.1267/hamo04010001 46. Huck V Chen PC Xu ER Gain-of-function variant p.Pro2555Arg of von Willebrand factor increases aggregate size through altering stem dynamics Thromb Haemost 2022 122 2 226 239 33385180 10.1055/a-1344-4405 PMC8828397 47. Tomaiuolo M Brass LF Stalker TJ Regulation of platelet activation and coagulation and its role in vascular injury and arterial thrombosis Interv Cardiol Clin 2017 6 1 1 12 27886814 10.1016/j.iccl.2016.08.001 PMC5154246 48. Scridon A Platelets and their role in hemostasis and thrombosis-from physiology to pathophysiology and therapeutic implications Int J Mol Sci 2022 23 21 12772 36361561 10.3390/ijms232112772 PMC9653660 49. Sang Y Roest M de LB de Groot PG Huskens D. Interplay between platelets and coagulation Blood Rev 2021 46 100733 32682574 10.1016/j.blre.2020.100733 PMC7354275 50. Croteau SE Abajas YL Wolberg AS Recombinant porcine factor VIII for high-risk surgery in paediatric congenital haemophilia A with high-titre inhibitor Haemophilia 2017 23 2 e93 e98 28124406 10.1111/hae.13157 PMC5354962 ",
  "metadata": {
    "Title of this paper": "Recombinant porcine factor VIII for high-risk surgery in paediatric congenital haemophilia A with high-titre inhibitor",
    "Journal it was published in:": "Haematologica",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485351/"
  }
}