{
  "title": "Paper_916",
  "abstract": "pmc Ther Adv Med Oncol Ther Adv Med Oncol 1560 tam TAM Therapeutic Advances in Medical Oncology 1758-8340 1758-8359 SAGE Publications PMC12477399 PMC12477399.1 12477399 12477399 41031206 10.1177/17588359251363499 10.1177_17588359251363499 1 Gynaecological Cancer Molecular Profiling, Prognostic Biomarkers, Targeted Therapies, Treatment Challenges, and the Future of Precision Medicine Review Genomics of cervical, vulvar and vaginal cancers and the potential of precision medicine https://orcid.org/0000-0002-9350-5520 Barker Holly E. Cancer Biology and Stem Cells Division, Walter and Eliza Hall Institute of Medical Research, 1G Royal Parade, Parkville, VIC 3052, Australia Department of Medical Biology, Faculty of Medicine, Dentistry and Health Sciences, The University of Melbourne, Melbourne, VIC, Australia Conceptualization Data curation Formal analysis Funding acquisition Investigation Methodology Project administration Resources Supervision Validation Visualization Writing – original draft Writing – review & editing Polidano Joseph Walter and Eliza Hall Institute of Medical Research, Parkville, VIC, Australia Department of Medical Biology, Faculty of Medicine, Dentistry and Health Sciences, The University of Melbourne, Melbourne, VIC, Australia Data curation Validation Writing – review & editing Jarratt Andrew Walter and Eliza Hall Institute of Medical Research, Parkville, VIC, Australia Department of Medical Biology, Faculty of Medicine, Dentistry and Health Sciences, The University of Melbourne, Melbourne, VIC, Australia Data curation Validation Writing – review & editing Scott Clare L. Walter and Eliza Hall Institute of Medical Research, Parkville, VIC, Australia Department of Obstetrics, Gynaecology and Newborn Health, Faculty of Medicine, Dentistry and Health Sciences, The University of Melbourne, Melbourne, VIC, Australia The Royal Womens’ Hospital, Parkville, VIC, Australia Peter MacCallum Cancer Centre, Melbourne, VIC, Australia Data curation Formal analysis Funding acquisition Investigation Resources Supervision Validation Writing – review & editing barker.h@wehi.edu.au 28 9 2025 2025 17 478142 17588359251363499 3 11 2024 14 7 2025 28 09 2025 30 09 2025 01 10 2025 © The Author(s), 2025 2025 SAGE Publications Ltd unless otherwise noted. Manuscript content on this site is licensed under Creative Commons Licenses https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Most cases of cervical cancer are still caused by persistent infection with high-risk human papillomavirus (HPV) variants, which also drives the development of ~30% of vulvar and ~76% of vaginal malignancies. Implementation of HPV vaccination has significantly decreased the incidence of high-grade pre-cancerous cervical, vulvar and vaginal lesions. However, cervical, vulvar and vaginal cancers can still develop (with or without HPV integration) and treatment options are limited compared to more common cancers. As with many other cancer types, molecular studies should identify targeted agents that could be added to treatment regimens to improve response rates and survival. Combination regimens involving chemoradiotherapy, anti-angiogenics and immune checkpoint inhibitors should be considered in the first instance. Then, depending on the molecular profile of a particular tumour, more targeted therapies should be considered. In particular, HER2-targeted therapies are likely to be a viable treatment option for many individuals, including those with cervical adenocarcinoma of gastric-type and vulvar Paget’s disease. In cervical cancer, TGFβ, PI3K, ATR and PARP inhibitors have shown some benefit and warrant further investigation. In vulvar cancer, combination therapies involving EGFR inhibitors require ongoing evaluation. In vaginal cancer, combination therapies targeting the PI3K and MAPK pathways should be investigated for squamous cell carcinoma and melanoma, respectively. Finally, with the rapid expansion of antibody-drug conjugates in recent years, this is an especially exciting area of investigation. For cervical, vulvar and vaginal cancers specifically, trastuzumab deruxtecan and tisotumab vedotin could be important therapeutic options in the right context. In this review, we describe the molecular features of different cervical, vulvar and vaginal cancer types, current genomically-matched therapies being investigated and discuss treatment strategies with future potential. Plain language summary Investigating the potential of matching drugs to specific changes in the DNA in cervical, vulvar and vaginal cancers Most cases of cervical cancer are still caused by persistent infection with high-risk human papilloma virus (HPV) variants, which also drives the development of ~30% of vulvar and ~76% of vaginal malignancies. HPV vaccination has been an important preventative mechanism for these types of malignancies, however, they can still arise (with or without HPV infection). Treatment options for cervical, vulvar and vaginal cancers are still limited compared to more common cancers. Investigating changes in the DNA in a particular tumour may indicate therapeutic options involving targeted agents (specific for the DNA alterations). Clinical trials have been developed to test responses to some of these targeted agents in tumours carrying the relevant DNA alterations. Results from these trials indicate that drugs targeting specific molecules, such as HER2, TGFβ, PI3K, ATR and PARP, may be effective against cervical, vulvar or vaginal tumours harbouring relevant DNA alterations. In this review, we describe the most frequent DNA changes observed in the different subtypes of cervical, vulvar and vaginal cancers and discuss different therapies currently being investigated to target these changes, with consideration of what might be possible in the future. cervical cancer clinical trials molecular therapeutics precision oncology targeted therapy vaginal cancer vulvar cancer Victorian Cancer Agency https://doi.org/10.13039/100008018 MCRF23021 National Health and Medical Research Council https://doi.org/10.13039/501100000925 2009783 Stafford Fox Medical Research Foundation Ovarian and Rare Cancer Awards pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date January-December 2025 typesetter ts1 Background of cervical, vulvar and vaginal cancer Incidence Cervical cancer is the fourth most commonly diagnosed cancer in women, accounting for about 45% of all gynaecological cancers, and is currently responsible for the most gynaecological cancer-related deaths worldwide. 1 2  3 1 2 Most cases of cervical cancer are still caused by persistent infection with high-risk human papillomavirus (HPV) variants.  4  5  6 Pathological subtypes The two main categories of cervical cancer are squamous cell carcinomas (SCC; ~70%–80%, including keratinising, non-keratinising and small cell squamous carcinomas) and adenocarcinomas (~20%–25%, including mucinous, clear cell and serous), arising from the ectocervix and endocervix, respectively. 7 9  9  10 7 9  11 Most vulvar malignancies arise in the labia and the most common subtype is SCC of the vulva, accounting for up to 88% of cases. 12 14 12 14 Vaginal malignancies mostly (in >80% of cases) arise as a result of cervical, endometrial or vulvar cancer recurrence in the vaginal area. 13 15 13 15 14 16 Survival rates The mean 5-year survival (5-YS) for all types and stages of cervical cancer is 67%; however, the full range is 91% for early stage cervical cancer, 60% when there is spread to local organs, and devastatingly low, at only 19%, for cancer that has spread to distant parts of the body.  17  8  13 13 14 18 Current standard treatment strategies The current treatment strategy for early stage disease is surgery and/or platinum-based concurrent chemoradiotherapy (CCRT), and for later-stage disease is CCRT.  19  19 20 21 For vulvar cancer, the treatment of early stage disease usually involves surgery, with or without CCRT.  22  22  23 Due to its location, curative organ-sparing surgery is not often a primary treatment option for vaginal malignancies.  15  15 Genomic landscape Cervical cancer Persistent HPV infection (due to DNA integration) drives the development of the majority of cervical and vaginal cancers (~90% and ~76%, respectively) as well as ~30% of vulvar cancers. 4 24 25 26 27 The most commonly mutated genes in cervical cancer are displayed in Table 1 28 35 PIK3CA KMT2D FBXW7 EP300 PIK3CA KRAS ERBB2 TP53 ARID1A PIK3CA MYC ARID1A TP53 TERT  29 MYC HMGA2 ERBB2 TP63 FANCC RAD51B 30 32 36  37  37 Table 1. Frequencies of mutations in commonly altered genes in the three main groups of cervical cancer (where available). Gene Mutation frequency (%) References SCC AC Other  a  PIK3CA 13–38 17–35 0–38 28–35  ERBB2 2–9 6–24 0–17 29, 32, 34, 35  KRAS 0–3 7–24 0–11 28, 29, 32–35  TP53 5–6 4–18 6–13 29, 32  ARID1A 1–5 10–16 8–16 28, 29  FBXW7 4–15 0–13 0–17 28–30, 32, 35  KMT2D 14–15 6–11 6–8 29, 30  EP300 11–14 7–10 0 28, 32  SMAD4 1–4 7–12 0–2 29,35  STK11 3–11 5–11 0–19 29, 32, 33, 35  PTEN 6–9 3–11 0–11 28, 29, 32, 35  HLA-B 8,9 0 0–13 28, 32  CASP8 6–9 0 0 28, 30  NFE2L2 4–9 0–4 0 28, 32  MAPK1 4–8 0 0–17 28, 30, 32, 35  MYC 0 0–4 8–17 29, 35  FAT1 18 44 8 30  HUWE1 20 6 17 35  ERBB3 3 16 0 28  KMT2C 14 4 11 29  ELF3 0 13 0 32 TERT 12 3 11 29  SLC35G5 5 11 15 30  HLA-A 10 0 0 28  SMARCA4 9 6 0 35  RB1 9 1 6 29  CBFB 0 8 0 32  PCDHGA12 7 0 0 30  TGFBR2 4 0 0 28  NOTCH1 3 0 0 29  SHKBP1 3 0 0 28  NRAS 0 3 0 29  HRAS 0 1 0 29 a Only small number of ‘other’ cases in some studies and so a mutation in one case in this group results in an abnormally high frequency. AC, adenocarcinoma; SCC, squamous cell carcinoma. The most commonly amplified or deleted genes in cervical cancer are displayed in Table 2 28 35 MYC YAP1 EGFR 28 35 ERBB2 BCAR4  38 ERBB2 28 32 35 ERBB2  39 TGFBR2 SMAD4 28 35  40 TERC MECOM TP63 PIK3CA 28 35 CD274 PDCD1LG2  28  41  42  42  43 Table 2. Frequencies of amplifications and deletions of commonly altered genes in the three main groups of cervical cancer (or overall, if subtype information not available). Gene Amplification frequency (%) References Notes SCC AC Other  a  PIK3CA 46 29 33 35  FXR1 46 29 33 35  GNAS 9 35 50 35 Mostly AC and other  MYC 24 6 6 35 Mostly SCC  YAP1 19 0 0 28 Mostly SCC  BCAR4 4 13 33 28 Mostly other  ERBB2 7 12 0 35 Mostly AC Gene All subtypes amplification freq (%) References Notes  TERC 78 28  MECOM 78 28  TP63 77 28  CD274 21 28  PDCD1LG2 21 28  KLF5 18 28 Mostly AC  EGFR 17 28 Mostly SCC  BIRC2 17 28 Mostly SCC  BIRC3 17 28 Mostly SCC Gene Deletion frequency (%) References Notes SCC AC Other  a  SMAD4 4 29 0 35 Mostly AC  STK11 15 18 17 35  PTEN 6 6 33 28 Mostly other Gene All subtypes deletion freq (%) References Notes  TGFBR2 36 28 Mostly AC  FAT1 36 28 a Only small number of ‘other’ cases in some studies and so a mutation in one case in this group results in an abnormally high frequency. AC, adenocarcinoma; SCC, squamous cell carcinoma. With the exception of the Friedman study,  29 Vulvar cancer Vulvar cancers are classified as ‘usual type’, which are HPV-positive, and ‘differentiated type’, which are HPV-negative and mostly attributed to driver mutations in TP53. 22 44 TP53 45 52  53 TP53  53 The most commonly mutated genes in SCC of the vulvar (HPV-positive and negative tumours grouped together) are TP53 CDKN2A NOTCH1 FAT1 HRAS PIK3CA Table 3 TERT 46 50 TP53 CDKN2A NOTCH1 FAT1 HRAS TERT PIK3CA c-KIT Table 3 45 51 CCND1 EGFR FGF3 FGF19 FGF4 FGF CCND1 Table 4 46 50 CD274 PDCD1LG2 Table 4 46 50  54  46  46  55  55 c-KIT NRAS BRAF Table 5 Tables 3 5 Table 3. Frequencies of mutations in commonly altered genes in vulvar SCC (including HPV+ and HPV− frequencies, where available). Gene Mutation frequency (%) References All vulvar SCC HPV− HPV+  TP53 33–82 41–92 0–50 46–52 TERT 19–82 55–100 2–25 46, 52, 48, 50  CDKN2A 12–53 14–71 0–25 46, 48–52  NOTCH1 11–41 19–54 0–7 46, 47, 50, 52  FAT1 11–41 15–35 3–25 46, 52, 50  HRAS 5–28 3–31 0–14 46–49, 51, 52  PIK3CA 6–24 7–19 0–50 46–52  CASP8 8–18 10–23 0 46–52  KMT2D 8–12 9–15 0–23 46, 47, 52  KMT2C 8–9 3–10 0–26 46, 47  FBXW7 6–7 3–10 3–10 46, 50, 51  EP300 4–6 1 14 46, 50  KRAS <1–6 0–7 0–5 47–49  PTEN 1–5 0–2 0–9 48–51  STK11 1–4 0–1 2–9 50, 51  JAK3 24 31 0 52  c-KIT 14 10 18 49  SYNE1 11 10 29 47  FGFR3 9 5 14 49  NSD1 8 10 0 47  NOTCH2 6 3 14 47  SYNE2 6 0 29 47  PP2R1A 3 3 0 48  AR 1 0 4 50 HPV, human papilloma virus; SCC, squamous cell carcinoma. Table 4. Frequencies of amplifications and deletions in commonly altered genes in vulvar SCC (including HPV+ and HPV− frequencies where available). Gene Amplification frequency (%) References All vulvar SCC HPV− HPV+  CCND1 7–18 2–15 22–25 46, 50, 52  EGFR 6–12 0–15 0–11 46, 50, 52  CD274 3–4 1 5 46, 50  PDCD1LG2 3–4 1 5 46, 50 FGF  a 18 15 25 52  FGF3 8 n/a n/a 46  FGF19 8 n/a n/a 46  FGF4 6 n/a n/a 46  NFIB 5 n/a n/a 46  JAK2 4 n/a n/a 46  PIK3CA 1 2 1 50 Gene Deletion frequency (%) References All vulvar SCC HPV− HPV+  CDKN2A 6 8 0 52  PTEN 2 5 0 50  STK11 2 5 1 50 a FGF FGF3 4 19. FGF, fibroblast growth factor; HPV, human papilloma virus; n/a, not available; SCC, squamous cell carcinoma. Table 5. Frequencies of mutations in commonly altered genes in vulvar melanoma. Gene Mutation frequency (%) References  c-KIT 31 55  BRAF 10 55  NRAS 10 55 Vaginal cancer Molecular data are largely lacking for vaginal cancer, mostly limited to a few molecular studies of rare vaginal melanomas.  55  55 NRAS BRAF c-KIT Table 6  52 PIK3CA TP53 KMT2D CREBBP Table 6  52 TERT TERT 46 50 52 CCND1 FGF FAT1 Table 7  52 Table 8 Table 6. Frequencies of alterations in commonly altered genes in vaginal cancer. Subtype Gene Mutation frequency (%) References All HPV+ SCC  PIK3CA 71 83 52 SCC  TP53 29 17 52 SCC  KMT2D 29 33 52 SCC  CREBBP 29 33 52 SCC TERT 14 0 52 Melanoma  NRAS 19 n/a 55 Melanoma  BRAF 6 n/a 55 Melanoma  c-KIT 6 n/a 55 HPV, human papilloma virus; SCC, squamous cell carcinoma. Table 7. Frequencies of amplifications and deletions in commonly altered genes in vaginal cancer. Gene CN change Frequency (%) References All vaginal SCC HPV+  CCND1 Amplification 14 0 52 FGF  a Amplification 14 0 52  FAT1 Deletion 14 0 52 a FGF FGF3 4 19. CN, copy number; HPV, human papilloma virus; SCC, squamous cell carcinoma. Table 8. Alterations identified in vaginal cancer cases (2 × SCC and 4 × AC) in the Stafford Fox Rare Cancer Program. Subtype Gene Variant type Affected/total # SCC  TP53 SNV 1/2 SCC  TGFBR SNV 1/2 SCC  NOTCH1 SNV 1/2 SCC TERT SNV 1/2 SCC  HPV Integration 1/2 AC (non-mucinous)  TP53 SNV and LOH 2/2 AC (non-mucinous)  CDKN2A SNV 1/2 AC (non-mucinous)  SMAD4 SNV 1/2 AC (non-mucinous)  ERBB2 Amplification 1/2 AC (non-mucinous)  ZNF217 Amplification 1/2 AC (non-mucinous)  SRC Amplification 1/2 AC (non-mucinous)  MYB Amplification 1/2 AC (non-mucinous)  NDRG1 Amplification 1/2 AC (non-mucinous)  FAM135B Amplification 1/2 AC (non-mucinous)  BRD3 Deletion 1/2 AC (non-mucinous)  NF1 IR 1/2 AC (non-mucinous)  HPV Integration 0/2 AC (mucinous)  TP53 SNV and LOH 2/2 AC (mucinous)  ERBB3 SNV 1/2 AC (mucinous)  KRAS SNV 1/2 AC (mucinous)  MYC Amplification 1/2 AC (mucinous)  CCNE1 Amplification 1/2 AC (mucinous)  ERBB2 Amplification 1/2 AC (mucinous)  ERBB3 Amplification 1/2 AC (mucinous)  CDK4 Amplification 1/2 AC (mucinous)  KRAS Amplification 1/2 AC (mucinous)  mTOR Amplification 1/2 AC (mucinous)  ATRX IR 1/2 AC, adenocarcinoma; IR, inactivating rearrangement; LOH, loss of heterozygosity; SCC, squamous cell carcinoma; SNV, small nucleotide variant. Targeted therapies for the treatment of cervical cancer Although matching targeted therapies based on molecular profiling has changed the treatment landscape for many cancer types, cervical cancer has lagged behind. Therefore, the prognostic value of cervical cancer genomics is yet to be determined. The National Cancer Institute-Molecular Analysis for Therapy Choice (NCI-MATCH) phase II trial ( NCT02465060  56  56 Based on the available molecular data for cervical cancer, combination therapeutic strategies involving EGFR, FGFR3, SRC, TGFβ, MAPK and PI3K inhibitors may benefit individuals with SCC of the cervix. For adenocarcinomas of the cervix, relevant combinations of drugs targeting HER2, HER3 and PI3K may be effective. Inhibitors of the PI3K and MAPK pathways, as well as of ATR and PARP (for tumours harbouring ARID1A  28 Table 9 Table 9. Clinical trials involving cervical cancer and targeted therapies where clinical benefit has been observed. Drug Trial/ethics ID Phase Relevant cancer type(s) Details Target Status Outcome Refs Bevacizumab NCT00025233 II Cervical Bevacizumab monotherapy in persistent or recurrent cervical cancer VEGF-A Completed PFS = 3.4 months (95% CI 2.5–4.5 months); OS = 7.3 months (95% CI 6.1–10.4 months). 60 Bevacizumab NCT00803062 III Cervical Paclitaxel plus cisplatin or topotecan with or without bevacizumab in treating patients with stage IVB, recurrent, or persistent cervical cancer VEGF-A Completed OS = 16.8 months (with bevacizumab) vs 13.3 months (without bevacizumab); HR = 0.77; 95% CI 0.62–0.95; p 58, 59 Bevacizumab NCT02467907 II Cervical Bevacizumab in combination with carboplatin and paclitaxel for metastatic, recurrent or persistent cervical cancer VEGF-A Completed ORR = 61% (95% CI 52%–69%), including 14% CR. 61 Cediranib NCT01229930 II Cervical Carboplatin and paclitaxel with or without cediranib maleate in treating patients with metastatic or recurrent cervical cancer that cannot be removed by surgery VEGFR-1–3/PDGFR/KIT Completed PFS = 8.1 months (cediranib) vs 6.7 months (placebo); HR = 0.58; 80% CI 0.40–0.85; p 62 Pazopanib or lapatinib NCT00430781 II Cervical Pazopanib plus lapatinib compared to lapatinib alone and pazopanib alone in subjects with metastatic cervical cancer (combination discontinued) VEGFR/ Completed PFS = 18.1 weeks (pazopanib) vs 17.1 weeks (lapatinib); OS = 50.7 weeks (pazopanib) vs 39.1 weeks (lapatinib); HR = 0.66; 90% CI 0.48–0.91; p p 63 Apatinib SDTHEC201603024 II Cervical Apatinib as second-line treatment for recurrent or advanced cervical cancer VEGFR-2 Completed ORR = 15.0% (95% CI 2.1%–32.1%), including 15% PR (3/20) and 20% SD (4/20); DCR = 35.0% (95% CI 12.1%–57.9%); median PFS = 5.13 months (95% CI 2.94–7.32 months); median OS–12.3 months (95% CI 10.13–14.47 months). 64 Apatinib Meta-analysis of 7 trials II Cervical Apatinib monotherapy in pre-treated cervical cancer patients VEGFR-2 Completed PFS = 5.25 months (95% CI 4.73–5.76 months); OS = 10.63 months (95% CI 8.57–12.68 months); ORR = 22.9% (95% CI 14.5%–31.3%). 65 Drug Clinical trial Phase Relevant cancer type(s) Details Target Status Outcome Refs Pembrolizumab NCT02054806 Ib Cervical, vulvar Pembrolizumab in PD-L1-positive advanced solid tumours PD-1 Completed PFS (cervical) = 1.9 months (95% CI 1.5–34); PFS (vulvar) = 3.1 months (95% CI 1.0–4.0); OS (cervical) = 10.8 months (95% CI 3.0–15.0); OS (vulvar) = 3.8 months (95% CI 2.8–5.5): ORR (cervical) = 17% (95% CI 5.0%–37%); ORR (vulvar) = 6% (95% CI 0.5–26.5). Responses; cervical = 4/24 (17%) PR, 3/24 (13%) SD; vulvar = 1/18 (6%) PR, 7/18 (39%) SD. 65, 110 Pembrolizumab NCT02628067 II Cervical, vulvar Pembrolizumab in rare, advanced tumours PD-1 Ongoing PFS (cervical) = 2.1 months (95% CI 2.1–2.3) in PD-L1-positive cases; PFS (vulvar) = 2.1 months (95% CI 2.0–2.1); OS (cervical) = 11 months (95% CI 9.1–14.1) in PD-L1-positive cases; OS (vulvar) = 6.2 months (95% CI 4.9–9.4); ORR (cervical) = 14.6% (95% CI 7.8%–24.2%) in PD-L1-positive cases; ORR (vulvar) = 9.5% (95% CI 4.2%–17.9%) in PD-L1-positive cases. Responses; cervical = 3/82 (4%) CR and 9/82 (11%) PR and 15/82 (18%) SD in PD-L1-positive cases; vulvar = 1/84 (1%) CR, 7/84 (8%) PR and 14/84 (17%) SD in PD-L1-positive cases. 66, 111 Pembrolizumab NCT03635567 III Cervical Pembrolizumab plus chemotherapy for persistent, recurrent, or metastatic cervical cancer PD-1 Completed OS = 28.6 months for pembrolizumab plus chemo vs 16.5 months for placebo plus chemo in patients with PD-L1 CPS ⩾1; HR = 0.60; 95% CI 0.49–0.74; and OS = 29.6 months for pembrolizumab plus chemo vs 17.4 months for placebo plus chemo in patients with PD-L1 CPS ⩾10; HR = 0.58; 95% CI 0.44–0.78. 71 Pembrolizumab NCT04221945 III Cervical Pembrolizumab plus chemoradiotherapy (CCRT) for high-risk LACC PD-1 Completed PFS = 24-month PFS = 67.8% for pembrolizumab plus CCRT vs 57.3% for placebo + CCRT; HR = 0.73; 95% CI 0.49–1.07. 74 Durvalumab NCT03830866 III Cervical Concurrent and adjuvant durvalumab with chemoradiotherapy vs chemoradiotherapy alone in women with LACC PD-L1 Completed Median PFS = not reach for either group (HR 0.84; 95% CI 0.65–1.08; p 73 Pembrolizumab NCT04430699 II Vulvar Cisplatin + pembrolizumab + RT in vulvar cancer PD-1 Recruiting n/a Cemiplimab NCT03257267 III Cervical Cemiplimab vs IC chemotherapy in recurrent cervical cancer PD-1 Completed OS = 11.7 months for cemiplimab vs 8.5 months for ICC for whole population; 13.9 months for cemiplimab vs 9.3 months for ICC in PD-L1-positive population; HR = 0.66; 95% CI 0.55–0.79 (cemiplimab) and HR = 0.70; 95% CI 0.48–1.01 (ICC). 67 Serplulimab NCT04150575 II Cervical Efficacy of serplulimab plus nab-paclitaxel in previously treated PD-L1-positive advanced cervical cancer PD-1 Completed PFS = 5.7 months (95% CI 3.0–NR); OS = 15.5 months (95% CI 10.5–NR); ORR = 47.6% (95% CI 25.7%–70.2%). 70 Nivolumab ± ipilimumab NCT02488759 I/II Cervical, vulvar, vaginal Nivolumab ± ipilimumab in virus-associated cancers PD-1, CTLA4 Completed PFS (cervical) = 5.1 months (95% CI 1.9–9.1 months); OS (cervical) = 21.9 months (95% CI 15.1–NR); ORR (cervical) = 26.3% (95% CI 9.1%–51.2%) for nivolumab alone and 31% (95% CI 18%–47%) for the combination, increasing to 38% (95% CI 29%–48%) in the expansion cohort; ORR (vaginal/vulvar) = 20% (95% CI 0.5%–71.6%) for nivolumab alone. Responses; cervical = 3/19 (16%) CR, 2/19 (11%) PR, 8/19 (42%) SD; vaginal/vulvar cancer = 1/5 (20%) PR and 3/5 (60%) SD. 76, 77 Balstilimab ± zalifrelimab NCT03104699 NCT03495882 II Cervical Balstilimab as monotherapy or in combination with zalifrelimab PD-1, CTLA4 Completed ORR = 14% for monotherapy and 25.6% (95% CI 18.8–33.9) for combination. 32.8% for PD-L1-positive tumours vs 9.1% for PD-L1-negative tumours. Responses; 8% CR and 17.6% PR. 78 Cadonilimab NCT04380805 II Cervical Efficacy of cadonilimab in previously treated recurrent or metastatic cervical cancer PD-1, CTLA4 (bispecific antibody) Completed PFS = 3.75 months (95% CI 2–6.41); OS = 17.51 months (95% CI 11.37–NR); ORR = 33% (95% CI 23.9%–43.1%). Responses; 10.8% CR and 18.9% PR. 79 Cadonilimab NCT04982237 III Cervical Cadonilimab plus platinum-based chemotherapy with or without bevacizumab as first-line treatment for persistent, recurrent, or metastatic cervical cancer PD-1, CTLA4 (bispecific antibody) Completed PFS = 12.7 months (95% CI 11.6–16.1) with cadonilimab vs 8.1 months (95% CI 7.7–9.6) for placebo; HR = 0.62 (95% CI 0.49–0.80). OS = NR (95% CI 27.0 months–NR) for cadonilimab vs 22.8 months (95% CI 17.6–29.0) for placebo; HR = 0.64 (95% CI 0.48–0.86). 80 Durvalumab + Tremelimumab NCT03452332 I Cervical, vulvar, vaginal Stereotactic body radiation therapy, tremelimumab, and durvalumab in treating recurrent or metastatic cervical, vaginal, or vulvar cancers PD-1, CTLA4 Completed, no results n/a Nivolumab + Ipilimumab NCT02834013 II Rare tumours Nivolumab and Ipilimumab in treating patients with rare tumours PD-1, CTLA4 Active, not recruiting n/a Cardunolizumab NCT06292689 II Vulvar, vaginal Cardunolizumab with/without chemotherapy ± bevacizumab in recurrent or metastatic vulvar and vaginal cancer PD-1, CTLA4 (bispecific antibody) Not yet recruiting n/a Camrelizumab + apatinib NCT03816553 II Cervical Camrelizumab (SHR-1210) plus apatinib in metastatic, persistent, or recurrent cervical cancer PD-1, VEGFR2 Completed PFS = 8.8 months (95% CI 5.6–NR); ORR = 55.6% (95% CI 40%–70.4%). Responses; 4% (2/45) CR and 51% (23/45) PR. 69 Atezolizumab + bevacizumab NCT03556839 III Cervical Atezolizumab plus bevacizumab and chemotherapy (standard therapy) for persistent, recurrent, or metastatic cervical cancer PD-L1, VEGF-A Completed PFS = 13.7 months for atezolizumab with standard therapy vs 10.4 months for standard therapy alone; OS = 32.1 months for atezolizumab with standard therapy vs 22.8 months for standard therapy alone; HR = 0.62; 95% CI 0.49–0.78; p p 72 Atezolizumab + bevacizumab NCT03074513 II Rare solid tumours Atezolizumab and bevacizumab in treating patients with rare solid tumours PD-L1, VEGF-A Active, not recruiting n/a ICB099280 + axitinib NCT05949632 I/II Advanced solid tumours INCB099280 in combination with axitinib in adults with advanced solid tumours PD-L1, VEGFR-1–3/ Recruiting, no results n/a Nivolumab ± cabozantinib NCT05111574 II Cervical, vulvar, vaginal Nivolumab alone or with cabozantinib to prevent mucosal melanoma return after surgery PD-1, MET/VEGFR/RET/AXL/KIT/FLT3 Recruiting, no results n/a Avelumab NCT0335775, LATENT II Cervical, vulvar, vaginal Avelumab with valproic acid in virus-associated cancer PD-L1, HDAC Active, not recruiting n/a Temsirolimus NCT01026792 II Cervical Temsirolimus monotherapy in advanced cervical cancer mTOR Completed PFS = 3.52 months (95% CI 1.81–4.71). 60.7% SD. 97 Everolimus NCT01217177 I Cervical Everolimus with cisplatin and radiotherapy for locally advance cervical cancer mTOR Completed 8.4% CR and 91.6% PR at 12 weeks post treatment. 100 Temsirolimus + bevacizumab I Cervical Bevacizumab and temsirolimus in advanced gynaecologic malignancies mTOR, VEGF-A Completed SCC cervical cancer = 2/4 PR (33%) 98 Temsirolimus + bevacizumab NCT00761644 I Cervical Temsirolimus, bevacizumab and liposomal doxorubicin for advanced breast and gynaecologic malignancies mTOR, VEGF-A Completed SCC cervical cancer = 2/10 (20%) PR and 1/10 (10%) SD; cervical AC = 0/3 responders. ORR = 15.4%, increasing to 23.1% when individuals with prolonged SD are included. 99 Temsirolimus, bevacizumab, valproic acid NCT01552434 I Cervical, vaginal Bevacizumab, temsirolimus and valproic acid advanced or metastatic malignancies mTOR, VEGF-A, HDAC Completed Cervical cancer = 0/2 responders; vaginal SCC = 1/1 PR. 122 AZD5363 NCT01226316 I Cervical Pan-AKT inhibitor AZD5363 in PIK3CA-mutated breast and gynaecologic cancers AKT Completed Cervical = 1/5 20% PR (PIK3CA-mutated cancer). 101 Veliparib NCT01281852 I Cervical Veliparib with cisplatin and paclitaxel for persistent or recurrent cervical cancer PARP1/2 Completed PFS = 6.2 months (95% CI 2.9–10.1 months); OS = 14.5 months (95% CI 8.2–19.4 months). 82 Talazoparib NCT03968406 I Gynae Talazoparib and radiation therapy in treating patients with locally recurrent gynaecologic cancers PARP1/2 Recruiting, no results n/a Rucaparib and bevacizumab NCT03476798 II Cervical Rucaparib and bevacizumab in recurrent cervical cancer – potential benefit seen in patients with ARID1A mutations PARP1, VEGF-A Completed 6-month PFS rate = 67%; ORR = 33% in ARID1A-mutated cancers. 83 Ceralasertib ± olaparib NCT04065269 II Cervical Ceralasertib alone or in combination with olaparib in gynaecological cancers with or without ARID1A loss ATR, PARP Completed PFS = 23.9 weeks (95% CI 7.9–36); ORR = 24% in combination arm (for ovarian carcinosarcoma, endometrioid and cervical cancers – no associations with ARID1A mutations made). 86 Adavosertib NCT03345784 I Cervical, vaginal Adavosertib in combination with chemoradiation in cervical, upper vaginal and uterine cancers WEE1 Completed 2-year PFS rate for all cases (9 cervical and 1 uterine) = 86%; ORR for all (9 cervical and 1 uterine) = 71.4% at 4 months. 85 Bintrafusp alfa (M7824) NCT02517398 NCT03427411 I/II Cervical, vulvar, vaginal Bintrafusp alfa in patients with human papillomavirus-associated malignancies TGFb, PD-L1 (bifunctional fusion protein) Completed All cases ORR = 30.5% (95% CI 19.2%–43.9%) and a clinical response rate of 35.6% (95% CI 23.6%–49.1%). Responses; cervical = 8/33 (24%) PR and 2/33 (6%) had delayed PR; vulvar = 1/1 (100%) unconfirmed CR (patient passed away from unrelated cause before confirmation); vaginal = 1/1 (100%) CR. 102 Bintrafusp alfa (M7824) ± bevacizumab NCT04246489 II Cervical Bintrafusp alfa monotherapy in paclitaxel-experienced cervical cancer TGFb, PD-L1 (bifunctional fusion protein), VEGF-A Completed ORR = 21.9% (95% CI 15.5%–29.5%) for all patients; 25.6% (95% CI 16.8%–36.1%) for PD-L1-positive vs 18.2% (95% CI 9.1%–30.9%) for PD-L1-negative; 28.3% (95% CI 19.4–38.6) for SCC vs 12.2% (95% CI 4.6%–24.8%) for AC and 0% for adenosquamous cell carcinoma. Responses: 6.8% (10/146) CR, 15.1% (22/146) PR and 16.4% (24/146) SD. 103 Bintrafusp alfa (M7824) ± bevacizumab NCT04551950 I Cervical Bintrafusp alfa and chemoradiation with or without bevacizumab in locally advanced, persistent, recurrent, or metastatic cervical cancer TGFb, PD-L1 (bifunctional fusion protein), VEGF-A Completed ORR = 75% (95% CI 34.9–96.8) with bevacizumab, 44.4% (95% CI 13.7–78.8) without bevacizumab, and 62.5% (95% CI 24.5–91.5) without bevacizumab but with bintrafusp alfa monotherapy maintenance. 104 Neratinib NCT01953926 II Cervical, ovarian, uterine Neratinib monotherapy in HER2-mutant solid tumours HER2 Completed OS (cervical) = 16.8 months (95% CI 4.1–NR); ORR = 25% (95% CI 5.5%–57.2%). 92 T-DXd NCT04482309 II Cervical, ovarian, uterine T-DXd monotherapy in HER2-expressing solid tumours HER2 Completed PFS (cervical) = 7.0 months (95% CI 4.2–11.1); OS (cervical) = 13.6 months (95% CI 11.1–NR); ORR (cervical) = 50% (95% CI 33.8–66.2) for all tumours, 75% (95% CI 34.9–96.8) for HER2 3+ tumours. Responses; cervical = 2/40 (5%) CR, 18/40 (45%) PR and 11/40 (28%) SD. 93 Erlotinib II Cervical cancer Erlotinib combined with cisplatin and radiotherapy in patients with LACC EGFR Completed PFS at 12, 24 and 36 months = 94.4%, 80.6% and 73.8%, respectively; OS at 12, 24 and 36 months = 97.2%, 91.7% and 79.9%, respectively. Responses = 34/36 (94.4%) CR and 2/26 (5.6%) PR at end of therapy. 91 Erlotinib NCT00476476 II Vulvar Erlotinib in women with vulvar SCC EGFR Completed PFS = 13.2 weeks; ORR = 67.50%. Responses; 11 (27.5%) PR, 16 (40%) SD (including 5 patients with extra EGFR copies). All responses were short duration. 116 TV NCT03438396 NCT04697628 II/III Cervical TV vs IC chemotherapy for the treatment of recurrent cervical cancer TF Completed OS = 11.5 months for TV vs 9.5 months for IC chemotherapy group (HR 0.70; 95% CI 0.54–0.89; p p 106, 107 AC, adenocarcinoma; CCRT, concurrent chemoradiotherapy; CI, confidence interval; CPS, combined positive score; CR, complete response; CTLA4, cytotoxic T-lymphocyte antigen 4; DCR, disease control rate; FGFR, fibroblast growth factor receptors; HER2, human epidermal growth factor receptor-2; HR, hazard ratio; ICC, Investigator’s choice chemo; LACC, locally advanced cervical cancer; n/a, not available; NR, not reached; ORR, objective response rate; OS, overall survival; PD, progressive disease; PDGFR, platelet-derived growth factor receptor; PFS, progression-free survival; PR, partial response; SCC, squamous cell carcinoma; SD, stable disease; T-DXd, trastuzumab deruxtecan; TF, tissue factor; TV, tisotumab vedotin; VEGF-A, vascular endothelial growth factor. Vascular endothelial growth factor/R Inhibitors of VEGF and its receptors target a feature that is present in all solid cancers, namely angiogenesis. A promising phase II trial of bevacizumab monotherapy for persistent or recurrent cervical cancer ( NCT00025233  57 NCT00803062  58 58 59 NCT02467907  60 The small-molecule tyrosine kinase inhibitor (TKI), cediranib, has anti-angiogenic activity through inhibition of VEGFR-1/2/3, platelet-derived growth factor receptor (PDGFR) and KIT. Its efficacy has been investigated in combination with chemotherapy for the treatment of cervical cancer in the CIRCCa phase II trial ( NCT01229930  61  61 NCT00430781  62 Another VEGFR-2 inhibitor, apatinib, has also been investigated for the treatment of advanced cervical cancer in a phase II trial, where chemotherapy with or without bevacizumab had previously been unsuccessful. Modest benefit was observed in this study, with median PFS of 5.13 months and an objective response rate (ORR) of 16.7%.  63  64  64 Immunotherapy ICIs are used to treat cervical cancer due to specific features discussed earlier, such as amplification of the two genes encoding PD-L1 and PD-L2. 28 32  28 The KEYNOTE-028 phase Ib trial ( NCT02054806  65 NCT02628067  66  66 NCT03257267  67  67  68 The combination of an ICI with an anti-angiogenic drug was studied in a phase II trial of the PD-1i, camrelizumab (SHR-1210), combined with apatinib in metastatic, recurrent or persistent cervical cancer, following at least one line of systemic chemotherapy ( NCT03816553  69 NCT04150575  70 These encouraging results in the previously treated advanced cervical cancer setting led to two first-line phase III studies including ICI combinations with chemotherapy. The first-line phase III KEYNOTE-826 trial ( NCT03635567  71  71  21 The first-line phase III BEATcc trial ( NCT03556839  72 These results indicate that ICIs are indeed useful for treating cervical cancer in the first-line setting, delivered in combination with chemotherapy, with or without bevacizumab, and with or without prior chemotherapy exposure, for persistent, metastatic or recurrent cervical cancer. The strength of these results led to an investigation of ICI in treatment regimens during and following initial CCRT for high-risk locally advanced cervical cancer (LACC). While the phase III CALLA study ( NCT03830866  73 NCT04221945  74  74  74  73  75 Targeting two immune checkpoint proteins simultaneously, both PD-1 and cytotoxic T-lymphocyte antigen 4 (CTLA4), has also been studied in advanced cervical cancer in patients who had received prior systemic therapy. The CHECKMATE-358 phase I/II trial ( NCT02488759 76 77 76 77 NCT03495882  78  78 NCT04380805  79 NCT04982237  80  80 DNA repair A number of features of cervical cancer indicate that PARP inhibitors (PARPi) may be an effective treatment. Not only does expression of the HPV oncoproteins lead to inhibition of the guardian of the genome, p53, and increased DNA damage, but also the RAD51B 30 32 36  81 NCT01281852  82  82 NCT03476798  83 NCT04483544 NCT04644068 Cell cycle checkpoints Along with impaired repair of DNA damage, HPV infection also causes reduced activation of cell cycle checkpoints. 26 27 26 27  84 NCT03345784  85 NCT04065269  86  86 EGFR family With up-regulated EGFR and HER2 signalling being key features of cervical cancer, there have been a number of studies involving drugs that target these pathways. Studies involving EGFR inhibitors (EGFRi), such as gefitinib, erlotinib and cetuximab, as monotherapies or in combination with standard chemotherapy, have been mostly disappointing. 87 90  91  91 There have been fewer cervical cancer clinical trials involving HER2-targeted therapies. These therapies would be most relevant for cervical adenocarcinomas (i.e. GAS), which are most likely to have high expression of HER2. 28 30 32 35 ERBB2  29  29 NCT01953926  92 NCT04482309  93  94 NCT03602079 NCT06155396 NCT03330561 NCT04579380 PI3K/AKT/mTOR pathway PIK3CA PTEN 28 30 32 95 96 NCT01026792  97  98  98 NCT00761644  99  99 PIK3CA  99  100 NCT01226316 PIK3CA  101  101 TGFβ pathway or EMT As SRC, TGFβ and YAP-mediated signalling are often important in SCC of the cervix, targeting these aberrations is of interest. Two studies have investigated the activity of the bifunctional fusion protein that targets both TGFβ and PD-L1, bintrafusp alfa (M7824), in HPV-associated malignancies ( NCT02517398 NCT03427411  102 NCT04246489  103  103 NCT04551950  104 Antibody-drug conjugates Apart from the HER2-targeted ADCs mentioned previously, there has been an expansion of ADCs targeting other tumour biomarkers in recent years. So far, there have been 11 ADCs approved for the treatment of solid malignancies and almost 190 in the pipeline.  105  106  107 NCT03438396  107 NCT04697628  106 NCT06457997 NCT06238479 NCT06465069 NCT05941507 NCT04925284 Targeted therapies for the treatment of vulvar cancer The molecular data for vulvar cancers indicate that combination therapeutic strategies involving inhibitors of KIT and the PI3K pathway may be relevant for HPV-positive tumours, whereas inhibitors of the MAPK pathway may be relevant for HPV-negative tumours, which are more likely to have TP53  46 Matching targeted therapies based on molecular profiling of vulvar cancer has been largely lacking compared to common cancers and even cervical cancer. Therefore, the prognostic value of vulvar cancer genomics is yet to be determined. The NCI-MATCH phase II trial ( NCT02465060  56 Table 9 Vascular endothelial growth factor/R With high VEGF expression and high microvessel density being significant prognostic factors in vulvar cancer,  108  58 NCT00803062  58  108  109  109 Immunotherapy Given that PD-L1-positivity and high TMB are features of some vulvar cancers, 46 108 NCT02488759  77 NCT02054806  110  111  111 112 113 NCT04430699 NCT03452332 NCT02834013  114 NCT06292689 NCT03074513 NCT05949632 NCT05111574 NCT03357757 EGFR family With EGFR 50 115 NCT00476476  116  116  116 108 117  109  109 Although ERBB2 118 119  119 119 120  119 TGFβ pathway or EMT Although TGFβ-related targets have not been identified in vulvar cancer, one case was included in the phase II trial investigating bintrafusp alfa in HPV-associated malignancies ( NCT03427411  102 Antibody-drug conjugates Apart from the HER2-targeted ADCs mentioned above, which are likely to be important treatment options for individuals with VPD, TROP2-targeted ADCs, such as sacituzumab govitecan (SG) are likely to be relevant for the treatment of vulvar SSC. This is due to the high prevalence of TROP2 expression that has been observed in these tumours (almost all tumours have some expression, with about 75% having high (2+ or 3+) expression).  121 Targeted therapies for the treatment of vaginal cancer The limited molecular data for vaginal cancers indicate that inhibitors of the MAPK pathway may be relevant for the melanoma histological type. In addition, inhibitors of the PI3K/AKT/mTOR pathway may be relevant for vaginal SCC. Apart from specific targets, anti-angiogenics and ICIs are worth considering given their demonstrated efficacy in cervical cancer. Disappointingly, despite a search on https://wwww.clinicaltrials.gov NCT02465060  56 Table 9 Immunotherapy Two patients with vaginal cancer (at least one having a PD-L1-positive tumour) were included in the CheckMate-358 trial ( NCT02488759  76  112 NCT03452332 NCT06292689 NCT02834013 NCT05949632 NCT05111574 NCT03357757 Other targets and ADCs Extrapolating from cervical cancer, the PI3K/AKT/mTOR pathway may be an important target in vaginal cancer. In phase I study ( NCT01552434  122 NCT03427411  102 As with cervical and vulvar cancers, ADCs are also likely to become important therapeutic options for patients with vaginal cancer in the future. Many targets, such as HER2, AXL, TROP2 and TF, are relevant to vaginal cancer, indicating patients should be enrolled in current trials involving T-DXd, TV, SG and other ADCs. Summary While clinical trial reporting of cervical cancer and targeted therapies has increased in recent years, results lag behind those for other types of gynaecological cancer and are vanishingly rare for vulvar and vaginal cancers. Combination regimens with CCRT, anti-angiogenic therapy and ICI are indicated for cervical cancer and should be considered, if accessible, for vulvar and vaginal cancers in the first-line. More complex combination strategies involving ICIs and genomically-directed targeted therapies may be required for vulvar cancer, which appears less responsive to ICI than cervical cancer. In cervical cancer, initial trials involving TGFβ and PI3K pathway inhibitors have shown some benefit and warrant further investigation. HER2-targeted ADCs have shown efficacy in small trials of HER2-positive cases and the results of current trials involving newer HER2 ADCs are eagerly awaited. In particular, HER2-targeted therapies are likely to be a viable treatment option for many individuals with the GAS type of cervical adenocarcinoma. Further investigation of targeting ATR and PARP is also warranted, particularly in those with ARID1A In vulvar cancer, combination therapies involving EGFRi require ongoing evaluation. HER2-targeting therapies are clearly important in VPD, and it will be particularly interesting to study responses to the HER2 ADC, T-DXd, in this context. In vaginal cancer, combination therapies involving PI3K inhibitors should be explored in SCC and targeting of the MAPK pathway should be investigated in melanomas. Further investigation of bintrafusp alfa in both vulvar and vaginal cancer will be of great interest. Due to their rarity, molecular studies of vaginal cancers and clinical trials including patients with vaginal cancer have been severely limited to date and, unsurprisingly, prognosis remains poor. More comprehensive molecular profiling is required to determine whether vulvar and vaginal cancers are indeed most similar to cervical cancers. If so, then individuals with vulvar and vaginal cancers should be prioritised in cervical cancer trials to generate urgently needed evidence to advance therapeutic options for these women. Genomically-directed decision-making has the potential to increase the available treatment options for women with cervical, vulvar and vaginal cancers, and should support the design of future clinical trials. None. ORCID iD: https://orcid.org/0000-0002-9350-5520 Declarations Ethics approval and consent to participate: Consent for publication: Author contributions: Holly E. Barker: Joseph Polidano: Andrew Jarratt: Clare L. Scott: Funding: Competing interests: Availability of data and materials: References 1 Sung H Ferlay J Siegel RL et al Global Cancer Statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 3 209 249 33538338 10.3322/caac.21660 2 Zhu B Gu H Mao Z et al Global burden of gynaecological cancers in 2022 and projections to 2050 J Glob Health 2024 14 04155 39148469 10.7189/jogh.14.04155 PMC11327849 3 Safaeian M Solomon D Castle PE. Cervical cancer prevention – cervical screening: science in evolution Obstet Gynecol Clin North Am 2007 34 4 10.1016/j.ogc.2007.09.004 PMC2762353 18061867 4 Burd EM. Human papillomavirus and cervical cancer Clin Microbiol Rev 2003 16 1 1 17 12525422 10.1128/CMR.16.1.1-17.2003 PMC145302 5 Kjaer SK Dehlendorff C Belmonte F et al Real-world effectiveness of human papillomavirus vaccination against cervical cancer J Natl Cancer Inst 2021 113 10 1329 1335 33876216 10.1093/jnci/djab080 PMC8486335 6 Dehlendorff C Baandrup L Kjaer SK. Real-world effectiveness of human papillomavirus vaccination against vulvovaginal high-grade precancerous lesions and cancers J Natl Cancer Inst 2021 113 7 869 874 33377930 10.1093/jnci/djaa209 PMC8246827 7 Bermudez A Bhatla N Leung E. Cancer of the cervix uteri Int J Gynaecol Obstet 2015 131 Suppl. 2 10.1016/j.ijgo.2015.06.004 26433680 8 Vinh-Hung V Bourgain C Vlastos G et al Prognostic value of histopathology and trends in cervical cancer: a SEER population study BMC Cancer 2007 7 164 17718897 10.1186/1471-2407-7-164 PMC1994954 9 Marth C Landoni F Mahner S et al Cervical cancer: ESMO Clinical Practice Guidelines for diagnosis, treatment and follow-up Ann Oncol 2017 28 Suppl_4 10.1093/annonc/mdx220 28881916 10 Karamurzin YS Kiyokawa T Parkash V et al Gastric-type endocervical adenocarcinoma: an aggressive tumor with unusual metastatic patterns and poor prognosis Am J Surg Pathol 2015 39 11 1449 1457 26457350 10.1097/PAS.0000000000000532 PMC4976691 11 Wright JD Rosenblum K Huettner PC et al Cervical sarcomas: an analysis of incidence and outcome Gynecol Oncol 2005 99 2 348 351 16051326 10.1016/j.ygyno.2005.06.021 12 Olawaiye AB Cuello MA Rogers LJ. Cancer of the vulva: 2021 update Int J Gynaecol Obstet 2021 155 Suppl. 1 7 18 34669204 10.1002/ijgo.13881 PMC9298362 13 Dittmer C Katalinic A Mundhenke C et al Epidemiology of vulvar and vaginal cancer in Germany Arch Gynecol Obstet 2011 284 1 169 174 21340687 10.1007/s00404-011-1850-9 14 Carter JS Downs LS Jr. Vulvar and vaginal cancer Obstet Gynecol Clin North Am 2012 39 2 213 231 22640712 10.1016/j.ogc.2012.04.002 15 Baral SK Biswas P Kaium MA et al A comprehensive discussion in vaginal cancer based on mechanisms, treatments, risk factors and prevention Front Oncol 2022 12 883805 35924174 10.3389/fonc.2022.883805 PMC9341270 16 Hacker NF Eifel PJ van der Velden J. Cancer of the vagina Int J Gynaecol Obstet 2012 119 Suppl. 2 10.1016/S0020-7292(12)60022-8 22999510 17 National Cancer Institute Cervical cancer prognosis and survival rates 2023 18 Di Donato V Bellati F Fischetti M et al Vaginal cancer Crit Rev Oncol Hematol 2012 81 3 286 295 21571543 10.1016/j.critrevonc.2011.04.004 19 Small W Jr Bacon MA Bajaj A et al Cervical cancer: a global health crisis Cancer 2017 123 13 2404 2412 28464289 10.1002/cncr.30667 20 Bizzarri N Ghirardi V Alessandri F et al Bevacizumab for the treatment of cervical cancer Expert Opin Biol Ther 2016 16 3 407 419 26796332 10.1517/14712598.2016.1145208 21 Mauricio D Zeybek B Tymon-Rosario J et al Immunotherapy in cervical cancer Curr Oncol Rep 2021 23 6 61 33852056 10.1007/s11912-021-01052-8 22 Rogers LJ Cuello MA. Cancer of the vulva Int J Gynaecol Obstet 2018 143 Suppl. 2 4 13 10.1002/ijgo.12609 30306583 23 Mazzotta M Pizzuti L Krasniqi E et al Role of chemotherapy in vulvar cancers: time to rethink standard of care? Cancers (Basel) 2021 13 16 4061 34439215 10.3390/cancers13164061 PMC8391130 24 Hampl M Sarajuuri H Wentzensen N et al Effect of human papillomavirus vaccines on vulvar, vaginal, and anal intraepithelial lesions and vulvar cancer Obstet Gynecol 2006 108 6 1361 1368 17138767 10.1097/01.AOG.0000245786.86267.80 25 Madsen BS Jensen HL van den Brule AJ et al Risk factors for invasive squamous cell carcinoma of the vulva and vagina – population-based case-control study in Denmark Int J Cancer 2008 122 12 2827 2834 18348142 10.1002/ijc.23446 26 Moody CA Laimins LA. Human papillomavirus oncoproteins: pathways to transformation Nat Rev Cancer 2010 10 8 550 560 20592731 10.1038/nrc2886 27 Pal A Kundu R. Human papillomavirus E6 and E7: the cervical cancer hallmarks and targets for therapy Front Microbiol 2019 10 3116 32038557 10.3389/fmicb.2019.03116 PMC6985034 28 Burk RD Chen Z Saller C et al Integrated genomic and molecular characterization of cervical cancer Nature 2017 543 7645 378 384 28112728 10.1038/nature21386 PMC5354998 29 Friedman CF Ravichandran V Miller K et al Assessing the genomic landscape of cervical cancers: clinical opportunities and therapeutic targets Clin Cancer Res 2023 29 22 4660 4668 37643132 10.1158/1078-0432.CCR-23-1078 PMC10644000 30 Gagliardi A Porter VL Zong Z et al Analysis of Ugandan cervical carcinomas identifies human papillomavirus clade-specific epigenome and transcriptome landscapes Nat Genet 2020 52 8 800 810 32747824 10.1038/s41588-020-0673-7 PMC7498180 31 McIntyre JB Wu JS Craighead PS et al PIK3CA mutational status and overall survival in patients with cervical cancer treated with radical chemoradiotherapy Gynecol Oncol 2013 128 3 409 414 23266353 10.1016/j.ygyno.2012.12.019 32 Ojesina AI Lichtenstein L Freeman SS et al Landscape of genomic alterations in cervical carcinomas Nature 2014 506 7488 371 375 24390348 10.1038/nature12881 PMC4161954 33 Wright AA Howitt BE Myers AP et al Oncogenic mutations in cervical cancer: genomic differences between adenocarcinomas and squamous cell carcinomas of the cervix Cancer 2013 119 21 3776 3783 24037752 10.1002/cncr.28288 PMC3972000 34 Xiang L Jiang W Ye S et al ERBB2 mutation: a promising target in non-squamous cervical cancer Gynecol Oncol 2018 148 2 311 316 29279289 10.1016/j.ygyno.2017.12.023 35 Zammataro L Lopez S Bellone S et al Whole-exome sequencing of cervical carcinomas identifies activating ERBB2 and PIK3CA mutations as targets for combination therapy Proc Natl Acad Sci U S A 2019 116 45 22730 22736 31624127 10.1073/pnas.1911385116 PMC6842590 36 Hu Z Zhu D Wang W et al Genome-wide profiling of HPV integration in cervical cancer identifies clustered genomic hot spots and a potential microhomology-mediated integration mechanism Nat Genet 2015 47 2 158 163 25581428 10.1038/ng.3178 37 Otter SJ Chatterjee J Stewart AJ et al The role of biomarkers for the prediction of response to checkpoint immunotherapy and the rationale for the use of checkpoint immunotherapy in cervical cancer Clin Oncol (R Coll Radiol) 2019 31 12 834 843 31331818 10.1016/j.clon.2019.07.003 38 Godinho MF Wulfkuhle JD Look MP et al BCAR4 induces antioestrogen resistance but sensitises breast cancer to lapatinib Br J Cancer 2012 107 6 947 955 22892392 10.1038/bjc.2012.351 PMC3464772 39 Shi H Shao Y Lu W et al An analysis of HER2 amplification in cervical adenocarcinoma: correlation with clinical outcomes and the International Endocervical Adenocarcinoma Criteria and Classification J Pathol Clin Res 2021 7 1 86 95 33089969 10.1002/cjp2.184 PMC7737776 40 Fuchs I Vorsteher N Buhler H et al The prognostic significance of human epidermal growth factor receptor correlations in squamous cell cervical carcinoma Anticancer Res 2007 27 2 959 963 17465227 41 Lantuejoul S Sound-Tsao M Cooper WA et al PD-L1 testing for lung cancer in 2019: perspective from the IASLC pathology committee J Thorac Oncol 2020 15 4 499 519 31870882 10.1016/j.jtho.2019.12.107 42 Huang W Liu J Xu K et al PD-1/PD-L1 inhibitors for advanced or metastatic cervical cancer: from bench to bed Front Oncol 2022 12 849352 36313730 10.3389/fonc.2022.849352 PMC9614140 43 Heeren AM Punt S Bleeker MC et al Prognostic effect of different PD-L1 expression patterns in squamous cell carcinoma and adenocarcinoma of the cervix Mod Pathol 2016 29 7 753 763 27056074 10.1038/modpathol.2016.64 PMC4931542 44 Regauer S Reich O. Etiology of vulvar cancer will impact on treatment options and therapy outcome: two major pathways of vulvar cancer Gynecol Oncol 2013 131 1 246 247 23872111 10.1016/j.ygyno.2013.05.041 45 Carreras-Dieguez N Guerrero J Rodrigo-Calvo MT et al Molecular landscape of vulvar squamous cell carcinoma Int J Mol Sci 2021 22 13 7069 34209172 10.3390/ijms22137069 PMC8269046 46 Corey L Wallbillich JJ Wu S et al The genomic landscape of vulvar squamous cell carcinoma Int J Gynecol Pathol 2023 42 5 515 522 37131274 10.1097/PGP.0000000000000950 PMC10417246 47 Nooij LS Ter Haar NT Ruano D et al Genomic characterization of vulvar (pre)cancers identifies distinct molecular subtypes with prognostic significance Clin Cancer Res 2017 23 22 6781 6789 28899974 10.1158/1078-0432.CCR-17-1302 48 Trietsch MD Spaans VM ter Haar NT et al CDKN2A(p16) and HRAS are frequently mutated in vulvar squamous cell carcinoma Gynecol Oncol 2014 135 1 149 155 25072932 10.1016/j.ygyno.2014.07.094 49 Weberpals JI Lo B Duciaume MM et al Vulvar squamous cell carcinoma (VSCC) as two diseases: HPV status identifies distinct mutational profiles including oncogenic fibroblast growth factor receptor 3 Clin Cancer Res 2017 23 15 4501 4510 28377483 10.1158/1078-0432.CCR-16-3230 50 Williams EA Werth AJ Sharaf R et al Vulvar squamous cell carcinoma: comprehensive genomic profiling of HPV+ versus HPV− forms reveals distinct sets of potentially actionable molecular targets JCO Precis Oncol 2020 4 10.1200/PO.19.00406 PMC7446361 32923875 51 Zieba S Kowalik A Zalewski K et al Somatic mutation profiling of vulvar cancer: exploring therapeutic targets Gynecol Oncol 2018 150 3 552 561 29980281 10.1016/j.ygyno.2018.06.026 52 Salama AM Momeni-Boroujeni A Vanderbilt C et al Molecular landscape of vulvovaginal squamous cell carcinoma: new insights into molecular mechanisms of HPV-associated and HPV-independent squamous cell carcinoma Mod Pathol 2022 35 2 274 282 34650187 10.1038/s41379-021-00942-3 PMC9450957 53 Woelber L Prieske K Eulenburg C et al P53 and p16 expression profiles in vulvar cancer: a translational analysis by the Arbeitsgemeinschaft Gynakologische Onkologie Chemo and Radiotherapy in Epithelial Vulvar Cancer study group Am J Obstet Gynecol 2021 224 6 10.1016/j.ajog.2020.12.1220 33453182 54 Baandrup L Sand FL Aalborg GL et al PD-L1 expression in vulvar cancer: a systematic review and meta-analysis Histopathology 2024 84 5 742 752 38084642 10.1111/his.15112 55 Hou JY Baptiste C Hombalegowda RB et al Vulvar and vaginal melanoma: a unique subclass of mucosal melanoma based on a comprehensive molecular analysis of 51 cases compared with 2253 cases of nongynecologic melanoma Cancer 2017 123 8 1333 1344 28026870 10.1002/cncr.30473 56 Flaherty KT Gray RJ Chen AP et al Molecular landscape and actionable alterations in a genomically guided cancer clinical trial: National Cancer Institute Molecular Analysis for Therapy Choice (NCI-MATCH) J Clin Oncol 2020 38 33 3883 3894 33048619 10.1200/JCO.19.03010 PMC7676882 57 Monk BJ Sill MW Burger RA et al Phase II trial of bevacizumab in the treatment of persistent or recurrent squamous cell carcinoma of the cervix: a gynecologic oncology group study J Clin Oncol 2009 27 7 1069 1074 19139430 10.1200/JCO.2008.18.9043 PMC2667811 58 Tewari KS Sill MW Penson RT et al Bevacizumab for advanced cervical cancer: final overall survival and adverse event analysis of a randomised, controlled, open-label, phase 3 trial (Gynecologic Oncology Group 240) Lancet 2017 390 10103 1654 1663 28756902 10.1016/S0140-6736(17)31607-0 PMC5714293 59 Tewari KS Sill MW Long HJ 3rd et al Improved survival with bevacizumab in advanced cervical cancer N Engl J Med 2014 370 8 734 743 24552320 10.1056/NEJMoa1309748 PMC4010094 60 Redondo A Colombo N McCormack M et al Primary results from CECILIA, a global single-arm phase II study evaluating bevacizumab, carboplatin and paclitaxel for advanced cervical cancer Gynecol Oncol 2020 159 1 142 149 32763109 10.1016/j.ygyno.2020.07.026 61 Symonds RP Gourley C Davidson S et al Cediranib combined with carboplatin and paclitaxel in patients with metastatic or recurrent cervical cancer (CIRCCa): a randomised, double-blind, placebo-controlled phase 2 trial Lancet Oncol 2015 16 15 1515 1524 26474517 10.1016/S1470-2045(15)00220-X PMC4705431 62 Monk BJ Mas Lopez L Zarba JJ et al Phase II, open-label study of pazopanib or lapatinib monotherapy compared with pazopanib plus lapatinib combination therapy in patients with advanced and recurrent cervical cancer J Clin Oncol 2010 28 22 3562 3569 20606083 10.1200/JCO.2009.26.9571 63 Zhang L Chen L Yu H. Phase II study of apatinib, a novel tyrosine kinase inhibitor targeting tumor angiogenesis, as second-line treatment for recurrent or advanced cervical cancer patients Invest New Drugs 2020 38 4 1186 1191 31637668 10.1007/s10637-019-00858-5 64 Huang D He Q Zhai L et al Efficacy and safety of apatinib for the treatment of advanced or recurrent cervical cancer: a single-arm meta-analysis among Chinese patients Front Pharmacol 2022 13 843905 36034824 10.3389/fphar.2022.843905 PMC9403417 65 Frenel JS Le Tourneau C O’Neil B et al Safety and efficacy of pembrolizumab in advanced, programmed death ligand 1-positive cervical cancer: results from the phase Ib KEYNOTE-028 trial J Clin Oncol 2017 35 36 4035 4041 29095678 10.1200/JCO.2017.74.5471 66 Chung HC Ros W Delord JP et al Efficacy and safety of pembrolizumab in previously treated advanced cervical cancer: results from the phase II KEYNOTE-158 study J Clin Oncol 2019 37 17 1470 1478 30943124 10.1200/JCO.18.01265 67 Oaknin A Monk BJ Vergote I et al EMPOWER CERVICAL-1: effects of cemiplimab versus chemotherapy on patient-reported quality of life, functioning and symptoms among women with recurrent cervical cancer Eur J Cancer 2022 174 299 309 35922251 10.1016/j.ejca.2022.03.016 68 Grau-Bejar JF Garcia-Duran C Garcia-Illescas D et al Advances in immunotherapy for cervical cancer Ther Adv Med Oncol 2023 15 10.1177/17588359231163836 PMC10052578 37007635 69 Lan C Shen J Wang Y et al Camrelizumab plus apatinib in patients with advanced cervical cancer (CLAP): a multicenter, open-label, single-arm, phase II trial J Clin Oncol 2020 38 34 4095 4106 33052760 10.1200/JCO.20.01920 PMC7768345 70 An J Li X Wang J et al Efficacy and safety of serplulimab plus nab-paclitaxel in previously treated patients with PD-L1-positive advanced cervical cancer: a phase II, single-arm study Front Immunol 2023 14 1142256 37153587 10.3389/fimmu.2023.1142256 PMC10161140 71 Monk BJ Colombo N Tewari KS et al First-line pembrolizumab + chemotherapy versus placebo + chemotherapy for persistent, recurrent, or metastatic cervical cancer: final overall survival results of KEYNOTE-826 J Clin Oncol 2023 41 36 5505 5511 37910822 10.1200/JCO.23.00914 72 Oaknin A Gladieff L Martinez-Garcia J et al Atezolizumab plus bevacizumab and chemotherapy for metastatic, persistent, or recurrent cervical cancer (BEATcc): a randomised, open-label, phase 3 trial Lancet 2024 403 10421 31 43 38048793 10.1016/S0140-6736(23)02405-4 73 Monk BJ Toita T Wu X et al Durvalumab versus placebo with chemoradiotherapy for locally advanced cervical cancer (CALLA): a randomised, double-blind, phase 3 trial Lancet Oncol 2023 24 12 1334 1348 38039991 10.1016/S1470-2045(23)00479-5 74 Lorusso D Xiang Y Hasegawa K et al Pembrolizumab or placebo with chemoradiotherapy followed by pembrolizumab or placebo for newly diagnosed, high-risk, locally advanced cervical cancer (ENGOT-cx11/GOG-3047/KEYNOTE-A18): a randomised, double-blind, phase 3 clinical trial Lancet 2024 403 10434 1341 1350 38521086 10.1016/S0140-6736(24)00317-9 75 Serani S. FDA approves pembrolizumab plus chemoradiotherapy in high-risk cervical cancer Target Oncol https://www.targetedonc.com/view/fda-approves-pembrolizumab-in-high-risk-cervical-cancer 2024 76 Naumann RW Hollebecque A Meyer T et al Safety and efficacy of nivolumab monotherapy in recurrent or metastatic cervical, vaginal, or vulvar carcinoma: results from the phase I/II CheckMate 358 trial J Clin Oncol 2019 37 31 2825 2834 31487218 10.1200/JCO.19.00739 PMC6823884 77 Oaknin A Moore KN Meyer T et al 520MO Safety and efficacy of nivolumab (NIVO) ± ipilimumab (IPI) in patients (pts) with recurrent/metastatic cervical cancer (R/M Cx Ca) in checkmate 358 Ann Oncol 2022 33 78 O’Malley DM Neffa M Monk BJ et al Dual PD-1 and CTLA-4 checkpoint blockade using balstilimab and zalifrelimab combination as second-line treatment for advanced cervical cancer: an open-label phase II study J Clin Oncol 2022 40 7 762 771 34932394 10.1200/JCO.21.02067 PMC8887945 79 Wu X Ji J Lou H et al Efficacy and safety of cadonilimab, an anti-PD-1/CTLA4 bi-specific antibody, in previously treated recurrent or metastatic (R/M) cervical cancer: a multicenter, open-label, single-arm, phase II trial (075) Gynecol Oncol 2022 166 80 Wu X Sun Y Yang H et al Cadonilimab plus platinum-based chemotherapy with or without bevacizumab as first-line treatment for persistent, recurrent, or metastatic cervical cancer (COMPASSION-16): a randomised, double-blind, placebo-controlled phase 3 trial in China Lancet 2024 404 10463 1668 1676 39426385 10.1016/S0140-6736(24)02135-4 81 Setton J Selenica P Mukherjee S et al Germline RAD51B variants confer susceptibility to breast and ovarian cancers deficient in homologous recombination NPJ Breast Cancer 2021 7 1 135 34635660 10.1038/s41523-021-00339-0 PMC8505423 82 Thaker PH Salani R Brady WE et al A phase I trial of paclitaxel, cisplatin, and veliparib in the treatment of persistent or recurrent carcinoma of the cervix: an NRG Oncology Study (NCT#01281852) Ann Oncol 2017 28 3 505 511 27998970 10.1093/annonc/mdw635 PMC5815561 83 Jackson CG Moore KN Cantrell L et al A phase II trial of bevacizumab and rucaparib in recurrent carcinoma of the cervix or endometrium Gynecol Oncol 2022 166 1 44 49 35491267 10.1016/j.ygyno.2022.04.016 PMC10428664 84 Porter VL Marra MA. The drivers, mechanisms, and consequences of genome instability in HPV-driven cancers Cancers (Basel) 2022 14 19 4623 36230545 10.3390/cancers14194623 PMC9564061 85 Gonzalez-Ochoa E Milosevic M Corr B et al A phase I study of the Wee1 kinase inhibitor adavosertib (AZD1775) in combination with chemoradiation in cervical, upper vaginal, and uterine cancers Int J Gynecol Cancer 2023 33 8 1208 1214 37380217 10.1136/ijgc-2023-004491 PMC10711936 86 Banerjee S Leary A Stewart C et al ATR inhibitor alone (ceralasertib) or in combination with olaparib in gynaecological cancers with ARID1 loss or no loss: results from the ENGOT/GYN1/NCRI ATARI trial ESMO Open 2023 8 1 100814 87 Goncalves A Fabbro M Lhommé C et al A phase II trial to evaluate gefitinib as second- or third-line treatment in patients with recurring locoregionally advanced or metastatic cervical cancer Gynecol Oncol 2008 108 1 42 46 17980406 10.1016/j.ygyno.2007.07.057 88 Schilder RJ Sill MW Lee YC et al A phase II trial of erlotinib in recurrent squamous cell carcinoma of the cervix: a Gynecologic Oncology Group Study Int J Gynecol Cancer 2009 19 5 929 933 19574787 10.1111/IGC.0b013e3181a83467 PMC2722934 89 Farley J Sill MW Birrer M et al Phase II study of cisplatin plus cetuximab in advanced, recurrent, and previously treated cancers of the cervix and evaluation of epidermal growth factor receptor immunohistochemical expression: a Gynecologic Oncology Group study Gynecol Oncol 2011 121 2 303 308 21329967 10.1016/j.ygyno.2011.01.030 PMC3081894 90 Santin AD Sill MW McMeekin DS et al Phase II trial of cetuximab in the treatment of persistent or recurrent squamous or non-squamous cell carcinoma of the cervix: a Gynecologic Oncology Group study Gynecol Oncol 2011 122 3 495 500 21684583 10.1016/j.ygyno.2011.05.040 PMC3152667 91 Nogueira-Rodrigues A Moralez G Grazziotin R et al Phase 2 trial of erlotinib combined with cisplatin and radiotherapy in patients with locally advanced cervical cancer Cancer 2014 120 8 1187 1193 24615735 10.1002/cncr.28471 92 Oaknin A Friedman CF Roman LD et al Neratinib in patients with HER2-mutant, metastatic cervical cancer: findings from the phase 2 SUMMIT basket trial Gynecol Oncol 2020 159 1 150 156 32723675 10.1016/j.ygyno.2020.07.025 PMC8336424 93 Meric-Bernstam F Makker V Oaknin A et al Efficacy and safety of trastuzumab deruxtecan in patients with HER2-expressing solid tumors: primary results from the DESTINY-PanTumor02 phase II trial J Clin Oncol 2024 42 1 47 58 37870536 10.1200/JCO.23.02005 PMC10730032 94 Zhai C Cui Y Guo L et al Progress in the study of antibody-drug conjugates for the treatment of cervical cancer Front Oncol 2024 14 1395784 38903711 10.3389/fonc.2024.1395784 PMC11187480 95 Bertelsen BI Steine SJ Sandvei R et al Molecular analysis of the PI3K-AKT pathway in uterine cervical neoplasia: frequent PIK3CA amplification and AKT phosphorylation Int J Cancer 2006 118 8 1877 1883 16287065 10.1002/ijc.21461 96 Faried LS Faried A Kanuma T et al Expression of an activated mammalian target of rapamycin in adenocarcinoma of the cervix: a potential biomarker and molecular target therapy Mol Carcinog 2008 47 6 446 457 18058806 10.1002/mc.20402 97 Tinker AV Ellard S Welch S et al Phase II study of temsirolimus (CCI-779) in women with recurrent, unresectable, locally advanced or metastatic carcinoma of the cervix. A trial of the NCIC Clinical Trials Group (NCIC CTG IND 199) Gynecol Oncol 2013 130 2 269 274 23672928 10.1016/j.ygyno.2013.05.008 98 Piha-Paul SA Wheler JJ Fu S et al Advanced gynecologic malignancies treated with a combination of the VEGF inhibitor bevacizumab and the mTOR inhibitor temsirolimus Oncotarget 2014 5 7 1846 1855 24742900 10.18632/oncotarget.1834 PMC4039109 99 Moroney JW Schlumbrecht MP Helgason T et al A phase I trial of liposomal doxorubicin, bevacizumab, and temsirolimus in patients with advanced gynecologic and breast malignancies Clin Cancer Res 2011 17 21 6840 6846 21890452 10.1158/1078-0432.CCR-11-0666 PMC3207033 100 de Melo AC Grazziotin-Reisner R Erlich F et al A phase I study of mTOR inhibitor everolimus in association with cisplatin and radiotherapy for the treatment of locally advanced cervix cancer: PHOENIX I Cancer Chemother Pharmacol 2016 78 1 101 109 27206639 10.1007/s00280-016-3064-0 101 Banerji U Dean EJ Perez-Fidalgo JA et al A Phase I open-label study to identify a dosing regimen of the Pan-AKT inhibitor AZD5363 for evaluation in solid tumors and in PIK3CA-mutated breast and gynecologic cancers Clin Cancer Res 2018 24 9 2050 2059 29066505 10.1158/1078-0432.CCR-17-2260 102 Strauss J Gatti-Mays ME Cho BC et al Bintrafusp alfa, a bifunctional fusion protein targeting TGF-beta and PD-L1, in patients with human papillomavirus-associated malignancies J Immunother Cancer 2020 8 2 10.1136/jitc-2020-001395 PMC7745517 33323462 103 Birrer M Li G Yunokawa M et al Bintrafusp alfa for recurrent or metastatic cervical cancer after platinum failure: a nonrandomized controlled trial JAMA Oncol 2024 10 9 1204 1211 39052242 10.1001/jamaoncol.2024.2145 PMC11273284 104 Oaknin A Ghamande SA Kasamatsu Y et al Phase I trial of first-line bintrafusp alfa in patients with locally advanced or persistent/recurrent/metastatic cervical cancer Clin Cancer Res 2024 30 5 975 983 38165683 10.1158/1078-0432.CCR-23-1829 PMC10905521 105 Wang R Hu B Pan Z et al Antibody-drug conjugates (ADCs): current and future biopharmaceuticals J Hematol Oncol 2025 18 1 51 40307936 10.1186/s13045-025-01704-3 PMC12044742 106 Vergote I Gonzalez-Martin A Fujiwara K et al Tisotumab vedotin as second- or third-line therapy for recurrent cervical cancer N Engl J Med 2024 391 1 44 55 38959480 10.1056/NEJMoa2313811 107 Coleman RL Lorusso D Gennigens C et al Efficacy and safety of tisotumab vedotin in previously treated recurrent or metastatic cervical cancer (innovaTV 204/GOG-3023/ENGOT-cx6): a multicentre, open-label, single-arm, phase 2 study Lancet Oncol 2021 22 5 609 619 33845034 10.1016/S1470-2045(21)00056-5 108 Mantovani G Fragomeni SM Inzani F et al Molecular pathways in vulvar squamous cell carcinoma: implications for target therapeutic strategies J Cancer Res Clin Oncol 2020 146 7 1647 1658 32335720 10.1007/s00432-020-03226-6 PMC11804399 109 Woelber L Mathey S Prieske K et al Targeted therapeutic approaches in vulvar squamous cell cancer (VSCC): case series and review of the literature Oncol Res 2021 28 6 645 659 33308371 10.3727/096504020X16076861118243 PMC7962928 110 Ott PA Bang YJ Piha-Paul SA et al T-cell-inflamed gene-expression profile, programmed death ligand 1 expression, and tumor mutational burden predict efficacy in patients treated with pembrolizumab across 20 cancers: KEYNOTE-028 J Clin Oncol 2019 37 4 318 327 30557521 10.1200/JCO.2018.78.2276 111 Shapira-Frommer R Mileshkin L Manzyuk L et al Efficacy and safety of pembrolizumab for patients with previously treated advanced vulvar squamous cell carcinoma: results from the phase 2 KEYNOTE-158 study Gynecol Oncol 2022 166 2 211 218 35361487 10.1016/j.ygyno.2022.01.029 112 How JA Jazaeri AA Soliman PT et al Pembrolizumab in vaginal and vulvar squamous cell carcinoma: a case series from a phase II basket trial Sci Rep 2021 11 1 3667 33574401 10.1038/s41598-021-83317-7 PMC7878854 113 Shields LBE Gordinier ME Pembrolizumab in recurrent squamous cell carcinoma of the vulva: case report and review of the literature Gynecol Obstet Invest 2019 84 1 94 98 30016784 10.1159/000491090 114 Ladbury C Germino E Novak J et al Combination radiation and immunotherapy in gynecologic malignancies – a comprehensive review Transl Cancer Res 2021 10 5 2609 2619 35116574 10.21037/tcr-20-3019 PMC8797685 115 Woelber L Hess S Bohlken H et al EGFR gene copy number increase in vulvar carcinomas is linked with poor clinical outcome J Clin Pathol 2012 65 2 133 139 22128196 10.1136/jcp-2010-079806 116 Horowitz NS Olawaiye AB Borger DR et al Phase II trial of erlotinib in women with squamous cell carcinoma of the vulva Gynecol Oncol 2012 127 1 141 146 22750258 10.1016/j.ygyno.2012.06.028 117 Olawaiye A Lee LM Krasner C et al Treatment of squamous cell vulvar cancer with the anti-EGFR tyrosine kinase inhibitor Tarceva Gynecol Oncol 2007 106 3 628 630 17561233 10.1016/j.ygyno.2007.05.006 118 Lloyd J Flanagan AM. Mammary and extramammary Paget’s disease J Clin Pathol 2000 53 10 742 749 11064666 10.1136/jcp.53.10.742 PMC1731095 119 Perez JC Salgado AC Perez-Mies B et al Extramammary Paget disease: a therapeutic challenge, for a rare entity Curr Oncol Rep 2023 25 10 1081 1094 37421583 10.1007/s11912-023-01434-0 PMC10556167 120 Bartoletti M Mazzeo R De Scordilli M et al Human epidermal growth factor receptor-2 (HER2) is a potential therapeutic target in extramammary Paget’s disease of the vulva Int J Gynecol Cancer 2020 30 11 1672 1677 32998859 10.1136/ijgc-2020-001771 121 Condic M Egger EK Klumper N et al TROP-2 is widely expressed in vulvar squamous cell carcinoma and represents a potential new therapeutic target J Cancer Res Clin Oncol 2023 149 11 8235 8241 37067548 10.1007/s00432-023-04761-8 PMC10374825 122 Nelson BE Tsimberidou AM Fu X et al A phase I trial of bevacizumab and temsirolimus in combination with valproic acid in advanced solid tumors Oncologist 2023 28 12 10.1093/oncolo/oyad158 PMC10712705 37311055 ",
  "metadata": {
    "Title of this paper": "A phase I trial of bevacizumab and temsirolimus in combination with valproic acid in advanced solid tumors",
    "Journal it was published in:": "Therapeutic Advances in Medical Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477399/"
  }
}