{
  "title": "Paper_1171",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473062 PMC12473062.1 12473062 12473062 41011154 10.3390/ph18091281 pharmaceuticals-18-01281 1 Review Epigenetic Alterations in Hepatocellular Carcinoma: Mechanisms, Biomarkers, and Therapeutic Implications https://orcid.org/0000-0003-1555-2820 Wali Adil Farooq 1 * https://orcid.org/0009-0006-3996-882X Ansari Abid Reza 2 https://orcid.org/0000-0001-6512-9866 Mir Prince Ahad 3 https://orcid.org/0000-0002-4735-5445 El-Tanani Mohamed 1 https://orcid.org/0000-0002-9456-2033 Babiker Rasha 4 https://orcid.org/0000-0002-3554-1750 Hussain Md Sadique 5 https://orcid.org/0000-0001-7208-8396 Uppal Jasreen 3 Zargar Asma Ishrat 6 https://orcid.org/0000-0002-6825-1338 Mir Reyaz Hassan 7 * Chen Liqiang Academic Editor 1 2 3 4 5 sadiquehussain007@gmail.com 6 7 * farooq@rakmhsu.ac.ae mirreyaz.phscct@uok.edu.in 27 8 2025 9 2025 18 9 497460 1281 27 7 2025 21 8 2025 26 8 2025 27 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Hepatocellular carcinoma (HCC), the most prevalent primary liver cancer, continues to pose a significant global health burden due to its high mortality rate. In addition to genetic alterations, epigenetic aberrations, including DNA methylation, histone modifications, chromatin remodeling, and noncoding RNA (ncRNA) dysregulation, play critical roles in HCC initiation and progression. Notably, miR-375 and miR-483-5p are among the most dysregulated miRNAs in HCC, with their altered expression levels closely associated with tumor stage and patient survival. These epigenetic modifications offer promising therapeutic avenues due to their reversibility and dynamic nature. Furthermore, specific epigenetic signatures such as CDH1 promoter hypermethylation and HOTAIR overexpression are being explored as potential biomarkers for early detection and treatment response. In this chapter, we review recent advances in the epigenetic landscape of HCC and discuss their diagnostic and therapeutic implications, highlighting their potential to improve patient outcomes through personalized medicine approaches. DNA methylation epigenetics histone methylation liver damage ncRNAs (noncoding ribonucleic acid) This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Hepatocellular carcinoma (HCC), the most common form of primary liver cancer, is a highly lethal malignancy with a complex molecular etiology involving both genetic and epigenetic alterations. Globally, liver cancer accounts for over 800,000 deaths annually, ranking as the third leading cause of cancer-related mortality, and second leading cause of cancer-related mortality in men [ 1 2 3 4 5 6 7 TP53 CTNNB1 8 9 10 11 12 13 14 15 Table 1 HCC is mainly caused by cirrhosis of any etiology [ 16 17 18 19 20 21 19 22 23 24 25 26 27 2. Epigenetics Epigenetics represents one of the fastest and most rapidly changing branches of biological study nowadays. The findings of the epigenome have called into question the idea that the genetic code is the only foundation for biological heredity. It is now understood that DNA bases may be changed without changing the nucleotide sequence, and it is believed this “epigenome” can be controlled by a range of environmental variables such as chemicals, diet, surroundings, anxiety, and aging [ 28 29 Conrad Waddington used the word epigenetics at the beginning of the 1940s to describe the “branch of biology which investigates the underlying relationships among genes and the outcomes that brought the phenotype into existence” [ 30 31 32 33 34 35 36 37 2.1. Epigenetic Modifiers All biological processes that modify gene expression in a reversible, transmissible, and adaptable manner without changing the DNA sequence are included in epigenetic alterations. Epigenetic changes, as defined by Conrad Waddington, were first identified in the differentiation of cells [ 38 39 40 41 42 DNA methylation, which includes the incorporation of a methyl group into the DNA molecule and relates to gene silencing, represents one of the most well-studied epigenetic changes [ 43 44 45 46 47 48 49 50 51 Because of their potential as medicinal targets for a variety of disorders, epigenetic modulators have received a lot of interest in the field of biomedical science. The epigenetic imbalance has been linked to a variety of illnesses, notably tumors [ 52 53 54 55 56 57 58 59 60 61 62 2.1.1. Histone Modification Posttranslational histone alterations, like DNA methylation, do not affect DNA sequencing but can alter its accessibility to transcriptional activity. However, histone alterations perform additional functions; the most well-known is their involvement in restoring DNA in the aftermath of cell injury [ 63 64 65 66 67 63 68 69 Histone Acetylation: 70 71 72 73 74 Histone Methylation: 75 76 77 78 79 Histone Phosphorylation: 80 81 82 83 84 85 86 87 88 Histone Ubiquitination: 89 90 91 92 93 94 95 96 97 98 99 100 Figure 1 It is important to distinguish between the two major layers of epigenetic regulation that affect gene expression in HCC. On one hand, chromatin-modifying processes, such as histone acetylation, methylation, phosphorylation, and ubiquitination, directly influence DNA accessibility to the transcriptional machinery by altering chromatin structure. These modifications either promote or suppress transcription initiation [ 101 102 2.1.2. Epigenetic Association of ncRNA in HCC In recent years, there has been growing interest in understanding the role of ncRNAs in the epigenetic regulation of HCC. ncRNAs are a broad class of RNA transcripts that do not code for proteins but play important regulatory roles in a variety of biological operations [ 103 104 105 106 107 108 109 110 111 112 113 114 The sncRNAs are <200 nucleotides long [ 115 116 117 118 119 120 121 122 123 LncRNAs are a diverse set of transcripts with >200 nucleotides but without protein-coding capabilities [ 124 125 126 127 125 128 129 130 131 132 133 134 PIWI-interacting RNAs (piRNAs) represent a distinct class of small non-coding RNAs that interact with PIWI proteins to regulate gene expression, transposon silencing, and genomic stability. Although initially thought to function primarily in germline cells, piRNAs are now recognized for their roles in somatic tissues and cancer, including HCC [ 135 136 Circular RNAs (circRNAs) are a class of covalently closed-loop non-coding RNAs formed by back-splicing events. Unlike linear RNAs, circRNAs lack 5′ caps and 3′ tails, which grants them exceptional stability. A key function of circRNAs is their role as microRNA (miRNA) sponges, where they sequester miRNAs via complementary binding sites and thus relieve repression on target mRNAs. This miRNA sponging mechanism is central to the ceRNA hypothesis, which describes a complex post-transcriptional regulatory network where different RNA molecules, such as circRNAs, lncRNAs, and mRNAs, compete for shared miRNAs [ 137 138 The improper functioning of ncRNAs in HCC entails changes regarding their epigenetic markings as well as changes in their expression rates. Epigenetic alterations, involving DNA methylation and histone modifications, can have a direct impact on ncRNA production in HCC [ 139 140 141 142 143 144 145 Identifying the epigenetic connection of ncRNAs in HCC offers significant promise for improving early detection and personalized treatment approaches. Currently, diagnostic strategies such as serum alpha-fetoprotein (AFP) testing and imaging modalities like ultrasound and MRI are widely used, but they suffer from limited sensitivity and specificity, particularly in early-stage HCC [ 146 147 148 149 150 151 152 Figure 2 Emerging evidence supports the role of ncRNAs as diagnostic and prognostic biomarkers in HCC. Circulating miRNAs such as miR-21 and lncRNAs like HULC have been proposed as non-invasive serum markers [ 2 2.1.3. DNA Methylation DNA methylation markers include 5-methyl-cytosine (5mC), mediated by DNMT1, DNMT3A, and DNMT3B, and 5-hydroxymethylcytosine (5hmC), mediated by TET1, TET2, and TET3. DNA methylation controls gene expression. This epigenetic modification contributes to modulating gene expression and has emerged as a promising therapeutic target for early detection and prognostic assessment in HCC. Aberrant DNA methylation patterns are a hallmark of liver cancer progression. For instance, in a subset of liver cancer patients characterized by CD133 + + + + 153 CSF2 IFITM5 IL9 154 DNA hypomethylation primarily occurs in repetitive DNA sequences, or CpG sites, in liver cancer (apart from CpG islands). Genomic instability, frequent mutations, and rearrangements that take place in chromatin areas with inactive sites are the precursors to hypomethylation in DNA. It was discovered that global hypomethylation encouraged the production of transcription factors. According to research, the enhancer hypomethylation developed as a tool for cancer therapies to identify overexpressed transcription factors. A transcription factor called CEBP enhancer, which is overexpressed in patients with liver cancer, was shown to have hypomethylation throughout the entire genome after examination of affinity and bisulfite-based whole genome sequencing. These enhancers, which are non-coding, are linked to the detection of cells that are dysregulated and controlled by a combination of BRD4, H3K27ac, and transcription factors. However, it is a challenging procedure because cancer care options involve hypomethylating drugs. Additionally, it was shown that the promoter regions of the enzymes phosphoglycerate kinase (PGK1), pyruvate dehydrogenase kinase 1 (PDHK1), glycolytic, and protein kinase were considerably hypomethylated and phosphorylated. The pan-cancer research also revealed that higher PGK1 and PDHK1 mRNA levels are linked to advanced TNM stages and worse overall survival in several malignancies, including liver cancer. The majority of DNA hypermethylation occurs at cis-regulatory elements and promoter-associated CpG island sites (CGIs), which are linked to lower gene expression. The region-specific hypermethylation encourages tumour suppressor genes to be silenced. APC and CDKN2A are two hypermethylated gene promoters that can discriminate between the tumours of liver cancer and the surrounding nontumorous liver tissues [ 155 156 157 158 TSGs are among the genes that are hypermethylated in liver cancer. TSGs such as RASSF1 APC CDKN1A CDH1 NEFH34 NOTCH3 159 160 161 The elevated expression of enzymes like DNMTs causes the modification in DNA methylation, which is connected to a poor prognosis. For instance, liver cancer upregulates the expression of DNMT3a and DNMT3b, while chronic hepatitis upregulates DNMT1 and DNMT3a. Thus, by encouraging survival pathways, these enzymes cause the growth of tumours. For example, the Snail pathway induces CpG methylation via DNMT1 expression at the promoter region of E-cadherin and supports dysregulated signalling cascades, including PI3K/Akt/GSK3 implicated in cancer growth and metastasis. Similar to this, in liver cancer, DNMT3 also facilitates the epigenetic activation of metastasis-associated protein 1 (MTA1). In HCC, DNMT3a-mediated methylation has been linked to upregulation of MTA1 162 163 164 2.1.4. mRNA Methylation The epigenetic alteration of mRNA, known as m6A methylation, has a role in the carcinogenesis of HCC. Methyltransferase-like 3 (METTL3) and Wilms tumour 1-associated protein (WTAP) are components of the mRNA methyltransferase complex, which mediates the methylation process [ 165 166 167 METTL3 overexpression has been correlated with poor prognosis, increased tumor grade, and reduced survival in HCC patients. High METTL3 activity enhances m6A modifications on tumor suppressor transcripts, leading to their degradation via YTHDF2 [ 168 169 2.2. Bioinformatics Tools and Databases for Epigenetic Target Discovery The advent of large-scale omics technologies has necessitated the use of computational tools to analyze epigenetic changes in HCC. Platforms like The Cancer Genome Atlas (TCGA) and the International Human Epigenome Consortium (IHEC) offer integrated genomic and epigenomic datasets across tumor types. Tools such as MethHC, UALCAN, and TIMER enable visualization and analysis of DNA methylation and histone modification patterns linked with gene expression and immune infiltration [ 170 154 171 3. Epigenetic Biomarkers Epigenetic changes, such as DNA methylation, histone alterations, and ncRNAs, serve as biomarkers for the detection and prognosis of HCC. Several epigenetic changes are critical for the development and spread of HCC and work in concert to regulate EMT. For example, there is a negative correlation between the generation of E-cadherin and hypermethylation of the CDH1 transcriptional promoter region. Numerous EMT transcriptional variables control the epigenetically expressed CDH1 gene [ 172 173 174 175 176 177 circRNAs exhibit high stability and hold significant promise as screening biomarkers for HCC. Comparing HCC to non-tumor tissue, prior investigations found that around 35 circRNAs had been reduced and 26 had been elevated [ 178 179 Likewise, a circRNA microarray experiment revealed that HCC had variable expression of the genes hsa_circ_0128298 and hsa_circ_0004018 [ 180 181 182 183 Exosomal circPTGR1, which facilitates metastasis through the miR449a-MET process, has also been identified in the metastatic liver cancer cell line (LM3) [ 184 185 186 187 188 Figure 3 miRNA Biomarkers in Diagnosis and Prognosis MicroRNAs in HCC could be employed as biomarkers for therapy monitoring and diagnostics [ 189 190 191 192 192 190 190 193 In one investigation, all HCC patients tested positive for HBV, which is consistent with previous studies identifying HBV infection as a major etiological factor in the pathogenesis of HCC [ 119 Table 2 In a study where mRNA expression and DNA methylation were monitored in specimens from patients, the strategy of uniting two distinct kinds of biomarkers had been suggested for early HCC diagnosis. The researchers found that abnormal ABCB6 mRNA and DNA methylation rates were better predictors than a single marker by itself [ 194 195 4. Conclusions Epigenetic dysregulation in HCC is critical to its pathology, progression, and therapeutic resistance. This review highlights the importance of major epigenetic processes, including DNA methylation, histone modifications, and non-coding RNA regulation, not only in regulating gene expression but also as a potential prognostic and diagnostic biomarker. The elucidation of hypermethylated tumor suppressor genes, the deregulated histone marks, and abnormal ncRNAs can formulate a base understanding of hepatocarcinogenesis and give hope to therapeutic targets to unblock its occurrence. Nevertheless, there are a number of obstacles that are preventing the clinical applicability of epigenetic discoveries. First, HCCs are heterogeneous among patients and etiologies, which makes biomarker validation a challenge. Second, although several epigenetic modifications have been detected, very few have been functionally validated and used in clinical practice. Beyond that, the majority of the available epigenetic therapies are confined to hematological malignancies, and they have not yet shown significant efficacy in treating solid tumors, including HCC. In the future, combining epigenomic profiling with other omics data (such as transcriptomics, proteomics, and metabolomics) has the potential to improve the discovery of biomarkers and patient stratification. Recent technological advances, including liquid biopsy and single-cell epigenomics, have the potential to provide non-invasive, real-time evolution tracking of tumors. Additionally, new epigenetic therapeutics like isoform-specific histone deacetylase inhibitors, non-coding RNA mimetics or antagonists, and epigenome editing with CRISPR will potentially address the shortcomings of conventional therapeutics by being more targeted, permanent, and patient-specific. Acknowledgments The Authors acknowledge the University of Kashmir for providing the necessary facilities to carry out this work. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, A.F.W., A.R.A., P.A.M. and R.H.M.; methodology, A.F.W., A.R.A., P.A.M. and R.H.M.; software, R.B.; formal analysis, R.B., M.S.H., J.U. and A.I.Z.; investigation, A.F.W., A.R.A., P.A.M. and R.H.M.; resources, M.E.-T.; writing—original draft preparation, A.F.W., A.R.A., P.A.M., R.H.M., and R.B.; writing—review and editing, M.E.-T., A.F.W., and R.H.M.; supervision, M.E.-T. and A.F.W. All authors have read and agreed to the published version of the manuscript. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflicts of interest, financial or otherwise. Abbreviations HCC—hepatocellular carcinoma, HER2—human epidermal growth factor receptor 2, BRCA1—breast cancer gene-1, BRCA2—breast cancer gene-2, p53—tumor protein p53 gene, TP53—tumor protein 53, IHD—ischemic heart disease, DNA—deoxyribonucleic acid, RNA—ribonucleic acid, miRNA—microRNA, lcnRNA—long noncoding RNA, DNMTs—DNA methyltransferases, TCGA—the cancer genome atlas, IHEC—the international human epigenome consortium, ncRNA—non-coding RNAs, lncRNAs—long non-coding RNAs, sncRNAs—short non-coding RNAs, HATs—histone acetyltransferases, HDACs—histone deacetylases, HMT—Histone methyltransferase, SAM—S-adenosyl methionine, H3S10ph—Histone3 phosphorylation at serine 10, H3S28ph—H3 at serine 28, H2AS1ph—H2A at serine 1, H2BS10ph—H2B at serine 10, H2AK119ub—H2A lysine 119, H2BK120ub—H2B lysine 120, PcG—Polycomb group, siRNA—Small interfering RNA, miRNA—micro-RNA, rRNA—ribosomal RNA, tRNA—transfer RNA, HOTAIR—HOX transcript antisense intergenic RNA, PRC2—polycomb repressive complex 2, 5hmC—5 hydroxymethyl cytosine, 5mC—5 methyl cytosine, LSD—Lysine-specific demethylase, TET—Ten-eleven translocation References 1. Guo Q. Zhu X. Beeraka N.M. Zhao R. Li S. Li F. Mahesh P.A. Nikolenko V.N. Fan R. Liu J. Projected epidemiological trends and burden of liver cancer by 2040 based on GBD, CI5plus, and WHO data Sci. Rep. 2024 14 28131 10.1038/s41598-024-77658-2 39548154 PMC11568312 2. Hussain M.S. Moglad E. Afzal M. Gupta G. Hassan Almalki W. Kazmi I. Alzarea S.I. Kukreti N. Gupta S. Kumar D. Non-coding RNA mediated regulation of PI3K/Akt pathway in hepatocellular carcinoma: Therapeutic perspectives Pathol. Res. Pract. 2024 258 155303 10.1016/j.prp.2024.155303 38728793 3. Wang Z. Li Y. Wang X. Zhang W. Chen Y. Lu X. Jin C. Tu L. Jiang T. Yang Y. Precision Strike Strategy for Liver Diseases Trilogy with Xiao-Chai-Hu Decoction: A Meta-Analysis with Machine Learning Phytomedicine 2025 142 156796 10.1016/j.phymed.2025.156796 40347886 4. Kontomanolis E.N. Koutras A. Syllaios A. Schizas D. Mastoraki A. Garmpis N. Diakosavvas M. Angelou K. Tsatsaris G. Pagkalos A. Role of oncogenes and tumor-suppressor genes in carcinogenesis: A review Anticancer Res. 2020 40 6009 6015 10.21873/anticanres.14622 33109539 5. Wang J. Tao X. Liu Z. Yan Y. Cheng P. Liu B. Du H. Niu B. Noncoding RNAs in sepsis-associated acute liver injury: Roles, mechanisms, and therapeutic applications Pharmacol. Res. 2025 212 107596 10.1016/j.phrs.2025.107596 39800175 6. Chen F. Zhang K. Wang M. He Z. Yu B. Wang X. Pan X. Luo Y. Xu S. Lau J.T.Y. VEGF-FGF Signaling Activates Quiescent CD63 + Adv. Sci. 2024 11 e2308711 10.1002/advs.202308711 PMC11434209 38881531 7. Wu S. Powers S. Zhu W. Hannun Y.A. Substantial contribution of extrinsic risk factors to cancer development Nature 2016 529 43 47 10.1038/nature16166 26675728 PMC4836858 8. Islam M.R. Rauf A. Alash S. Fakir M.N.H. Thufa G.K. Sowa M.S. Mukherjee D. Kumar H. Hussain M.S. Aljohani A.S.M. A comprehensive review of phytoconstituents in liver cancer prevention and treatment: Targeting insights into molecular signaling pathways Med. Oncol. 2024 41 134 10.1007/s12032-024-02333-5 38703282 9. Zheng P. Xu D. Cai Y. Zhu L. Xiao Q. Peng W. Chen B. A multi-omic analysis reveals that Gamabufotalin exerts anti-hepatocellular carcinoma effects by regulating amino acid metabolism through targeting STAMBPL1 Phytomedicine 2024 135 156094 10.1016/j.phymed.2024.156094 39348778 10. Riddihough G. Zahn L.M. What is epigenetics? Science 2010 330 611 10.1126/science.330.6004.611 21030643 11. Mir R.H. Mohi-ud-din R. Wani T.U. Dar M.O. Shah A.J. Lone B. Pooja C. Masoodi M.H. Indole: A privileged heterocyclic moiety in the management of cancer Curr. Org. Chem. 2021 25 724 736 12. Chang H. Wang D. Xia W. Pan X. Huo W. Xu S. Li Y. Epigenetic disruption and glucose homeostasis changes following low-dose maternal bisphenol A exposure Toxicol. Res. 2016 5 1400 1409 10.1039/C6TX00047A 30090444 PMC6061978 13. Mattiuzzi C. Lippi G. Current cancer epidemiology J. Epidemiol. Glob. Health 2019 9 217 222 10.2991/jegh.k.191008.001 31854162 PMC7310786 14. Hassan R. Mohi-Ud-Din R. Dar M.O. Shah A.J. Mir P.A. Shaikh M. Pottoo F.H. Bioactive heterocyclic compounds as potential therapeutics in the treatment of gliomas: A review Anti-Cancer Agents Med. Chem. 2022 22 551 565 10.2174/1871520621666210901112954 34488596 15. Mir R.H. Mir P.A. Uppal J. Chawla A. Patel M. Bardakci F. Adnan M. Mohi-Ud-Din R. Evolution of Natural Product Scaffolds as Potential Proteasome Inhibitors in Developing Cancer Therapeutics Metabolites 2023 13 509 10.3390/metabo13040509 37110167 PMC10142660 16. Chen F. Wang Z. Yao H. Liu Q. Gan Y. Xu S. Bao H. Jin Y. Hu Y.P. Gao J. Large-scale manufacturing of human gallbladder epithelial cell products and derived hepatocytes via a chemically defined approach Trends Biotechnol. 2025 10.1016/j.tibtech.2025.04.009 40399214 17. Perisetti A. Goyal H. Yendala R. Thandassery R.B. Giorgakis E. Non-cirrhotic hepatocellular carcinoma in chronic viral hepatitis: Current insights and advancements World J. Gastroenterol. 2021 27 3466 3482 10.3748/wjg.v27.i24.3466 34239263 PMC8240056 18. Budny A. Kozłowski P. Kamińska M. Jankiewicz M. Kolak A. Budny B. Budny W. Niemunis-Sawicka J. Szczypiór G. Kurniawka B. Epidemiology and risk factors of hepatocellular carcinoma Pol. Merkur. Lek. Organ Pol. Tow. Lek. 2017 43 133 139 28987047 19. Pogribny I.P. Rusyn I. Role of epigenetic aberrations in the development and progression of human hepatocellular carcinoma Cancer Lett. 2014 342 223 230 10.1016/j.canlet.2012.01.038 22306342 PMC3971756 20. El–Serag H.B. Rudolph K.L. Hepatocellular carcinoma: Epidemiology and molecular carcinogenesis Gastroenterology 2007 132 2557 2576 10.1053/j.gastro.2007.04.061 17570226 21. Mohi-Ud-Din R. Mir R.H. Sawhney G. Dar M.A. Bhat Z.A. Possible pathways of hepatotoxicity caused by chemical agents Curr. Drug Metab. 2019 20 867 879 10.2174/1389200220666191105121653 31702487 22. Wallace M.C. Preen D. Jeffrey G.P. Adams L.A. The evolving epidemiology of hepatocellular carcinoma: A global perspective Expert Rev. Gastroenterol. Hepatol. 2015 9 765 779 10.1586/17474124.2015.1028363 25827821 23. Ma L. Chua M. Andrisani O. So S. Epigenetics in hepatocellular carcinoma: An update and future therapy perspectives World J. Gastroenterol. 2014 20 333 345 10.3748/wjg.v20.i2.333 24574704 PMC3923010 24. Bayo J. Fiore E.J. Dominguez L.M. Real A. Malvicini M. Rizzo M. Atorrasagasti C. García M.G. Argemi J. Martinez E.D. A comprehensive study of epigenetic alterations in hepatocellular carcinoma identifies potential therapeutic targets J. Hepatol. 2019 71 78 90 10.1016/j.jhep.2019.03.007 30880225 25. Huang Y. Yu W. Advances in Immune Checkpoint Therapy in Hepatocellular Carcinoma Br. J. Hosp. Med. 2024 85 1 21 10.12968/hmed.2024.0375 39347660 26. Liu W.-R. Shi Y.-H. Peng Y.-f. Fan J. Epigenetics of hepatocellular carcinoma: A new horizon Chin. Med. J. 2012 125 2349 2360 22882861 27. Yang H. Zhou H. Fu M. Xu H. Huang H. Zhong M. Zhang M. Hua W. Lv K. Zhu G. TMEM64 aggravates the malignant phenotype of glioma by activating the Wnt/β-catenin signaling pathway Int. J. Biol. Macromol. 2024 260 129332 10.1016/j.ijbiomac.2024.129332 38232867 28. Anway M.D. Leathers C. Skinner M.K. Endocrine disruptor vinclozolin induced epigenetic transgenerational adult-onset disease Endocrinology 2006 147 5515 5523 10.1210/en.2006-0640 16973726 PMC5940332 29. Weaver I.C. Champagne F.A. Brown S.E. Dymov S. Sharma S. Meaney M.J. Szyf M. Reversal of maternal programming of stress responses in adult offspring through methyl supplementation: Altering epigenetic marking later in life J. Neurosci. 2005 25 11045 11054 10.1523/JNEUROSCI.3652-05.2005 16306417 PMC6725868 30. Waddington C.H. The epigenotype. 1942 Int. J. Epidemiol. 2012 41 10 13 10.1093/ije/dyr184 22186258 31. Riggs A.D. X inactivation, differentiation, and DNA methylation Cytogenet. Cell Genet. 1975 14 9 25 10.1159/000130315 1093816 32. Nanney D.L. Epigenetic Control Systems Proc. Natl. Acad. Sci. USA 1958 44 712 717 10.1073/pnas.44.7.712 16590265 PMC528649 33. Holliday R. Pugh J.E. DNA modification mechanisms and gene activity during development Science 1975 187 226 232 10.1126/science.187.4173.226 1111098 34. Lo A. Qi L. Genetic and epigenetic control of gene expression by CRISPR-Cas systems F1000Research 2017 6 747 10.12688/f1000research.11113.1 PMC5464239 28649363 35. Dupras C. Saulnier K.M. Joly Y. Epigenetics, ethics, law and society: A multidisciplinary review of descriptive, instrumental, dialectical and reflexive analyses Soc. Stud. Sci. 2019 49 785 810 10.1177/0306312719866007 31366289 PMC6801799 36. Fallet M. Blanc M. Di Criscio M. Antczak P. Engwall M. Guerrero Bosagna C. Rüegg J. Keiter S.H. Present and future challenges for the investigation of transgenerational epigenetic inheritance Environ. Int. 2023 172 107776 10.1016/j.envint.2023.107776 36731188 37. Prasher D. Greenway S.C. Singh R.B. The impact of epigenetics on cardiovascular disease Biochem. Cell Biol. 2020 98 12 22 10.1139/bcb-2019-0045 31112654 38. Waddington C.H. Canalization of development and genetic assimilation of acquired characters Nature 1959 183 1654 1655 10.1038/1831654a0 13666847 39. Grewal S.I. Moazed D. Heterochromatin and epigenetic control of gene expression Science 2003 301 798 802 10.1126/science.1086887 12907790 40. Abdul Q.A. Yu B.P. Chung H.Y. Jung H.A. Choi J.S. Epigenetic modifications of gene expression by lifestyle and environment Arch. Pharmacal Res. 2017 40 1219 1237 10.1007/s12272-017-0973-3 29043603 41. Mathers J.C. Strathdee G. Relton C.L. Induction of epigenetic alterations by dietary and other environmental factors Adv. Genet. 2010 71 3 39 20933124 10.1016/B978-0-12-380864-6.00001-8 42. Burwell R.G. Dangerfield P.H. Moulton A. Grivas T.B. Adolescent idiopathic scoliosis (AIS), environment, exposome and epigenetics: A molecular perspective of postnatal normal spinal growth and the etiopathogenesis of AIS with consideration of a network approach and possible implications for medical therapy Scoliosis 2011 6 26 10.1186/1748-7161-6-26 22136338 PMC3293085 43. Worm J. Guldberg P. DNA methylation: An epigenetic pathway to cancer and a promising target for anticancer therapy J. Oral Pathol. Med. 2002 31 443 449 10.1034/j.1600-0714.2002.00034.x 12220350 44. Li Y. Tollefsbol T.O. DNA methylation detection: Bisulfite genomic sequencing analysis Methods Mol. Biol. 2011 791 11 21 21913068 10.1007/978-1-61779-316-5_2 PMC3233226 45. Brunmeir R. Lagger S. Simboeck E. Sawicka A. Egger G. Hagelkruys A. Zhang Y. Matthias P. Miller W.J. Seiser C. Epigenetic regulation of a murine retrotransposon by a dual histone modification mark PLoS Genet. 2010 6 e1000927 10.1371/journal.pgen.1000927 20442873 PMC2861705 46. Ramazi S. Allahverdi A. Zahiri J. Evaluation of post-translational modifications in histone proteins: A review on histone modification defects in developmental and neurological disorders J. Biosci. 2020 45 135 10.1007/s12038-020-00099-2 33184251 47. Filtz T.M. Vogel W.K. Leid M. Regulation of transcription factor activity by interconnected post-translational modifications Trends Pharmacol. Sci. 2014 35 76 85 10.1016/j.tips.2013.11.005 24388790 PMC3954851 48. Mehnert J.M. Kelly W.K. Histone deacetylase inhibitors: Biology and mechanism of action Cancer J. 2007 13 23 29 10.1097/PPO.0b013e31803c72ba 17464243 49. Legube G. Trouche D. Regulating histone acetyltransferases and deacetylases EMBO Rep. 2003 4 944 947 10.1038/sj.embor.embor941 14528264 PMC1326399 50. Yang J.J. Tao H. Deng Z.Y. Lu C. Li J. Non-coding RNA-mediated epigenetic regulation of liver fibrosis Metab. Clin. Exp. 2015 64 1386 1394 10.1016/j.metabol.2015.08.004 26362725 51. Fernandes J.C.R. Acuña S.M. Aoki J.I. Floeter-Winter L.M. Muxel S.M. Long Non-Coding RNAs in the Regulation of Gene Expression: Physiology and Disease Non-Coding RNA 2019 5 17 10.3390/ncrna5010017 30781588 PMC6468922 52. Muntean A.G. Hess J.L. Epigenetic dysregulation in cancer Am. J. Pathol. 2009 175 1353 1361 10.2353/ajpath.2009.081142 19717641 PMC2751531 53. Mohammad H.P. Barbash O. Creasy C.L. Targeting epigenetic modifications in cancer therapy: Erasing the roadmap to cancer Nat. Med. 2019 25 403 418 10.1038/s41591-019-0376-8 30842676 54. Gräff J. Mansuy I.M. Epigenetic dysregulation in cognitive disorders Eur. J. Neurosci. 2009 30 1 8 10.1111/j.1460-9568.2009.06787.x 19508697 55. Kwon M.J. Kim S. Han M.H. Lee S.B. Epigenetic Changes in Neurodegenerative Diseases Mol. Cells 2016 39 783 789 10.14348/molcells.2016.0233 27871175 PMC5125933 56. Mohd Murshid N. Aminullah Lubis F. Makpol S. Epigenetic Changes and Its Intervention in Age-Related Neurodegenerative Diseases Cell. Mol. Neurobiol. 2022 42 577 595 10.1007/s10571-020-00979-z 33074454 PMC11441183 57. Duthie S.J. Epigenetic modifications and human pathologies: Cancer and CVD Proc. Nutr. Soc. 2011 70 47 56 10.1017/S0029665110003952 21067630 58. Herman A.B. Occean J.R. Sen P. Epigenetic dysregulation in cardiovascular aging and disease J. Cardiovasc. Aging 2021 1 10 10.20517/jca.2021.16 34790973 PMC8594871 59. Zhang W. Song M. Qu J. Liu G.H. Epigenetic Modifications in Cardiovascular Aging and Diseases Circ. Res. 2018 123 773 786 10.1161/CIRCRESAHA.118.312497 30355081 60. Flashner B.M. Russo M.E. Boileau J.E. Leong D.W. Gallicano G.I. Epigenetic factors and autism spectrum disorders Neuromol. Med. 2013 15 339 350 10.1007/s12017-013-8222-5 23468062 61. Larizza L. Finelli P. Developmental disorders with intellectual disability driven by chromatin dysregulation: Clinical overlaps and molecular mechanisms Clin. Genet. 2019 95 231 240 10.1111/cge.13365 29672823 62. Fitzgerald E. Boardman J.P. Drake A.J. Preterm Birth and the Risk of Neurodevelopmental Disorders—Is There a Role for Epigenetic Dysregulation? Curr. Genom. 2018 19 507 521 10.2174/1389202919666171229144807 PMC6158617 30386170 63. Alaskhar Alhamwe B. Khalaila R. Wolf J. von Bülow V. Harb H. Alhamdan F. Hii C.S. Prescott S.L. Ferrante A. Renz H. Histone modifications and their role in epigenetics of atopy and allergic diseases Allergy Asthma Clin. Immunol. 2018 14 39 10.1186/s13223-018-0259-4 29796022 PMC5966915 64. Healy S. Khan P. He S. Davie J.R. Histone H3 phosphorylation, immediate-early gene expression, and the nucleosomal response: A historical perspective Biochem. Cell Biol. 2012 90 39 54 10.1139/o11-092 22250664 65. Sawicka A. Seiser C. Histone H3 phosphorylation—A versatile chromatin modification for different occasions Biochimie 2012 94 2193 2201 10.1016/j.biochi.2012.04.018 22564826 PMC3480636 66. Rossetto D. Avvakumov N. Côté J. Histone phosphorylation: A chromatin modification involved in diverse nuclear events Epigenetics 2012 7 1098 1108 10.4161/epi.21975 22948226 PMC3469451 67. Swygert S.G. Peterson C.L. Chromatin dynamics: Interplay between remodeling enzymes and histone modifications Biochim. Biophys. Acta 2014 1839 728 736 10.1016/j.bbagrm.2014.02.013 24583555 PMC4099280 68. Zhang Y. Sun Z. Jia J. Du T. Zhang N. Tang Y. Fang Y. Fang D. Overview of Histone Modification Histone Mutations and Cancer Book Series Advances in Experimental Medicine and Biology Springer Singapore 2021 Volume 1283 1 16 10.1007/978-981-15-8104-5_1 33155134 69. Kurdistani S.K. Tavazoie S. Grunstein M. Mapping global histone acetylation patterns to gene expression Cell 2004 117 721 733 10.1016/j.cell.2004.05.023 15186774 70. Morgan M.A.J. Shilatifard A. Reevaluating the roles of histone-modifying enzymes and their associated chromatin modifications in transcriptional regulation Nat. Genet. 2020 52 1271 1281 10.1038/s41588-020-00736-4 33257899 71. Clayton A.L. Hebbes T.R. Thorne A.W. Crane-Robinson C. Histone acetylation and gene induction in human cells FEBS Lett. 1993 336 23 26 10.1016/0014-5793(93)81601-U 8262210 72. Pogo B.G. Allfrey V.G. Mirsky A.E. RNA synthesis and histone acetylation during the course of gene activation in lymphocytes Proc. Natl. Acad. Sci. USA 1966 55 805 812 10.1073/pnas.55.4.805 5219687 PMC224233 73. Ropero S. Esteller M. The role of histone deacetylases (HDACs) in human cancer Mol. Oncol. 2007 1 19 25 10.1016/j.molonc.2007.01.001 19383284 PMC5543853 74. Wang Y. Miao X. Liu Y. Li F. Liu Q. Sun J. Cai L. Dysregulation of histone acetyltransferases and deacetylases in cardiovascular diseases Oxid. Med. Cell. Longev. 2014 2014 641979 10.1155/2014/641979 24693336 PMC3945289 75. Greer E.L. Shi Y. Histone methylation: A dynamic mark in health, disease and inheritance Nat. Rev. Genet. 2012 13 343 357 10.1038/nrg3173 22473383 PMC4073795 76. Murray K. The occurrence of epsilon-N-methyl lysine in histones Biochemistry 1964 3 10 15 10.1021/bi00889a003 14114491 77. Yang X.J. Seto E. Lysine acetylation: Codified crosstalk with other posttranslational modifications Mol. Cell 2008 31 449 461 10.1016/j.molcel.2008.07.002 18722172 PMC2551738 78. Magistri M. Faghihi M.A. St Laurent G. III Wahlestedt C. Regulation of chromatin structure by long noncoding RNAs: Focus on natural antisense transcripts Trends Genet. 2012 28 389 396 10.1016/j.tig.2012.03.013 22541732 PMC3768148 79. Nakamura M. Chiba T. Kanayama K. Kanzaki H. Saito T. Kusakabe Y. Kato N. Epigenetic dysregulation in hepatocellular carcinoma: An up-to-date review Hepatol. Res. 2019 49 3 13 10.1111/hepr.13250 30238570 80. North J.A. Šimon M. Ferdinand M.B. Shoffner M.A. Picking J.W. Howard C.J. Mooney A.M. van Noort J. Poirier M.G. Ottesen J.J. Histone H3 phosphorylation near the nucleosome dyad alters chromatin structure Nucleic Acids Res. 2014 42 4922 4933 10.1093/nar/gku150 24561803 PMC4005658 81. Cohen P. The structure and regulation of protein phosphatases Annu. Rev. Biochem. 1989 58 453 508 10.1146/annurev.bi.58.070189.002321 2549856 82. Bollen M. Stalmans W. The structure, role, and regulation of type 1 protein phosphatases Crit. Rev. Biochem. Mol. Biol. 1992 27 227 281 10.3109/10409239209082564 1350240 83. Ivaldi M.S. Karam C.S. Corces V.G. Phosphorylation of histone H3 at Ser10 facilitates RNA polymerase II release from promoter-proximal pausing in Drosophila Genes Dev. 2007 21 2818 2831 10.1101/gad.1604007 17942706 PMC2045134 84. Mahmoud S.A. Poizat C. Epigenetics and chromatin remodeling in adult cardiomyopathy J. Pathol. 2013 231 147 157 10.1002/path.4234 23813473 PMC4285861 85. Josefowicz S.Z. Shimada M. Armache A. Li C.H. Miller R.M. Lin S. Yang A. Dill B.D. Molina H. Park H.S. Chromatin Kinases Act on Transcription Factors and Histone Tails in Regulation of Inducible Transcription Mol. Cell 2016 64 347 361 10.1016/j.molcel.2016.09.026 27768872 PMC5081221 86. Ivanovska I. Orr-Weaver T.L. Histone modifications and the chromatin scaffold for meiotic chromosome architecture Cell Cycle 2006 5 2064 2071 10.4161/cc.5.18.3253 16969105 87. Saul D. Kosinsky R.L. Epigenetics of Aging and Aging-Associated Diseases Int. J. Mol. Sci. 2021 22 401 10.3390/ijms22010401 33401659 PMC7794926 88. Qin J. Wen B. Liang Y. Yu W. Li H. Histone Modifications and their Role in Colorectal Cancer (Review) Pathol. Oncol. Res. POR 2020 26 2023 2033 10.1007/s12253-019-00663-8 31055775 PMC7471167 89. Zhang Y. Transcriptional regulation by histone ubiquitination and deubiquitination Genes Dev. 2003 17 2733 2740 10.1101/gad.1156403 14630937 90. Ai H. Peng S. Li J.B. Chemical methods for studying the crosstalk between histone H2B ubiquitylation and H3 methylation J. Pept. Sci. 2022 28 e3381 10.1002/psc.3381 34811838 91. Mattiroli F. Penengo L. Histone Ubiquitination: An Integrative Signaling Platform in Genome Stability Trends Genet. 2021 37 566 581 10.1016/j.tig.2020.12.005 33485674 92. Oss-Ronen L. Sarusi T. Cohen I. Histone Mono-Ubiquitination in Transcriptional Regulation and Its Mark on Life: Emerging Roles in Tissue Development and Disease Cells 2022 11 2404 10.3390/cells11152404 35954248 PMC9368181 93. Machour F.E. Ayoub N. Transcriptional Regulation at DSBs: Mechanisms and Consequences Trends Genet. 2020 36 981 997 10.1016/j.tig.2020.01.001 32001024 94. Beyer J.N. Raniszewski N.R. Burslem G.M. Advances and Opportunities in Epigenetic Chemical Biology Chembiochem 2021 22 17 42 10.1002/cbic.202000459 32786101 95. Fujimoto M. Takii R. Matsumoto M. Okada M. Nakayama K.I. Nakato R. Fujiki K. Shirahige K. Nakai A. HSF1 phosphorylation establishes an active chromatin state via the TRRAP-TIP60 complex and promotes tumorigenesis Nat. Commun. 2022 13 4355 10.1038/s41467-022-32034-4 35906200 PMC9338313 96. Piunti A. Shilatifard A. The roles of Polycomb repressive complexes in mammalian development and cancer Nat. Rev. Mol. Cell Biol. 2021 22 326 345 10.1038/s41580-021-00341-1 33723438 97. Reddington C.J. Fellner M. Burgess A.E. Mace P.D. Molecular Regulation of the Polycomb Repressive-Deubiquitinase Int. J. Mol. Sci. 2020 21 7837 10.3390/ijms21217837 33105797 PMC7660087 98. Cohen I. Bar C. Ezhkova E. Activity of PRC1 and Histone H2AK119 Monoubiquitination: Revising Popular Misconceptions BioEssays News Rev. Mol. Cell. Dev. Biol. 2020 42 e1900192 10.1002/bies.201900192 32196702 PMC7585675 99. Sekiguchi M. Matsushita N. DNA Damage Response Regulation by Histone Ubiquitination Int. J. Mol. Sci. 2022 23 8187 10.3390/ijms23158187 35897775 PMC9332593 100. Cao J. Yan Q. Histone ubiquitination and deubiquitination in transcription, DNA damage response, and cancer Front. Oncol. 2012 2 26 10.3389/fonc.2012.00026 22649782 PMC3355875 101. Minnoye L. Marinov G.K. Krausgruber T. Pan L. Marand A.P. Secchia S. Greenleaf W.J. Furlong E.E.M. Zhao K. Schmitz R.J. Chromatin accessibility profiling methods Nat. Rev. Methods Primers 2021 1 10 10.1038/s43586-020-00008-9 38410680 PMC10895463 102. Chodurska B. Kunej T. Long non-coding RNAs in humans: Classification, genomic organization and function Non-Coding RNA Res. 2025 11 313 327 10.1016/j.ncrna.2025.01.004 39967600 PMC11833636 103. Maruyama R. Suzuki H. Long noncoding RNA involvement in cancer BMB Rep. 2012 45 604 611 10.5483/BMBRep.2012.45.11.227 23186998 PMC4133807 104. Uszczynska-Ratajczak B. Lagarde J. Frankish A. Guigó R. Johnson R. Towards a complete map of the human long non-coding RNA transcriptome Nat. Rev. Genet. 2018 19 535 548 10.1038/s41576-018-0017-y 29795125 PMC6451964 105. Anastasiadou E. Jacob L.S. Slack F.J. Non-coding RNA networks in cancer Nat. Rev. Cancer 2018 18 5 18 10.1038/nrc.2017.99 29170536 PMC6337726 106. Du Q. Xiao R.D. Luo R.G. Xie J.B. Su Z.D. Wang Y. Construction of long non-coding RNA- and microRNA-mediated competing endogenous RNA networks in alcohol-related esophageal cancer PLoS ONE 2022 17 e0269742 10.1371/journal.pone.0269742 35704638 PMC9200351 107. Li A. Yu W.H. Hsu C.L. Huang H.C. Juan H.F. Modular signature of long non-coding RNA association networks as a prognostic biomarker in lung cancer BMC Med. Genom. 2021 14 290 10.1186/s12920-021-01137-0 PMC8650235 34872564 108. Cao J. Zhang M. Zhang L. Lou J. Zhou F. Fang M. Non-coding RNA in thyroid cancer—Functions and mechanisms Cancer Lett. 2021 496 117 126 10.1016/j.canlet.2020.08.021 32949678 109. Slack F.J. Chinnaiyan A.M. The Role of Non-coding RNAs in Oncology Cell 2019 179 1033 1055 10.1016/j.cell.2019.10.017 31730848 PMC7347159 110. Wong C.M. Tsang F.H. Ng I.O. Non-coding RNAs in hepatocellular carcinoma: Molecular functions and pathological implications Nat. Rev. Gastroenterol. Hepatol. 2018 15 137 151 10.1038/nrgastro.2017.169 29317776 111. Kazimierczyk M. Kasprowicz M.K. Kasprzyk M.E. Wrzesinski J. Human Long Noncoding RNA Interactome: Detection, Characterization and Function Int. J. Mol. Sci. 2020 21 1027 10.3390/ijms21031027 32033158 PMC7037361 112. Klingenberg M. Matsuda A. Diederichs S. Patel T. Non-coding RNA in hepatocellular carcinoma: Mechanisms, biomarkers and therapeutic targets J. Hepatol. 2017 67 603 618 10.1016/j.jhep.2017.04.009 28438689 113. Xiao Z. Shen J. Zhang L. Li M. Hu W. Cho C. Therapeutic targeting of noncoding RNAs in hepatocellular carcinoma: Recent progress and future prospects Oncol. Lett. 2018 15 3395 3402 10.3892/ol.2018.7758 29467864 PMC5796293 114. Han Li C. Chen Y. Small and Long Non-Coding RNAs: Novel Targets in Perspective Cancer Therapy Curr. Genom. 2015 16 319 326 10.2174/1389202916666150707155851 PMC4763970 27047252 115. Tutar L. Introductory Chapter: Noncoding RNAs–A Brief Introduction Recent Advances in Noncoding RNAs IntechOpen London, UK 2022 116. Huang X. Fejes Tóth K. Aravin A.A. piRNA Biogenesis in Drosophila melanogaster Trends Genet. 2017 33 882 894 10.1016/j.tig.2017.09.002 28964526 PMC5773129 117. Zhou X. Yang P.C. MicroRNA: A small molecule with a big biological impact MicroRNA 2012 1 1 10.2174/2211536611201010001 25048083 118. Freeman J.A. Espinosa J.M. The impact of post-transcriptional regulation in the p53 network Brief. Funct. Genom. 2013 12 46 57 10.1093/bfgp/els058 PMC3548162 23242178 119. Xu J. Wu C. Che X. Wang L. Yu D. Zhang T. Huang L. Li H. Tan W. Wang C. Circulating microRNAs, miR-21, miR-122, and miR-223, in patients with hepatocellular carcinoma or chronic hepatitis Mol. Carcinog. 2011 50 136 142 10.1002/mc.20712 21229610 120. Gupta J. Abdulsahib W.K. Turki Jalil A. Saadi Kareem D. Aminov Z. Alsaikhan F. Ramírez-Coronel A.A. Ramaiah P. Farhood B. Prostate cancer and microRNAs: New insights into apoptosis Pathol. Res. Pract. 2023 245 154436 10.1016/j.prp.2023.154436 37062208 121. Anwar S.L. Lehmann U. DNA methylation, microRNAs, and their crosstalk as potential biomarkers in hepatocellular carcinoma World J. Gastroenterol. 2014 20 7894 7913 10.3748/wjg.v20.i24.7894 24976726 PMC4069317 122. Liu Y. Wang Q. Wen J. Wu Y. Man C. MiR-375: A novel multifunctional regulator Life Sci. 2021 275 119323 10.1016/j.lfs.2021.119323 33744323 123. Yan J.W. Lin J.S. He X.X. The emerging role of miR-375 in cancer Int. J. Cancer 2014 135 1011 1018 10.1002/ijc.28563 24166096 124. Li J. Xuan Z. Liu C. Long non-coding RNAs and complex human diseases Int. J. Mol. Sci. 2013 14 18790 18808 10.3390/ijms140918790 24036441 PMC3794807 125. Kugel J.F. Goodrich J.A. Non-coding RNAs: Key regulators of mammalian transcription Trends Biochem. Sci. 2012 37 144 151 10.1016/j.tibs.2011.12.003 22300815 PMC3323709 126. Saw P.E. Xu X. Chen J. Song E.W. Non-coding RNAs: The new central dogma of cancer biology Sci. China Life Sci. 2021 64 22 50 10.1007/s11427-020-1700-9 32930921 127. Yang X. Xie X. Xiao Y.F. Xie R. Hu C.J. Tang B. Li B.S. Yang S.M. The emergence of long non-coding RNAs in the tumorigenesis of hepatocellular carcinoma Cancer Lett. 2015 360 119 124 10.1016/j.canlet.2015.02.035 25721084 128. Mercer T.R. Mattick J.S. Structure and function of long noncoding RNAs in epigenetic regulation Nat. Struct. Mol. Biol. 2013 20 300 307 10.1038/nsmb.2480 23463315 129. Engreitz J.M. Ollikainen N. Guttman M. Long non-coding RNAs: Spatial amplifiers that control nuclear structure and gene expression Nat. Rev. Mol. Cell Biol. 2016 17 756 770 10.1038/nrm.2016.126 27780979 130. Ramalingam P.S. Zhang L. Hussain M.S. Khan G. Mawkili W. Hanbashi A. Gupta G. Balakrishnan P. Arumugam S. Non-coding RNAs as key regulators in hepatitis B virus-related hepatocellular carcinoma Front. Immunol. 2025 16 1602252 10.3389/fimmu.2025.1602252 40625740 PMC12230020 131. Wu Y. Zhang L. Wang Y. Li H. Ren X. Wei F. Yu W. Wang X. Zhang L. Yu J. Long noncoding RNA HOTAIR involvement in cancer Tumour Biol. 2014 35 9531 9538 10.1007/s13277-014-2523-7 25168368 132. Yuan C. Ning Y. Pan Y. Emerging roles of HOTAIR in human cancer J. Cell. Biochem. 2020 121 3235 3247 10.1002/jcb.29591 31943306 133. Yang F. Huo X.S. Yuan S.X. Zhang L. Zhou W.P. Wang F. Sun S.H. Repression of the long noncoding RNA-LET by histone deacetylase 3 contributes to hypoxia-mediated metastasis Mol. Cell 2013 49 1083 1096 10.1016/j.molcel.2013.01.010 23395002 134. Wu S.C. Kallin E.M. Zhang Y. Role of H3K27 methylation in the regulation of lncRNA expression Cell Res. 2010 20 1109 1116 10.1038/cr.2010.114 20680032 PMC2949548 135. Tierno D. Grassi G. Scaggiante B. New challenges in hepatocellular carcinoma: A role for PIWI-interacting RNAs? World J. Gastroenterol. 2024 30 2843 2848 10.3748/wjg.v30.i22.2843 38947286 PMC11212720 136. Liao Z. Yang L. Cheng X. Huang X. Zhang Q. Wen D. Song Z. Li Y. Wen S. Li Y. pir-hsa-216911 inhibit pyroptosis in hepatocellular carcinoma by suppressing TLR4 initiated GSDMD activation Cell Death Discov. 2025 11 11 10.1038/s41420-024-02285-9 39824843 PMC11742400 137. Hussain M.S. Moglad E. Afzal M. Bansal P. Kaur H. Deorari M. Ali H. Shahwan M. Hassan Almalki W. Kazmi I. Circular RNAs in the KRAS pathway: Emerging players in cancer progression Pathol. Res. Pract. 2024 256 155259 10.1016/j.prp.2024.155259 38503004 138. Xiong D. He R. Dang Y. Wu H. Feng Z. Chen G. The Latest Overview of circRNA in the Progression, Diagnosis, Prognosis, Treatment, and Drug Resistance of Hepatocellular Carcinoma Front. Oncol. 2020 10 608257 10.3389/fonc.2020.608257 33680930 PMC7928415 139. Chen L. Huang W. Wang L. Zhang Z. Zhang F. Zheng S. Kong D. The effects of epigenetic modification on the occurrence and progression of liver diseases and the involved mechanism Expert Rev. Gastroenterol. Hepatol. 2020 14 259 270 10.1080/17474124.2020.1736042 32124651 140. Hardy T. Mann D.A. Epigenetics in liver disease: From biology to therapeutics Gut 2016 65 1895 1905 10.1136/gutjnl-2015-311292 27624887 PMC5099193 141. Wang S. Wu W. Claret F.X. Mutual regulation of microRNAs and DNA methylation in human cancers Epigenetics 2017 12 187 197 10.1080/15592294.2016.1273308 28059592 PMC5406215 142. Zentner G.E. Henikoff S. Regulation of nucleosome dynamics by histone modifications Nat. Struct. Mol. Biol. 2013 20 259 266 10.1038/nsmb.2470 23463310 143. Ferreira H.J. Esteller M. Non-coding RNAs, epigenetics, and cancer: Tying it all together Cancer Metastasis Rev. 2018 37 55 73 10.1007/s10555-017-9715-8 29374363 144. Marchese F.P. Huarte M. Long non-coding RNAs and chromatin modifiers: Their place in the epigenetic code Epigenetics 2014 9 21 26 10.4161/epi.27472 24335342 PMC3928181 145. Holoch D. Moazed D. RNA-mediated epigenetic regulation of gene expression Nat. Rev. Genet. 2015 16 71 84 10.1038/nrg3863 25554358 PMC4376354 146. Hanif H. Ali M.J. Susheela A.T. Khan I.W. Luna-Cuadros M.A. Khan M.M. Lau D.T. Update on the applications and limitations of alpha-fetoprotein for hepatocellular carcinoma World J. Gastroenterol. 2022 28 216 229 10.3748/wjg.v28.i2.216 35110946 PMC8776528 147. Wang S. Yang Y. Sun L. Qiao G. Song Y. Liu B. Exosomal MicroRNAs as Liquid Biopsy Biomarkers in Hepatocellular Carcinoma OncoTargets Ther. 2020 13 2021 2030 10.2147/OTT.S232453 PMC7069575 32210570 148. Lumkul L. Jantaree P. Jaisamak K. Wongkummool W. Lapisatepun W. Orrapin S. Udomruk S. Lo Piccolo L. Chaiyawat P. Combinatorial Gene Expression Profiling of Serum HULC HOTAIR UCA1 Int. J. Mol. Sci. 2024 25 1258 10.3390/ijms25021258 38279264 PMC10816616 149. Guerriero P. Moshiri F. Lupini L. Sabbioni S. Negrini M. Callegari E. Circulating tumor DNAs and non-coding RNAs as potential biomarkers for hepatocellular carcinoma diagnosis, prognosis and response to therapy Hepatoma Res. 2019 5 6 10.20517/2394-5079.2018.108 150. Choudhuri S. Cui Y. Klaassen C.D. Molecular targets of epigenetic regulation and effectors of environmental influences Toxicol. Appl. Pharmacol. 2010 245 378 393 10.1016/j.taap.2010.03.022 20381512 PMC2911443 151. Mosca L. Vitiello F. Borzacchiello L. Coppola A. Tranchese R.V. Pagano M. Caraglia M. Cacciapuoti G. Porcelli M. Mutual Correlation between Non-Coding RNA and S-Adenosylmethionine in Human Cancer: Roles and Therapeutic Opportunities Cancers 2021 13 3264 10.3390/cancers13133264 34209866 PMC8268931 152. Du D. He J. Ju C. Wang C. Li H. He F. Zhou M. When N 7 Cancer Lett. 2023 562 216165 10.1016/j.canlet.2023.216165 37028699 153. Gao X. Sheng Y. Yang J. Wang C. Zhang R. Zhu Y. Zhang Z. Zhang K. Yan S. Sun H. Osteopontin alters DNA methylation through up-regulating DNMT1 and sensitizes CD133+/CD44+ cancer stem cells to 5 azacytidine in hepatocellular carcinoma J. Exp. Clin. Cancer Res. 2018 37 179 10.1186/s13046-018-0832-1 30064482 PMC6069805 154. Hlady R.A. Sathyanarayan A. Thompson J.J. Zhou D. Wu Q. Pham K. Lee J.H. Liu C. Robertson K.D. Integrating the epigenome to identify drivers of hepatocellular carcinoma Hepatology 2019 69 639 652 10.1002/hep.30211 30136421 PMC6351162 155. Hama N. Totoki Y. Miura F. Tatsuno K. Saito-Adachi M. Nakamura H. Arai Y. Hosoda F. Urushidate T. Ohashi S. Epigenetic landscape influences the liver cancer genome architecture Nat. Commun. 2018 9 1643 10.1038/s41467-018-03999-y 29691395 PMC5915380 156. Zhang Y. Chou J.B. Li J. Li H. Du Q. Yadav A. Zhou S. Shalaginov M.Y. Fang Z. Zhong H. Broadband transparent optical phase change materials for high-performance nonvolatile photonics Nat. Commun. 2019 10 4279 10.1038/s41467-019-12196-4 31570710 PMC6768866 157. Shao F. Yang X. Wang W. Wang J. Guo W. Feng X. Shi S. Xue Q. Gao S. Gao Y. Associations of PGK1 promoter hypomethylation and PGK1-mediated PDHK1 phosphorylation with cancer stage and prognosis: A TCGA pan-cancer analysis Cancer Commun. 2019 39 1 17 10.1186/s40880-019-0401-9 PMC6775656 31578148 158. Hua D. Hu Y. Wu Y.-Y. Cheng Z.-H. Yu J. Du X. Huang Z.-H. Quantitative methylation analysis of multiple genes using methylation-sensitive restriction enzyme-based quantitative PCR for the detection of hepatocellular carcinoma Exp. Mol. Pathol. 2011 91 455 460 10.1016/j.yexmp.2011.05.001 21600201 159. Cui H. Kong Y. Xu M. Zhang H. Notch3 Functions as a Tumor Suppressor by Controlling Cellular Senescence Cancer Res. 2013 73 3451 3459 10.1158/0008-5472.CAN-12-3902 23610446 PMC3674178 160. Herceg Z. Paliwal A. Epigenetic mechanisms in hepatocellular carcinoma: How environmental factors influence the epigenome Mutat. Res./Rev. Mutat. Res. 2011 727 55 61 10.1016/j.mrrev.2011.04.001 21514401 161. Arechederra M. Daian F. Yim A. Bazai S.K. Richelme S. Dono R. Saurin A.J. Habermann B.H. Maina F. Hypermethylation of gene body CpG islands predicts high dosage of functional oncogenes in liver cancer Nat. Commun. 2018 9 3164 10.1038/s41467-018-05550-5 30089774 PMC6082886 162. Bárcena-Varela M. Caruso S. Llerena S. Álvarez-Sola G. Uriarte I. Latasa M.U. Urtasun R. Rebouissou S. Alvarez L. Jimenez M. Dual targeting of histone methyltransferase G9a and DNA-methyltransferase 1 for the treatment of experimental hepatocellular carcinoma Hepatology 2019 69 587 603 10.1002/hep.30168 30014490 163. Han T.-S. Ban H.S. Hur K. Cho H.-S. The epigenetic regulation of HCC metastasis Int. J. Mol. Sci. 2018 19 3978 10.3390/ijms19123978 30544763 PMC6321007 164. Chan L.H. Zhou L. Ng K.Y. Wong T.L. Lee T.K. Sharma R. Loong J.H. Ching Y.P. Yuan Y.-F. Xie D. PRMT6 regulates RAS/RAF binding and MEK/ERK-mediated cancer stemness activities in hepatocellular carcinoma through CRAF methylation Cell Rep. 2018 25 690 701.e8 10.1016/j.celrep.2018.09.053 30332648 165. Wu X. Fu M. Ge C. Zhou H. Huang H. Zhong M. Zhang M. Xu H. Zhu G. Hua W. m 6 Mol. Neurobiol. 2024 61 5418 5440 10.1007/s12035-023-03911-w 38193984 166. Chen Y. Peng C. Chen J. Chen D. Yang B. He B. Hu W. Zhang Y. Liu H. Dai L. WTAP facilitates progression of hepatocellular carcinoma via m6A-HuR-dependent epigenetic silencing of ETS1 Mol. Cancer 2019 18 127 10.1186/s12943-019-1053-8 31438961 PMC6704583 167. Chen M. Wei L. Law C.T. Tsang F.H.C. Shen J. Cheng C.L.H. Tsang L.H. Ho D.W.H. Chiu D.K.C. Lee J.M.F. RNA N6-methyladenosine methyltransferase-like 3 promotes liver cancer progression through YTHDF2-dependent posttranscriptional silencing of SOCS2 Hepatology 2018 67 2254 2270 10.1002/hep.29683 29171881 168. Li J. Xie H. Ying Y. Chen H. Yan H. He L. Xu M. Xu X. Liang Z. Liu B. YTHDF2 mediates the mRNA degradation of the tumor suppressors to induce AKT phosphorylation in N6-methyladenosine-dependent way in prostate cancer Mol. Cancer 2020 19 152 10.1186/s12943-020-01267-6 33121495 PMC7599101 169. Zhou T. Li S. Xiang D. Liu J. Sun W. Cui X. Ning B. Li X. Cheng Z. Jiang W. m6A RNA methylation-mediated HNF3γ reduction renders hepatocellular carcinoma dedifferentiation and sorafenib resistance Signal Transduct. Target. Ther. 2020 5 296 10.1038/s41392-020-00299-0 33361765 PMC7762754 170. Bernasconi A. Canakoglu A. Masseroli M. Ceri S. The road towards data integration in human genomics: Players, steps and interactions Brief. Bioinform. 2021 22 30 44 10.1093/bib/bbaa080 32496509 171. Zheng Y. Jun J. Brennan K. Gevaert O. EpiMix: An integrative tool for epigenomic subtyping using DNA methylation bioRxiv 2023 10.1016/j.crmeth.2023.100515 PMC10391348 37533639 172. Cheng Y. Zhang C. Zhao J. Wang C. Xu Y. Han Z. Jiang G. Guo X. Li R. Bu X. Correlation of CpG island methylator phenotype with poor prognosis in hepatocellular carcinoma Exp. Mol. Pathol. 2010 88 112 117 10.1016/j.yexmp.2009.10.008 19879258 173. Lin T. Ponn A. Lu J. Requirement of the histone demethylase LSD1 in Snail-mediated transcriptional repression during epithelial-mesenchymal transition Cancer Res. 2011 71 3422 10.1158/1538-7445.AM2011-3422 20562920 PMC3093107 174. Zhang M. Dong X. Zhang D. Chen X. Zhu X. High expression of Snail and NF-κB; predicts poor survival in Chinese hepatocellular carcinoma patients Oncotarget 2017 8 4543 10.18632/oncotarget.13891 27965464 PMC5354852 175. Chen S. Zhang Y. Wu X. Zhang C. Li G. Diagnostic value of lncRNAs as biomarker in hepatocellular carcinoma: An updated meta-analysis Can. J. Gastroenterol. Hepatol. 2018 2018 8410195 10.1155/2018/8410195 30410873 PMC6205093 176. Li J. Li Y. Wu X. Li Y. Identification and validation of potential long non-coding RNA biomarkers in predicting survival of patients with head and neck squamous cell carcinoma Oncol. Lett. 2019 17 5642 5652 10.3892/ol.2019.10261 31186787 PMC6507327 177. Han M.-H. Lee J.H. Kim G. Lee E. Lee Y.R. Jang S.Y. Lee H.W. Chun J.M. Han Y.S. Yoon J.S. Expression of the long noncoding RNA GAS5 correlates with liver fibrosis in patients with nonalcoholic fatty liver disease Genes 2020 11 545 10.3390/genes11050545 32413995 PMC7291058 178. Shang X. Li G. Liu H. Li T. Liu J. Zhao Q. Wang C. Comprehensive circular RNA profiling reveals that hsa_circ_0005075, a new circular RNA biomarker, is involved in hepatocellular crcinoma development Medicine 2016 95 e3811 10.1097/MD.0000000000003811 27258521 PMC4900729 179. Jin Y. Ren Y. Gao Y. Zhang L. Ding Z. Hsa_circ_0005075 predicts a poor prognosis and acts as an oncogene in colorectal cancer via activating Wnt/β-catenin pathway Eur. Rev. Med. Pharmacol. Sci. 2019 23 3311 3319 31081084 10.26355/eurrev_201904_17693 180. Chen D. Zhang C. Lin J. Song X. Wang H. Screening differential circular RNA expression profiles reveal that hsa_circ_0128298 is a biomarker in the diagnosis and prognosis of hepatocellular carcinoma Cancer Manag. Res. 2018 10 1275 10.2147/CMAR.S166740 29849467 PMC5965387 181. Fu L. Yao T. Chen Q. Mo X. Hu Y. Guo J. Screening differential circular RNA expression profiles reveals hsa_circ_0004018 is associated with hepatocellular carcinoma Oncotarget 2017 8 58405 10.18632/oncotarget.16881 28938566 PMC5601662 182. Wang M. Gu B. Yao G. Li P. Wang K. Circular RNA expression profiles and the pro-tumorigenic function of circRNA_10156 in hepatitis B virus-related liver cancer Int. J. Med Sci. 2020 17 1351 10.7150/ijms.45637 32624692 PMC7330659 183. Dai X. Chen C. Yang Q. Xue J. Chen X. Sun B. Luo F. Liu X. Xiao T. Xu H. Exosomal circRNA_100284 from arsenite-transformed cells, via microRNA-217 regulation of EZH2, is involved in the malignant transformation of human hepatic cells by accelerating the cell cycle and promoting cell proliferation Cell Death Dis. 2018 9 454 10.1038/s41419-018-0485-1 29674685 PMC5908808 184. Wang G. Liu W. Zou Y. Wang G. Deng Y. Luo J. Zhang Y. Li H. Zhang Q. Yang Y. Three isoforms of exosomal circPTGR1 promote hepatocellular carcinoma metastasis via the miR449a–MET pathway EBioMedicine 2019 40 432 445 10.1016/j.ebiom.2018.12.062 30630697 PMC6412851 185. Lin X.-J. Chong Y. Guo Z.-W. Xie C. Yang X.-J. Zhang Q. Li S.-P. Xiong Y. Yuan Y. Min J. A serum microRNA classifier for early detection of hepatocellular carcinoma: A multicentre, retrospective, longitudinal biomarker identification study with a nested case-control study Lancet Oncol. 2015 16 804 815 10.1016/S1470-2045(15)00048-0 26088272 186. Yang J. Sheng Y.-Y. Wei J.-W. Gao X.-M. Zhu Y. Jia H.-L. Dong Q.-Z. Qin L.-X. MicroRNA-219-5p promotes tumor growth and metastasis of hepatocellular carcinoma by regulating cadherin 1 BioMed Res. Int. 2018 2018 4793971 10.1155/2018/4793971 29862272 PMC5976989 187. Wu M.-y. Tang Y.-p. Liu J.-j. Liang R. Luo X.-l. Global transcriptomic study of circRNAs expression profile in sorafenib resistant hepatocellular carcinoma cells J. Cancer 2020 11 2993 10.7150/jca.39854 32226514 PMC7086252 188. Gao Y. Zhang J. Zhao F. Circular RNA identification based on multiple seed matching Brief. Bioinform. 2018 19 803 810 10.1093/bib/bbx014 28334140 189. Banaudha K.K. Verma M. The role of microRNAs in the management of liver cancer Methods Mol. Biol. 2012 863 241 251 22359297 10.1007/978-1-61779-612-8_14 190. Anwar S.L. Albat C. Krech T. Hasemeier B. Schipper E. Schweitzer N. Vogel A. Kreipe H. Lehmann U. Concordant hypermethylation of intergenic microRNA genes in human hepatocellular carcinoma as new diagnostic and prognostic marker Int. J. Cancer 2013 133 660 670 10.1002/ijc.28068 23364900 191. Zhang Z. Ge S. Wang X. Yuan Q. Yan Q. Ye H. Che Y. Lin Y. Zhang J. Liu P. Serum miR-483-5p as a potential biomarker to detect hepatocellular carcinoma Hepatol. Int. 2013 7 199 207 10.1007/s12072-012-9341-z 26201634 192. Shen J. Wang A. Wang Q. Gurvich I. Siegel A.B. Remotti H. Santella R.M. Exploration of Genome-Wide Circulating MicroRNA in Hepatocellular Carcinoma: MiR-483-5p as a Potential Biomarker Cancer Epidemiol. Biomark. Prev. 2013 22 2364 2373 10.1158/1055-9965.EPI-13-0237 PMC3963823 24127413 193. Chen X. Zhang L. Zhang T. Hao M. Zhang X. Zhang J. Xie Q. Wang Y. Guo M. Zhuang H. Methylation-mediated repression of micro RNA 129-2 enhances oncogenic SOX 4 expression in HCC Liver Int. 2013 33 476 486 10.1111/liv.12097 23402613 194. Tsunedomi R. Iizuka N. Yoshimura K. Iida M. Tsutsui M. Hashimoto N. Kanekiyo S. Sakamoto K. Tamesa T. Oka M. ABCB6 mRNA and DNA methylation levels serve as useful biomarkers for prediction of early intrahepatic recurrence of hepatitis C virus-related hepatocellular carcinoma Int. J. Oncol. 2013 42 1551 1559 10.3892/ijo.2013.1854 23483087 PMC3661224 195. Ozen C. Yildiz G. Dagcan A.T. Cevik D. Ors A. Keles U. Topel H. Ozturk M. Genetics and epigenetics of liver cancer New Biotechnol. 2013 30 381 384 10.1016/j.nbt.2013.01.007 23392071 Figure 1 Integrated roles of major epigenetic mechanisms in hepatocellular carcinoma (HCC). This schematic highlights the interconnected pathways through which DNA methylation, histone modifications, and non-coding RNAs contribute to the regulation of gene expression in HCC. DNA methylation silences tumor suppressor genes, histone modifications influence chromatin accessibility, and non-coding RNAs mediate post-transcriptional gene regulation. Together, these mechanisms disrupt cellular homeostasis and promote tumorigenesis, angiogenesis, and metastasis in HCC. Created in BioRender. Babiker, R. (2025) https://BioRender.com/aoasc7p Figure 2 Illustrates the role of non-coding RNAs (ncRNAs) in hepatocellular carcinoma (HCC) development. Non-coding RNAs are divided into small non-coding RNAs (sncRNAs), including siRNA, snoRNA, piRNA, miRNA, and tRNA, and long non-coding RNAs (lncRNAs). Dysregulation of lncRNAs—driven by epigenetic modifications such as histone acetylation and methylation (e.g., LncRNA-LET, H19, and LncRNA-P21)—can suppress the expression of tumor-suppressive miRNAs like miRNA-375. This suppression leads to reduced degradation of oncogenic target mRNAs, promoting tumorigenesis and progression of HCC. Created in BioRender. Babiker, R. (2025) https://BioRender.com/0k3tinh Figure 3 Epigenetic biomarkers contributing to the progression and prognosis of hepatocellular carcinoma (HCC). The dysregulation of various non-coding RNAs, including circular RNAs (circRNAs) like circPTGR1, microRNAs (miRNAs) such as miR-483-5p and miR-192, and competing endogenous RNAs (ceRNAs), including LINC01093 and RP11 variants, all of which are associated with poor survival outcomes. Epigenetic silencing of E-cadherin through CDH1 promoter hypermethylation and EMT-related histone modifications promotes metastasis. Upregulation of UCA1 in serum represents a non-invasive diagnostic biomarker for HCC with validated sensitivity and specificity. Additionally, downregulation of GAS5 is linked to hepatic failure, further underscoring the prognostic significance of epigenetic alterations in HCC. Created in BioRender. Babiker, R. (2025) https://BioRender.com/nuyjxx6 pharmaceuticals-18-01281-t001_Table 1 Table 1 Summary of Epigenetic Alterations and Their Roles in Hepatocellular Carcinoma (HCC). Epigenetic Mechanism Molecular Players Functional Role in HCC Biomarkers/Targets Clinical Implication DNA Methylation DNMT1, DNMT3A, DNMT3B, TET1/2/3 Gene silencing, genomic instability RASSF1, APC, CDKN2A, GATA4, CDKL2 Diagnostic and therapeutic value Histone Modification HATs, HDACs, HMTs, LSDs, PRMT6 Chromatin remodeling, DNA accessibility, gene regulation H3K27me3, H3S10ph, H2AK119ub, H2BK120ub Therapeutic value Non-coding RNAs (ncRNAs) miR-375, miR-219-5p, HOTAIR, GAS5, UCA1, lncRNA-LET Regulation of transcription/translation, chromatin targeting, and metastasis H19, circPTGR1, circ_0004018 Diagnostic and prognostic value mRNA Methylation (m6A) METTL3, WTAP, YTHDF2 Regulation of mRNA stability, cell cycle, suppressor gene silencing SOCS2, ETS1 Therapeutic value Epigenetic Biomarkers miRNAs, lncRNAs, circRNAs EMT, drug resistance, prognosis miR-483-5p, LINC01093, has_circ_0005075 Diagnostic and prognostic value DNMT1—DNA (Cytosine-5)-Methyltransferase 1; DNMT3A—DNA (Cytosine-5)-Methyltransferase 3 Alpha; DNMT3B—DNA (Cytosine-5)-Methyltransferase 3 Beta; TET1/2/3—Ten-Eleven Translocation Methylcytosine Dioxygenases 1, 2, and 3; RASSF1—Ras Association Domain Family Member 1; APC—Adenomatous Polyposis Coli; CDKN2A—Cyclin Dependent Kinase Inhibitor 2A; GATA4—GATA Binding Protein 4; CDKL2—Cyclin Dependent Kinase-Like 2; HATs—Histone Acetyltransferases; HDACs—Histone Deacetylases; HMTs—Histone Methyltransferases; LSDs—Lysine-Specific Demethylases; PRMT6—Protein Arginine Methyltransferase 6; H3K27me3—Trimethylation of Lysine 27 on Histone H3; H3S10ph—Phosphorylation of Serine 10 on Histone H3; H2AK119ub—Ubiquitination of Lysine 119 on Histone H2A; H2BK120ub—Ubiquitination of Lysine 120 on Histone H2B; m6A—N6-Methyladenosine; METTL3—Methyltransferase-Like 3; WTAP—Wilms Tumor 1-Associating Protein; YTHDF2—YTH N6-Methyladenosine RNA Binding Protein 2; SOCS2—Suppressor of Cytokine Signaling 2; ETS1—ETS Proto-Oncogene 1, Transcription Factor; EMT—Epithelial–Mesenchymal Transition. pharmaceuticals-18-01281-t002_Table 2 Table 2 Summary of current epigenetic therapies in HCC clinical/preclinical trials. Drug Name Target Epigenetic Mechanism Trial Phase Combination Tested Outcome Summary Guadecitabine DNMT1 DNA hypomethylation Phase II Sorafenib Limited efficacy as monotherapy Vorinostat HDAC Histone deacetylase inhibition Phase I/II Nivolumab Enhances T-cell infiltration Belinostat HDAC Histone acetylation Phase I Chemotherapy Under investigation SGI-110 DNMT DNA demethylation Preclinical Checkpoint inhibitors Shows potential synergy Romidepsin HDAC1/2 Histone deacetylation Phase I N/A Toxicity limits standalone application ",
  "metadata": {
    "Title of this paper": "Genetics and epigenetics of liver cancer",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473062/"
  }
}