{
  "title": "Paper_549",
  "abstract": "pmc Am J Case Rep Am J Case Rep 2001 amjcasereps amjcaserep The American Journal of Case Reports 1941-5923 International Scientific Information, Inc. PMC12483543 PMC12483543.1 12483543 12483543 40999663 10.12659/AJCR.948652 948652 1 Articles Diagnostic Challenges in Diffuse Large B-Cell Lymphoma in a Young Liver Transplant Patient with Ulcerative Colitis: A Case Report Kopoń Maria https://orcid.org/0009-0007-6540-6377 1 A B C D E F Wileńska Aleksandra 1 2 A E F Zdrenka Marek https://orcid.org/0000-0002-1574-0189 3 D Szylberg Łukasz https://orcid.org/0000-0003-1349-5906 3 4 D Koza Jarosław 1 2 A D E F  1 Poland  2 Poland  3 Poland  4 Poland Corresponding Author: Maria Kopoń, e-mail: mariakopon@wp.pl A Study Design B Data Collection C Statistical Analysis D Data Interpretation E Manuscript Preparation F Literature Search G Funds Collection 2025 26 9 2025 15 8 2025 26 478682 e948652 23 2 2025 03 8 2025 26 09 2025 01 10 2025 01 10 2025 © Am J Case Rep, 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This work is licensed under Creative Common Attribution-NonCommercial-NoDerivatives 4.0 International ( CC BY-NC-ND 4.0 Patient: Male, 22-year-old Final Diagnosis: Diffuse large B-cell lymphoma (DLBCL) Symptoms: Abdominal pain • bloating • bowel obstruction • vomiting Clinical Procedure: Computed tomography • endoscopy • lymph nodes biopsy • PET-CT • ultrasonography • X ray Specialty: Gastroenterology and Hepatology Objective: Unusual clinical course Background Diffuse large B-cell lymphoma (DLBCL) is the most common form of malignant lymphoma. The hypothesis that age-related immune decline plays a role in the development of lymphoma is well established and exemplified by the association between Epstein-Barr virus (EBV) and DLBCL. This report describes a 22-year-old liver transplant patient with ulcerative colitis (UC) presenting with ileus and diffuse large B-cell lymphoma (DLBCL). Because of the symptoms, an exacerbation of UC was initially suggested, which contributed to a delay in definitive diagnosis. Case Report A 22-year-old patient with a medical history of ulcerative colitis, liver transplantation, and use of immunosuppressive drugs presented gradually progressive abdominal pain, bloating, and, eventually, lack of bowel movements. Initially, abdominal X-ray revealed the presence of radiological features consistent with sub-ileus/ileus. Then, the serological tests for EBV in the IgG class yielded positive results. Subsequently, the contrast-enhanced abdominal and pelvic computed tomography (CT) scans revealed the presence of enlarged lymph nodes forming a conglomerate. A percutaneous thick-needle biopsy of a conglomerate of lymph nodes in the abdominal cavity was performed, which revealed DLBCL. After diagnosis, the patient underwent 6 cycles of R-CHOP (rituximab, cyclophosphamide, doxorubicin, vincristine, and prednisolone) chemotherapy, achieving remission. Conclusions This case report emphasizes that clinicians need to consider the risk of oncogenesis associated with the prolonged use of immunosuppressive agents and EBV-seropositive infection status. Screening for EBV before initiating immunosuppressive therapy should be compulsory. EBV-negative patients on immunosuppression must especially avoid EBV infection, while EBV-positive patients must be monitored more closely due to higher oncological risk. Inflammatory Bowel Diseases Herpesvirus 4, Human Immunosuppression Therapy Lymphoma, Large B-Cell, Diffuse pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Diffuse large B-cell lymphoma (DLBCL) is the most common type of malignant lymphoma, accounting for approximately 40% of all malignant lymphoid neoplasms and comprising a morphologically and molecularly heterogeneous group of lymphomas [ 1 2 3 4 5 6 7 Case Report A 22-year-old man was admitted to the Gastroenterology Clinic in August 2021 due to a suspected gastrointestinal obstruction. The patient’s history included a diagnosis of ulcerative colitis (UC) in 2015, and he underwent liver transplantation in 2018 due to liver failure in the course of autoimmune hepatitis (AIH) and primary sclerosing cholangitis (PSC). The patient was under the regular surveillance of the Gastroenterology Clinic and Transplantation Clinic. At the time of the admission to the clinic, he reported having severe abdominal pain with moderate cramping and bloating, first observed a few weeks earlier. Due to the character of pain, the patient considered it as a symptom of mild ulcerative colitis course. The symptoms increased gradually, with abdominal bloating and obstruction. Before being admitted to the hospital, treatment included oral mesalazine 2 g per day as maintenance therapy for ulcerative colitis and immunosuppression with mycophenolate mofetil 1000 mg per day in 2 divided doses and tacrolimus 5 mg in 2 divided doses, which he received after liver transplantation. On the admission to the Clinic, he was generally in fair condition, with tenderness in the middle and lower abdomen and reduced motility of the large intestine. On the day of admission, laboratory blood tests revealed a slightly elevated CRP value of 17.9 mg/dl (normal range 0.08–3.1 mg/dl), but the other laboratory blood tests (eg, complete blood count with smear, ionogram, renal parameters) revealed no abnormalities, which did not correlate with severe flare-up of ulcerative colitis. To assess the function of the transplanted liver, an evaluation of the liver panel (AST, ALT, bilirubin, ALP, GGTP), coagulation system panel (INR, PT, APTT), and a proteinogram were performed. These showed no irregularities. At the same time, to clarify the cause of the lack of bowel movements, an X-ray was performed, which showed dilated small-bowel loops measuring up to 40 mm, with fluid levels and radiological features of ileus/sub-ileus ( Figure 1 Due to the splenomegaly and possibility of lymphatic system disease, uric acid and LDH levels were assessed, but they revealed no abnormalities. Stool tests were not conducted due to the inability to obtain an adequate sample for examination. Due to the detection of radiological abnormalities and the medical history, we decided to perform a sigmoidoscopy to assess the severity of the ulcerative colitis. The endoscope was introduced approximately 35 cm from the sphincter line. The examination of the relevant section of the large intestine revealed no evidence of the typical changes associated with active ulcerative colitis, and the endoscopic image was completely normal ( Figure 2 As the patient was on immunosuppressive therapy, there was a risk of opportunistic diseases developing. Confirmation of any of them would allow for precise direction of further diagnostics. Screening tests for antibodies against human immunodeficiency virus type 1, type 2 and the p24 antigen, cytomegalovirus, herpes simplex virus type 1 and 2, and Toxoplasma gondii In the following days, the patient’s general condition declined gradually, and he presented with new symptoms, including increased pain, vomiting, and diarrhea, which were indicative of a permeable obstruction. Furthermore, there was an observable increase in the size of the abdominal girth and cervical lymph nodes. A contrast-enhanced abdominal and pelvic computed tomography (CT) scan was performed, which revealed an irregular mass in the middle pelvis (above the urinary bladder) measuring 150×95×68 mm, which was compressing and modelling the surrounding intestinal loops ( Figure 3A, 3B A consultation was held with a hematologist. An ultrasound of the lymph nodes of the neck and the supraclavicular region was performed to localize the enlarged lymph nodes. The ultrasound examination revealed the presence of enlarged lymph nodes with abnormal structure. The patient was qualified for a neck lymph node biopsy for histopathological evaluation. The biopsy result did not confirm the presence of a proliferative disease of the lymphatic system. The patient was referred for surgical consultation and was qualified for a percutaneous thick-needle biopsy of a conglomerate of lymph nodes in the abdominal cavity. A repeat biopsy demonstrated the presence of an aggressive peripheral B-cell lymphoma, specifically diffuse large B-cell lymphoma (DLBCL). Histopathological images are provided in Figure 4 Serological tests for hepatitis B and C viruses were evaluated before beginning treatment. Their results were negative. Subsequently, following a consultation with the Transplant Clinic, mycophenolate was discontinued, prednisone at a dose of 20 mg/day was initiated, and the dose of tacrolimus was reduced to 2 mg 2 times daily. The patient was transferred to the Hematology Clinic for further treatment, where he received a regimen of R-CHOP (rituximab, cyclophosphamide, doxorubicin, vincristine, and prednisolone) chemotherapy, which was the standard treatment [ 8 9 The patient had a significant improvement in overall condition following the initial course of chemotherapy, likely related to the dynamic breakdown of the tumor. He started to eat all meals and the abdominal pain and emesis ceased. Following the fourth cycle of chemotherapy, a positron emission tomography (PET)/CT scan was conducted, which demonstrated complete regression of the abdominal tumor and no enlargement of the lymph nodes, liver, or spleen. Following the sixth cycle of R-CHOP, no evidence of the proliferative process was observed in the PET/CT scan, with complete metabolic remission. The patient is being followed by the Hematology Clinic and is disease-free at 3-year follow-up. The gastrointestinal obstruction was caused by lymphoma and the symptoms were not associated with ulcerative colitis. A detailed timeline of symptom progression and treatment is included in Table 1 Discussion This case report emphasizes the necessity for clinicians to evaluate the oncogenesis risk associated with prolonged use of immunosuppressive agents and EBV-seropositive infection status [ 1 7 10 11 A high prevalence of Epstein-Barr virus (EBV) infection in patients with inflammatory bowel disease (IBD) has been reported. An EBV infection in patients with IBD can result in several complications, including superimposed viral colitis, which is associated with chronicity, exacerbation, and poor prognosis of refractory IBD. Additionally, an EBV infection can lead to the progression of lymphoproliferative disorders, such as EBV-positive mucocutaneous ulcer (EBVMCU), lymphomatoid granulomatosis (LYG), hemophagocytic lymphohistiocytosis (HLH), and DLBCL [ 5 12 13 The link between immunosuppressive therapy and increased lymphoma risk is well established in solid organ transplantation patients [ 14 15 16 17 18 19 Patients with germinal center B-cell (GCB) diffuse large B-cell lymphoma (DLBCL) respond well to 6 cycles of R-CHOP therapy, administered every 21 days. Patients with activated B-cells (ABC) respond well to R-CHOP therapy combined with lenalidomide, bortezomib, or ibrutinib. A more aggressive approach involves rituximab, doxorubicin, cyclophosphamide, vindesine, bleomycin, and prednisone (R-ACVBP) therapy, followed by methotrexate and leucovorin. Studies have suggested using 6–8 cycles of rituximab, etoposide, prednisone, vincristine, cyclophosphamide, and doxorubicin (R-EPOCH) in patients with advanced DLBCL with double translocations. Cytogenetical rearrangement and/or increased numbers of MYC, BCL2, and/or BCL6 copies in large B-cell lymphoma is called double/triple hit lymphoma (DHL/THL) due to molecular, biologic, and clinical similarities. Other regimens include (R-CHOP), bendamustine or cyclophosphamide, doxorubicin, and prednisone (R-CVP) [ 11 20 21 23 24 25 There was no correlation between ulcerative colitis and lymphoma. Immunosuppressive treatment was initiated after liver transplantation due to AIH and PSC. EBV infection in patients with IBD and immunosuppressive treatment can lead to development of DLBCL. The present case was a major clinical challenge for many reasons. After the first symptoms appeared (abdominal pain and bloating), the patient did not immediately seek treatment, thinking that the symptoms were a normal phenomenon related to the periodic exacerbation of ulcerative colitis. Lymphomas are characterized by various and quite often non-specific symptoms, and one of the first can be the mass effect, as in our case, in which the clinical manifestation of lymphoma was related to its compression of the intestines. Since the patient had ulcerative colitis, he and the medical staff were guided first by the suspicion of an exacerbation of the underlying disease. A similar case with mass effect was described by Deng et al, who presented the case of a young boy with intussusception of the ileum by Burkitt’s lymphoma. He had undergone laparotomy and R-CHOP therapy, with successful outcome [ 26 27 28 Because the symptoms of lymphoma are often non-specific and are only noticeable in advanced forms of the disease, screening tests should be considered in certain risk groups. It seems rational to first determine the EBV status in immunosuppressed patients, including those who underwent liver transplantation. Thus, EBV-negative patients especially should avoid exposure to infection, and infected individuals should continue to undergo surveillance [ 6 16 29 22 22 28 30 Conclusions This case emphasizes that clinicians need to consider the risk of oncogenesis associated with the prolonged use of immunosuppressive agents and EBV-seropositive infection status. Screening for EBV before initiating immunosuppressive therapy should be compulsory. EBV-negative patients on immunosuppression must especially avoid EBV infection, while EBV-positive patients must be monitored more closely due to higher oncological risk. Conflict of interest: Department and Institution Where Work Was Done: Patient Consent: Declaration of Figures’ Authenticity: Financial support: References 1 Takahara T Nakamura S Tsuzuki T Satou A The immunology of DLBCL Cancers (Basel) 2023 15 3 835 36765793 10.3390/cancers15030835 PMC9913124 2 Smith A Howell D Patmore R Incidence of haematological malignancy by sub-type; A report from the Haematological Malignancy Research Network Br J Cancer 2011 105 11 1684 92 22045184 10.1038/bjc.2011.450 PMC3242607 3 Muller M Broséus J Feugier P Characteristics of lymphoma in patients with inflammatory bowel disease; A systematic review J Crohns Colitis 2021 15 5 827 39 32949235 10.1093/ecco-jcc/jjaa193 4 Muller M Broséus J Guilloteau A Lymphoma in patients with inflammatory bowel disease; A multicentre collaborative study between GETAID and LYSA J Crohns Colitis 2024 18 4 533 39 37850555 10.1093/ecco-jcc/jjad177 5 Zhang H Zhao S Cao Z Impact of Epstein-Barr virus infection in patients with inflammatory bowel disease Front Immunol 2022 13 1001055 36389673 10.3389/fimmu.2022.1001055 PMC9651941 6 Oyama T Yamamoto K Asano N Age-related EBV-associated B-cell lymphoproliferative disorders constitute a distinct clinicopathologic group; A study of 96 patients Clin Cancer Res 2007 13 17 5124 32 17785567 10.1158/1078-0432.CCR-06-2823 7 Samant H Vaitla P Kothadia JP Posttransplant lymphoproliferative disorders. [Updated 2023 Jul 10] StatPearls [Internet] Treasure Island (FL) StatPearls Publishing 2025 30020621 8 Sehn LH Salles G Diffuse large B-cell lymphoma N Engl J Med 2021 384 9 842 58 33657296 10.1056/NEJMra2027612 PMC8377611 9 Wang J Yang M Chen S Cystatin SN (CST1) is a poor independent prognostic biomarker for gastrointestinal diffuse large B-cell lymphoma Med Sci Monit 2024 30 e943551 38959178 10.12659/MSM.943551 PMC11302183 10 Wang SS Epidemiology and etiology of diffuse large B-cell lymphoma Semin Hematol 2023 60 5 255 66 38242772 10.1053/j.seminhematol.2023.11.004 PMC10962251 11 Padala SA Kallam A Diffuse large B-cell lymphoma. [Updated 2023 Apr 24] StatPearls [Internet] Treasure Island (FL) StatPearls Publishing 2025 32491728 12 Serrate C Silva-Moreno M Dartigues P Epstein-Barr virus-associated lymphoproliferation awareness in hemophagocytic syndrome complicating thiopurine treatment for Crohn’s disease Inflamm Bowel Dis 2009 15 10 1449 51 19177429 10.1002/ibd.20823 13 Beaugerie L Lymphoma; The bête noire of the long-term use of thiopurines in adult and elderly patients with inflammatory bowel disease Gastroenterology 2013 145 5 927 30 24070724 10.1053/j.gastro.2013.09.035 14 Gibson TM Engels EA Clarke CA Risk of diffuse large B-cell lymphoma after solid organ transplantation in the United States Am J Hematol 2014 89 7 714 20 24753070 10.1002/ajh.23726 PMC4069221 15 Mynarek M Schober T Behrends U Maecker-Kolhoff B Posttransplant lymphoproliferative disease after pediatric solid organ transplantation Clin Dev Immunol 2013 2013 814973 24174972 10.1155/2013/814973 PMC3794558 16 Morscio J Tousseyn T Recent insights in the pathogenesis of post-transplantation lymphoproliferative disorders World J Transplant 2016 6 3 505 16 27683629 10.5500/wjt.v6.i3.505 PMC5036120 17 Dharnidharka VR Webster AC Martinez OM Post-transplant lymphoproliferative disorders Nat Rev Dis Primers 2016 2 15088 27189056 10.1038/nrdp.2015.88 18 Bishnoi R Minish J Franke AJ Single-institution retrospective analysis of prognostic factors influencing very late-onset post-transplant lymphoproliferative disorder Cureus 2020 12 2 e6912 32190467 10.7759/cureus.6912 PMC7061783 19 Ishikawa E Satou A Nakamura M Epstein-Barr virus positive B-cell lymphoproliferative disorder of the gastrointestinal tract Cancers (Basel) 2021 13 15 3815 34359715 10.3390/cancers13153815 PMC8345108 20 Kim H Kim HJ Kim SH Diagnostic approach for double-hit and triple-hit lymphoma based on immunophenotypic and cytogenetic characteristics of bone marrow specimens Ann Lab Med 2020 40 5 361 69 32311849 10.3343/alm.2020.40.5.361 PMC7169621 21 Tahir Z Peters J Leahy K Batalini F Double-hit monomorphic B-cell lymphoma after liver transplantation BMJ Case Rep 2020 13 1 e231831 10.1136/bcr-2019-231831 PMC6954779 31900295 22 Toniutto P Germani G Ferrarese A An essential guide for managing post-liver transplant patients; What primary care physicians should know Am J Med 2022 135 2 157 66 34508700 10.1016/j.amjmed.2021.08.005 23 Kobe H Ito A Hayata H Mycophenolate mofetil-induced diffuse large B-cell lymphoma in which a solitary lung nodule remitted spontaneously Intern Med 2021 60 1 131 36 32830178 10.2169/internalmedicine.5027-20 PMC7835455 24 Sharma A Houshyar R Bhosale P Chemotherapy induced liver abnormalities; An imaging perspective Clin Mol Hepatol 2014 20 3 317 26 25320738 10.3350/cmh.2014.20.3.317 PMC4197183 25 Mallepally N Abu-Sbeih H Ahmed O Clinical features of rituximab-associated gastrointestinal toxicities Am J Clin Oncol 2019 42 6 539 45 31136371 10.1097/COC.0000000000000553 26 Deng KH Wei DH Liu W Ileo-Ileal Intussusception by Burkitt’s lymphoma J Gastrointest Surg 2023 27 10 2266 67 37369965 10.1007/s11605-023-05768-9 27 Moore CM Lamzabi I Bartels AK Colonic diffuse large B-cell lymphoma in a liver transplant patient with historically very low tacrolimus levels Case Rep Transplant 2012 2012 952359 23259146 10.1155/2012/952359 PMC3504278 28 Habib MB Ali K Fael M Diffuse large B-cell lymphoma presenting with pulmonary artery compression symptoms, case reports Respirol Case Rep 2024 12 8 e01441 39130088 10.1002/rcr2.1441 PMC11317125 29 Chabay P Advances in the pathogenesis of EBV-associated diffuse large B cell lymphoma Cancers (Basel) 2021 13 11 2717 34072731 10.3390/cancers13112717 PMC8199155 30 Paquin AR Oyogoa E McMurry HS The diagnosis and management of suspected lymphoma in general practice Eur J Haematol 2023 110 1 3 13 36093749 10.1111/ejh.13863 PMC10042228 Figure 1 The abdominal X-ray showing dilated small-bowel loops (marked by arrows). Figure 2 Endoscopic image of normal mucosa in the rectum. Figure 3 Computed tomography scan of abdomen and pelvis showing irregular mass in the middle pelvis ( A B Figure 4 Immunohistochemistry Panel of Diffuse Large B-cell Lymphoma (DLBCL). ( A B–M G I D E F C M B J H K L Table 1 Detailed timeline of symptoms progression and treatment. ",
  "metadata": {
    "Title of this paper": "The diagnosis and management of suspected lymphoma in general practice",
    "Journal it was published in:": "The American Journal of Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483543/"
  }
}