{
  "title": "Paper_398",
  "abstract": "pmc Respirology Respirology 379 blackwellopen RESP Respirology (Carlton, Vic.) 1323-7799 1440-1843 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12486366 PMC12486366.1 12486366 12486366 40467526 10.1111/resp.70067 RESP70067 1 Original Article ORIGINAL ARTICLE Interstitial Lung Disease Exploring Benefits of Non‐Intubated Surgery for Lung Biopsy in Interstitial Lung Disease Nguyen Aude https://orcid.org/0000-0003-4425-6676  1 Jouitteau Timothée  2 Bourdin Arnaud https://orcid.org/0000-0002-4645-5209  3  4 Gamez Anne‐Sophie  3  4 Solovei Laurence https://orcid.org/0000-0002-5491-5260  1 Molina José  2 Hireche Kheira  1  3 k-hireche@chu-montpellier.fr   1 Department of Thoracic and Vascular Surgery Arnaud de Villeneuve University Hospital Montpellier France   2 Department of Anaesthesiology and Critical Care Medicine Arnaud de Villeneuve University Hospital Montpellier France   3 PhyMedExp, University of Montpellier, INSERM, CNRS Montpellier France   4 Department of Respiratory Diseases Arnaud de Villeneuve University Hospital Montpellier France * Correspondence: k-hireche@chu-montpellier.fr 04 6 2025 10 2025 30 10 498039 10.1111/resp.v30.10 949 956 04 5 2025 17 11 2024 12 5 2025 01 10 2025 02 10 2025 03 10 2025 © 2025 The Author(s). Respirology https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Background and Objectives General anaesthesia with intubation is the standard technique for video‐assisted thoracic surgery (VATS). However, non‐intubated VATS (NIVATS) is emerging as a less invasive alternative, particularly for lung biopsies in patients with interstitial lung disease (ILD) and impaired respiratory function. This study aims to investigate the benefits of non‐intubated surgery on postoperative respiratory function and to compare operative outcomes between intubated VATS (IVATS) and NIVATS. Methods We conducted a single‐centre retrospective study of patients who underwent lung biopsy for ILD diagnosis via VATS between January 2020 and September 2023 at Montpellier University Hospital. Primary outcomes included the variation in pulmonary function tests after surgery (FEV 1 Results The study included 61 patients, with 42% ( n 1 p p p p Conclusions NIVATS offers better preservation of respiratory function, a good diagnostic yield, and improved overall outcomes following surgical lung biopsy in patients with ILD and could be a preferred technique for diagnosis. NIVATS appears to provide better preservation of respiratory function, a satisfactory diagnostic yield, and improved overall outcomes following surgical lung biopsy in patients with ILD. These findings suggest that it could be a preferred technique for diagnosis and emphasise the need for randomised studies.  See related editorial interstitial lung disease non‐intubated video‐assisted thoracic surgery respiratory function surgical lung biopsy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  A. Nguyen T. Jouitteau A. Bourdin Exploring Benefits of Non‐Intubated Surgery for Lung Biopsy in Interstitial Lung Disease Respirology 30 10 2025 949 956 10.1111/resp.70067 PMC12486366 40467526  See related editorial  Associate Editor: Senior Editor:  Funding: Aude Nguyen and Timothée Jouitteau contributed equally to this research study and shared joint first authorship. José Molina and Kheira Hireche contributed equally to this research study and shared senior authorship. 1 Introduction General anaesthesia with intubation is the standard technique for video‐assisted thoracic surgery (VATS). However, numerous studies have documented the complications associated with acute lung injury resulting from mechanical ventilation, especially with One‐Lung Ventilation (OLV) [ 1 2 3 4 5 6 7 8 9 10 11 12 13 14 9 15 16 1 2 Materials and Methods 2.1 Study Design We conducted a single‐centre retrospective study including all patients who underwent video‐assisted surgical lung biopsy for the diagnosis of ILD between January 2020 and September 2023. All patients had an indeterminate diagnosis of ILD after discussion in a multidisciplinary team, which concluded that a surgical biopsy was required. Non‐intubated thoracic surgery started in 2020 at Montpellier University Hospital. Two pre‐specified subgroups were compared: patients undergoing IVATS and patients undergoing NIVATS. The choice between intubated and non‐intubated procedures was determined by a preoperative multidisciplinary discussion involving thoracic surgeons, pulmonologists, and anaesthesiologists. Decisions were based on medical and organisational factors, with non‐intubated procedures performed only by a trained anaesthesia team. Two experienced anaesthetists took part in the majority of procedures. Classical anaesthetic contraindications to spontaneous ventilation, such as difficult intubation criteria, gastroesophageal reflux disease, BMI > 30, or previous thoracic surgery, prohibited the use of NIVATS. Regional anaesthesia, either epidural or paravertebral catheter, was chosen at the anaesthetist's discretion. The first procedures were preferably performed under epidural anaesthesia. All procedures were performed in a lateral decubitus position using three‐port video‐assisted thoracoscopy. 2.2 Intubated VATS The procedure was performed under general anaesthesia with selective orotracheal intubation and muscle relaxation. Regional anaesthesia was either paravertebral block or epidural anaesthesia. Blood pressure was monitored with an intermittent pressure cuff. After anaesthesia and intubation, patients were placed in the lateral decubitus position. 2.3 Non‐Intubated VATS Anaesthesia management for a non‐intubated procedure followed a precise protocol established in the department. Premedication with acetaminophen and dexmedetomidine 0.5 μg/kg was administered 30 to 60 min before the incision. Patients received 2% lidocaine aerosol for 5 min. Regional anaesthesia was performed on admission to the operating room. The practice habits of the department led to a preference for epidural over paravertebral anaesthesia in the NIVATS group. Arterial pressure was monitored invasively in the first three cases. After conditioning, a face mask was placed on the patients, who were positioned in the lateral decubitus position with their participation. Sedation was ensured with remifentanil and propofol. The anaesthesia team systematically ensured free access to the upper airway in case of emergency conversion to general anaesthesia. Prior to incision, the surgeon and anaesthesiologist reassessed the efficacy of sedation and regional analgesia. At the end of the procedure, sedation was reduced after the chest tube placement, and positive pressure ventilation with a face mask was applied to facilitate lung re‐expansion. 2.4 Postoperative After the procedure, all patients were directed to the recovery room for postoperative monitoring. If air leakage allowed, the chest tube was removed 2 h after surgery in the recovery room. Patients were discharged to home the day after drain removal. As part of their disease follow‐up, pulmonary function tests (PFTs) were performed at 3 months, then every 6 months. Morbidity was defined as the occurrence of a postoperative complication. 2.5 Data Collection We collected patient characteristics, perioperative surgical and anaesthetic data, pathological findings, pre‐ and postoperative respiratory function, and operative outcomes. Data were obtained from patient case notes and electronic patient records, then entered into a dedicated anonymized database (Excel, Microsoft Corp, Redmond, WA). The study was approved by the local ethics committee and Institutional Review Board (No. IRB‐MTP_2021_06_202100817). All patients have authorised the use of their data for research purposes. 2.6 Statistical Analysis Statistical analyses were performed using R Foundation (Vienna, Austria) and Excel Stat (Microsoft Corp, Redmond, WA). Continuous data are reported as mean with standard deviation (SD) or median with interquartile ranges (IQR), and categorical data are reported as numbers and percentage frequencies, as appropriate. All statistical tests were two‐sided, and the confidence intervals were at 95%. The primary outcome was tested using the equality two‐sided T‐test for independent data and a linear regression model adjusted for the time to postoperative PFT. For binary outcomes, we performed the Chi‐square test or Fisher's exact test as appropriate. A p 3 Results Patient characteristics are described in Table 1 n n TABLE 1 Patients characteristics. Overall Intubated Non‐intubated  p Number of patient ( n 61 35 (57%) 26 (43%) NS Age (mean, years) 66.7 ± 8.2 66.3 ± 8.9 67.2 ± 8.4 NS Gender ( n NS Male 50 (82%) 28 (80%) 22 (85%) Female 11 (18%) 7 (20%) 4 (15%) Smoking history 49 (80%) 29 (83%) 20 (77%) NS Smoking cessation 40 (66%) 23 (66%) 17 (65%) Body mass index (kg/m 2 27 27.9 25.8 > 0.05 Blue color ( n 29 (46%) 17 (48) 12 (46%) NS NYHA ( n NS I 18 (30%) 10 (29%) 8 (31%) II 27 (44%) 14 (40%) 13 (50%) III 16 (26%) 11 (31%) 5 (19%) IV 0 0 0 Right biopsy ( n 38 (62%) 21 (60%) 17 (65%) NS Preoperative oxygen therapy ( n 3 (5%) 1 (3%) 2 (8%) NS Preoperative corticosteroid therapy ( n 19 (31%) 15 (42%) 4 (15%) < 0.001 Peridural ( n 25 (41%) 3 (9%) 22 (85%) < 0.05 Paravertebral block ( n 33 (54%) 29 (83%) 4 (15%) < 0.05 Preoperative FEV 1 2.4 2.4 2.5 NS Preoperative FEV 1 87 87 88 NS Preoperative FVC (mean, %) 84 83 84 NS Preoperative DLCO (mean, %) 54 53 56 NS Gap index (score) 0 2 1 1 1 4 3 1 2 8 7 1 3 19 9 10 4 16 8 8 5 12 7 5  Note n Abbreviations: BMI, body mass index; DLCO, diffusion for carbon monoxide; FEV 1 Comparison of the two groups showed similar preoperative characteristics with no significant difference in the evaluated variables, except for regional anaesthesia, body mass index, and preoperative corticosteroid therapy. Patients in the NIVATS group were statistically more likely to receive epidural anaesthesia (84% vs. 8% in the IVATS group, p p p 3.1 Respiratory Function Results Pulmonary function tests used for the statistical analysis were the most recent available at the date of data extraction (09.21.23), with a median of 5.1 months (2.9–14.1) after surgery. Median time to postoperative PFT was higher in IVATS group (median of 9 months (4.3–20.1)) than in the NIVATS group (median of 3.3 months (2.3–7.5)). Comparison of pre‐ and postoperative variation in FEV 1 1 1 p 1 p p 1a p p p p 1b p p p p 1c FIGURE 1 Pre‐and postoperative pulmonary function test: Intubated versus Non‐intubated VATS lung biopsy comparison. (a) Comparison of FEV 1 p p p 3.2 Postoperative Outcomes For the entire cohort, the 30‐day mortality rate was zero. The overall mortality rate was 1.6% ( N p p p 2 2 p 3 FIGURE 2 Timeline in the operating room for intubated versus non‐intubated group. TABLE 2 Post‐operative outcomes between IVATS and NIVATS groups. Intubated Non‐intubated  p Length of hospital stay, mean (h) 65.2 47.5 0.018 Chest tube duration (h) Mean 18.5 17.2 0.8 Median 24 2.5 Post‐operative rescue analgesia ( n 14 (40%) 1 (3.8%) 0.001 Postoperative complications ( n Prolonged air leak 0 1 Surgical revision 1 0 Pneumothorax requiring chest tube 2 0 Admission to ICU 1 0 Abbreviation: ICU, intensive care unit. FIGURE 3 Pathological diagnosis. 4 Discussion In recent years, non‐intubated thoracic surgery for lung biopsies related to ILD has evolved significantly, expanding to more complex procedures such as major resections [ 17 18 19 20 21 22 23 24 24 25 26 27 28 4 29 30 31 14 32 26 33 34 35 36 1 37 24 38 p 39 In conclusion, intubation in patients undergoing lung biopsy for ILD diagnosis could negatively impact postoperative FEV 1 Author Contributions  Aude Nguyen: Timothée Jouitteau: Arnaud Bourdin: Anne‐Sophie Gamez: Laurence Solovei: José Molina: Kheira Hireche: Ethics Statement The study was approved by the local ethics committee and Institutional Review Board (No. IRB‐MTP_2021_06_202100817). All patients have authorised the use of their data for research purposes. Conflicts of Interest The authors declare no conflicts of interest. Data Availability Statement The data that support the findings of this study are available on request from the corresponding author. The data are not publicly available due to privacy or ethical restrictions. References 1 J. Lohser P. Slinger Lung Injury After One‐Lung Ventilation: A Review of the Pathophysiologic Mechanisms Affecting the Ventilated and the Collapsed Lung Anesthesia and Analgesia 121 2 2015 302 318 26197368 10.1213/ANE.0000000000000808 2 J. Lohser Evidence‐Based Management of One‐Lung Ventilation Anesthesiology Clinics 26 2 2008 241 272 18456211 10.1016/j.anclin.2008.01.011 3 D. Karalapillai L. Weinberg P. Peyton Effect of Intraoperative Low Tidal Volume vs Conventional Tidal Volume on Postoperative Pulmonary Complications in Patients Undergoing Major Surgery Journal of the American Medical Association 324 9 2020 1 11 10.1001/jama.2020.12866 PMC7489812 32870298 4 C. Ferrando A. Carramiñana P. Piñeiro Individualised, Perioperative Open‐Lung Ventilation Strategy During One‐Lung Ventilation (iPROVE‐OLV): A Multicentre, Randomised, Controlled Clinical Trial Lancet Respiratory Medicine 12 3 2024 195 206 38065200 10.1016/S2213-2600(23)00346-6 5 G. Raghu M. Remy‐Jardin L. Richeldi Idiopathic Pulmonary Fibrosis (An Update) and Progressive Pulmonary Fibrosis in Adults: An Official ATS/ERS/JRS/ALAT Clinical Practice Guideline American Journal of Respiratory and Critical Care Medicine 205 9 2022 e18 e47 35486072 10.1164/rccm.202202-0399ST PMC9851481 6 P. M. George P. Spagnolo M. Kreuter Progressive Fibrosing Interstitial Lung Disease: Clinical Uncertainties, Consensus Recommendations, and Research Priorities Lancet Respiratory Medicine 8 9 2020 925 934 32890499 10.1016/S2213-2600(20)30355-6 7 A. Cilli C. Kocaturk K. C. Tertemiz Morbidity and Mortality of Surgical Lung Biopsy in the Diagnosis of Usual Interstitial Pneumonia ANZ Journal of Surgery 91 3 2021 298 303 33645001 10.1111/ans.16681 8 J. Pastre S. Khandhar S. Barnett Surgical Lung Biopsy for Interstitial Lung Disease. Safety and Feasibility at a Tertiary Referral Center Annals of the American Thoracic Society 18 3 2021 460 467 32970474 10.1513/AnnalsATS.202006-759OC 9 J. H. Park D. K. Kim D. S. Kim Mortality and Risk Factors for Surgical Lung Biopsy in Patients With Idiopathic Interstitial Pneumonia European Journal of Cardio‐Thoracic Surgery 31 6 2007 1115 1119 17418586 10.1016/j.ejcts.2007.02.035 10 M. T. Durheim S. Kim B. C. Gulack Mortality and Respiratory Failure After Thoracoscopic Lung Biopsy for Interstitial Lung Disease Annals of Thoracic Surgery 104 2 2017 465 470 28527960 10.1016/j.athoracsur.2017.02.013 11 Q. Han Q. Luo J. X. Xie Diagnostic Yield and Postoperative Mortality Associated With Surgical Lung Biopsy for Evaluation of Interstitial Lung Diseases: A Systematic Review and Meta‐Analysis Journal of Thoracic and Cardiovascular Surgery 149 5 2015 1394 1401.e1 25648484 10.1016/j.jtcvs.2014.12.057 12 C. J. Lettieri G. R. Veerappan D. L. Helman C. R. Mulligan A. F. Shorr Outcomes and Safety of Surgical Lung Biopsy for Interstitial Lung Disease Chest 127 5 2005 1600 1605 15888834 10.1378/chest.127.5.1600 13 J. P. Hutchinson T. M. McKeever A. W. Fogarty V. Navaratnam R. B. Hubbard Surgical Lung Biopsy for the Diagnosis of Interstitial Lung Disease in England: 1997‐2008 European Respiratory Journal 48 5 2016 1453 1461 27660509 10.1183/13993003.00378-2016 14 W. H. Amundson E. Racila T. Allen Acute Exacerbation of Interstitial Lung Disease After Procedures Respirology 150 2019 30 37 10.1016/j.rmed.2019.02.012 30961948 15 M. I. Sigurdsson H. J. Isaksson G. Gudmundsson T. Gudbjartsson Diagnostic Surgical Lung Biopsies for Suspected Interstitial Lung Diseases: A Retrospective Study Annals of Thoracic Surgery 88 1 2009 227 232 19559230 10.1016/j.athoracsur.2009.04.002 16 G. Rossi P. Spagnolo W. A. Wuyts Pathologic Comparison of Conventional Video‐Assisted Thoracic Surgical (VATS) Biopsy Versus Non‐Intubated/“Awake” Biopsy in Fibrosing Interstitial Lung Diseases Respiratory Medicine 195 2022 106777 35227545 10.1016/j.rmed.2022.106777 17 C. Pathonsamit A. Tantraworasin S. Poopipatpab S. Laohathai Perioperative Outcomes of Non‐Intubated Versus Intubated Video‐Assisted Thoracoscopic Surgery in Different Thoracic Procedures: A Propensity Score‐Matched Analysis BMC Anesthesiology 22 1 2022 154 35590238 10.1186/s12871-022-01667-9 PMC9118677 18 K. Zhang H. G. Chen W. B. Wu Non‐Intubated Video‐Assisted Thoracoscopic Surgery vs. Intubated Video‐Assisted Thoracoscopic Surgery for Thoracic Disease: A Systematic Review and Meta‐Analysis of 1,684 Cases Journal of Thoracic Disease 11 8 2019 3556 3568 31559062 10.21037/jtd.2019.07.48 PMC6753434 19 G. L. Rosboch F. Giunta E. Ceraolo Italian Survey on Non‐Intubated Thoracic Surgery: Results From INFINITY Group BMC Anesthesiology 22 1 2022 2 34979933 10.1186/s12871-021-01514-3 PMC8722187 20 H. Y. Deng Z. J. Zhu Y. C. Wang W. P. Wang P. Z. Ni L. Q. Chen Non‐Intubated Video‐Assisted Thoracoscopic Surgery Under Loco‐Regional Anaesthesia for Thoracic Surgery: A Meta‐Analysis Interactive Cardiovascular and Thoracic Surgery 23 1 2016 31 40 10.1093/icvts/ivw055 26984963 PMC4986734 21 E. Pompeo P. Rogliani C. Atinkaya Nonintubated Surgical Biopsy of Undetermined Interstitial Lung Disease: A Multicentre Outcome Analysis Interactive Cardiovascular and Thoracic Surgery 28 5 2019 744 750 30508104 10.1093/icvts/ivy320 22 E. Pompeo P. Rogliani B. Cristino O. Schillaci G. Novelli C. Saltini Awake Thoracoscopic Biopsy of Interstitial Lung Disease Annals of Thoracic Surgery 95 2 2013 445 452 23245450 10.1016/j.athoracsur.2012.10.043 23 W. M. Hajjar S. A. Al‐Nassar G. S. Al‐Sugair Evaluation of Safety and Efficacy of Regional Anesthesia Compared With General Anesthesia in Thoracoscopic Lung Biopsy Procedure on Patient With Idiopathic Pulmonary Fibrosis Saudi Journal of Anaesthesia 12 1 2018 46 51 29416456 10.4103/sja.SJA_265_17 PMC5789506 24 A. Patirelis S. Elia B. Cristino Spontaneous Ventilation Thoracoscopic Lung Biopsy in Undetermined Interstitial Lung Disease: Systematic Review and Meta‐Analysis Journal of Clinical Medicine 13 2 2024 374 38256508 10.3390/jcm13020374 PMC10815978 25 Y. Wen H. Liang G. Qiu Non‐Intubated Spontaneous Ventilation in Video‐Assisted Thoracoscopic Surgery: A Meta‐Analysis European Journal of Cardio‐Thoracic Surgery 57 3 2020 428 437 31725158 10.1093/ejcts/ezz279 26 M. Grott C. D. Wimmer M. Kreuter Surgical Lung Biopsy for Interstitial Lung Disease: A Two Center Propensity Score Matching Analysis Respiration 101 10 2022 910 917 36007492 10.1159/000525903 27 F. Guerrera L. Costardi G. L. Rosboch Awake or Intubated Surgery in Diagnosis of Interstitial Lung Diseases? A Prospective Study ERJ Open Research 7 3 2021 00630‐2020 34235209 10.1183/23120541.00630-2020 PMC8255540 28 C. S. Jeon D. W. Yoon S. M. Moon Non‐Intubated Video‐Assisted Thoracoscopic Lung Biopsy for Interstitial Lung Disease: A Single‐Center Experience Journal of Thoracic Disease 10 6 2018 3262 3268 30069322 10.21037/jtd.2018.05.144 PMC6051856 29 E. Marret R. Cinotti L. Berard Protective Ventilation During Anaesthesia Reduces Major Postoperative Complications After Lung Cancer Surgery: A Double‐Blind Randomised Controlled Trial European Journal of Anaesthesiology 35 10 2018 727 29561278 10.1097/EJA.0000000000000804 30 S. Gaudry F. Vincent A. Rabbat Invasive Mechanical Ventilation in Patients With Fibrosing Interstitial Pneumonia Journal of Thoracic and Cardiovascular Surgery 147 1 2014 47 53 23968871 10.1016/j.jtcvs.2013.06.039 31 R. Tonelli S. Grasso A. Cortegiani Physiological Effects of Lung‐Protective Ventilation in Patients With Lung Fibrosis and Usual Interstitial Pneumonia Pattern Versus Primary ARDS: A Matched‐Control Study Critical Care 27 1 2023 398 37853480 10.1186/s13054-023-04682-5 PMC10585808 32 V. Tzilas A. Tzouvelekis J. H. Ryu D. Bouros 2022 Update on Clinical Practice Guidelines for Idiopathic Pulmonary Fibrosis and Progressive Pulmonary Fibrosis Lancet Respiratory Medicine 10 8 2022 729 731 35760077 10.1016/S2213-2600(22)00223-5 33 A. Bourdin M. Romagnoli A. S. Gamez Careful Consideration of the Bleeding Caused by Transbronchial Lung Cryobiopsies European Respiratory Journal 55 5 2020 1902415 32439734 10.1183/13993003.02415-2019 34 C. Suehs A. Bourdin I. Vachier N. Molinari M. Romagnoli Transbronchial Cryobiopsy in the Diagnosis of Interstitial Lung Diseases: Methodologies and Perspectives From the Cryo‐PID and COLDICE Studies Annals of Translational Medicine 8 20 2020 1330 33209910 10.21037/atm-20-2814 PMC7661865 35 K. A. Kalverda M. K. Ninaber L. Wijmans Transbronchial Cryobiopsy Followed by As‐Needed Surgical Lung Biopsy Versus Immediate Surgical Lung Biopsy for Diagnosing Interstitial Lung Disease (The COLD Study): A Randomised Controlled Trial Lancet Respiratory Medicine 12 7 2024 513 522 38640934 10.1016/S2213-2600(24)00074-2 36 J. J. Marini P. R. M. Rocco L. Gattinoni Static and Dynamic Contributors to Ventilator‐Induced Lung Injury in Clinical Practice. Pressure, Energy, and Power American Journal of Respiratory and Critical Care Medicine 201 7 2020 767 774 31665612 10.1164/rccm.201908-1545CI PMC7124710 37 R. Mudannayake G. Martinez I. Bello M. Gimenez‐Milà Non‐Intubated Thoracic Surgery: A Physiological Approach Archivos de Bronconeumología 59 11 2023 699 701 37407337 10.1016/j.arbres.2023.05.016 38 M. Ejima T. Okamoto T. Suzuki T. Anzai K. Takahashi Y. Miyazaki Efficacy of Treatment With Corticosteroids for Fibrotic Hypersensitivity Pneumonitis: A Propensity Score‐Matched Cohort Analysis BMC Pulmonary Medicine 21 2021 243 34281549 10.1186/s12890-021-01608-1 PMC8290597 39 R. Cherchi P. A. Ferrari F. Guerrera Lung Biopsy With a Non‐Intubated VATS Approach in an Obese Population: Indications and Results Frontiers in Surgery 9 2022 829976 35310436 10.3389/fsurg.2022.829976 PMC8931040 ",
  "metadata": {
    "Title of this paper": "Lung Biopsy With a Non‐Intubated VATS Approach in an Obese Population: Indications and Results",
    "Journal it was published in:": "Respirology (Carlton, Vic.)",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486366/"
  }
}