{
  "title": "Paper_70",
  "abstract": "pmc eBioMedicine EBioMedicine 2749 ebiom eBioMedicine 2352-3964 Elsevier PMC12489834 PMC12489834.1 12489834 12489834 40975927 10.1016/j.ebiom.2025.105935 S2352-3964(25)00379-2 105935 1 Articles Prospective associations of obesity heterogeneity, serum proteins, and carotid atherosclerosis risk Zhong Haili a b c e Chen Jieteng b c d e Jia Shize a e Chen Hanzu a Xi Yue a Yan Yan a Lu Zilong a Xiao Congmei b c d Xu Fengzhe b c d Tang Jun b c d Zheng Ju-Sheng zhengjusheng@westlake.edu.cn b c d ∗∗ Chen Yu-ming chenyum@mail.sysu.edu.cn a ∗ a b c d ∗ chenyum@mail.sysu.edu.cn ∗∗ zhengjusheng@westlake.edu.cn e Contributed equally. 10 2025 20 9 2025 120 497285 105935 17 4 2025 3 9 2025 4 9 2025 20 09 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary Background Obese individuals exhibit considerable heterogeneity in developing cardiovascular diseases, yet the underlying molecular mechanisms remain unclear. We aimed to investigate the prospective associations between obesity phenotypes, serum proteomics, and carotid atherosclerosis (CAS) incidence. Methods This cohort study included 3162 participants from the Guangzhou Nutrition and Health Study, with 413 proteins profiled from 6803 serum samples collected at three time-points. Obesity phenotypes included metabolically healthy non-obesity (MHNO) and metabolically healthy/unhealthy obesity (MHO/MUO). Findings We identified 11 proteins influenced by MUO (vs. MHO) over time, with their combined score positively associated with incident CAS (HR: 1.16; 95% CI: 1.01–1.34). Additionally, 8 proteins were prospectively associated with MHO-to-MUO transition, which increased the performance of traditional risk factors in predicting this transition ( P P P Interpretation This population-scale proteomics study broadens our understanding of the mechanisms underlying obesity heterogeneity and CAS, providing potential targets for the prevention of CAS. Funding This study was supported by the National Natural Science Foundation Key Research and Development Program of Guangzhou R&D Program of Zhejiang Sun Yat-sen University Keywords Obesity heterogeneity Circulating proteins Carotid atherosclerosis Prospective study pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Research in context Evidence before this study Obese individuals exhibit considerable heterogeneity in developing CVD, such as metabolically healthy obesity (MHO) and metabolically unhealthy obesity (MUO). Previous studies suggest that circulating protein biomarkers may mediate the association between obesity and cardiovascular diseases (CVD) risk. However, the role of circulating proteins in the transition from MHO to MUO and the association between obesity heterogeneity and CVD risk remain unclear. Added value of this study This prospective cohort study demonstrates the temporal associations between obesity heterogeneity, serum proteomics, and incident carotid atherosclerosis (CAS). Some proteomic biomarkers are identified as prospective predictors of the transition from MHO to MUO. Additionally, it shows that proteomic biomarkers of obesity heterogeneity are associated with incident CAS risk. Implications of all the available evidence These findings provide novel insights into the mechanisms underlying obesity heterogeneity and its association with CAS risk, suggesting potential proteomic targets for risk prediction and early intervention of CAS. Introduction Obesity is a leading cause of cardiometabolic diseases (CVDs), yet individuals with obesity could exhibit remarkable heterogeneity in their health status. 1 2 3 4 5 6 , 7 4 , 8 Carotid atherosclerosis (CAS), characterised by the accumulation of lipids and fibrous elements in the carotid arteries, is a major contributor to CVDs. 9 9 2 10 11 12 13 14 10 , 11 12 13 14 Therefore, in this community-based prospective cohort study included 3162 middle-aged and elderly adults from the Guangzhou Nutrition and Health Study (GNHS), we profiled 6803 serum samples for proteomics across three time points over a 9-year follow-up. We defined obesity phenotypes based on dual-energy X-ray absorptiometry (DXA)-derived adiposity and metabolic health status. We aimed to identify proteomic biomarkers for different obesity phenotypes and examine their temporal relationships. Then, we examined the associations of these identified proteomic biomarkers with the risk of incident CAS, and evaluated the performance of proteomic biomarkers in predicting the MHO-to-MUO transition during follow-up. Methods Ethics The study protocol of the GNHS was approved by the Ethics Committee of the School of Public Health at Sun Yat-sen University (No. 2018048) and Ethics Committee of Westlake University (No: 20190114ZJS0003). All participants provided written informed consent. Study design and participants This study was based on the GNHS ( ClinicalTrials.gov NCT03179657 15 The data utilised in this study were collected between 2008 and 2023. After excluding participants without baseline measurements for circulating proteomics profiling (n = 223), DXA-derived body adiposity (n = 606), blood pressure (n = 9), fasting glucose (n = 43), or blood lipids (n = 5), 3162 participants were finally included in the current study for subsequent analysis ( Fig. S1 For proteomic analyses, participants from the GNHS multi-omics subcohort were set as discovery cohort (n = 1857), while the remaining GNHS participants comprised the internal validation cohort (n = 1305), in accordance with our predefined study design. 16 Fig. 1 Supplementary methods Fig. 1 Overview of the study cohort and design Definition of obesity phenotypes Body fat percentage (BF%) was determined using DXA (Discovery W, Hologic Inc., Waltham, MA, USA). DXA-derived obesity was defined as BF% ≥ 25% for men and ≥ 35% for women. 17 2 6 , 18 , 19 Assessment of carotid intima–media thickness and plaques Carotid intima-media thickness (cIMT) is a well-validated surrogate measure of subclinical atherosclerosis, and was measured at the common carotid artery using a high-solution 7.0–12.0 MHz linear-array transducer system (Aplio TOSHIBA, Japan), as detailed in our previous study. 20 21 22 Circulating proteome profiling Serum proteomics were profiled using data-independent acquisition mass spectrometry (DIA-MS), as detailed in our previous study. 16 , 23 Fig. 1 Statistical analysis All statistical analyses were performed using R software (version 4.1.2) and Python (version 3.8.5). Baseline characteristics of study participants were presented as median (interquartile range) for continuous variables and n (%) for categorical variables. Missing values of covariates at baseline were imputed using multiple imputation methods (missing rates: 0.3%–1.2%). We performed Cox proportional hazards regression models to examine the associations of obesity phenotypes with cIMT thickening and plaque incidence separately among all participants in the GNHS cohort, adjusting for age, sex, marital status, education, income, smoking, alcohol drinking, tea consumption, physical activity, and dietary energy intake at baseline as presented in Table 1 Table 1 Baseline characteristic of the study participants. Discovery Internal validation External validation n = 1857 n = 1305 n = 74 Age, years 60.4 (56.7, 64.5) 60.7 (56.6, 65.7) 74.3 (68.5, 77.2) Sex, n (%) Female 1267 (68.2) 883 (67.7) 60 (81.1) Male 590 (31.8) 422 (32.3) 14 (18.9) Ethnicity a Han 1474 (99.4) 887 (99.3) – Others 9 (0.6) 6 (0.7) – Marital status, n (%) Married 1695 (91.3) 1155 (88.5) 50 (67.6) Others 162 (8.7) 150 (11.5) 24 (32.4) Education, n (%) Secondary school or below 521 (28.1) 392 (30.0) 8 (10.8) High school 856 (46.1) 595 (45.6) 16 (21.6) College or above 480 (25.8) 318 (24.4) 50 (67.6) Household income, n (%) <1500, Yuan/person 883 (47.5) 596 (45.7) 3 (4.1) 1500–3000, Yuan/person 475 (25.6) 332 (25.4) 10 (13.5) >3000, Yuan/person 499 (26.9) 377 (28.9) 61 (82.4) Current smoking status, n (%) Nonsmoker 1638 (88.2) 1125 (86.2) 71 (95.9) Smoker 219 (11.8) 180 (13.8) 3 (4.1) Current alcohol drinking, n (%) Nondrinker 1744 (93.9) 1216 (93.2) 72 (97.3) Drinker 113 (6.1) 89 (6.8) 2 (2.7) Current tea drinking, n (%) No 869 (46.8) 607 (46.5) 30 (40.5) Yes 988 (53.2) 698 (53.5) 44 (59.5) Diabetes prevalence a 123 (7.5) 73 (6.2) 20 (27.0) Hypertension prevalence a 381 (23.2) 313 (26.5) 34 (46.6) Dyslipidemia prevalence a 491 (30.0) 345 (29.2) 41 (55.4) Physical activity, MET-h/d 35.8 (30.6, 51.2) 35.4 (30.3, 45.3) – Total energy intake, kcal/d 1693 (1418, 2066) 1668 (1381, 2048) 1250 (1092, 1410) BMI, kg/m 2 23.6 (21.6, 25.6) 23.2 (21.2, 25.3) 24.1 (22.7, 26.4) Waist a 85.5 (79.7, 90.7) 84.3 (78.2, 90.0) 85.3 (80.0, 89.7) Waist-to-hip ratio a 0.93 (0.88, 0.97) 0.92 (0.87, 0.96) 0.92 (0.88, 0.98) SBP, mmHg 123 (112, 136) 122 (111, 135) 127 (117, 140) DBP, mmHg 75.0 (68.3, 82.3) 74.0 (67.7, 80.7) 74.5 (68.0, 80.0) TC, mmol/L 5.54 (4.86, 6.19) 5.48 (4.87, 6.17) 5.22 (4.68, 6.14) TG, mmol/L 1.29 (0.92, 1.82) 1.20 (0.88, 1.70) 1.33 (0.94, 1.60) HDL-C, mmol/L 1.38 (1.13, 1.65) 1.42 (1.18, 1.69) 1.43 (1.23, 1.80) LDL-C, mmol/L 3.59 (3.01, 4.16) 3.52 (2.95, 4.07) 3.41 (2.90, 4.25) Fasting blood glucose, mmol/L 4.87 (4.41, 5.41) 4.82 (4.42, 5.31) 5.49 (5.02, 6.35) Body fat mass percentage, % 35.4 (29.7, 38.9) 35.1 (28.9, 39.0) 34.9 (31.1, 38.1) cIMT thickening prevalence a 502 (27.2) 312 (24.8) 26 (36.1) Plaque prevalence a 708 (38.5) 483 (38.4) 60 (83.3) Continuous variables were presented as median (interquartile range). Categorical variables were presented as n (%). MET, metabolic equivalent; BMI, body mass index; SBP, systolic blood pressure; DBP, diastolic blood pressure; TC, total cholesterol; TG, triglycerides; HDL-C, high-density lipoprotein cholesterol; LDL-C, low-density lipoprotein cholesterol; cIMT, carotid intima-media thickness. a Missing values were not imputed for these variables: ethnicity (n = 1483 and 893 in the discovery and internal validation cohorts, respectively); diabetes, hypertension, and dyslipidemia (n = 1639 and 1180, respectively); waist and waist-to-hip ratio (n = 1856 and 1302, respectively); cIMT thickening (n = 1844 and 1257, respectively); and plaque (n = 1841 and 1258, respectively). Partial least squares-discriminant analysis (PLS-DA) was employed to assess the overall differences in serum proteins across different obesity phenotypes at each visit separately in the discovery and internal validation cohorts. To identify serum proteomic biomarkers for different obesity phenotypes, we employed generalized linear mixed models (GLMM) separately in the discovery and internal validation cohorts, adjusting for above-mentioned covariates. Serum proteins with a Benjamini-Hochberg false discovery rate (FDR) < 0.05 in the discovery cohort and confirmed in the internal validation cohort ( P 24 We conducted cross-lagged panel models to investigate the temporal relationships between the obesity phenotypes and proteomic biomarkers identified from the GLMM models, using repeated measurements of serum proteins and obesity phenotypes at baseline and the 2nd follow-up ( Supplementary methods P To assess the overall impact of obesity phenotype-influenced proteomic biomarkers on CAS risk, we constructed protein risk score (ProRS) based on biomarkers that were temporally influenced by obesity phenotypes, as identified through the cross-lagged panel models. The ProRS was calculated as follows: P r o t e i n R i s k S c o r e = ∑ ( protein level ) × ( coefficient from GLMM model ) Table 1 In predicting the transition from MHO at baseline to MUO at the 2nd follow-up (vs. stable MHO), we constructed two machine learning models based on Light Gradient Boosting Machine (lightGBM). The traditional model was developed with seven clinical risk factors: age, sex, systolic blood pressure (SBP), diastolic blood pressure (DBP), triglycerides, HDL-C, and fasting glucose at baseline. The combined model incorporated these clinical risk factors along with MHO-to-MUO transition-associated proteomic biomarkers. In the discovery cohort, predictive performance was assessed using the average area under the receiver operating characteristic curves (AUROC) from 100 iterations of five-fold cross-validation, and Wilcoxon test was used to compare differences between models. Furthermore, the trained model from the discovery cohort was validated in the internal validation cohort, and DeLong's test was employed to compare the differences. We employed structural equation models (SEM) to investigate the bidirectional mediation effects of proteomic biomarkers and the transition from MHO at baseline to MUO at the 2nd follow-up on the CAS incidence in the discovery cohort ( Supplementary methods P −5 25 In the external validation cohort, we conducted logistic regression models to validate the associations of the identified proteomic signatures with obesity phenotypes and the risk of CAS prevalence, adjusted for age and sex. Due to the small sample size, significant associations were determined at a threshold of P Role of funders The funders had no role in the design and conduct of the study; collection, management, analysis, and interpretation of the data; preparation, review, or approval of the manuscript; and decision to submit the manuscript for publication. Results Baseline characteristics of the study participants The overview of the study design was presented in Fig. 1 Table 1 Tables S1–S3 Comparison of BF%-based and BMI-based obesity phenotypes in risk stratification of CAS incidence After 9 years of follow-up, 462 (22.5%) participants developed cIMT thickening and 876 (48.3%) developed carotid plaque among those free of corresponding conditions at baseline in the GNHS cohort. Compared to MHO, BF%-based MUO was associated with a higher risk of cIMT thickening (HR: 1.27; 95% CI: 1.02–1.59), while BMI-based MUO showed no association (HR: 0.95; 95% CI: 0.68–1.35) after adjusting for potential confounders ( Fig. 2 Fig. S2 Fig. 2 Identification of serum proteomic biomarkers for different obesity phenotypes P P P P Identification of proteomic biomarkers for BF%-based obesity phenotypes In both the discovery and internal validation cohorts, PLS-DA models indicated altered compositions of serum proteins across different obesity phenotypes over the three timepoints ( Fig. S3 Fig. 2 Fig. 2 Fig. 2 discovery P validation R 2 Fig. S4 Fig. S5 Fig. 2 Tables S4–S6 Fig. S6 Consistent results were observed for BMI-based obesity phenotypes ( Fig. S7 Fig. S7 Temporal relationships between obesity phenotypes and the identified proteomic biomarkers In the direction from baseline obesity phenotypes to the 2nd follow-up proteins, cross-lagged models revealed that 22 of the 37 MHO-MHNO proteins ( Fig. 3 Fig. 3 Fig. 3 discovery P validation Fig. 3 Tables S7–S8 Fig. 3 Table S9 Fig. 3 Temporal relationships between obesity phenotypes and the identified proteomic biomarkers Prospective associations of proteomic signatures with carotid atherosclerosis incidence We constructed three ProRS based on the 22 MHO-MHNO proteins, 44 MUO-MHNO proteins, and 11 MUO-MHO proteins that were temporally influenced by obesity phenotypes, respectively. In the discovery cohort, baseline ProRS were positively associated with the incidence of cIMT thickening, with HRs (95% CIs) per SD increase of 1.21 (1.04, 1.42) for MHO-MHNO ProRS ( Fig. 4 Fig. 4 Fig. 4 Fig. S8A Fig. S8B Fig. S8C Fig. S9A Fig. S9B P Fig. 4 Associations of baseline proteomic signatures with carotid atherosclerosis incidence and the transition from MHO to MUO P P P Among the 44 proteins included in the above ProRS construction, Cox regression models showed that 14 were significantly associated with cIMT thickening incidence in the discovery cohort ( P Table S10 Table S11 Associations of proteomic biomarkers with the transition from MHO to MUO After 3.2 years of follow-up, 128 (19.3%) participants with MHO at baseline transitioned to MUO at the 2nd follow-up in the discovery cohort ( Fig. S10 P Wilcoxon Fig. 4 P Fig. 4 In the discovery cohort, bidirectional mediation effects were observed between PEDF and MHO-to-MUO transition on cIMT thickening incidence ( P indirect effect P indirect effect P indirect effect Fig. 4 Among the eight identified proteins, cis-pQTLs were available only for PEDF in the Chinese GWAS summary data, and the PEDF-GRS was constructed with nine cis-pQTLs after linkage disequilibrium clumping ( R 2 Table S12 F Fig. 4 Fig. 4 Replication in the external validation cohort In the external validation cohort, we validated the associations of some proteomic biomarkers (e.g., GPX3, PEDF, and PHLB2) with obesity phenotypes among 74 participants using logistic regression models ( P Fig. S11 Fig. S12 Fig. S12 Fig. S12 Discussion In this prospective cohort study of Chinese middle-aged and elderly adults, we identified a panel of proteomic biomarkers associated with BF%-based obesity phenotypes, which were linked to the risk of CAS incidence. Notably, eight proteomic biomarkers (i.e., APOF, SHBG, PEDF, GPX3, GELS, RLF, ZN879, and PHLB2) significantly improved the predictive performance for the transition from MHO to MUO. Among the eight proteins, we observed bidirectional mediation effects between PEDF and MHO-to-MUO transition on CAS incidence, and the genetic risk score of PEDF was associated with an increased risk of this transition. Our main findings were validated in both the internal and external validation cohorts. Previous efforts to refine the definition of MHO have largely focused on metabolic health, 6 , 8 26 7 The proteins we identified for both MHO and MUO were consistent with previous findings on adiposity, 27 28 29 30 31 32 33 Interestingly, we observed that the majority of identified proteins were temporally influenced by obesity phenotypes, and their corresponding protein risk scores showed significant associations with incident CAS risk. Moreover, some individual proteins included in the score, such as APOF, APOA1, SHBG, and C3, also were significantly associated with CAS incidence. These findings aligned with previous studies showing positive associations of CFAH, C3, APOC2, and APOC3, and negative associations of APOF, APOA1, SHBG, and GPX3 with cardiometabolic health. 34 35 36 37 38 39 40 41 , 42 10 11 12 13 Although previous studies have proposed genetic and hormonal factors as potential mechanisms underlying obesity heterogeneity, 6 43 44 45 46 42 , 47 48 49 , 50 The present study has several strengths. First, DXA scanning, as the gold standard for assessing body composition within research settings, addressed the limitations of BMI in distinguishing between lean and fat mass, thereby minimising the misclassification bias of obesity phenotypes. Second, the longitudinal design with repeated serum proteomics profiling reduced bias from temporal protein changes and enabled the assessment of temporal relationships among obesity phenotypes, proteomic biomarkers, and incident CAS risk. Third, our main findings were consistently validated in both the internal and external validation cohorts. Our study also has several limitations. First, the definition of metabolic health status remains debated, although we used the most widely accepted criteria. Second, although our MS-based proteomics workflow provides unbiased, hypothesis-free, and relatively high-abundance proteome analysis, 16 , 23 In summary, our present study has identified various important circulating protein biomarkers associated with obesity heterogeneity, and these circulating proteins are predictive of CAS incidence. Our findings provide insights into the potential mechanisms underlying both obesity heterogeneity and CAS progression, suggesting potential intervention targets for cardiovascular disease. Contributors H.Z.: J.C.: S.J.: H.C.: Y.X.: Y.Y.: Z.L.: C.X.: F.X.: J.T.: J.-S.Z.: Y.-m.C.: H.Z. Y.-m.C. Data Sharing statement The serum proteomics data have been uploaded to the iProX database ( https://www.iprox.cn/page/home.html Declaration of interests The authors declare that they have no competing interests. References 1 Després J.-P. BMI versus obesity subtypes in the era of precision medicine Lancet Diabetes Endocrinol 11 6 2023 382 384 37068507 10.1016/S2213-8587(23)00088-8 2 Huang Q. Liu Z. Wei M. Metabolically healthy obesity, transition from metabolic healthy to unhealthy status, and carotid atherosclerosis Diabetes Metab Res Rev 40 2 2024 e3766 10.1002/dmrr.3766 38351639 3 Gao M. Lv J. Yu C. Metabolically healthy obesity, transition to unhealthy metabolic status, and vascular disease in Chinese adults: a cohort study PLoS Med 17 10 2020 e1003351 10.1371/journal.pmed.1003351 PMC7598496 33125374 4 Kouvari M. Panagiotakos D.B. Yannakoulia M. Transition from metabolically benign to metabolically unhealthy obesity and 10-year cardiovascular disease incidence: the ATTICA cohort study Metabolism 93 2019 18 24 30639450 10.1016/j.metabol.2019.01.003 5 Mongraw-Chaffin M. Foster M.C. Anderson C.A.M. Metabolically healthy obesity, transition to metabolic syndrome, and cardiovascular risk J Am Coll Cardiol 71 17 2018 1857 1865 29699611 10.1016/j.jacc.2018.02.055 PMC6002856 6 Schulze M.B. Stefan N. Metabolically healthy obesity: from epidemiology and mechanisms to clinical implications Nat Rev Endocrinol 20 11 2024 633 646 38937638 10.1038/s41574-024-01008-5 7 Shea J.L. Randell E.W. Sun G. The prevalence of metabolically healthy obese subjects defined by BMI and dual-energy X-ray absorptiometry Obesity (Silver Spring) 19 3 2011 624 630 20706202 10.1038/oby.2010.174 8 Stefan N. Schulze M.B. Metabolic health and cardiometabolic risk clusters: implications for prediction, prevention, and treatment Lancet Diabetes Endocrinol 11 6 2023 426 440 37156256 10.1016/S2213-8587(23)00086-4 9 Song P. Xia W. Zhu Y. Prevalence of carotid atherosclerosis and carotid plaque in Chinese adults: a systematic review and meta-regression analysis Atherosclerosis 276 2018 67 73 30036743 10.1016/j.atherosclerosis.2018.07.020 10 Lim C.G.Y. Ozkan B. Liang Y. Plasma proteomic signatures of adiposity are associated with cardiovascular risk factors and type 2 diabetes risk in a multiethnic Asian population Diabetes 74 3 2025 416 426 39621883 10.2337/db24-0184 PMC11842604 11 Pang Y. Kartsonaki C. Lv J. Associations of adiposity, circulating protein biomarkers, and risk of major vascular diseases JAMA Cardiol 6 3 2021 276 286 33263724 10.1001/jamacardio.2020.6041 PMC7711564 12 Ma H. Wang X. Heianza Y. Manson J.E. Qi L. Proteomic signature of BMI and risk of cardiovascular disease Clin Chem 70 12 2024 1474 1484 39392242 10.1093/clinchem/hvae149 13 Wang X. Ma H. Kou M. Heianza Y. Fonseca V. Qi L. Proteomic signature of BMI and risk of type 2 diabetes Diabetes 74 2 2025 234 242 39561322 10.2337/db24-0329 PMC11755684 14 Yang F. Xu F. Zhang H. Proteomic insights into the associations between obesity, lifestyle factors, and coronary artery disease BMC medicine 21 1 2023 485 38049831 10.1186/s12916-023-03197-8 PMC10696760 15 Ling C.-W. Zhong H. Zeng F.-F. Cohort profile: guangzhou nutrition and health study (GNHS): a population-based multi-omics study J Epidemiol 34 6 2024 301 306 37813622 10.2188/jea.JE20230108 PMC11078596 16 Tang J. Yue L. Xu Y. Longitudinal serum proteome mapping reveals biomarkers for healthy ageing and related cardiometabolic diseases Nat Metab 7 1 2025 166 181 39805987 10.1038/s42255-024-01185-7 PMC11774760 17 Li L. Wang C. Bao Y. Peng L. Gu H. Jia W. Optimal body fat percentage cut-offs for obesity in Chinese adults Clin Exp Pharmacol Physiol 39 4 2012 393 398 22320261 10.1111/j.1440-1681.2012.05684.x 18 Revision Jcfg. 2016 Chinese guidelines for the management of dyslipidemia in adults J Geriatr Cardiol 15 1 2018 1 29 29434622 10.11909/j.issn.1671-5411.2018.01.011 PMC5803534 19 Alberti K.G. Eckel R.H. Grundy S.M. Harmonizing the metabolic syndrome: a joint interim statement of the international diabetes Federation task force on epidemiology and prevention; national heart, lung, and blood institute; American heart association; world heart Federation; international atherosclerosis society; and international association for the study of obesity Circulation 120 16 2009 1640 1645 19805654 10.1161/CIRCULATIONAHA.109.192644 20 Ding D. Zhong Q.W. Zuo L.S. Association between erythrocyte membrane n-3 and n-6 polyunsaturated fatty acids and carotid atherosclerosis: a prospective study Atherosclerosis 298 2020 7 13 32126389 10.1016/j.atherosclerosis.2020.02.013 21 Touboul P.J. Hennerici M.G. Meairs S. Mannheim carotid intima-media thickness and plaque consensus (2004-2006-2011). An update on behalf of the advisory board of the 3rd, 4th and 5th watching the risk symposia, at the 13th, 15th and 20th European stroke conferences, Mannheim, Germany, 2004, Brussels, Belgium, 2006, and Hamburg, Germany, 2011 Cerebrovasc Dis 34 4 2012 290 296 23128470 10.1159/000343145 PMC3760791 22 Liu C.Y. Li B.Y. Liang Y. The association between circulating 25-Hydroxyvitamin D and carotid intima-media thickness is mediated by Gut Microbiota and fecal and serum metabolites in adults Mol Nutr Food Res 67 17 2023 e2300017 10.1002/mnfr.202300017 37377073 23 Cai X. Xue Z. Zeng F.-F. Population serum proteomics uncovers a prognostic protein classifier for metabolic syndrome Cell Rep Med 4 9 2023 101172 10.1016/j.xcrm.2023.101172 PMC10518601 37652016 24 Wu T. Hu E. Xu S. clusterProfiler 4.0: a universal enrichment tool for interpreting omics data Innovation (Camb) 2 3 2021 100141 10.1016/j.xinn.2021.100141 PMC8454663 34557778 25 Xu F. Yu E.Y. Cai X. Genome-wide genotype-serum proteome mapping provides insights into the cross-ancestry differences in cardiometabolic disease susceptibility Nat Commun 14 1 2023 896 36797296 10.1038/s41467-023-36491-3 PMC9935862 26 Wu Y. Li D. Vermund S.H. Advantages and limitations of the body mass index (BMI) to assess adult obesity Int J Environ Res Public Health 21 6 2024 757 38929003 10.3390/ijerph21060757 PMC11204233 27 Iona A. Yao P. Pozarickij A. Proteo-genomic analyses in relatively lean Chinese adults identify proteins and pathways that affect general and central adiposity levels Commun Biol 7 1 2024 1327 39406990 10.1038/s42003-024-06984-y PMC11480319 28 Yao P. Iona A. Kartsonaki C. Conventional and genetic associations of adiposity with 1463 proteins in relatively lean Chinese adults Eur J Epidemiol 38 10 2023 1089 1103 37676424 10.1007/s10654-023-01038-9 PMC10570181 29 Obeso A. Drouard G. Palviainen T. Proteomic associations with fluctuation and long-term changes in BMI: a 40-year follow-up study Diabetes Obes Metab 27 8 2025 4192 4202 40344339 10.1111/dom.16448 PMC12232349 30 Drouard G. Hagenbeek F.A. Whipp A.M. Longitudinal multi-omics study reveals common etiology underlying association between plasma proteome and BMI trajectories in adolescent and young adult twins BMC Med 21 1 2023 508 38129841 10.1186/s12916-023-03198-7 PMC10740308 31 Cao M. Cui B. Clinically relevant plasma proteome for adiposity depots: evidence from systematic mendelian randomization and colocalization analyses Cardiovasc Diabetol 23 1 2024 126 38614964 10.1186/s12933-024-02222-1 PMC11016216 32 Cominetti O. Nunez Galindo A. Corthesy J. Obesity shows preserved plasma proteome in large independent clinical cohorts Sci Rep 8 1 2018 16981 10.1038/s41598-018-35321-7 PMC6242904 30451909 33 Nono Nankam P.A. Bluher M. Retinol-binding protein 4 in obesity and metabolic dysfunctions Mol Cell Endocrinol 531 2021 111312 10.1016/j.mce.2021.111312 33957191 34 Gou W. Yue L. Tang X.-Y. Circulating proteome and progression of type 2 diabetes J Clin Endocrinol Metab 107 6 2022 1616 1625 35184183 10.1210/clinem/dgac098 35 Al H. Ahmad R.M. Al-Domi H.A. Complement 3 serum levels as a pro-inflammatory biomarker for insulin resistance in obesity Diabetes Metab Syndr 11 Suppl 1 2017 S229 S232 28017633 10.1016/j.dsx.2016.12.036 36 Ku E.J. Cho K.-C. Lim C. Discovery of plasma biomarkers for predicting the severity of coronary artery atherosclerosis by quantitative proteomics BMJ Open Diabetes Res Care 8 1 2020 e001152 10.1136/bmjdrc-2019-001152 PMC7202779 32327445 37 Stitziel N.O. Kanter J.E. Bornfeldt K.E. Emerging targets for cardiovascular disease prevention in diabetes Trends Mol Med 26 8 2020 744 757 32423639 10.1016/j.molmed.2020.03.011 PMC7395866 38 Wilkins J.T. Rohatgi A. Resolution of apolipoprotein A1 and A2 proteoforms: their cardiometabolic correlates and implications for future research Curr Opin Lipidol 33 4 2022 264 269 36082946 10.1097/MOL.0000000000000840 PMC10903106 39 Li J. Zheng L. Chan K.H.K. Sex hormone-binding globulin and risk of coronary heart disease in men and women Clin Chem 69 4 2023 374 385 36702572 10.1093/clinchem/hvac209 PMC11599539 40 Nirgude S. Choudhary B. Insights into the role of GPX3, a highly efficient plasma antioxidant, in cancer Biochem Pharmacol 184 2021 114365 10.1016/j.bcp.2020.114365 33310051 41 Li J. Wang K. Starodubtseva M.N. Complement factor H in molecular regulation of angiogenesis Med Rev (2021) 4 5 2024 452 466 39444793 10.1515/mr-2023-0048 PMC11495524 42 Zhang Q. Wen X.-H. Tang S.-L. Zhao Z.-W. Tang C.-K. Role and therapeutic potential of gelsolin in atherosclerosis J Mol Cell Cardiol 178 2023 59 67 36967105 10.1016/j.yjmcc.2023.03.012 43 Liu Y. Morton R.E. Apolipoprotein F. A natural inhibitor of cholesteryl ester transfer protein and a key regulator of lipoprotein metabolism Curr Opin Lipidol 31 4 2020 194 199 32520778 10.1097/MOL.0000000000000688 PMC8020876 44 Bourebaba N. Ngo T. Smieszek A. Bourebaba L. Marycz K. Sex hormone binding globulin as a potential drug candidate for liver-related metabolic disorders treatment Biomed Pharmacother 153 2022 113261 10.1016/j.biopha.2022.113261 35738176 45 Hauffe R. Stein V. Chudoba C. GPx3 dysregulation impacts adipose tissue insulin receptor expression and sensitivity JCI Insight 5 11 2020 e136283 10.1172/jci.insight.136283 PMC7308064 32369454 46 Wei S. Zhang L. Zhou X. Emerging roles of zinc finger proteins in regulating adipogenesis Cell Mol Life Sci 70 23 2013 4569 4584 23760207 10.1007/s00018-013-1395-0 PMC4100687 47 Piktel E. Levental I. Durnas B. Janmey P.A. Bucki R. Plasma Gelsolin: indicator of inflammation and its potential as a diagnostic tool and therapeutic target Int J Mol Sci 19 9 2018 2516 30149613 10.3390/ijms19092516 PMC6164782 48 Noordstra I. van den Berg C.M. Boot F.W.J. Organization and dynamics of the cortical complexes controlling insulin secretion in beta-cells J Cell Sci 135 3 2022 jcs259430 10.1242/jcs.259430 PMC8918791 35006275 49 Crowe S. Wu L.E. Economou C. Pigment epithelium-derived factor contributes to insulin resistance in obesity Cell Metab 10 1 2009 40 47 19583952 10.1016/j.cmet.2009.06.001 50 Famulla S. Lamers D. Hartwig S. Pigment epithelium-derived factor (PEDF) is one of the most abundant proteins secreted by human adipocytes and induces insulin resistance and inflammatory signaling in muscle and fat cells Int J Obes (Lond) 35 6 2011 762 772 20938440 10.1038/ijo.2010.212 Appendix A Supplementary data  Supplement 1 Supplement 2 Acknowledgements This study was supported by the National Natural Science Foundation 85274079 92374112 82073546 81773416 Key Research and Development Program of Guangzhou 202007040003 R&D Program of Zhejiang 2024SSYS0032 2022C03102 2007032 Sun Yat-sen University Appendix A Supplementary data related to this article can be found at https://doi.org/10.1016/j.ebiom.2025.105935 ",
  "metadata": {
    "Title of this paper": "Pigment epithelium-derived factor (PEDF) is one of the most abundant proteins secreted by human adipocytes and induces insulin resistance and inflammatory signaling in muscle and fat cells",
    "Journal it was published in:": "eBioMedicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489834/"
  }
}