{
  "title": "Paper_735",
  "abstract": "pmc Lancet Oncol Lancet Oncol 445 elsevierwt The Lancet. Oncology 1470-2045 1474-5488 pmc-is-collection-domain yes pmc-collection-title Elsevier Sponsored Documents PMC12479390 PMC12479390.1 12479390 12479390 40921169 10.1016/S1470-2045(25)00379-1 S1470-2045(25)00379-1 1 Articles Adjuvant chemoradiotherapy versus radiotherapy alone in women with high-risk endometrial cancer (PORTEC-3): 10-year clinical outcomes and post-hoc analysis by molecular classification from a randomised phase 3 trial Post Cathalijne C B MD c.c.b.post@lumc.nl a * de Boer Stephanie M MD a Powell Melanie E MD b Mileshkin Linda Prof MD c Katsaros Dionyssios Prof MD d Bessette Paul Prof MD e Leary Alexandra MD f Ottevanger Petronella B MD g McCormack Mary MD h Khaw Pearly MD i D'Amico Romerai MD j Fyles Anthony Prof MD k Chargari Cyrus Prof MD l Kitchener Henry C Prof MD m Do Viet MD n Lissoni Andrea MD o Provencher Diane Prof MD p Genestie Catherine MD q Nijman Hans W Prof MD r Whitmarsh Karen MD s Jürgenliemk-Schulz Ina M MD t Feeney Amanda MSc u Lutgens Ludy C H W MD v Bouma Jeanette MSc w Leon-Castillo Alicia MD x Nout Remi A Prof MD a Putter Hein Prof PhD y Bosse Tjalling Prof MD x Creutzberg Carien L Prof MD a a b c d e f g h i j k l m n o p q r s t u v w x y * c.c.b.post@lumc.nl 10 2025 26 10 497828 1370 1381 01 10 2025 01 10 2025 01 10 2025 © 2025 The Author(s). Published by Elsevier Ltd. This is an Open Access article under the CC BY 4.0 license 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Summary Background The PORTEC-3 trial investigated the benefit of chemoradiotherapy versus pelvic radiotherapy alone for women with high-risk endometrial cancer. We present the preplanned long-term analysis of the randomised PORTEC-3 trial with a post-hoc analysis including molecular classification of the tumours. Methods PORTEC-3 was an open-label, multicentre, randomised, international phase 3 trial. Women were eligible if they had high-risk endometrial cancer (either International Federation of Gynecology and Obstetrics 2009 stage I, grade 3, with deep myometrial invasion and/or lymphovascular space invasion; stage II–III; or stage I–III with serous or clear-cell histology), were aged 18 years or older, and had a WHO performance score of 0–2. Participants were randomly assigned (1:1) to receive pelvic radiotherapy (48·6 Gy in 1·8 Gy fractions) or chemoradiotherapy (radiotherapy combined with two cycles of cisplatin 50 mg/m 2 2 ClinicalTrials.gov NCT00411138 Findings Between Nov 23, 2006, and Dec 20, 2013, 660 eligible and evaluable patients recruited at 103 centres in six clinical trial groups across seven countries were randomly assigned to chemoradiotherapy (n=330) or radiotherapy alone (n=330). Median follow-up was 10·1 years (IQR 9·8–11·0). Estimated 10-year overall survival was 74·4% (95% CI 69·8–79·4) in the chemoradiotherapy group and 67·3% (62·3–72·7) in the radiotherapy group (adjusted hazard ratio [HR] 0·73 [95% CI 0·54–0·97], p=0·032), and 10-year recurrence-free survival was 72·8% (67·2–77·6) versus 67·4% (61·7–72·4; adjusted HR 0·74 [95% CI 0·56–0·98], p=0·034). Molecular analysis was available for 411 (62%) patients (210 [64%] of 330 patients in the chemoradiotherapy group and 201 [61%] of 330 patients in the radiotherapy group), whose characteristics were similar to the overall trial population. Post-hoc analysis by molecular class showed that, for women with p53 abnormal tumours, 10-year overall survival was 52·7% (95% CI 40·8–68·1) with chemoradiotherapy versus 36·6% (25·0 to 53·7) with radiotherapy alone (adjusted HR 0·52 [95% CI 0·30–0·91], p=0·021); 10-year recurrence-free survival was 52·6% (95% CI 38·3 to 65·0) versus 37·0% (95% CI 23·7 to 50·2; HR 0·42 [95% CI 0·24 to 0·74], p=0·0027). MMRd and POLEmut cancers did not seem to benefit from chemoradiotherapy over radiotherapy alone, whereas the effects for NSMP cancers were modulated by oestrogen-receptor status. Interpretation 10-year overall survival and recurrence-free survival were improved for patients with high-risk endometrial cancer treated with adjuvant chemoradiotherapy versus radiotherapy alone, with most clinically relevant benefit suggested for p53 abnormal cancers. Funding Dutch Cancer Society, Cancer Research UK, National Health and Medical Research Council Australia, Cancer Australia, Italian Medicines Agency, and the Canadian Cancer Society Research Institute. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction About 15–20% of patients with endometrial cancer present with high-risk disease and have an increased risk of recurrence and death. High-risk characteristics include early-stage disease with substantial lymphovascular space invasion, high-grade and/or non-endometrioid histology, and more advanced disease. To maximise locoregional control and recurrence-free interval, pelvic radiation therapy has been the standard adjuvant treatment for women with high-risk endometrial cancer. The randomised PORTEC-3 trial 1 2  Research in context  Evidence before this study In 2013, The Cancer Genome Atlas identified four distinct molecular subtypes of endometrial cancer based on genomic architecture. Subsequently, the TransPORTEC and ProMisE research groups showed that molecular classification could be assessed in clinical pathology with surrogate markers, yielding robust prognostic differences: tumours with a pathogenic POLE POLE  Added value of this study This 10-year analysis of the PORTEC-3 trial, with complete follow-up in 89% of the participants, supports previous evidence of significant improvements in both overall survival and recurrence-free survival with chemoradiotherapy versus radiotherapy alone for high-risk endometrial cancer. The greatest absolute benefit with chemoradiotherapy was seen in patients with p53abn cancers. Most recurrences occurred at distant sites, with patients in both treatment groups having excellent local and regional nodal control with pelvic radiotherapy. The prognostic and predictive value of the molecular classification and differences in added value of chemotherapy between molecular subgroups are clearly shown and have therapeutic implications.  Implications of all the available evidence Adjuvant chemoradiotherapy provides improved recurrence-free and overall survival, with clinically relevant benefits occurring especially in p53abn endometrial cancers. For NSMP oestrogen receptor-negative tumours, chemoradiotherapy should be considered instead of either chemotherapy or radiotherapy alone. For high-risk NSMP ER-positive tumours, the benefit of chemotherapy might be smaller than previously hypothesised, and hormonal therapy could be a relevant alternative treatment option; further investigation is needed. Use of chemoradiotherapy does not seem to be of added value over radiotherapy alone in MMRd or POLE Research has shown that the four molecular subgroups of endometrial cancer described by The Cancer Genome Atlas provide strong prognostic and predictive value. 3 4 5 6 7 8 9 10 POLE POLE 7 Molecular analysis in PORTEC-3 7 11 POLE 7 12 13 14 15 The aims of this pre-planned long-term analysis of the PORTEC-3 trial were to evaluate the primary endpoints (overall and by histology and stage) and conduct a post-hoc analysis by molecular subgroup to inform treatment decisions and further research. In addition, we analysed patterns of recurrence and survival after recurrence. Methods Study design and participants PORTEC-3 1 appendix (pp 1–2 Details about patient selection and treatment have been published previously. 1 2 16 Randomisation and masking Patients were randomly allocated (1:1) to adjuvant chemoradiotherapy or radiotherapy alone by use of a web-based biased-coin minimisation procedure, ensuring balance overall and within each stratum of stratification factors: 17 18 vs vs vs vs vs Procedures All patients underwent abdominal or laparoscopic hysterectomy with bilateral salpingo-oophorectomy with or without lymphadenectomy. Clinically suspicious pelvic or periaortic lymph nodes were removed, but full lymphadenectomy was not mandatory, depending on the centre or group standard protocol. Patients in the radiotherapy alone group received pelvic radiotherapy to a dose of 48·6 Gy in 1·8 Gy fractions, five times per week, with a brachytherapy boost in case of cervical stromal involvement. Patients in the chemoradiotherapy group received the same radiotherapy combined with two concurrent cycles of cisplatin 50 mg/m 2 2 Follow-up was at regular intervals until 5 years. Long-term follow-up information was collected at 7 and 10 years from random assignment. After diagnosis of any relapse, treatment information was required, and follow-up was continued according to protocol guidelines. Following consent from the participants, 423 formalin-fixed paraffin-embedded tissue samples were collected, of which 411 could be successfully molecularly classified. Molecular classification was done according to the algorithm provided by Vermij and colleagues 19 8 7 9 POLE POLE Outcomes The original coprimary endpoints were 5-year overall survival and failure-free survival. Here, the primary outcomes were 10-year overall survival and recurrence-free survival. Overall survival was defined as the time from random assignment to death from any cause. Recurrence-free survival was defined as time from random assignment to any relapse or as death related to endometrial cancer, whichever occurred first. Recurrence-free survival is presented in this analysis rather than failure-free survival as it is a more common outcome measure in adjuvant therapy trials in oncology. The original secondary endpoints were vaginal, pelvic, or distant recurrence; treatment-related toxicity; and health-related quality of life. In this preplanned 10-year analysis, we evaluated long-term patterns of recurrences (vaginal, pelvic, or distant). Adverse events of grade 2 or worse severity were recorded at every follow-up visit, including those at 7 and 10 years, which could take place by telephone or via information from the general practitioner. Statistical analysis The PORTEC-3 trial was powered (80%) to detect a 10% difference in 5-year overall survival between the treatment groups (increase from 65% to 75%, hazard ratio [HR] 0·67), with a two-sided test at an α level of 0·05. 198 overall survival events were required, with a minimum of 655 patients. These calculations were for the primary analysis with 5 years' follow-up. 1 2 Differences in relapse and survival between groups were assessed with the log-rank test and adjusted Cox regression analysis. Analysis of the primary endpoints was adjusted for the stratification factors. In the multivariable analysis, the following covariates were included together with treatment: stage, histological type and grade, type of surgery, participating group, lymphovascular space invasion, age, and molecular subgroup. We also conducted an updated post-hoc exploratory analysis of the primary outcomes by molecular subgroup, for the whole population. For the adjusted analysis in these subgroups, a simplified multivariable Cox model was used, with dichotomisation of the stratification factors (lymphadenectomy, stage, and histological type) to compensate for the low numbers of events in these subgroups. The proportional hazards assumption for treatment was checked by use of Schoenfeld residuals. Competing risk methods were used for analyses of recurrence-free survival and vaginal, pelvic, and distant recurrence-free survival by calculating cumulative incidences and Fine-Gray regression. For the first recurrence analysis, all other recurrences and death were used as competing risks. For the total number of recurrences, intercurrent death alone was used as a competing risk. Recurrences were analysed according to first site of recurrence as well as by total number of recurrences for each type (vaginal, pelvic, or distant). Simultaneous vaginal and pelvic recurrence was considered pelvic recurrence, and simultaneous vaginal, pelvic, and distant recurrence was considered distant recurrence. Abdominal recurrences outside the pelvic area (peritoneal carcinomatosis, liver, and para-aortic lymph nodal metastases) were considered distant metastases, with specification of site. In addition, we conducted a post-hoc analysis of survival after recurrence, which was compared with a log-rank test, using the first site of recurrence. Reported p values were based on two-sided tests, with p<0·05 considered statistically significant. Statistical analyses were done with R, version 4.1.0. This study is registered with ISRCTN (ISRCTN14387080) and ClinicalTrials.gov NCT00411138 Role of the funding source The funders of the study had no role in study design, data collection, data analysis, data interpretation, or writing of the report. Results Between Nov 23, 2006, and Dec 20, 2013, 686 women were enrolled and randomly assigned to chemoradiotherapy (n=343) or radiotherapy alone (n=343); 26 patients were excluded after random assignment (13 due to immediate withdrawal of consent and 13 ineligible), resulting in 660 eligible and evaluable patients in the intention-to-treat analysis (330 in each group; appendix p 3 1 2 7 7 table 1 1 2 Table 1 Baseline characteristics by treatment group Chemoradiotherapy (n=330) Radiotherapy (n=330) Age Median (IQR), years 62·4 (56·5–67·9) 62·0 (55·8–68·2) <60 years 128 (39%) 140 (42%) 60–69 144 (44%) 128 (39%) ≥70 years 58 (18%) 62 (19%) Stage IA 39 (12%) 39 (12%) IB 59 (18%) 58 (18%) II 80 (24%) 90 (27%) III 152 (46%) 143 (43%) Histology and grade Endometroid grade 1–2 127 (39%) 131 (40%) Endometroid grade 3 107 (32%) 106 (32%) Serous 53 (16%) 52 (16%) Clear cell 29 (9%) 33 (10%) Other 14 (4%) 8 (2%) Lymphovascular space invasion (any) Present 133 (40%) 192 (58%) Absent 197 (60%) 138 (42%) Type of surgery TAH and BSO 97 (29%) 97 (29%) TAH and BSO plus LND or full staging 141 (43%) 132 (40%) TLH and BSO 45 (14%) 42 (13%) TLH and BSO plus LND or full staging 47 (14%) 59 (18%) Molecular class * MMRd 67/210 (32%) 72/201 (36%) POLE 23/210 (11%) 28/201 (14%) P53abn 53/210 (25%) 46/201 (23%) NSMP † 67/210 (32%) 55/201 (27%) NSMP ER-negative 6/210 (3%) 7/201 (4%) NSMP ER-positive 58/210 (28%) 46/201 (23%) Data are n (%) or n/N (%) unless otherwise specified. Percentages might sum to more than 100% because of rounding. TAH=total abdominal hysterectomy. BSO=bilateral salpingo-oophorectomy. ER=oestrogen receptor. LND=lymph node dissection. MMRd=mismatch repair deficient. NSMP=no specific molecular profile. p53abn=p53 abnormal. POLE POLE * Molecular analysis was performed for 411 patients. † Data on ER staining were missing or ambiguous for three patients in the chemoradiotherapy group and two patients in the radiotherapy group. At the final database lock (Dec 16, 2024), at least 9 years of follow-up information had been obtained for 89% of patients, and at least 7 years of follow-up were completed for 95% of patients. Median follow-up was 10·1 years (IQR 9·8–11·0). In total, 189 patients had died: 84 in the chemoradiotherapy group and 105 in the radiotherapy alone group. Most patient deaths were related to endometrial cancer: 65 (77%) of 84 deaths in the chemoradiotherapy group versus 85 (81%) of 105 in the radiotherapy alone group. The second most common cause of death was a secondary malignancy, which caused eight (10%) patient deaths in the chemoradiotherapy group versus 11 (10%) in the radiotherapy alone group. Estimated 10-year overall survival was 74·4% (95% CI 69·8–79·4) in the chemoradiotherapy group versus 67·3% (62·3–72·7) in the radiotherapy alone group (adjusted HR 0·73 [95% CI 0·54–0·97], p=0·032; figure 1 figure 1 table 2 appendix (p 4) Figure 1 Kaplan–Meier survival curves for overall survival (A) and recurrence-free survival (B) in all patients by treatment group and for overall survival (C) and recurrence-free survival (D) by molecular group Analyses by molecular group (both treatment groups combined) were added post-hoc. HR=hazard ratio. MMRd=mismatch repair deficient. NSMP=no specific molecular profile. p53abn=p53 abnormal. POLE POLE Table 2 Multivariable analysis of prognostic factors for overall survival and recurrence-free survival Patients (n) Overall survival Recurrence-free survival HR (95% CI) * p value HR (95% CI) * p value Treatment group Radiotherapy 201 1 (ref) .. .. .. Chemoradiotherapy 210 0·72 (0·50–1·04) 0·079 0·64 (0·45–0·91) 0·013 Age <60 years 178 1 (ref) .. .. .. 60–69 years 169 2·31 (1·43–3·74) <0·0001 1·54 (1·01–2·35) 0·045 ≥70 years 64 2·78 (1·54–5·00) <0·0001 1·69 (0·99–2·90) 0·055 Stage I–II 233 1 (ref) .. .. .. III 178 2·45 (1·64–3·65) <0·0001 2·52 (1·71–3·72) <0·0001 Histology and grade Endometroid grade 1–2 161 1 (ref) .. .. .. Endometroid grade 3 132 1·44 (0·84–2·46) 0·19 1·05 (0·63–1·76) 0·84 Serous or clear cell 118 1·10 (0·60–2·02) 0·76 0·95 (0·53–1·71) 0·87 Lymphovascular space invasion (any) Absent 155 1 (ref) .. .. .. Present 256 1·47 (1·01–2·36) 0·071 1·55 (1·05–2·30) 0·029 Molecular class MMRd 139 1 (ref) POLE 51 0·070 (0·010–0·54) 0·0090 0·072 (0·01–0·53) 0·0090 P53abn 99 2·29 (1·46–3·99) <0·0001 2·83 (1·71–4·68) <0·0001 NSMP 122 0·69 (0·39–1·16) 0·16 1·12 (0·70–1·80) 0·63 Analyses by molecular group were added post-hoc. HR=hazard ratio. MMRd=mismatch repair-deficient. NSMP=no specific molecular profile. p53abn=p53 abnormal. POLE POLE * Adjusted for the following stratification factors: participating group and lymphadenectomy. Table 3 vs vs Table 3 Recurrence outcomes by treatment group for all study patients Number of events 5-year probability (95% CI) 10-year probability (95% CI) Hazard ratio (95% CI) Log-rank p value * Vaginal (first) Chemoradiotherapy 2 0·3% (0·04–2·1) 0·6% (0·2–2·5) 2·00 (0·18–22·02) 0·57 Radiotherapy 1 0·3% (0·04–2·1) 0·3% (0·04–2·1) 1 (ref) .. Pelvic (first) Chemoradiotherapy 3 0·9% (0·3–2·8) 0·9% (0·3–2·8) 0·60 (0·14–2·50) 0·48 Radiotherapy 5 0·9% (0·3–2·8) 1·6% (0·7–3·7) 1 (ref) .. Distant (first) Chemoradiotherapy 86 22·2% (18·1–27·1) 25·7% (21·3–30·8) 0·80 (0·60–1·07) 0·14 Radiotherapy 101 28·9% (24·3–34·1) 30·5% (25·8–35·8) 1 (ref) .. Vaginal (total) Chemoradiotherapy 9 2·1% (1·0–4·4) 2·8% (1·5–5·2) 1·12 (0·43–2·90) 0·81 Radiotherapy 8 2·1% (1·0–4·4) 2·1% (1·02–4·41) 1 (ref) .. Pelvic (total) Chemoradiotherapy 23 6·4% (4·2–9·6) 7·0% (4·7–10·4) 0·61 (0·36–1·02) 0·060 Radiotherapy 37 10·0% (7·2–13·8) 11·3% (8·3–15·3) 1 (ref) .. Distant (total) Chemoradiotherapy 86 22·8% (18·6–27·7) 26·3% (21·9–31·4) 0·81% (0·61–1·08) 0·16 Radiotherapy 101 29·2% (24·6–34·4) 30·8% (26·1–36·1) 1 (ref) .. * Hazard ratio using Fine-Gray regression was unadjusted for stratification factors. Median overall survival after recurrence was 1·4 years (IQR 0·4–4·3): 1·2 years (0·4–8·8) after chemoradiotherapy and 1·4 years (0·7–3·9) after radiotherapy alone (p=0·90). 5-year overall survival after recurrence was 27·7% (95% CI 19·6–39·1) after chemoradiotherapy versus 21·5% (14·0–30·0) after radiotherapy alone. Four patients died within 5 years following recurrence due to intercurrent disease ( figure 2 2 appendix (pp 5–6 Figure 2 Events and survival by treatment group for all patients Seven patients died due to other causes after recurrence (four after radiotherapy alone and three after chemoradiotherapy); these patients are included in the death after recurrence group. Further preplanned analyses showed that for women with stage III disease (n=295), 10-year overall survival was 69·5% (95% CI 62·4–77·4) with chemoradiotherapy versus 56·1% (48·3–65·3) with radiotherapy alone (adjusted HR 0·66 [95% CI 0·45–0·97], p=0·033), and 10-year recurrence-free survival was 67·0% (58·3–74·2) versus 55·5% (46·5–63·5; adjusted HR 0·65 [95% CI 0·45–0·93], p=0·020; appendix p 7 appendix pp 7–8 appendix (p 8) In the post-hoc analyses by molecular class (n=411 patients in the total population; n=210 in the chemoradiotherapy group and n=201 in the radiotherapy group), 10-year overall survival was 45·1% (95% CI 36·2–56·1) for patients in the p53abn subgroup, 98·0% (94·3–100·0) for those in the POLE log-rank figure 1 POLE log-rank figure 1 10-year overall survival with chemoradiotherapy versus radiotherapy alone per molecular subgroup was 52·7% (95% CI 40·8–68·1) versus 36·6% (25·0–53·7) for p53abn cancers (adjusted HR 0·52 [95% CI 0·30–0·91], p=0·021); 100·0% (100·0–100·0) versus 96·4% (89·8–100·0) for POLE log-rank figure 3 POLE log-rank figure 3 Figure 3 Kaplan–Meier survival curves for overall survival and failure-free survival among patients with p53abn (A–B), POLE MMRd=mismatch repair deficient. NSMP=no specific molecular profile. p53abn=p53 abnormal. POLE POLE There was no evidence of a difference in treatment effect size across disease stages among patients with p53abn cancers ( appendix pp 9–10 log-rank log-rank appendix pp 11–12 log-rank log-rank appendix p 11 appendix p 11 appendix pp 11–12 appendix (p 12) Discussion This long-term analysis of the PORTEC-3 trial with 10-year outcomes supports previous findings 1 2 20 To our knowledge, this is the first study with a 10-year follow-up of a randomised trial for high-risk endometrial cancer. The 10-year overall and recurrence-free survival deviate minimally from the previous published 5-year results. 2 7 The excellent vaginal and pelvic nodal control achieved with external beam radiotherapy was still evident in both groups in this long-term follow-up. This finding is similar to results obtained in both the GOG-258 21 22 In line with the previous PORTEC-3 analyses, 7 13 In our post-hoc analysis by molecular group, p53abn cancers had a poor prognosis overall and a benefit from chemoradiotherapy. Subgroup sample sizes were too small to test for treatment effect modification by subgroup. Serous histology and p53abn molecular class were correlated, but they were not interchangeable: 74% of the serous cancers were p53abn and 48% of the p53abn cancers had serous histology. These percentages are similar to those found in a previous study on TP53 23 In the previous molecular analysis of PORTEC-3, 7 13 14 15 Most recurrences at distant sites occurred within the first 3 years. 2 2 24 A limitation of our study was that, even with long-term follow-up, the predefined threshold of 198 overall survival events was not fully reached, with 189 deaths in the analysis. Longer follow-up resulted in more intercurrent deaths. Although this analysis was a predefined translational research analysis, power calculations were not done for the specific molecular subgroup analyses, and the sample sizes were too small to enable interaction testing. However, the characteristics of the 62% of cases with molecular characterisation were similar to those of the overall trial population. 7 9 9 Molecular classification has a crucial role in current diagnosis, prognostication, and decision making regarding adjuvant therapy, particularly for patients with high-risk endometrial cancer, for whom intensive treatments are involved. Treatment effect should be balanced against toxicities because acute severe adverse events and impaired health-related quality of life occur more frequently during treatment with chemotherapy compared with radiotherapy alone (45% vs 16 vs vs 20 Our results emphasise the value of identifying the p53abn status of tumours compared with evaluating serous histology alone. Patients with p53abn cancers had the poorest outcomes, highlighting the need for new treatments. Treatment intensification with PARP inhibition is being investigated in the RAINBO-P53-Red trial. 25 26 27 All stage III NSMP and MMRd endometrial cancers are classified as high-risk disease, and chemoradiotherapy is recommended. 9 7 11 28 29 30 31 NCT05255653 NCT05201547 NCT04214067 Patients with high-risk NSMP ER-negative tumours might benefit from the addition of chemotherapy to adjuvant radiotherapy. However, the proportion of ER-negative cases among NSMP cancers is small. Patients with stage III NSMP ER-positive tumours might benefit less from chemotherapy than previously anticipated—chemotherapy likely postpones or reduces recurrence events, but no overall survival benefit was observed. Additional adjuvant hormonal therapy could represent a more promising treatment approach for these patients, an option currently being investigated in the RAINBO-NSMP-Orange trial ( NCT05255653 POLE NCT03469674 NCT05640999 In conclusion, PORTEC-3 was a multicentre trial conducted through strong international collaboration, making it highly representative of current practice. This long-term analysis shows improved 10-year overall survival and recurrence-free survival for patients with high-risk endometrial cancer treated with chemoradiotherapy versus radiotherapy alone, with most clinically relevant benefit from chemoradiotherapy suggested for p53abn cancers. Contributors Data sharing De-identified participant data will be made available on request to the corresponding author, senior author, or one of the international members of the TransPORTEC-consortium when analyses of all primary and secondary endpoints, including the translational research studies related to the trial, have been published, following the evaluation of a specific research proposal and completion of a data transfer agreement. Declaration of interests SMdB reports grants from Varian and payment for lectures from the European School of Oncology, paid to their institution. CC declares payment or honoraria for educational events by MSD, GSK, Eisai, and Merck and institutional support for research from Roche and TherAguix. HWN declares grants from the Dutch Cancer Society. RAN declares research grants from Elekta, Varian, Accuray, Sensius, and Senewald and payment for lectures from Elekta, GSK, and MSD paid to their institution. DP reports consulting fees from AstraZeneca, GSK, Eisai, Merck, and AbbVie. ALC reports payments for lectures from Diaceutics and AstraZeneca. AL reports grants for research projects from AstraZeneca, Zentalis, and Owkin; consulting fees from Owkin, AstraZeneca, MSD, GSK, AbbVie, Immunogen, Pharm&, Genmab, Zentalis, and Daiichi Sankyo; and payment for educational events from GSK, AbbVie, AstraZeneca, and Ose Immunotherapeutics. CLC reports grants from the Dutch Cancer Society during the conduct of the study. All other authors declare no competing interests. References 1 de Boer SM Powell ME Mileshkin L the PORTEC study group Adjuvant chemoradiotherapy versus radiotherapy alone for women with high-risk endometrial cancer (PORTEC-3): final results of an international, open-label, multicentre, randomised, phase 3 trial Lancet Oncol 19 2018 295 309 29449189 10.1016/S1470-2045(18)30079-2 PMC5840256 2 de Boer SM Powell ME Mileshkin L the PORTEC Study Group Adjuvant chemoradiotherapy versus radiotherapy alone in women with high-risk endometrial cancer (PORTEC-3): patterns of recurrence and post-hoc survival analysis of a randomised phase 3 trial Lancet Oncol 20 2019 1273 1285 31345626 10.1016/S1470-2045(19)30395-X PMC6722042 3 Kandoth C Schultz N Cherniack AD the Cancer Genome Atlas Research Network Integrated genomic characterization of endometrial carcinoma Nature 497 2013 67 73 23636398 10.1038/nature12113 PMC3704730 4 Talhouk A McConechy MK Leung S Confirmation of ProMisE: a simple, genomics-based clinical classifier for endometrial cancer Cancer 123 2017 802 813 28061006 10.1002/cncr.30496 5 Talhouk A McConechy MK Leung S A clinically applicable molecular-based classification for endometrial cancers Br J Cancer 113 2015 299 310 26172027 10.1038/bjc.2015.190 PMC4506381 6 Stelloo E Nout RA Osse EM Improved risk assessment by integrating molecular and clinicopathological factors in early-stage endometria cancer-combined analysis of the PORTEC cohorts Clin Cancer Res 22 2016 4215 4224 27006490 10.1158/1078-0432.CCR-15-2878 7 León-Castillo A de Boer SM Powell ME the TransPORTEC consortium Molecular classification of the PORTEC-3 trial for high-risk endometrial cancer: impact on prognosis and benefit from adjuvant therapy J Clin Oncol 38 2020 3388 3397 32749941 10.1200/JCO.20.00549 PMC7527156 8 Herrington CS WHO Classification of Tumours Editorial Board WHO classification of tumours female genital tumours 5th edn. 2020 International Agency for Research on Cancer 9 Concin N Matias-Guiu X Cibula D ESGO-ESTRO-ESP guidelines for the management of patients with endometrial carcinoma: update 2025 Lancet Oncol 26 2025 e423 e435 40744042 10.1016/S1470-2045(25)00167-6 10 Oaknin A Bosse TJ Creutzberg CL the ESMO Guidelines Committee Endometrial cancer: ESMO Clinical Practice Guideline for diagnosis, treatment and follow-up Ann Oncol 33 2022 860 877 35690222 10.1016/j.annonc.2022.05.009 11 Jamieson A Huvila J Leung S Molecular subtype stratified outcomes according to adjuvant therapy in endometrial cancer Gynecol Oncol 170 2023 282 289 36753816 10.1016/j.ygyno.2023.01.025 12 Jumaah AS Al-Haddad HS McAllister KA Yasseen AA The clinicopathology and survival characteristics of patients with POLE proofreading mutations in endometrial carcinoma: a systematic review and meta-analysis PLoS One 17 2022 e0263585 10.1371/journal.pone.0263585 PMC8827442 35139130 13 Vermij L Jobsen JJ León-Castillo A the TransPORTEC Consortium Prognostic refinement of NSMP high-risk endometrial cancers using oestrogen receptor immunohistochemistry Br J Cancer 128 2023 1360 1368 36690721 10.1038/s41416-023-02141-0 PMC10050005 14 Jamieson A Huvila J Chiu D Grade and estrogen receptor expression identify a subset of no specific molecular profile endometrial carcinomas at a very low risk of disease-specific death Mod Pathol 36 2023 100085 10.1016/j.modpat.2022.100085 36788084 15 Aro K Pasanen A Bützow R Loukovaara M The impact of estrogen receptor and L1 cell adhesion molecule expression on endometrial cancer outcome correlates with clinicopathological risk group and molecular subgroup Gynecol Oncol 189 2024 9 15 38972089 10.1016/j.ygyno.2024.06.016 16 de Boer SM Powell ME Mileshkin L Toxicity and quality of life after adjuvant chemoradiotherapy versus radiotherapy alone for women with high-risk endometrial cancer (PORTEC-3): an open-label, multicentre, randomised, phase 3 trial Lancet Oncol 17 2016 1114 1126 27397040 10.1016/S1470-2045(16)30120-6 17 Kahan BC Morris TP Reporting and analysis of trials using stratified randomisation in leading medical journals: review and reanalysis BMJ 345 2012 e5840 10.1136/bmj.e5840 PMC3444136 22983531 18 Kahan BC Morris TP Improper analysis of trials randomised using stratified blocks or minimisation Stat Med 31 2012 328 340 22139891 10.1002/sim.4431 19 Vermij L Smit V Nout R Bosse T Incorporation of molecular characteristics into endometrial cancer management Histopathology 76 2020 52 63 31846532 10.1111/his.14015 PMC6972558 20 Post CCB de Boer SM Powell ME Long-term toxicity and health-related quality of life after adjuvant chemoradiation therapy or radiation therapy alone for high-risk endometrial cancer in the randomized PORTEC-3 Trial Int J Radiat Oncol Biol Phys 109 2021 975 986 33129910 10.1016/j.ijrobp.2020.10.030 21 Matei D Filiaci V Randall ME Adjuvant chemotherapy plus radiation for locally advanced endometrial cancer N Engl J Med 380 2019 2317 2326 31189035 10.1056/NEJMoa1813181 PMC6948006 22 Randall ME Filiaci V McMeekin DS Phase III trial: adjuvant pelvic radiation therapy versus vaginal brachytherapy plus paclitaxel/carboplatin in high-intermediate and high-risk early stage endometrial cancer J Clin Oncol 37 2019 1810 1818 30995174 10.1200/JCO.18.01575 PMC6804858 23 Momeni-Boroujeni A Dahoud W Vanderbilt CM Clinicopathologic and genomic analysis of TP53 Clin Cancer Res 27 2021 2613 2623 33602681 10.1158/1078-0432.CCR-20-4436 PMC8530276 24 Zola P Ciccone G Piovano E the TOTEM Collaborative Group Effectiveness of intensive versus minimalist follow-up regimen on survival in patients with endometrial cancer (TOTEM study): a randomized, pragmatic, parallel group, multicenter trial J Clin Oncol 40 2022 3817 3827 35858170 10.1200/JCO.22.00471 25 Consortium RR the RAINBO Research Consortium Refining adjuvant treatment in endometrial cancer based on molecular features: the RAINBO clinical trial program Int J Gynecol Cancer 33 2023 109 117 36600534 10.1136/ijgc-2022-004039 PMC9811074 26 Vermij L Horeweg N Leon-Castillo A HER2 status in high-risk endometrial cancers (PORTEC-3): relationship with histotype, molecular classification, and clinical outcomes Cancers 13 2020 44 33375706 10.3390/cancers13010044 PMC7795222 27 van Dijk D Vermij L León-Castillo A Clinical and molecular characteristics of high-risk, recurrent, or metastatic endometrial cancer that is human epidermal growth factor receptor 2-low J Clin Oncol 43 2025 443 452 39374474 10.1200/JCO.23.02768 28 Eskander RN Sill MW Beffa L Pembrolizumab plus chemotherapy in advanced endometrial cancer N Engl J Med 388 2023 2159 2170 36972022 10.1056/NEJMoa2302312 PMC10351614 29 Mirza MR Chase DM Slomovitz BM the RUBY Investigators Dostarlimab for primary advanced or recurrent endometrial cancer N Engl J Med 388 2023 2145 2158 36972026 10.1056/NEJMoa2216334 30 Van Gorp T Cibula D Lv W ENGOT-en11/GOG-3053/KEYNOTE-B21: randomised, double-blind, phase 3 study of pembrolizumab or placebo plus adjuvant chemotherapy with or without radiotherapy in patients with newly diagnosed, high-risk endometrial cancer Ann Oncol 35 2024 968 980 39284383 10.1016/j.annonc.2024.08.2242 31 Slomovitz BM Cibula DLW Ortaç F Pembrolizumab or placebo plus adjuvant chemotherapy with or without radiotherapy for newly diagnosed, high-risk endometrial cancer: results in mismatch repair-deficient tumors J Clin Oncol 43 2024 251 259 39411812 10.1200/JCO-24-01887 PMC11771356 Supplementary Material  Supplementary appendix Acknowledgments The PORTEC-3 study was supported by a grant from the Dutch Cancer Society (UL2006–4168/CKTO 2006–04). PORTEC-3 was supported in the UK by Cancer Research UK (C7925/A8659). Participation in the PORTEC-3 trial by the Australia and New Zealand Gynaecologic Oncology Group (ANZGOG) and Trans-Tasman Radiation Oncology Group was supported by the Australian National Health and Medical Research Council (project grant 570894 [2008]) and by a Cancer Australia grant (awarded through the 2011 round of the priority-driven Collaborative Cancer Research Scheme and funded by Cancer Australia). Participation by the Mario Negri Gynecologic Oncology group (MaNGO) group was partly supported by a grant from the Italian Medicines Agency (FARM84BCX2). Canadian participation in the PORTEC-3 trial was supported by the Canadian Cancer Society Research Institute (grants #015469 and #021039). We thank all the participating groups: the Dutch Gynaecological Oncology Group (Netherlands), National Cancer Research Institute (UK), ANZGOG (Australia and New Zealand), MaNGO (Italy), Fedegyn (France), and the Canadian Cancer Trials Group (Canada), as well as their coordinating teams, principal investigators, staff, and clinical research and pathology teams at the group's participating centres for all their work. We also thank the women who participated in the trial. The PORTEC-3 trial involved a strong international collaboration within the Gynaecological Oncology InterGroup (GCIG), and the support of the GCIG officers and member groups is gratefully acknowledged. We also thank the members of the data safety monitoring board for their invaluable work and guidance throughout the duration of the trial. CLC was the chief investigator of the trial. MEP, PBO, IMJ-S, HCK, HWN, RAN, HP, and CLC were involved in conception and study design. CCBP, SMdB, MEP, LM, DK, PB, ALe, ALi, PBO, MM, PK, RD, AFe, AFy, CC, HCK, VD, AL, DP, CG, HWN, KW, IMJ-S, AF, LCHWL, JB, ALC, RAN, HP, TB, and CLC were involved in the collection and assembly of the data. CCBP, SMdB, JB, HP, and CLC were responsible for data analysis and interpretation and had access to and verified all the data reported in the study; all other authors had access upon request. CCBP, SMdB, and CLC were responsible for the preparation and writing of the manuscript. All authors contributed to the manuscript and approved the final version. ",
  "metadata": {
    "Title of this paper": "Pembrolizumab or placebo plus adjuvant chemotherapy with or without radiotherapy for newly diagnosed, high-risk endometrial cancer: results in mismatch repair-deficient tumors",
    "Journal it was published in:": "The Lancet. Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479390/"
  }
}