{
  "title": "Paper_59",
  "abstract": "pmc Genome Med Genome Med 863 genmed Genome Medicine 1756-994X BMC PMC12490039 PMC12490039.1 12490039 12490039 41039608 10.1186/s13073-025-01541-6 1541 1 Research Identification of a PRDM1-regulated T cell network to regulate atherosclerotic plaque inflammation Jin Han 1 2 Maas Sanne L. 3 4 5 Zou Yuchi 2 Lu Chang 2 Yu Baixue 2 Huchzermeier Rosanna 3 4 5 Nadeau Samantha 6 Dos Santos Jessica 6 Gijbels Marion 2 7 Mees Barend M. E. 8 Smirnov Evgueni 9 Matic Ljubica 10 Hedin Ulf 10 Maffia Pasquale 11 12 13 Monaco Claudia 14 Sluimer Judith C. 2 15 Martins Gislâine A. 6 16 van der Vorst Emiel P. C. evandervorst@ukaachen.de 3 4 5 17 Biessen Erik A. L. erik.biessen@mumc.nl 2 4 1 https://ror.org/003sav965 grid.412645.0 0000 0004 1757 9434 Central Laboratory, Tianjin Medical University General Hospital, 2 https://ror.org/02d9ce178 grid.412966.e 0000 0004 0480 1382 Department of Pathology, Cardiovascular Research Institute Maastricht (CARIM), Maastricht UMC+, 3 https://ror.org/02gm5zw39 grid.412301.5 0000 0000 8653 1507 Department of Internal Medicine I, University Hospital Aachen, RWTH Aachen University, 4 https://ror.org/02gm5zw39 grid.412301.5 0000 0000 8653 1507 Institute for Molecular Cardiovascular Research (IMCAR), Uniklinik RWTH Aachen, RWTH Aachen University, 5 https://ror.org/02gm5zw39 grid.412301.5 0000 0000 8653 1507 Aachen-Maastricht Institute for Cardio-Renal Disease (AMICARE), Uniklinik RWTH Aachen, RWTH Aachen University, 6 https://ror.org/046rm7j60 grid.19006.3e 0000 0000 9632 6718 Departments of Medicine and Biomedical Sciences, David Geffen School of Medicine, Research Division of Immunology Cedars-Sinai Medical Center, University of California, 7 https://ror.org/04dkp9463 grid.7177.6 0000000084992262 Department of Medical Biochemistry, Amsterdam Cardiovascular Sciences: Atherosclerosis & Ischemic Syndrome; Amsterdam Infection and Immunity: Inflammatory diseases; Amsterdam UMC location University of Amsterdam, 8 9 https://ror.org/02jz4aj89 grid.5012.6 0000 0001 0481 6099 Department of Data Science and Knowledge Engineering, Maastricht University, 10 https://ror.org/056d84691 grid.4714.6 0000 0004 1937 0626 Division of Vascular Surgery, Department of Molecular Medicine and Surgery, Karolinska Institutet and Karolinska University Hospital, 11 https://ror.org/00vtgdb53 grid.8756.c 0000 0001 2193 314X School of Infection & Immunity, College of Medical, Veterinary and Life Sciences, University of Glasgow, 12 https://ror.org/05290cv24 grid.4691.a 0000 0001 0790 385X Department of Pharmacy, School of Medicine and Surgery, University of Naples Federico II, 13 14 https://ror.org/052gg0110 grid.4991.5 0000 0004 1936 8948 Nuffield Department of Orthopaedics, Rheumatology and Musculoskeletal Sciences, Kennedy Institute of Rheumatology, University of Oxford, 15 https://ror.org/01nrxwf90 grid.4305.2 0000 0004 1936 7988 Centre for Cardiovascular Science, University of Edinburgh, 16 https://ror.org/02pammg90 grid.50956.3f 0000 0001 2152 9905 Inflammatory Bowel and Immunobiology Research Institute, Cedars-Sinai Medical Center, 17 https://ror.org/05591te55 grid.5252.0 0000 0004 1936 973X Institute for Cardiovascular Prevention (IPEK), Ludwig-Maximilians-University Munich, 2 10 2025 2025 17 479236 109 4 3 2025 27 8 2025 02 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background Inflammation is a key driver of atherosclerosis, yet the mechanisms sustaining inflammation in human plaques remain poorly understood. This study uses a network-based approach to identify immune gene programs involved in the transition from low- to high-risk (rupture-prone) human atherosclerotic plaques. Methods Expression data from human carotid artery plaques, both stable (low-risk, n n Results Our analysis revealed a distinct gene module with a prominent T cell signature, particularly in unstable plaques. Key regulatory factors, RUNX3, IRF7 and in particular PRDM1, were significantly downregulated in plaque T cells from symptomatic versus asymptomatic patients, indicating a protective role. Additionally, as PRDM1 is downstream of IRF7, we opted for PRDM1 as a key target. T cell-specific Prdm1 Ldlr Conclusions This study highlights a PRDM1-regulated T cell network that distinguishes high-risk from low-risk plaques and demonstrates the regulatory role of T cell PRDM1 in controlling atherosclerosis, positioning this pathway as a promising therapeutic target. Supplementary Information The online version contains supplementary material available at 10.1186/s13073-025-01541-6. Keywords Carotid endarterectomy T cell Microarray Single-cell sequencing Atherosclerosis PRDM1 Tianjin Municipal Education Commission Scientific Research Plan Project 2023KJ107 https://doi.org/10.13039/501100004543 China Scholarship Council 201609120004 202308500067 201706990018 202106100042 https://doi.org/10.13039/501100004359 Vetenskapsrådet 2019-02027, 2023-02724 https://doi.org/10.13039/501100003793 Hjärt-Lungfonden 20241083, 20240094, 20210466, 20200621, 20200520, 20180244, 20180247, 201602877 https://doi.org/10.13039/501100003748 Svenska Sällskapet för Medicinsk Forskning P13-0171 https://doi.org/10.13039/501100000274 British Heart Foundation PG/21/10541, PG/21/10634, PG/21/10557 and PG/24/11946 https://doi.org/10.13039/501100003407 Ministero dell’Istruzione, dell’Università e della Ricerca 2022T45AXH https://doi.org/10.13039/501100002996 Hartstichting 2016T060 https://doi.org/10.13039/501100001674 Fondation Leducq 15CVD04 https://doi.org/10.13039/501100002347 Bundesministerium für Bildung und Forschung https://doi.org/10.13039/501100003390 Fritz Thyssen Stiftung 10.20.2.043MN https://doi.org/10.13039/501100003246 Nederlandse Organisatie voor Wetenschappelijk Onderzoek 91619053 0.16.186.364 https://doi.org/10.13039/501100020407 European Research Area Network on Cardiovascular Diseases JTC‐2017t100 AtheroMacHete Universitätsklinikum RWTH Aachen (8915) Open Access funding enabled and organized by Projekt DEAL. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Atherosclerosis is characterized by the intimal accumulation of lipoproteins, debris, and immune cells in medium-large sized arteries [ 1 2 4 5 7 The use of high-throughput technologies like microarray and RNA sequencing (RNA-seq) has significantly advanced our understanding of key processes driving plaque progression and destabilization [ 8 9 10 12 13 14 Although scRNA-seq studies have been invaluable in identifying potential drug targets and biomarkers, they often fail to capture the full complexity of atherosclerotic plaque tissue. To overcome this limitation, we applied an unbiased computational approach to investigate the changes occurring across the entire plaque as it transitions from a stable (low-risk) to an unstable plaque (high-risk, rupture-prone) state. Using global gene expression profiles from symptomatic carotid artery lesions in the Maastricht Human Plaque Study (MaasHPS) cohort ( n 15 18 Methods A list of materials can be found in Additional file 1: Materials. Datasets The microarray data used in this study is derived from analyses of a previously published dataset by our laboratory, namely the MaasHPS [ 18 1 15 17 Human sample collection Morphometry Sample preparation Microarray data collection Microarray data pre-processing 1 Table 1 Description of datasets used in this study Human plaque dataset Sample size Study design Analyses GEO accession References MaasHPS microarray 43 Stable ( n Unstable ( n Differential expression; WGCNA; Bayesian network; Regulatory network GSE163154 [ 15 18 BiKE microarray 137 Atherosclerotic tissue ( n Non-atherosclerotic artery tissue ( n Differential expression GSE21545 [ 8 19 21 Decoding the transcriptome of calcified atherosclerotic plaque at single-cell resolution 6 Atherosclerotic core ( n Proximal adjacent portion ( n Differential expression GSE159677 [ 22 23 Single-cell immune landscape of human atherosclerotic plaques 6 Symptomatic ( n Asymptomatic ( n Differential expression GSE224273 [ 13 24 25 Human sample collection Atherosclerotic plaque samples obtained during carotid endarterectomy (CEA) from 24 symptomatic patients (all male, age = 72.84 ± 6.47, mean ± SD; SD, standard deviation) were collected in the Maastricht Pathology Tissue Collection (MPTC). For detailed information on the patient cohort definition, see Additional file 2: Table S1-1. The CEA specimens were cut into parallel transverse segments of 5-mm thickness. Each alternating segment was snap-frozen in liquid nitrogen and stored at − 80 °C, the flanking segments were fixed in formalin and processed for histological evaluation (Fig. 1 Plaque tissue segments were stratified into low-risk and high-risk groups. High-risk plaques are more prone to rupture or erosion, events that can trigger acute cardiovascular complications such as myocardial infarction or stroke. In this study, plaques are classified as stable (SP) or unstable plaques (UP) based on histopathological plaque staging by two expert pathologists, according to the well-established Virmani classification scheme adapted from the American Heart Association [ 26 n n n 18 15 17 Morphometry Morphometric analysis was performed on CEA sections that were stained with H&E. Slides were photographed at × 12.5 magnification and examined digitally using Leica Q500MC software. Total tissue, media, fibrous cap, necrotic core, hemorrhage, and luminal thrombus area were measured. Plaque size was calculated by subtracting the medial and luminal thrombus area from that of the total carotid tissue. One stable segement was excluded due to a inconsistent plaque score assessment by the observers ( n = 1 + + 2 + + 2 + + 2 + + 2 + + + + + 2 + + + 2 + + 2 Sample preparation Snap-frozen omics segments were pulverized and 5 to 20 mg of material was subjected to microarray analysis. RNA was isolated by guanidium thiocyanate extraction, followed by further purification using the Nucleospin RNA II kit (Macherey–Nagel GmbH & Co. KG). RNA concentrations were measured using a Nanodrop ND-1000 spectrophotometer (Nanodrop Technologies, Wilmington, DE, U.S.A). RNA quality and integrity were determined with the Agilent 2100 Bioanalyzer (Agilent Technologies, Inc., Santa Clara, CA, U.S.A.). Four stable plaque segments were excluded because of the low RNA quality (RNA Integrity Number (RIN) < 6.0 and A260/280 ratio lower than 1.8; n n 15 Microarray data collection Biotinylated cRNA was prepared using the Illumina TotalPrep RNA Amplification Kit (Ambion, Inc., Austin, TX, U.S.A.) according to the manufacturer’s specifications starting with 100 ng total RNA. Per sample 750 ng of cRNA was used for hybridization. Hybridization and washing were performed according to the Illumina standard assay procedure. Scanning was performed on the Illumina BeadStation 500 (Illumina, Inc., San Diego, CA, U.S.A.), while image analysis and extraction of raw expression data were done using Illumina Beadstudio v3 Gene Expression software with default settings, no background subtraction, and no normalization. Transcripts were measured by Illumina HumanRef-8 v2.0 expression BeadChip. Microarray data pre-processing A total of 22,184 human transcripts and variants, as defined by RefSeqs (NCBI) sequences, were analyzed using the R Bioconductor lumi [ 27 28 Gene co-expression analysis Weighted Gene Co-expression Network Analysis (WGCNA) [ 29 n n For the unstable plaque WGCNA clusters, we calculated the eigengene as the first principal component of the cluster and measured the cluster’s overall gene expression. Afterward, these eigengenes were used in the following correlation analysis, the Bayesian network construction, and the visualization of the hierarchical tree dendrogram of unstable plaque WGCNA clusters. Differential expression analysis As described in our previous study [ 15 30 p Gene set overrepresentation and enrichment analysis Gene set overrepresentation analysis (GSOA) was performed for relevant co-expression gene clusters using the R package clusterProfiler (v3.12.0) [ 31 p 32 p To assess if a co-expression cluster was significantly upregulated in unstable plaque condition, gene set enrichment analysis (GSEA) was performed for unstable plaque WGCNA co-expression clusters against the 13,641 pre-processed genes sorted by log2 fold change, using the R package clusterProfiler (v3.12.0) [ 31 Bayesian network analysis using the unstable plaque WGCNA eigengenes Bayesian network inference was performed on the eigengenes of unstable plaque WGCNA, to infer causal relationships between the biological processes derived from GSOA on unstable plaque WGCNA clusters. For clarity, only clusters with CES > 3 (i.e., adjusted p 33 34 35 Gene regulatory network reconstruction Gene expression-based regulatory network (GRN) reconstruction was performed by GEne Network Inference with Ensemble of trees (GENIE3), a machine learning tree-based variable selection method [ 36 37 38 36 39 Motif-based TF prediction was performed by iRegulon (v1.3) [ 40 41 Visualization of WGCNA and GRN Unstable plaque WGCNA network and GRN for the T cell-specific cluster were visualized by Cytoscape (v3.8.0) [ 41 42 43 Single-cell RNA sequencing analysis of human carotid plaques Two scRNA-seq datasets of human carotid plaques ( GSE159677 GSE224273 13 22 25 n = 3 n n For both datasets, raw fastq files were downloaded from GEO using sra-tools (v3.1.1) and were subsequently processed using Cell Ranger (v8.0.0) based on the reference genome (version GRCh38-2024-A) downloaded from the 10 × website. One sample in GSE224273 Both two datasets were analyzed in a similar manner by the R package Seurat (v5.1.0) [ 44 45 GSE159677 GSE224273 46 GSE159677 GSE224273 GSE159677 p BiKE The relevance of our regulatory hub PR Domain Zinc Finger Protein 1 (PRDM1) for human atherosclerotic cardiovascular disease (ASCVD) was analyzed in the Biobank of Karolinska Endarterectomies (BIKE) cohort of CEA-derived carotid tissue ( n = 127 21 8 19 20 n = 10 Mouse experiments Bone marrow cells (1 × 10 6 Prdm1 −/− CD4- Cre /Prdm1 flox/flox Prdm1 Prdm1 flox/flox 47 Ldlr − / ) Histology and immunofluorescent stainings Atherosclerotic lesion size was assessed in the aortic root and aortic arches. In brief, hearts were embedded in Tissue-Tek O.C.T. compound (Sakura) for cryosectioning of the aortic root. The plaques of the aortic roots were quantified in 5-µm transverse sections stained with H&E. The average plaque size was calculated from three sections. Valves of the aortic root were examined independently and classified as early progressive (pathologic intimal thickening, PIT), advanced with a thick fibrotic cap (TkF), or advanced with a thin fibrotic cap (TnF) as described before (Additional file 5: Fig S1) [ 48 49 Flow cytometry Whole blood from T cell-specific Prdm1 −/− + − high + + + high + + + low + − low + + − low − + + + + − low − + + + + + − low − + + + + + + − low − + + + Plasma lipid levels Cholesterol and triglyceride levels were analyzed using mouse plasma, isolated from the EDTA-buffered blood. Levels were quantified using enzymatic assays (c.f.a.s. cobas, Roche Diagnostics) according to the manufacturer’s protocol. In short, triglyceride levels were measured in undiluted samples, while cholesterol levels were measured in samples that were diluted 1:5. A standard series of cholesterol and triglycerides was created, after which standards and samples were analyzed in Duplicates. Absorbance was measured at 510 nm with a Tecan Infinite F200 Pro Plate Reader (Tecan Life Sciences Home). Drug repurposing on T cell cluster We performed drug screening and repurposing on the T cell-specific cluster from unstable plaque WGCNA (UP-32). Drug screening was achieved with the use of Library of Integrated Network-Based Cellular Signatures (LINCS) L1000, a database containing genome-wide transcriptional profiles from a broad collection of human cultured cells after perturbation by FDA-approved drugs or small molecules [ 50 50 Statistical analysis Cluster-trait, gene-trait, and gene-cluster correlations were measured by Pearson’s correlation coefficients with p t p p p p Study approval The collection of CEA specimens was in line with the Dutch Code for Proper Secondary use of Human Tissue ( https://www.federa.org Results Identification of key co-expression clusters in unstable plaques This study focused on analyzing unstable plaques due to their strong association with an increased risk of cardiovascular events. WGCNA was applied to microarray gene expression profiles from human carotid endarterectomy (CEA) plaques, resulting in the construction of an unstable plaque-specific co-expression network (for research strategy see Fig. 1 Fig. 1 Schematic workflow. The carotid artery specimen were sliced into 5 mm thick parallel sections, snap-frozen in liquid nitrogen, and stored for future use. Every second section was used for histology, stained with Hematoxylin and Eosin, and classified based on the absence/presence of IPH and classification criteria adapted from the American Heart Association (AHA) scheme [ 26 Prdm1 A total of thirty-eight co-expression clusters (UP-1 to UP-38) were identified in the unstable plaques (Additional file 5: Fig S2a). To pinpoint the most biologically relevant clusters within the global network, the top ten co-expression clusters with the highest significance (CES, defined as the absolute log10-transformed adjusted p 2 2 Fig. 2 WGCNA of unstable and stable plaques identifies key gene co-expression clusters. a b c a d p e To assess whether the network modules were also operational in stable plaques, we constructed a co-expression network for these plaques as well, revealing 25 clusters (SP-1 to SP-25) (Additional file 5: Fig S2b). The top 10 biologically significant clusters are shown in Fig. 2 32 2 2 Subsequent GSEA was performed using gene expression changes in unstable plaques relative to stable plaques to assess whether genes from a cluster were significantly upregulated in the unstable condition. This analysis revealed a significant overall upregulation of gene members of three of the four unstable plaque clusters that were functionally matched to stable plaque clusters (i.e., UP-11, UP-22 and UP-32; Fig. 2 T cell cluster emerging as an important driver in plaque phenotype transition To examine changes occurring during the transition from stable to unstable plaques, we analyzed the biologically relevant unstable plaque networks in detail. The network genes were found to be both highly interconnected and clustered, as shown in the network visualization and t-SNE plots (Fig. 3 2 3 Fig. 3 Analyses of the unstable plaque WGCNA co-expression network. a b n n n c d e To explore the hierarchy and direction of the interactions between clusters within the gene network, a Bayesian network model was constructed for the 15 most biologically meaningful unstable plaque clusters (CES > 3) (Fig. 3 3 + + 3 2 3 Collectively, the above findings indicate that the “T cell,” “IFN,” and “angiogenesis” clusters form a tightly interconnected network in unstable plaques. Moreover, Bayesian network analysis further identified the “T cell” cluster as the key driver in plaque destabilization, upstream of clusters like “IFN” and “angiogenesis,” leading to the selection of the “T cell” cluster for further study. The regulation of the T cell-specific cluster We next examined the expression of gene members of UP-32, the “T cell” cluster, using an independent human carotid plaque scRNA-seq dataset from a comparative paired analysis of atherosclerotic core and proximally adjacent region of three asymptomatic patients with type VII calcified plaques ( GSE159677 22 4 4 4 + + + + 4 CCL5 GZMA NKG7 CST7 GZMK GZMM PYHIN1 KLRG1 CTSW GZMB KLRD1 PRF1 + 51 53 GSE224273 13 24 25 + + Fig. 4 UP-32 gene co-expression cluster is enriched in plaque T cells ( GSE159677 a n GSE159677 b a c n GSE159677 GSE159677 GSE159677 Co-expression of cluster genes suggests a shared regulatory framework. To explore this, we constructed GRNs using GENIE3 [ 36 37 5 40 5 + + 5 Fig. 5 Regulatory network reconstruction for UP-32 T cell-specific cluster. a b c d n e PRDM1 RUNX3 IRF7 + + GSE159677 f PRDM1 RUNX3 GSE159677 g PRDM1 n n h PRDM1 RUNX3 IRF7 + + GSE224273 i PRDM1 RUNX3 GSE224273 j PRDM1 GSE159677 k GSE159677 GSE224273 P Among the selected TFs, IRF7, PRDM1, and RUNX3 were highly upregulated in unstable versus stable plaques. Three other TFs (STAT1, EOMES, and MYB) were only moderately upregulated in unstable plaques. We then constructed an integrated gene regulatory network for UP-32, the “T cell” cluster, incorporating the nine top TFs (Fig. 5 Our bulk microarray dataset lacks the resolution to conclusively differentiate between cell populations and their gene expression profiles. To overcome this limitation, we examined the expression of the most dysregulated TFs (PRDM1, RUNX3, and IRF7) using scRNA-seq datasets from Alsaigh et al. ( GSE159677 GSE224273 13 22 25 n 22 IRF7 RUNX3 PRDM1 5 RUNX3 PRDM1 PRDM1 2 p RUNX3 2 p 5 21 PRDM1 n n 5 13 24 RUNX3 PRDM1 5 RUNX3 PRDM1 PRDM1 p RUNX3 p 5 IRF7 PRDM1 + 5 PRDM1 5 The regulatory role of T cell Prdm1 Our network analysis identified PRDM1, RUNX3, and IRF7 as key regulators of a T cell network in unstable human atherosclerotic plaques. To further validate their role in lesion development, we turned to a mouse model of atherosclerosis. Given that IRF7 was not specific for plaque T cells in two datasets (Fig. 5 54 55 PRDM1 5 Ldlr – / CD4 Cre /Prdm1 flox/flox Prdm1 −/− Prdm1 flox/flox Prdm1 + / Cre Prdm1 47 56 Prdm1 6 Prdm1 −/− Ldlr −/− Prdm1 +/+ Ldlr −/− 6 6 Prdm1 6 + + + + Prdm1 −/− 6 Prdm1 −/− Prdm1 +/+ Prdm1 Fig. 6 T cell-specific Prdm1 a–c b c Prdm1 + / Ldlr –/– Prdm1 −/− Ldlr –/– d e f–h f g h i–m i, j + k + l + − − − + + m n t P P In silico drug repurposing based on the unstable plaque T cell cluster While the findings above identify the PRDM1-driven T cell cluster as a key driver of plaque progression, the poor druggability of PRDM1 and broader activity in NK and B cells disqualify PRDM1 as a viable therapeutic target. Therefore, we sought to identify drugs that are capable of targeting and deactivating this T cell network. To this end, we pursued in silico drug screening, using the LINCS L1000 dataset, which contains drug-induced gene expression profiles from the JURKAT T cell line. We screened for compounds whose transcriptional signatures inversely correlate with the dysregulation of the complete T cell cluster (UP-32) seen in unstable versus stable plaque. Connectivity scores close to + 1 indicate similar profiles, while scores near − 1 Suggest opposite profiles, reflecting the ability to Suppress activation of the network of interest. A total of 57 drugs with negative connectivity scores of < − 0.7 were considered potentially effective (Additional file 9: Table S7). Notably, among the top-ranked candidates were two epidermal growth factor receptor (EGFR) signaling blockers, which exhibited very high connectivity scores of approximately − 0.9, along with four antagonists targeting other growth factor receptor pathways (vascular endothelial growth factors (VEGFRs) and platelet-derived growth factor receptors (PDGFRs)) (Table 2 17 Table 2 Selected drugs targeting the UP-32 T cell cluster Score Drug Dose Effect −0,914 Dacomitinib 10.0 µM EGFR inhibitor −0,898 Osimertinib 10.0 µM EGFR inhibitor, induces cell death and inhibits tumor growth in EGFR-overexpressing tumor cells −0,863 Pazopanib 3.33 µM Inhibitor of VEGFR1, VEGFR2, PDGFRα, PDGFRβ, KIT, FGFR3, ITK, FGF1, SH2B3, antineoplastic −0,821 Quizartinib 0.04 µM FLT3 and PDGFRs inhibitor, inhibits leukemic cell proliferation and apoptosis −0,794 Tivozanib 10.0 µM Inhibitor of VEGFRs 1, 2, and 3 with potential antiangiogenic and antineoplastic activities −0,737 Sunitinib 0.12 µM Inhibitor of multiple receptor tyrosine kinases including all VEGFRs and PDGFRs, inhibits angiogenesis and cell proliferation Discussion Network-based analyses of high-throughput gene expression data have become essential for unraveling biological processes and regulatory mechanisms underlying human disease. Moreover, these approaches facilitate the translation of molecular discoveries into clinical applications [ 57 18 Prdm1 While traditional transcriptional studies often focus on differential gene expression followed by pathway enrichment, we adopted a network-centric approach to capture complex inter-gene interactions and co-regulated pathways relevant to plaque destabilization. By constructing a Bayesian network, we identified the directionality and interplay between co-expressed gene clusters and their associated biological processes, allowing us to distinguish upstream from downstream events. This approach improves candidate prioritization and is broadly applicable to any gene expression dataset containing multiple study arms. Our WGCNA and Bayesian network analysis revealed that T cell activity is a key modulator of IFN (types I and II) signaling and angiogenesis within unstable plaques, consistent with previous reports showing increased T cell content in advanced atherosclerotic plaques [ 58 + 59 58 60 61 13 24 62 + + 13 + + + + + Further exploration of the gene signature of the “T cell” module, UP-32 cluster, through GRN analysis identified PRDM1, RUNX3, IRF7, and EOMES, and to a lesser extent MYB and IRF4 as key TFs. PRDM1, EOMES, and IRF7 are critical for effector and memory CD8 + 63 64 + 65 66 54 67 + + Previous research highlights the dual role of T cells in atherosclerosis, where certain subsets, particularly CD8 + 67 68 69 Prdm1 70 73 + Ldlr −/− 73 However, this study has some limitations that should be considered. The MaasHPS cohort consists of symptomatic male patients, which may restrict broader applicability [ 18 13 24 Conclusion In conclusion, we identified a T cell-driven gene network linked to plaque destabilization, modulating IFN and angiogenesis signaling, and is mainly orchestrated by PRDM1. This network offers a promising therapeutic target for atherosclerosis intervention. While PRDM1 is poorly druggable, our study identifies EGFR inhibitors as potential candidate drugs able to target this key network in a coordinate manner, and suppressing culprit immune and angiogenic pathways in atherosclerotic plaque destabilization. Supplementary Information  Additional file 1: Materials. Additional file 2: Table S1-1. Patient information MaasHPS dataset. Table S1-2. Patient information BiKE dataset. Additional file 3: Table S2-1. GSOA of WGCNA clusters (SP). Table S2-2. GSOA of WGCNA clusters (UP). Additional file 4: Table S3-1. GSEA of WGCNA clusters (UP). Table S3-2. GSEA of WGCNA clusters (UP; differential expression of GSEA core genes). Additional file 5: Fig S1-S7 - Fig S1. Plaque stage classification. Representative image of the classification of the plaques stage in the aortic root: I - early progressive (pathologic intimal thickening, PIT); II - advanced with a thick fibrotic cap (TkF); III - advanced with a thin fibrotic cap (TnF). Scale bar = 500 µm. Fig S2. Additional results of unstable plaque WGCNA co-expression network. (a-b) Hierarchical clustering based on the eigengenes of unstable plaque WGCNA clusters (a) and stable plaque WGCNA clusters (b), shown as dendrograms. Fig S3. Comparison between stable and unstable WGCNA clusters. (a) For the top 10 stable co-expression clusters, the significance levels of the top-ranked overrepresented GO terms per cluster were visualized as a dot plot. (b) Venn diagrams showing gene overlap between selected stable and unstable clusters. (c) Heatmap shows Jaccard Index between all stable and unstable clusters. The number in square brackets indicates the size of the cluster. Four pairs of stable and unstable clusters highlighted are selected for the Venn Diagram visualization in (b). Significance level in (b-c) was evaluated by hypergeometric testing. Fig S4. Heatmaps of the unstable WGCNA clusters. Heatmaps showing the expression of genes in UP-32, UP-22, and UP-11 between unstable and stable plaques. For clarity sake, only core enrichment genes contributed to GSEA are shown. Fig S5. Relative cluster adjacency in stable plaques. Bar plot depicting the relative average adjacency of the UP-11 cluster, UP-22 cluster, and remaining clusters (“rest”) to the T cell-specific cluster (UP-32) based on the WGCNA adjacency matrix of the stable plaque network. The average adjacency between UP-32 and all other clusters was normalized to 1 and used as the reference. Fig S6. UP-32 gene co-expression cluster is enriched in plaque T cells (GSE224273). (a) UMAP plot shows carotid plaque cells from asymptomatic (n = 2) and symptomatic patients (n = 4) in GSE224273 dataset. (b) Dot plot shows the markers of each cell type in (a). (c) UMAP plot shows the enrichment of the UP-32 T cell-specific cluster (UP-32; n = 250) in cells from GSE224273 dataset. (d) Violin plot shows the enrichment of the UP-32 T cell-specific cluster in plaque cells from GSE224273 dataset. EC– endothelial cell, NK – natural killer, SMC – smooth muscle cell. Fig S7. Expression of PRDM1, RUNX3 and IRF7 in plaque scRNA-seq datasets. (a) UMAP plots show cells from the atherosclerotic core (AC) and proximal adjacent (PA) tissues in GSE159677 dataset and (b) cells from the asymptomatic and symptomatic patients in GSE224273 dataset. (c-d) UMAP plots show the expression of PRDM1, RUNX3, and IRF7 in GSE159677 dataset (c) and GSE224273 dataset (d). Additional file 6: Table S4-1. Gene overlap between SP and UP clusters, evaluated by Jaccard Index. Table S4-2. Gene overlap between SP and UP clusters, evaluated by hypergeometric testing. Additional file 7: Table S5. Frequency of T cells in the inguinal lymph node, spleen and bone marrow of mice fed with HFD for 12 weeks. Additional file 8: Table S6. Cholesterol and triglycerides levels and body weight of mice fed with HFD for 12 weeks. Additional file 9: Table S7. Drug repurposing results based on the gene expression in the T cell cluster UP-32. Abbreviations AC Atherosclerotic core Adj Adjusted ADT Antibody-Derived Tag ADT/HTO Antibody-Derived Tag/Hashtag Oligonucleotide AHA American Heart Association ARACNe Algorithm for the Reconstruction of Accurate Cellular Networks Arg Arginine BiKE Biobank of Karolinska Endarterectomies CCD Charge-coupled device CD Cluster of Differentiation CEA Carotid endarterectomy CES Cluster Enrichment Score CITE-seq Cellular Indexing of Transcriptomes and Epitopes by Sequencing CTL Cytotoxic T cell DAPI 4',6-Diamidino-2-Phenylindole DC Dendritic cell EC Endothelial cell ECM Extracellular matrix ECs Endothelial cells EDTA Ethylenediaminetetraacetic acid EGFR Epidermal growth factor receptor ERAD Endoplasmic reticulum–associated protein degradation FACS Fluorescence-activated cell sorting FC Fold change GENIE3 Gene Network Inference with Ensemble of Trees GO Gene ontology GRN Gene regulatory network GSE Gene Expression Omnibus Series GSEA Gene set enrichment analysis GSOA Gene set overrepresentation analysis H&E Hematoxylin–eosin HGNC HUGO Gene Nomenclature Committee HTO Hashtag oligonucleotide IFN Interferon IG Immunoglobulin IHC Immunohistochemistry iNOS Nitric oxide synthases IPH Intraplaque hemorrhage Ldlr -/- Low-density lipoprotein receptor knockout mouse LINCS L1000 Library of Integrated Network-Based Cellular Signatures M1-like Macrophage Classically Activated Macrophage (iNOS Positive) M2-like Macrophage Alternatively Activated Macrophage (Arg1 Positive) MaasHPS Maastricht Human Plaque Study Mac2 Macrophage Antigen-2 Macro Macrophage Mono Monocyte MPTC Maastricht Pathology Tissue Collection mRNA Messenger ribonucleic acid NCBI National Center for Biotechnology Information ncRNA Non-coding ribonucleic acid NK Natural killer PA Proximal adjacent PBS Phosphate-buffered saline PDGFR Platelet-derived growth factor receptor Prdm1 PR Domain Zinc Finger Protein 1 RIN RNA Integrity Number RNA-seq RNA sequencing RSN Robust spline normalization scRNA-seq Single-cell RNA sequencing SD Standard deviation SEM Standard error of the mean SMC Smooth muscle cell SP Stable plaques Tem Effector memory T cell TF Transcription factor Th T helper cell TkF Thick fibrotic cap Tmem Memory T cell TnF Thin fibrotic cap TOM Topological overlap matrix TR T cell receptor αSMA + SMCs Alpha-Smooth Muscle Actin Positive Smooth Muscle Cells Treg Regulatory T cell Trm Resident memory T cell VEGFR Vascular endothelial growth factor receptor t-SNE T-Distributed Stochastic Neighbor Embedding UMAP Uniform manifold approximation and projection UP Unstable plaques VSMCs Vascular smooth muscle cells WGCNA Weighted Gene Co-expression Network Analysis WTD Western-type diet Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Han Jin and Sanne L. Maas have shared authorships. Acknowledgements We thank Herbert Plasschaert, Veronica Herías and Kim van Kuijk from Maastricht UMC+ for their assistance in analyzing plaque morphology, and Wouter Eijgelaar and Timo Rademakers from Maastricht UMC+ for their help in data analysis. Furthermore, we thank Mat Daemen from Amsterdam UMC for coordinating the plaque cohort sampling and transcriptomics analysis. We would also like to thank Janneke E. Bouma, Sai Sahana Sundararaman, Linsey J. F. Peters, Sumra Nazir and Andrea Bonnin Marquez for their invaluable help with the in vivo experiments, and Jan Nagenborg and Olivia Waring for their assistance with immunostaining. This work was supported by the Flow Cytometry Facility, a core facility of the Interdisciplinary Center for Clinical Research (IZKF) Aachen within the Faculty of Medicine at RWTH Aachen University and by the German Research Foundation (DFG). Marco Manca is thanked for his guidance in the application of WGCNA at start of the study. Authors’ contributions H.J. conceived the study, processed the data, performed the computational analyses and drafted the manuscript. S.M. performed mouse study and wrote the manuscript under the supervision of E.P.C.V. H.J. and S.L.M. finalized the manuscript with input from all co-authors. Since H.J. was the main researcher on this project, he was listed in the first position of the shared first authorships. B.M.E.M. performed the CEA surgery. Y.Z. analyzed the scRNA-seq datasets. B.Y. performed in vivo experiments. R.H., S.N., M.G., L.M., P.M., C.M. and G.A.M. supported with key experiments and/or provides crucial materials and expertise. Plaque classification and supervision of H.J. was performed by J.C.S. C.L. and E.S. gave input in the data analysis strategies. E.P.C.V, J.C.S. offered critical revision. E.A.L.B. initiated, conceived, and supervised the study, provided funding, and offered critical feedback at all stages. As the initiator of the study, the shared senior authors agreed to list E.A.L.B. in the last author position. All authors reviewed and provided feedback on previous versions of the manuscript and approved the final version. Funding Open Access funding enabled and organized by Projekt DEAL. This work has been supported by the Tianjin Municipal Education Commission Scientific Research Plan Project (No. 2023KJ107) to Han Jin, the China Scholarship Council (CSC, Grant No. 201609120004) to Han Jin, (CSC, Grant No. 202308500067) to Yuchi Zou, (CSC, Grant No. 201706990018) to Chang Lu, (CSC, Grant No. 202106100042) to Baixue Yu, the Swedish Research Council (VR, 2019-02027, 2023-02724), Swedish Heart-Lung Foundation (HLF, 20241083, 20240094, 20210466, 20200621, 20200520, 20180244, 20180247, 201602877), Swedish Society for Medical Research (SSMF, P13-0171) to Ljubica Matic, the British Heart Foundation grants (PG/21/10541, PG/21/10634, PG/21/10557 and PG/24/11946) and the Italian Ministry of University and Research (MUR) PRIN 2022 (2022T45AXH) to Pasquale Maffia, the European Research Area Network on Cardiovascular Diseases (ERA‐CVD and Dutch Heart Foundation, Grant No. JTC‐2017t100 AtheroMacHete) to Erik A.L. Biessen, the Dutch Heart Foundation (Grant No. 2016T060), the Dutch research council (NWO) VIDI fellowship (Grant No. 0.16.186.364), and a Leducq transatlantic network grant (Grant No. 15CVD04) to Judith C. Sluimer, a grant from the Interdisciplinary Center for Clinical Research within the faculty of Medicine at the RWTH Aachen University, the DZHK (German Centre for Cardiovascular Research) and the BMBF (German Ministry of Education and Research), NWO-ZonMw Veni (91619053), and the Fritz Thyssen Stiftung (Grant No. 10.20.2.043MN) to Emiel P.C. van der Vorst. Data availability MaasHPS transcriptomics can be accessed from the Gene Expression Omnibus (GEO) with accession number GSE163154 18 GSE21545 21 GSE159677 23 GSE224273 25 74 75 Declarations Ethics approval and consent to participate All patient materials collected for the MaasHPS dataset ( GSE163154 18 https://www.federa.org All BiKE human samples ( GSE21545 21 Three patients with severe carotid plaque requiring carotid endarterectomy were identified and consented in collaboration with the Scripps Health Biorepository, under IRB# 19-7332 approved by the Scripps Institutional Review Board. Informed consent was obtained for all collected samples, which were used for the scRNA-seq dataset ( GSE159677 23 Patients undergoing carotid endarterectomy at Mount Sinai Hospital were enrolled in an ongoing clinical study approved by the Institutional Review Board of the Icahn School of Medicine at Mount Sinai, under IRB# 11–01427. Written informed consent was obtained from all eligible participants. Exclusion criteria included current infection, autoimmune disease, active or recurrent cancer, severe renal failure requiring dialysis, or peripheral arterial occlusive disease causing pain at rest. Samples were collected from each patient and used to generate the scRNA-seq dataset ( GSE224273 25 All mouse experiments were approved by the regulatory authority of the Maastricht University Medical Centre (permit number: 2018-011-008) and local German regulatory authorities (Landesamt für Natur, Umwelt und Verbraucherschutz Nordrhein-Westfalen, Germany, approval number 81-02.04.2019.A363). The experiments complied with the Dutch governmental guidelines and Directive 2010/63/EU of the European Parliament on the protection of animals used for scientific purposes and the German animal protection law. Furthermore, the study was conducted in compliance with the ARRIVE guidelines. Every effort was made to minimize suffering. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Libby P Ridker PM Hansson GK Progress and challenges in translating the biology of atherosclerosis Nature 2011 473 7347 317 325 10.1038/nature10146 21593864 Libby P, Ridker PM, Hansson GK. Progress and challenges in translating the biology of atherosclerosis. Nature. 2011;473(7347):317–25. 21593864 10.1038/nature10146 2. Shah PK Mechanisms of plaque vulnerability and rupture J Am Coll Cardiol 2003 41 4, Supplement S15 22 10.1016/S0735-1097(02)02834-6 12644336 Shah PK. Mechanisms of plaque vulnerability and rupture. J Am Coll Cardiol. 2003;41(4, Supplement):S15-22. 10.1016/s0735-1097(02)02834-6 12644336 3. Bentzon JF Otsuka F Virmani R Falk E Mechanisms of plaque formation and rupture Circ Res 2014 114 12 1852 1866 10.1161/CIRCRESAHA.114.302721 24902970 Bentzon JF, Otsuka F, Virmani R, Falk E. Mechanisms of plaque formation and rupture. Circ Res. 2014;114(12):1852–66. 24902970 10.1161/CIRCRESAHA.114.302721 4. Tabas I Lichtman AH Monocyte-macrophages and T cells in atherosclerosis Immunity 2017 47 4 621 634 10.1016/j.immuni.2017.09.008 29045897 PMC5747297 Tabas I, Lichtman AH. Monocyte-macrophages and T cells in atherosclerosis. Immunity. 2017;47(4):621–34. 29045897 10.1016/j.immuni.2017.09.008 PMC5747297 5. Ridker PM Everett BM Thuren T MacFadyen JG Chang WH Ballantyne C Fonseca F Nicolau J Koenig W Anker SD Antiinflammatory therapy with canakinumab for atherosclerotic disease N Engl J Med 2017 377 12 1119 1131 10.1056/NEJMoa1707914 28845751 Ridker PM, Everett BM, Thuren T, MacFadyen JG, Chang WH, Ballantyne C, et al. Antiinflammatory therapy with canakinumab for atherosclerotic disease. N Engl J Med. 2017;377(12):1119–31. 28845751 10.1056/NEJMoa1707914 6. Nidorf SM Eikelboom JW Budgeon CA Thompson PL Low-dose colchicine for secondary prevention of cardiovascular disease J Am Coll Cardiol 2013 61 4 404 410 10.1016/j.jacc.2012.10.027 23265346 Nidorf SM, Eikelboom JW, Budgeon CA, Thompson PL. Low-dose colchicine for secondary prevention of cardiovascular disease. J Am Coll Cardiol. 2013;61(4):404–10. 23265346 10.1016/j.jacc.2012.10.027 7. Nidorf SM Fiolet ATL Mosterd A Eikelboom JW Schut A Opstal TSJ The SHK Xu X-F Ireland MA Lenderink T Colchicine in patients with chronic coronary disease N Engl J Med 2020 383 19 1838 1847 10.1056/NEJMoa2021372 32865380 Nidorf SM, Fiolet ATL, Mosterd A, Eikelboom JW, Schut A, Opstal TSJ, et al. Colchicine in patients with chronic coronary disease. N Engl J Med. 2020;383(19):1838–47. 32865380 10.1056/NEJMoa2021372 8. Perisic L Aldi S Sun Y Folkersen L Razuvaev A Roy J Lengquist M Åkesson S Wheelock CE Maegdefessel L Gene expression signatures, pathways and networks in carotid atherosclerosis J Intern Med 2016 279 3 293 308 10.1111/joim.12448 26620734 Perisic L, Aldi S, Sun Y, Folkersen L, Razuvaev A, Roy J, et al. Gene expression signatures, pathways and networks in carotid atherosclerosis. J Intern Med. 2016;279(3):293–308. 26620734 10.1111/joim.12448 9. Verhoeven BAN, Velema E, Schoneveld AH, Vries JPPMd, de Bruin P, Seldenrijk CA, Kleijn DPVd, Busser E, der Graaf Yv, Mol F et al. Athero-express: differential atherosclerotic plaque expression of mRNA and protein in relation to cardiovascular events and patient characteristics. Rationale and design. Eur J Epidemiol. 2004;19(12):1127–1133. 10.1007/s10564-004-2304-6 15678794 10. Winkels H Ehinger E Vassallo M Buscher K Dinh HQ Kobiyama K Atlas of the immune cell repertoire in mouse atherosclerosis defined by single-cell RNA-sequencing and mass cytometry Circ Res 2018 122 12 1675 88 10.1161/CIRCRESAHA.117.312513 29545366 PMC5993603 Winkels H, Ehinger E, Vassallo M, Buscher K, Dinh HQ, Kobiyama K, et al. Atlas of the immune cell repertoire in mouse atherosclerosis defined by single-cell RNA-sequencing and mass cytometry. Circ Res. 2018;122(12):1675–88. 29545366 10.1161/CIRCRESAHA.117.312513 PMC5993603 11. Cochain C Vafadarnejad E Arampatzi P Pelisek J Winkels H Ley K Single-cell RNA-seq reveals the transcriptional landscape and heterogeneity of aortic macrophages in murine atherosclerosis Circ Res 2018 122 12 1661 74 10.1161/CIRCRESAHA.117.312509 29545365 Cochain C, Vafadarnejad E, Arampatzi P, Pelisek J, Winkels H, Ley K, et al. Single-cell RNA-seq reveals the transcriptional landscape and heterogeneity of aortic macrophages in murine atherosclerosis. Circ Res. 2018;122(12):1661–74. 29545365 10.1161/CIRCRESAHA.117.312509 12. Wirka RC Wagh D Paik DT Pjanic M Nguyen T Miller CL Kundu R Nagao M Coller J Koyano TK Atheroprotective roles of smooth muscle cell phenotypic modulation and the TCF21 disease gene as revealed by single-cell analysis Nat Med 2019 25 8 1280 1289 10.1038/s41591-019-0512-5 31359001 PMC7274198 Wirka RC, Wagh D, Paik DT, Pjanic M, Nguyen T, Miller CL, et al. Atheroprotective roles of smooth muscle cell phenotypic modulation and the TCF21 disease gene as revealed by single-cell analysis. Nat Med. 2019;25(8):1280–9. 31359001 10.1038/s41591-019-0512-5 PMC7274198 13. Fernandez DM Rahman AH Fernandez NF Chudnovskiy A Amir E-aD Amadori L Khan NS Wong CK Shamailova R Hill CA Single-cell immune landscape of human atherosclerotic plaques Nat Med 2019 25 10 1576 1588 10.1038/s41591-019-0590-4 31591603 PMC7318784 Fernandez DM, Rahman AH, Fernandez NF, Chudnovskiy A, Amir E-aD, Amadori L, et al. Single-cell immune landscape of human atherosclerotic plaques. Nat Med. 2019;25(10):1576–88. 31591603 10.1038/s41591-019-0590-4 PMC7318784 14. Browaeys R Saelens W Saeys Y Nichenet: modeling intercellular communication by linking ligands to target genes Nat Methods 2020 17 2 159 162 10.1038/s41592-019-0667-5 31819264 Browaeys R, Saelens W, Saeys Y. Nichenet: modeling intercellular communication by linking ligands to target genes. Nat Methods. 2020;17(2):159–62. 31819264 10.1038/s41592-019-0667-5 15. Jin H Goossens P Juhasz P Eijgelaar W Manca M Karel JMH Integrative multiomics analysis of human atherosclerosis reveals a serum response factor-driven network associated with intraplaque hemorrhage Clin Transl Med 2021 11 6 e458 10.1002/ctm2.458 34185408 PMC8236116 Jin H, Goossens P, Juhasz P, Eijgelaar W, Manca M, Karel JMH, et al. Integrative multiomics analysis of human atherosclerosis reveals a serum response factor-driven network associated with intraplaque hemorrhage. Clin Transl Med. 2021;11(6):e458. 34185408 10.1002/ctm2.458 PMC8236116 16. Jin H Zhang C Nagenborg J Juhasz P Ruder AV Sikkink CJJM Mees BME Waring O Sluimer JC Neumann D Genome-scale metabolic network of human carotid plaque reveals the pivotal role of glutamine/glutamate metabolism in macrophage modulating plaque inflammation and vulnerability Cardiovasc Diabetol 2024 23 1 240 10.1186/s12933-024-02339-3 38978031 PMC11232311 Jin H, Zhang C, Nagenborg J, Juhasz P, Ruder AV, Sikkink CJJM, et al. Genome-scale metabolic network of human carotid plaque reveals the pivotal role of glutamine/glutamate metabolism in macrophage modulating plaque inflammation and vulnerability. Cardiovasc Diabetol. 2024;23(1):240. 38978031 10.1186/s12933-024-02339-3 PMC11232311 17. Jin H Mees BME Biessen EAL Sluimer JC Transcriptional sex dimorphism in human atherosclerosis relates to plaque type Circ Res 2021 129 12 1175 1177 10.1161/CIRCRESAHA.121.320099 34661425 Jin H, Mees BME, Biessen EAL, Sluimer JC. Transcriptional sex dimorphism in human atherosclerosis relates to plaque type. Circ Res. 2021;129(12):1175–7. 34661425 10.1161/CIRCRESAHA.121.320099 18. Jin H, Biessen EAL. Maastricht Human Plaque Study (MaasHPS). https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE163154 19. Waden K Hultgren R Kotopouli MI Gillgren P Roy J Hedin U Long term mortality rate in patients treated with carotid endarterectomy Eur J Vasc Endovasc Surg 2023 65 6 778 86 10.1016/j.ejvs.2023.02.079 36871924 Waden K, Hultgren R, Kotopouli MI, Gillgren P, Roy J, Hedin U, et al. Long term mortality rate in patients treated with carotid endarterectomy. Eur J Vasc Endovasc Surg. 2023;65(6):778–86. 36871924 10.1016/j.ejvs.2023.02.079 20. Matic LP Jesus Iglesias M Vesterlund M Lengquist M Hong MG Saieed S Sanchez-Rivera L Berg M Razuvaev A Kronqvist M Novel multiomics profiling of human carotid atherosclerotic plaques and plasma reveals Biliverdin Reductase B as a marker of intraplaque hemorrhage JACC Basic Transl Sci 2018 3 4 464 480 10.1016/j.jacbts.2018.04.001 30175270 PMC6115646 Matic LP, Jesus Iglesias M, Vesterlund M, Lengquist M, Hong MG, Saieed S, et al. Novel multiomics profiling of human carotid atherosclerotic plaques and plasma reveals Biliverdin Reductase B as a marker of intraplaque hemorrhage. JACC Basic Transl Sci. 2018;3(4):464–80. 30175270 10.1016/j.jacbts.2018.04.001 PMC6115646 21. Folkersen L, Persson J, Ekstrand J, Agardh H, Hansson G, Gabrielsen A, Hedin U, Paulsson-Berne G: Biobank of Karolinska Endarterectomy (BiKE). https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE21545 22. Alsaigh T Evans D Frankel D Torkamani A Decoding the transcriptome of calcified atherosclerotic plaque at single-cell resolution Commun Biol 2022 5 1 1084 10.1038/s42003-022-04056-7 36224302 PMC9556750 Alsaigh T, Evans D, Frankel D, Torkamani A. Decoding the transcriptome of calcified atherosclerotic plaque at single-cell resolution. Commun Biol. 2022;5(1):1084. 36224302 10.1038/s42003-022-04056-7 PMC9556750 23. Alsaigh T, Evans D, Frankel D, Torkamani A. Decoding the transcriptome of calcified atherosclerotic plaque at single-cell resolution. https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE159677 10.1038/s42003-022-04056-7 PMC9556750 36224302 24. Eberhardt N Noval MG Kaur R Amadori L Gildea M Sajja S Das D Cilhoroz B Stewart OJ Fernandez DM SARS-CoV-2 infection triggers pro-atherogenic inflammatory responses in human coronary vessels Nat Cardiovasc Res 2023 2 10 899 916 10.1038/s44161-023-00336-5 38076343 PMC10702930 Eberhardt N, Noval MG, Kaur R, Amadori L, Gildea M, Sajja S, et al. SARS-CoV-2 infection triggers pro-atherogenic inflammatory responses in human coronary vessels. Nat Cardiovasc Res. 2023;2(10):899–916. 38076343 10.1038/s44161-023-00336-5 PMC10702930 25. Giannarelli C. Single-cell immune landscape of human atherosclerotic plaques. https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE224273 26. Yahagi K Kolodgie FD Otsuka F Finn AV Davis HR Joner M Virmani R Pathophysiology of native coronary, vein graft, and in-stent atherosclerosis Nat Rev Cardiol 2016 13 2 79 98 10.1038/nrcardio.2015.164 26503410 Yahagi K, Kolodgie FD, Otsuka F, Finn AV, Davis HR, Joner M, et al. Pathophysiology of native coronary, vein graft, and in-stent atherosclerosis. Nat Rev Cardiol. 2016;13(2):79–98. 26503410 10.1038/nrcardio.2015.164 27. Du P Kibbe WA Lin SM lumi: a pipeline for processing Illumina microarray Bioinformatics 2008 24 13 1547 1548 10.1093/bioinformatics/btn224 18467348 Du P, Kibbe WA, Lin SM. lumi: a pipeline for processing Illumina microarray. Bioinformatics. 2008;24(13):1547–8. 18467348 10.1093/bioinformatics/btn224 28. Bruford EA Braschi B Denny P Jones TEM Seal RL Tweedie S Guidelines for human gene nomenclature Nat Genet 2020 52 8 754 758 10.1038/s41588-020-0669-3 32747822 PMC7494048 Bruford EA, Braschi B, Denny P, Jones TEM, Seal RL, Tweedie S. Guidelines for human gene nomenclature. Nat Genet. 2020;52(8):754–8. 32747822 10.1038/s41588-020-0669-3 PMC7494048 29. Langfelder P Horvath S WGCNA: an R package for weighted correlation network analysis BMC Bioinformatics 2008 9 1 559 10.1186/1471-2105-9-559 19114008 PMC2631488 Langfelder P, Horvath S. WGCNA: an R package for weighted correlation network analysis. BMC Bioinformatics. 2008;9(1):559. 19114008 10.1186/1471-2105-9-559 PMC2631488 30. Ritchie ME Phipson B Wu D Hu Y Law CW Shi W Limma powers differential expression analyses for RNA-sequencing and microarray studies Nucleic Acids Res 2015 43 7 e47 e47 10.1093/nar/gkv007 25605792 PMC4402510 Ritchie ME, Phipson B, Wu D, Hu Y, Law CW, Shi W, et al. Limma powers differential expression analyses for RNA-sequencing and microarray studies. Nucleic Acids Res. 2015;43(7):e47–e47. 25605792 10.1093/nar/gkv007 PMC4402510 31. Yu G Wang L-G Han Y He Q-Y Clusterprofiler: an R package for comparing biological themes among gene clusters OMICS 2012 16 5 284 287 10.1089/omi.2011.0118 22455463 PMC3339379 Yu G, Wang L-G, Han Y, He Q-Y. Clusterprofiler: an R package for comparing biological themes among gene clusters. OMICS. 2012;16(5):284–7. 22455463 10.1089/omi.2011.0118 PMC3339379 32. Yu G Li F Qin Y Bo X Wu Y Wang S GOsemSim: an R package for measuring semantic similarity among GO terms and gene products Bioinformatics 2010 26 7 976 978 10.1093/bioinformatics/btq064 20179076 Yu G, Li F, Qin Y, Bo X, Wu Y, Wang S. GOsemSim: an R package for measuring semantic similarity among GO terms and gene products. Bioinformatics. 2010;26(7):976–8. 20179076 10.1093/bioinformatics/btq064 33. Agrahari R Foroushani A Docking TR Chang L Duns G Hudoba M Karsan A Zare H Applications of Bayesian network models in predicting types of hematological malignancies Sci Rep 2018 8 1 6951 10.1038/s41598-018-24758-5 29725024 PMC5934387 Agrahari R, Foroushani A, Docking TR, Chang L, Duns G, Hudoba M, et al. Applications of Bayesian network models in predicting types of hematological malignancies. Sci Rep. 2018;8(1):6951. 29725024 10.1038/s41598-018-24758-5 PMC5934387 34. Foroushani A Agrahari R Docking R Chang L Duns G Hudoba M Karsan A Zare H Large-scale gene network analysis reveals the significance of extracellular matrix pathway and homeobox genes in acute myeloid leukemia: an introduction to the Pigengene package and its applications BMC Med Genomics 2017 10 1 16 10.1186/s12920-017-0253-6 28298217 PMC5353782 Foroushani A, Agrahari R, Docking R, Chang L, Duns G, Hudoba M, et al. Large-scale gene network analysis reveals the significance of extracellular matrix pathway and homeobox genes in acute myeloid leukemia: an introduction to the Pigengene package and its applications. BMC Med Genomics. 2017;10(1):16. 28298217 10.1186/s12920-017-0253-6 PMC5353782 35. Scutari M Learning Bayesian networks with the bnlearn R package J Stat Softw 2010 35 3 1 22 10.18637/jss.v035.i03 Scutari M. Learning Bayesian networks with the bnlearn R package. J Stat Softw. 2010;35(3):1–22.21603108 36. Huynh-Thu VA Irrthum A Wehenkel L Geurts P Inferring regulatory networks from expression data using tree-based methods PLoS One 2010 5 9 e12776 10.1371/journal.pone.0012776 20927193 PMC2946910 Huynh-Thu VA, Irrthum A, Wehenkel L, Geurts P. Inferring regulatory networks from expression data using tree-based methods. PLoS One. 2010;5(9):e12776. 20927193 10.1371/journal.pone.0012776 PMC2946910 37. Margolin AA Nemenman I Basso K Wiggins C Stolovitzky G Favera RD Aracne: an algorithm for the reconstruction of gene regulatory networks in a mammalian cellular context BMC Bioinformatics 2006 7 1 S7 10.1186/1471-2105-7-S1-S7 16723010 PMC1810318 Margolin AA, Nemenman I, Basso K, Wiggins C, Stolovitzky G, Favera RD, et al. Aracne: an algorithm for the reconstruction of gene regulatory networks in a mammalian cellular context. BMC Bioinformatics. 2006;7(1):S7. 16723010 10.1186/1471-2105-7-S1-S7 PMC1810318 38. Lambert SA Jolma A Campitelli LF Das PK Yin Y Albu M Chen X Taipale J Hughes TR Weirauch MT The human transcription factors Cell 2018 172 4 650 665 10.1016/j.cell.2018.01.029 29425488 Lambert SA, Jolma A, Campitelli LF, Das PK, Yin Y, Albu M, et al. The human transcription factors. Cell. 2018;172(4):650–65. 29425488 10.1016/j.cell.2018.01.029 39. Meyer PE Lafitte F Bontempi G Minet: a R/Bioconductor package for inferring large transcriptional networks using mutual information BMC Bioinformatics 2008 9 1 461 10.1186/1471-2105-9-461 18959772 PMC2630331 Meyer PE, Lafitte F, Bontempi G. Minet: a R/Bioconductor package for inferring large transcriptional networks using mutual information. BMC Bioinformatics. 2008;9(1):461. 18959772 10.1186/1471-2105-9-461 PMC2630331 40. Janky Rs Verfaillie A Imrichová H Van de Sande B Standaert L Christiaens V Hulselmans G Herten K Naval Sanchez M Potier D Iregulon: from a gene list to a gene regulatory network using large motif and track collections PLoS Comput Biol 2014 10 7 e1003731 10.1371/journal.pcbi.1003731 25058159 PMC4109854 Janky Rs, Verfaillie A, Imrichová H, Van de Sande B, Standaert L, Christiaens V, et al. Iregulon: from a gene list to a gene regulatory network using large motif and track collections. PLoS Comput Biol. 2014;10(7):e1003731. 25058159 10.1371/journal.pcbi.1003731 PMC4109854 41. Shannon P Markiel A Ozier O Baliga NS Wang JT Ramage D Amin N Schwikowski B Ideker T Cytoscape: a software environment for integrated models of biomolecular interaction networks Genome Res 2003 13 11 2498 2504 10.1101/gr.1239303 14597658 PMC403769 Shannon P, Markiel A, Ozier O, Baliga NS, Wang JT, Ramage D, et al. Cytoscape: a software environment for integrated models of biomolecular interaction networks. Genome Res. 2003;13(11):2498–504. 14597658 10.1101/gr.1239303 PMC403769 42. McArdle S, Buscher K, Ehinger E, Pramod AB, Riley N, Ley K. PRESTO, a new tool for integrating large-scale -omics data and discovering disease-specific signatures. bioRxiv. 2018:302604. 43. Bastian M Heymann S Jacomy M Gephi: an open source software for exploring and manipulating networks Proceedings of the International AAAI Conference on Web and Social Media 2009 3 1 361 362 10.1609/icwsm.v3i1.13937 Bastian M, Heymann S, Jacomy M. Gephi: an open source software for exploring and manipulating networks. Proceedings of the International AAAI Conference on Web and Social Media. 2009;3(1):361–2. 44. Hao Y Stuart T Kowalski MH Choudhary S Hoffman P Hartman A Srivastava A Molla G Madad S Fernandez-Granda C Dictionary learning for integrative, multimodal and scalable single-cell analysis Nat Biotechnol 2024 42 2 293 304 10.1038/s41587-023-01767-y 37231261 PMC10928517 Hao Y, Stuart T, Kowalski MH, Choudhary S, Hoffman P, Hartman A, et al. Dictionary learning for integrative, multimodal and scalable single-cell analysis. Nat Biotechnol. 2024;42(2):293–304. 37231261 10.1038/s41587-023-01767-y PMC10928517 45. McGinnis CS Murrow LM Gartner ZJ DoubletFinder: doublet detection in single-cell RNA sequencing data using artificial nearest neighbors Cell Syst 2019 8 4 329 337.e324 10.1016/j.cels.2019.03.003 30954475 PMC6853612 McGinnis CS, Murrow LM, Gartner ZJ. DoubletFinder: doublet detection in single-cell RNA sequencing data using artificial nearest neighbors. Cell Syst. 2019;8(4):329-337.e324. 30954475 10.1016/j.cels.2019.03.003 PMC6853612 46. Korsunsky I Millard N Fan J Slowikowski K Zhang F Wei K Baglaenko Y Brenner M Loh P-r Raychaudhuri S Fast, sensitive and accurate integration of single-cell data with harmony Nat Methods 2019 16 12 1289 1296 10.1038/s41592-019-0619-0 31740819 PMC6884693 Korsunsky I, Millard N, Fan J, Slowikowski K, Zhang F, Wei K, et al. Fast, sensitive and accurate integration of single-cell data with harmony. Nat Methods. 2019;16(12):1289–96. 31740819 10.1038/s41592-019-0619-0 PMC6884693 47. Salehi S Bankoti R Benevides L Willen J Couse M Silva JS B lymphocyte-induced maturation protein-1 contributes to intestinal mucosa homeostasis by limiting the number of IL-17-producing CD4+ T cells J Immunol 2012 189 12 5682 93 10.4049/jimmunol.1201966 23162130 PMC3529138 Salehi S, Bankoti R, Benevides L, Willen J, Couse M, Silva JS, et al. B lymphocyte-induced maturation protein-1 contributes to intestinal mucosa homeostasis by limiting the number of IL-17-producing CD4+ T cells. J Immunol. 2012;189(12):5682–93. 23162130 10.4049/jimmunol.1201966 PMC3529138 48. Kanters E Pasparakis M Gijbels MJ Vergouwe MN Partouns-Hendriks I Fijneman RJ Clausen BE Forster I Kockx MM Rajewsky K Inhibition of NF-kappaB activation in macrophages increases atherosclerosis in LDL receptor-deficient mice J Clin Invest 2003 112 8 1176 1185 10.1172/JCI200318580 14561702 PMC213488 Kanters E, Pasparakis M, Gijbels MJ, Vergouwe MN, Partouns-Hendriks I, Fijneman RJ, et al. Inhibition of NF-kappaB activation in macrophages increases atherosclerosis in LDL receptor-deficient mice. J Clin Invest. 2003;112(8):1176–85. 14561702 10.1172/JCI18580 PMC213488 49. Lutgens E Lievens D Beckers L Wijnands E Soehnlein O Zernecke A Deficient CD40-TRAF6 signaling in leukocytes prevents atherosclerosis by skewing the immune response toward an antiinflammatory profile J Exp Med 2010 207 2 391 404 10.1084/jem.20091293 20100871 PMC2822598 Lutgens E, Lievens D, Beckers L, Wijnands E, Soehnlein O, Zernecke A, et al. Deficient CD40-TRAF6 signaling in leukocytes prevents atherosclerosis by skewing the immune response toward an antiinflammatory profile. J Exp Med. 2010;207(2):391–404. 20100871 10.1084/jem.20091293 PMC2822598 50. Subramanian A, Narayan R, Corsello SM, Peck DD, Natoli TE, Lu X, Gould J, Davis JF, Tubelli AA, Asiedu JK et al. A next generation connectivity map: L1000 Platform and the First 1,000,000 Profiles. Cell 2017;171(6):1437–1452 e1417. 10.1016/j.cell.2017.10.049 PMC5990023 29195078 51. Gupta B Iancu EM Gannon PO Wieckowski S Baitsch L Speiser DE Simultaneous coexpression of memory-related and effector-related genes by individual human CD8 T cells depends on antigen specificity and differentiation J Immunother 2012 35 6 488 501 10.1097/CJI.0b013e31826183a7 22735807 Gupta B, Iancu EM, Gannon PO, Wieckowski S, Baitsch L, Speiser DE, et al. Simultaneous coexpression of memory-related and effector-related genes by individual human CD8 T cells depends on antigen specificity and differentiation. J Immunother. 2012;35(6):488–501. 22735807 10.1097/CJI.0b013e31826183a7 52. Massa D Baran M Bengoechea JA Bowie AG Pyhin1 regulates pro-inflammatory cytokine induction rather than innate immune DNA sensing in airway epithelial cells J Biol Chem 2020 295 14 4438 4450 10.1074/jbc.RA119.011400 32102850 PMC7135979 Massa D, Baran M, Bengoechea JA, Bowie AG. Pyhin1 regulates pro-inflammatory cytokine induction rather than innate immune DNA sensing in airway epithelial cells. J Biol Chem. 2020;295(14):4438–50. 32102850 10.1074/jbc.RA119.011400 PMC7135979 53. Herndler-Brandstetter D Ishigame H Shinnakasu R Plajer V Stecher C Zhao J Lietzenmayer M Kroehling L Takumi A Kometani K KLRG1+ effector CD8+ T cells lose KLRG1, differentiate into all memory T cell lineages, and convey enhanced protective immunity Immunity 2018 48 4 716 729.e718 10.1016/j.immuni.2018.03.015 29625895 PMC6465538 Herndler-Brandstetter D, Ishigame H, Shinnakasu R, Plajer V, Stecher C, Zhao J, Lietzenmayer M, Kroehling L, Takumi A, Kometani K, et al. KLRG1+ effector CD8+ T cells lose KLRG1, differentiate into all memory T cell lineages, and convey enhanced protective immunity. Immunity. 2018;48(4):716-729.e718. 29625895 10.1016/j.immuni.2018.03.015 PMC6465538 54. Senatus L Lopez-Diez R Egana-Gorrono L Liu J Hu J Daffu G RAGE impairs murine diabetic atherosclerosis regression and implicates IRF7 in macrophage inflammation and cholesterol metabolism JCI Insight 2020 10.1172/jci.insight.137289 32641587 PMC7406264 Senatus L, Lopez-Diez R, Egana-Gorrono L, Liu J, Hu J, Daffu G, et al. RAGE impairs murine diabetic atherosclerosis regression and implicates IRF7 in macrophage inflammation and cholesterol metabolism. JCI Insight. 2020. 10.1172/jci.insight.137289. 32641587 10.1172/jci.insight.137289 PMC7406264 55. Wang D Diao H Getzler AJ Rogal W Frederick MA Milner J Yu B Crotty S Goldrath AW Pipkin ME The transcription factor runx3 establishes chromatin accessibility of cis-regulatory landscapes that drive memory cytotoxic T lymphocyte formation Immunity 2018 48 4 659 674.e656 10.1016/j.immuni.2018.03.028 29669249 PMC6750808 Wang D, Diao H, Getzler AJ, Rogal W, Frederick MA, Milner J, Yu B, Crotty S, Goldrath AW, Pipkin ME. The transcription factor runx3 establishes chromatin accessibility of cis-regulatory landscapes that drive memory cytotoxic T lymphocyte formation. Immunity. 2018;48(4):659-674.e656. 29669249 10.1016/j.immuni.2018.03.028 PMC6750808 56. Martins GA Cimmino L Shapiro-Shelef M Szabolcs M Herron A Magnusdottir E Calame K Transcriptional repressor Blimp-1 regulates T cell homeostasis and function Nat Immunol 2006 7 5 457 465 10.1038/ni1320 16565721 Martins GA, Cimmino L, Shapiro-Shelef M, Szabolcs M, Herron A, Magnusdottir E, et al. Transcriptional repressor Blimp-1 regulates T cell homeostasis and function. Nat Immunol. 2006;7(5):457–65. 16565721 10.1038/ni1320 57. Barabási A-L Gulbahce N Loscalzo J Network medicine: a network-based approach to human disease Nat Rev Genet 2011 12 1 56 68 10.1038/nrg2918 21164525 PMC3140052 Barabási A-L, Gulbahce N, Loscalzo J. Network medicine: a network-based approach to human disease. Nat Rev Genet. 2011;12(1):56–68. 21164525 10.1038/nrg2918 PMC3140052 58. van Dijk RA Duinisveld AJF Schaapherder AF Mulder-Stapel A Hamming JF Kuiper J de Boer OJ van der Wal AC Kolodgie FD Virmani R A change in inflammatory footprint precedes plaque instability: a systematic evaluation of cellular aspects of the adaptive immune response in human atherosclerosis J Am Heart Assoc 2015 4 4 e001403 10.1161/JAHA.114.001403 25814626 PMC4579929 van Dijk RA, Duinisveld AJF, Schaapherder AF, Mulder-Stapel A, Hamming JF, Kuiper J, de Boer OJ, van der Wal AC, Kolodgie FD, Virmani R, et al. A change in inflammatory footprint precedes plaque instability: a systematic evaluation of cellular aspects of the adaptive immune response in human atherosclerosis. J Am Heart Assoc. 2015;4(4):e001403. 25814626 10.1161/JAHA.114.001403 PMC4579929 59. Robertson A-KL Hansson GK T cells in atherogenesis Arterioscler Thromb Vasc Biol 2006 26 11 2421 2432 10.1161/01.ATV.0000245830.29764.84 16973967 Robertson A-KL, Hansson GK. T cells in atherogenesis. Arterioscler Thromb Vasc Biol. 2006;26(11):2421–32. 16973967 10.1161/01.ATV.0000245830.29764.84 60. Schäfer S Zernecke A CD8+ T cells in atherosclerosis Cells 2021 10 1 37 10.3390/cells10010037 PMC7823404 33383733 Schäfer S, Zernecke A. CD8+ T cells in atherosclerosis. Cells. 2021;10(1):37. 10.3390/cells10010037 PMC7823404 33383733 61. van Duijn J Kuiper J Slütter B The many faces of CD8+ T cells in atherosclerosis Curr Opin Lipidol 2018 29 5 411 6 10.1097/MOL.0000000000000541 30020198 van Duijn J, Kuiper J, Slütter B. The many faces of CD8+ T cells in atherosclerosis. Curr Opin Lipidol. 2018;29(5):411–6. 30020198 10.1097/MOL.0000000000000541 62. Smit V de Mol J Schaftenaar FH Depuydt MAC Postel RJ Smeets D Single-cell profiling reveals age-associated immunity in atherosclerosis Cardiovasc Res 2023 119 15 2508 21 10.1093/cvr/cvad099 37390467 PMC10676459 Smit V, de Mol J, Schaftenaar FH, Depuydt MAC, Postel RJ, Smeets D, et al. Single-cell profiling reveals age-associated immunity in atherosclerosis. Cardiovasc Res. 2023;119(15):2508–21. 37390467 10.1093/cvr/cvad099 PMC10676459 63. Shimizu K Sato Y Kawamura M Nakazato H Watanabe T Ohara O Fujii S-i Eomes transcription factor is required for the development and differentiation of invariant NKT cells Commun Biol 2019 2 1 150 10.1038/s42003-019-0389-3 31044175 PMC6488575 Shimizu K, Sato Y, Kawamura M, Nakazato H, Watanabe T, Ohara O, Fujii S-i. Eomes transcription factor is required for the development and differentiation of invariant NKT cells. Commun Biol. 2019;2(1):150. 31044175 10.1038/s42003-019-0389-3 PMC6488575 64. Kasmani MY Zander R Chung HK Chen Y Khatun A Damo M Clonal lineage tracing reveals mechanisms skewing CD8+ T cell fate decisions in chronic infection J Exp Med 2023 10.1084/jem.20220679 36315049 PMC9623343 Kasmani MY, Zander R, Chung HK, Chen Y, Khatun A, Damo M, et al. Clonal lineage tracing reveals mechanisms skewing CD8+ T cell fate decisions in chronic infection. J Exp Med. 2023. 10.1084/jem.20220679. 36315049 10.1084/jem.20220679 PMC9623343 65. Su Z Lu H Jiang H Zhu H Li Z Zhang P Ni P Shen H Xu W Xu H IFN-gamma-producing Th17 cells bias by HMGB1-T-bet/RUNX3 axis might contribute to progression of coronary artery atherosclerosis Atherosclerosis 2015 243 2 421 428 10.1016/j.atherosclerosis.2015.09.037 26520896 Su Z, Lu H, Jiang H, Zhu H, Li Z, Zhang P, et al. IFN-gamma-producing Th17 cells bias by HMGB1-T-bet/RUNX3 axis might contribute to progression of coronary artery atherosclerosis. Atherosclerosis. 2015;243(2):421–8. 26520896 10.1016/j.atherosclerosis.2015.09.037 66. Sikorski K Czerwoniec A Bujnicki JM Wesoly J Bluyssen HA STAT1 as a novel therapeutical target in pro-atherogenic signal integration of IFNgamma, TLR4 and IL-6 in vascular disease Cytokine Growth Factor Rev 2011 22 4 211 219 10.1016/j.cytogfr.2011.06.003 21752694 Sikorski K, Czerwoniec A, Bujnicki JM, Wesoly J, Bluyssen HA. STAT1 as a novel therapeutical target in pro-atherogenic signal integration of IFNgamma, TLR4 and IL-6 in vascular disease. Cytokine Growth Factor Rev. 2011;22(4):211–9. 21752694 10.1016/j.cytogfr.2011.06.003 67. Saigusa R Winkels H Ley K T cell subsets and functions in atherosclerosis Nat Rev Cardiol 2020 17 7 387 401 10.1038/s41569-020-0352-5 32203286 PMC7872210 Saigusa R, Winkels H, Ley K. T cell subsets and functions in atherosclerosis. Nat Rev Cardiol. 2020;17(7):387–401. 32203286 10.1038/s41569-020-0352-5 PMC7872210 68. Ait-Oufella H Salomon BL Potteaux S Robertson AK Gourdy P Zoll J Merval R Esposito B Cohen JL Fisson S Natural regulatory T cells control the development of atherosclerosis in mice Nat Med 2006 12 2 178 180 10.1038/nm1343 16462800 Ait-Oufella H, Salomon BL, Potteaux S, Robertson AK, Gourdy P, Zoll J, et al. Natural regulatory T cells control the development of atherosclerosis in mice. Nat Med. 2006;12(2):178–80. 16462800 10.1038/nm1343 69. Seijkens TTP Poels K Meiler S van Tiel CM Kusters PJH Reiche M Deficiency of the T cell regulator Casitas B-cell lymphoma-B aggravates atherosclerosis by inducing CD8+ T cell-mediated macrophage death Eur Heart J 2019 40 4 372 82 10.1093/eurheartj/ehy714 30452556 PMC6340101 Seijkens TTP, Poels K, Meiler S, van Tiel CM, Kusters PJH, Reiche M, et al. Deficiency of the T cell regulator Casitas B-cell lymphoma-B aggravates atherosclerosis by inducing CD8+ T cell-mediated macrophage death. Eur Heart J. 2019;40(4):372–82. 30452556 10.1093/eurheartj/ehy714 PMC6340101 70. Camare C Pucelle M Negre-Salvayre A Salvayre R Angiogenesis in the atherosclerotic plaque Redox Biol 2017 12 18 34 10.1016/j.redox.2017.01.007 28212521 PMC5312547 Camare C, Pucelle M, Negre-Salvayre A, Salvayre R. Angiogenesis in the atherosclerotic plaque. Redox Biol. 2017;12:18–34. 28212521 10.1016/j.redox.2017.01.007 PMC5312547 71. Shibuya M Vascular endothelial growth factor (VEGF) and its receptor (VEGFR) signaling in angiogenesis: a crucial target for anti- and pro-angiogenic therapies Genes Cancer 2011 2 12 1097 1105 10.1177/1947601911423031 22866201 PMC3411125 Shibuya M. Vascular endothelial growth factor (VEGF) and its receptor (VEGFR) signaling in angiogenesis: a crucial target for anti- and pro-angiogenic therapies. Genes Cancer. 2011;2(12):1097–105. 22866201 10.1177/1947601911423031 PMC3411125 72. Wang L Huang Z Huang W Chen X Shan P Zhong P Khan Z Wang J Fang Q Liang G Inhibition of epidermal growth factor receptor attenuates atherosclerosis via decreasing inflammation and oxidative stress Sci Rep 2017 8 45917 10.1038/srep45917 28374780 PMC5379239 Wang L, Huang Z, Huang W, Chen X, Shan P, Zhong P, et al. Inhibition of epidermal growth factor receptor attenuates atherosclerosis via decreasing inflammation and oxidative stress. Sci Rep. 2017;8:45917. 28374780 10.1038/srep45917 PMC5379239 73. Zeboudj L Maitre M Guyonnet L Laurans L Joffre J Lemarie J Selective EGF-receptor inhibition in CD4(+) T cells induces anergy and limits atherosclerosis J Am Coll Cardiol 2018 71 2 160 72 10.1016/j.jacc.2017.10.084 29325640 Zeboudj L, Maitre M, Guyonnet L, Laurans L, Joffre J, Lemarie J, et al. Selective EGF-receptor inhibition in CD4(+) T cells induces anergy and limits atherosclerosis. J Am Coll Cardiol. 2018;71(2):160–72. 29325640 10.1016/j.jacc.2017.10.084 74. Jin H. Identification of a PRDM1-regulated T cell network to regulate atherosclerotic plaque inflammation. https://github.com/jha14/PRDM1_Tcell_atherosclerosis 75. Jin H. Identification of a PRDM1-regulated T cell network to regulate atherosclerotic plaque inflammation. 10.5281/zenodo.15852128: Zenodo. ",
  "metadata": {
    "Title of this paper": "Selective EGF-receptor inhibition in CD4(+) T cells induces anergy and limits atherosclerosis",
    "Journal it was published in:": "Genome Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490039/"
  }
}