{
  "title": "Paper_1090",
  "abstract": "pmc Risk Anal Risk Anal 379 blackwellopen RISA Risk Analysis 0272-4332 1539-6924 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12474530 PMC12474530.1 12474530 12474530 40458005 10.1111/risa.70057 RISA70057 1 Original Article Original Article Use of updated mortality study of ethylene oxide manufacturing workers to inform cancer risk assessment VALDEZ‐FLORES et al. USE OF UPDATED MORTALITY STUDY OF ETHYLENE OXIDE MANUFACTURING WORKERS TO INFORM CANCER RISK ASSESSMENT Valdez‐Flores Ciriaco  1 ciriacov@tamu.edu Li Abby A.  2 Bender Thomas J.  3 Teta M. Jane  2   1 College of Engineering Texas USA   2 Exponent, Inc. Health Sciences Menlo Park California USA   3 Independent Consultant, Occupational Medicine and Epidemiology, Midland, MI, USA * Correspondence ciriacov@tamu.edu 03 6 2025 9 2025 45 9 497679 10.1111/risa.v45.9 2822 2837 31 3 2025 23 7 2024 12 5 2025 27 09 2025 28 09 2025 28 09 2025 © 2025 The Author(s). Risk Analysis Risk Analysis https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc/4.0/ Abstract The two most recent cancer risk assessments for ethylene oxide (EO) are based on the same epidemiologic study of sterilant workers conducted by the National Institute of Occupational Safety and Health (NIOSH) but result in cancer risk estimates with three orders of magnitude difference, despite relying on the same assumption of a default linear (non‐threshold) extrapolation. A major reason for the difference is the use of different exposure‐response models (i.e., the standard Cox proportional hazards [CPH] versus a two‐piece linear spline model with a steep initial slope) to derive the inhalation unit risk. The purpose of this research is to utilize analysis of a 10‐year update of the Union Carbide Corporation (UCC) EO 2053 chemical worker cohort to examine the epidemiological evidence for the shape of the exposure‐response model for EO. This updated UCC study provides an external dataset that is informative given high average cumulative exposures (67 ppm‐years), extensive average follow‐up of over 40 years, and number of male lymphoid cancer deaths (25) comparable to that observed in the NIOSH cohort. This independent analysis of a different cohort using continuous dose response modeling with cumulative or log cumulative exposure metrics provides no empirical support for a steep curve at low exposures. Furthermore, analyses of the categorical odds ratio estimates across different updates of the UCC cohort and for each sex in the NIOSH cohort provide further epidemiological evidence that the standard CPH model more plausibly describes the relationship between EO exposures and lymphoid mortality for both cohorts. cancer risk assessment epidemiology ethylene oxide lymphoid cancers statistical modeling American Chemistry Council 10.13039/100007824 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:26.09.2025  Valdez‐Flores Ciriaco. Li Abby A. Bender Thomas J. Teta M Jane. 2025 Use of updated mortality study of ethylene oxide manufacturing workers to inform cancer risk assessment Risk Analysis 45 2822 2837 10.1111/risa.70057 40458005 PMC12474530 1 INTRODUCTION Ethylene oxide (EO) is a chemical widely used in the production of other chemicals, in the sterilization industry, and in the preparation of spices. EO is characterized by the US Environmental Protection Agency's (EPA's) Integrated Risk Information System (IRIS) as “carcinogenic to humans” (EPA IRIS, 2016 The putative mode of action for carcinogenicity is mutagenicity (EPA IRIS, 2016 2020 2020 2020 2004 2001 2005 2016 Cancer risk assessments for EO conducted by EPA IRIS ( 2016 2020 2004 2003 This paper provides the first in‐depth consideration of the plausibility of exposure‐response models for the lymphoid data based on weight of evidence from epidemiology studies, including consideration of both continuous and categorical models. In this context, plausibility refers to the consistency of the most informative epidemiological evidence, the NIOSH and updated Union Carbide Corporation (UCC) studies, with exposure‐response model selection. Toward that purpose, an update of the UCC EO workers cohort is reported herein, in comparison with earlier updates of this cohort and with NIOSH findings reported for sterilizer workers. The UCC study and this new update provide an external dataset to inform the plausibility of the different continuous dose‐response models applied to the NIOSH lymphoid data used by EPA and TCEQ for cancer risk assessment. EPA IRIS used a steep two‐piece linear spline Cox proportional hazards (CPH) model in which two linear functions are joined at a single point of inflection at 1600 ppm‐days, called a “knot,” such that the first slope at lower exposures is much steeper than the second 1 1 FIGURE 1 Visual representation of Environmental Protection Agency (EPA) Integrated Risk Information System (IRIS) (2016) two‐piece linear spline model. This knot was selected by evaluating knots in multiple increments of 100 ppm‐days and considering those with the largest overall and local maximum likelihood (EPA IRIS, 2016 2004 2020 2 2016 The EPA cancer risk assessment guidelines (EPA, 2005 2015 p 3 2020 The UCC cohort is the only EO occupational cohort, other than the NIOSH cohort, with individual quantitative exposure estimates that is suited for quantitative exposure‐response analysis. The cumulative exposures to EO from the 25th to 75th percentiles of the UCC study subjects are greater than those in the corresponding percentile ranges of the NIOSH study (Table S1 EPA IRIS ( 2016 2016 2010 2016 In terms of total number of workers, the NIOSH study is a much larger cohort compared to the UCC study (18,235 male and female workers vs. 2053 male workers). This is true even when only male workers (7634) are considered. However, two major determining factors for statistical power are the length of follow‐up and the actual number of cancer cases found in the cohort. The UCC cohort is not only the largest cohort of highly exposed EO workers other than the NIOSH cohort (average cumulative EO exposure levels of 67 ppm‐years compared to 27 ppm‐years for the NIOSH cohort) (Steenland et al., 2004 2009 A limitation of the UCC study is that it cannot address female cancers such as breast cancer mortality because the cohort is comprised of only male workers, whereas the NIOSH sterilant worker cohort included both males and females (45% and 55%, respectively). The NIOSH study subjects were employed at 14 different sterilizing facilities and followed up for mortality initially to 1987 (Steenland et al., 1991 2004 2016 2020 2004 2004 Thus, for the purpose of considering the epidemiological weight of evidence to inform the dose‐response models that were applied to the NIOSH lymphoid cancers, there is no other EO epidemiological study with comparable numbers of cancers of interest and reasonable individual estimates of EO exposures (discussed below) than the UCC study. The results of this UCC study update are compared with those of previous UCC updates and the NIOSH study using the same dose‐response modeling approaches. These comparisons are also discussed within the context of the EPA IRIS ( 2016 2004 2 MATERIALS AND METHODS 2.1 Use of the UCC cohort as an external validation data set to inform exposure‐response analysis The UCC study was derived originally from a cohort mortality study of 29,139 UCC male chemical workers in the Kanawha Valley of West Virginia (Table 1 1988 1990 1993 2009 TABLE 1 Comparison of events of primary interest for internal quantitative exposure‐response analysis based on National Institute of Occupational Safety and Health (NIOSH) and Union Carbide Corporation (UCC) data sets for male workers. NIOSH UCC Characteristic Steenland et al. ( 2004 Greenberg et al. ( 1990 Teta et al. ( 1993 Swaen et al. ( 2009 Updated analysis Final year of follow up 1998 1978 1988 2003 2013 All male workers 7634 2174 1896 2063 2053  a Percent deceased 19% 14% 23% 51% 70% Average follow up 25 years NR 2 >27 37 years 41 years Person‐years 190,850 NR >51,192 76,331 84,173 PPM‐year exposure 27 NR NR 67 67  Primary endpoint for quantitative exposure response analysis Lymphoid cancers  b 27 NR NR 17 25  Subcategories of lymphoid cancers ( EPA IRIS, 2016 Non‐Hodgkin's lymphoma 18 2 NR 12 15  Related blood cancer endpoints of interest  c All lymphatic and hematopoietic 37 9 7 27 41 Leukemia 10 7 5 11 20  EPA IRIS (2016) animal inhalation carcinogenicity endpoints Respiratory cancers (including lung) 143 19 44 99 120 Central nervous system NR 4 6 13 16 Abbreviations: EPA, Environmental Protection Agency; IRIS, Integrated Risk Information System.  a The Swaen et al. ( 2009  b NR = Not reported.  c 2004 th John Wiley & Sons, Ltd. Teta et al. ( 1993 1990 1993 2.2 Selection of cancers of interest for exposure‐response analysis As described above, the focus of this exposure‐response analysis of the updated UCC cohort is on lymphoid cancer mortalities utilized by EPA IRIS ( 2016 2020 2016 2016 2 Standardized mortality ratios (SMR) were calculated for a much larger comprehensive list of potential endpoints (see below). No additional cancers were identified as having statistical significance indicative of further consideration for exposure‐response analyses. 2.3 UCC exposure assessment The methodology for EO exposure estimation was developed and published in Teta et al. ( 1993 2009 S2 1990 1964 1949 S2 S1 2.4 Mortality follow‐up Vital status and cause of death ascertainment relied on records included in the epidemiology surveillance system (ESS) maintained by The Dow Chemical Company, which acquired UCC and maintained custody of the UCC study data. ESS was a computerized collection of demographics, work history, vital status, and cause of death information for current and former full‐time Dow employees, including the UCC workers. Biennial record linkage was performed with the Social Security Administration; the National Death Index (NDI) maintained by Centers for Disease Control and Prevention National Center for Health Statistics; the vital records offices of most states; and genealogical sources such as Ancestry.com. Cause of death was coded to the version of International Classification of Diseases (ICD) in effect at the time of death (see Table S3 Supporting Information 2.5 External analyses 4 SMRs were calculated using SAS, employing subroutines specifically developed to analyze cohort studies based on a modified life table procedure (SAS, 2013 2009 1990 2.6 Internal analyses 5 Internal exposure‐response analyses were conducted using SAS ( 2013 2010 1 2016 2020 The standard CPH model assumes that the logarithm of the cause‐specific mortality hazard rate is linearly related to the cumulative exposure to EO (ppm‐days). Exposure‐response models were also fit assuming non‐zero lags and lags of 5–30 years in increments of 5 years with cumulative exposure to EO. Since there were no statistically significant differences in results based on lag, zero lag was used in the final main analyses (see Table S5 The CPH model was not adjusted for any covariates because none of the covariates significantly improved the likelihood of the model. In the UCC dataset, workers’ race was classified as white or Caucasian, black, non‐white, and unknown. Consistent with previous analyses of the UCC data, the primary analyses were not adjusted for race because of the substantial number of subjects of unknown race (Rinsky et al., 1988 2010 S7 For comparison purposes, exposure‐response models were fit to lymphoid cancers using the standard cumulative exposure metric and the log‐transformed cumulative exposure metric. The log‐transformed cumulative exposure metric requires imputation of a non‐zero value for zero exposures to avoid taking the logarithm of 0. The model with log‐cumulative exposure was fit, imputing the 0 cumulative exposure using four alternative values. 2.7 Internal analyses: Categorical exposure‐response modeling Categorical exposure‐response models using internal comparisons were evaluated using the standard CPH analyses for the same six cancer endpoints selected for continuous exposure‐response as described above. Five categories of cumulative exposures to EO were defined so that there were approximately the same number of cause‐specific deaths in each category for each cancer endpoint (see Table S4 p 2.8 Comparisons with NIOSH lymphoid mortality results Comparisons between the present internal continuous and categorical analyses of the UCC update with those of the NIOSH study were evaluated in the results section. The analysis results of the lymphoid cancers from the NIOSH study were obtained from Table S9 2010 S4 S4 2004 2016 Consistent with our analyses of the UCC data, the Valdez‐Flores et al. ( 2010 2004 2004 2004 2010 3 RESULTS 3.1 Standardized mortality ratios The SMRs in Table 2 TABLE 2 Observed (Obs) and expected (Exp) numbers of deaths, standardized mortality ratios (SMRs), and 95% confidence intervals (95% CIs) for selected causes of death among Union Carbide Corporation (UCC) ethylene oxide (EO) workers ( N Cause of death (ICD‐10 codes) Obs Exp SMR 95% CI  All causes 1435 1616.6 0.89  * 0.84–0.94  All malignant neoplasms 392 407.1 0.96 0.87–1.06 Buccal cavity and pharynx (C00‐C14) 5 8.3 0.60 0.19–1.40 Digestive organs and peritoneum (C15‐C26, C48) 111 98.1 1.13 0.93–1.36 Esophagus (C15) 11 11.4 0.97 0.48–1.73 Stomach (C16) 14 11.5 1.21 0.66–2.04 Large intestine (C18) 39 34.0 1.15 0.82–1.57 Rectum (C20‐C21) 6 6.9 0.87 0.32–1.89 Biliary passages and liver (C22, C24) 13 10.2 1.27 0.68–2.18 Pancreas (C25) 24 20.8 1.15 0.74–1.72 All other digestive organs (C17, C19, C23, C26, C48) 4 3.3 1.19 0.32–3.06 Respiratory system (C30‐C39) 120 144.0 0.83  * 0.69–1.00 Larynx (C32) 2 4.5 0.44 0.05–1.59 Bronchus, trachea, lung (C33‐C34) 116 138.3 0.84 0.69–1.01 All other respiratory cancer (C30‐C31, C37‐C39) 2 1.2 1.72 0.19–6.21 Prostate (C61) 27 39.8 0.68  * 0.45–0.99 Testis (C60, C62‐C63) 0 1.0 0.00 0.00–3.67 Kidney (C64‐C65) 15 10.2 1.47 0.82–2.42 Bladder or other urinary organs (C66‐C68) 11 13.1 0.84 0.42–1.51 Malignant melanoma of skin (C43) 3 6.5 0.46 0.09–1.36 Eye (C69) 0 0.2 0.00 0.00–18.3 Central nervous system (C70‐C72) 16 9.6 1.67 0.95–2.71 Thyroid and other endocrine glands (C73‐C75) 1 1.1 0.88 0.01–4.88 Bone (C40‐C41) 1 0.9 1.14 0.02–6.37 All lymphatic and hematopoietic (C81‐C96) 41 40.7 1.01 0.72–1.37 Hodgkin disease (C81) 0 1.8 0.00 0.00–2.04 Non‐Hodgkin lymphoma (C82, C83.0‐C83.9, C84, C85.1‐C85.9) 15 15.3 0.98 0.55–1.62 Leukemia (C91‐C95) 20 16.1 1.24 0.76–1.92 All other lymphopoietic tissue (C88, C90, C96) 6 7.4 0.81 0.29–1.75 Multiple myeloma (C90) 5 7.0 0.71 0.23–1.67 Lymphoid (C82, C83.0‐C83.9, C84, C85.1‐C85.9, C90, C91) 25 26.8 0.93 0.60–1.38 Soft tissue sarcoma (C49) 3 2.0 1.49 0.30–4.35 Nasopharyngeal cancer (C11) 1 0.6 1.65 0.02–9.20 All other malignant neoplasms (C44‐C47, C76‐C79, C80, C97) 38 31.8 1.20 0.85–1.64  Non‐malignant diseases Diabetes mellitus (E10‐E14) 31 34.4 0.90 0.61–1.28 Cerebrovascular disease (I60‐I69) 82 85.7 0.96 0.76–1.19 Heart disease (I00‐I02, I05‐I09,I11, I13‐I14, I20‐I28, I30‐I52) 486 568.7 0.86  * 0.78–0.93 Non‐malignant respiratory disease (J00‐J99) 117 153.4 0.76  * 0.63–0.91 All external causes (V01‐Y89) 66 92.8 0.72  * 0.55–0.91  Unknown causes 2 – – –  Note *Statistically significantly <1 at the 5% significance level. John Wiley & Sons, Ltd. Table 3 TABLE 3 Standardized Mortality Ratios (SMRs) for key cancer endpoints from different updates of the Union Carbide Corporation (UCC) study. Cause of death SMR (95% confidence interval) 1978 1988 2003 2013 Updates of the UCC study Greenberg et al. ( 1990 Teta et al. ( 1993 Swaen et al. ( 2009  b Updated analyses Lymphoid cancers NR NR 0.87  b 0.93 (0.51–1.40) (0.60–1.38) Non‐Hodgkin's lymphoma 0.78 NR 1.05 0.98 (0.04–3.62) (0.54–1.83) (0.55–1.62) All lymphatic and hematopoietic 1.04 0.59 0.89 1.01 (0.28–2.66) (0.24–1.22) (0.59–1.29) (0.72–1.37) Leukemia 1.97  a 1.06  a 0.93 1.24 (0.38–5.76) (0.35–2.48) (0.47–1.67) (0.76–1.92) Respiratory cancers (including lung) 0.63 0.90 0.86 0.83 (0.29–1.19) (0.66–1.21) (0.70–1.04) (0.69–1.00) Central nervous system 0.67 1.50 1.64 1.67 (0.03–3.19) (0.55–3.27) (0.88–2.81) (0.95–2.71) Abbreviation: NR, not reported.  a Includes “leukemia and aleukemia.”  b 2009 2009 John Wiley & Sons, Ltd. 3.2 Exposure‐response modeling The slopes associated with the standard CPH model fitted to each of the 6 endpoints selected from the two most recent updates of the UCC study are summarized in Table 4 TABLE 4 Slopes of estimated cancer‐specific mortality rates with respect to cumulative exposure to ethylene oxide (EO) from the 2003 and 2013 updates of the Union Carbide Corporation (UCC) study. Endpoint Slope: MLE (90% confidence interval) Last year of follow‐up for the UCC cohort 2003 (Swaen et al., 2009 2013 (Present study) Lymphoid cancers −1.66 × 10 −5 −1.32 × 10 −5 (−3.52 × 10 −5 −6  a (−2.80 × 10 −5 −6 Non‐Hodgkin's lymphoma (NHL) −9.91 × 10 −6 −1.18E −5 (−2.73 × 10 −5 −6 (−3.02 × 10 −5 −6 All lymphatic and hematopoietic (LH) −6.79 × 10 −6 −6.09 × 10 −6 (−1.71 × 10 −5 −6 (−1.49 × 10 −5 −6 Leukemia 4.57 × 10 −7 −8.06 × 10 −7 (−1.05 × 10 −5 −5 (−1.03 × 10 −5 −6 Respiratory cancers (including lung) 1.24 × 10 −6 1.26 × 10 −6 (−2.1 × 10 −6 −6 (−2.08 × 10 −6 −6 Central nervous system −2.6 × 10 −5  * −2.15 × 10 −5 (−5.51 × 10 −5 −6 (−4.60 × 10 −5 −6 Abbreviations: MLE, Maximum Likelihood Estimate; SE, Standard Error.  a  * 2013 2010 S9 John Wiley & Sons, Ltd. None of the slopes are statistically significantly increased when compared to the null model (i.e., zero slope). The three components of lymphoid tumors (NHL, MM, and LLK) all have non‐statistically significant negative slopes (results for MM and LLK not shown). The only positive slope for respiratory cancer is also not statistically significant. Similar to what was seen by Swaen et al. ( 2009 2009 −6 −6 4 S7 For the UCC study, the standard CPH model with untransformed (linear) cumulative exposure had a better statistical fit (i.e., less deviance) compared to the log cumulative exposures for lymphoid cancers (Table S6 S8 Applying the same methods to the NIOSH males resulted in a non‐statistically significant positive slope of 3.89 × 10 −6 p −7 −6 6 S6 2004 2004 2016 S6 3.3 Categorical analyses based on internal comparisons The lack of an increasing trend based on exposure‐response modeling was further confirmed by an internal categorical analysis, whereby no specific shape of the exposure‐response relationship is assumed. This analysis compares the hazard rate at each quintile of cumulative exposure to the hazard rate in the quintile with the lowest cumulative exposure to EO. In the second quintile only for LH, there was a statistically significant increase for the most recent update of the UCC study. None of the remaining comparisons (lymphoid, NHL, leukemia, respiratory, and CNS) were statistically significantly increased. For the NIOSH study, there was a statistically significant excess in the highest quintile for lymphoid cancer for males ( p p S4 In NIOSH males, NHL and LH categories also were statistically significantly increased in the highest category. Since NHL is the major component of the lymphoid group (15 of 25 cases) in males and since lymphoid cases are the major component of the larger all LH category (25 of 37 cases), these larger categories of lymphoid and LH reflect the NHL excess in the highest quintile (Table S4 4 DISCUSSION The purpose of this manuscript is to investigate the plausibility of two exposure‐response models applied to NIOSH lymphoid data based on consideration of the epidemiological evidence from the results of the present update of the UCC cohort and the published results of the NIOSH study. As described above in the Introduction, the two exposure models of interest are the standard log‐linear CPH model and a two‐piece linear spline model with an initial steep slope followed by a shallower slope. Slopes for both models are essentially linear at the lower exposure levels, but the slope of the latter model is very steep. This discussion section first considers the consistency of exposure‐response models with the UCC cohort update and the original findings of the NIOSH study. Next, limitations of the UCC cohort that might weaken its suitability for addressing the plausibility of exposure‐response models are considered. Finally, analyses and rationale that conflict with our conclusions regarding model selection are evaluated. 4.1 Plausibility of steep versus shallow exposure‐response models based on epidemiology data The UCC EO chemical worker cohort has been examined multiple times over the past 40+ years to the point where the vast majority of the population is deceased. In this update, we have conducted both traditional external comparisons and detailed worker‐to‐worker internal comparisons, using standard CPH regression modeling, incorporating continuous and categorical cumulative exposure metrics, as well as continuous CPH modeling with log cumulative exposure metric. The results of the updated UCC cohort with 10 more years of observation do not indicate any statistically significant excess deaths nor exposure‐response trends for any of the male cancers of interest. Exposure lag periods (5–30 years) had no meaningful impact on our analyses and conclusions (Table S5 S7 Specifically, the results of our detailed analyses of UCC data in no way support an increased risk, particularly no indication of a steep slope at low exposures for the cancers of interest. The UCC non‐positive findings persist across multiple updates of the cohort. There are no increasing exposure‐response trends, as the non‐statistically significant slopes were negative (Table 4 Neither the cumulative exposure nor the log cumulative exposure metrics resulted in statistically significant slopes (Tables S7 and S8 Although the upper‐bound slope on the non‐statistically significant CPH model is positive, it is very small in magnitude and does not indicate a steep exposure‐response pattern at lower exposures. In the internal comparisons, none of the quintiles of exposure indicate increasing cancer with increasing exposure (Table S4 Incorporating exposure lags in the analysis did not alter these patterns (Table S5 Our analysis of the NIOSH study data are consistent with the Steenland et al. ( 2004 2004 The EPA IRIS exposure‐response model below the cumulative exposure knot of 1600 ppm days is the basis for EPA's slope calculation and ultimate unit risk estimate. It is notable that of the 13 lymphoid deaths below the knot, only 3 are males. The remaining male cases above the knot, from which an excess at highest exposure group was determined, are essentially excluded from EPA's low‐exposure slope analysis. The EPA IRIS ( 2016 2013 2004 2016 2A 2B 2C FIGURE 2 Categorical rate ratios and 90% confidence intervals for National Institute of Occupational Safety and Health (NIOSH) lymphoid cancer with 15‐year lag as reported by EPA IRIS ( 2016 2016 2016 An exposure‐response model with a steep positive slope in the low‐exposure region indicates a potent carcinogen. Use of the two‐piece linear spline in the EPA IRIS ( 2016 Based on these two most informative epidemiology studies, there is no evidence that EO is a highly potent carcinogen consistent with a steep increase in risk at low exposures. These conclusions are supported by the following integrated analyses of both studies. Using external analyses, the ratio of overall observed to expected numbers of LH and lymphoid cancer deaths is not in excess in the UCC cohort. Both studies report no increased overall male mortality for all LH cancers and very similar 95% CIs. UCC's SMR was 1.01 (0.72, 1.37) (Table 2 2004 2004 4 2004 In internal analyses of the NIOSH data using categorical cumulative exposure metric, Steenland et al. ( 2004 The overall assessment of EO epidemiology from the two most informative studies clearly fails to identify a potent carcinogen that would be consistent with selection of a model with a steep exposure‐response pattern at lower exposures. 4.2 Suitability of UCC cohort data The suitability of the UCC data as an external verification for selection of the exposure‐response model should be discussed to address questions raised in the past about the use of this study to support quantitative cancer risk assessment purposes. Human data are a very well accepted methodology for cancer (QRA) provided the epidemiology study(ies) has adequate quality, size, and exposure data at the individual level (EPA, 2005 2003 2004 2016 4.2.1 Comparability of sample size and historical exposure estimates With the extended follow‐up of the UCC cohort, the sample sizes for the cancers of interest are comparable to the male numbers in the NIOSH mortality study, despite the larger overall cohort size of the NIOSH study (Table 1 S4 Uncertainty in exposure estimation is characteristic of retrospective epidemiology studies that have long observation periods. Both studies have exposure estimates at the individual level that vary over time and are applicable to exposure‐response analysis. The UCC exposure assessment is of comparable reliability to that of the NIOSH study, which had no exposure data prior to 1978. Between 1978 and 1986, the NIOSH exposure assessment was based on a rigorously validated statistical regression model based on personal exposure monitoring measures from 18 plants (Hornung et al., 1994 2019 2019 1991 Thus, the UCC study has comparable, if not superior, historical exposure data before 1978, strengthening the use of this study to inform the plausibility of exposure‐response models that have been applied to the NIOSH study. 4.2.2 Quality issues (bias and exposure misclassification) UCC chemical workers had the potential for multiple chemical exposures in addition to EO, raising the issue of confounding bias. In 1990, Greenberg et al. ( 1990 1993 1993 1990 The UCC study update failed to observe increased numbers of LH cancers based on external comparisons. The absence of significant SMRs in the UCC study has been questioned based on concern that a healthy worker effect (HWE) bias may be masking an increased risk. However, the epidemiologic literature has shown that the HWE is primarily a concern in occupational cohort studies with short follow‐up and is more serious for diseases that have considerable symptoms at hire than for diseases without pre‐diagnosis symptomatology, such as cancers that develop over a longer time period (Fox & Collier, 1976 1986 2007 2004 We did observe deficits in major non‐cancer causes (e.g., heart and respiratory diseases) that may reflect lower prevalence of smoking in the UCC workers. This is consistent with the absence of excesses in smoking‐related cancers of the respiratory system in this study population. Criticisms of relying on previous UCC study updates as a basis for informing cancer risk stemmed from concerns that follow‐up was beyond the cancer latency period and possible effects would be attenuated by higher background rates of cancer in this elderly population (EPA IRIS, 2016 3 Study result differences between the UCC and NIOSH studies’ results are evident in the internal exposure‐response analyses. Steenland et al. ( 2004 S4 There is a striking difference in the findings of these two studies that cannot be attributed to sample size, inadequate worker exposures, or confounding. In addition, post hoc analysis controlling for race and year of birth similar to methods used by NIOSH had no impact on the UCC outcome. This calls into question the plausibility of the very high IRIS URF for lymphoid cancers using a two‐piece linear spline model that places EO in the category of a potent carcinogen. 4.3 Consideration of EPA's rationale supporting a steep continuous exposure response model for lymphoid cancers In the NIOSH cohort, the only exposure‐response model reported to have statistically significant positive slopes for LH and lymphoid cancer mortality in males is the log cumulative exposure model with a 15‐year lag (EPA IRIS, 2016 2004 2016 2016 2016 In considering the statistical significance of the log cumulative model for male lymphoid cancers, it is important to keep in perspective that a large number of curve‐fitting models were tested. Steenland et al. ( 2004 p 2004 p Another rationale for applying a supralinear model is based on an apparent “visual fit” of a few non‐parametric categorical rate ratios (i.e., odds ratios) to assume the shape of continuous models based on individual data. Visual fit comparisons are subjective and depend on how graphs are presented. Visual fit comparisons can be especially misleading if the data are normalized along the y y 2016 y 2020 6 y 3 3 3 FIGURE 3 Models adjusted for standard log‐linear Cox proportional hazard (CPH) model background hazard rate. Note: Visual representation of the NIOSH lymphoid individual rate ratios compared to three different models from EPA IRIS (2016), all adjusted for the standard CPH model baseline hazard for improved comparison along the Y‐axis (adapted from TCEQ, 2020, fig. 15). This adjustment is based on an approximation of the difference in y‐intercept between the standard CPH model and the rate ratios, for purposes of addressing EPA IRIS (2016, pp. 4–21) Figures 4 and 3 footnote that states, “the different models have different implicitly estimated baseline risks; thus, they are not strictly comparable to each other in terms of RR values, that is, along the y‐axis.” The individual rate ratios are categorical ratios in which each category was defined to have one lymphoid mortality. See Supplemental Materials Figure 3 Calculations for details. An objective method to ground truth the model is to compare model predictions with the observed number of deaths overall and within exposure subcategories, as was described in detail by TCEQ ( 2020 3 2016 2020 7 2020 5 SUMMARY AND CONCLUSIONS In summary, we have compared our results for LH and lymphoid cancers from the UCC cohort with past updates and with the findings of the NIOSH sterilant worker cohort and considered how these data inform the plausibility of exposure‐response models. None of the UCC cohort findings, including a log cumulative exposure analysis, indicate a steep positive slope at low exposures (i.e., a highly potent inhalation carcinogen). In fact, there were no positive slopes for these endpoints, contributing further to the weight of evidence based on epidemiologic evidence that the selection of a steep positive exposure‐response model is implausible. This updated UCC study is informative for the purpose of evaluating the plausibility of the exposure‐response model for the most critical endpoint for cancer risk based on consistency with the epidemiological evidence. The absence of increased risks in the UCC study (in both external and internal analyses across several updated analyses) and a statistically significant increase limited to males in the highest exposure group in the published NIOSH study call into question the plausibility of the two‐piece linear spline model with a steep supralinear exposure‐response pattern applied in the EPA IRIS ( 2016 The standard CPH model is well accepted by epidemiologists in cancer exposure‐response analysis, essentially linear at the observed exposures levels of the studies, and consistent with an assumption of no‐threshold that reflects the epidemiological weight of evidence. The classical epidemiological approach to identifying a carcinogen is to look for an exposure‐response trend that gradually increases from low to high exposures. Even though EO is a genotoxic agent and is thus assumed by default to operate by a linear mode of action (MOA), human toxicological defense mechanisms nonetheless potentially attenuate responses at very low exposures (Gollapudi et al., 2020 2021 CONFLICTS OF INTEREST STATEMENT At the time the study was conducted, Dr. Bender was an employee of The Dow Chemical Company and received a salary and shares of stock in the company. UCC is a wholly owned subsidiary of The Dow Chemical Company. After exiting Dow, Dr. Bender served as a consultant for the American Chemistry Council. Dr. Bender's analysis was limited to the standard mortality rates of the UCC update in Table 2 Supporting information Table S1: Distribution of the cumulative EO exposures (ppm‐days) in the current UCC update (bold), previous UCC update and NIOSH study Table S2: Exposure Assessment Matrix for the UCC Cohort, Kanawha Valley (KV), West Virginia Table S3: The ICD codes corresponding to the different revisions used in the analyses of the endpoints herein Table S4: Rate ratio analyses and Cox proportional hazards model for cumulative exposure for each combination of endpoint, sex, and study Table S5: Statistical impact of exposure lag periods (5‐30) on the zero‐lag model fit for UCC male lymphoid mortality Table S6: Comparison of standard CPH models using linear vs. log‐transformed cumulative exposure in the UCC cohort update through 2013 Table S7: Slopes of estimated cancer‐specific mortality rates with respect to cumulative exposure to EO with models adjusted for race and year of birth based on UCC cohort Table S8: Slopes of estimated cancer‐specific mortality rates with respect to logarithm cumulative exposure to EO for lymphoid mortality in the UCC cohort update through 2013. Figure 3 Calculations ACKNOWLEDGMENTS The authors wish to acknowledge Dr. Steave Su and Ms. Amy Zimmerman for assistance in calculations, editing and formatting this manuscript to meet journal requirements. The American Chemistry Council (ACC) provided funding for updating and conducting the quantitative analysis of the study of employees of Union Carbide Corporation (UCC), which is a wholly owned subsidiary of the Dow Chemical Company. The analyses and decisions concerning organization, technical approach, content, preparation, editing, and submission of this manuscript were made solely by the authors. The sponsor did not provide any input to the manuscript. The study was conducted in accordance with the Declaration of Helsinki, and the protocol for the study (HSRB‐2017‐196) was reviewed and approved on 01‐16‐2017 by Dow's Human Studies Review Board (HSRB), an Institutional Review Board (IRB) registered (IRB00007144) with the Office for Human Research Protections with the US Department of Health and Human Services (DHHS). 1 EPA's model has the mathematical form 1 + β1×C + β2×max{0, C‐knot}, in which β1 > β2 2 TCEQ's model has mathematical form exp(β C), where β represents the regression coefficient and C is the time‐dependent cumulative exposure concentration. 3 The p 4 External analysis are risk metrics that compare the risk of workers to the risk of a reference population, typically the general US or regional populations, that are not selected from the same pool of workers 5 Internal analysis compare the risk of exposed workers to the risk of a set of unexposed or lower exposed workers from the same cohort. 6 Though the Wald's 95% lower confidence limit on the slope (9.78x10 −7 2010 S4 7 As a check, we independently calculated 95% CIs of (38.8,68.2) and (73.3, 111.7) for the TCEQ and EPA models, respectively, based on the Exact Poisson distributions (Ahlbom, 1993 DATA AVAILABILITY STATEMENT The data that support the findings of this study are available on request from the corresponding author. The data are not publicly available due to privacy or ethical restrictions. REFERENCES Ahlbom A. 1993 Descriptive epidemiologic measures Biostatistics for epidemiologist 56 CRC Press 10.1201/9781315138411 Benson L. O. Teta M. J. 1993 Mortality due to pancreatic and lymphopoietic cancers in chlorohydrin production workers British Journal of Industrial Medicine 50 8 710 716 10.1136/oem.50.8.710 8398857 PMC1012174 Bogen K. T. Sheehan P. J. Valdez‐Flores C. Li A. A. 2019 Reevaluation of historical exposures to ethylene oxide among U.S. sterilization workers in the National Institute of Occupational Safety and Health (NIOSH) study cohort International Journal of Environmental Research and Public Health 16 10 1738 10.3390/ijerph16101738 31100939 PMC6572526 Fennell T. R. Brown C. D. 2001 A physiologically based pharmacokinetic model for ethylene oxide in mouse, rat, and human Toxicology and Applied Pharmacology 173 3 161 175 10.1006/taap.2001.9184 11437638 Fox A. J. Collier P. F. 1976 Low mortality rates in industrial cohort studies due to selection for work and survival in the industry British Journal of Preventive & Social Medicine 30 4 225 230 10.1136/jech.30.4.225 1009272 PMC478970 Gollapudi B. B. Su S. Li A. A. Johnson G. E. Reiss R. Albertini R. J. 2020 Genotoxicity as a toxicologically relevant endpoint to inform risk assessment: A case study with ethylene oxide Environmental and Molecular Mutagenesis 61 9 852 871 10.1002/em.22408 32926486 PMC7756744 Greenberg H. L. Ott M. G. Shore R. E. 1990 Men assigned to ethylene oxide production or other ethylene oxide related chemical manufacturing: A mortality study British Journal of Industrial Medicine 47 4 221 230 10.1136/oem.47.4.221 2337530 PMC1035141 Hornung R. W. Greife A. L. Stayner L. T. Steenland N. K. Herrick R. F. Elliott L. J. Ringenburg V. L. Morawetz J. 1994 Statistical model for prediction of retrospective exposure to ethylene oxide in an occupational mortality study American Journal of Industrial Medicine 25 6 825 836 10.1002/ajim.4700250607 8067360 IARC Working Group on the Evaluation of Carcinogenic Risks to Humans 2012 Chemical agents and related occupations IARC Monographs on the Evaluation of Carcinogenic Risks to Humans 100 Pt F 9 562 23189753 PMC4781612 Joyner R. E. 1964 Chronic toxicity of ethylene oxide. A study of human responses to long‐term low‐level exposures Archives of Environmental Health 8 700 710 10.1080/00039896.1964.10663741 14120567 Kirman C. R. Li A. A. Sheehan P. J. Bus J. S. Lewis R. C. Hays S. M. 2021 Ethylene oxide review: Characterization of total exposure via endogenous and exogenous pathways and their implications to risk assessment and risk management Journal of Toxicology and Environmental Health. Part B, Critical Reviews 24 1 1 29 10.1080/10937404.2020.1852988 33323046 Monson R. R. 1986 Observations on the healthy worker effect Journal of Occupational Medicine 28 6 425 433 10.1097/00043764-198606000-00009 3723215 Pearce N. Checkoway H. Kriebel D. 2007 Bias in occupational epidemiology studies Journal of Occupational and Environmental Medicine 64 8 562 568 10.1136/oem.2006.026690 PMC2078501 17053019 Recio L. Donner M. Abernethy D. Pluta L. Steen A. M. Wong B. A. James A. Preston R. J. 2004 In vivo mutagenicity and mutation spectrum in the bone marrow and testes of B6C3F1 lacI Mutagenesis 19 3 215 222 10.1093/mutage/geh017 15123787 Richardson D. B. 2010 Discrete time hazards models for occupational and environmental cohort analyses Occupational and Environmental Medicine 67 1 67 71 10.1136/oem.2008.044834 20029026 Rinsky R. A. Ott G. Ward E. Greenberg H. Halperin W. Leet T. 1988 Study of mortality among chemical workers in the Kanawha Valley of West Virginia American Journal of Industrial Medicine 13 4 429 438 10.1002/ajim.4700130403 3284337 SAS 2013 SAS system for windows, release 9.4 SAS Institute Sexton R. J. Henson E. V. 1949 Dermatological injuries by ethylene oxide The Journal of Industrial Hygiene and Toxicology 31 5 297 300 18148651 Silva D. S. 1999 Cancer Epidemiology: Principles and Methods. International Agency for Research on Cancer. International Agency for Research on Cancer Publications https://publications.iarc.fr/Non-Series-Publications/Other-Non-Series-Publications/Cancer-Epidemiology-Principles-And-Methods-1999 Steenland K. Stayner L. Deddens J. 2004 Mortality analyses in a cohort of 18 235 ethylene oxide exposed workers: Follow up extended from 1987 to 1998 Occupational and Environmental Medicine 61 1 2 7 14691266 PMC1757803 Steenland K. Stayner L. Greife A. Halperin W. Hayes R. Hornung R. Nowlin S. 1991 Mortality among workers exposed to ethylene oxide The New England Journal of Medicine 324 20 1402 1407 10.1056/NEJM199105163242004 2020295 Steenland K. Whelan E. Deddens J. Stayner L. Ward E. 2003 Ethylene oxide and breast cancer incidence in a cohort study of 7576 women (United States) Cancer Causes & Control 14 6 531 539 10.1023/a:1024891529592 12948284 Swaen G. M. Burns C. Teta J. M. Bodner K. Keenan D. Bodnar C. M. 2009 Mortality study update of ethylene oxide workers in chemical manufacturing: A 15 year update Journal of Occupational and Environmental Medicine 51 6 714 723 10.1097/JOM.0b013e3181a2ca20 19430313 Teta M. J. Benson L. O. Vitale J. N. 1993 Mortality study of ethylene oxide workers in chemical manufacturing: A 10 year update British Journal of Industrial Medicine 50 8 704 709 10.1136/oem.50.8.704 8398856 PMC1012173 Texas Commission on Environmental Quality (TCEQ) 2020  Ethylene oxide carcinogenic dose‐response assessment. development support document final Toxicology, Risk Assessment, and Research Division, Texas Commission on Environmental Quality U.S. Environmental Protection Agency (EPA) 2005  Guidelines for carcinogen risk assessment Environmental Protection Agency EPA IRIS 2016  Evaluation of the inhalation carcinogenicity of ethylene oxide U.S. Environmental Protection Agency, Office of Research and Development, National Center for Environmental Assessment U.S. Environmental Protection Agency Science Advisory Board (SAB) 2015  Science advisory board review of the EPA's evaluation of the inhalation carcinogenicity of ethylene oxide [revised external review draft—August 2014] US Environmental Protection Agency Valdez‐Flores C. Sielken R. L. Jr. 2013 Misinterpretation of categorical rate ratios and inappropriate exposure–response model fitting can lead to biased estimates of risk: Ethylene oxide case study Regulatory Toxicology and Pharmacology 67 2 206 214 23917152 10.1016/j.yrtph.2013.07.011 Valdez‐Flores C. Sielken R. L. Teta M. J. 2010 Quantitative cancer risk assessment based on NIOSH and UCC epidemiological data for workers exposed to ethylene oxide Regulatory Toxicology and Pharmacology 56 3 312 320 10.1016/j.yrtph.2009.10.001 19840826 ",
  "metadata": {
    "Title of this paper": "Quantitative cancer risk assessment based on NIOSH and UCC epidemiological data for workers exposed to ethylene oxide",
    "Journal it was published in:": "Risk Analysis",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474530/"
  }
}