{
  "title": "Paper_894",
  "abstract": "pmc Sleep Health Sleep Health 319 nihpa Sleep health 2352-7218 2352-7226 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12477716 PMC12477716.1 12477716 12477716 NIHMS2110410 40619283 10.1016/j.sleh.2025.05.009 NIHMS2110410 NIHPA2110410 1 Article Late-life sleep medication use associated with increased falls risk in the Atherosclerosis Risk in Communities (ARIC) study Full Kelsie M. PhD, MPH a * Pusalavidyasagar Snigdha S. MD, FAASM b Palta Priya PhD c Hicks Caitlin W. MD, MS d Spira Adam P. PhD e f Windham Beverly Gwen MD, MHS g Juraschek Stephen P. MD, PhD h Pase Matthew P. PhD i Himali Jayandra J. PhD j k l m Lutsey Pamela L. PhD n a b c d e f g h i j k l m n Author contributions KMF and PLL were responsible for study concept and design. PLL and CH contributed to acquisition of data. KMF, SP, PP, CH, APS, BGW, SJ, MMP, JH, and PLL contributed to analysis and interpretation of data, and all authors also contributed to manuscript preparation. * k.full@vumc.org 10 2025 05 7 2025 11 5 497744 746 753 21 09 2025 29 09 2025 30 09 2025 30 09 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license ( http://creativecommons.org/licenses/by-nc-nd/4.0/ Objective: Accidental falls are the leading cause of injury for older adults in the United States. Identifying risk factors for falls is a public health priority. Poor sleep is prevalent among aging adults and has been linked to falls risk. We examined late-life sleep medication use and falls risk in a cohort of older adults. Methods: The Atherosclerosis Risk in Communities (ARIC) study is an ongoing community-based cohort study. ARIC participants taking any barbiturates, benzodiazepines, antidepressants, non-benzodiazepine receptor agonists, or other hypnotics in the past 4 weeks (2011–2013) were categorized as taking a medication that affects sleep, regardless of indication. Participant hospital discharge records were reviewed through 2019 for ICD codes indicating incident falls. Propensity score matching was used to match participants who used sleep medications with those who did not (1:2). Cox proportional hazards regression models were used to assess the association of sleep medication use with falls with adjustment for demographics, lifestyle, and health characteristics. Results: In the matched sample (N = 4794; 70% female; mean age 75.5 ± 5 years), 1200 documented falls occurred over 6.5 years of follow-up. In fully adjusted models, sleep medication use was associated with a 33% greater risk of falls compared to nonuse (HR: 1.33; 95% CI: 1.18–1.51). Results did not differ by age, sex, depressive symptoms, baseline cognitive status, or physical functioning status (interaction p Conclusions: Late-life sleep medication use is associated with a higher risk of falls. Further research is needed to clarify the mechanisms linking sleep medications to falls risk. Frailty Aging Sleep disturbances Insomnia pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction For older adults in the United States, accidental falls are the leading cause of injury and often result in hospitalization, recurrent falls, or even death. 1 2 3 4 3 Poor sleep has been linked to increased fall risk. 5 7 8 9 10 11 12 Sleep medications are a potential pathway through which poor sleep contributes to falls. 13 14 15 16 17 18 19 20 21 23 The Atherosclerosis Risk in Communities (ARIC) study provides an opportunity to examine associations between use of medications that affect sleep and risk of falls over a 7-year period in a large community-based sample of older adults. We hypothesized that use of sleep medications (regardless of indication) will be associated with increased risk of falls. We explored whether associations differ by age and sex, or by number of medications used. Methods Study design The ARIC study is a community-based cohort that comprises 15,792 adults (45–64 years) from four US communities (suburbs of Minneapolis, MN; Washington County, MD; Forsyth County, NC; Jackson, MS). Since the first ARIC visit (1987–1989), participants have attended numerous follow-up clinic visits, including visit 5 (2011–2013), which serves as baseline for this analysis. In addition to study clinic visits, participants are contacted by phone regularly (annually before 2012; semiannually since) and followed continuously via active surveillance for hospitalizations and death. Institutional Review Boards from each ARIC center approved study protocols and participants provided written informed consent prior to participating. Sleep medication use The primary exposure for this analysis was sleep medication use at ARIC Visit 5. Prior to each ARIC visit, participants were reminded to bring all medications taken in the past 4 weeks to the clinic, including prescriptions, over-the-counter medications, cold and allergy medications, vitamins, herbal remedies, and other supplements. Medication containers were reviewed by trained and certified ARIC staff who electronically captured the medication name, strength, and units in real time by scanning bar-coded universal product codes (UPC), when available, or when scanning failed, by transcribing the national drug code, name, strength, and units from the medication containers. The following medication classes were selected based on physician recommendation and the literature, and were included in the composite sleep medication exposure ( Supplementary Table 1 24 Outcome ascertainment The primary outcome for this analysis was incident falls identified in hospitalization discharge records. Participants were followed for falls from ARIC Visit 5 (2011–2013) through December 31, 2019, except for participants at the Jackson, MS site, who were followed through December 31, 2017 due to delays in obtaining access to hospitalization records. Falls were captured in ARIC active hospitalization record surveillance or via linkage to Centers for Medicare and Medicaid Services (CMS) claims data after Visit 5 using ICD-9 (until 2015) and ICD-10 (after 2015) diagnosis codes. In a previous ARIC analysis, ICD-9 codes for falls were mapped on to ICD-10 codes and the validity of this approach has been documented previously. 25 26 To estimate the risk of more minor falls that do not result in hospitalization, we added a secondary analysis exploring sleep medication use with self-reported falls. Our secondary outcome was a participant-reported fall in the past 6 months. This information was queried by trained interviewers during a 2016 ARIC surveillance phone call. Additional variables of interest At the ARIC baseline examination, demographic information was obtained including age, sex, race, study center, and educational attainment. At ARIC Visit 5 standardized interview-administered questionnaires were used to assess smoking status, alcohol consumption, physical activity, and presence of depressive symptoms. Physical activity was assessed with the modified Baecke physical activity questionnaire. 27 28 29 30 31 32 32 33 A panel of physicians determined a participant’s cognitive status at Visit 5 using scores from a battery of cognitive tests 34 41 42 Statistical analysis Standard with ARIC analyses, a 5-level race-study center variable (White participants from Minneapolis, MN; White participants from Washington County, MD; Black participants from Jackson, MS; Black participants from Forsyth County, NC; White participants from Forsyth County, NC) was computed and used in analyses (other racial-study center combinations were too rare for meaningful analysis). The initial analytic sample included 6 538 participants who attended ARIC Visit 5 (2011–2013). Participants were excluded if they were missing information on covariates used in matching ( n n n Logistic regression propensity score matching was used to match each participant who used a sleep medication with 2 who did not (1:2) within sex, by age, race-center, and education level using nearest neighbor matching without replacement. Using the R MatchIT package, 43 We used the Kaplan Meier method to visualize the cumulative falls incidence by late-life sleep medication use and conducted log rank tests to examine differences between sleep medication use and nonuse. The Kaplan Meier method was implemented in R language using the Survminer package ( https://CRAN.R-project.org/package=survminer In sensitivity analyses, we excluded (n = 50) participants with incident dementia within 365 days of the follow-up period from the initial sample and then reperformed matching. We included cross-product interaction terms in model 3 to explore possible effect modification of the association between sleep medication use and risk of falls by sex, age, depressive symptoms, baseline cognitive status, and baseline physical functioning. Stratified results are presented by sex and by median age (< 75 vs. ≥75 years), depressive symptoms (low vs. high), baseline cognitive status (normal vs. MCI), and physical function score (low vs. high). To explore the dose-response nature of the association, we categorized sleep medication use by number of medications used at baseline (0, 1, or ≥2). Last, to explore the association by sleep medication class, we ran models with the individual sleep medication classes (with sufficient sample sizes). For secondary analyses, the initial sample included 4968 participants who during a 2016 surveillance call responded to a question about self-reported falls in the past 6 months and were eligible for matching. After matching, 3804 participants were included in the secondary analysis sample. Among the matched secondary analysis sample, we performed conditional logistic regression relating sleep medication use to self-reporting a fall in the past 6 months using the same progressive modeling approach. All analyses were performed using R version 4.2.2. Results The average age of participants was 75.5 years (standard deviation (SD): 5.2) and 70% were female. Participants who used a sleep medication were more likely to be current smokers, less likely to currently consume alcohol, and were more likely to have chronic health conditions including prevalent diabetes, prevalent CHD, and MCI ( Table 1 Over a median follow-up of 6.6 years (maximum: 8.6 years), 1200 participants had a documented fall. Fig. 1 p Table 2 We observed evidence of a dose response relationship, with the greatest risk of falls hospitalization among participants taking 2 or more sleep medications (HR: 1.45; 95% CI: 1.18–1.79; data not shown) and intermediate risk among those taking only 1 sleep medication (HR: 1.30; 95% CI: 1.13–1.49; data not shown) as compared to participants who did not use sleep medications. The HR directly comparing participants taking 2 or more sleep medications to those taking 1 sleep medication, was 1.12 (95% CI: 0.90–1.40; data not shown). The association between sleep medication use and falls hospitalization did not significantly differ by age, sex, depressive symptoms, baseline cognitive status, or baseline physical functioning status ( Fig. 2 p male female < 75 years ≥75 years MCI normal cognition Supplementary Table 2 In sensitivity analyses, after excluding participants with incident dementia within the first year of follow-up and rematching, sleep medication use was associated with 44% higher risk of a falls hospitalization compared to nonuse (model 2 with adjustment for demographics and lifestyle characteristics: HR: 1.44; 95% CI: 1.27–1.63; Supplementary Table 3 In models exploring associations by medication type, benzodiazepines, non-SSRI and SSRI antidepressants were associated with risk of falls hospitalization in the crude models, but only the association for non-SSRI and SSRI antidepressants remained after adjustment for demographic and lifestyle characteristics (model 3: HR non-SSRI antidepressant users vs. no sleep mediation use: SSRI antidepressant users vs. no sleep mediation use: Supplementary Table 4 Secondary analysis sample participant characteristics are provided in Supplementary Table 5 Table 3 Discussion In this large community-based prospective cohort, we observed a consistent association between late-life sleep medication use and risk of falls documented in hospitalization records. In secondary analyses examining self-reported falls, we observed sleep medication use was associated with a greater risk of reporting a fall in the past 6 months. The observed results remained robust throughout our sensitivity analyses and did not vary across baseline cognitive or physical function status. These data suggest that, independent of indication, use of medications commonly prescribed for sleep may be linked to greater risk of falls. These findings have meaningful clinical implications given the high prevalence of falls, the public health priority of falls prevention, and the continued sleep medication use trends in the US aging population. Previous research supports short and long-term effects of multiple classes of drugs used to treat sleep. 12 15 16 44 11 11 12 45 45 In our study, sleep medication use was consistently associated with risk of falls hospitalization and self-reported falls. Our primary analysis results are consistent in direction and magnitude with a recent study in the Taiwan National Health Insurance Database among 2238 older adults who were hospitalized for a fall and 8645 matched controls. 22 22 46 7 7 7 Cognitive decline and poor physical functioning are two well-documented risk factors for falls among older adults. In our matched sample, sleep medication users were more likely to have MCI and lower physical functioning scores, in addition to several other chronic conditions such as prevalent depressive symptoms, hypertension, diabetes, and CHD. However, the observed association between sleep medication use and falls hospitalization risk persisted after adjustment for these factors. Additionally, when we explored possible effect modification, the association did not significantly vary across the chronic conditions tested (MCI, low physical functioning, or high depressive symptoms), suggesting sleep medication use was associated with greater risk of falls regardless of having these chronic conditions. The association did appear to be slightly stronger among participants with MCI, however, importantly, we still observed an association between sleep medication use and falls risk among individuals with normal cognition at baseline. The association also remained consistent with exclusion of individuals with dementia ascertained in the first year of follow-up. This series of sensitivity analyses suggest the association between sleep medication use and falls hospitalization risk is independent of these important falls risk factors. Our study results support National Institute of Aging recommendations to include medication management as a critical part of falls prevention efforts, even among older adults who may appear lower risk. 14 47 49 In exploratory analysis we evaluated a potential dose-response association between number of medications used and risk of falls. Though our analyses were under-powered, our results suggest participants taking two or more sleep medications were at a greater risk than those taking one or none. These exploratory findings are consistent with findings by Yu et al where participants taking a combination of BZD and Z-drugs or two or more medications had a greater likelihood of hospitalizations related to falls than nonusers or those taking only one medication. 22 50 This study has many strengths, including its large sample size, thorough medication data collection, and identification of falls data from both ARIC hospitalization record surveillance and Medicare claims. Further, the broad definition of sleep medication use includes all medications prescribed that can be used to treat or that effect sleep is a novel contribution to the literature. However, we acknowledge that the various medication classes have distinct pharmacologic profiles that may have differing associations with risk for falls which we were not able to thoroughly assess due to poor precision for analyses of individual medications. The association between sleep medication use and falls risk may also vary based on the frequency and duration of use. However, we do not have information on these medication usage factors, so were unable to incorporate them into the analysis. We also do not have information on the indication of medication use, and therefore confounding by indication may remain despite matching and adjustment. We were unable to account for change in or discontinuation of sleep medication use over the study follow-up. Further, we do not have additional information on sleep health or sleep disorders, either self-report or objective, and therefore are not able to account for poor sleep or sleep disorders. This is a limitation considering the well-documented link between poor sleep and falls risk and the potential for confounding by indication. Additionally, our falls data were restricted to only falls documented in hospitalization records for main analyses, and only falls reported in the last 6 months in secondary analyses. While incident falls were identified through both ARIC hospitalization record surveillance and CMS Medicare claims data, some cases may have been missed, particularly for participants enrolled in Medicare Advantaged plans. Last, our study design was observational, so causal inference is limited. In conclusion, late-life sleep medication use was associated with greater risk of falls in this community-based sample of older adults. This association was independent of cognitive status, physical functioning status, and comorbid conditions, and was present regardless of whether falls were identified through hospitalization records or through self-report. Future studies incorporating comprehensive sleep measures and detailed information on medication dose, frequency, duration of use, and indication are needed to better understand the contribution of sleep medication use toward falls risk in the aging population. Supplementary Material Appendix A. Supplementary material Appendix A. Supporting information Supplementary data associated with this article can be found in the online version at doi: 10.1016/j.sleh.2025.05.009 Acknowledgments The authors thank the staff and participants of the ARIC study for their important contributions. Funding This work was supported by National Heart, Lung, and Blood Institute contracts that supported the Atherosclerosis Risk in Communities Study (contract numbers 75N92022D00001, 75N92022D00002, 75N92022D00003, 75N92022D00004, 75N92022D00005). The ARIC Neurocognitive Study is supported by the National Heart, Lung, and Blood Institute, the National Institute of Neurological Disorders and Stroke, the National Institute of Aging, and the National Institute on Deafness and Other Communication Disorders (grant numbers U01HL096812, U01HL096814, U01HL096899, U01HL096902, and U01HL096917). KMF is supported by National Institute of Aging (grant number K01AG083223). MPP is funded by a National Health and Medical Research Council (NHMRC) of Australia Fellowship (GTN2009264). MPP and JJH are partially supported by National Institute of Aging (grant number R01AG062531). JJH is also supported by South Texas Alzheimer’s Disease Centre (1P30AG066546-01A1) and Endowment from the William Castella family as William Castella Distinguished University Chair for Alzheimer’s Disease Research. PLL was partially supported by K24 HL159246. APS is supported in part by R01AG075883. CWH is supported by K23DK12451. The sponsor did not play a role in the design, analysis, or preparation of this manuscript. Declaration of conflicts of interest Adam Spira received payment for serving as a consultant for Merck, received honoraria from Springer Nature Switzerland AG for guest editing special issues of Current Sleep Medicine Reports, and is a paid consultant to Sequoia Neurovitality and to BellSant, Inc. No other authors have conflicts to disclose. References 1. Pohl P Nordin E Lundquist A Community-dwelling older people with an injurious fall are likely to sustain new injurious falls within 5 years - a prospective long-term follow-up study BMC Geriatr 2014 14 1 120 10.1186/1471-2318-14-120 25407714 PMC4242483 2. Bergen G Stevens MR Burns ER Falls and fall injuries among adults aged ≥65 years — United States, 2014 Morb Mortal Wkly Rep 2016 65 37 993 998 10.1093/geront/gnw074 27656914 3. Moreland B Kakara R Henry A Trends in nonfatal falls and fall-related injuries among adults aged ≥65 years — United States, 2012–2018 MMWR Morb Mortal Wkly Rep 2020 69 27 875 881 10.15585/mmwr.mm6927a5 32644982 PMC7732363 4. Moyer VA Prevention of falls in community-dwelling older adults: U.S. Preventive Services Task Force Recommendation Statement Ann Intern Med 2012 157 197 204 22868837 10.7326/0003-4819-157-3-201208070-00462 5. Min Y Slattum PW Poor sleep and risk of falls in community-dwelling older adults: a systematic review J Appl Gerontol 2018 37 9 1059 1084 10.1177/0733464816681149 28380704 6. Stone KL Ancoli-Israel S Blackwell T Actigraphy-measured sleep characteristics and risk of falls in older women Arch Intern Med 2008 168 16 1768 10.1001/archinte.168.16.1768 18779464 7. Chen T-Y Lee S Buxton OM A greater extent of insomnia symptoms and physician-recommended sleep medication use predict fall risk in community-dwelling older adults Sleep 2017 40 11 10.1093/sleep/zsx142zsx142 29029240 8. Foley DJ Monjan AA Brown SL Sleep complaints among elderly persons: an epidemiologic study of three communities Sleep 1995 18 6 425 432 10.1093/sleep/18.6.425 7481413 9. Kocevska D Lysen TS Dotinga A Sleep characteristics across the lifespan in 1.1 million people from the Netherlands, United Kingdom and United States: a systematic review and meta-analysis Nat Hum Behav 2021 5 1 113 122 10.1038/s41562-020-00965-x 33199855 10. Klink ME Quan SF Kaltenborn WT Lebowitz MD Risk factors associated with complaints of insomnia in a general adult population. Influence of previous complaints of insomnia Arch Intern Med 1992 152 8 1634 1637 1497397 11. Olfson M King M Schoenbaum M Benzodiazepine use in the United States JAMA Psychiatry 2015 72 2 136 10.1001/jamapsychiatry.2014.1763 25517224 12. Bachhuber MA Hennessy S Cunningham CO Starrels JL Increasing benzodiazepine prescriptions and overdose mortality in the United States, 1996–2013 Am J Public Health 2016 106 4 686 688 10.2105/ajph.2016.303061 26890165 PMC4816010 13. Stone KL Blackwell TL Ancoli-Israel S Sleep disturbances and risk of falls in older community-dwelling men: the outcomes of sleep disorders in older men (MrOS Sleep) study J Am Geriatr Soc 2014 62 2 299 305 10.1111/jgs.12649 24428306 PMC3945231 14. Aging TNIo Prevent Falls and Fractures 2021 2017 https://www.nia.nih.gov/health/prevent-falls-and-fractures 15. Leipzig RM Cumming RG Tinetti ME Drugs and falls in older people: a systematic review and meta-analysis: I. Psychotropic drugs J Am Geriatr Soc 1999 47 1 30 39 10.1111/j.1532-5415.1999.tb01898.x 9920227 16. Diaz-Gutierrez MJ Martinez-Cengotitabengoa M Saez de Adana E Relationship between the use of benzodiazepines and falls in older adults: a systematic review Maturitas 2017 101 17 22 10.1016/j.maturitas.2017.04.002 28539164 17. Gray SL Penninx BWJH Blough DK Benzodiazepine use and physical performance in community-dwelling older women J Am Geriatr Soc 2003 51 11 1563 1570 10.1046/j.1532-5415.2003.51502.x 14687385 18. Society TAG American Geriatrics Society 2015 updated beers criteria for potentially inappropriate medication use in older adults J Am Geriatr Soc 2015 63 11 2227 2246 10.1111/jgs.13702 26446832 19. Markota M Rummans TA Bostwick JM Lapid MI Benzodiazepine use in older adults: dangers, management, and alternative therapies Mayo Clin Proc 2016 91 11 1632 1639 10.1016/j.mayocp.2016.07.024 27814838 20. Sogawa R Emoto A Monji A Association of orexin receptor antagonists with falls during hospitalization J Clin Pharm Ther 2022 47 6 809 813 10.1111/jcpt.13619 35229895 21. Woolcott JC Richardson KJ Wiens MO Meta-analysis of the impact of 9 medication classes on falls in elderly persons Arch Intern Med 2009 169 21 1952 1960 19933955 10.1001/archinternmed.2009.357 22. Yu N-W Chen P-J Tsai H-J Association of benzodiazepine and Z-drug use with the risk of hospitalisation for fall-related injuries among older people: a nationwide nested case–control study in Taiwan BMC Geriatr 2017 17 1 140 10.1186/s12877-017-0530-4 28693443 PMC5504671 23. Marcum ZA Perera S Thorpe JM Antidepressant use and recurrent falls in community-dwelling older adults Ann Pharmacother 2016 50 7 525 533 10.1177/1060028016644466 27066988 PMC4892949 24. Full KM Pusalavidyasagar S Palta P Associations of late-life sleep medication use with incident dementia in the atherosclerosis risk in communities study J Gerontol Ser A 2022 78 3 438 446 10.1093/gerona/glac088 PMC9977227 35421897 25. Hicks CW Wang D Daya N The association of peripheral neuropathy detected by monofilament testing with risk of falls and fractures in older adults J Am Geriatr Soc 2023 71 6 1902 1909 10.1111/jgs.18338 36945108 PMC10330924 26. Juraschek SP Daya N Appel LJ Orthostatic hypotension in middle-age and risk of falls Am J Hypertens 2017 30 2 188 195 10.1093/ajh/hpw108 27638848 PMC5225943 27. Voorrips LE Ravelli ACJ Dongelmans PCA A physical activity questionnaire for the elderly Med Sci Sports Exerc 1991 23 974 979 1956274 28. Ainsworth BE Haskell WL Herrmann SD 2011 Compendium of Physical Activities: a second update of codes and MET values Med Sci Sports Exerc 2011 43 8 1575 1581 10.1249/MSS.0b013e31821ece12 21681120 29. Radloff LS The CES-D scale: a self-report depression scale for research in the general population Appl Psychol Meas 1977 1 3 385 401 30. Sonsin-Diaz N Gottesman RF Fracica E Chronic systemic inflammation is associated with symptoms of late-life depression: the ARIC study Am J Geriatr Psychiatry 2020 28 1 87 98 10.1016/j.jagp.2019.05.011 31182350 PMC6868307 31. Takeshita J Masaki K Ahmed I Are depressive symptoms a risk factor for mortality in elderly Japanese American men?: The Honolulu-Asia Aging Study Am J Psychiatry 2002 159 7 1127 1132 10.1176/appi.ajp.159.7.1127 12091190 32. Guralnik JM Simonsick EM Ferrucci L A short physical performance battery assessing lower extremity function: association with self-reported disability and prediction of mortality and nursing home admission J Gerontol 1994 49 2 M85 M94 8126356 10.1093/geronj/49.2.m85 33. Vasunilashorn S Coppin AK Patel KV Use of the short physical performance battery score to predict loss of ability to walk 400 meters: analysis from the InCHIANTI Study J Gerontol Ser A Biol Sci Med Sci 2009 64A 2 223 229 10.1093/gerona/gln022 PMC2655026 19182232 34. Knopman DS Ryberg S A verbal memory test with high predictive accuracy for dementia of the Alzheimer type Arch Neurol 1989 46 2 141 145 2916953 10.1001/archneur.1989.00520380041011 35. Spreen O Neurosensory Center Comprehensive Examination for Aphasia Neuropsychological Laboratory 1977 36. Wechsler D Wechsler Adult Intelligence Scale 3rd San Antonio, TX Pearson 1997 37. Wechsler D Wechsler Memory Scale 3rd San Antonio, TX Pearson 1997 38. Reitan RM Validity of the Trail Making Test as an indicator of organic brain damage Percept Mot Skills 1958 8 3 271 276 39. Kaplan E Goodglass H Weintraub S The Boston Naming Test 2nd Philadelphia, PA Lippincott Williams & Wilkins 2000 40. Benton AL Differential behavioral effects in frontal lobe disease Neuropsychologia 1968 6 1 53 60 41. Folstein MF Folstein SE McHugh PR “Mini-mental state”: a practical method for grading the cognitive state of patients for the clinician J Psychiatr Res 1975 12 3 189 198 1202204 10.1016/0022-3956(75)90026-6 42. Knopman DS Gottesman RF Sharrett AR Mild cognitive impairment and dementia prevalence: the Atherosclerosis Risk in Communities Neurocognitive Study Alzheimer’s Dement Diagn Assess Dis Monit 2016 2 1 1 11 10.1016/j.dadm.2015.12.002 PMC4772876 26949733 43. Ho D Imai K King G Stuart EA MatchIt: nonparametric preprocessing for parametric causal inference J Stat Softw 2011 42 8 1 28 10.18637/jss.v042.i08 44. Sivertsen B Salo P Pentti J Use of sleep medications and risk of cancer: a matched case-control study Sleep Med 2015 16 12 1552 1555 10.1016/j.sleep.2015.05.003 26116466 45. Robbins R DiClemente RJ Troxel AB Sleep medication use and incident dementia in a nationally representative sample of older adults in the US Sleep Med 2021 79 183 189 10.1016/j.sleep.2020.11.004 33248901 PMC7925354 46. Nguyen K Watanabe J Association between sleep medications and falls and fall-related worries in community-dwelling older adults in the United States J Contemp Pharm Pract 2019 66 3 23 32 10.37901/jcphp18-00022 47. Qaseem A Kansagara D Forciea MA Management of chronic insomnia disorder in adults: a clinical practice guideline from the American College of Physicians Ann Intern Med 2016 165 2 125 133 10.7326/m15-2175%m27136449 27136449 48. Mitchell MD Gehrman P Perlis M Umscheid CA Comparative effectiveness of cognitive behavioral therapy for insomnia: a systematic review BMC Fam Pract 2012 13 1 40 10.1186/1471-2296-13-40 22631616 PMC3481424 49. Chung K-F Lee C-T Yeung W-F Sleep hygiene education as a treatment of insomnia: a systematic review and meta-analysis Fam Pract 2017 35 4 365 375 10.1093/fampra/cmx122 29194467 50. Wastesson JW Morin L Tan ECK Johnell K An update on the clinical consequences of polypharmacy in older adults: a narrative review Expert Opin Drug Saf 2018 17 12 1185 1196 10.1080/14740338.2018.1546841 30540223 Fig. 1. Adjusted cumulative incidence of falls by sleep medication status. Model adjusted for age, sex, race-center and education in the Atherosclerosis Risk in Communities study Fig. 2. Stratified associations of sleep medication use and risk of falls. Model adjusted for age, sex, race-center, education, smoking status, alcohol consumption, physical activity, body mass index, depressive symptoms, systolic blood pressure, antihypertensive medications, prevalent diabetes, prevalent coronary heart disease, cognitive impairment, and physical function score. p p Table 1 Matched sample characteristics by late-life sleep medication use, ARIC study (N = 4794) a Matched nonuse (n = 3196) Sleep medication use (n = 1598) Standardized mean difference  Demographics Age, y 75.5 ± 5.2 75.5 ± 5.2 0.01 Age ≥75 y, n (%) 1632 (51.1) 820 (51.3) Female sex, n (%) 2252 (70.5) 1126 (70.5) 0.00 White, n (%) 2527 (79.1) 1352 (84.6) −0.04 Education, n (%) −0.002 Basic 474 (14.8) 221 (13.8) High school graduate 1381 (43.2) 725 (45.4) Some college or more 13,412 (42.07) 652 (40.8) Lifestyle characteristics Current smoker, n (%) 189 (5.9) 119 (7.4) Current alcohol consumption, n (%) 1538 (48.1) 747 (46.7) Physical activity, MET min/week 2.6 ± 0.8 2.5 ± 0.8 BMI kg/m 2 28.8 ± 6.0 28.8 ± 5.9 Health status characteristics High depressive symptoms (CES-D ≥9), n (%) 168 (5.3) 185 (11.6) Systolic blood pressure, mmHg 131 ± 18.7 129 ± 18.1 Antihypertensive medication use, n (%) 2325 (72.7) 1256 (78.6) Prevalent diabetes, n (%) 845 (26.4) 478 (29.9) Prevalent CHD, n (%) 452 (14.1) 273 (17.1) Mild cognitive impairment, n (%) 660 (20.7) 390 (24.4) SPPB Score 9.4 ± 2.5 8.9 ± 2.6 Sleep medications Barbiturates, n (%) 20 (1.2) Benzodiazepine derivatives, n (%) 535 (33.5) Non-SSRI antidepressants, n (%) 422 (26.4) SSRI antidepressants, n (%) 584 (36.5) Hypnotics, n (%) 263 (16.4) Z-drugs, n (%) 178 (11.1) Abbreviations: ARIC, Atherosclerosis Risk in Communities study; BMI, body mass index; CES-D, Center for Epidemiologic Studies depression scale; CHD, coronary heart disease; MET, metabolic equivalent of task; SPPB, Short Physical Performance Battery; SSRI, selective serotonin reuptake inhibitors. a Data presented as mean ± SD unless otherwise specified. Table 2 Late-life sleep medication use and risk of falls: ARIC study (N = 4794) a Matched nonuse (n = 3196) Sleep medication use (n = 1598)  Documented falls, n 717 483  Cumulative incidence (95% CI)  b  22.4% (21.0–23.9)  30.2% (28.0–32.5)  Incidence rate (95% CI)  b  3.76 (3.49–4.04)  5.44 (4.97–5.95) Model c Hazard ratio (95% CIs) Model 1 (Reference)  1.45 (1.29, 1.63) Model 2 (Reference)  1.43 (1.27, 1.62) Model 3 (Reference)  1.33 (1.18, 1.51) Bold type indicates p Abbreviation: ARIC, Atherosclerosis Risk in Communities study. a Matched sample 2:1. b Incidence rate is per 100 person-years. c Model adjustments: model 1: crude unadjusted; model 2: adjusted for age, sex, race-center, education, smoking status, alcohol consumption, physical activity, and body mass index; model 3: model 2 + adjustment for depressive symptoms, systolic blood pressure, antihypertensive medications, prevalent diabetes, prevalent coronary heart disease, mild cognitive impairment, and physical functioning score. Table 3 Late-life sleep medication use (2011–2013) and self-reported fall (2016): ARIC study (N = 3804) a Matched nonuse (n = 2536) Sleep medication use (n = 1268)  Self-reported falls, n 534 371 Model b Odds ratio (95% confidence intervals) Model 1 (Reference)  1.56 (1.32, 1.83) Model 2 (Reference)  1.55 (1.31, 1.84) Model 3 (Reference)  1.41 (1.17, 1.68) Bold type indicates p Abbreviation: ARIC, Atherosclerosis Risk in Communities study. a Matched sample 2:1. b Model adjustments: model 1: crude unadjusted; model 2: adjusted for smoking status, alcohol consumption, physical activity, and body mass index; model 3: model 2 + adjustment for depressive symptoms, systolic blood pressure, antihypertensive medications, prevalent diabetes, prevalent coronary heart disease, mild cognitive impairment, and physical functioning score. ",
  "metadata": {
    "Title of this paper": "An update on the clinical consequences of polypharmacy in older adults: a narrative review",
    "Journal it was published in:": "Sleep health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477716/"
  }
}