{
  "title": "Paper_174",
  "abstract": "ACS Appl Mater Interfaces ACS Appl Mater Interfaces 319 nihpa ACS applied materials & interfaces 1944-8244 1944-8252 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12490465 PMC12490465.1 12490465 12490465 NIHMS2111989 34752058 10.1021/acsami.1c16383 NIHMS2111989 NIHPA2111989 1 Article Synthesis and Preliminary Biological Assessment of Carborane-Loaded Theranostic Nanoparticles to Target Prostate-Specific Membrane Antigen http://orcid.org/0000-0003-3558-3712 Meher Niranjan Department of Radiology and Biomedical Imaging, University of California, San Francisco, San Francisco, California 94143, United States Seo Kyounghee Department of Neurological Surgery, University of California, San Francisco, San Francisco, California 94143, United States Wang Sinan Department of Radiology and Biomedical Imaging, University of California, San Francisco, San Francisco, California 94143, United States http://orcid.org/0000-0003-1249-1081 Bidkar Anil P. Department of Radiology and Biomedical Imaging, University of California, San Francisco, San Francisco, California 94143, United States Fogarty Miko Department of Neurological Surgery, University of California, San Francisco, San Francisco, California 94143, United States Dhrona Suchi Department of Radiology and Biomedical Imaging, University of California, San Francisco, San Francisco, California 94143, United States http://orcid.org/0000-0001-7733-9094 Huang Xiao Department of Bioengineering and Therapeutic Sciences, University of California, San Francisco, San Francisco, California 94158, United States Tang Ryan Department of Radiology and Biomedical Imaging, University of California, San Francisco, San Francisco, California 94143, United States Blaha Charles Department of Bioengineering and Therapeutic Sciences, University of California, San Francisco, San Francisco, California 94158, United States http://orcid.org/0000-0003-4947-1316 Evans Michael J. Department of Radiology and Biomedical Imaging, University of California, San Francisco, San Francisco, California 94143, United States; Helen Diller Family Comprehensive Cancer Center, University of California San Francisco, San Francisco, California 94143-0981, United States; Department of Pharmaceutical Chemistry, University of California, San Francisco, San Francisco, California 94158-2517, United States Raleigh David R. Department of Neurological Surgery and Department of Radiation Oncology, University of California, San Francisco, San Francisco, California 94143, United States http://orcid.org/0000-0003-3182-5366 Jun Young-Wook Helen Diller Family Comprehensive Cancer Center, University of California San Francisco, San Francisco, California 94143-0981, United States; Department of Pharmaceutical Chemistry, University of California, San Francisco, San Francisco, California 94158-2517, United States; Department of Otolaryngology, University of California, San Francisco, San Francisco, California 94158, United States http://orcid.org/0000-0003-2849-0841 VanBrocklin Henry F. Department of Radiology and Biomedical Imaging, University of California, San Francisco, San Francisco, California 94143, United States; Helen Diller Family Comprehensive Cancer Center, University of California San Francisco, San Francisco, California 94143-0981, United States http://orcid.org/0000-0003-3409-9208 Desai Tejal A. Department of Bioengineering and Therapeutic Sciences, University of California, San Francisco, San Francisco, California 94158, United States http://orcid.org/0000-0002-1095-046X Wilson David M. Department of Radiology and Biomedical Imaging, University of California, San Francisco, San Francisco, California 94143, United States; Helen Diller Family Comprehensive Cancer Center, University of California San Francisco, San Francisco, California 94143-0981, United States Ozawa Tomoko Department of Neurological Surgery, University of California, San Francisco, San Francisco, California 94143, United States http://orcid.org/0000-0002-8694-1199 Flavell Robert R. Department of Radiology and Biomedical Imaging, University of California, San Francisco, San Francisco, California 94143, United States; Helen Diller Family Comprehensive Cancer Center, University of California San Francisco, San Francisco, California 94143-0981, United States; Department of Pharmaceutical Chemistry, University of California, San Francisco, San Francisco, California 94158-2517, United States Corresponding Author Robert R. Flavell Department of Radiology and Biomedical Imaging, University of California, San Francisco, San Francisco, California 94143, United States; Helen Diller Family Comprehensive Cancer Center, University of California San Francisco, San Francisco, California 94143-0981, United States; Department of Pharmaceutical Chemistry, University of California, San Francisco, San Francisco, California 94158-2517, United States; robert.flavell@ucsf.edu The authors declare no competing financial interest. 24 11 2021 09 11 2021 13 46 498135 54739 54752 26 09 2025 02 10 2025 03 10 2025 03 10 2025 Boron neutron capture therapy (BNCT) is an encouraging therapeutic modality for cancer treatment. Prostate-specific membrane antigen (PSMA) is a cell membrane protein that is abundantly overexpressed in prostate cancer and can be targeted with radioligand therapies to stimulate clinical responses in patients. In principle, a spatially targeted neutron beam together with specifically targeted PSMA ligands could enable prostate cancer-targeted BNCT. Thus, we developed and tested PSMA-targeted poly(lactide- co b b 89 in vitro in vivo in vitro 89 89 in vivo b in vivo Graphical Abstract  prostate-specific membrane antigen (PSMA) boron neutron capture therapy (BNCT) nanoparticles amphiphilic block copolymer positron emission tomography (PET) imaging pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Synthesis and Preliminary Biological Assessment of Carborane-Loaded Theranostic Nanoparticles to Target Prostate-Specific Membrane Antigen",
    "Journal it was published in:": "ACS applied materials & interfaces",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490465/"
  }
}