{
  "title": "Paper_479",
  "abstract": "pmc Nat Commun Nat Commun 2873 ncomms Nature Communications 2041-1723 Nature Publishing Group PMC12484684 PMC12484684.1 12484684 12484684 41028732 10.1038/s41467-025-64445-4 64445 1 Perspective The interplay of DNA damage, epigenetics and tumour heterogeneity in driving cancer cell fitness http://orcid.org/0009-0005-7024-0733 Rouault Celia D. 1 2 http://orcid.org/0000-0002-0286-1299 Charafe-Jauffret Emmanuelle charafee@ipc.unicancer.fr 1 http://orcid.org/0000-0002-7477-3837 Ginestier Christophe christophe.ginestier@inserm.fr 1 1 https://ror.org/0494jpz02 grid.463833.9 0000 0004 0572 0656 CRCM, Inserm, CNRS, Institut Paoli-Calmettes, Aix-Marseille Univ, Epithelial Stem Cells and Cancer Lab, Equipe labellisée LIGUE contre le cancer, 2 https://ror.org/01yc7t268 grid.4367.6 0000 0004 1936 9350 Division of Oncology, Department of Medicine, Washington University in St. Louis, 30 9 2025 2025 16 478256 8733 25 3 2025 17 9 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Intra-tumor heterogeneity is a primary cause of therapeutic failure, driving tumor progression. Within tumors, diverse cell states coexist, maintained by a specific chromatin landscape that influences various cell functions, including cancer stemness. Among factors that induce chromatin changes affecting cell state fitness, DNA damage and its repair have emerged as significant contributors. This perspective examines recent advances that elucidate the interplay between DNA repair, epigenome, and cell plasticity. We discuss how epigenome affects DNA repair and, conversely, how DNA repair-induced chromatin changes influence cell plasticity. Finally, we discuss emerging concepts and highlight the therapeutic implications of these interconnected mechanisms. Cancer cell plasticity is often linked to treatment failure. Here, the authors discuss the role of epigenome in DNA repair and, how DNA repair-induced chromatin changes influence cancer cell plasticity. Subject terms Tumour heterogeneity Cancer stem cells Mechanisms of disease Imprinting DNA damage response Ligue Nationale Contre le Cancer pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Intratumor heterogeneity (ITH) is driven by (epi)genomic remodeling and microenvironmental changes, and present therapeutic resistance hurdles that must be overcome to optimize cancer treatments. Over the past decade, technological advances have enabled the exploration of ITH at single-cell resolution, revealing a multitude of functional genetic and non-genetic cell states within the same tumor 1 3 4 6 7 8 11 9 12 From a fundamental perspective, each cell state may reflect a distinct configuration of gene regulatory networks (GRNs), which emerge from the complex interplay among chromatin structure, transcription factors, and gene expression 13 14 15 16 In this perspective, we discuss recent evidence for the interplay between DNA repair, the epigenetic landscape, and cancer cell plasticity. We discuss how the epigenome can impact the DNA damage repair response and, conversely, how DNA repair induces chromatin mis-restoration with direct effects on ITH. Finally, we highlight the promising therapeutic implications that could result from elucidating this coordinated process. Interplay between DNA damage repair and epigenetic landscapes Accumulating evidences suggest that DNA damage and the subsequent activation of DNA repair machinery depends on the chromatin structure that specify cell identity. Here, we have summarized studies that relate the impact of cell identity on DNA damage mapping and the response to these damages. Influence of cell identity on the spatial mapping of DNA damage Cell identity is determined by specific (epi)genetic landscape, which governs the activity of a given gene regulatory network (GRN). As a result, the identity of a cell has a unique genomic DNA packaging that restricts the localization of DNA damage. Indeed, genome-wide mapping of DSB, using BLESS or DSB Capture methodologies, demonstrates a relationship between genomic instability and nucleosome density. DSB are enriched in regions bearing epigenetic marks of transcriptionally active genes (H3K4me2/3), enhancer loci (H3K27ac, H3K9ac, and H3K4me1), regions rich in structural proteins (such as CCCTC-binding factor (CTCF)), or with motifs from several transcription factors (e.g. FOS, JUN, P53), and RNA polymerase II 17 20 1A 17 21 24 25 26 27 Fig. 1 From breaks to restoration: the of chromatin architecture in the DNA Damage Response. A B A B C https://BioRender.com/5je9jd0 Until now, the concept of breakome is mainly explained by transcription-induced DNA breaks but we cannot exclude that some DNA damage hotspots are not related to transcription initiation but still represent breaks consistently occurring in different cell states. It may be caused by exogenous factors that has a strong preference for specific chromatin structures. In line with this hypothesis, the use of clickable cisplatin derivatives revealed a unique genomic distribution of induced DNA-Pt lesions according to chromatin structure 28 Cell identity guide the DNA repair pathway choice In addition to its influence on DNA damage mapping, cell identity also has a direct impact on the DNA repair response. The type of DNA repair pathway activated in response to DNA lesions has always been considered to be the result of the type of damage and the phase of the cell cycle in which the injured cell is located. However, over the past few years, several studies have highlighted the influence of cell state on the DNA damage response and repair capacity. First, several regulators that maintain cell identity present a dual role with the capacity to activate specific DDR pathways. The anticlastogenic function of these cell-fate regulators directly linked cell identity to a singular DNA damage response. Second, the chromatin structure itself appears to have an impact on DNA repair pathway activation. These both elements will strongly influence the ability of each cancer cell state to maintain genome integrity, respond to genotoxic agents, and will impact tumor adaptability to treatment. Dual role of cell identity safe guarders Among the various regulators of cell identity and the DNA damage response, the Polycomb group complexes (PRC1 and PRC2) play essential roles. Their synergistic activity leads to the formation of transcriptionally repressive Polycomb domains, characterized by compacted chromatin enriched in the histone modifications H2AK119ub1 (catalyzed by PRC1) and H3K27me3 (catalyzed by PRC2). Initial models proposed a hierarchical recruitment mechanism, where PRC2 is first recruited to target loci to deposit H3K27me3. This mark is then recognized by canonical PRC1 complexes via chromodomain-containing subunits, facilitating H2AK119ub1 deposition and further chromatin compaction 29 31 32 33 34 37 35 38 30 2 39 40 41 43 2 44 45 46 47 Fig. 2 Dual role of cell identity safe-guarders. (line 1) To control cell identity, BMI1 (a polycomb repressor complex 1 (PRC1) protein) increase monoubiquitinylation of H2AK119 to inhibit the transcription of differentiation-associated genes. To activate DNA repair, BMI1 ubiquitinylate histones next to DSB. It leads to local transcription inhibition and recruitment of (C-terminal binding protein) interacting protein (CtIP) to promote DNA end resection and homologous recombination (HR). (line2) To control cell identity, EZH2 (a PRC2 protein) increase H3K27me3 marks to inhibit the transcription of differentiation-associated genes. To activate DNA repair EZH2 promote HR though the downregulation of Schlafen11 gene expression (SLFN11, an DNA/RNA helicase), and increase H3K27me3 marks on histones neighboring the DSB to induce local transcription silencing. Moreover, EZH2 is also known to inhibit REV7, hence favoring the HR repair pathway choice. (line 3) To control cell identity, BRD4 (Bromodomain-containing protein 4) regulates the transcription of genes-related to stemness by promoting enhancer-promoter interaction. To activate DNA repair, BRD4 interact with BRG1 to increase histone eviction and bind to histones next to DSB favoring CtIP recruitment and HR repair activity. In addition, BARD4 binds super-enhancers with MED1 and TEAD, to promote the recruitment of Rad51 and DNA repair on high transcript loci (line 4) To control cell identity, ZEB1 (Zinc finger E-box binding homeobox 1) play as a major regulator of the epithelial-to-mesenchymal transition (EMT) program. To activate DNA repair, ZEB1 promote HR and inhibit Alt-EJ by regulating the gene expression of ATM and polθ. Moreover, ATM phosphorylation enhance ZEB1 interaction with USP7 and CHK1 to promote HR pathway activity. Created in BioRender. Mitoyan, L. (2025) https://BioRender.com/5je9jd0 More recently, it was demonstrated that other epigenetic regulators such as the BET protein BRD4 known to bind to active enhancers and control cell identity gene induction 48 2 line3 49 20 This dual role of PRC1/2 complex or BRD4 in conferring efficient DNA damage response to specific cancer cell states is not restricted to epigenetic effectors. The Epithelial-to-Mesenchymal transition (EMT) transcription factor ZEB1 is a critical regulator of cancer cell plasticity 50 2 line4 51 52 51 Cell state-dependent chromatin structure and DNA repair Beyond the dual role of certain cell identity safe-guarders to lineage-restrict DNA damage response and repair, they also guarantee a unique chromatin folding. This cell state-dependent chromatin structure will also constrain DNA repair. Indeed, it has been demonstrated that repair proteins spread according to chromatin topological features (Fig. 1B 19 53 54 55 56 57 58 61 62 63 64 63 65 66 62 67 68 14 69 70 9 71 40 72 Overall, these studies highlight how elucidating the molecular bases of DNA repair in the context of chromatin and cell identity can help unravel the non-genetic mechanisms of therapeutic resistance in cancer. Chromatin maintenance after DNA repair While the chromatin landscape defines cell states with different susceptibility to DNA damage accumulation and with specific DNA repair pathways activation, the DNA repair process itself is not neutral on chromatin structure. Instead, it induces chromatin remodeling. Similarly, to replication, DNA repair processes provoke substantial epigenetic modification, due to chromatin disassembly needed to increase access to repair protein complex to the DNA lesion 73 74 75 73 1C 76 77 80 81 82 74 Nevertheless, in a malignant context with substantial stalled replication fork associated with replicative stress, mis-restoration of epigenetic marks after DNA replication and repair might not be a rare event, but a common failure. The loss of initial chromatin architecture could lead to cell plasticity and participate to shape the non-genetic tumor heterogeneity. Epigenetic damage scar challenge cell identity While DNA repair pathways typically restore the DNA sequence to its original state before damage occurred, the accuracy of chromatin restoration remains unclear. In several context, including cancer or aging, restoration of the epigenetic landscape after DNA damage is not always allowed leading to the generation of “epigenetic damage scar” 15 83 84 88 86 89 76 77 90 91 91 A direct consequence of these epigenetic scars linked to DNA lesions is an impact on the transcriptional activity of neighboring genes. It was first demonstrated in cancer cells using the reporter construct DRGFP (Direct-Repeat GFP) to monitor epigenetic modifications following DSB repair by HR in the GFP locus. Even though the damaged GFP locus was properly repaired, epigenetic scars, including DNA methylation and H3K9me2/3 modifications, appeared and generate cells with different but heritable GFP expression levels 88 Ppo Ppo 92 93 94 95 96 Mechanistically this post-repair chromatin fatigue may be explain by the three-dimensional chromatin structure that is established by hierarchical folding at multiple scales starting from small functional loops, followed by larger topologically associated domains (TADs) 97 98 93 99 The inheritance of these epigenetic damage scars is surprising knowing the complex mechanisms that drive post-mitotic chromatin reconfiguration to maintain chromatin integrity and eliminate chromatin alterations to prevent the spread to the progeny 100 101 103 104 60 Therapeutic opportunities The intricate relationship between DNA damage repair and cell identity offers novel therapeutic opportunities to tackle adaptive mechanisms fueling the dynamism integral to tumor heterogeneity. Several studies indicate that CSCs have developed a robust replicative stress response (RSR) to reduce and tolerate replicative stress observed in neoplasia 105 25 106 40 107 108 1 Table 1 Registered clinical trials of drugs targeting replicative stress response machinery in cancers Target Drug Clinical trial ID (refs) Stage Cancer Combination ATR M6620 (VX-970) NCT03641547 NCT02157792 NCT02723864 Phase I Solid Tumors with convential chemotherapies or with PARPi and cisplatin NCT02487095 Phase I/II Small Cell Lung Cancers with Topotecan NCT03896503 NCT02595892 Phase II Small Cell Lung Cancers/ Ovarian or Fallopian Cancers with Topotecan or Gemcitabine VX-970 NCT02723864 Phase I Refractory Solid Tumors with PARPi M4344 NCT04655183 Phase I/II Breast Cancers (with DDR mutations) with PARPi M1774 NCT05986071 Phase I/II Breast Cancers (HR+ and HER2-) with Fulverstrant AZD6738(Ceralasctib) NCT02264678 NCT03022409 NCT02223923 NCT03328273 Phase I Solid Tumors and Chronic Lymphocytic Leukemia with Acalabrutinib or PARPi or PARPI with Carboplatin NCT03682289 NCT03787680 NCT04065269 NCT03330847 Phase II Solid Tumors with PARPi or WEE1i and PARPi BAY1895344 (Elimusertib) NCT04535401 NCT04491942 NCT03188965 NCT04576091 NCT04616534 NCT04267939 Phase I Solid Tumors with convential chemotherapy or pembrolizumab (anti-PD-1) or PARPi RP-3500 (Camonsertib) NCT04972110 NCT04497116 Phase I/II Solid Tumors with PARPi M1774 (tuvusertib) NCT05396833 NCT06337630 Phase I Solid tumors with ATMi (Lartesertib) or Avelumab (anti-PD-L1) or Topo1i (PLX038) NCT05882734 Phase I/II Non-Small Cell Lung Cancers with Cemiplimab (anti-PD-1) NCT06424717 NCT05947500 NCT06518564 Phase II Urothelial Cancers/Merkel Cell Skin Cancers/ Endometrial Cancers (ARID1A mutated) with Avelumab (anti-PD-L1) NCT06433219 Phase II Ovarian Cancers with ATMi (M4076, artesertib) and PARPi berzosertib NCT05246111 Phase I Solid Tumors with Topotecan NCT04802174 Phase I/II Small Cell Lung Cancers/ Neuroendocrine Cancers with Lurbinectedin ATG-018 NCT05338346 PhaseI Solid Tumors and Hematological Malignancies M4344 NCT04149145 PhaseI Ovarian cancers with PARPi ART0380 NCT04657068 Phase I/II Solid Tumors with Gemcitabine and Irinotecan IMP9064 NCT05269316 Phase I/II Solid Tumors ATM AZD0156 NCT02588105 131 132 Phase I Solid Tumors with conventional chemotherapies or with PARPi WSD0628 NCT05917145 133 Phase I Brain Tumors AZD1390 NCT05182905 Phase 0/Ib Glioma NCT04550104 NCT05678010 NCT05116254 NCT03423628 NCT06894979 Phase I Solid Tumors with Radiotherapy or Radiotherapy and Durvlaumab M3541 NCT03225105 134 Phase I Solid Tumors with Radiotherapy M4076 NCT04882917 135 Phase I Solid Tumors KU-60019 NCT03571438 Renal Tumors with CK2i AZD0156 NCT02588105 Phase I Solid Tumors with PARPi or Irinotecan or Fluoruoracil or Folinic acid CHK1 SCH900776 NCT01870596 Phase II Acute Myeloid Leukemia with Cytarabine LY2880070 NCT05275426 Phase II Ewing sarcoma/Desmoplastic Small Round Cell Tumors with Gemcitamine LY26066368 (Prexasertib) NCT04023669 NCT02808650 NCT03495323 NCT03735446 NCT03057145 Phase I Solid Tumors/Acute Myeloid Leukemia with conventional chemotherapies or PARPi NCT02203513 NCT02873975 Phase II Solid Tumors PEP07 NCT05983523 NCT05659732 Phase I Solid Tumors SRA737 NCT02797964 NCT02797977 Phase I/II Solid Tumors with conventional chemotherapies Target Drug Clinical trial ID (refs) Stage Cancer Combination PolQ ART4245 NCT04991480 Phase I/II Solid Tumors with PARPi GSK4524101 NCT06077877 Phase I/II Solid Tumors with PARPi ART6043 NCT05898399 Phase I/II Solid Tumors with PARPi Novobiocin NCT05687110 Phase I Solid Tumors (with DDR mutations) ART4215 NCT04991480 Phase I/II Breast cancers (BRCA-deficient) with PARPi Rad51 CYT-0851 NCT03997968 136 Phase I/II B-cell malignancies and Solid Tumors with conventional chemotherapies or Rituximab and bendamustine Wee1 ZN-c3 (Azenosertib) NCT05368506 Phase I Breast Cancers (TNBCs) and Ovarian Cancers NCT05198804 NCT05682170 Phase I/II Ovarian cancers (Platinum resistant)/AML with PARPi or BCL-2i NCT06015659 NCT04814108 NCT05128825 Phase II Pancreatic Cancers/Uterine serous carcinoma/Ovarian cancers (Platinum resistant), Fallopian Tube or Primary Peritoneal Cancers with Gemcitabine AZD1775 (MK-1775, Adavosertib) NCT02617277 NCT01748825 NCT00648648 NCT02508246 NCT02791919 NCT03028766 NCT02381548 NCT03345784 Phase I Solid Tumors and Acute Myeloid Leukemia with conventional chemotherapies or Belinostat NCT02194829 Phase I/II Pancreatic Cancers with Paclitaxel or Gemcitabine NCT02037230 Phase I/II Pancreatic Cancers with Gemcitabine and Radiotherapy NCT02906059 Phase Ib Cololorectal Cancers with Irinotecan NCT01164995 NCT02272790 NCT02101775 NCT01357161 NCT02448329 NCT02196168 NCT02666950 NCT03253679 NCT03012477 NCT03668340 NCT03718143 137 138 Phase II Solid Tumors and Acute Myeloid Leukemia with conventional chemotherapies SY-4835 NCT05291182 Phase I Solid Tumors DNA-PK AZD7648 NCT03907969 139 Phase I/IIa Solid Tumors with doxorubicin CC-115 NCT01353625 140 Phase I Solid Tumors and Hematological Malignancies with mTORi BY101298 NCT06524804 Phase Ib/II Solid Tumors with Radiotherapy M3814 (peposertib) NCT02316197 NCT05711615 NCT05687136 Phase I Solid Tumors and Chronic Lymphocytic Leukemia with doxorubicin or ATRi NCT02516813 Phase Ia/Ib Solid Tumors with Radiotherapy NCT04172532 NCT04071236 Phase I/II Pancreatic cancers/Prostate Cancers with Radiotherapy In addition to super-active HR system, other targetable DNA repair mechanisms may be selectively active in cancer stem cells (CSCs), such as templated-sequence insertions (TSIs)—a form of DNA double-strand break (DSB) repair that depends on hTERT activity 109 110 109 111 112 113 114 115 116 117 118 120 121 122 123 124 125 126 127 128 129 130 In this context, we can propose that differentiation therapy is a new opportunity to induce a chemical HRDness, due to the shift from a HR-competent state to a state presenting poor HR functionality. Beyond the various hurdles that must be overcome to introduce DNA damage response inhibitors (DDRi) into clinical practice—such as the identification of predictive biomarkers of response and the frequent emergence of acquired resistance due to DDR restoration—one promising strategy to enhance the efficacy of antitumor DDR therapies is to leverage the interplay between epigenetics and DDR, tailoring treatment to the specific cell state. Publisher’s note Acknowledgements We thank Inserm, Institut Paoli-Calmettes, LIGUE Contre le Cancer (Label 2021), and Canceropole PACA for their support. C.D.R. has been supported by a fellowship from the “Ligue National Contre le Cancer”. Author contributions C.D.R., E.C.J., and C.G. prepared the manuscript. Peer review Peer review information Nature Communications Competing interests The authors declare no competing interests. References 1. Tirosh I Suvà ML Deciphering human tumor biology by single-cell expression profiling Annu. Rev. Cancer Biol. 2019 3 151 166 10.1146/annurev-cancerbio-030518-055609 Tirosh, I. & Suvà, M. L. Deciphering human tumor biology by single-cell expression profiling. Annu. Rev. Cancer Biol. 3 2. Gonzalez Castro LN Tirosh I Suvà ML Decoding cancer biology one cell at a time Cancer Discov. 2021 11 960 970 10.1158/2159-8290.CD-20-1376 33811126 PMC8030694 Gonzalez Castro, L. N., Tirosh, I. & Suvà, M. L. Decoding cancer biology one cell at a time. Cancer Discov. 11 33811126 10.1158/2159-8290.CD-20-1376 PMC8030694 3. Tirosh I Stochastic transitions as a major source of cancer heterogeneity Nat. Rev. Genet 2022 23 582 583 10.1038/s41576-022-00508-2 35624136 Tirosh, I. Stochastic transitions as a major source of cancer heterogeneity. Nat. Rev. Genet 23 35624136 10.1038/s41576-022-00508-2 4. Ginestier C ALDH1 Is a marker of normal and malignant human mammary stem cells and a predictor of poor clinical outcome Cell Stem Cell 2007 1 555 567 10.1016/j.stem.2007.08.014 18371393 PMC2423808 Ginestier, C. et al. ALDH1 Is a marker of normal and malignant human mammary stem cells and a predictor of poor clinical outcome. Cell Stem Cell 1 18371393 10.1016/j.stem.2007.08.014 PMC2423808 5. Eppert K Stem cell gene expression programs influence clinical outcome in human leukemia Nat. Med. 2011 17 1086 1093 10.1038/nm.2415 21873988 Eppert, K. et al. Stem cell gene expression programs influence clinical outcome in human leukemia. Nat. Med. 17 21873988 10.1038/nm.2415 6. Merlos-Suárez A The intestinal stem cell signature identifies colorectal cancer stem cells and predicts disease relapse Cell Stem Cell 2011 8 511 524 10.1016/j.stem.2011.02.020 21419747 Merlos-Suárez, A. et al. The intestinal stem cell signature identifies colorectal cancer stem cells and predicts disease relapse. Cell Stem Cell 8 21419747 10.1016/j.stem.2011.02.020 7. Gargiulo G Serresi M Marine J-C Cell states in cancer: drivers, passengers, and trailers Cancer Discov. 2024 14 610 614 10.1158/2159-8290.CD-23-1510 38571419 Gargiulo, G., Serresi, M. & Marine, J.-C. Cell states in cancer: drivers, passengers, and trailers. Cancer Discov. 14 38571419 10.1158/2159-8290.CD-23-1510 8. Risom T Differentiation-state plasticity is a targetable resistance mechanism in basal-like breast cancer Nat. Commun. 2018 9 3815 10.1038/s41467-018-05729-w 30232459 PMC6145927 Risom, T. et al. Differentiation-state plasticity is a targetable resistance mechanism in basal-like breast cancer. Nat. Commun. 9 30232459 10.1038/s41467-018-05729-w PMC6145927 9. Marsolier J H3K27me3 conditions chemotolerance in triple-negative breast cancer Nat. Genet 2022 54 459 468 10.1038/s41588-022-01047-6 35410383 PMC7612638 Marsolier, J. et al. H3K27me3 conditions chemotolerance in triple-negative breast cancer. Nat. Genet 54 35410383 10.1038/s41588-022-01047-6 PMC7612638 10. Mani, N., Daiya, A., Chowdhury, R., Mukherjee, S. & Chowdhury, S. Chapter seven - epigenetic adaptations in drug-tolerant tumor cells. In Advances in Cancer Research 10.1016/bs.acr.2022.12.006 36990535 11. Moore, P. C., Henderson, K. W. & Classon, M. Chapter One - The epigenome and the many facets of cancer drug tolerance. In Advances in Cancer Research 10.1016/bs.acr.2022.12.002 36990531 12. Laisné M Lupien M Vallot C Epigenomic heterogeneity as a source of tumour evolution Nat. Rev. Cancer 2025 25 7 26 10.1038/s41568-024-00757-9 39414948 Laisné, M., Lupien, M. & Vallot, C. Epigenomic heterogeneity as a source of tumour evolution. Nat. Rev. Cancer 25 39414948 10.1038/s41568-024-00757-9 13. Huang S Genetic and non-genetic instability in tumor progression: link between the fitness landscape and the epigenetic landscape of cancer cells Cancer Metastasis Rev. 2013 32 423 448 10.1007/s10555-013-9435-7 23640024 Huang, S. Genetic and non-genetic instability in tumor progression: link between the fitness landscape and the epigenetic landscape of cancer cells. Cancer Metastasis Rev. 32 23640024 10.1007/s10555-013-9435-7 14. Flavahan WA Gaskell E Bernstein BE Epigenetic plasticity and the hallmarks of cancer Science 2017 357 eaal2380 10.1126/science.aal2380 28729483 PMC5940341 Flavahan, W. A., Gaskell, E. & Bernstein, B. E. Epigenetic plasticity and the hallmarks of cancer. Science 357 28729483 10.1126/science.aal2380 PMC5940341 15. Dabin J Fortuny A Polo SE Epigenome maintenance in response to DNA damage Mol. Cell 2016 62 712 727 10.1016/j.molcel.2016.04.006 27259203 PMC5476208 Dabin, J., Fortuny, A. & Polo, S. E. Epigenome maintenance in response to DNA damage. Mol. Cell 62 27259203 10.1016/j.molcel.2016.04.006 PMC5476208 16. Dabin J Giacomini G Petit E Polo SE New facets in the chromatin-based regulation of genome maintenance DNA Repair (Amst.) 2024 140 103702 10.1016/j.dnarep.2024.103702 38878564 Dabin, J., Giacomini, G., Petit, E. & Polo, S. E. New facets in the chromatin-based regulation of genome maintenance. DNA Repair (Amst.) 140 38878564 10.1016/j.dnarep.2024.103702 17. Lensing SV DSBCapture: in situ capture and sequencing of DNA breaks Nat. Methods 2016 13 855 857 10.1038/nmeth.3960 27525976 PMC5045719 Lensing, S. V. et al. DSBCapture: in situ capture and sequencing of DNA breaks. Nat. Methods 13 27525976 10.1038/nmeth.3960 PMC5045719 18. Mourad R Ginalski K Legube G Cuvier O Predicting double-strand DNA breaks using epigenome marks or DNA at kilobase resolution Genome Biol. 2018 19 34 10.1186/s13059-018-1411-7 29544533 PMC5856001 Mourad, R., Ginalski, K., Legube, G. & Cuvier, O. Predicting double-strand DNA breaks using epigenome marks or DNA at kilobase resolution. Genome Biol. 19 29544533 10.1186/s13059-018-1411-7 PMC5856001 19. de Luca KL Genome-wide profiling of DNA repair proteins in single cells Nat. Commun. 2024 15 9918 10.1038/s41467-024-54159-4 39572529 PMC11582664 de Luca, K. L. et al. Genome-wide profiling of DNA repair proteins in single cells. Nat. Commun. 15 39572529 10.1038/s41467-024-54159-4 PMC11582664 20. Hazan I Monin J Bouwman BAM Crosetto N Aqeilan RI Activation of oncogenic super-enhancers is coupled with DNA repair by RAD51 Cell Rep. 2019 29 560 572.e4 10.1016/j.celrep.2019.09.001 31618627 PMC6899447 Hazan, I., Monin, J., Bouwman, B. A. M., Crosetto, N. & Aqeilan, R. I. Activation of oncogenic super-enhancers is coupled with DNA repair by RAD51. Cell Rep. 29 31618627 10.1016/j.celrep.2019.09.001 PMC6899447 21. Hoffman EA McCulley A Haarer B Arnak R Feng W Break-seq reveals hydroxyurea-induced chromosome fragility as a result of unscheduled conflict between DNA replication and transcription Genome Res 2015 25 402 412 10.1101/gr.180497.114 25609572 PMC4352882 Hoffman, E. A., McCulley, A., Haarer, B., Arnak, R. & Feng, W. Break-seq reveals hydroxyurea-induced chromosome fragility as a result of unscheduled conflict between DNA replication and transcription. Genome Res 25 25609572 10.1101/gr.180497.114 PMC4352882 22. Canela A Genome organization drives chromosome fragility Cell 2017 170 507 521.e18 10.1016/j.cell.2017.06.034 28735753 PMC6133249 Canela, A. et al. Genome organization drives chromosome fragility. Cell 170 28735753 10.1016/j.cell.2017.06.034 PMC6133249 23. Yan WX BLISS is a versatile and quantitative method for genome-wide profiling of DNA double-strand breaks Nat. Commun. 2017 8 15058 10.1038/ncomms15058 28497783 PMC5437291 Yan, W. X. et al. BLISS is a versatile and quantitative method for genome-wide profiling of DNA double-strand breaks. Nat. Commun. 8 28497783 10.1038/ncomms15058 PMC5437291 24. Biernacka A i-BLESS is an ultra-sensitive method for detection of DNA double-strand breaks Commun. Biol. 2018 1 181 10.1038/s42003-018-0165-9 30393778 PMC6208412 Biernacka, A. et al. i-BLESS is an ultra-sensitive method for detection of DNA double-strand breaks. Commun. Biol. 1 30393778 10.1038/s42003-018-0165-9 PMC6208412 25. Carruthers RD Replication stress drives constitutive activation of the DNA damage response and radioresistance in glioblastoma stem-like cells Cancer Res. 2018 78 5060 5071 10.1158/0008-5472.CAN-18-0569 29976574 PMC6128404 Carruthers, R. D. et al. Replication stress drives constitutive activation of the DNA damage response and radioresistance in glioblastoma stem-like cells. Cancer Res. 78 29976574 10.1158/0008-5472.CAN-18-0569 PMC6128404 26. Cao H Hotspots of single-strand DNA ‘breakome’ are enriched at transcriptional start sites of genes Front Mol. Biosci. 2022 9 895795 10.3389/fmolb.2022.895795 36046604 PMC9420937 Cao, H. et al. Hotspots of single-strand DNA ‘breakome’ are enriched at transcriptional start sites of genes. Front Mol. Biosci. 9 36046604 10.3389/fmolb.2022.895795 PMC9420937 27. Hidmi, O. et al. TOP1 and R-loops facilitate transcriptional DSBs at hypertranscribed cancer driver genes. iScience. 27 10.1016/j.isci.2024.109082 PMC10875566 38375218 28. Zacharioudakis E Chromatin regulates genome targeting with cisplatin Angew. Chem. Int Ed. Engl. 2017 56 6483 6487 10.1002/anie.201701144 28474855 PMC5488169 Zacharioudakis, E. et al. Chromatin regulates genome targeting with cisplatin. Angew. Chem. Int Ed. Engl. 56 28474855 10.1002/anie.201701144 PMC5488169 29. Plotnik JP Fighting PRC1 via the RING Nat. Chem. Biol. 2021 17 753 754 10.1038/s41589-021-00819-1 34155403 Plotnik, J. P. Fighting PRC1 via the RING. Nat. Chem. Biol. 17 34155403 10.1038/s41589-021-00819-1 30. Fitieh A BMI-1 regulates DNA end resection and homologous recombination repair Cell Rep. 2022 38 110536 10.1016/j.celrep.2022.110536 35320715 Fitieh, A. et al. BMI-1 regulates DNA end resection and homologous recombination repair. Cell Rep. 38 35320715 10.1016/j.celrep.2022.110536 31. Yu J-R Lee C-H Oksuz O Stafford JM Reinberg D PRC2 is high maintenance Genes Dev. 2019 33 903 935 10.1101/gad.325050.119 31123062 PMC6672058 Yu, J.-R., Lee, C.-H., Oksuz, O., Stafford, J. M. & Reinberg, D. PRC2 is high maintenance. Genes Dev. 33 31123062 10.1101/gad.325050.119 PMC6672058 32. Park I Bmi-1 is required for maintenance of adult self-renewing haematopoietic stem cells Nature 2003 423 302 305 10.1038/nature01587 12714971 Park, I. et al. Bmi-1 is required for maintenance of adult self-renewing haematopoietic stem cells. Nature 423 12714971 10.1038/nature01587 33. Molofsky AV Bmi-1 dependence distinguishes neural stem cell self-renewal from progenitor proliferation Nature 2003 425 962 967 10.1038/nature02060 14574365 PMC2614897 Molofsky, A. V. et al. Bmi-1 dependence distinguishes neural stem cell self-renewal from progenitor proliferation. Nature 425 14574365 10.1038/nature02060 PMC2614897 34. Paranjape AN Bmi1 regulates self-renewal and epithelial to mesenchymal transition in breast cancer cells through Nanog BMC Cancer 2014 14 785 10.1186/1471-2407-14-785 25348805 PMC4223733 Paranjape, A. N. et al. Bmi1 regulates self-renewal and epithelial to mesenchymal transition in breast cancer cells through Nanog. BMC Cancer 14 25348805 10.1186/1471-2407-14-785 PMC4223733 35. Kreso A Self-renewal as a therapeutic target in human colorectal cancer Nat. Med. 2014 20 29 36 10.1038/nm.3418 24292392 Kreso, A. et al. Self-renewal as a therapeutic target in human colorectal cancer. Nat. Med. 20 24292392 10.1038/nm.3418 36. Lin E-H Targeting cancer stemness mediated by BMI1 and MCL1 for non-small cell lung cancer treatment J. Cell. Mol. Med. 2022 26 4305 4321 10.1111/jcmm.17453 35794816 PMC9401641 Lin, E.-H. et al. Targeting cancer stemness mediated by BMI1 and MCL1 for non-small cell lung cancer treatment. J. Cell. Mol. Med. 26 35794816 10.1111/jcmm.17453 PMC9401641 37. Herzog AE Somayaji R Nör JE Bmi-1: A master regulator of head and neck cancer stemness Front Oral. Health 2023 4 1080255 10.3389/froh.2023.1080255 36726797 PMC9884974 Herzog, A. E., Somayaji, R. & Nör, J. E. Bmi-1: A master regulator of head and neck cancer stemness. Front Oral. Health 4 36726797 10.3389/froh.2023.1080255 PMC9884974 38. Yoo YA The role of castration-resistant Bmi1+Sox2+ cells in driving recurrence in prostate cancer J. Natl Cancer Inst. 2018 111 311 321 10.1093/jnci/djy142 PMC6410937 30312426 Yoo, Y. A. et al. The role of castration-resistant Bmi1+Sox2+ cells in driving recurrence in prostate cancer. J. Natl Cancer Inst. 111 10.1093/jnci/djy142 PMC6410937 30312426 39. Facchino S Abdouh M Chatoo W Bernier G BMI1 confers radioresistance to normal and cancerous neural stem cells through recruitment of the dna damage response machinery J. Neurosci. 2010 30 10096 10111 10.1523/JNEUROSCI.1634-10.2010 20668194 PMC6633363 Facchino, S., Abdouh, M., Chatoo, W. & Bernier, G. BMI1 confers radioresistance to normal and cancerous neural stem cells through recruitment of the dna damage response machinery. J. Neurosci. 30 20668194 10.1523/JNEUROSCI.1634-10.2010 PMC6633363 40. Azzoni V BMI1 nuclear location is critical for RAD51-dependent response to replication stress and drives chemoresistance in breast cancer stem cells Cell Death Dis. 2022 13 96 10.1038/s41419-022-04538-w 35110528 PMC8811067 Azzoni, V. et al. BMI1 nuclear location is critical for RAD51-dependent response to replication stress and drives chemoresistance in breast cancer stem cells. Cell Death Dis. 13 35110528 10.1038/s41419-022-04538-w PMC8811067 41. Margueron R Reinberg D The polycomb complex PRC2 and its mark in life Nature 2011 469 343 349 10.1038/nature09784 21248841 PMC3760771 Margueron, R. & Reinberg, D. The polycomb complex PRC2 and its mark in life. Nature 469 21248841 10.1038/nature09784 PMC3760771 42. Comet I Riising EM Leblanc B Helin K Maintaining cell identity: PRC2-mediated regulation of transcription and cancer Nat. Rev. Cancer 2016 16 803 810 10.1038/nrc.2016.83 27658528 Comet, I., Riising, E. M., Leblanc, B. & Helin, K. Maintaining cell identity: PRC2-mediated regulation of transcription and cancer. Nat. Rev. Cancer 16 27658528 10.1038/nrc.2016.83 43. Campbell S Ismail IH Young LC Poirier GG Hendzel MJ Polycomb repressive complex 2 contributes to DNA double-strand break repair Cell Cycle 2013 12 2675 2683 10.4161/cc.25795 23907130 PMC3865057 Campbell, S., Ismail, I. H., Young, L. C., Poirier, G. G. & Hendzel, M. J. Polycomb repressive complex 2 contributes to DNA double-strand break repair. Cell Cycle 12 23907130 10.4161/cc.25795 PMC3865057 44. Gardner EE Chemosensitive relapse in small cell lung cancer proceeds through an EZH2-SLFN11 Axis Cancer Cell 2017 31 286 299 10.1016/j.ccell.2017.01.006 28196596 PMC5313262 Gardner, E. E. et al. Chemosensitive relapse in small cell lung cancer proceeds through an EZH2-SLFN11 Axis. Cancer Cell 31 28196596 10.1016/j.ccell.2017.01.006 PMC5313262 45. Caron P van der Linden J van Attikum H Bon voyage: a transcriptional journey around DNA breaks DNA Repair 2019 82 102686 10.1016/j.dnarep.2019.102686 31476573 Caron, P., van der Linden, J. & van Attikum, H. Bon voyage: a transcriptional journey around DNA breaks. DNA Repair 82 31476573 10.1016/j.dnarep.2019.102686 46. Wen Y Cai J Hou Y Huang Z Wang Z Role of EZH2 in cancer stem cells: from biological insight to a therapeutic target Oncotarget 2017 8 37974 37990 10.18632/oncotarget.16467 28415635 PMC5514966 Wen, Y., Cai, J., Hou, Y., Huang, Z. & Wang, Z. Role of EZH2 in cancer stem cells: from biological insight to a therapeutic target. Oncotarget 8 28415635 10.18632/oncotarget.16467 PMC5514966 47. Kim S-H EZH2 protects glioma stem cells from radiation-induced cell death in a MELK/FOXM1-dependent manner Stem Cell Rep. 2015 4 226 238 10.1016/j.stemcr.2014.12.006 PMC4325196 25601206 Kim, S.-H. et al. EZH2 protects glioma stem cells from radiation-induced cell death in a MELK/FOXM1-dependent manner. Stem Cell Rep. 4 10.1016/j.stemcr.2014.12.006 PMC4325196 25601206 48. Jahangiri L Core regulatory circuitries in defining cancer cell identity across the malignant spectrum Open Biol. 2020 10 200121 10.1098/rsob.200121 32634370 PMC7574545 Jahangiri, L. et al. Core regulatory circuitries in defining cancer cell identity across the malignant spectrum. Open Biol. 10 32634370 10.1098/rsob.200121 PMC7574545 49. Barrows JK BRD4 promotes resection and homology-directed repair of DNA double-strand breaks Nat. Commun. 2022 13 3016 10.1038/s41467-022-30787-6 35641523 PMC9156784 Barrows, J. K. et al. BRD4 promotes resection and homology-directed repair of DNA double-strand breaks. Nat. Commun. 13 35641523 10.1038/s41467-022-30787-6 PMC9156784 50. Chaffer CL Poised chromatin at the ZEB1 promoter enables breast cancer cell plasticity and enhances tumorigenicity Cell 2013 154 61 74 10.1016/j.cell.2013.06.005 23827675 PMC4015106 Chaffer, C. L. et al. Poised chromatin at the ZEB1 promoter enables breast cancer cell plasticity and enhances tumorigenicity. Cell 154 23827675 10.1016/j.cell.2013.06.005 PMC4015106 51. Zhang P ATM-mediated stabilization of ZEB1 promotes DNA damage response and radioresistance through CHK1 Nat. Cell Biol. 2014 16 864 875 10.1038/ncb3013 25086746 PMC4150825 Zhang, P. et al. ATM-mediated stabilization of ZEB1 promotes DNA damage response and radioresistance through CHK1. Nat. Cell Biol. 16 25086746 10.1038/ncb3013 PMC4150825 52. Prodhomme MK EMT transcription factor ZEB1 represses the mutagenic POLθ-mediated end-joining pathway in breast cancers Cancer Res. 2021 81 1595 1606 10.1158/0008-5472.CAN-20-2626 33239429 Prodhomme, M. K. et al. EMT transcription factor ZEB1 represses the mutagenic POLθ-mediated end-joining pathway in breast cancers. Cancer Res. 81 33239429 10.1158/0008-5472.CAN-20-2626 53. Lemaître C Nuclear position dictates DNA repair pathway choice Genes Dev. 2014 28 2450 2463 10.1101/gad.248369.114 25366693 PMC4233239 Lemaître, C. et al. Nuclear position dictates DNA repair pathway choice. Genes Dev. 28 25366693 10.1101/gad.248369.114 PMC4233239 54. Schep R Impact of chromatin context on Cas9-induced DNA double-strand break repair pathway balance Mol. Cell 2021 81 2216 2230.e10 10.1016/j.molcel.2021.03.032 33848455 PMC8153251 Schep, R. et al. Impact of chromatin context on Cas9-induced DNA double-strand break repair pathway balance. Mol. Cell 81 33848455 10.1016/j.molcel.2021.03.032 PMC8153251 55. Burgess RC Burman B Kruhlak MJ Misteli T Activation of DNA damage response signaling by condensed chromatin Cell Rep. 2014 9 1703 1717 10.1016/j.celrep.2014.10.060 25464843 PMC4267891 Burgess, R. C., Burman, B., Kruhlak, M. J. & Misteli, T. Activation of DNA damage response signaling by condensed chromatin. Cell Rep. 9 25464843 10.1016/j.celrep.2014.10.060 PMC4267891 56. Jiang Y INO80 chromatin remodeling complex promotes the removal of UV lesions by the nucleotide excision repair pathway Proc. Natl Acad. Sci. USA. 2010 107 17274 17279 10.1073/pnas.1008388107 20855601 PMC2951448 Jiang, Y. et al. INO80 chromatin remodeling complex promotes the removal of UV lesions by the nucleotide excision repair pathway. Proc. Natl Acad. Sci. USA. 107 20855601 10.1073/pnas.1008388107 PMC2951448 57. Horigome C SWR1 and INO80 chromatin remodelers contribute to dna double-strand break perinuclear anchorage site choice Mol. Cell 2014 55 626 639 10.1016/j.molcel.2014.06.027 25066231 Horigome, C. et al. SWR1 and INO80 chromatin remodelers contribute to dna double-strand break perinuclear anchorage site choice. Mol. Cell 55 25066231 10.1016/j.molcel.2014.06.027 58. Ogiwara H Histone acetylation by CBP and p300 at double-strand break sites facilitates SWI/SNF chromatin remodeling and the recruitment of non-homologous end joining factors Oncogene 2011 30 2135 2146 10.1038/onc.2010.592 21217779 Ogiwara, H. et al. Histone acetylation by CBP and p300 at double-strand break sites facilitates SWI/SNF chromatin remodeling and the recruitment of non-homologous end joining factors. Oncogene 30 21217779 10.1038/onc.2010.592 59. Watanabe R SWI/SNF factors required for cellular resistance to DNA damage include ARID1A and ARID1B and show interdependent protein stability Cancer Res. 2014 74 2465 2475 10.1158/0008-5472.CAN-13-3608 24788099 Watanabe, R. et al. SWI/SNF factors required for cellular resistance to DNA damage include ARID1A and ARID1B and show interdependent protein stability. Cancer Res. 74 24788099 10.1158/0008-5472.CAN-13-3608 60. Harrod A Lane KA Downs JA The role of the SWI/SNF chromatin remodelling complex in the response to DNA double strand breaks DNA Repair. 2020 93 102919 10.1016/j.dnarep.2020.102919 33087260 Harrod, A., Lane, K. A. & Downs, J. A. The role of the SWI/SNF chromatin remodelling complex in the response to DNA double strand breaks. DNA Repair. 93 33087260 10.1016/j.dnarep.2020.102919 61. Hao F Zhang Y Hou J Zhao B Chromatin remodeling and cancer: the critical influence of the SWI/SNF complex Epigenetics Chromatin 2025 18 22 10.1186/s13072-025-00590-w 40269969 PMC12016160 Hao, F., Zhang, Y., Hou, J. & Zhao, B. Chromatin remodeling and cancer: the critical influence of the SWI/SNF complex. Epigenetics Chromatin 18 40269969 10.1186/s13072-025-00590-w PMC12016160 62. Clouaire T Comprehensive mapping of histone modifications at DNA double-strand breaks deciphers repair pathway chromatin signatures Mol. Cell 2018 72 250 262.e6 10.1016/j.molcel.2018.08.020 30270107 PMC6202423 Clouaire, T. et al. Comprehensive mapping of histone modifications at DNA double-strand breaks deciphers repair pathway chromatin signatures. Mol. Cell 72 30270107 10.1016/j.molcel.2018.08.020 PMC6202423 63. Pfister SX SETD2-dependent histone H3K36 trimethylation Is required for homologous recombination repair and genome stability Cell Rep. 2014 7 2006 2018 10.1016/j.celrep.2014.05.026 24931610 PMC4074340 Pfister, S. X. et al. SETD2-dependent histone H3K36 trimethylation Is required for homologous recombination repair and genome stability. Cell Rep. 7 24931610 10.1016/j.celrep.2014.05.026 PMC4074340 64. Barral A SETDB1/NSD-dependent H3K9me3/H3K36me3 dual heterochromatin maintains gene expression profiles by bookmarking poised enhancers Mol. Cell 2022 82 816 832.e12 10.1016/j.molcel.2021.12.037 35081363 PMC8860380 Barral, A. et al. SETDB1/NSD-dependent H3K9me3/H3K36me3 dual heterochromatin maintains gene expression profiles by bookmarking poised enhancers. Mol. Cell 82 35081363 10.1016/j.molcel.2021.12.037 PMC8860380 65. Aymard F Transcriptionally active chromatin recruits homologous recombination at DNA double-strand breaks Nat. Struct. Mol. Biol. 2014 21 366 374 10.1038/nsmb.2796 24658350 PMC4300393 Aymard, F. et al. Transcriptionally active chromatin recruits homologous recombination at DNA double-strand breaks. Nat. Struct. Mol. Biol. 21 24658350 10.1038/nsmb.2796 PMC4300393 66. Kapoor-Vazirani P SAMHD1 deacetylation by SIRT1 promotes DNA end resection by facilitating DNA binding at double-strand breaks Nat. Commun. 2022 13 6707 10.1038/s41467-022-34578-x 36344525 PMC9640623 Kapoor-Vazirani, P. et al. SAMHD1 deacetylation by SIRT1 promotes DNA end resection by facilitating DNA binding at double-strand breaks. Nat. Commun. 13 36344525 10.1038/s41467-022-34578-x PMC9640623 67. Yadav T Quivy J-P Almouzni G Chromatin plasticity: a versatile landscape that underlies cell fate and identity Science 2018 361 1332 1336 10.1126/science.aat8950 30262494 Yadav, T., Quivy, J.-P. & Almouzni, G. Chromatin plasticity: a versatile landscape that underlies cell fate and identity. Science 361 30262494 10.1126/science.aat8950 68. Domaschenz R Kurscheid S Nekrasov M Han S Tremethick DJ The histone variant H2A.Z is a master regulator of the epithelial-mesenchymal transition Cell Rep. 2017 21 943 952 10.1016/j.celrep.2017.09.086 29069602 Domaschenz, R., Kurscheid, S., Nekrasov, M., Han, S. & Tremethick, D. J. The histone variant H2A.Z is a master regulator of the epithelial-mesenchymal transition. Cell Rep. 21 29069602 10.1016/j.celrep.2017.09.086 69. Thiery JP Acloque H Huang RYJ Nieto MA Epithelial-mesenchymal transitions in development and disease Cell 2009 139 871 890 10.1016/j.cell.2009.11.007 19945376 Thiery, J. P., Acloque, H., Huang, R. Y. J. & Nieto, M. A. Epithelial-mesenchymal transitions in development and disease. Cell 139 19945376 10.1016/j.cell.2009.11.007 70. McDonald OG Wu H Timp W Doi A Feinberg AP Genome-scale epigenetic reprogramming during epithelial-to-mesenchymal transition Nat. Struct. Mol. Biol. 2011 18 867 874 10.1038/nsmb.2084 21725293 PMC3150339 McDonald, O. G., Wu, H., Timp, W., Doi, A. & Feinberg, A. P. Genome-scale epigenetic reprogramming during epithelial-to-mesenchymal transition. Nat. Struct. Mol. Biol. 18 21725293 10.1038/nsmb.2084 PMC3150339 71. Maritz C ASH1L-MRG15 methyltransferase deposits H3K4me3 and FACT for damage verification in nucleotide excision repair Nat. Commun. 2023 14 3892 10.1038/s41467-023-39635-7 37393406 PMC10314917 Maritz, C. et al. ASH1L-MRG15 methyltransferase deposits H3K4me3 and FACT for damage verification in nucleotide excision repair. Nat. Commun. 14 37393406 10.1038/s41467-023-39635-7 PMC10314917 72. Obara EAA SPT6-driven error-free DNA repair safeguards genomic stability of glioblastoma cancer stem-like cells Nat. Commun. 2020 11 4709 10.1038/s41467-020-18549-8 32948765 PMC7501306 Obara, E. A. A. et al. SPT6-driven error-free DNA repair safeguards genomic stability of glioblastoma cancer stem-like cells. Nat. Commun. 11 32948765 10.1038/s41467-020-18549-8 PMC7501306 73. Polo SE Almouzni G Chromatin dynamics after DNA damage: the legacy of the access–repair–restore model DNA Repair 2015 36 114 121 10.1016/j.dnarep.2015.09.014 26429064 PMC5113751 Polo, S. E. & Almouzni, G. Chromatin dynamics after DNA damage: the legacy of the access–repair–restore model. DNA Repair 36 26429064 10.1016/j.dnarep.2015.09.014 PMC5113751 74. Adam S Real-time tracking of parental histones reveals their contribution to chromatin integrity following DNA damage Mol. Cell 2016 64 65 78 10.1016/j.molcel.2016.08.019 27642047 PMC5065526 Adam, S. et al. Real-time tracking of parental histones reveals their contribution to chromatin integrity following DNA damage. Mol. Cell 64 27642047 10.1016/j.molcel.2016.08.019 PMC5065526 75. Goldstein M Derheimer FA Tait-Mulder J Kastan MB Nucleolin mediates nucleosome disruption critical for DNA double-strand break repair Proc. Natl Acad. Sci. 2013 110 16874 16879 10.1073/pnas.1306160110 24082117 PMC3801049 Goldstein, M., Derheimer, F. A., Tait-Mulder, J. & Kastan, M. B. Nucleolin mediates nucleosome disruption critical for DNA double-strand break repair. Proc. Natl Acad. Sci. 110 24082117 10.1073/pnas.1306160110 PMC3801049 76. Polo SE Roche D Almouzni G New histone incorporation marks sites of UV repair in human cells Cell 2006 127 481 493 10.1016/j.cell.2006.08.049 17081972 Polo, S. E., Roche, D. & Almouzni, G. New histone incorporation marks sites of UV repair in human cells. Cell 127 17081972 10.1016/j.cell.2006.08.049 77. Adam S Polo SE Almouzni G Transcription recovery after DNA damage requires chromatin priming by the H3.3 histone chaperone HIRA Cell 2013 155 94 106 10.1016/j.cell.2013.08.029 24074863 Adam, S., Polo, S. E. & Almouzni, G. Transcription recovery after DNA damage requires chromatin priming by the H3.3 histone chaperone HIRA. Cell 155 24074863 10.1016/j.cell.2013.08.029 78. Bouvier D Dissecting regulatory pathways for transcription recovery following DNA damage reveals a non-canonical function of the histone chaperone HIRA Nat. Commun. 2021 12 3835 10.1038/s41467-021-24153-1 34158510 PMC8219801 Bouvier, D. et al. Dissecting regulatory pathways for transcription recovery following DNA damage reveals a non-canonical function of the histone chaperone HIRA. Nat. Commun. 12 34158510 10.1038/s41467-021-24153-1 PMC8219801 79. Li X Tyler JK Nucleosome disassembly during human non-homologous end joining followed by concerted HIRA- and CAF-1-dependent reassembly eLife 2016 5 e15129 10.7554/eLife.15129 27269284 PMC4915809 Li, X. & Tyler, J. K. Nucleosome disassembly during human non-homologous end joining followed by concerted HIRA- and CAF-1-dependent reassembly. eLife 5 27269284 10.7554/eLife.15129 PMC4915809 80. Zhang H RPA interacts with HIRA and regulates H3.3 deposition at gene regulatory elements in mammalian cells Mol. Cell 2017 65 272 284 10.1016/j.molcel.2016.11.030 28107649 PMC5460635 Zhang, H. et al. RPA interacts with HIRA and regulates H3.3 deposition at gene regulatory elements in mammalian cells. Mol. Cell 65 28107649 10.1016/j.molcel.2016.11.030 PMC5460635 81. Martire S Banaszynski LA The roles of histone variants in fine-tuning chromatin organization and function Nat. Rev. Mol. Cell Biol. 2020 21 522 541 10.1038/s41580-020-0262-8 32665685 PMC8245300 Martire, S. & Banaszynski, L. A. The roles of histone variants in fine-tuning chromatin organization and function. Nat. Rev. Mol. Cell Biol. 21 32665685 10.1038/s41580-020-0262-8 PMC8245300 82. Plessier, A. et al. Proteomic profiling of UV damage repair patches uncovers histone chaperones with central functions in chromatin repair. bioRxiv 83. Ferrand J Plessier A Polo SE Control of the chromatin response to DNA damage: Histone proteins pull the strings Semin. Cell Dev. Biol. 2021 113 75 87 10.1016/j.semcdb.2020.07.002 32690375 Ferrand, J., Plessier, A. & Polo, S. E. Control of the chromatin response to DNA damage: Histone proteins pull the strings. Semin. Cell Dev. Biol. 113 32690375 10.1016/j.semcdb.2020.07.002 84. Mortusewicz O Schermelleh L Walter J Cardoso MC Leonhardt H Recruitment of DNA methyltransferase I to DNA repair sites Proc. Natl Acad. Sci. USA 2005 102 8905 8909 10.1073/pnas.0501034102 15956212 PMC1157029 Mortusewicz, O., Schermelleh, L., Walter, J., Cardoso, M. C. & Leonhardt, H. Recruitment of DNA methyltransferase I to DNA repair sites. Proc. Natl Acad. Sci. USA 102 15956212 10.1073/pnas.0501034102 PMC1157029 85. Tamburini BA Tyler JK Localized histone acetylation and deacetylation triggered by the homologous recombination pathway of double-strand dna repair Mol. Cell. Biol. 2005 25 4903 4913 10.1128/MCB.25.12.4903-4913.2005 15923609 PMC1140608 Tamburini, B. A. & Tyler, J. K. Localized histone acetylation and deacetylation triggered by the homologous recombination pathway of double-strand dna repair. Mol. Cell. Biol. 25 15923609 10.1128/MCB.25.12.4903-4913.2005 PMC1140608 86. O’Hagan HM Mohammad HP Baylin SB Double strand breaks can initiate gene silencing and SIRT1-dependent onset of DNA methylation in an exogenous promoter CpG island PLoS Genet 2008 4 e1000155 10.1371/journal.pgen.1000155 18704159 PMC2491723 O’Hagan, H. M., Mohammad, H. P. & Baylin, S. B. Double strand breaks can initiate gene silencing and SIRT1-dependent onset of DNA methylation in an exogenous promoter CpG island. PLoS Genet 4 18704159 10.1371/journal.pgen.1000155 PMC2491723 87. O’Hagan HM Oxidative damage targets complexes containing DNA methyltransferases, SIRT1, and polycomb members to promoter CpG Islands Cancer Cell 2011 20 606 619 10.1016/j.ccr.2011.09.012 22094255 PMC3220885 O’Hagan, H. M. et al. Oxidative damage targets complexes containing DNA methyltransferases, SIRT1, and polycomb members to promoter CpG Islands. Cancer Cell 20 22094255 10.1016/j.ccr.2011.09.012 PMC3220885 88. Russo G DNA damage and repair modify DNA methylation and chromatin domain of the targeted locus: mechanism of allele methylation polymorphism Sci. Rep. 2016 6 33222 10.1038/srep33222 27629060 PMC5024116 Russo, G. et al. DNA damage and repair modify DNA methylation and chromatin domain of the targeted locus: mechanism of allele methylation polymorphism. Sci. Rep. 6 27629060 10.1038/srep33222 PMC5024116 89. Morano A Targeted DNA methylation by homology-directed repair in mammalian cells. Transcription reshapes methylation on the repaired gene Nucleic Acids Res. 2014 42 804 821 10.1093/nar/gkt920 24137009 PMC3902918 Morano, A. et al. Targeted DNA methylation by homology-directed repair in mammalian cells. Transcription reshapes methylation on the repaired gene. Nucleic Acids Res. 42 24137009 10.1093/nar/gkt920 PMC3902918 90. Choi J Kim T Cho E-J HIRA vs. DAXX: the two axes shaping the histone H3.3 landscape Exp. Mol. Med, 2024 56 251 263 10.1038/s12276-023-01145-3 38297159 PMC10907377 Choi, J., Kim, T. & Cho, E.-J. HIRA vs. DAXX: the two axes shaping the histone H3.3 landscape. Exp. Mol. Med, 56 38297159 10.1038/s12276-023-01145-3 PMC10907377 91. Loyola A Bonaldi T Roche D Imhof A Almouzni G PTMs on H3 variants before chromatin assembly potentiate their final epigenetic state Mol. Cell 2006 24 309 316 10.1016/j.molcel.2006.08.019 17052464 Loyola, A., Bonaldi, T., Roche, D., Imhof, A. & Almouzni, G. PTMs on H3 variants before chromatin assembly potentiate their final epigenetic state. Mol. Cell 24 17052464 10.1016/j.molcel.2006.08.019 92. Yang J-H Loss of epigenetic information as a cause of mammalian aging Cell 2023 186 305 326.e27 10.1016/j.cell.2022.12.027 36638792 PMC10166133 Yang, J.-H. et al. Loss of epigenetic information as a cause of mammalian aging. Cell 186 36638792 10.1016/j.cell.2022.12.027 PMC10166133 93. Bantele, S. et al. Repair of DNA double-strand breaks leaves heritable impairment to genome function. biorxiv 94. Parreno V Transient loss of polycomb components induces an epigenetic cancer fate Nature 2024 629 688 696 10.1038/s41586-024-07328-w 38658752 PMC11096130 Parreno, V. et al. Transient loss of polycomb components induces an epigenetic cancer fate. Nature 629 38658752 10.1038/s41586-024-07328-w PMC11096130 95. Richart L XIST loss impairs mammary stem cell differentiation and increases tumorigenicity through mediator hyperactivation Cell 2022 185 2164 2183.e25 10.1016/j.cell.2022.04.034 35597241 Richart, L. et al. XIST loss impairs mammary stem cell differentiation and increases tumorigenicity through mediator hyperactivation. Cell 185 35597241 10.1016/j.cell.2022.04.034 96. Lin S Margueron R Charafe-Jauffret E Ginestier C Disruption of lineage integrity as a precursor to breast tumor initiation Trends Cell Biol. 2023 33 887 897 10.1016/j.tcb.2023.03.010 37061355 Lin, S., Margueron, R., Charafe-Jauffret, E. & Ginestier, C. Disruption of lineage integrity as a precursor to breast tumor initiation. Trends Cell Biol. 33 37061355 10.1016/j.tcb.2023.03.010 97. Jerkovic I Cavalli G Understanding 3D genome organization by multidisciplinary methods Nat. Rev. Mol. Cell Biol. 2021 22 511 528 10.1038/s41580-021-00362-w 33953379 Jerkovic, I. & Cavalli, G. Understanding 3D genome organization by multidisciplinary methods. Nat. Rev. Mol. Cell Biol. 22 33953379 10.1038/s41580-021-00362-w 98. Fedkenheuer M A dual role of Cohesin in DNA DSB repair Nat. Commun. 2025 16 843 10.1038/s41467-025-56086-4 39833168 PMC11747280 Fedkenheuer, M. et al. A dual role of Cohesin in DNA DSB repair. Nat. Commun. 16 39833168 10.1038/s41467-025-56086-4 PMC11747280 99. Wensveen, M.R. et al. Double-strand breaks in facultative heterochromatin require specific movements and chromatin changes for efficient repair. Nat. Commun. 15 10.1038/s41467-024-53313-2 PMC11487122 39419979 100. Zhang H Chromatin structure dynamics during the mitosis-to-G1 phase transition Nature 2019 576 158 162 10.1038/s41586-019-1778-y 31776509 PMC6895436 Zhang, H. et al. Chromatin structure dynamics during the mitosis-to-G1 phase transition. Nature 576 31776509 10.1038/s41586-019-1778-y PMC6895436 101. Palozola KC Lerner J Zaret KS A changing paradigm of transcriptional memory propagation through mitosis Nat. Rev. Mol. Cell Biol. 2019 20 55 64 10.1038/s41580-018-0077-z 30420736 PMC6557398 Palozola, K. C., Lerner, J. & Zaret, K. S. A changing paradigm of transcriptional memory propagation through mitosis. Nat. Rev. Mol. Cell Biol. 20 30420736 10.1038/s41580-018-0077-z PMC6557398 102. Bellec M The control of transcriptional memory by stable mitotic bookmarking Nat. Commun. 2022 13 1176 10.1038/s41467-022-28855-y 35246556 PMC8897465 Bellec, M. et al. The control of transcriptional memory by stable mitotic bookmarking. Nat. Commun. 13 35246556 10.1038/s41467-022-28855-y PMC8897465 103. Yu Q Dynamics and regulation of mitotic chromatin accessibility bookmarking at single-cell resolution Sci. Adv. 2023 9 eadd2175 10.1126/sciadv.add2175 36696508 PMC9876548 Yu, Q. et al. Dynamics and regulation of mitotic chromatin accessibility bookmarking at single-cell resolution. Sci. Adv. 9 36696508 10.1126/sciadv.add2175 PMC9876548 104. Zhu Z Mitotic bookmarking by SWI/SNF subunits Nature 2023 618 180 187 10.1038/s41586-023-06085-6 37225980 PMC10303083 Zhu, Z. et al. Mitotic bookmarking by SWI/SNF subunits. Nature 618 37225980 10.1038/s41586-023-06085-6 PMC10303083 105. Manic G Replication stress response in cancer stem cells as a target for chemotherapy Semin. Cancer Biol. 2018 53 31 41 10.1016/j.semcancer.2018.08.003 30081229 Manic, G. et al. Replication stress response in cancer stem cells as a target for chemotherapy. Semin. Cancer Biol. 53 30081229 10.1016/j.semcancer.2018.08.003 106. Manic G Control of replication stress and mitosis in colorectal cancer stem cells through the interplay of PARP1, MRE11 and RAD51 Cell Death Differ. 2021 28 2060 2082 10.1038/s41418-020-00733-4 33531658 PMC8257675 Manic, G. et al. Control of replication stress and mitosis in colorectal cancer stem cells through the interplay of PARP1, MRE11 and RAD51. Cell Death Differ. 28 33531658 10.1038/s41418-020-00733-4 PMC8257675 107. Rouault CD Inhibition of the STAT3/fanconi anemia axis is synthetic lethal with PARP inhibition in breast cancer Nat. Commun. 2025 16 2159 10.1038/s41467-025-57476-4 40038300 PMC11880418 Rouault, C. D. et al. Inhibition of the STAT3/fanconi anemia axis is synthetic lethal with PARP inhibition in breast cancer. Nat. Commun. 16 40038300 10.1038/s41467-025-57476-4 PMC11880418 108. Pilié PG Tang C Mills GB Yap TA State-of-the-art strategies for targeting the DNA damage response in cancer Nat. Rev. Clin. Oncol. 2019 16 81 104 10.1038/s41571-018-0114-z 30356138 PMC8327299 Pilié, P. G., Tang, C., Mills, G. B. & Yap, T. A. State-of-the-art strategies for targeting the DNA damage response in cancer. Nat. Rev. Clin. Oncol. 16 30356138 10.1038/s41571-018-0114-z PMC8327299 109. Onozawa M Repair of DNA double-strand breaks by templated nucleotide sequence insertions derived from distant regions of the genome Proc. Natl Acad. Sci. USA 2014 111 7729 7734 10.1073/pnas.1321889111 24821809 PMC4040595 Onozawa, M. et al. Repair of DNA double-strand breaks by templated nucleotide sequence insertions derived from distant regions of the genome. Proc. Natl Acad. Sci. USA 111 24821809 10.1073/pnas.1321889111 PMC4040595 110. Hidaka D Short-term treatment with imetelstat sensitizes hematopoietic malignant cells to a genotoxic agent via suppression of the telomerase-mediated DNA repair process Leuk. Lymphoma 2020 61 2722 2732 10.1080/10428194.2020.1779256 32571117 Hidaka, D. et al. Short-term treatment with imetelstat sensitizes hematopoietic malignant cells to a genotoxic agent via suppression of the telomerase-mediated DNA repair process. Leuk. Lymphoma 61 32571117 10.1080/10428194.2020.1779256 111. Bruedigam C Telomerase inhibition effectively targets mouse and human AML stem cells and delays relapse following chemotherapy Cell Stem Cell 2014 15 775 790 10.1016/j.stem.2014.11.010 25479751 PMC4317339 Bruedigam, C. et al. Telomerase inhibition effectively targets mouse and human AML stem cells and delays relapse following chemotherapy. Cell Stem Cell 15 25479751 10.1016/j.stem.2014.11.010 PMC4317339 112. Barwe SP Huang F Kolb EA Gopalakrishnapillai A Imetelstat induces leukemia stem cell death in pediatric acute myeloid leukemia patient-derived xenografts J. Clin. Med. 2022 11 1923 10.3390/jcm11071923 35407531 PMC8999576 Barwe, S. P., Huang, F., Kolb, E. A. & Gopalakrishnapillai, A. Imetelstat induces leukemia stem cell death in pediatric acute myeloid leukemia patient-derived xenografts. J. Clin. Med. 11 35407531 10.3390/jcm11071923 PMC8999576 113. Tammela T Sage J Investigating tumor heterogeneity in mouse models Annu. Rev. Cancer Biol. 2020 4 99 119 10.1146/annurev-cancerbio-030419-033413 34164589 PMC8218894 Tammela, T. & Sage, J. Investigating tumor heterogeneity in mouse models. Annu. Rev. Cancer Biol. 4 34164589 10.1146/annurev-cancerbio-030419-033413 PMC8218894 114. Murai J Trapping of PARP1 and PARP2 by clinical PARP inhibitors Cancer Res. 2012 72 5588 5599 10.1158/0008-5472.CAN-12-2753 23118055 PMC3528345 Murai, J. et al. Trapping of PARP1 and PARP2 by clinical PARP inhibitors. Cancer Res. 72 23118055 10.1158/0008-5472.CAN-12-2753 PMC3528345 115. Tutt ANJ Adjuvant olaparib for patients with BRCA1- or BRCA2-mutated breast cancer N. Engl. J. Med. 2021 384 2394 2405 10.1056/NEJMoa2105215 34081848 PMC9126186 Tutt, A. N. J. et al. Adjuvant olaparib for patients with BRCA1- or BRCA2-mutated breast cancer. N. Engl. J. Med. 384 34081848 10.1056/NEJMoa2105215 PMC9126186 116. Yang L Repression of BET activity sensitizes homologous recombination-proficient cancers to PARP inhibition Sci. Transl. Med. 2017 9 eaal1645 10.1126/scitranslmed.aal1645 28747513 PMC5705017 Yang, L. et al. Repression of BET activity sensitizes homologous recombination-proficient cancers to PARP inhibition. Sci. Transl. Med. 9 28747513 10.1126/scitranslmed.aal1645 PMC5705017 117. Arfaoui A A genome-wide RNAi screen reveals essential therapeutic targets of breast cancer stem cells EMBO Mol. Med. 2019 11 e9930 10.15252/emmm.201809930 31476112 PMC6783652 Arfaoui, A. et al. A genome-wide RNAi screen reveals essential therapeutic targets of breast cancer stem cells. EMBO Mol. Med. 11 31476112 10.15252/emmm.201809930 PMC6783652 118. Zhu Q Novel dual inhibitors of PARP and HDAC induce intratumoral STING-mediated antitumor immunity in triple-negative breast cancer Cell Death Dis. 2024 15 1 12 38182579 10.1038/s41419-023-06303-z PMC10770036 Zhu, Q. et al. Novel dual inhibitors of PARP and HDAC induce intratumoral STING-mediated antitumor immunity in triple-negative breast cancer. Cell Death Dis. 15 38182579 10.1038/s41419-023-06303-z PMC10770036 119. Drzewiecka M Class I HDAC inhibition leads to a downregulation of FANCD2 and RAD51, and the eradication of glioblastoma eclls J. Pers. Med 2023 13 1315 10.3390/jpm13091315 37763083 PMC10532614 Drzewiecka, M. et al. Class I HDAC inhibition leads to a downregulation of FANCD2 and RAD51, and the eradication of glioblastoma eclls. J. Pers. Med 13 37763083 10.3390/jpm13091315 PMC10532614 120. Rasmussen RD Gajjar MK Jensen KE Hamerlik P Enhanced efficacy of combined HDAC and PARP targeting in glioblastoma Mol. Oncol. 2016 10 751 763 10.1016/j.molonc.2015.12.014 26794465 PMC5423160 Rasmussen, R. D., Gajjar, M. K., Jensen, K. E. & Hamerlik, P. Enhanced efficacy of combined HDAC and PARP targeting in glioblastoma. Mol. Oncol. 10 26794465 10.1016/j.molonc.2015.12.014 PMC5423160 121. Minucci S Pelicci PG Histone deacetylase inhibitors and the promise of epigenetic (and more) treatments for cancer Nat. Rev. Cancer 2006 6 38 51 10.1038/nrc1779 16397526 Minucci, S. & Pelicci, P. G. Histone deacetylase inhibitors and the promise of epigenetic (and more) treatments for cancer. Nat. Rev. Cancer 6 16397526 10.1038/nrc1779 122. Salvador MA The histone deacetylase inhibitor abexinostat induces cancer stem cells differentiation in breast cancer with low Xist expression Clin. Cancer Res. 2013 19 6520 6531 10.1158/1078-0432.CCR-13-0877 24141629 Salvador, M. A. et al. The histone deacetylase inhibitor abexinostat induces cancer stem cells differentiation in breast cancer with low Xist expression. Clin. Cancer Res. 19 24141629 10.1158/1078-0432.CCR-13-0877 123. Scott MT Epigenetic reprogramming sensitizes CML stem cells to combined EZH2 and tyrosine kinase inhibition Cancer Discov. 2016 6 1248 1257 10.1158/2159-8290.CD-16-0263 27630125 PMC6538532 Scott, M. T. et al. Epigenetic reprogramming sensitizes CML stem cells to combined EZH2 and tyrosine kinase inhibition. Cancer Discov. 6 27630125 10.1158/2159-8290.CD-16-0263 PMC6538532 124. Karakashev S EZH2 inhibition sensitizes CARM1-high, homologous recombination proficient ovarian cancers to PARP inhibition Cancer Cell 2020 37 157 167.e6 10.1016/j.ccell.2019.12.015 32004442 PMC7155421 Karakashev, S. et al. EZH2 inhibition sensitizes CARM1-high, homologous recombination proficient ovarian cancers to PARP inhibition. Cancer Cell 37 32004442 10.1016/j.ccell.2019.12.015 PMC7155421 125. Yamaguchi H EZH2 contributes to the response to PARP inhibitors through its PARP-mediated poly-ADP ribosylation in breast cancer Oncogene 2018 37 208 217 10.1038/onc.2017.311 28925391 PMC5786281 Yamaguchi, H. et al. EZH2 contributes to the response to PARP inhibitors through its PARP-mediated poly-ADP ribosylation in breast cancer. Oncogene 37 28925391 10.1038/onc.2017.311 PMC5786281 126. Haebe JR Bergin CJ Sandouka T Benoit YD Emerging role of G9a in cancer stemness and promises as a therapeutic target Oncogenesis 2021 10 76 10.1038/s41389-021-00370-7 34775469 PMC8590690 Haebe, J. R., Bergin, C. J., Sandouka, T. & Benoit, Y. D. Emerging role of G9a in cancer stemness and promises as a therapeutic target. Oncogenesis 10 34775469 10.1038/s41389-021-00370-7 PMC8590690 127. Watson ZL Histone methyltransferases EHMT1 and EHMT2 (GLP/G9A) maintain PARP inhibitor resistance in high-grade serous ovarian carcinoma Clin. Epigenetics 2019 11 165 10.1186/s13148-019-0758-2 31775874 PMC6882350 Watson, Z. L. et al. Histone methyltransferases EHMT1 and EHMT2 (GLP/G9A) maintain PARP inhibitor resistance in high-grade serous ovarian carcinoma. Clin. Epigenetics 11 31775874 10.1186/s13148-019-0758-2 PMC6882350 128. Trowbridge JJ Haploinsufficiency of Dnmt1 impairs leukemia stem cell function through derepression of bivalent chromatin domains Genes Dev. 2012 26 344 349 10.1101/gad.184341.111 22345515 PMC3289882 Trowbridge, J. J. et al. Haploinsufficiency of Dnmt1 impairs leukemia stem cell function through derepression of bivalent chromatin domains. Genes Dev. 26 22345515 10.1101/gad.184341.111 PMC3289882 129. Pathania R DNMT1 is essential for mammary and cancer stem cell maintenance and tumorigenesis Nat. Commun. 2015 6 6910 10.1038/ncomms7910 25908435 PMC4410389 Pathania, R. et al. DNMT1 is essential for mammary and cancer stem cell maintenance and tumorigenesis. Nat. Commun. 6 25908435 10.1038/ncomms7910 PMC4410389 130. Abbotts R DNA methyltransferase inhibitors induce a BRCAness phenotype that sensitizes NSCLC to PARP inhibitor and ionizing radiation Proc. Natl Acad. Sci. 2019 116 22609 22618 10.1073/pnas.1903765116 31591209 PMC6842607 Abbotts, R. et al. DNA methyltransferase inhibitors induce a BRCAness phenotype that sensitizes NSCLC to PARP inhibitor and ionizing radiation. Proc. Natl Acad. Sci. 116 31591209 10.1073/pnas.1903765116 PMC6842607 131. Kostaras E A systematic molecular and pharmacologic evaluation of AKT inhibitors reveals new insight into their biological activity Br. J. Cancer 2020 123 542 555 10.1038/s41416-020-0889-4 32439931 PMC7435276 Kostaras, E. et al. A systematic molecular and pharmacologic evaluation of AKT inhibitors reveals new insight into their biological activity. Br. J. Cancer 123 32439931 10.1038/s41416-020-0889-4 PMC7435276 132. Chen C-W Buj R Dahl ES Leon KE Aird KM ATM inhibition synergizes with fenofibrate in high grade serous ovarian cancer cells Heliyon 2020 6 e05097 10.1016/j.heliyon.2020.e05097 33024871 PMC7527645 Chen, C.-W., Buj, R., Dahl, E. S., Leon, K. E. & Aird, K. M. ATM inhibition synergizes with fenofibrate in high grade serous ovarian cancer cells. Heliyon 6 33024871 10.1016/j.heliyon.2020.e05097 PMC7527645 133. Xue, Z. et al. The novel brain penetrant ataxia-telangiectasia mutated inhibitor WSD0628 provides robust radiosensitization of brain tumor patient-derived xenografts. Neuro Oncol 15 10.1093/neuonc/noaf102 40230030 134. Waqar SN Phase I trial of ATM inhibitor M3541 in combination with palliative radiotherapy in patients with solid tumors Invest N. Drugs 2022 40 596 605 10.1007/s10637-022-01216-8 PMC9098584 35150356 Waqar, S. N. et al. Phase I trial of ATM inhibitor M3541 in combination with palliative radiotherapy in patients with solid tumors. Invest N. Drugs 40 10.1007/s10637-022-01216-8 PMC9098584 35150356 135. Siu LL Abstract CT171: a first-in-human phase I study of the ATM inhibitor M4076 in patients with advanced solid tumors (DDRiver solid tumors 410): part 1A results Cancer Res. 2023 83 CT171 10.1158/1538-7445.AM2023-CT171 Siu, L. L. et al. Abstract CT171: a first-in-human phase I study of the ATM inhibitor M4076 in patients with advanced solid tumors (DDRiver solid tumors 410): part 1A results. Cancer Res. 83 136. Lynch RC First-in-human phase I/II study of CYT-0851, a first-in-class inhibitor of RAD51-mediated homologous recombination in patients with advanced solid and hematologic cancers JCO 2021 39 3006 3006 10.1200/JCO.2021.39.15_suppl.3006 Lynch, R. C. et al. First-in-human phase I/II study of CYT-0851, a first-in-class inhibitor of RAD51-mediated homologous recombination in patients with advanced solid and hematologic cancers. JCO 39 137. Leijen S Phase I study evaluating WEE1 inhibitor AZD1775 as monotherapy and in combination with gemcitabine, cisplatin, or carboplatin in patients with advanced solid tumors J. Clin. Oncol. 2016 34 4371 4380 10.1200/JCO.2016.67.5991 27601554 PMC7845944 Leijen, S. et al. Phase I study evaluating WEE1 inhibitor AZD1775 as monotherapy and in combination with gemcitabine, cisplatin, or carboplatin in patients with advanced solid tumors. J. Clin. Oncol. 34 27601554 10.1200/JCO.2016.67.5991 PMC7845944 138. Oza AM A biomarker-enriched, randomized phase ii trial of adavosertib (AZD1775) plus paclitaxel and carboplatin for women with platinum-sensitive TP53-mutant ovarian cancer Clin. Cancer Res 2020 26 4767 4776 10.1158/1078-0432.CCR-20-0219 32611648 Oza, A. M. et al. A biomarker-enriched, randomized phase ii trial of adavosertib (AZD1775) plus paclitaxel and carboplatin for women with platinum-sensitive TP53-mutant ovarian cancer. Clin. Cancer Res 26 32611648 10.1158/1078-0432.CCR-20-0219 139. Yap, T. A. et al. The DNA-PK inhibitor AZD7648 alone or combined with pegylated liposomal doxorubicin in patients with advanced cancer: results of a first-in-human phase I/IIa study. Br. J. Cancer 133 10.1038/s41416-025-03053-x PMC12304285 40382524 140. Munster P First-in-human phase I study of a dual mTOR kinase and DNA-PK inhibitor (CC-115) in advanced malignancy Cancer Manag Res 2019 11 10463 10476 10.2147/CMAR.S208720 31853198 PMC6916675 Munster, P. et al. First-in-human phase I study of a dual mTOR kinase and DNA-PK inhibitor (CC-115) in advanced malignancy. Cancer Manag Res 11 31853198 10.2147/CMAR.S208720 PMC6916675 ",
  "metadata": {
    "Title of this paper": "First-in-human phase I study of a dual mTOR kinase and DNA-PK inhibitor (CC-115) in advanced malignancy",
    "Journal it was published in:": "Nature Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484684/"
  }
}