{
  "title": "Paper_5",
  "abstract": "pmc Clin Chem Clin Chem 436 oxfordopen clinchem Clinical Chemistry 0009-9147 1530-8561 pmc-is-collection-domain yes pmc-collection-title Oxford University Press PMC12490885 PMC12490885.1 12490885 12490885 40796157 10.1093/clinchem/hvaf082 hvaf082 1 Article AcademicSubjects/MED00530 AcademicSubjects/MED00690 AcademicSubjects/SCI00980 AcademicSubjects/SCI01290 Editor's Choice Urine Cell-Free RNA vs Plasma Cell-Free RNA for Monitoring of Kidney Injury and Immune Complications Mzava Omary  Meinig School of Biomedical Engineering, Cornell University Ithaca, NY United States Agun Glory Feyisayo  Meinig School of Biomedical Engineering, Cornell University Ithaca, NY United States Loy Conor J  Meinig School of Biomedical Engineering, Cornell University Ithaca, NY United States Gonzalez-Bocco Isabel Helena  Division of Infectious Disease, Brigham and Women’s Hospital  Department of Medical Oncology, Dana Farber Cancer Institute Boston, MA Djomnang Kounatse Liz-Audrey  Meinig School of Biomedical Engineering, Cornell University Ithaca, NY United States Bliss Andrew  Meinig School of Biomedical Engineering, Cornell University Ithaca, NY United States Wells Sophia L  Division of Renal Medicine, Brigham and Women's Hospital Boston, MA United States  Adult Survivorship Program, Dana Farber Cancer Institute Boston, MA United States Lenz Joan  Meinig School of Biomedical Engineering, Cornell University Ithaca, NY United States Belcher Emma  Meinig School of Biomedical Engineering, Cornell University Ithaca, NY United States Chen Kaiwen  Division of Infectious Disease, Brigham and Women’s Hospital Koo Sophia  Division of Infectious Disease, Brigham and Women’s Hospital  Harvard Medical School Baden Lindsey Robert  Division of Infectious Disease, Brigham and Women’s Hospital  Harvard Medical School Chu Tinyi  Meinig School of Biomedical Engineering, Cornell University Ithaca, NY United States Cheng Matthew Pellan  Division of Infectious Disease, Brigham and Women’s Hospital  Department of Medical Oncology, Dana Farber Cancer Institute Boston, MA Ritz Jerome  Department of Medical Oncology, Dana Farber Cancer Institute Boston, MA  Harvard Medical School https://orcid.org/0000-0002-5747-2151 Gupta Shruti  Division of Renal Medicine, Brigham and Women's Hospital Boston, MA United States  Adult Survivorship Program, Dana Farber Cancer Institute Boston, MA United States  Harvard Medical School De Vlaminck Iwijn  Meinig School of Biomedical Engineering, Cornell University Ithaca, NY United States Address correspondence to this author at: Meinig School of Biomedical Engineering, Cornell University, 301 Weill Hall, 526 North Campus Road, Ithaca, NY 14853, United States. Tel 650-798-4570; e-mail: vlaminck@cornell.edu Omary Mzava and Glory Feyisayo Agun contributed equally. Shruti Gupta and Iwijn De Vlaminck contributed equally. 10 2025 12 8 2025 71 10 498213 1058 1066 25 3 2024 10 6 2025 12 08 2025 03 10 2025 03 10 2025 © Association for Diagnostics & Laboratory Medicine 2025. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs licence ( https://creativecommons.org/licenses/by-nc-nd/4.0/ Abstract Background There is increasing interest in the use of circulating cell-free RNA (cfRNA) in plasma as an analyte for diagnosing and monitoring disease. While it is known that cfRNA can also be isolated from urine, the diagnostic potential of urine cfRNA, particularly relative to plasma cfRNA, remains underexplored. Methods Matched plasma and urine were collected from hematopoietic stem cell transplant (HSCT) recipients ( n n n Results Urine and plasma cfRNA displayed distinct molecular composition and cellular origin across all groups. In HSCT, pronounced changes in plasma cfRNA were detected during the course of treatment, while urine cfRNA changes were minimal. Conversely, when comparing ICI recipients with and without AKI, cfRNA signatures indicative of disease and AKI etiology were observed in urine but not in plasma. These urine-derived signatures included injury markers and immune transcripts consistent with localized renal inflammation. Conclusions This study reveals the distinct origin and diagnostic utility of plasma and urine cfRNA and suggests urine cfRNA is a promising analyte to monitor kidney injury, especially in the context of AKI following ICI treatment. National Institutes of Health 10.13039/100000002 R01AI146165 K23DK125672 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction There is increasing interest in the use of circulating cell-free RNA (cfRNA) in plasma as an analyte for diagnosing and monitoring disease, with applications spanning cancer diagnosis, maternal health monitoring, and infectious disease testing ( 1–6 7–9 Here, we present a comprehensive comparison of plasma and urine cfRNA in 3 carefully selected cohorts: healthy volunteers, hematopoietic stem cell transplant (HSCT) recipients, and immune-checkpoint inhibitor (ICI) treated patients. HSCT recipients undergo immune changes and experience frequent complications, providing a model of systemic change ( 10 11 12 13 a b c Materials and Methods Patient Cohorts HSCT Patients (n = 24) Matched blood ( n n Patients Receiving ICIs (n = 46) We prospectively collected blood ( n n n n n n n Plasma Cell-Free RNA Isolation Plasma samples were frozen within 4 h after collection and stored at −80°C. When required for analysis, plasma samples were thawed at room temperature and centrifuged at 1300 g 6 Urine Cell-Free RNA Isolation Urine samples were frozen within 4 h after collection. When required for analysis, the samples were thawed at room temperature and centrifuged at 16 000 g 6 Library Preparation and Sequencing Sequencing libraries were prepared and quantified from 8 μL of concentrated RNA using the Takara SMARTer ® 5 6 Cell Types of Origin Deconvolution Cell types of origin (CTO) deconvolution was performed using BayesPrism (v.2.0) ( 14 Quantification and Statistical Analyses Differential abundance analysis was carried out as previously described ( 5 6 Results Robustness of Urine cfRNA to Changes in Preanalytical Variables First, we evaluated the impact of centrifugation and the use of different preservatives on measurements of urine cfRNA features. For this purpose, urine was collected from 3 volunteers using distinct centrifugation and preservative conditions with triplicates for each condition ( n Supplemental Materials Supplemental Figs. 1–3 Clinical Study Design We isolated and sequenced cell-free RNA from a total of 297 plasma and urine samples from healthy volunteers ( n n n n Fig. 1A Supplemental Table 1 n n n n n n Fig. 1. Properties and cellular origins of urine and plasma cfRNA. (A), Study design (created with BioRender.com); (B), stacked bar plot of mean fraction of biotypes in each cohort; (C), grouped box plot of transcriptome Gini index calculated from the healthy cohort. * P P P n https://academic.oup.com/clinchem Origins of Plasma Cell-Free RNA and Urine Cell-Free RNA We first examined the properties of urine cfRNA and plasma cfRNA, focusing on RNA-seq insert size, RNA species composition, transcript diversity, and CTO. The insert sizes of cfRNA in both urine and plasma were similar and exhibited a broad distribution (mean insert lengths 152 ± 30 and 146 ± 24.6 bp for plasma and urine cfRNA, respectively, Supplemental Fig. 4A Fig. 1B To quantify the diversity of the cfRNA transcriptomes, we calculated the Gini index that measures deviation from a uniform distribution. We observed significantly higher Gini indices for plasma compared to urine, indicating that a smaller number of genes contribute a greater number of reads in plasma cfRNA compared to urine cfRNA (2-tailed, Wilcoxon rank sum test, P P Fig. 1C Supplemental Fig. 4B RN7SL1 TPT1 FTH1 MT-RNR2 RN7SL1 ACTB Next, we examined the cell types that contribute cfRNA to the mixtures in plasma and urine. Here, we used BayesPrism ( 14 Supplemental Table 2 Fig. 1D Supplemental Fig. 5 Monitoring of Immune Activity Using Urine and Plasma Cell-Free RNA in HSCT We next investigated the utility of urine vs plasma cfRNA for monitoring immune dynamics and systemic injury in the context of HSCT, a primary treatment for hematologic malignancies. HSCT recipients undergo intensive chemotherapy conditioning prior to donor stem cell infusion to reduce disease burden, suppress the recipient's immune system, and ensure successful engraftment of donor stem cells ( 10 11 Fig 2A P Fig. 2B n n n n Fig. 2C Fig. 2C Supplemental Materials Supplemental Fig. 6A, B Fig. 2. Monitoring systemic changes. (A), HSCT cohort samples overview (created with BioRender.com); (B), volcano plot showing differentially expressed genes in D0 vs PR and E vs D0 conditions for urine and plasma cfRNA; (C), upset plots showing the mutual exclusive and overlapping genes in each condition for urine and plasma cfRNA; (D), area plot showing average cfRNA deconvolution results at each timepoint; (E), box plots showing fraction of CTO at each timepoint. Color figure available at https://academic.oup.com/clinchem We next quantified the dynamic changes in the CTO across sampled time points to further examine the response to HSCT as measured by urine and plasma cfRNA. We observed dramatic changes in the CTO for plasma cfRNA but not urine cfRNA in response to conditioning therapy (PR vs D0) and the engraftment process (E vs D0), which agrees with the differential gene abundance analysis ( Fig. 2D Fig. 2E Supplemental Table 3 Fig. 2E Supplemental Table 3 Fig. 2E Supplemental Table 3 Supplemental Fig. 7A, B Supplemental Fig. 7C We next explored urinary tract-related injury in the HSCT cohort and discovered similar trends. Elevated levels of urinary cfRNA from bladder urothelial cells and prostate epithelium cells in samples from patients with epithelial cells clinically detected in their urine compared to those without ( P P Supplemental Fig. 8 Supplemental Fig. 9 Supplemental Table 4 Supplemental Fig. 10 Monitoring AKI and Urinary Tract-Related Complications in Patients Who Received ICI Therapy Given the direct relation between urine cfRNA and the kidney and urinary tract, we reasoned that urine cfRNA could be an informative analyte for detecting complications in these organs. To test this, we explored cfRNA signatures of different AKI etiologies in the context of ICI therapy. First, we compared the cell-type origins of urine and plasma cfRNA for patients who received ICIs and developed AKI, either from the ICI or from non-ICI-related causes, along with controls who received ICIs and did not develop AKI. Among patients with AKI compared to patients without AKI, we observed significantly higher levels of urine cfRNA derived from kidney connecting tubule epithelial cells ( P Fig. 3A B Supplemental Tables 5, 6 P Fig. 3A B Supplemental Tables 5, 6 P P Fig. 3B Supplemental Tables 5, 6 Fig. 3. Monitoring kidney injury and complications of the urinary tract. (A), Illustration of location of kidney tubule epithelial cells and parietal epithelial cells (created with BioRender.com P P P JUN SOX9 P P P https://academic.oup.com/clinchem The CTO analysis suggested that cfRNA from kidney cells is shed in the urine, and therefore urine cfRNA biomarkers may identify AKI. To explore this, we performed differential abundance analysis comparing the AKI patient samples to the patients receiving ICIs without AKI (DESeq2, Methods). We identified 569 DAGs for the urine cfRNA comparison and zero DAGs for plasma cfRNA (BH adjusted P Fig. 3C JUND JUN 15 CEBPB, 16 SOX9 17 Fig 3D Supplemental Fig. 11 Differentiating ICI-AKI from Non-ICI-Related Causes We next investigated whether urine cfRNA can distinguish different underlying etiologies of AKI among patients receiving ICIs. For this analysis, we classified AKI etiologies into 2 groups: ATIN ( n n P Fig 3E CXCL9 CXCL10 CXCL11 Supplemental Fig. 12 n Fig. 3E Supplemental Fig. 12 Supplemental Fig. 12 Discussion In this study, we isolated urine cfRNA, measured its biophysical properties and demonstrated its diverse molecular composition and origin compared to plasma cfRNA. Our findings recapitulate some aspects of recent work by Hulstaert et al. ( 7 18 The presence of transrenal cell-free DNA in urine has been suggested in the literature ( 19–21 In HSCT, our analysis shows that plasma cfRNA more effectively captures systemic and immune dynamics compared to urine cfRNA, as evidenced by the number of DAGs, activated and inhibited pathways from pairwise differential abundance analysis and large-scale changes in the cfRNA CTO. For example, a marked decrease in the contribution of immune cells to plasma cfRNA following chemotherapy and a subsequent sharp increase following stem cell engraftment was observed. In contrast, such trends were not seen for urine cfRNA, which suggests that urine cfRNA is not a sensitive analyte to monitor systemic or immune-related changes. Conversely, our data show that urine cfRNA is more sensitive to changes in the urinary tract than plasma cfRNA, and that there may be distinct urinary cfRNA signatures depending on the underlying etiology of AKI. In the AKI cohort the differential contribution of kidney cortex cell types using both biofluids was explored. Parietal epithelial cells, which line the Bowman's capsule, show no significant differences in their cfRNA contributions from both urine and plasma. However, a significant change in the contributions of kidney tubule epithelial cells in urinary cfRNA but not plasma cfRNA in patients with AKI compared to patients without AKI was observed. Importantly, unique cfRNA signatures in the patients with ICI-related ATIN compared to patients with AKI from other causes were detected. AKI is a common complication of ICI therapy, occurring in up to 15%–20% of patients treated with ICIs ( 12 22–25 22 CXCL9 CXCL10 CXCL11 CXCL9 26 27 One technical consideration is the potential enrichment of specific RNA fragment lengths due to the use of random primers in the library preparation protocol. This approach may have led to the underrepresentation of shorter RNA fragments. In conclusion, our study provides insight into the properties and biogenesis of urinary cfRNA and demonstrates the utility of urine cfRNA as a noninvasive biomarker of kidney injury and complications of the urinary tract and genitourinary systems. Supplementary Material hvaf082_Supplementary_Data Acknowledgments We dedicate this work to Francisco Marty, our coworker and collaborator who sadly passed away during the scope of this study. We thank the Cornell Genomics Center for help with sequencing libraries, the Cornell Bioinformatics facility for computational assistance, the Pasquarello Tissue Bank in Hematologic Malignancies at the Dana Farber Cancer Institute for processing stem cell transplant samples, and members of the I.D.V. laboratory for helpful discussions on CTO deconvolution. Data Availability RNA Gene Expression data are available at the National Center for Biotechnology Information Gene Expression Omnibus database ( GSE261018 https://github.com/omrmzv/urine_cfRNA_study https://doi.org/10.5281/zenodo.15730568 Supplemental Material Supplemental material is available at Clinical Chemistry Nonstandard Abbreviations cfRNA, circulating cell-free RNA; HSCT, hematopoietic stem cell transplant; ICI, immune-checkpoint-inhibitor; AKI, acute kidney injury; RNA-seq, RNA sequencing; ATIN, acute tubulointerstitial nephritis; ATN, acute tubular necrosis; CTO, cell types of origin. Human Genes  RN7SL1 TPT1 FTH1 MT-RNR2 ACTB JUN JUND CEBPB SOX9 CXCL9 CXCL10 CXCL11 Author Contributions  The corresponding author takes full responsibility that all authors on this publication have met the following required criteria of eligibility for authorship: (a) significant contributions to the conception and design, acquisition of data, or analysis and interpretation of data; (b) drafting or revising the article for intellectual content; (c) final approval of the published article; and (d) agreement to be accountable for all aspects of the article thus ensuring that questions related to the accuracy or integrity of any part of the article are appropriately investigated and resolved. Nobody who qualifies for authorship has been omitted from the list. Authors’ Disclosures or Potential Conflicts of Interest  Upon manuscript submission, all authors completed the author disclosure form. Research Funding This work was supported by the National Institutes of Health grant R01AI146165 (to M.P. Cheng, J. Ritz, I. De Vlaminck), National Institutes of Health grant NIH, NIDDK K23DK125672 (to S. Gupta), and Wong foundational grant from Dana Farber Cancer Institute (DFCI). M.P. Cheng received research support from the Canadian Institutes of Health Research and McGill University Health Center Department of Medicine. Disclosures O. Mzava, C.J. Loy, L.D. Kounatse, M.P. Cheng, J.Ritz, G.F. Agun, and I. De Vlaminck are inventors on submitted patents pertaining to cell-free nucleic acids. I. De Vlaminck is a member of the Scientific Advisory Board of Karius Inc., Kanvas Biosciences, Inc. and GenDX. I. De Vlaminck receives consulting fees from Eurofins Viracor. J.Ritz receives research support from Kite/Gilead, Novartis, and Oncternal Therapeutics; serves on advisory boards for Astraveus, Stratus Therapeutics, LifeVault Bio, Tolerance Bio, Triarm Therapeutics, and Smart Immune; and receives royalties paid to DFCI relating to licensing. I. De Vlaminck and M.P. Cheng are co-founders of Kanvas Biosciences, Inc. and own equity in the company. S.Koo is a member of the Data Safety Monitoring board at Generate Biomedicines, Inc. and has received research support from NIH. M.P. Cheng has received research support from McGill Interdisciplinary Initiative in Infection and Immunity and research contracts from Cidara Therapeutics, Scynexis, Inc., and Amplyx pharmacuticals; royalties from DFCI for patents pending; receives consulting fees from AstraZeneca, Takeda, and Pfizer; received payment from Takeda and AstraZeneca for presentations and educational events and from Merck as a scientific consultant; and received stock options from Gen1E Lifesciences and Nomic Bio, Inc. S. Gupta reports research funding from NIDDK R03DK141708, BTG International, Janssen, and AstraZeneca outside the submitted work; is a consultant for Secretome, Proletariat Therapeutics, Mersana Therapeutics, MediBeacon, and Alexion, and has served on the advisory board for Orion Pharma. S. Gupta is the Founder and President Emeritus of the American Society of Onconephrology (unpaid). Role of Sponsor The funding organizations played no role in the design of study, choice of enrolled patients, review and interpretation of data, preparation of manuscript, or final approval of manuscript. References 1 Moufarrej MN Vorperian SK Wong RJ Campos AA Quaintance CC Sit RV et al Early prediction of preeclampsia in pregnancy with cell-free RNA Nature 2022 602 689 94 35140405 10.1038/s41586-022-04410-z PMC8971130 2 Larson MH Pan W Kim HJ Mauntz RE Stuart SM Pimentel M et al A comprehensive characterization of the cell-free transcriptome reveals tissue- and subtype-specific biomarkers for cancer detection Nat Commun 2021 12 2357 33883548 10.1038/s41467-021-22444-1 PMC8060291 3 Roskams-Hieter B Kim HJ Anur P Wagner JT Callahan R Spiliotopoulos E et al Plasma cell-free RNA profiling distinguishes cancers from pre-malignant conditions in solid and hematologic malignancies NPJ Precis Oncol 2022 6 28 35468987 10.1038/s41698-022-00270-y PMC9038724 4 Loy C Ahmann L De Vlaminck I Gu W Liquid biopsy based on cell-free DNA and RNA Annu Rev Biomed Eng 2024 26 169 95 38346275 10.1146/annurev-bioeng-110222-111259 5 Loy CJ Sotomayor-Gonzalez A Servellita V Nguyen J Lenz J Bhattacharya S et al Nucleic acid biomarkers of immune response and cell and tissue damage in children with COVID-19 and MIS-C Cell Rep Med 2023 4 101034 37279751 10.1016/j.xcrm.2023.101034 PMC10121104 6 Chang A Loy CJ Eweis-LaBolle D Lenz JS Steadman A Andgrama A et al Circulating cell-free RNA in blood as a host response biomarker for detection of tuberculosis Nat Commun 2024 15 4949 38858368 10.1038/s41467-024-49245-6 PMC11164910 7 Hulstaert E Morlion A Avila Cobos F Verniers K Nuytens J Vanden Eynde E et al Charting extracellular transcriptomes in the human biofluid RNA atlas Cell Rep 2020 33 108552 33378673 10.1016/j.celrep.2020.108552 8 Liu Z Wang T Yang X Zhou Q Zhu S Zeng J et al Polyadenylation ligation-mediated sequencing (PALM-seq) characterizes cell-free coding and non-coding RNAs in human biofluids Clin Transl Med 2022 12 e987 35858042 10.1002/ctm2.987 PMC9299576 9 Zhao A Péoc’h M Cottier M Genin C Mottet N Li G Cell-free RNA content in urine as a possible molecular diagnostic tool for clear cell renal cell carcinoma Int J Cancer 2015 136 2610 5 25379634 10.1002/ijc.29313 10 Gratwohl A Baldomero H Aljurf M Pasquini MC Bouzas LF Yoshimi A et al Hematopoietic stem cell transplantation: a global perspective JAMA 2010 303 1617 24 20424252 10.1001/jama.2010.491 PMC3219875 11 Cheng AP Cheng MP Loy CJ Lenz JS Chen K Smalling S et al Cell-free DNA profiling informs all major complications of hematopoietic cell transplantation Proc Natl Acad Sci U S A 2022 119 e2113476118 35058359 10.1073/pnas.2113476118 PMC8795552 12 Meraz-Muñoz A Amir E Ng P Avila-Casado C Ragobar C Chan C et al Acute kidney injury associated with immune checkpoint inhibitor therapy: incidence, risk factors and outcomes J Immunother Cancer 2020 8 e000467 32601079 10.1136/jitc-2019-000467 PMC7326260 13 Isik B Alexander MP Manohar S Vaughan L Kottschade L Markovic S et al Biomarkers, clinical features, and rechallenge for immune checkpoint inhibitor renal immune-related adverse events Kidney Int Rep 2021 6 1022 31 33912752 10.1016/j.ekir.2021.01.013 PMC8071627 14 Chu T Wang Z Pe’er D Danko CG Cell type and gene expression deconvolution with BayesPrism enables Bayesian integrative analysis across bulk and single-cell RNA sequencing in oncology Nat Cancer 2022 3 505 17 35469013 10.1038/s43018-022-00356-3 PMC9046084 15 Ruiz EJ Lan L Diefenbacher ME Riising EM Costa CD Chakraborty A et al Jund, not c-jun, is the AP-1 transcription factor required for ras-induced lung cancer JCI Insight ASCI 2021 6 e124985 10.1172/jci.insight.124985 PMC8410048 34236045 16 Westin ER Khodadadi-Jamayran A Pham LK Tung ML Goldman FD CRISPR screen identifies CEBPB as contributor to dyskeratosis congenita fibroblast senescence via augmented inflammatory gene response G3 2023 13 jkad207 37717172 10.1093/g3journal/jkad207 PMC10627266 17 Aggarwal S Wang Z Rincon Fernandez Pacheco D Rinaldi A Rajewski A Callemeyn J et al SOX9 switch links regeneration to fibrosis at the single-cell level in mammalian kidneys Science 2024 383 eadd6371 38386758 10.1126/science.add6371 PMC11345873 18 Vorperian SK DeFelice BC Buonomo JA Chinchinian HJ Gray IJ Yan J et al Deconvolution of Human Urine across the Transcriptome and Metabolome. Clin Chem 10.1093/clinchem/hvae137 PMC11927302 39383112 19 Botezatu I Serdyuk O Potapova G Shelepov V Alechina R Molyaka Y et al Genetic analysis of DNA excreted in urine: a new approach for detecting specific genomic DNA sequences from cells dying in an organism Clin Chem 2000 46 1078 84 10926886 20 Burnham P Dadhania D Heyang M Chen F Westblade LF Suthanthiran M et al Urinary cell-free DNA is a versatile analyte for monitoring infections of the urinary tract Nat Commun 2018 9 2412 29925834 10.1038/s41467-018-04745-0 PMC6010457 21 Dermody SM Bhambhani C Swiecicki PL Brenner JC Tewari M Trans-renal cell-free tumor DNA for urine-based liquid biopsy of cancer Front Genet 2022 13 879108 35571046 10.3389/fgene.2022.879108 PMC9091346 22 Gupta S Short SAP Sise ME Prosek JM Madhavan SM Soler MJ et al Acute kidney injury in patients treated with immune checkpoint inhibitors J Immunother Cancer 2021 9 e003467 34625513 10.1136/jitc-2021-003467 PMC8496384 23 Manohar S Kompotiatis P Thongprayoon C Cheungpasitporn W Herrmann J Herrmann SM Programmed cell death protein 1 inhibitor treatment is associated with acute kidney injury and hypocalcemia: meta-analysis Nephrol Dial Transplant 2019 34 108 17 29762725 10.1093/ndt/gfy105 24 Cortazar FB Kibbelaar ZA Glezerman IG Abudayyeh A Mamlouk O Motwani SS et al Clinical features and outcomes of immune checkpoint inhibitor–associated AKI: a multicenter study J Am Soc Nephrol 2020 31 435 46 31896554 10.1681/ASN.2019070676 PMC7003302 25 Espi M Teuma C Novel-Catin E Maillet D Souquet PJ Dalle S et al Renal adverse effects of immune checkpoints inhibitors in clinical practice: ImmuNoTox study Eur J Cancer 2021 147 29 39 33607383 10.1016/j.ejca.2021.01.005 26 Moledina DG Obeid W Smith RN Rosales I Sise ME Moeckel G et al Identification and validation of urinary CXCL9 as a biomarker for diagnosis of acute interstitial nephritis J Clin Invest 2023 133 e168950 37395276 10.1172/JCI168950 PMC10313360 27 Tokunaga R Zhang W Naseem M Puccini A Berger MD Soni S et al CXCL9, CXCL10, CXCL11/CXCR3 axis for immune activation—a target for novel cancer therapy Cancer Treat Rev 2018 63 40 7 29207310 10.1016/j.ctrv.2017.11.007 PMC5801162 ",
  "metadata": {
    "Title of this paper": "CXCL9, CXCL10, CXCL11/CXCR3 axis for immune activation—a target for novel cancer therapy",
    "Journal it was published in:": "Clinical Chemistry",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490885/"
  }
}