{
  "title": "Paper_128",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12488663 PMC12488663.1 12488663 12488663 10.3389/fimmu.2025.1677723 1 Immunology Case Report Case report and literature review: tislelizumab combined with lenvatinib and polymeric micellar paclitaxel for thymic squamous cell carcinoma Chen Jingwen  1  2  † Wang Yihan  1  † Shou Minyue  3 Qian Jieyi  1 Ma Ling  1  2 Shu Yongqian  1  2  *  1 Department of Oncology, The First Affiliated Hospital with Nanjing Medical University, Nanjing Medical University Nanjing, Jiangsu China  2 Collaborative Innovation Center for Cancer Personalized Medicine, Nanjing Medical University Nanjing China  3 Department of Oncology, the Affiliated Wuxi People’s Hospital of Nanjing Medical University Wuxi China Edited by: Cleber Machado-Souza Reviewed by: Zhuo Liu  Nahed Damaj *Correspondence: Yongqian Shu, shuyongqian@csco.org.cn †These authors have contributed equally to this work 18 9 2025 2025 16 480569 1677723 01 8 2025 03 9 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Chen, Wang, Shou, Qian, Ma and Shu. 2025 Chen, Wang, Shou, Qian, Ma and Shu https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Thymic squamous cell carcinoma (TSCC) is a rare malignancy with an annual incidence of 0.15–0.32 per 100,000 population and exhibits aggressive behavior including early metastasis. Anti-PD-1 immunotherapy combined with chemotherapy has emerged as a potential strategy for TSCC. We report a 60-year-old male with a 1-month history of persistent dry cough and generalized fatigue. Diagnostic evaluation revealed advanced TSCC (cT3N2M1b), with bilateral lung, right pleural, left adrenal, mediastinal and right hilar lymph nodes metastases. Significantly elevated CA125 and CYFRA211 levels were observed. Initial first-line carboplatin plus polymeric micellar paclitaxel (PM-PTX) stabilized the disease. Subsequent adjustments to the immunotherapy regimen led to a two-phase approach combining tislelizumab, lenvatinib, PM-PTX, with or without carboplatin. This strategy achieved sustained tumor burden reduction with improved quality of life and nutritional status throughout treatment, without significant immune-related adverse events (irAEs). Additionally, we discuss the mechanisms of combination therapy, immunotherapy toxicities in thymic malignancies, and propose personalized combination strategies to guide clinicians in selecting treatment options. advanced thymic squamous cell carcinoma immunotherapy irAEs case report literature review The author(s) declare financial support was received for the research and/or publication of this article. This work was supported by the National Natural Science Foundation of China (grant no.82172889), Jiangsu Provincial Medical Innovation Center (grant no. CXZX202204), and Postgraduate Research & Practice Innovation Program of Jiangsu Province (grant no. KYCX24_2037). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Cancer Immunity and Immunotherapy Introduction Thymic carcinoma is a rare anterior mediastinal malignancy with an annual incidence of 0.07 to 0.38/100,000 and a 55% 5-year survival rate ( 1 2 1 3 2 3 4 Immune checkpoint inhibitors targeting PD-1/PD-L1 have shown promise in thymic carcinoma. Giaccone et al. reported pembrolizumab’s efficacy as second-line therapy, albeit with higher incidence of severe immune-related adverse events (irAEs, 15%) compared to other tumor types ( 5 6 Here, we describe an advanced metastatic TSCC patient successfully treated with tislelizumab (anti-PD-1), lenvatinib, and polymeric micellar paclitaxel (PM-PTX), achieving tumor reduction while preserving quality of life through regimen adjustment. We also review the mechanisms underlying the enhanced anti-tumor efficacy of combination therapy, analyze patient selection criteria suitable for immunotherapy, and propose personalized combination strategies. Case presentation In February 2024, a 60-year-old male patient presented with a 1-month history of a dry cough and fatigue without an apparent cause, which prompted a visit to a local hospital. A chest computed tomography (CT) scan revealed a right lung mass. For further evaluation and treatment, the patient was admitted to our oncology department on March 1, 2024. Enhanced chest and whole-abdomen CT scan showed a space-occupying lesion in the right middle lobe (RML) of the lung, multiple solid nodules in both lungs, multiple soft tissue density shadows in the right pleura, an inhomogeneous enhancing lesion in the left adrenal gland, a mass-like soft tissue density shadow in the anterior mediastinum, and multiple enlarged lymph nodes in the mediastinum and right hilum (  Figure 1  Figure 2  Supplementary Table 1  Figure 3 Figure 1 Comparative chest CT scans illustrating the progression of pulmonary lesions throughout the patient’s treatment course. (A) (B) (C) (D) (E) CT scan series showing five rows labeled A to E and four columns with dates and treatment stages: Diagnosis, Chemotherapy, Combination Therapy 1, and Combination Therapy 2. Red arrows indicate areas of interest in each scan. Figure 2 Histopathology and immunohistochemistry of the right lung lesion observed in the patient. (A) (B-I) Histological images of tissue samples labeled with different stains or markers. Image A shows H&E staining, B shows CK5/6, C shows P40, D shows P63, E shows TTF-1, F shows Napsin A, G shows CD5, H shows CD117, and I shows Ki-67. Each image displays cellular structures within 100 micrometer scale bars. Figure 3 The variations in tumor markers and leukocyte counts during patient treatment. (A) (B) (C) Three line graphs show levels of CA125, CYFRA211, and WBC over time with different treatments. Graph A displays a decrease in CA125 from 344.0 ng/ml in March 2024 to 16.1 ng/ml in November 2024 across pre-treatment, chemotherapy, and two combination therapies. Graph B shows CYFRA211 peaking at 67.4 ng/ml in March 2024 with a decline to 8.33 ng/ml in November 2024. Graph C illustrates fluctuations in WBC, holding mostly steady, ending at 5.48 × 10^9/L in November 2024. For unresectable disease, the patient underwent three cycles of first-line chemotherapy from March 7 to April 20, 2024: PM-PTX 360 mg D1 q3w + carboplatin 450 mg D1 q3w. A follow-up chest CT on April 22 showed largely unchanged lesions after treatment, resulting in an efficacy evaluation of stable disease (SD) (  Figure 1  Figure 3 To reduce tumor burden, we evaluated the feasibility of immunotherapy and oral anti-angiogenic agents. Based on the REMORA study, lenvatinib has been shown to provide survival benefits for thymic carcinoma patients who have undergone first-line platinum-based chemotherapy ( 7  Figure 3 Given the cumulative toxicity resulting from the long-term use of chemotherapeutic drugs, carboplatin was discontinued. From July 27 to November 9, 2024, the patient underwent five cycles of PM-PTX 360mg D1 q3w + tislelizumab 200mg D1 q3w + lenvatinib 8mg qd. After three cycles of combination therapy, CT on September 16 revealed further shrinkage of the primary and metastatic lesions compared to June 25, with minor chronic inflammation observed in the right lung and the lower lobe of the left lung. The efficacy was evaluated as PR, confirming that the combination therapy has effectively controlled the patient’s condition. CA125 and CYFRA211 neared normal, and WBC remains within the normal range (  Figure 3 8  Supplementary Table 2  Figure 4 Figure 4 Medical intervention schedule. SD, stable disease; PR, partial response. Timeline of a treatment pathway from February 1, 2024, to November 9, 2024. It begins with pre-treatment, followed by chemotherapy with PM-PTX and Carboplatin for 1-3 cycles, then combination therapy Stage 1 with Tislelizumab, Lenvatinib, PM-PTX, and Carboplatin for 4-6 cycles, and finally, combination therapy Stage 2 with Tislelizumab, Lenvatinib, and PM-PTX for 7-11 cycles. Key dates mark medical consultation, diagnosis, and milestones SD and PR. Discussion This case highlights the critical balance between efficacy and toxicity management in advanced TSCC. Our patient achieved sustained tumor regression through a two-phase regimen of tislelizumab, lenvatinib, PM-PTX, with or without carboplatin. Notably, the patient reported high satisfaction with treatment outcomes, citing effective tumor control without significant decline in quality of life or physical discomfort throughout the therapeutic course. This outcome underscores the potential of personalized chemo-immunotherapy combinations for aggressive malignancies. PD-1 blockade reshapes the tumor microenvironment (TME) by disrupting PD-1/PD-L1 interactions. This mechanism enhances anti-tumor immunity through dual pathways: activating effector T cells, B cells, and NK cells while simultaneously depleting immunosuppressive regulatory T cells (Tregs) and myeloid-derived suppressor cells (MDSCs) ( 9 10 11 Our analysis of published case reports/series and clinical trials of immunotherapy in thymic tumors (both first-line and later-line settings) reveals a complex efficacy-safety profile (  Table 1 5 Table 1 Summary of published cases and trials of immunotherapy in thymic tumors. Therapy line Study type Tumor type Regimen Response irAEs Reference First-line Case report (n=1) Advanced thymic carcinoma Carboplatin + nab-PTX + pembrolizumab PR (100%, 1) None ( 25 Case series (n=2/8) Advanced thymic carcinoma Tislelizumab PR (100%, 2) None ( 26 Second-line and later Phase II Recurrent thymic carcinoma Pembrolizumab CR (3%, 1) Severe cardiomyositis (7.5%, 3) ( 5 Phase II Thymic carcinoma (78.7%, 26) Pembrolizumab PR (19.2%, 5) Hepatitis (12.1%, 4) ( 27 Phase II Advanced/relapsed type B3 thymoma or thymic carcinoma Nivolumab ± ipilimumab PR (14%, 7) Neutropenia (2%, 1) ( 28 Case report (n=1) Advanced B2/B3 thymoma Nivolumab CR (100%, 1) Myocarditis (100%, 1) ( 29 Case report (n=1) KIT-mutated thymic carcinoma Pembrolizumab PD (100%, 1) None ( 30 Case report (n=1) Metastatic thymic carcinoma Carboplatin + pemetrexed + pembrolizumab PD (100%, 1) None ( 31 Case report (n=1) Thymic squamous cell carcinoma Pembrolizumab SD (100%, 1) None ( 32 Case report (n=1) Metastatic thymic carcinoma Pembrolizumab PR (100%, 1) None ( 33 Case report (n=2) Thymic epithelial tumors Gemcitabine+ carboplatin+ sintilimab (50%,1); or docetaxel+ cisplatin + tislelizumab (50%,1) SD (50%, 1) Immune myocarditis (100%, 2) ( 34 Case series (n=6/8) Advanced thymic carcinoma Tislelizumab SD (50%, 3) Adrenal insufficiency (12.5%,1) ( 26 Case report (n=1) Thymic epithelial tumors Pembrolizumab PR (100%, 1) Liver and kidney dysfunction (100%, 1) ( 35 irAEs, immune-related adverse events; CR, Complete response; PR, partial responses; SD, stable disease; PD, disease progression. For unresectable or recurrent/metastatic thymic carcinoma beyond first-line therapy, identifying irAE-prone populations is critical. TSCC patients with chronic obstructive pulmonary disease (COPD), autoimmune diseases, or long-term immunosuppressive therapy exhibit heightened susceptibility to irAEs such as pneumonitis ( 12 Chemotherapy exerts dual effects on immunity. While primarily inhibiting tumor proliferation via DNA disruption, its non-selective cytotoxicity significantly suppresses immune function by depleting rapidly dividing lymphocytes, particularly effector T cells, B cells, and NK cells. For instance, peripheral T cells of cancer patients can decrease by up to 75% following cyclophosphamide chemotherapy ( 13 14 15 Critically, the combination of chemotherapy with immunotherapy has demonstrated synergistic efficacy, facilitates the formation of immune memory, and is associated with reduced irAEs versus monotherapy ( 16 17 18 Notably, Lenvatinib remodels TME through dual mechanisms. It normalizes tumor vasculature by inhibiting VEGFR/FGFR signaling, reducing vascular endothelial-cadherin density and enhancing T-cell infiltration. Concurrently, it depletes immunosuppressive cells (e.g., tumor-associated macrophages and MDSCs) and promotes M1 macrophage polarization ( 19 20 21 Lenvatinib’s role in this regimen is supported by the single-arm phase 2 REMORA trial and the recent long-term follow up, which reported a 38% ORR (90% CI 25.6-52.0) and 28.3-month median OS (95% CI 17.1-34.0) in platinum-pretreated unresectable advanced or metastatic thymic carcinoma patients receiving lenvatinib monotherapy (24 mg/day), though with 64% incidence of grade ≥3 hypertension ( 6 7 Additionally, our triple combination finds support in translational and clinical precedents. The PECATI trial demonstrated that lenvatinib plus pembrolizumab shows promising activity in pretreated thymic tumors, while studies in hepatocellular carcinoma have established the efficacy and safety of tislelizumab plus lenvatinib combination therapy ( 22 23 The strategy of balancing chemo-immunotherapy involves several key aspects. Firstly, baseline differences such as nutritional status and mental state can significantly influence their response and tolerance of treatment. Therefore, personalized strategy should be formulated based on various factors, including the patient’s PS score, pathological type, TNM stage, and PD-L1 expression level. Secondly, the sequence of administration in combination therapy is crucial. Administering chemotherapy drugs prior to immunotherapy may yield favorable therapeutic effects by prematurely activating the immune system. Thirdly, the selection of chemotherapy and immunotherapy drugs is critical, as opting for multi-target chemotherapy agents can enhance the efficacy of immunotherapy. Fourthly, the incidence and severity of adverse reactions may differ among various immunotherapy agents, making it essential to promptly transition to those that provide improved safety and tolerability for patients. In suitable cases, de-escalation of immunotherapy may be considered, such as shifting from a dual-target CTLA-4 + PD-1 bispecific antibody to a PD-1 monoclonal antibody ( 24 In this case, during the second phase of immunotherapy, carboplatin was omitted, and only PM-PTX were administered. This strategy not only decreased the cumulative toxicity associated with carboplatin but also maintained a balance between chemotherapy and immunotherapy, thereby sustaining the antitumor effect and facilitating a continuous reduction of tumor burden. Conclusion This case supports tislelizumab + lenvatinib + PM-PTX as an effective regimen for advanced TSCC after platinum stabilization, providing tumor control with preserved quality of life. Consider this approach when first-line response is suboptimal, with vigilant toxicity monitoring and regimen tailoring to maintain safety. Abbreviations TSCC, thymic squamous cell carcinoma; PM-PTX, polymeric micellar paclitaxel; irAEs, immune-related adverse events; IHC, immunohistochemistry; CT, computed tomography; RML, right middle lobe; SD, stable disease; PR, partial response; WBC, white blood cell; Tregs, regulatory T cells; MDSCs, myeloid-derived suppressor cells; ICD, immunogenic cell death; DAMPs, damage associated molecular patterns; COPD, chronic obstructive pulmonary disease; PS, performance status; NGS, Next-generation sequencing. Data availability statement The original contributions presented in the study are included in the article/  Supplementary Material Ethics statement Written informed consent was obtained from the individuals for the publication of any potentially identifiable images or data included in this article. Author contributions JC: Investigation, Funding acquisition, Resources, Writing – original draft. YW: Writing – original draft, Formal analysis. MS: Writing – original draft, Data curation, Methodology. JQ: Writing – original draft, Data curation, Methodology. LM: Data curation, Conceptualization, Writing – review & editing. YS: Funding acquisition, Resources, Methodology, Project administration, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fimmu.2025.1677723/full#supplementary-material References 1 Falkson CB Vella ET Ellis PM Maziak DE Ung YC Yu E Surgical, radiation, and systemic treatments of patients with thymic epithelial tumors: A systematic review J Thorac Oncol Off Publ Int Assoc Study Lung Cancer 2023 18 299 312 10.1016/j.jtho.2022.10.016 36343922 2 Basse C Girard N Thymic tumours and their special features Eur Respir Rev Off J Eur Respir Soc 2021 30 200394 10.1183/16000617.0394-2020 34670805 PMC9488894 3 Roden AC Ahmad U Cardillo G Girard N Jain D Marom EM Thymic carcinomas-A concise multidisciplinary update on recent developments from the thymic carcinoma working group of the international thymic Malignancy interest group J Thorac Oncol Off Publ Int Assoc Study Lung Cancer 2022 17 637–50 10.1016/j.jtho.2022.01.021 35227908 PMC11080660 4 Serpico D Trama A Haspinger ER Agustoni F Botta L Berardi R Available evidence and new biological perspectives on medical treatment of advanced thymic epithelial tumors Ann Oncol Off J Eur Soc Med Oncol 2015 26 838–47 10.1093/annonc/mdu527 25411417 5 Giaccone G Kim C Thompson J McGuire C Kallakury B Chahine JJ Pembrolizumab in patients with thymic carcinoma: a single-arm, single-centre, phase 2 study Lancet Oncol 2018 19 347–55 10.1016/S1470-2045(18)30062-7 29395863 PMC10683856 6 Sato J Satouchi M Itoh S Okuma Y Niho S Mizugaki H Lenvatinib in patients with advanced or metastatic thymic carcinoma (REMORA): a multicentre, phase 2 trial Lancet Oncol 2020 21 843–50 10.1016/S1470-2045(20)30162-5 32502444 7 Niho S Sato J Satouchi M Itoh S Okuma Y Mizugaki H Long-term follow-up and exploratory analysis of lenvatinib in patients with metastatic or recurrent thymic carcinoma: Results from the multicenter, phase 2 REMORA trial Lung Cancer Amst Neth 2024 191 107557 10.1016/j.lungcan.2024.107557 38626709 8 Dougan M Luoma AM Dougan SK Wucherpfennig KW Understanding and treating the inflammatory adverse events of cancer immunotherapy Cell 2021 184 1575–88 10.1016/j.cell.2021.02.011 33675691 PMC7979511 9 Chu X Tian W Wang Z Zhang J Zhou R Co-inhibition of TIGIT and PD-1/PD-L1 in cancer immunotherapy: mechanisms and clinical trials Mol Cancer 2023 22 93 10.1186/s12943-023-01800-3 37291608 PMC10249258 10 Pang K Shi Z-D Wei L-Y Dong Y Ma Y-Y Wang W Research progress of therapeutic effects and drug resistance of immunotherapy based on PD-1/PD-L1 blockade Drug Resist Update Rev Comment Antimicrob Anticancer Chemother 2023 66 100907 10.1016/j.drup.2022.100907 36527888 11 Anderson HG Takacs GP Harris DC Kuang Y Harrison JK Stepien TL Global stability and parameter analysis reinforce therapeutic targets of PD-L1-PD-1 and MDSCs for glioblastoma J Math Biol 2023 88 10 10.1007/s00285-023-02027-y 38099947 PMC10724342 12 Whittaker H Rubino A Müllerová H Morris T Varghese P Xu Y Frequency and severity of exacerbations of COPD associated with future risk of exacerbations and mortality: A UK routine health care data study Int J Chron Obstruct Pulmon Dis 2022 17 427–37 10.2147/COPD.S346591 35264849 PMC8901192 13 Cheng Y Xu S Pei R Chen D Du X Li S Etoposide + cytarabine + pegfilgrastim versus cyclophosphamide + G-CSF for stem cell mobilization in patients with poorly mobilized multiple myeloma and lymphoma Transfus Apher Sci Off J World Apher Assoc Off J Eur Soc Haemapheresis 2025 64 104096 10.1016/j.transci.2025.104096 39983375 14 Smith TM Butler SE Wang X-YS Manjili MH Low-dose chemotherapy induces immunogenic tumor dormancy in mouse mammary carcinoma cells J Immunol 2017 198 204 10.4049/jimmunol.198.Supp.204.14 15 Li P Wang W Wang S Cao G Pan T Huang Y PTPRC promoted CD8+ T cell mediated tumor immunity and drug sensitivity in breast cancer: based on pan-cancer analysis and artificial intelligence modeling of immunogenic cell death-based drug sensitivity stratification Front Immunol 2023 14 1145481 10.3389/fimmu.2023.1145481 37388747 PMC10302730 16 Li H Liu Q Li B Chen Y Lin J Meng Y Comparison of short-term efficacy of neoadjuvant immunotherapy combined with chemotherapy and surgery alone for locally advanced resectable Non-small cell lung cancer Zhongguo Fei Ai Za Zhi Chin J Lung Cancer 2024 27 421–30 10.3779/j.issn.1009-3419.2024.102.26 39026493 PMC11258643 17 Reck M Rodríguez-Abreu D Robinson AG Hui R Csőszi T Fülöp A Five-year outcomes with pembrolizumab versus chemotherapy for metastatic non-small-cell lung cancer with PD-L1 tumor proportion score ≥ 50 J Clin Oncol 2021 39 2339–49 10.1200/jco.21.00174 33872070 PMC8280089 18 Garassino MC Gadgeel S Speranza G Felip E Esteban E Dómine M Pembrolizumab plus pemetrexed and platinum in nonsquamous non-small-cell lung cancer: 5-year outcomes from the phase 3 KEYNOTE-189 study J Clin Oncol 2023 41 1992–8 10.1200/jco.22.01989 36809080 PMC10082311 19 Chen Y Dai S Cheng CS Chen L Lenvatinib and immune-checkpoint inhibitors in hepatocellular carcinoma: mechanistic insights, clinical efficacy, and future perspectives J Hematol Oncol 2024 17 130 10.1186/s13045-024-01647-1 39709431 PMC11663365 20 Sun Q Shen M Zhu S Liao Y Zhang D Sun J Targeting NAD(+) metabolism of hepatocellular carcinoma cells by lenvatinib promotes M2 macrophages reverse polarization, suppressing the HCC progression Hepatol Int 2023 17 1444–60 10.1007/s12072-023-10544-7 37204655 21 Zhu J Fang P Wang C Gu M Pan B Guo W The immunomodulatory activity of lenvatinib prompts the survival of patients with advanced hepatocellular carcinoma Cancer Med 2021 10 7977–87 10.1002/cam4.4312 34605616 PMC8607247 22 Remon J Girard N Novello S de Castro J Bigay-Game L Bernabé R PECATI: A multicentric, open-label, single-arm phase II study to evaluate the efficacy and safety of pembrolizumab and lenvatinib in pretreated B3-thymoma and thymic carcinoma patients Clin Lung Cancer 2022 23 e243–6 10.1016/j.cllc.2021.07.008 34393061 23 Xu L Chen J Liu C Song X Zhang Y Zhao H Efficacy and safety of tislelizumab plus lenvatinib as first-line treatment in patients with unresectable hepatocellular carcinoma: a multicenter, single-arm, phase 2 trial BMC Med 2024 22 172 10.1186/s12916-024-03356-5 38650037 PMC11036623 24 Milberg O Gong C Jafarnejad M Bartelink IH Wang B Vicini P A QSP model for predicting clinical responses to monotherapy, combination and sequential therapy following CTLA-4, PD-1, and PD-L1 checkpoint blockade Sci Rep 2019 9 11286 10.1038/s41598-019-47802-4 31375756 PMC6677731 25 Nishii Y Furuhashi K Ito K Sakaguchi T Suzuki Y Fujiwara K Good response of advanced thymic carcinoma with low PD-L1 expression to chemotherapy plus pembrolizumab as first-line therapy and to pembrolizumab as maintenance therapy: A case report Pharm (Basel) 2022 15 889 10.3390/ph15070889 35890187 PMC9319623 26 Zhang L Zhang Y Li S Wang Y Yu Y He J Case Report: Robust and durable response to the combination of tislelizumab and chemotherapy in advanced thymic epithelial tumors: a case series Front Immunol 2025 16 1516297 10.3389/fimmu.2025.1516297 40496871 PMC12149142 27 Cho J Kim HS Ku BM Choi YL Cristescu R Han J Pembrolizumab for patients with refractory or relapsed thymic epithelial tumor: an open-label phase II trial J Clin Oncol 2019 37 2162–70 10.1200/jco.2017.77.3184 29906252 28 Girard N Ponce Aix S Cedres S Berghmans T Burgers S Toffart AC Efficacy and safety of nivolumab for patients with pre-treated type B3 thymoma and thymic carcinoma: results from the EORTC-ETOP NIVOTHYM phase II trial ESMO Open 2023 8 101576 10.1016/j.esmoop.2023.101576 37285717 PMC10265606 29 Luciano A Pietroluongo E Ottaviano M Grieco A Peddio A De Placido P Case report: Potential role of immunotherapy in thymic Malignancies: a unique case of a durable and complete response upon an immune checkpoint inhibitor Front Immunol 2024 15 1423800 10.3389/fimmu.2024.1423800 39026684 PMC11255414 30 De Pas TM Giaccone G Catania C Conforti F Pala L Mitsakis P First report of pembrolizumab activity in KIT-mutated thymic carcinoma Curr Oncol 2025 32 68 10.3390/curroncol32020068 39996868 PMC11854665 31 Thomas QD Basse C Luporsi M Girard N Pembrolizumab plus chemotherapy in metastatic thymic carcinoma: A case report Front Oncol 2021 11 814544 10.3389/fonc.2021.814544 35127529 PMC8810527 32 Cafaro A Bongiovanni A Di Iorio V Oboldi D Masini C Ibrahim T Pembrolizumab in a patient with heavily pre-treated squamous cell thymic carcinoma and cardiac impairment: A case report and literature review Front Oncol 2020 10 1478 10.3389/fonc.2020.01478 33014787 PMC7461970 33 Sakamori Y Hamada K Kawachi H Yamoto M Fukao A Terashita S Successful treatment with pembrolizumab for microsatellite instability-high thymic carcinoma: A case report Respir Med Case Rep 2025 57 102272 10.1016/j.rmcr.2025.102272 40761662 PMC12320539 34 Liu S Ma G Wang H Yu G Chen J Song W Severe cardiotoxicity in 2 patients with thymoma receiving immune checkpoint inhibitor therapy: A case report Med (Baltimore) 2022 101 e31873 10.1097/md.0000000000031873 36401466 PMC9678624 35 Shen L Chen H Wei Q Immune-therapy-related toxicity events and dramatic remission after a single dose of pembrolizumab treatment in metastatic thymoma: A case report Front Immunol 2021 12 621858 10.3389/fimmu.2021.621858 33936037 PMC8082155 ",
  "metadata": {
    "Title of this paper": "Immune-therapy-related toxicity events and dramatic remission after a single dose of pembrolizumab treatment in metastatic thymoma: A case report",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488663/"
  }
}