{
  "title": "Paper_42",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490232 PMC12490232.1 12490232 12490232 40818456 10.1016/j.xcrm.2025.102291 S2666-3791(25)00364-7 102291 1 Article High-dose ascorbic acid selectively induces pyroptosis in LKB1 Sun Xiangyu 1 3 Cai Xiaoting 1 3 Li Shangbiao 1 2 3 Pi Ruozheng 1 3 Guo Zeqin 1 3 Jiang Jiayu 1 Wang Pinhao 1 Xiong Jingrong 1 Liu Zhuangzhuang 1 Rong Zixuan 1 Yu Zihang 1 Zhang Xiaonan 1 Chen Jiaqi 1 Han Duanduan 1 Zhang Yanpei 1 Tan Jiale 1 Lin Yan 1 Zou Zhuocheng 1 Ai Haochen 1 Kang Fangfang 1 Guo Xuejun 576718933@qq.com 1 ∗ Dong Zhongyi dongzy1317@foxmail.com 1 ∗∗ Wu Dehua 18602062748@163.com 1 ∗∗∗ Bai Xue baixue1990@i.smu.edu.cn 1 4 ∗∗∗∗ 1 2 ∗ 576718933@qq.com ∗∗ dongzy1317@foxmail.com ∗∗∗ 18602062748@163.com ∗∗∗∗ baixue1990@i.smu.edu.cn 3 These authors contributed equally 4 Lead contact 16 9 2025 15 8 2025 6 9 498186 102291 13 6 2024 13 5 2025 17 7 2025 15 08 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary Liver kinase B1 (LKB1)-deficient non-small cell lung cancers (NSCLCs) exhibit primary resistance to immune checkpoint inhibitors (ICIs). The redox imbalance inherent in these tumors may represent a potential therapeutic vulnerability. High-dose ascorbic acid (AA) could induce cell redox imbalance. Here, we uncover that LKB1 deficiency upregulates the transporter GLUT1, which enables the accumulation of AA, thereby exacerbating redox imbalance in NSCLC cells. This triggers pyroptosis in LKB1-deficient NSCLC cells via the H 2 2 + + + Batf3 −/− + Graphical abstract Highlights • GLUT1-mediated AA loading enhances redox stress in LKB1-deficient NSCLC • High-dose AA induces pyroptosis in LKB1-deficient NSCLC via the ROS-caspase-3-GSDME pathway • High-dose AA-triggered pyroptosis activates DCs to drive Tpex expansion • High-dose AA enhances the response of LKB1-deficient NSCLC to anti-PD-1 therapy Sun et al. report that high-dose ascorbic acid selectively induces pyroptosis in lung cancer with LKB1 deficiency via the ROS-caspase-3-GSDME axis. This promotes dendritic cell activation and progenitor-exhausted T cell expansion, ultimately sensitizing immunotherapy in LKB1-deficient lung cancer. Keywords LKB1-deficient lung cancer immunotherapy resistance pyroptosis reactive oxygen species caspase-3 GSDME high-dose ascorbic acid dendritic cells Tpex pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: August 15, 2025 Introduction While immune checkpoint inhibitors (ICIs) have transformed the standard of care for patients with non-small cell lung cancer (NSCLC), liver kinase B1 (LKB1) mutations lead to primary resistance to ICI and are inextricably associated with a more aggressive phenotype. 1 , 2 + 3 4 , 5 , 6 , 7 As a master regulator of AMP-activated protein kinase, LKB1 safeguards metabolic homeostasis under stress. 8 , 9 10 , 11 , 12 Studies have reported that intravenous pharmacological ascorbic acid (AA) primarily inhibits tumors via exacerbating redox imbalance and epigenetic regulators. 13 , 14 , 15 KRAS BRAF 16 17 , 18 , 19 , 20 Here, we investigated the biological consequences of high-dose AA in LKB1-deficient NSCLC. Our results indicate that LKB1-deficient NSCLC cells predominantly take up AA and show vulnerability to high-dose AA-induced pyroptosis via H 2 2 Results LKB1 deficiency in NSCLC elevates GLUT1-mediated AA uptake and exacerbates redox imbalance Previous studies have reported increased ROS levels in LKB1-deficient cells. 11 , 12 , 21 Kras Trp53 G12D/+ R172H/+ Lkb1 Ctrl Figures S1 LKB1 Lkb1 Lkb1 Ctrl Figure S1 The cellular ROS levels were measured using the DCFH-DA assay. As expected, LKB1-deficient cells showed significantly higher ROS levels than LKB1-proficient cells ( Figures 1 16 22 Figures 1 S1 Figure 1 LKB1 deficiency in NSCLC elevates GLUT1-mediated AA uptake and exacerbates redox imbalance (A and B) Intracellular reactive oxygen species (ROS) levels in A549 (A) and KP (B) cell lines with LKB1 deficiency or proficiency after AA treatment or not. Left: optical density (OD) quantification by microplate reader (A549: n n (C) Quantitative reverse-transcription PCR (RT-qPCR) of relative GLUT1 expression in A549, H1944, LLC1, and KP cells with LKB1 deficiency or proficiency. (D) GLUT1 expressions in A549, LLC1, and KP cells with LKB1 deficiency or proficiency were analyzed by immunoblot. (E) Heatmap illustrating the GLUT1 expression in murine lung cancer cell lines with or without LKB1 deficiency, based on scaled Gene Expression Omnibus (GEO) RNA sequencing data. (F) IHC staining of lung adenocarcinoma tissue microarray sections with anti-LKB1 and anti-GLUT1 antibodies. Representative images were displayed (left). The IHC-score of GLUT1 in LKB1-high and LKB1-low group was compared (right). Scale bars, 1 mm, 500 μm. Mann-Whitney test was used for statistical analysis. (G) The effect of AA on intracellular ROS levels in A549 cells with GLUT1 knocked down. (H) LC-MS analysis of the intracellular levels of AA in A549 cells with or without LKB1 deficiency. Cells were treated with 10 mM AA. (I) Intracellular levels of AA in A549 and H1944 cells with or without LKB1 was detected by phosphomolybdic acid colorimetry. (J) Schematic illustration showing schedules of high-dose AA treatment in the subcutaneous tumor model of LLC-sh Lkb1 Data depict one representative experiment of three independent experiments. Unpaired t test (C, F, H, I, J), two-way ANOVA (A, B), and one-way ANOVA (G) were used for statistical analysis. Data are shown as mean ± SD. ns: p p p p p In the cellular growth milieu, extracellular AA is rapidly oxidized to dehydroascorbic acid (DHA) with an approximate half-life of 70 min. 16 , 23 24 16 Figures 1 Figure 1 Figure S2 Figures 1 S2 Figure S2 Figure S2 Figures S2 To further validate the cells’ capacity for AA uptake, we measured intracellular AA levels in LKB1-deficient and LKB1-intact cell lines treated with 10 mM AA, a high dosage previously reported for cancer therapy. Liquid chromatography-mass spectrometry (LC-MS) assessment indicated that the absence of LKB1 enhanced the cell’s ability to uptake AA ( Figures 1 S2 Figure 1 in vivo 19 , 22 Figure 1 High-dose AA selectively induces pyroptosis in LKB1-deficient NSCLC cells via activating the cleavage of GSDME Since we found that LKB1 absence enhanced cells’ ability to absorb AA, we delved deeper into the effects of high-dose AA on LKB1-deficient lung cancer. Previous studies demonstrated that high-dose AA could promote cancer cell death. 18 , 19 Figures S3 25 Figures 2 S3 26 Figure 2 Figures 2 Figure 2 High-dose AA selectively induces pyroptosis in LKB1-deficient NSCLC cells via activating the cleavage of GSDME (A) Light microscope images showing morphological changes of LKB1-deficient and LKB1-proficient lung cancer cells after being treated with PBS (vehicle, top) or AA (bottom) for 4 h. Red arrows indicated cells with morphological characteristics of pyroptosis (swelling and bubble-like protrusions appearing on cellular membrane surface). Scale bars: 50 μm. (B) Transmission electron microscopy images showing morphological characteristics of pyroptosis. Red arrows showed a lack of intact cellular membrane. Scale bars: 4 μm (left) and 1 μm (right). (C) Single sample gene set enrichment analysis (ssGSEA) scores of different programmed cell death form signatures in A549 cells treated with PBS or AA ( n (D) PI staining of A549 cells pretreated with Fer-1 or GSK’872 for 18 h, followed by AA for 4 h. Scale bars: 200 μm. (E) Release of ATP in A549 lung cancer cell supernatant after AA treatment or PBS (vehicle) tested by ENLITEN ATP assay system kit ( n (F) Release of IL-1β in A549 and H460 lung cancer cell supernatant after AA treatment or PBS (vehicle) tested by ELISA ( n (G) Relative expression of IL-1β and IL-18 in A549 cell lines after AA treatment or PBS (vehicle) tested by RT-qPCR ( n (H) Release of high-mobility group box-1 protein (HMGB1) in lung cancer cell supernatant after AA treatment or PBS tested by ELISA ( n (I) Release of HMGB1 in lung cancer cell supernatant from the cytoplasm after AA treatment or PBS tested by western blot. (J) Western blot showing the cleavage of gasdermin-E (GSDME) protein after indicated AA treatments in A549 lung cancer cells, with different time (left) and different concentrations (right). (K) Western blot showing the cleavage of GSDME protein after AA treatment or PBS in A549 and H460 lung cancer cells. (L) Western blot showing the cleavage of GSDME protein in lung cancer cells in vivo n Data depict one representative experiment of three independent experiments. Unpaired t test (E, F, H, L) and two-way ANOVA (G) were used for statistical analysis. Data are shown as mean ± SD. ns: p p p p p To further elucidate the mechanism by which high-dose AA induces cell death in LKB1-deficient lung cancer cells, we performed RNA sequencing on cells with deficient or intact LKB1 pretreated with high-dose AA or PBS and analyzed the gene expression profiles associated with different forms of programmed cell death ( Table S1 Figure 2 Figure 2 Pyroptotic cells could release damage-associated molecular patterns, such as ATP, interleukin (IL)-1β, and IL-18. 27 Figures 2 Figure 2 28 29 Figure 2 Figure 2 Mediators of pyroptosis mainly involve the gasdermin family, and current studies predominantly focus on GSDMD and GSDME. 30 , 31 Figure 2 Figure 2 Figure S3 Figures S3 In vivo Figure 2 Figure S3 Pyroptosis induced by high-dose AA depends on the H 2 2 Figure 1 2 2 32 2 2 2 2 Figures 3 Figures 3 S4 Figure 3 Figure 3 2 2 Figure 3 Pyroptosis induced by high-dose AA depends on the H 2 2 (A) Light microscopy showing pyroptotic morphology (red arrows) in A549 and H1944 cells with or without catalase (CAT, 100 μM, 3–5 min) pre-treatment, followed by high-dose AA. Scale bars: 50 μm. (B) Flow cytometry showing the effect of CAT on AA-induced pyroptosis in A549 and LLC1-shLkb1 cells, with quantitative analyses shown in the right ( n (C and D) Intracellular ROS levels in A549 cells after indicated treatments (CAT, 100 μM; NAC, 50 μM; 3–5 min pre-treatment) detected by (C) fluorescence microscopy (scale bars: 100 μm) and (D) microplate assay ( n (E) Relative released ATP in A549 supernatant after treatment tested by ENLITEN ATP assay system ( n (F) Light microscopy of A549 cells treated with caspase inhibitors (Z-DEVD-FMK or Z-VAD-FMK, 25 μM); red arrows indicate pyroptotic cells. Scale bars: 50 μm. (G) Western blotting showing the effect of CAT pre-treatment on the cleavage of caspase-3 and GSDME protein induced by high-dose AA in A549 and LLC1-sh Lkb1 (H) Western blotting showing the effect of caspase inhibitors (caspase-3 inhibitor, Z-DEVD-FMK, 25 μM; pan-caspase inhibitor, Z-VAD-FMK, 25 μM) on the cleavage of caspase-3 and GSDME protein induced by high-dose AA in A549 cell lines. Data depict one representative experiment of three independent experiments. (I) IHC staining of cleaved caspase-3 in mouse tumors after high-dose AA or vehicle treatment ( n (J) Levels of extracellular ATP, LDH, and HMGB1 in A549 supernatants with or without CASP3 knockout after AA treatment. ATP/LDH by microplate assay, HMGB1 by ELISA. Data depict one representative experiment of three independent experiments. Mann-Whitney test (I) and one-way ANOVA (B, D, E, J) were used for statistical analysis. Data are shown as mean ± SD. ns: p p p p p It was reported that ROS induces cell pyroptosis through activating caspase-3 to cleave GSDME. 31 Figures 3 S4 2 2 Figure 3 Figure 3 Figure 3 in vivo in vitro To further confirm the role of caspase-3, we used LKB1-deficient A549 cells with knockout caspase-3 by CRISPR-Cas9 ( Figure S4 Figure 3 Figure S4 Pyroptosis is typically initiated by inflammasomes that activate caspase-1 or caspase-11, leading to GSDMD cleavage. 33 Figure S4 31 34 35 Figure S4 BAX/BAK MLKL Figure S4 BAX/BAK MLKL Figure S4 Figures S4 BAX/BAK MLKL Figure S4 High-dose AA restores PD-1 blockade resistance of LKB1 deficiency in NSCLC in vivo To test the therapeutic effects of AA, we applied treatment protocols for established aggressive lung cancer mice models. Firstly, Lewis lung cancer (LLC1) and TC1 cell lines with stable knockdown of LKB1 or Ctrl were constructed ( Figures S1 S5 Figures S5 Figure S5 Figures 4 Figures 4 Lkb1 Ctrl in situ Figures 4 in vivo Figure 4 High-dose AA restores PD-1 blockade resistance of LKB1 deficiency in NSCLC in vivo (A–F) LLC1-shCtrl (A, B), LLC1-sh Lkb1 Lkb1 n n p p p p p (G–L) LLC1-shCtrl-luc cells (G–I) or LLC1-sh Lkb1 n Representative bioluminescent images (H, K) and quantification of results (I, L). Two-way ANOVA was performed. ns: p p The dose used, 4 g/kg, was chosen based on preclinical studies, and we found that it does not cause overt toxicity, as evidenced by normal blood counts, even though these cells express GLUT1 ( Figure S6 36 Figure S6 Figure S6 In conclusion, we have demonstrated that high-dose AA enhances the efficacy of ICI in LKB1-deficient lung tumors while exhibiting minimal toxicity and side effects. Notably, effective tumor control is achieved only when AA is combined with PD-1 inhibition; AA monotherapy demonstrates limited efficacy. We speculate that AA may act as an immune reserve, bolstering the overall immune response. High-dose AA remodels the TIME characterized by the infiltration of Tpex cells To evaluate the effect of high-dose AA on the immune landscape of NSCLC, we performed single-cell RNA sequencing on tumors treated with αPD-1 Ab alone or αPD-1 Ab + high-dose AA. After rigorous quality control and cellular filtration, we cataloged 44,745 cells into 10 distinct cellular lineages, annotated with canonical cell markers ( Figures 5 S7 Figure 5 Figure 5 High-dose AA remodeled the tumor immune microenvironment characterized by the infiltration of TCF1 + + (A) Left: t-distributed stochastic neighbor embedding (t-SNE) plot of 44,745 cells from lung tumor samples treated with αPD-1 Ab ( n n (B) Cluster composition of T cells. (C) Volcano plot displaying the differentially expressed genes between cells within cluster 2 and cells outside cluster 2 (red: upregulated in cluster 2). The x y p (D) Expression levels of Tcf7 p (E) Enrichment (log2 p (F) Trajectory manifold of T cells annotated by cell type using the Monocle 2 algorithm. (G) RNA velocity analysis of gene expression in T cells from αPD-1 Ab group and αPD-1 Ab+AA group, predicted by Velocyto/ScVelo. (H) Visualization and localization images (left) and quantification (right) of TCF1 (red)-expressing CD8 + n p p p Given that T cells have been regarded as the vanguard of antitumor immunity, 37 Figures S7 5 Figure 5 Tcf7 Figures 5 S7 + Figure 5 Table S2 Figure 5 + Figure S7 Trajectory analysis revealed that Tpex cells resided at the root of differentiation, which transited into exhausted effector T cells capable of performing direct tumor cell killing ( Figure 5 Figure 5 We further evaluated myeloid cells in TIME. Tumor-associated macrophages (TAMs) were aggregated and clustered into 7 clusters ( Figure S8 + + Figures S8 38 Figures S8 Next, we conducted immunofluorescence (IF) to further confirm the altered immune microenvironment. In LKB1-deficient lung orthotopic tumors, Tpex cells markedly expanded after AA or AA + αPD-1 Ab treatment, whereas αPD-1 Ab monotherapy had no effect ( Figure 5 Figure 5 + Figures S8 Figures S8 Pyroptosis induces ICD and enhances cross-presenting DC maturation, thereby driving Tpex expansion Next, we investigate why high-dose AA leads to the expansion of Tpex cells. We have confirmed that AA induces pyroptosis in vitro in vivo Table S3 Figure S9 Hmgb1 Figure S9 in vivo Figure 6 Figure 6 Figure 6 Figure 6 Pyroptosis induces immunogenic cell death and enhances cross-presenting DC maturation, thereby driving Tpex expansion (A) Left: schematic of the vaccination protocol. Right: tumor incidence in vaccinated versus control mice ( n (B) Tumor growth in vaccine ( n n (C and D) The percentages of mature DCs (CD80 + + + + + + − + + + + Lkb1 n (E) C57BL/6J background Batf3 −/− n Batf3 +/+ n Lkb1 (F) The percentages of TCF1 + − + + + + (G) Visualization and localization images (left) and quantification (right) of TCF1 + + Batf3 −/− n n One-way ANOVA (C, D, F, G) and two-way ANOVA (B, E) were performed. ∗ p p p p p To further investigate the pyroptosis-mediated ICD induced by high-dose AA treatment, we performed flow cytometry analyses on tumor-draining lymph nodes (dLNs) to assess the changes in immune cell populations. It is known that DCs are essential for antigen uptake and the subsequent regulation of immune responses in vivo + + Figure 6 + Figure 6 + + − Figure 6 Batf3 −/− + 39 Figure 6 Batf3 −/− Figure 6 Batf3 −/− Figure 6 Inner blockage of GSDME reversed the synergistic effect of high-dose AA and αPD-1 Ab therapy In light of our in vitro in vivo Lkb1 Figure S10 Lkb1 Gsdme Lkb1-sgCtrl Gsdme Figures 7 Figures 7 S10 Gsdme Figure 7 Figure 7 Inner blockage of GSDME reversed the synergistic effect of high-dose AA and anti-PD-1 therapy (A) LLC1-sh Lkb1 Lkb1 Gsdme n p p p (B) LLC1-sh Lkb1 Lkb1 Gsdme (C) Waterfall plot showing tumor volume response to the treatment (related to B). Each column represents one mouse. One-way ANOVA was performed. ∗ p (D) Left: Uniform manifold approximation and projection plot of 16, 217 cells from control ( n Gsdme n (E) Violin plot of pyroptosis score in tumor cells from the control group and the sg Gsdme p (F) The expression level of Hmgb1 Gsdme (G) Expression level of Tcf7 Gsdme p (H) mIHC assay of LLC1-sh Lkb1 Lkb1- Gsdme n (I) Quantitative analysis of the proportion of TCF1 + + + + n p p We proceeded to investigate the effect of GSDME inhibition on the functionality of these cells. Notably, tumor cells in the sg Gsdme Figure 7 Gsdme Figure 7 Gsdme Figure S10 Besides, we found that the sg Gsdme Tcf7 Spp1 Figures 7 S10 + + + Gsdme Figures 7 S10 Discussion This study proposes a strategy to reverse resistance to immune checkpoint inhibitors therapy by leveraging the unique features of LKB1-deficient NSCLC. By exploiting the inherent redox imbalance in LKB1-deficient NSCLC cells, we discovered that high doses of AA can further intensify this imbalance, selectively eliminating these tumor cells. Mechanistically, we found that LKB1-deficient NSCLC cells express high levels of GLUT1, which leads to increased uptake of AA. High-dose AA induces cell pyroptosis via the H 2 2 Our study demonstrates that high-dose AA exhibits selective lethality in LKB1-deficient NSCLC for two critical reasons. Factor 1 (transport): high GLUT1 expression enables AA uptake and accumulation (via its oxidized form, DHA) in LKB1-deficient cells. Factor 2 (redox vulnerability): LKB1 deficiency creates a pre-existing redox imbalance, which synergizes with DHA’s pro-oxidant effects to overwhelm antioxidant defenses. In normal cells that express GLUT1 (e.g., activated T cells), 40 TCF1-expressing CD8 + 4 , 7 + in situ 41 42 4 Batf3 −/− Our study reveals a significant decrease in SPP1 + Figures S8 S10 + 38 + 43 , 44 + + + Pharmacological AA has emerged as a hopeful anticancer agent due to its low financial cost and low toxicity in both preclinical and clinical trials. 14 , 22 25 45 14 Limitations of the study First, the in vivo + Resource availability Lead contact Requests for further information, resources, and reagents should be directed to and will be fulfilled by the lead contact, Xue Bai ( baixue1990@i.smu.edu.cn Materials availability This study did not generate any new reagents. Data and code availability  • The RNA-seq data for the LKB1-deficient mouse model are accessible in the GEO database under accession codes GSE175479 46 GSE193895 47 GSE137396 48 GSE137244 48 GSE133895 Figure 2 GSE269742 Lkb1 Figures 5 6 Figure 7 • All original code has been deposited at Zenodo. DOI is https://doi.org/10.5281/zenodo.15745003 • Any additional information required to reanalyze the data reported in this paper is available from the lead contact Acknowledgments This study was supported by the 10.13039/501100001809 National Natural Science Foundation of China 82272731 10.13039/501100003453 Natural Science Foundation of Guangdong Province 2024A1515011372 Regional Joint Fund Project of Basic and Applied Basic Research Foundation of Guangdong Province 2022B1515120035 Science and Technology Projects in Guangzhou 2024A04J5204 Author contributions Conceptualization, X.S., X.C., X.B., X.G., J.J., Z.D., and S.L.; data curation, X.S., X.C., J.J., and D.H.; formal analysis, X.S., X.G., X.C., J.X., Z.L., Z.R., and Z.Y.; funding acquisition, D.W., X.G., and X.B.; investigation, X.S., X.C., R.P., Z.R., and J.C.; methodology, X.S., X.G., X.C., R.P., J.J., P.W., Z.L., X.Z., Z.Z., H.A., F.K., and Z.D.; project administration, X.S.,Y.Z., X.G., R.P., Z.D., and S.L.; resources, Z.D., S.L., and X.B.; visualization, X.S., P.W., X.Z., and Z.Z.; writing – original draft, X.S., X.G., and X.C.; writing – review and editing, Z.D., D.W., S.L., and X.B. Declaration of interests The authors declare no competing interests. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies anti-LKB1 (27D10) CST Cat#3050, RRID: AB_823559 anti-LKB1 (D60C5F10) CST Cat#13031, RRID: AB_2716796 anti-β-actin Fdbio science Cat#FD0060-100, RRID: AB_2687938 anti-GLUT1 Proteintech Cat#66290-1-Ig, RRID: AB_2881673 anti-GAPDH abmart Cat#P60037S, RRID: AB_2937024 anti-GSDMD Abcam Cat#ab210070, RRID: AB_2893325 anti-DFNA5/GSDME Abcam Cat#ab215191, RRID: AB_2737000 anti-DFNA5/GSDME HUABIO Cat#HA723251, RRID: AB_3697047 anti-F4/80 Abcam Cat#ab300421, RRID: AB_2936298 anti-SPP1 Abcam Cat#ab218237, RRID: AB_2732079 anti-CD8 Abcam Cat#ab217344, RRID: AB_2890649 anti-TCF7 CST Cat#2203T, RRID: AB_2199302 anti-Caspase 11 Affinity Biosciences Cat#AF5130, RRID: AB_2837616 anti-phospho-MLKL(Ser358) Affinity Biosciences Cat#AF7420, RRID: AB_2843860 anti-MLKL Proteintech Cat#66675-1-I, RRID: AB_2882029 anti-BAK Proteintech Cat#29552-1-AP, RRID: AB_2923596 anti-BAX Proteintech Cat#60267-1-Ig, RRID: AB_2848213 anti-Caspase 1 Proteintech Cat#81482-1-RR, RRID: AB_2935555 anti-Caspase-3 Proteintech Cat#19677-1-AP, RRID: AB_10733244 APC/Cy™7-conjugated CD45 (557659) BD Biosciences Cat#557659, RRID: AB_396774 BV510-conjugated CD3 (563024) BD Biosciences Cat#563024, RRID: AB_2737959 PE/Cy™5-conjugated CD8a (553034) BD Biosciences Cat#553034, RRID: AB_394572 APC/R700-conjugated PD1 (565815) BD Biosciences Cat#565815, RRID: AB_2739366 PE/CF594-conjugated TIM-3 (566998) BD Biosciences Cat#566998, RRID: AB_2869998 BV421-conjugated TCF-1 (566692) BD Biosciences Cat#566692, RRID: AB_2869822 BV605-conjugated CD11c (563057) BD Biosciences Cat#563057, RRID: AB_2737978 PE-Cyanine7 conjugated CD80 (104734) BioLegend Cat#104734, RRID: AB_2563113 PE-conjugated CD86 (553692) BD Biosciences Cat#553692, RRID: AB_394994 APC-conjugated CD103 (566717) BD Biosciences Cat#566717, RRID: AB_2869828 Bacterial and virus strains LV-Stk11-sgRNA(08480-1) Genechem Cat#1343B79 LV-Stk11-RNAi(72695-1) Genechem Cat#133F0EB LV-Stk11(65515-2) Genechem Cat#13461BE LV-Gsdme-sgRNA(12997-1) Genechem Cat#GCEL0359643 pLKO.1-U6-GSDME(human)-shRNA1-Puro MiaoLingBio Cat# P78528 Biological samples Lung cancer TMA involving 76 samples Outdo Biotech Co, Ltd Cat#HLugA120PG01 Chemicals, peptides, and recombinant proteins DNase I(DeoxyribonueleaseⅠ) solarbio Cat#D8071 CollagenaseⅠ solarbio Cat#C8140 CollagenaseⅣ solarbio Cat#C8160 CollagenaseIII solarbio Cat#C8490 Opti-MEM™ Thermo Fisher Cat#31985062 Fetal Bovine Serum JYK Cat#BS1105 0.25%Trypsin-EDTA,1X NCM Biotech Cat#C100C1 methylene blue AmBeed Cat#A151225 CELLSAVING TM NCM Biotech Cat# C40100 Penicillin-streptomycin (100X) NCM Biotech Cat#C100C5 ascorbic acid Sigma-Aldrich Cat#A4034 D-luciferin Glpbio Cat#GC43496 Ferrostatin-1 MedChemExpress Cat#HY-100579 GSK-872 MedChemExpress Cat#HY-101872 Propidium iodide FLUORESCENE Cat#17515-10mg Z-DEVD-FMK RHAWN Cat#R055677-1mg Z-VAD-FMK Beyotime Cat#C1202-0.1mL catalase Solarbio Cat#C8070 N-acetylcysteine Solarbio Cat#IA0050 genOFF h-SLC2A1_siRNA RiboBio Cat#SR1005 genOFF h-SLC2A3_siRNA RiboBio Cat#SIGS0007879-13 genOFF h-SLC2A4_siRNA RiboBio Cat#SIGS0007880-13 hSLC2A1 ( NM_006516 HanYi Cat# HY241390 PolyShooterTM HP Transfection Reagent LeapWal Cat# P19110 5x DualColor Protein Loading Buffer Fudebio Cat#FD002 Protease inhibitor cocktail 100x Fudebio Cat#FD1001 Al1-in-One,100x Fudebio Cat#FD1002 RIPA lysis buffer Fudebio Cat#FD009 Critical commercial assays BCA kit Thermo Fisher Scientific Cat#23227 Fc receptor blocking agent Biolegend Cat#101302 Reactive oxygen species assay kit Solarbio Cat#CA1420 Reactive oxygen species assay kit Beyotime Cat#S0033S Pentuple-Fluorescence kit Immunoway Cat#RS0038 Human IL-1β ELISA kits Shanghai mlbio Cat#ml058059-2 Human HMGB1 ELISA kits Shanghai mlbio Cat#ml364107-2 ENLITEN™ ATP assay system kit Promega Cat#FF2000 anti-mouse Polymer-HRP kit AiFang biological Cat# AFIHC002 HMGB1 ELISA kits JINGMEI BIOTECHNOLOGY Cat#JM-05108H2 ATP Content Kit AIDISHENG Cat#ADS-W-A007-48 Lactate dehydrogenase (LDH) detection kit AIDISHENG Cat#ADS-W-FM003 Sunview® SYBR qPCR SuperMix (Universal) Sunview Cat#QE010-02 Mouse Vitamin C ELISA kits Shanghai youyi Biotechnology Cat#LDQB-28144 Vitamin C test kit BestBio Cat#101302 SevenFast Total RNA Extraction Kit for Cells SevenFast Cat#SM130-02 Annexin V-APC/PI Apoptosis kits LIANKE Cat#AP107 Sunview® Ⅲ Reverse Transcriptase kit(with dsDNase) Sunview Cat#RT008-02 NEBNext Ultra RNA Library Prep Kit New England Biolabs, Ipswich Cat#NEB 7530 15mL centrifuge Tubes Jet Cat#CFT511150 XKL Prestained Protein Ladder(8-180kDa) XKL Cat#xkl0901 Deposited data Bulk RNA-seq data This paper GSE269742 Sing-cell RNA-seq data in Figures 5 6 This paper CRA026496 Sing-cell RNA-seq data in Figure 7 This paper CRA026608 RNA-seq data for Lkb1-deficiency mouse model Gao et al. 46 47 48 48 GSE175479 GSE193895 GSE137396 GSE137244 GSE133895 Experimental models: Cell lines LLC1 ATCC Cat#CRL-1642 TC1 ATCC Cat#CRL-2493 A549 ATCC Cat#CCL-185 H460 ATCC Cat#HTB-177 H1944 ATCC Cat#CRL-5907 KP This paper N/A hCASP3 knockout A549 Suzhou Haixing Biosciences Cat#CGKO-M2487 hBAX&hBAK1 knockout A549 Suzhou Haixing Biosciences Cat#CGKO-M3107 hMLKL knockout A549 Chongqing Kunlun biotech limited Cat#CLK200200 Experimental models: Organisms/strains Mouse: C57BL/6 the Laboratory Animal Center of Southern Medical University N/A Mouse: B6.129S(C)-Batf3tm1Kmm/J (Batf3 −/− Shanghai Model Organisms Center NM-KO-190447 Oligonucleotides See Table S4 This paper N/A Software and algorithms R4.1.1 The R Project for Statistical Computing https://www.r-project.org/ Graphpad Prism 9 GraphPad Software, Inc. http://www.graphpad.com/ Flowjo Flowjo, L.L.C. https://www.flowjo.cn/ Experimental model and study participant details Animals C57BL/6 mice (5–8 weeks old) were purchased from the Laboratory Animal Center of Southern Medical University (Guangzhou, China); Kras G12D/+ R172H/+ −/− Cell lines LLC1 cell line was purchased from Guangzhou Jennio Biotech Co., Ltd, who obtained this cell line from American Type Culture Collection (ATCC). TC1 cell line was purchased from Zhejiang Nobo Biological Products Co., Ltd, who obtained this cell line form Chinese Academy of Sciences. A549, H460, H1944 cells were provided by Guangdong Lung Cancer Institute, who purchased these cells from ATCC. Authentication of Human Cell Lines Reports of these cell lines were provided. KP cells were isolated by from Kras G12D/+ Trp53 R172H/+ Ctrl Lkb1 Lkb1 Lkb1 Lkb1 Gsdme Lkb1-sg Gsdme P78528 CASP3 BAX BAK1 MLKL 2 Method details Antibodies and reagents The antibodies used were as below: anti-LKB1 (27D10) (CST, #3050), anti-DFNA5/GSDME (Abcam, #ab215191), anti-Caspase-3 (Proteintech, #19677-1-AP), anti-GSDMD (Abcam, #ab210070), anti-β-actin (Fdbio science, #FD0060-100), anti-LKB1 (D60C5F10) (CST, #13031), anti-GLUT1 (Proteintech, #66290-1-Ig), anti-GAPDH (abmart, #P60037S), anti-F4/80 (Abcam, #ab300421) anti-SPP1 (Abcam, #ab218237), anti-CD8 (Abcam, #ab217344), anti-TCF7(CST, # 2203T), anti-phospho-MLKL (Affinity, #AF7420), anti-Caspase 11 (Affinity, #AF5130), anti-MLKL (Proteintech, #66675-1-I), anti-BAK (Proteintech, #29552-1-AP), anti-BAX (Proteintech, #60267-1-Ig), anti-Caspase 1 (Proteintech, #81482-1-RR), Flow cytometry antibodies used were as following: APC/Cy7-conjugated CD45 (557659), BV510-conjugated CD3 (563024), PE/Cy5-conjugated CD8a (553034), APC/R700-conjugated PD1 (565815), PE/CF594-conjugated TIM-3 (566998), BV421-conjugated TCF-1 (566692), BV605-conjugated CD11c (563057), PE-Cyanine7 conjugated CD80 (104734), PE-conjugated CD86 (553692), APC-conjugated CD103 (566717). The inhibitors and the concentration used were as follows: high-dose ascorbic acid (Sigma-Aldrich, #A4034) 10 mM, Caspase-3 specific inhibitor (Z-DEVD-FMK, R055677, RHAWN) 25 μM, pan-Caspase inhibitor (Z-VAD-FMK, C1202–0.1, Beyotime) 25 μM, catalase (CAT, C8070, Solarbio) 100 μM and N-acetylcysteine (NAC, IA0050, Solarbio) 50 μM, iron death inhibitor (Ferrostatin-1, HY-100579, MCE (MedChemExpress) 10 μM, necrotic apoptosis inhibitor (GSK-872, HY-101872, MCE (MedChemExpress) 10 μM. If it is not specified, the incubation time is 4 h. Vaccination assays LLC1-sh Lkb1 6 in vitro Lkb1 Measurement of intracellular ascorbic acid by LC-MS Cells were inoculated in 6-well plates in 1640 involving 10% FBS for 24 h to 70–80% confluency. Then medium was removed and cells were washed by PBS Washing Buffer twice and incubated in conditional medium containing 2 mM glucose with or without 10 mM sodium ascorbate. After 1 h of incubation, cells were washed with PBS and lysed with ice-cold 1 mL CH 3 2 Signatures of programmed cell death Signatures indicating different forms of programmed cell death were compared between A549 cells with different LKB1 status and with or without ascorbic acid treatment 21 , 22 , 23 , 24 Table S1 Western Blot Cells were lysed using RIPA lysis buffer (FD009, Fudebio, Hangzhou, China) supplemented with protease inhibitors (FD1002, Fudebio) and phosphatase inhibitors (FD1001, Fudebio). Protein concentration was quantified using a BCA kit (23227, Thermo Fisher Scientific). For each sample, 20mg protein lysate was loaded onto 10% SDS-PAGE gel. Proteins were separated and transferred to polyvinylidene difluoride (PVDF) membranes (Millipore). Then the membranes were incubated with appropriate antibodies. Bands were analyzed by using an ECL system (BLT GelView 6000). XKL Prestained Protein Ladder (8-180kDa) (xkl0901, Guangzhou Xinkailai Biotechnology Co., Ltd) was used. Real-time/quantitative PCR mRNA was collected using SevenFast Total RNA Extraction Kit (SM130-02, SevenFast) and was reverse transcribed into complementary DNA using Sunview Ⅲ Reverse Transcriptase kit (with dsDNase) (RT008-02, Shenzhen Sunview Technology Co., Ltd). qRT–PCR was performed using TB Green Premix Ex Taq (TAKARA) in a Roche LightCycler 480 System. We used the average 2-ΔΔCT to analyze the data. The qPCR Probes were synthesized by Beijing Tsingke Biotech Co., Ltd. Sequences list of primers are listed in Table S4 Preparation of single cell suspension Tumors were dissected from mice, cut into small pieces and digested in RPMI 1640 (PM150110, Pricella) supplemented with 10% FBS, DNase I (0.1mg/ml) and Collagenase I,III,IV (0.5mg/ml) at 37°C for 30 min with gentle shaking. The tumor-draining lymph nodes were visualized 5 min after injecting Methylene Blue (A151225, AmBeed, USA) into the toe, then isolated and dissociated using RPMI 1640 medium. The mixtures were filtered through 75-μm cell strainers and separated by centrifugation (300 g × 5 min) to harvest the single cells. Then the cells were resuspended in PBS supplemented with 2% FBS in 15mL centrifuge tubes (CFT011150, Guangzhou Jet Bio-Filtration Co., Ltd) and used for subsequent experiments. Flow cytometry Cells were trypsinized, resuspended in PBS supplemented with 2% BSA, incubated with Fc receptor blocking agent (Biolegend, 101302), and then stained with APC/Cy7-conjugated CD45, BV510-conjugated CD3, PE/Cy5-conjugated CD8a, APC/R700-conjugated PD1, APC/R700-conjugated PD1, PE/CF594-conjugated TIM-3, BV421-conjugated TCF-1, BV605-conjugated CD11c, PE-Cyanine7 conjugated CD80, PE-conjugated CD86, APC-conjugated CD103, followed by incubating on ice for 30 min. After washing with PBS, cells were resuspended in 0.3mL PBS. The data were then analyzed with FlowJo software (version 10.5; Tree Star). Annexin V-APC/PI fluorescence staining We used apoptosis kit (Annexin V-APC/PI double fluorescence, AP105, MULTI SCIENCES (LIANKE) BIOTECH CO., LTD) for staining and flow cytometry to detect the number of double-positive cells to reflect cell death according to the manufacturer’s protocol. siRNA transfection siRNA was designed and synthesized by Guangzhou RiboBio Co., Ltd. The transfection procedure involved seeding cells into a 24-well plate containing an appropriate amount of complete medium, ensuring the cell density reaches 30–50% at the time of transfection. Each transfection sample was diluted with the siRNA and gently mixed. Next, we prepared the mixture by adding 3μL of riboFECT CP Reagent, gently pipetted to mix, and incubated at room temperature for 0–15 min to form the transfection complex. Then the transfection complex was added into an appropriate volume of complete medium without antibiotics. Finally, the culture plate was placed in a 37°C CO2 incubator for 48 h. Transfection efficiency was assessed by qPCR. The sequences of siRNAs are listed in Table S4 Overexpression of GLUT1 through plasmid transfection Firstly, the transfection reagent-nucleic acid complex was prepared by adding 0.5 μg of plasmid (hSLC2A1 in pcDNA3.1-3xflag, HY241390 P19110 PI fluorescence staining The process was detected by Propidium iodide (PI) staining. Firstly, we prepared a 25 μM PI solution using PBS, then added 1/10 of the culture medium volume of the PI solution into the cell culture medium, incubating the cells at 37°C for 10–20 min. The cells could be observed using a fluorescence microscope equipped with a filter for excitation at 535 nm and emission at 615 nm. ROS detection DCFH-DA fluorescence probe kit (Cat#CA1420, Beijing Solarbio Science & Technology Co., Ltd.) was used to detect the level of intracellular reactive oxygen species (ROS) according to the manufacturer’s protocol. The IX33 upright fluorescence microscope ( N25014 N29345 Bioluminescence imaging (BLI) Mice were administered with 150 mg/kg D-luciferin (GC43496, Glpbio, Montclair, CA, USA) through intraperitoneal injection and then anesthetized with isoflurane gas. The bioluminescent signals of luciferase-expressing tumors were captured on the AMI HTX imaging system (Spectral Instruments Imaging). The intensities of bioluminescence at different time were analyzed and quantified by Aura software. Immunohistochemistry (IHC) Orthotopic and subcutaneous tumors were collected and fixed in 4% PFA at 4°C overnight and paraffin-embedded. The sections were deparaffinized and repaired followed by blocking. Then the slides were probed with primary antibody, anti-cleaved-caspase 3(proteintech, 68773-1-Ig) at 4°C overnight and then incubated with secondary antibodies at room temperature for 1h. The proportion of positive cells and the intensities of positive cells were evaluated. All of them were judged by experienced pathologists. Lung cancer tissue microarray (TMA) Lung cancer TMA involving 76 samples was purchased from Outdo Biotech Co, Ltd. (HLugA120PG01, Shanghai, China). The immunohistochemical stainings of GLUT1 (Proteintech, #66290-1-Ig), and LKB1 (CST, #3050) were performed as IHC. High-resolution panoramic pathology scanner (Hamamatsu, NE0N440) was used to scan the slices. The Kaplan-Meier method was used to evaluate the associations between GLUT1 and LKB1 expression. Immunofluorescence analysis (IF) Tumor tissues were collected, fixed with 4% PFA at 4°C and paraffin embedded. These sections were deparaffinized and repaired, and then closed. They were then incubated overnight with primary antibody, anti-CD8 (Abcam, #ab217344), anti-TCF1 (Cell Signaling #2203), anti-F4/80 (Abcam, #ab6640), anti-SPP1(Abcam, #218237). Secondary antibody, anti-mouse Polymer-HRP (AiFang biological, #AFIHC002) was used for detection. Cell nuclei were stained with 4′,6-diamidino-2-phenylindole (DAPI). Sections were then blocked using fluorescent blocker (Dako) and analyzed using microscopy. All these were judged by an experienced pathologist. Multiplex immunohistochemistry (mIHC) mIHC was performed by Pentuple-Fluorescence kit (RS0038, Immunoway). Firstly, paraffin-embedded tumor tissues from mice were sliced into 5-μm-thick pieces. This process was supported by Hubei BIOSSCI Biotechnology Co., LTD. Following deparaffinization, rehydration, and antigen retrieval with EDTA, the pieces were incubated with 3% hydrogen peroxide and blocked in goat serum for 30 min at room temperature. Next, the tissue slices were incubated with primary antibodies at 4°C overnight, followed by incubation with the secondary antibody (HRP) for 20 minutes at 37°C temperature. Afterward, the slides were incubated with TSA dye at room temperature for 10 min. Between the incubation of different primary antibodies, the slides were immersed in antibody stripping buffer at 95°C for 15 min to denature the primary and secondary antibody complexes. Finally, with all the dying process finished, DAPI was applied and the slides were scanned by high-resolution panoramic pathology scanner (Hamamatsu, NE0N440) after a manual cover-slipping. All the results were judged by an experienced pathologist. Enzyme-linked immunosorbent assay (ELISA) The supernatant was collected by centrifugation of cell culture medium at 1500 r/min for 20 min at 4°C. The level of AA was detected with kits (BB47444, BestBio). The levels of IL-1β and HMGB1 were detected with ELISA kits (ml058059–2, ml364107-2, Shanghai mlbio). The level of HMGB1 was also detected with ELISA kits (Jiangsu Jingmei Biological Technology Co.,Ltd.) according to the manufacturer’s instructions. Tumor tissues were isolated through mechanical disruption (mincing and homogenization) of the samples, followed by centrifugation to harvest the supernatant. For mouse peripheral blood serum, whole blood was subjected to centrifugation, after which the serum layer was carefully extracted. All experimental procedures strictly followed the protocols provided by the manufacturers. The levels of serum AA and tumor containing AA were detected with ELISA kits (Shanghai Excellent Doctor Biotechnology (shanghai, China)). Biochemistry assay The ATP and LDH levels were detected with microplate method (Jiangsu Jingmei Biological Technology Co.,Ltd.) The ATP level of the supernatant was also detected with ENLITEN ATP assay system kit (Promega, America, FF2000) according to the manufacturer’s instructions. Micro-CT analysis Mice were taken micro-CT scan by Skyscan 1176 while breathing freely under anesthesia. The scanner was set at the following parameters for images acquisition: X-ray source 50 kvp, X-ray current 500 μA, filter AI 0.5 mm, pixel size 18 μm, and 40 × 40 mm field of view. Duration of the procedure for each mouse was approximately 7 min. A lung region of interest (ROI) was drawn using threshold segmentation and sweep function while other tissue images such as thorax and mediastinum were removed. The reconstruction of the scans was performed with NRecon software. Tomographic reconstruction of the projections resulted in 1061 slices with an isotropic voxel spacing of 80 μm. Images were converted into bmp format and analyzed with DataViewer to further establish 2D maximum intensity projection slices, and quantify the tumor volume. The reconstructed image stacks were then imported into CTvox software and 3D reconstructions were generated. Bulk RNA extraction and analysis Human NSCLC cell lines A549 transduced with wild-type or empty vector with high dose AA or PBS were subjected to RNA-sequencing. Total RNA was extracted using SevenFast Total RNA Extraction Kit for Cells (Cat#SM130-02, SevenFast) according to the manufacturer’s protocol, and then reversly transcribed into cDNA by using NEBNext Ultra RNA Library Prep Kit for Illumina (NEB #7530, New England Biolabs, Ipswich, MA, USA). Finally, they were sequenced using Illumina Novaseq6000 by Gene Denovo scRNA-seq and analysis Sequencing data was filtered, and a gene expression matrix was generated by the DNBelab C Series scRNAanalysis software ( https://github.com/MGI-tech-bioinformatics/DNBelab_C_Series_HT_scRNAanalysis-software 49 Subsequently, datasets were subjected to quality control steps using Seurat 4.3.0.For the dataset used in Figures 5 6 Figure 7 50 RNA velocity analysis To predict the forthcoming dynamics and trajectory of transitioning T cells, RNA velocity analysis was performed. Loom files, encapsulating un-spliced mRNAs, were produced for each sample via Cell Ranger. These files were analyzed using Velocyto (Linux R package) to compute RNA velocity. The resultant loom files were consolidated and aligned with the UMAP coordinates of individual cells. 51 Quantification and statistical analysis Statistical analyses were performed as described in the figure legend for each experiment. Data are presented as mean ± SEM or mean ± SD as described in legends. Group size was determined based on the results of preliminary experiments, and no statistical method was used to predetermine sample size. The indicated sample size (n) represents biological replicates. Group allocation and outcome assessment were not performed in a blinded manner. All samples that met proper experimental conditions were included in the analysis. Survival was measured using the Kaplan–Meier method. Statistical significance was determined by one- or two-way ANOVA, Student’s t test, log rank test, and Pearson’s correlation using Prism 7 software (GraphPad Software) as indicated. Significance was set at p References 1 Skoulidis F. Goldberg M.E. Greenawalt D.M. Hellmann M.D. Awad M.M. Gainor J.F. Schrock A.B. Hartmaier R.J. Trabucco S.E. Gay L. STK11/LKB1 Mutations and PD-1 Inhibitor Resistance in KRAS-Mutant Lung Adenocarcinoma Cancer Discov. 8 2018 822 835 10.1158/2159-8290.CD-18-0099 29773717 PMC6030433 2 Calles A. Sholl L.M. Rodig S.J. Pelton A.K. Hornick J.L. Butaney M. Lydon C. Dahlberg S.E. Oxnard G.R. Jackman D.M. Jänne P.A. Immunohistochemical Loss of LKB1 Is a Biomarker for More Aggressive Biology in KRAS-Mutant Lung Adenocarcinoma Clin. Cancer Res. 21 2015 2851 2860 10.1158/1078-0432.CCR-14-3112 25737507 3 Li H. Liu Z. Liu L. Zhang H. Han C. Girard L. Park H. Zhang A. Dong C. Ye J. AXL targeting restores PD-1 blockade sensitivity of STK11/LKB1 mutant NSCLC through expansion of TCF1+ CD8 T cells Cell Rep. Med. 3 2022 100554 10.1016/j.xcrm.2022.100554 PMC9040166 35492873 4 Im S.J. Hashimoto M. Gerner M.Y. Lee J. Kissick H.T. Burger M.C. Shan Q. Hale J.S. Lee J. Nasti T.H. Defining CD8+ T cells that provide the proliferative burst after PD-1 therapy Nature 537 2016 417 421 10.1038/nature19330 27501248 PMC5297183 5 Rahim M.K. Okholm T.L.H. Jones K.B. McCarthy E.E. Liu C.C. Yee J.L. Tamaki S.J. Marquez D.M. Tenvooren I. Wai K. Dynamic CD8+ T cell responses to cancer immunotherapy in human regional lymph nodes are disrupted in metastatic lymph nodes Cell 186 2023 1127 1143.e18 10.1016/j.cell.2023.02.021 36931243 PMC10348701 6 Siddiqui I. Schaeuble K. Chennupati V. Fuertes Marraco S.A. Calderon-Copete S. Pais Ferreira D. Carmona S.J. Scarpellino L. Gfeller D. Pradervand S. Intratumoral Tcf1+PD-1+CD8+ T Cells with Stem-like Properties Promote Tumor Control in Response to Vaccination and Checkpoint Blockade Immunotherapy Immunity 50 2019 195 211.e10 10.1016/j.immuni.2018.12.021 30635237 7 Zhao X. Shan Q. Xue H.-H. TCF1 in T cell immunity: a broadened frontier Nat. Rev. Immunol. 22 2022 147 157 10.1038/s41577-021-00563-6 34127847 8 Hardie D.G. Ross F.A. Hawley S.A. AMPK: a nutrient and energy sensor that maintains energy homeostasis Nat. Rev. Mol. Cell Biol. 13 2012 251 262 10.1038/nrm3311 22436748 PMC5726489 9 Faubert B. Solmonson A. DeBerardinis R.J. Metabolic reprogramming and cancer progression Science 368 2020 eaaw5473 10.1126/science.aaw5473 PMC7227780 32273439 10 Shackelford D.B. Abt E. Gerken L. Vasquez D.S. Seki A. Leblanc M. Wei L. Fishbein M.C. Czernin J. Mischel P.S. Shaw R.J. LKB1 inactivation dictates therapeutic response of non-small cell lung cancer to the metabolism drug phenformin Cancer Cell 23 2013 143 158 10.1016/j.ccr.2012.12.008 23352126 PMC3579627 11 Li F. Han X. Li F. Wang R. Wang H. Gao Y. Wang X. Fang Z. Zhang W. Yao S. LKB1 Inactivation Elicits a Redox Imbalance to Modulate Non-small Cell Lung Cancer Plasticity and Therapeutic Response Cancer Cell 27 2015 698 711 10.1016/j.ccell.2015.04.001 25936644 PMC4746728 12 Faubert B. Vincent E.E. Griss T. Samborska B. Izreig S. Svensson R.U. Mamer O.A. Avizonis D. Shackelford D.B. Shaw R.J. Jones R.G. Loss of the tumor suppressor LKB1 promotes metabolic reprogramming of cancer cells via HIF-1α Proc. Natl. Acad. Sci. USA 111 2014 2554 2559 10.1073/pnas.1312570111 24550282 PMC3932920 13 Chen Q. Espey M.G. Sun A.Y. Lee J.-H. Krishna M.C. Shacter E. Choyke P.L. Pooput C. Kirk K.L. Buettner G.R. Levine M. Ascorbate in pharmacologic concentrations selectively generates ascorbate radical and hydrogen peroxide in extracellular fluid in vivo Proc. Natl. Acad. Sci. USA 104 2007 8749 8754 10.1073/pnas.0702854104 17502596 PMC1885574 14 Shenoy N. Creagan E. Witzig T. Levine M. Ascorbic acid in cancer treatment: let the phoenix fly Cancer Cell 34 2018 700 706 10.1016/j.ccell.2018.07.014 30174242 PMC6234047 15 Duarte T.L. Almeida G.M. Jones G.D.D. Investigation of the role of extracellular H2O2 and transition metal ions in the genotoxic action of ascorbic acid in cell culture models Toxicol. Lett. 170 2007 57 65 10.1016/j.toxlet.2007.02.005 17382497 16 Yun J. Mullarky E. Lu C. Bosch K.N. Kavalier A. Rivera K. Roper J. Chio I.I.C. Giannopoulou E.G. Rago C. Vitamin C selectively kills KRAS and BRAF mutant colorectal cancer cells by targeting GAPDH Science 350 2015 1391 1396 10.1126/science.aaa5004 26541605 PMC4778961 17 Peng D. He A. He S. Ge G. Wang S. Ci W. Li X. Xia D. Zhou L. Ascorbic acid induced TET2 enzyme activation enhances cancer immunotherapy efficacy in renal cell carcinoma Int. J. Biol. Sci. 18 2022 995 1007 10.7150/ijbs.67329 35173532 PMC8771844 18 Luchtel R.A. Bhagat T. Pradhan K. Jacobs W.R. Levine M. Verma A. Shenoy N. High-dose ascorbic acid synergizes with anti-PD1 in a lymphoma mouse model Proc. Natl. Acad. Sci. USA 117 2020 1666 1677 10.1073/pnas.1908158117 31911474 PMC6983418 19 Magrì A. Germano G. Lorenzato A. Lamba S. Chilà R. Montone M. Amodio V. Ceruti T. Sassi F. Arena S. High-dose vitamin C enhances cancer immunotherapy Sci. Transl. Med. 12 2020 eaay8707 10.1126/scitranslmed.aay8707 32102933 20 Zaher A. Stephens L.M. Miller A.M. Hartwig S.M. Stolwijk J.M. Petronek M.S. Zacharias Z.R. Wadas T.J. Monga V. Cullen J.J. Pharmacological ascorbate as a novel therapeutic strategy to enhance cancer immunotherapy Front. Immunol. 13 2022 989000 10.3389/fimmu.2022.989000 PMC9444023 36072595 21 Galan-Cobo A. Sitthideatphaiboon P. Qu X. Poteete A. Pisegna M.A. Tong P. Chen P.-H. Boroughs L.K. Rodriguez M.L.M. Zhang W. LKB1 and KEAP1/NRF2 Pathways Cooperatively Promote Metabolic Reprogramming with Enhanced Glutamine Dependence in KRAS-Mutant Lung Adenocarcinoma Cancer Res. 79 2019 3251 3267 10.1158/0008-5472.CAN-18-3527 31040157 PMC6606351 22 Ngo B. Van Riper J.M. Cantley L.C. Yun J. Targeting cancer vulnerabilities with high-dose vitamin C Nat. Rev. Cancer 19 2019 271 282 10.1038/s41568-019-0135-7 30967651 PMC6526932 23 Ferrada L. Magdalena R. Barahona M.J. Ramírez E. Sanzana C. Gutiérrez J. Nualart F. Two Distinct Faces of Vitamin C: AA vs. DHA Antioxidants 10 2021 215 10.3390/antiox10020215 33535710 PMC7912923 24 Rivas C.I. Zúñiga F.A. Salas-Burgos A. Mardones L. Ormazabal V. Vera J.C. Vitamin C transporters J. Physiol. Biochem. 64 2008 357 375 10.1007/BF03174092 19391462 25 Schoenfeld J.D. Sibenaller Z.A. Mapuskar K.A. Wagner B.A. Cramer-Morales K.L. Furqan M. Sandhu S. Carlisle T.L. Smith M.C. Abu Hejleh T. O2⋅- and H2O2-Mediated Disruption of Fe Metabolism Causes the Differential Susceptibility of NSCLC and GBM Cancer Cells to Pharmacological Ascorbate Cancer Cell 31 2017 487 500.e8 10.1016/j.ccell.2017.02.018 28366679 PMC5497844 26 Christgen S. Tweedell R.E. Kanneganti T.-D. Programming inflammatory cell death for therapy Pharmacol. Ther. 232 2022 108010 10.1016/j.pharmthera.2021.108010 PMC8930427 34619283 27 Rogers C. Erkes D.A. Nardone A. Aplin A.E. Fernandes-Alnemri T. Alnemri E.S. Gasdermin pores permeabilize mitochondria to augment caspase-3 activation during apoptosis and inflammasome activation Nat. Commun. 10 2019 1689 10.1038/s41467-019-09397-2 30976076 PMC6459836 28 Nie J.-J. Zhang B. Luo P. Luo M. Luo Y. Cao J. Wang H. Mao J. Xing Y. Liu W. Enhanced pyroptosis induction with pore-forming gene delivery for osteosarcoma microenvironment reshaping Bioact. Mater. 38 2024 455 471 10.1016/j.bioactmat.2024.05.009 38770426 PMC11103790 29 Xiang Q. Yang C. Luo Y. Liu F. Zheng J. Liu W. Ran H. Sun Y. Ren J. Wang Z. Near-Infrared II Nanoadjuvant-Mediated Chemodynamic, Photodynamic, and Photothermal Therapy Combines Immunogenic Cell Death with PD-L1 Blockade to Enhance Antitumor Immunity Small 18 2022 2107809 10.1002/smll.202107809 35143709 30 Broz P. Pelegrín P. Shao F. The gasdermins, a protein family executing cell death and inflammation Nat. Rev. Immunol. 20 2020 143 157 10.1038/s41577-019-0228-2 31690840 31 Zhou B. Zhang J.Y. Liu X.S. Chen H.Z. Ai Y.L. Cheng K. Sun R.Y. Zhou D. Han J. Wu Q. Tom20 senses iron-activated ROS signaling to promote melanoma cell pyroptosis Cell Res. 28 2018 1171 1185 10.1038/s41422-018-0090-y 30287942 PMC6274649 32 Chen H. Ding B. Tan J. Meng Q. Li J. Zhang W. Zheng P. Liu B. Ma P. Lin J. Silver Molybdate Nanoparticles for Enhanced Tumor Immunotherapy through Pyroptosis Conversion and Ferroptosis Induction Angew Chem. Int. Ed. Engl. 64 2025 e202501530 10.1002/anie.202501530 39961790 33 Shi J. Zhao Y. Wang K. Shi X. Wang Y. Huang H. Zhuang Y. Cai T. Wang F. Shao F. Cleavage of GSDMD by inflammatory caspases determines pyroptotic cell death Nature 526 2015 660 665 10.1038/nature15514 26375003 34 Hu L. Chen M. Chen X. Zhao C. Fang Z. Wang H. Dai H. Chemotherapy-induced pyroptosis is mediated by BAK/BAX-caspase-3-GSDME pathway and inhibited by 2-bromopalmitate Cell Death Dis. 11 2020 281 10.1038/s41419-020-2476-2 32332857 PMC7181755 35 Sun L. Wang H. Wang Z. He S. Chen S. Liao D. Wang L. Yan J. Liu W. Lei X. Wang X. Mixed Lineage Kinase Domain-like Protein Mediates Necrosis Signaling Downstream of RIP3 Kinase Cell 148 2012 213 227 10.1016/j.cell.2011.11.031 22265413 36 Mueckler M. Thorens B. The SLC2 (GLUT) family of membrane transporters Mol. Aspect. Med. 34 2013 121 138 10.1016/j.mam.2012.07.001 PMC4104978 23506862 37 Speiser D.E. Ho P.-C. Verdeil G. Regulatory circuits of T cell function in cancer Nat. Rev. Immunol. 16 2016 599 611 10.1038/nri.2016.80 27526640 38 Bill R. Wirapati P. Messemaker M. Roh W. Zitti B. Duval F. Kiss M. Park J.C. Saal T.M. Hoelzl J. CXCL9:SPP1 macrophage polarity identifies a network of cellular programs that control human cancers Science 381 2023 515 524 10.1126/science.ade2292 37535729 PMC10755760 39 Edelson B.T. KC W. Juang R. Kohyama M. Benoit L.A. Klekotka P.A. Moon C. Albring J.C. Ise W. Michael D.G. Peripheral CD103+ dendritic cells form a unified subset developmentally related to CD8α+ conventional dendritic cells J. Exp. Med. 207 2010 823 836 10.1084/jem.20091627 20351058 PMC2856032 40 Macintyre A.N. Gerriets V.A. Nichols A.G. Michalek R.D. Rudolph M.C. Deoliveira D. Anderson S.M. Abel E.D. Chen B.J. Hale L.P. Rathmell J.C. The glucose transporter Glut1 is selectively essential for CD4 T cell activation and effector function Cell Metab. 20 2014 61 72 10.1016/j.cmet.2014.05.004 24930970 PMC4079750 41 Van Braeckel-Budimir N. Dolina J.S. Wei J. Wang X. Chen S.-H. Santiago P. Tu G. Micci L. Al-Khami A.A. Pfister S. Combinatorial immunotherapy induces tumor-infiltrating CD8+ T cells with distinct functional, migratory, and stem-like properties J. Immunother. Cancer 9 2021 e003614 10.1136/jitc-2021-003614 PMC8672007 34903555 42 Galluzzi L. Guilbaud E. Schmidt D. Kroemer G. Marincola F.M. Targeting immunogenic cell stress and death for cancer therapy Nat. Rev. Drug Discov. 23 2024 445 460 10.1038/s41573-024-00920-9 38622310 PMC11153000 43 Qi J. Sun H. Zhang Y. Wang Z. Xun Z. Li Z. Ding X. Bao R. Hong L. Jia W. Single-cell and spatial analysis reveal interaction of FAP+ fibroblasts and SPP1+ macrophages in colorectal cancer Nat. Commun. 13 2022 1742 10.1038/s41467-022-29366-6 35365629 PMC8976074 44 Liu Y. Xun Z. Ma K. Liang S. Li X. Zhou S. Sun L. Liu Y. Du Y. Guo X. Identification of a tumour immune barrier in the HCC microenvironment that determines the efficacy of immunotherapy J. Hepatol. 78 2023 770 782 10.1016/j.jhep.2023.01.011 36708811 45 Furqan M. Abu-Hejleh T. Stephens L.M. Hartwig S.M. Mott S.L. Pulliam C.F. Petronek M. Henrich J.B. Fath M.A. Houtman J.C. Pharmacological ascorbate improves the response to platinum-based chemotherapy in advanced stage non-small cell lung cancer Redox Biol. 53 2022 102318 10.1016/j.redox.2022.102318 PMC9079696 35525024 46 Gao Y. Päivinen P. Tripathi S. Domènech-Moreno E. Wong I.P.L. Vaahtomeri K. Nagaraj A.S. Talwelkar S.S. Foretz M. Verschuren E.W. Inactivation of AMPK Leads to Attenuation of Antigen Presentation and Immune Evasion in Lung Adenocarcinoma Clin. Cancer Res. 28 2022 227 237 10.1158/1078-0432.CCR-21-2049 34667030 47 Best S.A. Gubser P.M. Sethumadhavan S. Kersbergen A. Negrón Abril Y.L. Goldford J. Sellers K. Abeysekera W. Garnham A.L. McDonald J.A. Glutaminase inhibition impairs CD8 T cell activation in STK11-/Lkb1-deficient lung cancer Cell Metab. 34 2022 874 887.e6 10.1016/j.cmet.2022.04.003 35504291 48 Deng J. Thennavan A. Dolgalev I. Chen T. Li J. Marzio A. Poirier J.T. Peng D.H. Bulatovic M. Mukhopadhyay S. ULK1 inhibition overcomes compromised antigen presentation and restores antitumor immunity in LKB1 mutant lung cancer Nat. Cancer 2 2021 503 514 10.1038/s43018-021-00208-6 34142094 PMC8205437 49 Aran D. Looney A.P. Liu L. Wu E. Fong V. Hsu A. Chak S. Naikawadi R.P. Wolters P.J. Abate A.R. Reference-based analysis of lung single-cell sequencing reveals a transitional profibrotic macrophage Nat. Immunol. 20 2019 163 172 10.1038/s41590-018-0276-y 30643263 PMC6340744 50 Qiu X. Mao Q. Tang Y. Wang L. Chawla R. Pliner H.A. Trapnell C. Reversed graph embedding resolves complex single-cell trajectories Nat. Methods 14 2017 979 982 10.1038/nmeth.4402 28825705 PMC5764547 51 La Manno G. Soldatov R. Zeisel A. Braun E. Hochgerner H. Petukhov V. Lidschreiber K. Kastriti M.E. Lönnerberg P. Furlan A. RNA velocity of single cells Nature 560 2018 494 498 10.1038/s41586-018-0414-6 30089906 PMC6130801 Supplemental information  Document S1. Figures S1–S10 and Tables S1–S4 Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102291 ",
  "metadata": {
    "Title of this paper": "RNA velocity of single cells",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490232/"
  }
}