{
  "title": "Paper_578",
  "abstract": "pmc BMC Infect Dis BMC Infect Dis 36 bmcid BMC Infectious Diseases 1471-2334 BMC PMC12482810 PMC12482810.1 12482810 12482810 41023926 10.1186/s12879-025-11580-4 11580 1 Research Early prediction of bloodstream infections in ICU patients using machine learning methods based on routine laboratory parameters Chen Yanying 1 2 3 Chen Ziru 1 2 3 Xu Dongyun 1 2 3 Li Shibing 1 2 3 Chen Feixiong 1 2 3 Yu Xufa 1 2 3 Cai Shutao 1 2 3 Zeng Cuilan 1 2 3 Ye Xueyan 1 2 3 Yang Jie 4 Liu Jun liuj245@mail.sysu.edu.cn 5 Lin Jianmei linjm39@mail.sysu.edu.cn 1 2 3 Xiao Siyu xiaosy9@mail.sysu.edu.cn 1 2 3 1 https://ror.org/0064kty71 grid.12981.33 0000 0001 2360 039X Department of Clinical Laboratory, The Sixth Affiliated Hospital, Sun Yat-Sen University, 2 https://ror.org/0064kty71 grid.12981.33 0000 0001 2360 039X Biomedical Innovation Center, The Sixth Affiliated Hospital, Sun Yat-Sen University, 3 https://ror.org/0064kty71 grid.12981.33 0000 0001 2360 039X Key Laboratory of Human Microbiome and Chronic Diseases, Ministry of Education, Sun Yat-Sen University, 4 https://ror.org/01vjw4z39 grid.284723.8 0000 0000 8877 7471 Guangdong Lung Cancer Institute, Guangdong Provincial People’s Hospital (Guangdong Academy of Medical Sciences), Southern Medical University, 5 https://ror.org/0064kty71 grid.12981.33 0000 0001 2360 039X Department of Medical Administration, The Sixth Affiliated Hospital, Sun Yat-Sen University, 29 9 2025 2025 25 478176 1196 16 5 2025 25 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Bloodstream infections (BSIs) are a major cause of morbidity and mortality in Intensive Care Units (ICUs). Although blood cultures remain the diagnostic gold standard, their long turnaround time may hinder early risk warning. Early risk stratification using routinely available laboratory data may facilitate prompt clinical intervention. This study aimed to develop and validate machine learning (ML) models to predict the likelihood of BSIs in ICU patients based on laboratory tests obtained within the first 24 h of admission. Methods This was a retrospective, two-center cohort study using data from the Sixth Affiliated Hospital of Sun Yat-sen University (SAH-SYSU) and the Medical Information Mart for Intensive Care IV (MIMIC, v3.0) database. Adult ICU patients (≥ 18 years) with available first-day laboratory results and blood culture data were included. Multiple ML algorithms, including random forest, XGBoost, GBM, LightGBM, and SVM, were trained and validated using tenfold cross-validation. Model performance was assessed via area under the receiver operating characteristic curve (AUROC), calibration curves, Brier score, and decision curve analysis (DCA). Feature selection was conducted using the Boruta algorithm to develop simplified models. External validation was performed across cohorts using shared features. Results A total of 754 patients from SAH-SYSU (BSI prevalence: 27.7%) and 3,136 patients from MIMIC (BSI prevalence: 14.0%) were included. Tree-based models outperformed linear classifiers. In internal validation, XGBoost achieved the best performance (AUROC = 0.87 in MIMIC, 0.83 in SYSU). Simplified models using Boruta-selected features retained similar predictive performance (p > 0.05). Cross-cohort validation yielded AUROCs of 0.61 (MIMIC → SYSU) and 0.64 (SYSU → MIMIC). A compact four-feature model demonstrated moderate performance (AUROC up to 0.65), supporting feasibility in resource-limited settings. Conclusions ML-based models using only routine laboratory tests from the first ICU day can effectively identify patients at increased risk of BSIs. These models offer a rapid, interpretable, and generalizable tool for early clinical decision-making. Future studies should prospectively validate the model and explore its integration into electronic health records to support real-time risk stratification. Supplementary Information The online version contains supplementary material available at 10.1186/s12879-025-11580-4. Keywords Prediction of bloodstream infections Machine learning ICU patients pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Bloodstream infections (BSIs) remain a significant challenge in Intensive Care Units (ICUs), contributing to prolonged ICU stays, increased healthcare costs, and elevated mortality rates. Studies have shown that BSIs are associated with mortality rates ranging from 30% to over 50% among critically ill patients, underscoring their substantial impact on patient outcomes and resource utilization [ 1 4 Traditional diagnostic methods, particularly blood cultures, often require extended incubation periods, typically 24 to 72 h, to yield definitive results. In clinical practice, patients presenting with overt signs of septic shock, such as hemodynamic instability, are typically started on empiric antimicrobial therapy without waiting for blood culture results. However, in some BSIs patients with less typical presentations delayed treatment is common: approximately 47.3% of ICU patients with BSIs receive inadequate therapy within the first 24 h of symptom onset [ 5 7 8 9 In recent years, Machine learning (ML) has emerged as a promising approach to address these limitations by leveraging commonly available laboratory test results to facilitate early prediction of bloodstream infections. By utilizing predictive modeling techniques, it is possible to identify patients at risk for positive blood cultures much earlier, thus enabling prompt therapeutic actions and improving overall patient management. Machine learning models have demonstrated significant potential in predicting BSIs by analyzing readily available clinical and laboratory data. Recent studies have explored various ML algorithms, such as logistic regression, random forest, support vector machines, and gradient boosting, to assess the risk of BSIs in real time [ 10 14 However, most reported ML-based BSI prediction models integrate a combination of vital signs, clinical scores, and laboratory values. The reliance on complex and multi-source clinical data may hinder widespread clinical adoption, especially in resource-limited or emergency settings. For eliminating dependence on additional data sources such as electronic medical records or vital signs, the present study aims to develop a predictive model that exclusively utilizes routine laboratory parameters within the first day of ICU admission to identify patients at risk of developing subsequent bloodstream infections. Methods Study design and data sources This retrospective cohort study included one public database and one hospital-based dataset. The Medical Information Mart for Intensive Care (MIMIC-IV version 3.0, hereafter referred to as MIMIC) is a large, publicly available database comprising data from over 65,000 patients admitted to the ICUs of the Beth Israel Deaconess Medical Center in Boston, MA [ 15 The study included all ICU patients who had at least one blood culture drawn due to suspected bacteremia after ICU admission. For patients with multiple ICU admissions, only the first ICU stay was considered. All included patients were categorized into two groups based on their blood culture results: positive or negative. The inclusion criteria were as follows: (1) age ≥ 18 years; (2) ICU stay ≥ 24 h; (3) availability of laboratory data within the first 24 h of ICU admission; and (4) at least one blood culture result available within the first 7 days of ICU admission (Fig. 1 16 Fig. 1 Flowchart of the study. Flowchart illustrating patient enrollment and exclusion process in two independent cohorts (MIMIC and SYSU), resulting in the final cohorts used for model development and validation Data collection, predictors and preprocessing Clinical and laboratory data were systematically extracted from the initial 24 h following admission to the ICU. The dataset encompassed a range of parameters, including complete blood count metrics such as white blood cell count (WBC), neutrophils, lymphocytes, and platelets; liver function indicators such as alanine aminotransferase (ALT), alkaline phosphatase (ALP), albumin (ALB), and total bilirubin (TBIL); renal function and electrolyte markers such as creatinine, blood urea nitrogen (BUN), potassium (K + + To enhance the potential predictive value, additional derived variables were calculated based on established clinical relationships, including the platelet-to-lymphocyte ratio (PLR), neutrophil-to-lymphocyte ratio (NLR), and lactate-to-glucose ratio (LGR). These have been previously reported to be associated with inflammation, metabolic stress, and infection severity. Missing data thresholds were determined separately for each dataset according to their intrinsic completeness profiles. In the MIMIC dataset, where a large number of variables had > 90% missingness (Supplementary Table S1), a 40% missing data threshold was chosen to retain clinically important predictors while avoiding excessive imputation. In the SYSU dataset, where most variables had < 20% missingness (Supplementary Table S2), a stricter 20% threshold was applied. Variable sets were subsequently harmonized across datasets to ensure comparability. We acknowledge that this approach may introduce bias; however, harmonization and identical preprocessing pipelines were used to minimize its impact. Remaining variables with missing values were imputed using (missRanger) [ 17 Model development and validation To assess the predictive performance and generalizability of machine learning models for early identification of bloodstream infection based on routine laboratory tests within the first 24 h of ICU admission, we designed a four-step analytical strategy. First, we developed baseline predictive models using all available laboratory features from each cohort separately. Ten-fold cross-validation was performed within the MIMIC and SYSU datasets to evaluate internal performance. In each iteration, the data were randomly divided into ten subsets, with nine used for training and one for validation, ensuring that each subset served as a validation fold once. Second, we applied the Boruta algorithm for feature selection in each cohort to identify important predictors of BSI. Subsequently, refined models were constructed using only these selected features and internally validated using ten-fold cross-validation. The performance of these reduced models was compared to that of the full-feature models using Wilcoxon test to determine whether simplified models could maintain equivalent discriminative power. Third, we identified a subset of laboratory features common to both cohorts and trained models using these variables in one cohort while externally validating them in the other, in order to assess model transferability across populations. Finally, we repeated the external validation using only the important features identified by Boruta that were shared between both cohorts, thus examining whether a minimal yet biologically and statistically relevant feature set could provide acceptable external performance. All machine learning modeling procedures were conducted using the mlr3 framework and its associated extension packages in R (version 0.22.1). Total of 8 machine learning algorithms were evaluated, including 3 linear models: Logistic regression, Regularized logistic regression (glmnet), and linear discriminant analysis (LDA) and 5 non-linear models: Random forest (ranger), Gradient boosting machine (GBM), LightGBM, support vector machine (SVM), kSVM, and XGBoost). Model performance was primarily assessed using the area under the receiver operating characteristic curve (AUROC), and the area under the precision–recall curve (AUPRC) was also calculated. Additional metrics, including F1-score, sensitivity, specificity, and accuracy, were computed to provide a more comprehensive evaluation. Additionally, model calibration was evaluated using calibration curves and Brier scores. To enhance model interpretability and identify the most influential predictors contributing to BSI risk, we performed SHapley Additive exPlanations (SHAP) analysis on the best-performing model. Finally, decision curve analysis (DCA) was performed to estimate the potential clinical net benefit of using the ML models to predict BSIs, compared with conventional multivariable logistic regression models. Statistical analysis Laboratory variables were presented as means with standard deviations (SD). Group comparisons were assessed using Wilcoxon rank sum test. A two-tailed p-value of < 0.05 was considered statistically significant. Results Variables between BSIs and without BSIs Among the 3,136 ICU patients from the MIMIC cohort, 439 (14.0%) developed bloodstream infections, in the SYSU cohort, 209 (27.7%) of the 754 ICU patients developed BSIs. The baseline characteristics of patients in the two cohorts are summarized in Tables 1 2 Table 1 Laboratory variables among patients with and without BSI in MIMIC-IV cohort Variables Overall, N 1 Negative, N 1 Positive, N 1 p 2 Blood gas ph mmHg 7.33 ± 0.11 7.34 ± 0.11 7.33 ± 0.12 0.086 pO₂ mmol/L 97.68 ± 83.00 98.33 ± 83.63 93.68 ± 78.98 0.3 pCO₂ mmHg 42.74 ± 13.47 43.08 ± 13.66 40.70 ± 12.06 < 0.001* BE mmol/L −2.98 ± 6.26 −2.77 ± 6.23 −4.28 ± 6.29 < 0.001* AG mmol/L 16.20 ± 5.34 16.11 ± 5.36 16.72 ± 5.14 0.002* HCO₃⁻ mmol/L 21.02 ± 5.63 21.25 ± 5.62 19.59 ± 5.47 < 0.001* Lac mmol/L 2.80 ± 2.46 2.71 ± 2.42 3.36 ± 2.66 < 0.001* Complete blood count WBC × 10⁹/L 15.28 ± 15.61 14.93 ± 13.86 17.45 ± 23.57 0.015* NEU × 10⁹/L 12.26 ± 8.60 12.06 ± 8.38 13.48 ± 9.75 0.012* NEU% % 78.76 ± 16.58 78.95 ± 16.09 77.59 ± 19.30 0.9 BASO × 10⁹/L 0.03 ± 0.06 0.03 ± 0.06 0.02 ± 0.04 < 0.001* BASO% % 0.21 ± 0.30 0.21 ± 0.31 0.15 ± 0.24 < 0.001* EOS × 10⁹/L 0.08 ± 0.33 0.08 ± 0.31 0.07 ± 0.44 < 0.001* EOS% % 0.68 ± 2.08 0.70 ± 1.90 0.58 ± 2.94 < 0.001* MONO × 10⁹/L 0.79 ± 1.24 0.81 ± 1.31 0.67 ± 0.73 < 0.001* MONO% % 5.75 ± 5.09 5.93 ± 5.27 4.62 ± 3.60 < 0.001* LYM × 10⁹/L 1.58 ± 9.87 1.52 ± 8.57 1.98 ± 15.66 < 0.001* LYM% % 10.08 ± 11.23 10.09 ± 10.49 9.99 ± 14.97 < 0.001* HGB g/L 10.30 ± 2.30 10.29 ± 2.30 10.36 ± 2.32 0.6 HCT % 31.76 ± 6.95 31.74 ± 6.95 31.90 ± 6.93 0.6 RBC × 10 12 3.46 ± 0.81 3.46 ± 0.81 3.47 ± 0.78 0.7 RDW-CV % 15.83 ± 2.60 15.83 ± 2.62 15.86 ± 2.52 0.4 MCH pg 29.95 ± 2.91 29.93 ± 2.88 30.05 ± 3.10 0.5 MCHC g/L 32.43 ± 1.71 32.43 ± 1.72 32.47 ± 1.67 > 0.9 MCV fL 92.40 ± 8.00 92.36 ± 7.86 92.64 ± 8.85 0.7 PLT × 10⁹/L 202.64 ± 126.61 207.75 ± 128.55 171.25 ± 108.95 < 0.001* Liver function tests TBIL mg/dL 2.32 ± 4.65 2.23 ± 4.68 2.90 ± 4.46 < 0.001* ALT IU/L 192.37 ± 656.37 196.21 ± 676.99 168.75 ± 511.75 0.06 AST IU/L 325.94 ± 1,223.13 337.02 ± 1,278.14 257.88 ± 804.37 0.035* ALP IU/L 141.73 ± 140.10 136.62 ± 132.15 173.08 ± 178.46 < 0.001* Coagulation APTT s 39.51 ± 24.14 39.41 ± 24.19 40.13 ± 23.86 0.072 PT s 18.44 ± 11.23 18.30 ± 11.21 19.34 ± 11.33 < 0.001* INR 1.69 ± 0.98 1.67 ± 0.99 1.77 ± 0.93 < 0.001* Renal function and electrolyte markers Glucose mmol/L 8.95 ± 5.53 8.99 ± 5.66 8.73 ± 4.67 0.5 BUN mg/dL 34.86 ± 27.50 34.70 ± 27.61 35.85 ± 26.81 0.1 Na⁺ mmol/L 138.00 ± 6.19 138.14 ± 6.18 137.12 ± 6.16 0.002* K⁺ mmol/L 4.28 ± 0.86 4.29 ± 0.86 4.22 ± 0.87 0.031* Cl⁻ mmol/L 103.26 ± 7.44 103.29 ± 7.46 103.06 ± 7.29 0.7 Ca 2 mg/dL 8.06 ± 0.94 8.08 ± 0.95 7.96 ± 0.89 0.005* Others LGR 0.38 ± 0.50 0.36 ± 0.47 0.51 ± 0.62 < 0.001* NLR 18.50 ± 24.32 17.55 ± 23.61 24.29 ± 27.58 < 0.001* PLR 331.82 ± 679.58 330.84 ± 711.42 337.87 ± 436.13 0.8 1 2 Table 2 Laboratory variables among patients with and without BSI in sixth affiliated hospital of Sun Yat-sen University cohort Characteristic Unit Overall, N = 754 1 Negative, N = 545 1 Positive, N = 209 1 p-value 2 Blood gas pH 7.40 ± 0.09 7.40 ± 0.08 7.39 ± 0.11 0.2 pH(T) 7.40 ± 0.08 7.40 ± 0.08 7.39 ± 0.10 0.2 Lac mmol/L 2.71 ± 3.62 2.41 ± 3.20 3.50 ± 4.45 < 0.001* pCO₂ mmHg 36.74 ± 9.68 36.75 ± 8.49 36.73 ± 12.26 0.3 pCO₂(T) mmHg 36.57 ± 8.82 36.50 ± 8.11 36.75 ± 10.48 0.7 tCO₂ mmol/L 23.94 ± 5.53 24.26 ± 5.48 23.10 ± 5.60 0.024* T ℃ 37.00 ± 0.67 36.99 ± 0.62 37.00 ± 0.79 > 0.9 BE mmol/L −1.54 ± 5.39 −1.25 ± 5.24 −2.31 ± 5.68 0.027* FiO₂ % 52.45 ± 17.25 51.48 ± 16.53 54.97 ± 18.80 0.008* RI 1.71 ± 1.94 1.62 ± 1.81 1.96 ± 2.24 0.052 HCO₃⁻ mmol/L 22.76 ± 5.32 23.06 ± 5.20 21.99 ± 5.54 0.015* HCO₃⁻(std) mmol/L 23.67 ± 4.24 23.97 ± 3.97 22.90 ± 4.79 0.012* pO₂ mmHg 138.14 ± 57.96 138.34 ± 54.29 137.61 ± 66.72 0.5 pO₂(T) mmHg 136.62 ± 58.31 137.95 ± 55.91 133.14 ± 64.16 0.14 HCT % 0.25 ± 0.07 0.25 ± 0.07 0.25 ± 0.07 0.2 BEecf mmol/L −1.91 ± 6.12 −1.64 ± 5.90 −2.62 ± 6.63 0.035* PaO₂/PAO₂ 0.47 ± 0.20 0.48 ± 0.20 0.45 ± 0.21 0.018* A-aDO₂ mmHg 186.98 ± 125.64 178.62 ± 116.62 208.78 ± 144.62 0.018* PaO₂ mmHg 330.64 ± 121.47 321.46 ± 112.63 354.58 ± 139.44 0.002* Glu mmol/L 8.88 ± 3.86 8.77 ± 3.86 9.16 ± 3.85 0.07 Osm mOsm/kg 289.53 ± 14.51 288.36 ± 14.44 292.57 ± 14.26 < 0.001* Ca 2 mmol/L 1.10 ± 0.18 1.10 ± 0.17 1.09 ± 0.20 0.5 Na⁺ mmol/L 140.23 ± 6.91 139.82 ± 6.81 141.29 ± 7.08 0.007* K⁺ mmol/L 3.68 ± 0.60 3.68 ± 0.56 3.69 ± 0.70 0.8 AG mmol/L 11.94 ± 5.83 11.48 ± 5.73 13.14 ± 5.92 < 0.001* Cl⁻ mmol/L 109.17 ± 6.49 108.92 ± 6.15 109.83 ± 7.30 0.12 CaO₂ mL/dL 5.17 ± 2.25 5.19 ± 2.30 5.12 ± 2.14 0.5 O₂Cap mL/dL 5.02 ± 2.22 5.04 ± 2.27 4.95 ± 2.11 0.4 CCO₂ mL/dL 5.47 ± 2.30 5.49 ± 2.36 5.43 ± 2.15 0.8 COHb % 1.25 ± 0.50 1.26 ± 0.50 1.25 ± 0.52 0.7 O₂Hb % 95.20 ± 8.61 95.68 ± 7.72 93.96 ± 10.50 0.091 SO₂ % 97.10 ± 8.38 97.75 ± 6.63 95.41 ± 11.62 0.026* tHb g/dL 7.67 ± 2.82 7.65 ± 2.50 7.74 ± 3.53 0.7 HHb % 3.52 ± 9.43 3.09 ± 8.38 4.63 ± 11.66 0.2 MetHb % 0.51 ± 0.43 0.52 ± 0.40 0.51 ± 0.51 0.3 OI mmHg 283.45 ± 125.65 287.28 ± 123.49 273.46 ± 130.89 0.2 Complete blood count WBC × 10⁹/L 12.23 ± 8.32 12.01 ± 7.57 12.81 ± 10.02 > 0.9 NEU × 10⁹/L 10.88 ± 7.70 10.71 ± 7.07 11.33 ± 9.13 > 0.9 NEU% 0.86 ± 0.11 0.86 ± 0.11 0.87 ± 0.11 0.091 BASO × 10⁹/L 0.01 ± 0.02 0.01 ± 0.02 0.01 ± 0.02 0.008* BASO% 0.00 ± 0.00 0.00 ± 0.00 0.00 ± 0.00 0.01* EOS × 10⁹/L 0.08 ± 0.31 0.08 ± 0.33 0.09 ± 0.24 0.5 EOS% 0.01 ± 0.02 0.01 ± 0.02 0.01 ± 0.02 0.7 LYM × 10⁹/L 0.71 ± 0.59 0.73 ± 0.55 0.68 ± 0.69 0.033* LYM% 0.08 ± 0.09 0.08 ± 0.09 0.08 ± 0.10 0.3 MONO × 10⁹/L 0.58 ± 0.73 0.59 ± 0.66 0.55 ± 0.89 0.009* MONO% 0.05 ± 0.03 0.05 ± 0.03 0.04 ± 0.03 < 0.001* HGB g/L 82.12 ± 23.12 82.72 ± 22.98 80.57 ± 23.45 0.3 HCT 21.72 ± 7.28 21.82 ± 7.51 21.47 ± 6.66 > 0.9 RBC × 10 12 2.88 ± 0.81 2.90 ± 0.81 2.81 ± 0.80 0.2 RDW-CV % 15.76 ± 3.30 15.72 ± 3.25 15.87 ± 3.42 0.6 RDW-SD fL 49.81 ± 9.73 49.60 ± 9.45 50.35 ± 10.42 0.3 MCH pg 28.75 ± 3.32 28.68 ± 3.38 28.91 ± 3.16 0.5 MCHC g/L 327.32 ± 14.80 327.12 ± 15.10 327.85 ± 14.02 0.3 MCV fL 87.79 ± 8.88 87.65 ± 8.84 88.17 ± 8.98 0.6 PLT × 10⁹/L 165.65 ± 111.84 180.33 ± 112.65 127.34 ± 100.25 < 0.001* MPV fL 10.12 ± 1.42 10.02 ± 1.38 10.36 ± 1.51 0.007* PDW-SD fL 16.17 ± 0.76 16.16 ± 0.69 16.20 ± 0.92 0.094 Coagulation APTT s 38.05 ± 15.76 37.06 ± 14.94 40.62 ± 17.50 0.001* FIB g/L 3.45 ± 1.44 3.54 ± 1.46 3.22 ± 1.38 0.006* PT s 17.29 ± 7.10 16.86 ± 6.44 18.39 ± 8.51 0.003* TT s 16.78 ± 8.43 16.15 ± 6.59 18.42 ± 11.84 < 0.001* INR 1.51 ± 0.67 1.46 ± 0.55 1.62 ± 0.89 0.003* Renal function and electrolyte markers Glu mmol/L 8.68 ± 4.22 8.61 ± 4.24 8.88 ± 4.18 0.2 Cl⁻ mmol/L 107.49 ± 7.74 107.11 ± 7.65 108.48 ± 7.89 0.027* Cr µmol/L 169.07 ± 411.33 154.01 ± 203.74 208.37 ± 708.37 0.005* Ca 2 mmol/L 2.06 ± 0.24 2.06 ± 0.24 2.07 ± 0.26 > 0.9 CO₂CP mmol/L 22.36 ± 5.10 22.67 ± 5.02 21.56 ± 5.23 0.031* K⁺ mmol/L 3.96 ± 0.55 3.96 ± 0.54 3.96 ± 0.60 > 0.9 Na⁺ mmol/L 142.11 ± 7.18 141.68 ± 7.17 143.24 ± 7.13 0.001* PO₄ 3 mmol/L 1.13 ± 0.56 1.12 ± 0.55 1.15 ± 0.61 0.5 Liver function tests DBIL µmol/L 15.23 ± 29.93 12.73 ± 21.31 21.74 ± 44.69 < 0.001* IBIL µmol/L 14.90 ± 16.99 13.55 ± 12.69 18.41 ± 24.64 0.002* TBIL µmol/L 30.17 ± 45.90 26.26 ± 32.32 40.35 ± 68.92 < 0.001* Others D-Dimer mg/L FEU 10.58 ± 17.63 9.38 ± 14.72 13.69 ± 23.34 0.013* NT-proBNP pg/mL 6,309.77 ± 8,263.99 5,890.30 ± 8,005.95 7,403.58 ± 8,828.31 0.002* TnI ng/mL 0.34 ± 1.54 0.38 ± 1.76 0.24 ± 0.66 0.017* hs-CRP mg/L 136.06 ± 77.03 135.12 ± 77.56 138.49 ± 75.76 0.6 PCT ng/mL 6.61 ± 17.82 5.24 ± 15.44 10.18 ± 22.54 0.3 LGR 0.51 ± 2.80 0.34 ± 0.60 0.96 ± 5.21 0.009* PLR 375.58 ± 932.31 408.46 ± 1,080.97 289.86 ± 283.48 < 0.001* NLR 23.59 ± 34.73 23.23 ± 36.01 24.52 ± 31.20 0.4 1 2 Across both cohorts, patients with BSI exhibited significant differences in numerous laboratory indicators on the first day of ICU admission compared to those without BSI. Notably, in the MIMIC cohort, BSI patients showed significantly lower levels of pCO₂ (40.70 vs. 43.08 mmHg, p p p p p These statistically significant laboratory differences suggest that critically ill patients with BSI already manifest distinct clinical patterns upon ICU admission, which could be harnessed by machine learning models for early prediction. Model performance In the internal validation using the full set of laboratory features collected within the first 24 h of ICU admission, tree-based machine learning models consistently outperformed linear classifiers (Fig. 2 Fig. 2 ROC curves of the top three classifiers. Receiver operating characteristic (ROC) curves for the three highest-performing models (XGBoost, ranger, LightGBM) in predicting bloodstream infections using all available features using tenfold cross-validation. Shaded areas indicate the 95% confidence intervals based on tenfold cross-validation. Area under the curve (AUC) values are annotated for each model In addition to AUROC, we evaluated the area under the precision–recall curve (AUPRC) and F1-score to account for the moderate class imbalance (14–28% BSI prevalence). As the best-performing model (XGBoost) achieved an AUPRC of 0.791 and an F1-score of 0.682 without reweighting or resampling, we retained the original class distribution in the primary analysis. To further assess the clinical utility and interpretability of our models, we generated calibration curves, DCA plots, and SHAP summary plots for the top-performing models. The calibration curves (Fig. 3 1 4 Fig. 3 Calibration curves of the LightGBM model. Calibration curves for the top-performing models based on LightGBM in the MIMIC ( A B Fig. 4 Decision curve analysis of the LightGBM model for predicting bloodstream infection. The x-axis represents the threshold probability for considering a patient at high risk, while the y-axis indicates the standardized net benefit. The red curve shows the performance of the LightGBM model, compared against two default strategies: assuming all patients are BSI-positive (gray line) or BSI-negative (black line) Furthermore, we compiled a comprehensive set of performance metrics, including accuracy, precision, sensitivity, specificity, and Brier scores for all models across various feature sets and validation schemes. To sum up, in the MIMIC-IV cohort, the best-performing model (XGBoost) achieved AUPRC = 0.791, sensitivity = 0.573, specificity = 0.967, F1-score = 0.682, and Brier score = 0.109. In the SYSU cohort, the top model (LightGBM) reached AUPRC = 0.848, sensitivity = 0.763, specificity = 0.830, F1-score = 0.733, and Brier score = 0.148. Detailed performance metrics for all models are presented in the Table 3 Table 3 Performance metrics for all models . learner_id AUROC AUPRC Brier Score Sensitivity Specificity Precision F1-score Accuracy MIMIC all feature classif.logistic 0.689 0.422 0.170 0.153 0.956 0.531 0.236 0.759 classif.glmnet 0.686 0.415 0.171 0.044 0.988 0.570 0.080 0.756 classif.lda 0.690 0.424 0.170 0.157 0.952 0.513 0.240 0.757 classif.ranger 0.867 0.757 0.128 0.327 0.990 0.911 0.478 0.827 classif.xgboost 0.874 0.791 0.109 0.573 0.967 0.847 0.682 0.870 classif.gbm 0.740 0.513 0.160 0.103 0.988 0.723 0.180 0.771 classif.lightgbm 0.866 0.778 0.106 0.527 0.973 0.863 0.654 0.864 classif.svm 0.790 0.592 0.144 0.335 0.954 0.699 0.452 0.802 classif.ksvm 0.787 0.586 0.146 0.329 0.956 0.706 0.448 0.802 SYSU all feature classif.logistic 0.677 0.584 0.235 0.488 0.721 0.579 0.554 0.622 classif.glmnet 0.681 0.595 0.223 0.428 0.788 0.603 0.515 0.633 classif.lda 0.666 0.588 0.236 0.464 0.729 0.569 0.555 0.616 classif.ranger 0.856 0.830 0.171 0.658 0.860 0.780 0.700 0.773 classif.xgboost 0.863 0.840 0.156 0.766 0.821 0.765 0.731 0.798 classif.gbm 0.733 0.678 0.206 0.562 0.788 0.672 0.615 0.691 classif.lightgbm 0.865 0.848 0.148 0.763 0.830 0.778 0.733 0.801 classif.svm 0.773 0.765 0.189 0.609 0.810 0.709 0.661 0.722 classif.ksvm 0.755 0.733 0.197 0.568 0.800 0.684 0.628 0.699 MIMIC Boruta-based feature classif.logistic 0.680 0.409 0.172 0.131 0.961 0.514 0.207 0.757 classif.glmnet 0.677 0.407 0.173 0.045 0.988 0.515 0.082 0.756 classif.lda 0.680 0.405 0.173 0.139 0.956 0.505 0.217 0.755 classif.ranger 0.858 0.732 0.130 0.322 0.987 0.885 0.471 0.824 classif.xgboost 0.868 0.775 0.113 0.574 0.955 0.803 0.668 0.861 classif.gbm 0.729 0.500 0.162 0.096 0.990 0.751 0.170 0.770 classif.lightgbm 0.862 0.760 0.110 0.523 0.965 0.825 0.639 0.856 classif.svm 0.772 0.554 0.154 0.253 0.957 0.661 0.363 0.784 classif.ksvm 0.777 0.560 0.153 0.253 0.957 0.666 0.363 0.784 SYSU Boruta-based feature classif.logistic 0.680 0.594 0.225 0.449 0.783 0.618 0.514 0.637 classif.glmnet 0.677 0.591 0.225 0.416 0.800 0.617 0.491 0.631 classif.lda 0.679 0.590 0.225 0.430 0.787 0.612 0.499 0.630 classif.ranger 0.808 0.767 0.181 0.658 0.796 0.710 0.680 0.736 classif.xgboost 0.819 0.778 0.199 0.701 0.778 0.705 0.701 0.745 classif.gbm 0.714 0.641 0.213 0.539 0.753 0.625 0.576 0.659 classif.lightgbm 0.829 0.786 0.175 0.694 0.788 0.716 0.703 0.748 classif.svm 0.730 0.667 0.210 0.567 0.771 0.658 0.605 0.681 classif.ksvm 0.741 0.679 0.205 0.587 0.782 0.676 0.624 0.696 Feature reduction using Boruta-selected predictors To assess whether feature selection could yield more parsimonious yet equally effective models, we applied the Boruta algorithm to each cohort (Fig. 5 Fig. 5 Feature importance determined by the Boruta algorithm. Feature selection results using the Boruta algorithm for the (A) MIMIC and (B) SYSU cohorts. Features are categorized as confirmed (green), tentative (yellow), or rejected (red). The importance score is derived from the distribution of shadow features, providing a robust assessment of each variable’s relevance to BSI prediction In the SYSU cohort, 12 features were selected, including alveolar-arterial oxygen gradient (A-aDO₂), direct bilirubin, eosinophils, standard bicarbonate, potassium, lactate, mean platelet volume, procalcitonin, PLR, platelet count, phosphate, and PaO₂. These selected variables reflect the key physiological, inflammatory, and metabolic factors involved in bloodstream infection risk and served as the input for simplified model training and interpretation. The reduced models constructed using the important predictors selected by Boruta achieved comparable performance to the full-feature models (Supplementary Fig. 2). In the MIMIC cohort, the AUROCs for XGBoost, random forest, and LightGBM were 0.87, 0.86, and 0.86, respectively—only marginally lower than those obtained using the full feature set. Similarly, in the SYSU cohort, the corresponding AUROCs were 0.82, 0.81, and 0.83. These results support the feasibility of reducing model complexity without sacrificing discriminative power. Notably, Wilcoxon test revealed no statistically significant differences between the full-feature and Boruta-based models across classifiers (p > 0.05), indicating that fewer but more informative features can effectively capture the underlying signal associated with BSI risk. External validation To evaluate the generalizability of the models across centers, we identified a subset of laboratory variables common to both cohorts and conducted cross-cohort validation. When trained on the MIMIC dataset and externally validated on SYSU cohort, the best-performing model (XGBoost) achieved an AUROC of 0.61. Conversely, training on SYSU and validating on MIMIC resulted in an AUROC of 0.64 (LightGBM). This decline in external performance likely reflects inter-institutional differences in patient characteristics, data distributions, and clinical practice patterns. Finally, we constructed models using only the 4 common important predictors (Lac, PLT, PLR and eosinophils counts) shared between the two cohorts. These minimal-feature models yielded a best AUROC of 0.65 (LightGBM: MIMIC → SYSU) and 0.61 (LightGBM: SYSU → MIMIC), indicating moderate yet consistent discriminative capacity. While performance was lower than in internal validation, these models demonstrated the potential of a compact, biologically relevant feature set for early BSI risk stratification in diverse ICU populations. Discussion These Bloodstream infections remain a major clinical concern in intensive care units, where they are associated with substantial morbidity and mortality. Reported mortality rates in ICU patients with BSIs range from 35% to over 50%, reflecting the severity and complexity of managing these infections in critically ill populations [ 18 19 Our study developed and validated ML models to predict the risk of BSI in ICU patients using laboratory parameters obtained within the first 24 h of admission. By design, the model is not intended to replace blood culture or indications for empiric antimicrobial therapy, such as septic shock. Instead, its primary utility lies in assisting decision-making in cases where the clinical probability of BSI is uncertain. Compared with the traditional blood culture results obtained days later, the ML model provides an immediate risk estimate based on routinely laboratory parameters, enabling faster stratification and potentially earlier intervention when indicated. In this study, we observed that patients who eventually developed BSIs already exhibited measurable differences in routine laboratory parameters during the first 24 h following ICU admission. This early divergence was consistently observed in both the SYSU and MIMIC cohorts, suggesting the presence of early pathophysiological alterations that may precede the clinical onset of infection. For instance, elevated serum lactate levels—a well-established marker of tissue hypoperfusion and cellular metabolic stress—were more frequently seen in BSI patients, even prior to culture confirmation [ 20 21 22 The temporal relationship between early laboratory abnormalities and subsequent BSI diagnosis underscores the potential value of predictive analytics in clinical care. By capturing and modeling these early warning signals, it may be possible to identify patients at high risk for BSI before overt clinical signs develop. In this context, we employed machine learning (ML) algorithms trained exclusively on laboratory data collected within the first 24 h of ICU admission to develop early prediction models for BSIs. The models achieved strong performance in the internal validation cohort (SYSU), with area under the receiver operating characteristic curve (AUROC) values reaching up to 0.83, suggesting that first-day routine laboratory tests carry meaningful predictive information for BSI risk stratification. Several limitations should be noted. First, different thresholds for missing data were applied when selecting variables in the two datasets (40% for MIMIC vs. 20% for SYSU), reflecting substantial differences in data completeness. A uniform, stricter threshold for MIMIC would have excluded many clinically important variables, potentially impairing model performance. Although we subsequently harmonized the variable sets and applied the same preprocessing pipeline to both datasets, this approach may have introduced selection bias and affected direct comparability between cohorts. Future studies with more complete and standardized datasets are warranted to minimize such bias. Second, model performance declined when applied to the external validation cohort, which may reflect differences in patient case mix, data collection procedures, clinical management protocols, and laboratory testing platforms between institutions. Variations in the prevalence of BSI and the availability of certain laboratory markers may also have contributed to the reduced generalizability. These findings underscore the need for model refinement using larger, more diverse training datasets and for harmonization of input variables across centers to enhance robustness. In addition, model recalibration—adjusting the predicted probabilities to better match the outcome distribution in new settings—may help mitigate performance degradation when the model is transferred to different clinical environments. Finally, the model is not designed to predict the exact timing of BSI onset or to identify the causative pathogens, which limits its scope of clinical application. Despite these limitations, our findings support the feasibility of using ML-based tools for early risk stratification of BSI based solely on routinely collected data. This approach holds promise for enhancing early clinical decision-making, guiding timely diagnostic workup, and optimizing empiric therapy—potentially improving patient outcomes in critical care environments. Future prospective studies and real-world validation are warranted to confirm the clinical utility of these models and to facilitate their integration into existing ICU workflows. Conclusion This retrospective dual-center study developed machine learning models to predict bloodstream infection (BSI) risk in ICU patients using first-day routine laboratory data. Simplified models with selected features maintained good performance. These results suggest that early BSI risk prediction based on routine data is feasible and may support timely clinical decisions in the ICU. Supplementary Information  Supplementary Material 1: Supplementary Fig. 1. SHAP summary plots for XGBoost models based on Boruta-selected features. SHAP summary plots for XGBoost models trained on Boruta-selected features. Each point represents a sample, and the color indicates the value of the feature. Features are ranked by their mean absolute SHAP values. Supplementary Material 2: Supplementary Fig. 2. ROC curves of the top three classifiers using Boruta-Selected predictors. ROC curves for the top three classifiersusing Boruta-selected predictors with tenfold cross-validation. Supplementary Material 3: Supplementary Table 1. missingness of potential predictive values in MIMIC cohort. Supplementary Material 4: Supplementary Table 2. missingness of potential predictive values in SYSU cohort. Supplementary Material 5. key code. key code of ML by mlr3 framework. Abbreviations BSIs Bloodstream infections ICU Intensive Care Unit ML Machine learning WBC White blood cell count ALT Aminotransferase ALP Alkaline phosphatase ALB Albumin TBIL Total bilirubin BUN Blood urea nitrogen K + Potassium Na + Sodium PT Prothrombin time APTT Activated partial thromboplastin time INR International normalized ratio PaO₂ Partial pressure of oxygen PaCO₂ Partial pressure of carbon dioxide HCO₃⁻ Bicarbonate BE Base excess CRP C-reactive protein PCT Procalcitonin PLR Platelet-to-lymphocyte ratio NLR Neutrophil-to-lymphocyte ratio LGR Lactate-to-glucose ratio AUROC Area under the receiver operating characteristic curve DCA Decision curve analysis SD Standard deviations A-aDO₂ Alveolar-arterial oxygen gradient Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Yanying Chen, Ziru Chen and Dongyun Xu contributed equally and are regarded as co-first authors. Acknowledgements We thank the MIMIC-IV database team and the staff of The Sixth Affiliated Hospital of Sun Yat-sen University for data support. We also acknowledge the contributions of all ICU clinicians who facilitated data extraction and annotation. Clinical trial Not applicable. Authors’ contributions YY.C., ZR.C. and DY.X. designed the study and drafted the manuscript. SB.L., FX.C., J.L. and CL.Z. collected and preprocessed the data. ST.C. and J.Y. performed the statistical analyses. XF.Y., XY.Y., and JM.L. critically revised the manuscript for important intellectual content. All authors read and approved the final manuscript. Funding Not applicable. Data availability The MIMIC-IV database is publicly accessible upon application via PhysioNet ( https://physionet.org/content/mimiciv/3.0/ Declarations Ethics approval and consent to participate The study was conducted in accordance with the Declaration of Helsinki. Ethics approval for the use of the SAH-SYSU dataset was obtained from the Institutional Review Board of The Sixth Affiliated Hospital of Sun Yat-sen University (approval number: 2025ZSLYEC-369), which also waived the requirement for individual informed consent owing to the retrospective design and use of anonymized data. The use of the publicly available MIMIC-IV database was approved by the Institutional Review Board of the Massachusetts Institute of Technology (MIT), with informed consent waived because all data were de-identified prior to analysis. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Dong R Liu W Weng L Temporal trends of sepsis-related mortality in China, 2006–2020: a population-based study Ann Intensive Care 2023 13 1 71 10.1186/s13613-023-01166-1 37578609 PMC10425320 Dong R, Liu W, Weng L, et al. Temporal trends of sepsis-related mortality in China, 2006–2020: a population-based study. Ann Intensive Care. 2023;13(1):71. 10.1186/s13613-023-01166-1. 37578609 10.1186/s13613-023-01166-1 PMC10425320 2. Hu F Yuan L Yang Y A multicenter investigation of 2,773 cases of bloodstream infections based on China antimicrobial surveillance network (CHINET) Front Cell Infect Microbiol 2022 12 1075185 10.3389/fcimb.2022.1075185 36590586 PMC9798236 Hu F, Yuan L, Yang Y, et al. A multicenter investigation of 2,773 cases of bloodstream infections based on China antimicrobial surveillance network (CHINET). Front Cell Infect Microbiol. 2022;12:1075185. 10.3389/fcimb.2022.1075185. 36590586 10.3389/fcimb.2022.1075185 PMC9798236 3. Adrie C Garrouste-Orgeas M Ibn Essaied W Attributable mortality of ICU-acquired bloodstream infections: impact of the source, causative micro-organism, resistance profile and antimicrobial therapy J Infect 2017 74 2 131 141 10.1016/j.jinf.2016.11.001 27838521 Adrie C, Garrouste-Orgeas M, Ibn Essaied W, et al. Attributable mortality of ICU-acquired bloodstream infections: impact of the source, causative micro-organism, resistance profile and antimicrobial therapy. J Infect. 2017;74(2):131–41. 10.1016/j.jinf.2016.11.001. 27838521 10.1016/j.jinf.2016.11.001 4. Gouel-Cheron A Swihart BJ Warner S Epidemiology of ICU-onset bloodstream infection: prevalence, pathogens, and risk factors among 150,948 ICU patients at 85 U.S. hospitals Crit Care Med 2022 50 12 1725 1736 10.1097/CCM.0000000000005662 36190259 PMC10829879 Gouel-Cheron A, Swihart BJ, Warner S, et al. Epidemiology of ICU-onset bloodstream infection: prevalence, pathogens, and risk factors among 150,948 ICU patients at 85 U.S. hospitals. Crit Care Med. 2022;50(12):1725–36. 10.1097/CCM.0000000000005662. 36190259 10.1097/CCM.0000000000005662 PMC10829879 5. Kollef MH Shorr AF Bassetti M Timing of antibiotic therapy in the ICU Crit Care 2021 25 1 360 10.1186/s13054-021-03787-z 34654462 PMC8518273 Kollef MH, Shorr AF, Bassetti M, et al. Timing of antibiotic therapy in the ICU. Crit Care. 2021;25(1):360. 10.1186/s13054-021-03787-z. 34654462 10.1186/s13054-021-03787-z PMC8518273 6. Weiss SL Fitzgerald JC Balamuth F Delayed antimicrobial therapy increases mortality and organ dysfunction duration in pediatric sepsis Crit Care Med 2014 42 11 2409 2417 10.1097/CCM.0000000000000509 25148597 PMC4213742 Weiss SL, Fitzgerald JC, Balamuth F, et al. Delayed antimicrobial therapy increases mortality and organ dysfunction duration in pediatric sepsis. Crit Care Med. 2014;42(11):2409–17. 10.1097/CCM.0000000000000509. 25148597 10.1097/CCM.0000000000000509 PMC4213742 7. Zasowski EJ Bassetti M Blasi F A systematic review of the effect of delayed appropriate antibiotic treatment on the outcomes of patients with severe bacterial infections Chest 2020 158 3 929 938 10.1016/j.chest.2020.03.087 32446623 Zasowski EJ, Bassetti M, Blasi F, et al. A systematic review of the effect of delayed appropriate antibiotic treatment on the outcomes of patients with severe bacterial infections. Chest. 2020;158(3):929–38. 10.1016/j.chest.2020.03.087. 32446623 10.1016/j.chest.2020.03.087 8. Tang F Yuan H Li X Qiao L Effect of delayed antibiotic use on mortality outcomes in patients with sepsis or septic shock: a systematic review and meta-analysis Int Immunopharmacol 2024 129 111616 10.1016/j.intimp.2024.111616 38310764 Tang F, Yuan H, Li X, Qiao L. Effect of delayed antibiotic use on mortality outcomes in patients with sepsis or septic shock: a systematic review and meta-analysis. Int Immunopharmacol. 2024;129:111616. 10.1016/j.intimp.2024.111616. 38310764 10.1016/j.intimp.2024.111616 9. Sterling SA Miller WR Pryor J Puskarich MA Jones AE The impact of timing of antibiotics on outcomes in severe sepsis and septic shock: a systematic review and meta-analysis Crit Care Med 2015 43 9 1907 1915 10.1097/CCM.0000000000001142 26121073 PMC4597314 Sterling SA, Miller WR, Pryor J, Puskarich MA, Jones AE. The impact of timing of antibiotics on outcomes in severe sepsis and septic shock: a systematic review and meta-analysis. Crit Care Med. 2015;43(9):1907–15. 10.1097/CCM.0000000000001142. 26121073 10.1097/CCM.0000000000001142 PMC4597314 10. Liporaci F Carlotti D Carlotti A A machine learning model for the early diagnosis of bloodstream infection in patients admitted to the pediatric intensive care unit PLoS ONE 2024 19 5 e0299884 10.1371/journal.pone.0299884 38691554 PMC11062549 Liporaci F, Carlotti D, Carlotti A. A machine learning model for the early diagnosis of bloodstream infection in patients admitted to the pediatric intensive care unit. PLoS ONE. 2024;19(5):e0299884. 10.1371/journal.pone.0299884. 38691554 10.1371/journal.pone.0299884 PMC11062549 11. Zhou T Ren Z Ma Y Early identification of bloodstream infection in hemodialysis patients by machine learning Heliyon 2023 9 7 e18263 10.1016/j.heliyon.2023.e18263 37519767 PMC10375788 Zhou T, Ren Z, Ma Y, et al. Early identification of bloodstream infection in hemodialysis patients by machine learning. Heliyon. 2023;9(7):e18263. 10.1016/j.heliyon.2023.e18263. 37519767 10.1016/j.heliyon.2023.e18263 PMC10375788 12. Zhang F Wang H Liu L Su T Ji B Machine learning model for the prediction of gram-positive and gram-negative bacterial bloodstream infection based on routine laboratory parameters BMC Infect Dis 2023 23 1 675 10.1186/s12879-023-08602-4 37817106 PMC10566101 Zhang F, Wang H, Liu L, Su T, Ji B. Machine learning model for the prediction of gram-positive and gram-negative bacterial bloodstream infection based on routine laboratory parameters. BMC Infect Dis. 2023;23(1):675. 10.1186/s12879-023-08602-4. 37817106 10.1186/s12879-023-08602-4 PMC10566101 13. Zoabi Y Kehat O Lahav D Weiss-Meilik A Adler A Shomron N Predicting bloodstream infection outcome using machine learning Sci Rep 2021 11 1 20101 10.1038/s41598-021-99105-2 34635696 PMC8505419 Zoabi Y, Kehat O, Lahav D, Weiss-Meilik A, Adler A, Shomron N. Predicting bloodstream infection outcome using machine learning. Sci Rep. 2021;11(1):20101. 10.1038/s41598-021-99105-2. 34635696 10.1038/s41598-021-99105-2 PMC8505419 14. Roimi M Neuberger A Shrot A Paul M Geffen Y Bar-Lavie Y Early diagnosis of bloodstream infections in the intensive care unit using machine-learning algorithms Intensive Care Med 2020 46 3 454 462 10.1007/s00134-019-05876-8 31912208 Roimi M, Neuberger A, Shrot A, Paul M, Geffen Y, Bar-Lavie Y. Early diagnosis of bloodstream infections in the intensive care unit using machine-learning algorithms. Intensive Care Med. 2020;46(3):454–62. 10.1007/s00134-019-05876-8. 31912208 10.1007/s00134-019-05876-8 15. Johnson AEW Bulgarelli L Shen L Author correction: MIMIC-IV, a freely accessible electronic health record dataset Sci Data 2023 10 1 219 10.1038/s41597-023-02136-9 37072428 PMC10113185 Johnson AEW, Bulgarelli L, Shen L, et al. Author correction: MIMIC-IV, a freely accessible electronic health record dataset. Sci Data. 2023;10(1):219. 10.1038/s41597-023-02136-9. 37072428 10.1038/s41597-023-02136-9 PMC10113185 16. Moons KG Altman DG Reitsma JB Transparent reporting of a multivariable prediction model for individual prognosis or diagnosis (TRIPOD): explanation and elaboration Ann Intern Med 2015 162 1 W1 73 10.7326/M14-0698 25560730 Moons KG, Altman DG, Reitsma JB, et al. Transparent reporting of a multivariable prediction model for individual prognosis or diagnosis (TRIPOD): explanation and elaboration. Ann Intern Med. 2015;162(1):W1-73. 10.7326/M14-0698. 25560730 10.7326/M14-0698 17. Stekhoven DJ Buhlmann P MissForest–non-parametric missing value imputation for mixed-type data Bioinformatics 2012 28 1 112 118 10.1093/bioinformatics/btr597 22039212 Stekhoven DJ, Buhlmann P. MissForest–non-parametric missing value imputation for mixed-type data. Bioinformatics. 2012;28(1):112–8. 10.1093/bioinformatics/btr597. 22039212 10.1093/bioinformatics/btr597 18. De Bus L Depuydt P Steen J Antimicrobial de-escalation in the critically ill patient and assessment of clinical cure: the DIANA study Intensive Care Med 2020 46 7 1404 1417 10.1007/s00134-020-06111-5 32519003 PMC7334278 De Bus L, Depuydt P, Steen J, et al. Antimicrobial de-escalation in the critically ill patient and assessment of clinical cure: the DIANA study. Intensive Care Med. 2020;46(7):1404–17. 10.1007/s00134-020-06111-5. 32519003 10.1007/s00134-020-06111-5 PMC7334278 19. Vincent JL Rello J Marshall J International study of the prevalence and outcomes of infection in intensive care units JAMA 2009 302 21 2323 2329 10.1001/jama.2009.1754 19952319 Vincent JL, Rello J, Marshall J, et al. International study of the prevalence and outcomes of infection in intensive care units. JAMA. 2009;302(21):2323–9. 10.1001/jama.2009.1754. 19952319 10.1001/jama.2009.1754 20. Jansen TC van Bommel J Woodward R Mulder PG Bakker J Association between blood lactate levels, Sequential Organ Failure Assessment subscores, and 28-day mortality during early and late intensive care unit stay: a retrospective observational study Crit Care Med 2009 37 8 2369 2374 10.1097/CCM.0b013e3181a0f919 19531949 Jansen TC, van Bommel J, Woodward R, Mulder PG, Bakker J. Association between blood lactate levels, Sequential Organ Failure Assessment subscores, and 28-day mortality during early and late intensive care unit stay: a retrospective observational study. Crit Care Med. 2009;37(8):2369–74. 10.1097/CCM.0b013e3181a0f919. 19531949 10.1097/CCM.0b013e3181a0f919 21. Audia S Mahevas M Samson M Godeau B Bonnotte B Pathogenesis of immune thrombocytopenia Autoimmun Rev 2017 16 6 620 632 10.1016/j.autrev.2017.04.012 28428120 Audia S, Mahevas M, Samson M, Godeau B, Bonnotte B. Pathogenesis of immune thrombocytopenia. Autoimmun Rev. 2017;16(6):620–32. 10.1016/j.autrev.2017.04.012. 28428120 10.1016/j.autrev.2017.04.012 22. Engelmann B Massberg S Thrombosis as an intravascular effector of innate immunity Nat Rev Immunol 2013 13 1 34 45 10.1038/nri3345 23222502 Engelmann B, Massberg S. Thrombosis as an intravascular effector of innate immunity. Nat Rev Immunol. 2013;13(1):34–45. 10.1038/nri3345. 23222502 10.1038/nri3345 ",
  "metadata": {
    "Title of this paper": "Thrombosis as an intravascular effector of innate immunity",
    "Journal it was published in:": "BMC Infectious Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482810/"
  }
}