{
  "title": "Paper_399",
  "abstract": "pmc Respirology Respirology 379 blackwellopen RESP Respirology (Carlton, Vic.) 1323-7799 1440-1843 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12486359 PMC12486359.1 12486359 12486359 40730495 10.1111/resp.70098 RESP70098 1 Commentary Commentary Melioidosis in Asia‐Pacific Nations: Expanding Boundaries but Unknowns Remain Currie Bart J. https://orcid.org/0000-0002-8878-8837  1  2 bart.currie@menzies.edu.au Meumann Ella M. https://orcid.org/0000-0001-7993-820X  1  2  3   1 Global and Tropical Health Division Menzies School of Health Research, Charles Darwin University Darwin Northern Territory Australia   2 Infectious Diseases Department Royal Darwin Hospital Darwin Northern Territory Australia   3 Microbiology Department Territory Pathology Darwin Northern Territory Australia * Correspondence: bart.currie@menzies.edu.au 29 7 2025 10 2025 30 10 498039 10.1111/resp.v30.10 917 919 05 7 2025 11 7 2025 01 10 2025 02 10 2025 03 10 2025 © 2025 The Author(s). Respirology https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/  Burkholderia pseudomallei diabetes melioidosis pneumonia sepsis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  B. J. Currie E. M. Meumann Melioidosis in Asia‐Pacific Nations: Expanding Boundaries but Unknowns Remain Respirology 30 10 2025 917 919 10.1111/resp.70098 PMC12486359 40730495  Funding: 1  Summary  Melioidosis is endemic in many regions of the Asia‐Pacific. The endemic boundaries of melioidosis remain unclear, but are likely expanding. With increasing diabetes, an ageing population and global climate change, rates of melioidosis are predicted to increase. 2 The 2025 surge of cases of melioidosis in north Queensland, Australia, is a timely reminder for clinicians in the Asia‐Pacific region to be vigilant for this enigmatic tropical infection [ 1 2 Following the first description of melioidosis in 1912 from Myanmar, progressive recognition of endemicity occurred through Southeast Asia, northern Australia, south Asia, and China [ 3 4 5 6 7 Sequencing geolocated isolates of the causative soil and water sapronotic bacterium,  Burkholderia pseudomallei  B. pseudomallei 8  B. pseudomallei 9 2 4  B. pseudomallei 1 10 Recognition that  B. pseudomallei 11  B. pseudomallei 2 12  B. cepacia  B. pseudomallei B. pseudomallei 2 Infection occurs through percutaneous exposure, inhalation, aspiration, or ingestion of  B. pseudomallei 11  B. pseudomallei  B. pseudomallei  B. pseudomallei 13 14 What remains unknown is the relative contribution of the three main modes of infection, with recognition that even with percutaneous exposure there may be bacteraemic spread and multifocal pneumonia analogous to that seen with  Staphylococcus aureus 13 Diagnosis of melioidosis requires confirmation of culture of  B. pseudomallei 1  B. pseudomallei  B. pseudomallei  B. cepacia  B. thailandensis 2 FIGURE 1 CT scans from a patient with pulmonary melioidosis showing a pulmonary mass with background emphysema (A) and a necrotic subcarinal lymph node (B). As for tuberculosis, therapy for melioidosis requires antibiotics for a prolonged period, unlike usual community‐acquired bacterial pneumonias. The therapy consists of an initial intensive phase of intravenous ceftazidime or meropenem, followed by an eradication phase of oral antibiotics, with trimethoprim/sulfamethoxazole preferred [ 2 Conflicts of Interest The authors declare no conflicts of interest. Acknowledgements We acknowledge the many clinical, laboratory and research colleagues who continue to work collaboratively across nations to better understand, prevent, diagnose and treat melioidosis through the World Melioidosis Network see: https://www.melioidosis.info/ References 1 J. Murdoch J. Hanson S. Smith What Is Responsible for the Extraordinary Melioidosis Season in Cairns This Wet Season? MJA InSight+ 2025 https://insightplus.mja.com.au/2025/17/what‐is‐responsible‐for‐the‐extraordinary‐melioidosis‐season‐in‐cairns‐this‐wet‐season/ 2 E. M. Meumann D. Limmathurotsakul S. J. Dunachie W. J. Wiersinga B. J. Currie  Burkholderia pseudomallei Nature Reviews. Microbiology 22 3 2024 155 169 37794173 10.1038/s41579-023-00972-5 3 D. A. B. Dance Melioidosis: The Tip of the Iceberg? Clinical Microbiology Reviews 4 1 1991 52 60 2004347 10.1128/cmr.4.1.52 PMC358178 4 J. K. Petras M. G. Elrod M. C. Ty Locally Acquired Melioidosis Linked to Environment ‐ Mississippi, 2020‐2023 New England Journal of Medicine 389 25 2023 2355 2362 38118023 10.1056/NEJMoa2306448 PMC10773590 5 D. Limmathurotsakul N. Golding D. A. B. Dance Predicted Global Distribution of Burkholderia Pseudomallei Nature Microbiology 1 2016 15008 10.1038/nmicrobiol.2015.8 27571754 6 L. D. Nolen E. Lirow J. E. Gee Differentiating New From Newly Detected: Melioidosis in Yap, Federated States of Micronesia American Journal of Tropical Medicine and Hygiene 101 2 2019 323 327 31264560 10.4269/ajtmh.19-0253 PMC6685557 7 H. Guterres C. Gusmao M. Pinheiro Melioidosis in Timor‐Leste: First Case Description and Phylogenetic Analysis Open Forum Infectious Diseases 10 8 2023 ofad405 37577114 10.1093/ofid/ofad405 PMC10414804 8 T. Pearson P. Giffard S. Beckstrom‐Sternberg Phylogeographic Reconstruction of a Bacterial Species With High Levels of Lateral Gene Transfer BMC Biology 7 2009 78 19922616 10.1186/1741-7007-7-78 PMC2784454 9 C. Chewapreecha M. T. Holden M. Vehkala Global and Regional Dissemination and Evolution of Burkholderia Pseudomallei Nature Microbiology 2 2017 16263 10.1038/nmicrobiol.2016.263 PMC5300093 28112723 10 E. M. Meumann M. Kaestli J. R. Webb   Burkholderia pseudomallei Emerging Infectious Diseases 31 2 2025 394 397 39983703 10.3201/eid3102.241385 PMC11845124 11 B. J. Currie Melioidosis: Evolving Concepts in Epidemiology, Pathogenesis, and Treatment Seminars in Respiratory and Critical Care Medicine 36 1 2015 111 125 25643275 10.1055/s-0034-1398389 12 L. Prideaux M. Sandeman H. Stratton A. D. Kelleher S. Smith J. Hanson Melioidosis in People Living With Diabetes; Clinical Presentation, Clinical Course and Implications for Patient Management Acta Tropica 263 2025 107559 39978614 10.1016/j.actatropica.2025.107559 13 B. J. Currie M. Mayo L. M. Ward The Darwin Prospective Melioidosis Study: A 30‐Year Prospective, Observational Investigation Lancet Infectious Diseases 21 12 2021 1737 1746 34303419 10.1016/S1473-3099(21)00022-0 14 S. Smith J. D. Stewart C. Tacon N. Archer J. Hanson Children With Melioidosis in Far North Queensland Are Commonly Bacteraemic and Have a High Case Fatality Rate Communicable Diseases Intelligence 41 4 2017 E318 E321 29864385 10.33321/cdi.2017.41.42 ",
  "metadata": {
    "Title of this paper": "Children With Melioidosis in Far North Queensland Are Commonly Bacteraemic and Have a High Case Fatality Rate",
    "Journal it was published in:": "Respirology (Carlton, Vic.)",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486359/"
  }
}