{
  "title": "Paper_1033",
  "abstract": "pmc Mol Ther Oncol Mol Ther Oncol 4545 mtonc Molecular Therapy Oncology 2950-3299 American Society of Gene & Cell Therapy PMC12475861 PMC12475861.1 12475861 12475861 41018975 10.1016/j.omton.2025.201046 S2950-3299(25)00115-8 201046 1 Original Article Epigenetic co-regulator HCF-1 promotes lung cancer via O-GlcNAcylation-dependent pathways Srivastava Priyanka P. 1 Dasari Abhilash 2 Kumar Saran 1 Gupta Ishaan 2 Jain Deepali deepalijain76@gmail.com 3 ∗ Minocha Shilpi sminocha@bioschool.iitd.ac.in 1 ∗∗ 1 2 3 ∗ deepalijain76@gmail.com ∗∗ sminocha@bioschool.iitd.ac.in 18 12 2025 02 9 2025 33 4 497593 201046 12 9 2024 10 2 2025 29 8 2025 02 09 2025 28 09 2025 29 09 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). The rise in the incidences of lung cancer currently poses a global health challenge, making it crucial to understand the underlying molecular and cellular mechanisms. Host cell factor-1 (HCF-1), a conserved epigenetic transcriptional co-regulator, undergoes proteolytic maturation and glycosylation by O-linked N-acetylglucosamine (O-GlcNAc) transferase (OGT). Elevated O-GlcNAc and OGT levels have been observed in lung cancer, highlighting their potential significance in disease progression. In human lung cancer tissues, we observed a significant upregulation of HCF-1, which coincides with increased OGT, O-GlcNAc, and Nkx2.1 (a diagnostic marker for non-small cell lung cancer [NSCLSC]) levels. To further explore HCF-1’s role mechanistically, we utilized the NSCLC cell lines, where HCF-1 depletion resulted in reduced proliferation, O-GlcNAcylation, Nkx2.1 expression, and O-GlcNAcylated proteins upon wheat germ agglutinin (WGA) pull-down, reinforcing its role in lung cancer progression. Additionally, Nkx2.1-mediated conditional knockout of HCF-1 impaired murine lung development and cell proliferation. Interestingly, OGT inhibition with OSMI-1 also reduced HCF-1, Nkx2.1 levels, and proliferation, suggesting a role for O-GlcNAcylation in HCF-1-mediated signaling cascades. Thus, our findings elucidate the critical role of HCF-1 and O-GlcNAcylation in lung cancer pathogenesis. These insights not only deepen our understanding of lung cancer pathogenesis but also identify potential molecular targets for studies aimed at intervention. Graphical abstract Minocha and colleagues show that host cell factor-1 (HCF-1) and O-GlcNAc transferase (OGT) are critical players in lung cancer progression. By influencing cell proliferation, global O-GlcNAcylation, and the expression of Nkx2.1—a prognostic marker for lung adenocarcinomas—the study highlights potential molecular targets for therapeutic intervention in managing lung cancer. Keywords MT: Regular Issue lung cancer NSCLC HCF-1 Nkx2.1 O-GlcNAcylation OGT host cell factor 1 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Lung cancer is one of the most commonly occurring cancers and is the leading cause of cancer-related deaths worldwide. 1 2 2 3 1 , 4 5 , 6 Host cell factor-1 (HCF-1) is a ubiquitously expressed chromatin-associated protein and a key transcriptional regulator involved in various cellular processes, including cell cycle progression, development, regeneration, metabolism, and transcriptional regulation. 7 , 8 , 9 , 10 , 11 , 12 , 13 , 14 , 15 , 16 17 , 18 , 19 , 20 11 , 21 A significant player in HCF-1 maturation is O-linked N-acetylglucosamine (O-GlcNAc) transferase (OGT), a highly conserved enzyme responsible for adding O-GlcNAc to serine/threonine residues of proteins. 17 , 21 , 22 17 , 22 , 23 24 , 25 Recently, HCF-1 has also been linked to oncogenesis. HCF-1 was found to be upregulated in hepatocellular carcinoma (HCC) patient samples, and enrichment studies showed its correlation with cell cycle regulation. 26 , 27 27 in vivo 28 29 30 OGT, as mentioned earlier, is an essential partner of HCF-1. Along with activating HCF-1 by proteolytic cleavage, it also O-GlcNAcylates HCF-1 in the basic region. 17 , 23 , 24 , 25 , 31 32 , 33 , 34 , 35 , 36 Results HCF-1 is differentially expressed in various cancers HCF-1 is known to display ubiquitous expression in most cells. 7 , 12 , 37 HCFC1 HCFC1 Figures S1 S2 HCFC1 HCFC1 Figure 1 HCFC1 HCFC1 Figure 1 HCF-1 is upregulated in lung cancer (A) Expression profile of HCFC1 HCFC1 HCF-1 is upregulated in lung cancer tumor tissue Our dataset analysis revealed differential expression of the HCFC1 Figure 1 Figures 1 2 S3 S4 S5 Figures 1 2 S3 S4 S5 Figure 2 HCF-1 upregulation co-localizes with LUAD prognostic marker (Nkx2.1) and cancer hallmark (O-GlcNAc) in adenocarcinoma tumor tissue Immunostaining of patient tissue sample (lung adenocarcinoma [sex: female, age: 64]) with anti-HCF-1, anti-Nkx2.1 (A1–A8), anti-OGT (B1–B8) and anti-O-GlcNAc (C1–C8). Merged panel shows that increased HCF-1 expression co-localizes with Nkx2.1, O-linked N-acetylglucosamine transferase and O-GlcNAc, and nuclear stain DAPI. Scale bars, 100 μm. Upregulated HCF-1 expression co-localized with proliferation markers, including PCNA (proliferating cell nuclear antigen;S phase; Figures 1 Figures S3 Figures 1 38 Figures 2 Figures S4 Figure S6 39 , 40 OGT and O-GlcNAc are known to be upregulated in lung cancer. Since OGT is essential for HCF-1 activity, we investigated whether their expression co-localizes with increased HCF-1 in patient samples. Indeed, elevated OGT and O-GlcNAc levels co-localized with HCF-1 in LUAD samples ( Figures 2 S5 Reduced HCF-1 expression impacts proliferation, methylation, O-linked glycosylation, and wound healing capacity Our immunohistochemistry results suggested a link between HCF-1 and increased proliferation in lung cancer. To further investigate this connection, we examined the effects of HCFC1 HCFC1 Figures 3 S7 S8 HCFC1 Figure 3 siRNA-mediated knockdown of HCFC1 Immunoblotting in control (non-targeting control siRNA transfected) and HCFC1 n p p p HCF-1 is known to regulate cell proliferation by modulating cell cycle. 11 , 41 HCFC1 Figures 4 S7 S8 10 , 42 , 43 HCFC1 Figures S9 Figures S9 Figure 4 siRNA-mediated knockdown of HCFC1 (A) Immunostaining in control (non-targeting control siRNA transfected) and HCFC1 HCFC1 n p Next, to check the downstream effects of HCFC1 lmo3 sftpa1 fgfr1 Figure 4 . Figure S10 44 , 45 , 46 HCFC1 47 HCFC1 Figure S10 HCFC1 Figures 4 O-GlcNAcylation and OGT are associated with lung cancer tumorigenicity and are essential for HCF-1 function. We therefore examined the effect of reduced HCF-1 expression on OGT and its glycosylation activity. siRNA-mediated HCFC1 knockdown in A549, NCI-H23, and NCI-H522 cells led to decreased OGT and O-GlcNAc levels ( Figures 3 S7 S8 Further, we wanted to investigate the effect of decreased O-GlcNAcylation levels on proteins upon HCF-1 knockdown. In this regard, wheat germ agglutinin (WGA) pull-down was performed, and the pull-down was validated by immunoblotting against O-GlcNAc (anti-RL2) ( Figure S11 HCFC1 Tables S1 S2 https://www.oglcnac.mcw.edu/ HCFC1 HCFC1 48 , 49 50 51 52 53 54 55 56 57 Figures S12 S13 58 , 59 , 60 HCFC1 58 , 59 , 61 , 60 , 62 HCFC1 Figure 5 Figure 5 Identification of O-GlcNAcylated proteins lost upon HCFC1 (A) Schematic representation of the WGA (wheat germ agglutinin) bead pull-down assay used to isolate O-GlcNAcylated proteins. (B) Venn diagram depicting the number of O-GlcNAcylated proteins identified in control versus HCFC1-knockdown A549 cells. The intersection represents proteins present in both conditions. (C) Gene Ontology (GO) enrichment analysis of O-GlcNAcylated proteins that are absent upon HCFC1 knockdown. (D) List of O-GlcNAcylated proteins specifically lost in A549 cells following HCFC1 depletion. Drug-based O-GlcNAcylation inhibition decreases HCF-1, proliferation, and Nkx2.1 levels Both O-linked glycosylation and proteolytic cleavage by OGT are necessary for proper activation of HCF-1. 24 63 Figures 6 S14 S15 Figure 6 Effect of OGT activity inhibition in A549 lung cancer cells Immunoblotting of control (DMSO) and OSMI-1-treated A549 cells with (A) anti-HCF-1, (D) anti-PH3S10, and (G) anti-O-GlcNAc (RL2). β-actin was used as the loading control. The immunoblots ( n p p p Upon OSMI-1 treatment, reduced HCF-1 levels were observed in the three cell lines ( Figures 6 S14 S15 Figures S10 S14 S15 64 As decreased HCF-1 levels were observed, we further wanted to investigate the effect of OSMI-1 on proliferation, wound healing, and Nkx2.1 levels. Upon treatment, we observed decreased proliferation as shown by the M phase marker pH3S10 in A549 cells ( Figures 6 Figure 6 Figures S14 S15 Figure S10 Figure S10 Overall, our findings highlight the crucial role of O-GlcNAcylation in the regulation of HCF-1 as well as its impact on cell proliferation in lung cancer cells. These results suggest that targeting O-GlcNAcylation through drugs like OSMI-1 could offer a promising therapeutic strategy for lung cancer by simultaneously disrupting multiple pathways essential for tumor growth and survival. Effects of loss of Nkx2.1-derived HCF-1 in murine lung Our results interestingly suggest a link between HCF-1 and Nkx2.1 in the progression of lung cancer; therefore, in order to explore this link further, we wanted to study the effects of loss of HCF-1 in Nkx2.1-derived cells in the lung. Hcfc1 C r e + H c f c 1 l o x / Y 15 Hcfc1 65 H c f c 1 l o x / l o x 12 C r e + H c f c 1 c K O / Y 66 The Nkx2.1- C r e + H c f c 1 c K O / Y C r e − H c f c 1 l o x / Y Figures 7 C r e + H c f c 1 c K O / Y Figure 7 Figure 7 C r e + H c f c 1 c K O / Y Figure S16 C r e + H c f c 1 c K O / Y C r e + H c f c 1 c K O / Y C r e − H c f c 1 l o x / Y Figures 7 C r e + H c f c 1 c K O / Y Figure 7 Nkx2.1-Cre-mediated loss of HCF-1 affects murine lung development, proliferation, and causes cell death (A) Hematoxylin/eosin staining of Nkx2.1 C r e + H c f c 1 c k o / Y C r e − H c f c 1 l o x / Y C r e + H c f c 1 c k o / Y C r e − H c f c 1 l o x / Y C r e + H c f c 1 c k o / Y C r e − H c f c 1 l o x / Y Discussion HCF-1 is a broad transcriptional co-regulator that has recently been loosely connected to and, directly or indirectly, implicated in HCC, lymphoma, colon, and prostate cancers. 27 , 28 , 29 , 30 In vitro HCFC1 lmo3 sftpa1 fgfr1 67 , 68 , 69 70 71 , 72 , 73 74 75 43 , 76 , 77 , 78 , 79 HCFC1 80 , 81 , 82 , 83 , 84 , 85 86 , 87 Our results also highlighted that HCF-1 loss led to reduced OGT and O-GlcNAcylation levels, both of which are upregulated in lung cancer. 88 , 89 32 , 33 , 36 , 90 , 91 24 , 92 HCFC1 93 Also, our results showed that inhibition of OGT activity or reduced O-GlcNAcylation levels (RL2) inhibited proliferation capabilities in A549, NCI-H23, and NCI-H522 lung cancer cell lines. Additionally, HCF-1 levels were also observed to be downregulated upon OSMI-1 treatment. Interestingly, upon O-GlcNAc inhibition in A549 cells, downregulation of Nkx2.1 was observed. These results highlight that both reduced HCF-1 reduction and O-GlcNAcylation levels mediate their effects in a similar fashion, thereby affecting proliferation and migration in A549, NCI-H23, and NCI-H522 cells. Additionally, both HCF-1 and O-GlcNAc levels regulate the levels of one another in a feedback loop. Thus, our study emphasizes the crucial roles that O-GlcNAcylation and HCF-1 play in the development and progression of lung cancer, and a targeted inhibition of these two might offer a new therapeutic approach in lung cancer. Additionally, OGT inhibitors (such as OSMI-1) have shown potential in disrupting oncogenic O-GlcNAc signaling and could be explored in combination with other epigenetic drugs. Nkx2.1 is essential for embryonic lung development and is known to be expressed consistently in the terminal respiratory unit, in Clara cells, and in conducting airways type II alveolar epithelial cells in adult lung tissue and is known to be highly expressed in NSCLC, which is also apparent from our TCGA dataset analysis and immunostainings. 94 , 95 HCFC1 Given its upregulation in lung cancer, HCF-1 could serve as a biomarker for early diagnosis or prognosis, and its expression levels could help in stratifying patients based on disease severity or predicting treatment responses. Exploring the efficacy of combining HCF-1 inhibitors or modulators with other therapeutic agents, such as OGT inhibitors or chemotherapy drugs, could provide synergistic effects and improve treatment outcomes, particularly in cases where conventional treatments fail. Materials and methods HCFC1 The datasets are obtained from GEO repository and TCGA database. The plot is generated using the ARCHS4 server. 96 96 Mice The Nkx2.1- C r e − H c f c 1 l o x / Y C r e + H c f c 1 c K O / Y 15 Patient sample Patient lung samples (tumor and adjacent normal tissue) were collected after resection. The protocol followed was in accordance with the ethics committee of All India Institute of Medical Sciences, Delhi (IECPG-701/29.09.2022). LUSC tissue sample used in this study is from a patient (sex: male, age: 62 years) diagnosed with stage IB/IIA cancer. Lung adenocarcinoma tissue samples used in this study are from four patients (patient 1, sex: female, age: 64 years; patient 2, sex: female, age: 52 years; patient 3, sex: male, age: 38 years; patient 4, sex: male, age: 53 years). Hematoxylin/eosin staining and immunohistochemistry The lung tissue was fixed in 4% paraformaldehyde followed by their paraffin block preparation. 4-μm-thin sections were taken on slides. For hematoxylin and eosin staining, the slides were dewaxed and rehydrated in ethanol gradient by plunging the slides 10 times in 100%, 95%, 80%, and 75% ethanol (in the same order) followed by washing in double-distilled water. The slides were then immersed in filtered hematoxylin solution for 7–8 min followed by washing with tap water and then plunging in alcohol acid. Then the slides were immersed in eosin solution for 45 s and dehydrated in ethanol gradient followed by plunging in xylene. The slides were then mounted with DPX mounting medium. For immunohistochemistry, the slides were dewaxed and rehydrated in ethanol gradient by plunging the slides 10 times in 100%, 95%, 80%, and 75% ethanol (in the same order) followed by washing in double-distilled water and then with 1× PBS. Antigen retrieval was carried out using boiling 10 mM sodium citrate pH 6.0 (freshly prepared), and blocking was carried out using 1× normal goat serum (NGS). Primary antibody incubation was performed at 4°C overnight followed by secondary antibody incubation at room temperature for 1 h. The antibody dilutions were prepared in 1× NGS. The sections were counterstained with either DAPI or Hoechst. Thereafter, the slides were mounted with Mowiol mounting medium and imaged using Nikon eclipse PI2. Cell culture A549 (RRID: CVCL_0023), NCI-H23 (RRID: CVCL-1547), NCI-H522 (RRID: CVCL-1567), and Neuro2a (RRID: CVCL-0470) cells were cultured in DMEM supplemented with 10% FBS and 1% Penicillin-Strep. The cells were maintained at 37°C and 5% CO 2 5 HCFC1 For drug treatment, the cells were treated with 25 μM OSMI-1 (SML1621, Sigma) for 24 h, and DMSO was used as control. For wound healing assay, after siRNA transfection and OSMI-1 treatment, the cell layer was wounded/scratched using a 10 μL sterile microtip and washed with 1× PBS twice. The plate was imaged 24 h after the scratch. Immunoblotting The cell pellets were lysed in commercial RIPA buffer (786-489, G-Biosciences), supplemented with 1 mM PMSF, protease, and phosphatase inhibitor cocktail (Roche) and 1 μM DTT. They were incubated for 30 min on ice and centrifuged at 14,000 rpm for 10 min at 4°C. For immunoblotting, the sample was mixed in an appropriate amount of 4× Laemmli buffer and heated at 95°C for 10 min, and equal amounts of all samples were loaded onto an 8%–10% SDS gel. The blocking was performed in 5% skimmed milk for 1 h at room temperature, followed by incubation with primary antibody overnight at 4°C and secondary antibody incubation at room temperature for 1 h. The blots were developed using Thermo Scientific SuperSignal West Pico PLUS Chemiluminescent Substrate on GE LAS 500 imager. Immunocytochemistry After the treatment/experiments, the coverslips were washed with 1× PBS and fixed with 4% paraformaldehyde for 15–20 min at room temperature. Permeabilization was performed with 1× PBST (0.2% Triton) for 5 min and washed with 1× PBS followed by blocking with 3% BSA for 1 h at room temperature. Primary antibody incubation was performed at 4°C overnight followed by secondary antibody incubation at room temperature for 1 h. The cells were counterstained with DAPI. Thereafter, the slides were mounted with Mowiol mounting medium and imaged using Nikon eclipse Ts2. Primary antibodies used: anti-HCF-1 (A-301-399A, Bethyl Laboratories), anti-Nkx2.1 (ab72876, Abcam), anti-OGT (sc-74546, Santa Cruz), anti-RL2 (ab2739, Abcam), anti-PCNA (sc25280, Santa Cruz), anti-Ki67 (41-5698-80, eBioscience), anti-pH3S10 (9701, Cell Signaling Technology), and anti-β-actin (A3854, Sigma-Aldrich). TUNEL assay TUNEL was performed on lung paraffin sections with One-step TUNEL In Situ Apoptosis Kit (E-CK-A320; Elabscience), according to the manufacturer’s directions. WGA pull-down and mass spectrometry WGA pull-down was performed as described previously. 77 , 97 For mass spectrometry analysis, the pull-down fractions were run on a 10% SDS gel. The gel was stained with colloidal Coomassie as per the manufacturer’s protocol. The whole gel lanes of control and HCF-1 knockdown sample were cut and trypsin digested (in-gel) followed by liquid chromatography-mass spectrometry triple TOF. RNA isolation, cDNA synthesis, and RT-qPCR A549 cells transfected with control siRNA and siRNA against HCFC1 . lmo3 lmo3 sftpa1 sftpa1 fgfr1 fgfr1 β-actin Statistical analysis All cell culture and mice experiments were performed using at least three independent biological replicates. For each analysis, quantification was performed using Fiji, and significance was calculated using Student’s t test. Data availability The datasets analyzed during the current study are available in the GEPIA2 server. 96 supplemental information Acknowledgments We thank Dr. Cecile Lebrand for the Nkx2.1-Cre mice. We thank Prof. Winship Herr for the experiments with Nkx2.1- C r e − H c f c 1 l o x / Y C r e + H c f c 1 c K O / Y the Science and Engineering Board SRG/2021/000341 the Department of Biotechnology BT/RLF/Re-entry/70/2017 IFCPAR CEFIPRA 6503-J the Department of Biotechnology BT/RLF/Re-entry/19/2018 the Science and Engineering Board CRG/2021/001586 MI02552G MI02419G MI02494G IIT Delhi Author contributions P.P.S., D.J., I.G., S.K., and S.M. conceived the study and designed the experiments. A.D. and I.G. performed the computational work, and P.P.S. performed the experimental work. Human NSCLC patient samples (tissue sections) were provided by D.J. All authors contributed in the analysis, data discussion, and the creation of the manuscript’s final draft. Declaration of interests The authors declare no competing interests. References 1 Thai A.A. Solomon B.J. Sequist L.V. Gainor J.F. Heist R.S. Lung cancer Lancet 398 2021 535 554 10.1016/S0140-6736(21)00312-3 34273294 2 Ferlay J. Colombet M. Soerjomataram I. Parkin D.M. Piñeros M. Znaor A. Bray F. Cancer statistics for the year 2020: An overview Int. J. Cancer 149 2021 778 789 10.1002/ijc.33588 33818764 3 Travis W.D. Brambilla E. Nicholson A.G. Yatabe Y. Austin J.H.M. Beasley M.B. Chirieac L.R. Dacic S. Duhig E. Flieder D.B. The 2015 World Health Organization Classification of Lung Tumors: Impact of Genetic, Clinical and Radiologic Advances since the 2004 Classification J. Thorac. Oncol. 10 2015 1243 1260 10.1097/JTO.0000000000000630 26291008 4 Jones G.S. Baldwin D.R. Recent advances in the management of lung cancer Clin. Med. 18 2018 s41–6 10.7861/clinmedicine.18-2s-s41 PMC6334032 29700092 5 Zappa C. Mousa S.A. Non-small cell lung cancer: current treatment and future advances Transl. Lung Cancer Res. 5 2016 288 300 10.21037/TLCR.2016.06.07 27413711 PMC4931124 6 Araghi M. Mannani R. Heidarnejad maleki A. Hamidi A. Rostami S. Safa S.H. Faramarzi F. Khorasani S. Alimohammadi M. Tahmasebi S. Akhavan-Sigari R. Recent advances in non-small cell lung cancer targeted therapy; an update review Cancer Cell Int. 23 2023 162 10.1186/s12935-023-02990-y 37568193 PMC10416536 7 Kristie T.M. Pomerantz J.L. Twomey T.C. Parent S.A. Sharp P.A. The cellular C1 factor of the herpes simplex virus enhancer complex is a family of polypeptides J. Biol. Chem. 270 1995 4387 4394 10.1074/jbc.270.9.4387 7876203 8 Kristie T.M. Vogel J.L. Sears A.E. Nuclear localization of the C1 factor (host cell factor) in sensory neurons correlates with reactivation of herpes simplex virus from latency Proc. Natl. Acad. Sci. USA 96 1999 1229 1233 9990006 10.1073/pnas.96.4.1229 PMC15445 9 Wysocka J. Herr W. The herpes simplex virus VP16-induced complex: the makings of a regulatory switch Trends Biochem. Sci. 28 2003 294 304 10.1016/S0968-0004(03)00088-4 12826401 10 Wysocka J. Myers M.P. Laherty C.D. Eisenman R.N. Herr W. Human Sin3 deacetylase and trithorax-related Set1/Ash2 histone H3-K4 methyltransferase are tethered together selectively by the cell-proliferation factor HCF-1 Genes Dev. 17 2003 896 911 10.1101/gad.252103 12670868 PMC196026 11 Zargar Z. Tyagi S. Role of Host Cell Factor-1 in cell cycle regulation Transcription 3 2012 187 192 10.4161/TRNS.20711 22771988 PMC3654768 12 Minocha S. Sung T.L. Villeneuve D. Lammers F. Herr W. Compensatory embryonic response to allele-specific inactivation of the murine X-linked gene Hcfc1 Dev. Biol. 412 2016 1 17 10.1016/j.ydbio.2016.02.019 26921005 13 Minocha S. Bessonnard S. Sung T.L. Moret C. Constam D.B. Herr W. Epiblast-specific loss of HCF-1 leads to failure in anterior-posterior axis specification Dev. Biol. 418 2016 75 88 10.1016/j.ydbio.2016.08.008 27521049 14 Minocha S. Villeneuve D. Praz V. Moret C. Lopes M. Pinatel D. Rib L. Guex N. Herr W. Rapid Recapitulation of Nonalcoholic Steatohepatitis upon Loss of Host Cell Factor 1 Function in Mouse Hepatocytes Mol. Cell Biol. 39 2019 e00405-18 10.1128/mcb.00405-18 30559308 PMC6379584 15 Minocha S. Herr W. Cortical and Commissural Defects Upon HCF-1 Loss in Nkx2.1-Derived Embryonic Neurons and Glia Dev. Neurobiol. 79 2019 578 595 10.1002/DNEU.22704 31207118 PMC6771735 16 Minocha S. Villeneuve D. Rib L. Moret C. Guex N. Herr W. Segregated hepatocyte proliferation and metabolic states within the regenerating mouse liver Hepatol. Commun. 1 2017 871 885 10.1002/hep4.1102 29404499 PMC5721458 17 Capotosti F. Guernier S. Lammers F. Waridel P. Cai Y. Jin J. Conaway J.W. Conaway R.C. Herr W. O-GlcNAc transferase catalyzes site-specific proteolysis of HCF-1 Cell 144 2011 376 388 10.1016/j.cell.2010.12.030 21295698 18 Julien E. Herr W. A switch in mitotic histone H4 lysine 20 methylation status is linked to M phase defects upon loss of HCF-1 Mol. Cell 14 2004 713 725 10.1016/j.molcel.2004.06.008 15200950 19 Reilly P.T. Herr W. Spontaneous reversion of tsBN67 cell proliferation and cytokinesis defects in the absence of HCF-1 function Exp. Cell Res. 277 2002 119 130 10.1006/excr.2002.5551 12061822 20 Xiang P. Li F. Ma Z. Yue J. Lu C. You Y. Hou L. Yin B. Qiang B. Shu P. Peng X. HCF-1 promotes cell cycle progression by regulating the expression of CDC42 Cell Death Dis. 11 2020 907 10.1038/s41419-020-03094-5 PMC7584624 33097698 21 Julien E. Herr W. Proteolytic processing is necessary to separate and ensure proper cell growth and cytokinesis functions of HCF-1 EMBO J. 22 2003 2360 2369 10.1093/emboj/cdg242 12743030 PMC156000 22 Bhuiyan T. Waridel P. Kapuria V. Zoete V. Herr W. Distinct OGT-Binding Sites Promote HCF-1 Cleavage PLoS One 10 2015 e0136636 10.1371/journal.pone.0136636 PMC4549301 26305326 23 Kapuria V. Röhrig U.F. Bhuiyan T. Borodkin V.S. Van Aalten D.M.F. Zoete V. Herr W. Proteolysis of HCF-1 by Ser/Thr glycosylation-incompetent O-GlcNAc transferase:UDP-GlcNAc complexes Genes Dev. 30 2016 960 972 10.1101/gad.275925 27056667 PMC4840301 24 Daou S. Mashtalir N. Hammond-Martel I. Pak H. Yu H. Sui G. Vogel J.L. Kristie T.M. Affar E.B. Crosstalk between O-GlcNAcylation and proteolytic cleavage regulates the host cell factor-1 maturation pathway Proc. Natl. Acad. Sci. USA 108 2011 2747 2752 10.1073/PNAS.1013822108 21285374 PMC3041071 25 Kapuria V. Rö Hrig § U.F. Waridel P. Lammers F. Borodkin V.S. Daan X. Van Aalten M.F. Zoete V. Herr W. The conserved threonine-rich region of the HCF-1 PRO repeat activates promiscuous OGT:UDP-GlcNAc glycosylation and proteolysis activities J. Biol. Chem. 293 2018 17754 17768 10.1074/jbc.RA118.004185 30224358 PMC6240873 26 Xiong D.-D. Feng Z.-B. Lai Z.-F. Qin Y. Liu L.-M. Fu H.-X. He R.-Q. Wu H.-Y. Dang Y.-W. Chen G. Luo D.Z. High throughput circRNA sequencing analysis reveals novel insights into the mechanism of nitidine chloride against hepatocellular carcinoma Cell Death Dis. 10 2019 658 10.1038/s41419-019-1890-9 PMC6737102 31506425 27 Wang H. Yu M. Yang C. Li Q. Upregulation of HCFC1 expression promoted hepatocellular carcinoma progression through inhibiting cell cycle arrest and correlated with immune infiltration J. Cancer 14 2023 1381 1397 10.7150/jca.84579 37283799 PMC10240668 28 Popay T.M. Wang J. Adams C.M. Howard G.C. Codreanu S.G. Sherrod S.D. McLean J.A. Thomas L.R. Lorey S.L. Machida Y.J. Myc regulates ribosome biogenesis and mitochondrial gene expression programs through its interaction with host cell factor–1 eLife 10 2021 e60191 10.7554/eLife.60191 33416496 PMC7793627 29 Parker J.B. Palchaudhuri S. Yin H. Wei J. Chakravarti D. A Transcriptional Regulatory Role of the THAP11–HCF-1 Complex in Colon Cancer Cell Function Mol. Cell Biol. 32 2012 1654 1670 10.1128/MCB.06033-11 22371484 PMC3347244 30 Lee K.H. Kim B.C. Jeong C.W. Ku J.H. Kim H.H. Kwak C. MLL5, a histone modifying enzyme, regulates androgen receptor activity in prostate cancer cells by recruiting co-regulators, HCF1 and SET1 BMB Rep. 53 2020 634 639 10.5483/BMBRep.2020.53.12.162 33050986 PMC7781910 31 Lazarus M.B. Jiang J. Kapuria V. Bhuiyan T. Janetzko J. Zandberg W.F. Vocadlo D.J. Herr W. Walker S. HCF-1 is cleaved in the active site of O-GlcNAc transferase Science 342 2013 1235 1239 10.1126/science.1243990 24311690 PMC3930058 32 Mi W. Gu Y. Han C. Liu H. Fan Q. Zhang X. Cong Q. Yu W. O-GlcNAcylation is a novel regulator of lung and colon cancer malignancy Biochim. Biophys. Acta 1812 2011 514 519 10.1016/j.bbadis.2011.01.009 21255644 33 Yang S. Xia J. Yang Z. Xu M. Li S. Lung cancer molecular mutations and abnormal glycosylation as biomarkers for early diagnosis Cancer Treat. Res. Commun. 27 2021 100311 10.1016/j.ctarc.2021.100311 33465560 34 Fang K. Long Q. Liao Z. Zhang C. Jiang Z. Glycoproteomics revealed novel N-glycosylation biomarkers for early diagnosis of lung adenocarcinoma cancers Clin. Proteomics 19 2022 43 10.1186/s12014-022-09376-8 36401165 PMC9675222 35 Kondo K. Harada Y. Nakano M. Suzuki T. Fukushige T. Hanzawa K. Yagi H. Takagi K. Mizuno K. Miyamoto Y. Identification of distinct N-glycosylation patterns on extracellular vesicles from small-cell and non-small-cell lung cancer cells J. Biol. Chem. 298 2022 101950 10.1016/j.jbc.2022.101950 PMC9117544 35447118 36 Lin Y.C. Lin C.H. Yeh Y.C. Ho H.L. Wu Y.C. Chen M.Y. Chou T.Y. High O-linked N-acetylglucosamine transferase expression predicts poor survival in patients with early stage lung adenocarcinoma Oncotarget 9 2018 31032 31044 10.18632/oncotarget.25772 30123425 PMC6089550 37 Wilson A.C. Parrish J.E. Massa H.F. Nelson D.L. Trask B.J. Herr W. The gene encoding the VP16-accessory protein HCF (HCFC1) resides in human Xq28 and is highly expressed in fetal tissues and the adult kidney Genomics 25 1995 462 468 10.1016/0888-7543(95)80046-O 7789979 38 Moisés J. Navarro A. Santasusagna S. Viñolas N. Molins L. Ramirez J. Osorio J. Saco A. Castellano J.J. Muñoz C. NKX2-1 expression as a prognostic marker in early-stage non-small-cell lung cancer BMC Pulm. Med. 17 2017 1 9 10.1186/s12890-017-0542-z 29237428 PMC5727907 39 Hicke L. Schubert H.L. Hill C.P. Ubiquitin-binding domains Nat. Rev. Mol. Cell Biol. 6 2005 610 621 10.1038/nrm1701 16064137 40 Ye Z. Yang J. Jiang H. Zhan X. Smokovski I. Tong Y. Peter Lucke-Wold B. Liang Y. The roles of protein ubiquitination in tumorigenesis and targeted drug discovery in lung cancer OPEN ACCESS EDITED BY Highlights. Frontiers in Endocrinology frontiersin.org Front Endocrinol 14 2023 1220108 10.3389/fendo.2023.1220108 PMC10546409 37795365 41 Snyder E.L. Watanabe H. Magendantz M. Hoersch S. Chen T.A. Wang D.G. Crowley D. Whittaker C.A. Meyerson M. Kimura S. Jacks T. Nkx2-1 Represses a Latent Gastric Differentiation Program in Lung Adenocarcinoma Mol. Cell 50 2013 185 199 10.1016/j.molcel.2013.02.018 23523371 PMC3721642 42 Julien E. Herr W. A Switch in Mitotic Histone H4 Lysine 20 Methylation Status Is Linked to M Phase Defects upon Loss of HCF-1 Mol. Cell 14 2004 713 725 10.1016/J.MOLCEL.2004.06.008 15200950 43 Tyagi S. Chabes A.L. Wysocka J. Herr W. E2F Activation of S Phase Promoters via Association with HCF-1 and the MLL Family of Histone H3K4 Methyltransferases Mol. Cell 27 2007 107 119 10.1016/J.MOLCEL.2007.05.030 17612494 44 Chen P.M. Wu T.C. Cheng Y.W. Chen C.Y. Lee H. NKX2-1-mediated p53 expression modulates lung adenocarcinoma progression via modulating IKKβ/NF-κB activation Oncotarget 6 2015 14274 14289 10.18632/ONCOTARGET.3695 25881545 PMC4546466 45 Zu Y.F. Wang X.C. Chen Y. Wang J.Y. Liu X. Li X. Li C.W. Xie Y.C. Luo Y. Shang X.Q. Guo J. Thyroid transcription factor 1 represses the expression of Ki-67 and induces apoptosis in non-small cell lung cancer Oncol. Rep. 28 2012 1544 1550 https://www.spandidos-publications.com/10.3892/or.2012.2009 22940844 10.3892/or.2012.2009 PMC3583567 46 Mastromarino M.G. Parini S. Azzolina D. Habib S. De Marni M.L. Luise C. Restelli S. Baietto G. Trisolini E. Massera F. Liquid Biopsy Detecting Circulating Tumor Cells in Patients with Non-Small Cell Lung Cancer: Preliminary Results of a Pilot Study Biomedicines 11 2023 153 10.3390/BIOMEDICINES11010153 PMC9855397 36672660 47 Leon T.Y.Y. Ngan E.S.W. Poon H.C. So M.T. Lui V.C.H. Tam P.K.H. Garcia-Barcelo M.M. Transcriptional regulation of RET by Nkx2-1, Phox2b, Sox10, and Pax3 J. Pediatr. Surg. 44 2009 1904 1912 10.1016/J.JPEDSURG.2008.11.055 19853745 48 Du H. Chen Y. Hou X. Huang Y. Wei X. Yu X. Feng S. Wu Y. Zhan M. Shi X. Plod2 regulated by transcription factor foxa1 promotes metastasis in nsclc Cell Death Dis. 8 2017 e3143 10.1038/cddis.2017.553 29072684 PMC5680920 49 Tong Y. Qi Y. Xiong G. Li J. Scott T.L. Chen J. He D. Li L. Wang C. Lane A.N. Xu R. The PLOD2/succinate axis regulates the epithelial–mesenchymal plasticity and cancer cell stemness Proc. Natl. Acad. Sci. USA 120 2023 e2214942120 10.1073/pnas.2214942120 PMC10194013 37155842 50 Ji X. Qian J. Rahman S.M.J. Siska P.J. Zou Y. Harris B.K. Hoeksema M.D. Trenary I.A. Heidi C. Eisenberg R. xCT (SLC7A11)-mediated metabolic reprogramming promotes non-small cell lung cancer progression Oncogene 37 2018 5007 5019 10.1038/s41388-018-0307-z 29789716 PMC6127081 51 Sumardika I.W. Chen Y. Tomonobu N. Kinoshita R. Ruma I.M.W. Sato H. Kondo E. Inoue Y. Yamauchi A. Murata H. Neuroplastin-β mediates S100A8/A9-induced lung cancer disseminative progression Mol. Carcinog. 58 2019 980 995 10.1002/mc.22987 30720226 52 Wang J. Lu Q. Cai J. Wang Y. Lai X. Qiu Y. Huang Y. Ke Q. Zhang Y. Guan Y. Nestin regulates cellular redox homeostasis in lung cancer through the Keap1–Nrf2 feedback loop Nat. Commun. 10 2019 5043 10.1038/s41467-019-12925-9 PMC6834667 31695040 53 Kim E.Y. Cha Y.J. Jeong S. Chang Y.S. Overexpression of CEACAM6 activates Src-FAK signaling and inhibits anoikis, through homophilic interactions in lung adenocarcinomas Transl. Oncol. 20 2022 101402 10.1016/j.tranon.2022.101402 PMC8968058 35358791 54 Gonias S.L. Karimi-Mostowfi N. Murray S.S. Mantuano E. Gilder A.S. Expression of LDL receptor-related proteins (LRPs) in common solid malignancies correlates with patient survival PLoS One 12 2017 e0186649 10.1371/journal.pone.0186649 PMC5663383 29088295 55 Zhu H. Liu H. Wen J. Yuan T. Ren G. Jiang Y. Yuan Y. Mei J. Yu Y. Li G. Overexpression of Human Aspartyl (Asparaginyl) β-hydroxylase in NSCLC: Its Diagnostic Value by Means of Exosomes of Bronchoalveolar Lavage Appl. Immunohistochem. Mol. Morphol. 29 2021 720 727 10.1097/PAI.0000000000000963 34433181 56 Liu B.-W. Sun N. Lin H. Zhou X.-J. Ma H.-Y. Wang X. Cao X.-C. Yu Y. ARTICLE The p53/ZEB1-PLD3 feedback loop regulates cell proliferation in breast cancer Cell Death Dis. 14 2023 751 10.1038/s41419-023-06271-4 PMC10656518 37978168 57 Cai C. Dang W. Liu S. Huang L. Li Y. Li G. Yan S. Jiang C. Song X. Hu Y. Gu J. Anthrax toxin receptor 1/tumor endothelial marker 8 promotes gastric cancer progression through activation of the PI3K/AKT/mTOR signaling pathway Cancer Sci. 111 2020 1132 1145 10.1111/cas.14326 31977138 PMC7156833 58 Kang Y.H. Kim D. Jin E.J. Down-regulation of Phospholipase D Stimulates Death of Lung Cancer Cells Involving Up-regulation of the Long ncRNA ANRIL Anticancer Res. 35 2015 2795 2803 https://ar.iiarjournals.org/content/35/5/2795.long 25964559 59 Salucci S. Aramini B. Bartoletti-Stella A. Versari I. Martinelli G. Blalock W. Stella F. Faenza I. Phospholipase Family Enzymes in Lung Cancer: Looking for Novel Therapeutic Approaches Cancers (Basel) 15 2023 3245 10.3390/cancers15123245 37370855 PMC10296511 60 Gu J. Liu Y. Xie B. Ye P. Huang J. Lu Z. Roles of toll-like receptors: From inflammation to lung cancer progression Biomed. Rep. 8 2018 126 132 10.3892/br.2017.1034 29435270 PMC5778860 61 Hoden B. DeRubeis D. Martinez-Moczygemba M. Ramos K.S. Zhang D. Understanding the role of Toll-like receptors in lung cancer immunity and immunotherapy Front. Immunol. 13 2022 1033483 10.3389/FIMMU.2022.1033483 PMC9659925 36389785 62 Zhang L. Zhang X. Shi Y. Ni Y. Fei J. Jin Z. Li W. Wang X. Wu N. Role and potential therapeutic value of histone methyltransferases in drug resistance mechanisms in lung cancer Front. Oncol. 14 2024 1376916 10.3389/FONC.2024.1376916 PMC10957659 38525426 63 Ortiz-Meoz R.F. Jiang J. Lazarus M.B. Orman M. Janetzko J. Fan C. Duveau D.Y. Tan Z.-W. Thomas C.J. Walker S. A Small Molecule That Inhibits OGT Activity in Cells ACS Chem. Biol. 10 2015 1392 1397 10.1021/acschembio.5b00004 25751766 PMC4475500 64 Barkovskaya A. Seip K. Prasmickaite L. Mills I.G. Moestue S.A. Itkonen H.M. Inhibition of O-GlcNAc transferase activates tumor-suppressor gene expression in tamoxifen-resistant breast cancer cells Sci. Rep. 10 2020 16992 10.1038/s41598-020-74083-z PMC7552408 33046784 65 Xu Q. Tam M. Anderson S.A. Fate mapping Nkx2.1-lineage cells in the mouse telencephalon J. Comp. Neurol. 506 2008 16 29 10.1002/cne.21529 17990269 66 Tiozzo C. De Langhe S. Yu M. Londhe V.A. Carraro G. Li M. Li C. Xing Y. Anderson S. Borok Z. Deletion of Pten expands lung epithelial progenitor pools and confers resistance to airway injury Am. J. Respir. Crit. Care Med. 180 2009 701 712 10.1164/rccm.200901-0100OC 19574443 PMC2778148 67 Aoyama M. Ozaki T. Inuzuka H. Tomotsune D. Hirato J. Okamoto Y. Tokita H. Ohira M. Nakagawara A. LMO3 Interacts with Neuronal Transcription Factor, HEN2, and Acts as an Oncogene in Neuroblastoma Cancer Res. 65 2005 4587 4597 15930276 10.1158/0008-5472.CAN-04-4630 68 Song Y.-F. Hong J.-F. Liu D.-L. Lin Q.-A. Lan X.-P. Lai G.-X. miR-630 targets LMO3 to regulate cell growth and metastasis in lung cancer Am. J. Transl. Res. 7 2015 1271 26328011 PMC4548319 69 Cheng Y. Hou T. Ping J. Chen T. Yin B. LMO3 promotes hepatocellular carcinoma invasion, metastasis and anoikis inhibition by directly interacting with LATS1 and suppressing Hippo signaling 06 Biological Sciences 0601 Biochemistry and Cell Biology J. Exp. Clin. Cancer Res. 37 2018 228 10.1186/s13046-018-0903-3 PMC6139164 30219064 70 Shang J. Song Q. Yang Z. Li D. Chen W. Luo L. Wang Y. Yang J. Li S. Identification of lung adenocarcinoma specific dysregulated genes with diagnostic and prognostic value across 27 TCGA cancer types Oncotarget 8 2017 87292 29152081 10.18632/oncotarget.19823 PMC5675633 71 Wang K. Ji W. Yu Y. Li Z. Niu X. Xia W. Lu S. FGFR1-ERK1/2-SOX2 axis promotes cell proliferation, epithelial–mesenchymal transition, and metastasis in FGFR1-amplified lung cancer Oncogene 37 2018 5340 5354 10.1038/s41388-018-0311-3 29858603 72 Lu T. Li Z. Yang Y. Ji W. Yu Y. Niu X. Zeng Q. Xia W. Lu S. The Hippo/YAP1 pathway interacts with FGFR1 signaling to maintain stemness in lung cancer Cancer Lett. 423 2018 36 46 10.1016/J.CANLET.2018.02.015 29452146 73 Quintanal-Villalonga Á. Ferrer I. Guruceaga E. Cirauqui C. Marrugal Á. Ojeda L. García S. Zugazagoitia J. Muñoz-Galván S. Lopez-Rios F. FGFR1 and FGFR4 oncogenicity depends on n-cadherin and their co-expression may predict FGFR-targeted therapy efficacy EBioMedicine 53 2020 102683 10.1016/j.ebiom.2020.102683 PMC7047190 32114392 74 XIE Y. NAIZABEKOV S. CHEN Z. TOKAY T. Power of PTEN/AKT: Molecular switch between tumor suppressors and oncogenes Oncol. Lett. 12 2016 375 378 10.3892/ol.2016.4636 27347153 PMC4906924 75 Zhao S. Allis C.D. Wang G.G. The language of chromatin modification in human cancers Nat. Rev. Cancer 21 2021 413 430 10.1038/S41568-021-00357-X 34002060 PMC10507815 76 Vogel J.L. Kristie T.M. The Dynamics of HCF-1 Modulation of Herpes Simplex Virus Chromatin during Initiation of Infection Viruses 5 2013 1272 1291 10.3390/V5051272 23698399 PMC3712308 77 Lane E.A. Choi D.W. Garcia-Haro L. Levine Z.G. Tedoldi M. Walker S. Danial N.N. HCF-1 Regulates De Novo Lipogenesis through a Nutrient-Sensitive Complex with ChREBP Mol. Cell 75 2019 357 371.e7 10.1016/J.MOLCEL.2019.05.019 31227231 PMC6744259 78 Zhou P. Wang Z. Yuan X. Zhou C. Liu L. Wan X. Zhang F. Ding X. Wang C. Xiong S. Mixed Lineage Leukemia 5 (MLL5) Protein Regulates Cell Cycle Progression and E2F1-responsive Gene Expression via Association with Host Cell Factor-1 (HCF-1) J. Biol. Chem. 288 2013 17532 17543 10.1074/JBC.M112.439729 23629655 PMC3682552 79 Kristie T.M. Liang Y. Vogel J.L. Control of α-herpesvirus IE gene expression by HCF-1 coupled chromatin modification activities Biochim. Biophys. Acta 1799 2010 257 265 10.1016/J.BBAGRM.2009.08.003 19682612 PMC2838944 80 Jiang T. Wang Y. Zhou F. Gao G. Ren S. Zhou C. Prognostic value of high EZH2 expression in patients with different types of cancer: a systematic review with meta-analysis Oncotarget 7 2016 4584 4597 10.18632/ONCOTARGET.6612 26683709 PMC4826228 81 Bajbouj K. Al-ali A. Ramakrishnan R.K. Saber-ayad M. Hamid Q. Histone Modification in NSCLC: Molecular Mechanisms and Therapeutic Targets Int. J. Mol. Sci. 22 2021 11701 10.3390/IJMS222111701 PMC8584007 34769131 82 Ramazi S. Dadzadi M. Sahafnejad Z. Allahverdi A. Epigenetic regulation in lung cancer MedComm 4 2023 e401 10.1002/MCO2.401 PMC10600507 37901797 83 Onishi T. Takashima T. Kurashige M. Ohshima K. Morii E. Mutually exclusive expression of EZH2 and H3K27me3 in non-small cell lung carcinoma Pathol. Res. Pract. 238 2022 154071 10.1016/J.PRP.2022.154071 35985089 84 Chen X. Song N. Matsumoto K. Nanashima A. Nagayasu T. Hayashi T. Ying M. Endo D. Wu Z. Koji T. High expression of trimethylated histone H3 at lysine 27 predicts better prognosis in non-small cell lung cancer Int. J. Oncol. 43 2013 1467 1480 10.3892/ijo.2013.2062 23969945 85 Zhang Y. Zheng B. Lou K. Xu X. Xu Y. Methylation patterns of Lys9 and Lys27 on histone H3 correlate with patient outcome and tumor progression in lung cancer Ann. Diagn. Pathol. 61 2022 152045 10.1016/j.anndiagpath.2022.152045 36115104 86 Bhat K.P. Ümit Kaniskan H. Jin J. Gozani O. Epigenetics and beyond: targeting writers of protein lysine methylation to treat disease Nat. Rev. Drug Discov. 20 2021 265 286 10.1038/s41573-020-00108-x 33469207 PMC8035164 87 Ansari J. Shackelford R.E. El-Osta H. Epigenetics in non-small cell lung cancer: from basics to therapeutics Transl. Lung Cancer Res. 5 2016 155 171 10.21037/TLCR.2016.02.02 27186511 PMC4858572 88 Ferrer C.M. Sodi V.L. Reginato M.J. O-GlcNAcylation in Cancer Biology: Linking Metabolism and Signaling J. Mol. Biol. 428 2016 3282 3294 10.1016/j.jmb.2016.05.028 27343361 PMC4983259 89 Szymura S.J. Zaemes J.P. Allison D.F. Clift S.H. D’innocenzi J.M. Gray L.G. Mckenna B.D. Morris B.B. Bekiranov S. Legallo R.D. NF-κB upregulates glutamine-fructose-6-phosphate transaminase 2 to promote migration in non-small cell lung cancer Cell Commun. Signal. 17 2019 24 10.1186/s12964-019-0335-5 PMC6421657 30885209 90 Liu X. Wang J. Xiang Y. Wang K. Yan D. Tong Y. The roles of OGT and its mechanisms in cancer Cell Biosci. 2024 121 10.1186/S13578-024-01301-W 39285476 PMC11406787 91 Le Minh G. Esquea E.M. Young R.G. Huang J. Reginato M.J. On a sugar high: Role of O-GlcNAcylation in cancer J. Biol. Chem. 299 2023 105344 10.1016/J.JBC.2023.105344/ASSET/889AB41F-DE26-4B9D-A31B-F276A22F2A34/MAIN.ASSETS/GR2.JPG PMC10641670 37838167 92 Capotosti F. Guernier S. Lammers F. Waridel P. Cai Y. Jin J. Conaway J.W. Conaway R.C. Herr W. O-GlcNAc Transferase Catalyzes Site-Specific Proteolysis of HCF-1 Cell 144 2011 376 388 10.1016/J.CELL.2010.12.030 21295698 93 Singh J.P. Zhang K. Wu J. Yang X. O-GlcNAc Signaling in Cancer Metabolism and Epigenetics Cancer Lett. 356 2015 244 250 10.1016/J.CANLET.2014.04.014 24769077 PMC4208982 94 Tanaka H. Yanagisawa K. Shinjo K. Taguchi A. Maeno K. Tomida S. Shimada Y. Osada H. Kosaka T. Matsubara H. Lineage-Specific Dependency of Lung Adenocarcinomas on the Lung Development Regulator TTF-1 Cancer Res. 67 2007 6007 6011 10.1158/0008-5472.CAN-06-4774 17616654 95 Herriges M. Morrisey E.E. Lung development: Orchestrating the generation and regeneration of a complex organ Development 141 2014 502 513 10.1242/dev.098186 24449833 PMC3899811 96 Tang Z. Kang B. Li C. Chen T. Zhang Z. GEPIA2: an enhanced web server for large-scale expression profiling and interactive analysis Nucleic Acids Res. 47 2019 W556 W560 10.1093/nar/gkz430 31114875 PMC6602440 97 Guinez C. Filhoulaud G. Rayah-Benhamed F. Marmier S. Dubuquoy C. Dentin R. Moldes M. Burnol A.F. Yang X. Lefebvre T. O-GlcNAcylation increases ChREBP protein content and transcriptional activity in the liver Diabetes 60 2011 1399 1413 10.2337/db10-0452 21471514 PMC3292313 Supplemental information  Document S1. Figures S1–S16 Table S1. O-GlcNAcylated proteins in control sample (non-targeting control siRNA-transfected A549 cells) upon WGA pull-down Table S2. O-GlcNAcylated proteins in HCFC1 knockdown sample in A549 cells upon WGA pull-down Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.omton.2025.201046 ",
  "metadata": {
    "Title of this paper": "O-GlcNAcylation increases ChREBP protein content and transcriptional activity in the liver",
    "Journal it was published in:": "Molecular Therapy Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475861/"
  }
}