{
  "title": "Paper_1058",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12474994 PMC12474994.1 12474994 12474994 41006410 10.1038/s41598-025-16940-3 16940 1 Article Predictive nomogram for severe acute kidney injury in patients with cancer receiving anti-PD-1/PD-L1 antibodies: a multicenter retrospective study Lou Qianqian 1 2 Luo Lingfan 3 Ye Xiaolan 4 Zheng Aihong 5 Ren Yan 2 Zhang Wei 2 Bu Shuangshan 1 Li Yiwen 2 Zhu Bin 2 Shao Lina shaolina@hmc.edu.cn 2 1 https://ror.org/020hxh324 grid.412899.f 0000 0000 9117 1462 Department of Nephrology, Dongyang Hospital (Affiliated Wenzhou University), 2 https://ror.org/03k14e164 grid.417401.7 0000 0004 1798 6507 Urology and Nephrology Center, Department of Nephrology, Zhejiang Provincial People’s Hospital (Affiliated People’s Hospital, Hangzhou Medical College), 3 https://ror.org/03k14e164 grid.417401.7 0000 0004 1798 6507 The Second Clinical College of Hangzhou Normal University (Zhejiang Provincial People’s Hospital), 4 https://ror.org/03k14e164 grid.417401.7 0000 0004 1798 6507 Center for Clinical Pharmacy, Cancer Center, Department of Pharmacy, Zhejiang Provincial People’s Hospital (Affiliated People’s Hospital, Hangzhou Medical College), 5 https://ror.org/03k14e164 grid.417401.7 0000 0004 1798 6507 Department of Medical Oncology, Cancer Center, Key Laboratory of Tumor Molecular Diagnosis and Individualized Medicine of Zhejiang Province, Zhejiang Provincial People’s Hospital (Affiliated People’s Hospital, Hangzhou Medical College), 26 9 2025 2025 15 478255 33279 8 1 2025 20 8 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Acute kidney injury (AKI) is a concerned complication in patients with cancer receiving anti-PD-1/PD-L1 therapy, with severe AKI linked to adverse outcomes. Here, we constructed and validated a predictive model for severe AKI in these patients. Patients administered anti-PD-1/PD-L1 antibody at the Dongyang People’s Hospital from January 2019 to December 2023 (831patients) were included and randomly assigned into training and testing sets in a 7:3 ratio. An external validation dataset (907 patients) was obtained from Zhejiang Provincial People’s Hospital. Severe AKI was defined AKI stages 2 and 3, based on the kidney disease improving global outcomes criteria. Severe AKI occurred in 4.2% (73/1738) of patients: 5.3% (31/581), 5.2% (13/250), and 3.2% (29/907) in the training, testing, and external validation sets, respectively. Overall survival was significantly lower in patients with severe AKI. In the training set, a nomogram for severe AKI was constructed using three predictive factors: higher systolic blood pressure, lower serum albumin level, and diuretic use. In the training set, the model achieved C-indices of 0.850, 0.829, and 0.808 for predicting severe AKI at 90, 180, and 360 days, respectively. Corresponding C-indices in the test set were 0.710, 0.775, and 0.857, while those in the external validation cohort reached 0.720, 0.772, and 0.757, demonstrating strong discriminability. Calibration charts and decision curve analyses confirmed its calibration capability and clinical utility. The developed nomogram aids in predicting severe AKI risk in patients receiving anti-PD-1/PD-L1 antibodies and supports effective preventive interventions. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-16940-3. Keywords Anti-PD-1/PD-L1 antibodies Acute kidney injury Nomogram Prediction model Multicenter study Subject terms Risk factors Cancer therapy Acute kidney injury Zhejiang Medical and Health Science and Technology Program 2025KY580 2024KY638 Zhang Wei Shao Lina Zhejiang Provincial Natural Science Foundation of China LY24H050002 Shao Lina pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Over the past decade, immune checkpoint inhibitors (ICIS) have revolutionized cancer treatment. Since the approval of the first PD-1 antibody, Opdivo, in Japan in 2014, anti-PD-1/PD-L1 antibodies have been increasingly used in the treatment of cancer 1 2 3 4 Despite significant progress in using anti-PD-1/PD-L1 antibodies in the treatment of cancer, clinical application remains challenging due to the adverse reactions observed during therapy. While the activated immune system enhances the antitumor effect, it can also cause an imbalance of immune tolerance, leading to normal tissue and organ damage, known as immune-related adverse reactions (irAEs) 5 6 7 9 9 11 The median onset of AKI related to anti-PD-1/PD-L1 antibodies is 14 weeks 12 13 A nomogram is a visual tool that represents the impact of each variable on an outcome and produces individualized predictions 14 Methods Definitions Within 12 months after the first dose of anti-PD-1 /PD-L1 antibody, AKI was defined as at least a 1.5-fold increase in the serum creatinine level from baseline within 7 days according to the Kidney Disease Improvement Global Outcomes (KDIGO) criteria for AKI and was graded according to the magnitude of the increaset 15 PD-1/PD-L1 inhibitor-associated AKI was defined as the occurrence of AKI in cancer patients treated with ≥ 1 dose of anti-PD-1 /PD-L1 antibody, and patients who developed AKI were systematically assessed for etiology. According to prespecified exclusion criteria, cases attributed to obstructive nephropathy or hemodynamic instability (dehydration due to circulatory failure, ischemic or septic ATN disease, etc.) were excluded before analysis. The remaining AKI cases that met the diagnostic criteria were classified as PD-1/PD-L1 inhibitor related AKI. Obstructive AKI encompassed all the identified reasons for bilateral ureteral obstruction, or obstruction of the urethral orific. The definition of Hemodynamic AKI is AKI occurring in the setting of dehydration (circulatory collapse, persistent diarrhea, frequent vomiting, etc.), ischemic or septic acute tubular necrosis conditions. Extrarenal immune-related adverse events (irAEs) were defined as non-renal toxicities documented within a 1-year post-treatment surveillance period, including thyroid dysfunction, skin rash, drug-induced liver injury, fever, pneumonia and others. The antibodies against PD-1/PD-L1 used in this research were pembrolizumab, tislelizumab, sintilimab, camrelizumab, nivolumab, penpulimab, toripalimab, atezolizumab, and durvalumab. Eligibility criteria The inclusion criterion was patients with cancer who were administered at least one dosage of anti-PD-1/PD-L1 antibodies. The exclusion criteria were presented as follows: (1) eGFR < 60 mL/min/1.73 m 2 Data sources and processing Our study comprised patients with malignant tumors who received therapy with antibodies against PD-1/PD-L1 at the Dongyang People’s Hospital, Zhejiang Province, from January 2019 to December 2023. The data was randomly divided into a training and an internal test set in a 7:3 ratio. The external validation set included patients from Zhejiang Provincial People’s Hospital from January 2018 to July 2023. The starting point of the study was the date of severe AKI diagnosis, and the censoring point was death, last follow-up, or end date. This study included demographic characteristics, laboratory data, and medication orders, such as sex, age, smoking history, hypertension, diabetes, malignancy type, targeted drug types, duration, and dosage, extrarenal adverse reactions, combined therapy with diuretics, other chemotherapy agents, serum creatinine, hemoglobin, and serum albumin levels. Variables included in the analysis have been described in the Supplementary Table 1. These data were obtained through the hospital’s electronic medical record system. Combined medications denoted other pharmacologic agents concurrently administered with PD-1/PD-L1 inhibitor therapy. Two nephrologists independently reviewed the etiology in all AKI cases, and a third physician resolved diagnostic discrepancies. A flowchart of the research design is shown in Fig. 1  Fig. 1 Flow diagram of the study design. PD-1, programmed cell death protein 1; PD-L1, programmed cell death ligand-1; Scr: serum creatinine; eGFR, estimated glomerular filtration rate; AKI, acute kidney injury; LASSO, least absolute shrinkage and selection operator; DAC, decision curve analysis. Statistical analysis Categorical variables are presented as frequency counts (percentages) and continuous variables as medians (interquartile range [IQR]). Group differences were assessed using the chi-squared test or Fisher’s exact test for categorical variables, and the t-test or Wilcoxon test for continuous variables according to their distribution. If the proportion of missing values was < 20%, imputation was carried out. Survival analysis was conducted by employing the Kaplan–Meier approach. The least absolute shrinkage and selection operator (LASSO) method was used to identify significant covariates incorporated into the COX regression model to select statistically substantial variables and construct a nomogram. The nomogram model was verified using a training set, test set, and validation set. Receiver operating characteristic (ROC) curves evaluated its differential ability, calibration charts evaluated its accuracy, and decision curve analysis (DCA) measured its clinical benefits. Statistical analysis was performed using the R software (version 4.4.0; R Foundation for Statistical Computing, Auckland, NZ, USA). The R packages used mice, regplot, rms, survival, survival ROC, ggplot2, VIM, missForest, survminer, Hmisc, glmnet, tableone, and Survcomp. Statistical significance was set at p Ethical approval This study was approved by the Ethics Research Committees of Dongyang People’s Hospital (approval number: 2024-YX-015) and Zhejiang Provincial People’s Hospital (approval number: QT2024180). All methods were carried out in accordance with the Declaration of Helsinki. Informed agreement As this was a study of a retrospective nature, the Medical Ethics Committee of Zhejiang Provincial People’s Hospital waived the requirement of informed consent. Results Basic characteristics results A total of 1738 patients with cancer receiving anti-PD-1/PD-L1 antibodies were selected for this study. The median patient age was 65, and 27% (469/1738) were female. The median follow-up duration was 167.9 days (IQR: 68.0, 368.7), and the median time to AKI events was 64.1 days (IQR: 25.0, 152.1). Extrarenal irAEs occurred in 464 (26.7%) patients. Baseline demographic characteristics, tumor types, concomitant diseases, and laboratory data are presented in Table 1 2  Table 1 Baseline characteristics of the study cohort. Overall Dongyang People’s Hospital Zhejiang Provincial People’s Hospital P Train set Test set External validation set No. 1738 581 250 907 Severe AKI n(%) 73 (4.2) 31 (5.3) 13 (5.2) 29 (3.2) 0.04 Sex (female) n(%) 469 (27.0) 154 (26.5) 68 (27.2) 247 (27.2) 0.85 Age (years) 65 [57, 72] 66 [58, 72] 66 [56, 71] 64 [57, 72] 0.112 Smoking habit n(%) 746 (42.9) 327 (56.3) 143 (57.2) 276 (30.4) < 0.001 Alcohol habit n(%) 589 (33.9) 282 (48.5) 114 (45.6) 193 (21.3) < 0.001 SBP (mmHg) 122 [111, 135] 120 [109, 132] 122 [112, 135] 123 [113, 135] 0.001 DBP (mmHg) 74 [67, 81] 73 [64, 81] 76 [68, 82] 75 [68, 82] 0.006 Concomitant diseases HBP n(%) 558 (32.1) 197 (33.9) 84 (33.6) 277 (30.5) 0.159 DM n(%) 222 (12.8) 68 (11.7) 20 (8.0) 134 (14.8) 0.011 COPD n(%) 66 (3.8) 40 (6.9) 13 (5.2) 13 (1.4) < 0.001 Cirrhosis n (%) 158 (9.1) 62 (10.7) 26 (10.4) 70 (7.7) 0.046 CVD n(%) 93 (5.4) 43 (7.4) 13 (5.2) 37 (4.1) 0.019 Types of tumor Hepatobiliary pancreas n(%) 396 (22.8) 125 (21.5) 66 (26.4) 205 (22.6) 0.895 Lung n(%) 571 (32.9) 182 (31.3) 85 (34.0) 304 (33.5) 0.573 Urinary system n(%) 87 (5.0) 25 (4.3) 9 (3.6) 53 (5.8) 0.118 Gastrointestinal n(%) 484 (27.8) 182 (31.3) 53 (21.2) 249 (27.5) 0.741 Genital system n(%) 85 (4.9) 24 (4.1) 10 (4.0) 51 (5.6) 0.171 Melanoma n(%) 16 (0.9) 8 (1.4) 4 (1.6) 4 (0.4) 0.053 Head-neck n(%) 95 (5.5) 35 (6.0) 17 (6.8) 43 (4.7) 0.199 Breast n(%) 25 (1.4) 5 (0.9) 2 (0.8) 18 (2.0) 0.072 Other n(%) 75 (4.3) 37 (6.4) 17 (6.8) 21 (2.3) < 0.001 Laboratory data eGFR (mL/min/1.73 m 2 99.0 [88.9, 112.7] 96.4 [89.3, 105.4] 96.7 [89.8, 104.8] 103.1 [87.9, 121.8] < 0.001 ALT (U/L) 19.0 [12.3, 31.0] 19.0 [12.0, 32.0] 19.0 [12.0, 37.8] 19.0 [13.0, 30.0] 0.57 GGT (U/L) 35.0 [21.0, 73.0] 33.0 [21.0, 72.0] 37.5 [21.0, 75.0] 36.0 [21.0, 73.0] 0.531 LDL-C (mmol/L) 2.56 [2.01, 3.17] 2.52 [1.95, 3.10] 2.58 [1.94, 3.26] 2.60 [2.06, 3.18] 0.135 AST (U/L) 24 [18, 33] 23 [17, 34] 24 [17, 33] 24 [18, 33] 0.076 Uric acid (umol/L) 293 [232, 354] 293 [229, 352] 291 [220, 346] 296 [241, 359] 0.02 TC (mmol/L) 3.50 [2.47, 4.48] 2.46 [1.80, 3.07] 2.54 [1.81, 3.26] 4.34 [3.70, 5.08] < 0.001 Albumin (g/L) 36.8 [33.5, 40.2] 37.8 [34.1, 41.3] 37.4 [34.3, 40.5] 36.1 [33.1, 39.3] < 0.001 Globulin (g/L) 29.8 [26.5, 33.4] 29.4 [26.1, 33.4] 29.9 [26.5, 33.5] 29.8 [26.7, 33.4] 0.113 Phosphorus (mmol/L) 1.10 [0.97, 1.23] 1.05 [0.94, 1.20] 1.08 [0.95, 1.19] 1.13 [1.00, 1.26] < 0.001 Glucose (mmol/L) 5.13 [4.64, 5.76] 5.10 [4.65, 5.71] 5.06 [4.62, 5.70] 5.17 [4.66, 5.81] 0.102 LDH (mmol/L) 198.0 [165.0, 247.0] 203.0 [174.0, 260.0] 208.5 [176.3, 264.5] 191.0 [159.0, 232.5] < 0.001 Monocyte count (×10 9 0.45 [0.32, 0.60] 0.48 [0.36, 0.64] 0.51 [0.38, 0.67] 0.40 [0.30, 0.55] < 0.001 Eosinophil count (×10 9 0.10 [0.05, 0.19] 0.10 [0.05, 0.17] 0.11 [0.06, 0.22] 0.10 [0.05, 0.19] 0.576 White blood cell count (×10 9 5.85 [4.49, 7.59] 5.59 [4.41, 7.29] 6.07 [4.61, 7.92] 5.96 [4.50, 7.66] 0.336 Lymphocyte count (×10 9 1.16 [0.80, 1.54] 1.11 [0.79, 1.45] 1.09 [0.77, 1.55] 1.20 [0.84, 1.60] 0.001 Hemoglobin (g/L) 120.0 [107.3, 133.8] 119.0 [108.0, 134.0] 119.0 [109.0, 134.0] 120.0 [107.0, 133.0] 0.926 hsCRP (mg/L) 9.0 [2.6, 31.6] 9.3 [2.6, 29.9] 11.0 [2.3, 40.3] 8.4 [2.8, 30.0] 0.661 Urine white blood cells positive n(%) 244 (14.0) 64 (11.0) 27 (10.8) 153 (16.9) 0.001 SG urine 1.02 [1.01, 1.02] 1.02 [1.01, 1.02] 1.02 [1.01, 1.02] 1.02 [1.01, 1.02] 0.082 AKI, acute kidney injury; SBP, systolic blood pressure; DBP, diastolic blood pressure; HBP, high blood pressure; DM, diabetes mellitus; COPD, chronic obstructive pulmonary disease; CVD, cardiovascular disease; eGFR, estimated glomerular filtration rate; ALT, alanine transaminase; GGT, gamma-glutamyl transpeptidase; LDLC, low-density lipoprotein cholesterol; AST, aspartate aminotransferase; TC, total cholesterol; LDH, lactate dehydrogenase; hsCRP, high sensitivity C reactive protein; SG Urine, specific gravity of urine.  Table 2 The treatment and outcome event indicators of the study cohort. Overall Dongyang People’s Hospital Zhejiang Provincial People’s Hospital P Train set Test set External validation set No. 1738 581 250 907 Severe AKI n(%) 73 (4.2) 31 (5.3) 13 (5.2) 29 (3.2) 0.04 AKI stage No or stage 1 n(%) 1665 (95.8) 550 (94.7) 237 (94.8) 878 (96.8) 0.01 Stage 2 n(%) 47 (2.7) 18 (3.1) 6 (2.4) 23 (2.5) Stage 3 n(%) 26 (1.5) 13 (2.2) 7 (2.8) 6 (0.7) Died n(%) 88 (5.1) 35 (6.0) 11 (4.4) 42 (4.6) 0.453 Follow up time (days) 167.9 [68.0, 368.7] 205.0 [83.0, 429.0] 224.5 [89.8, 491.5] 140.8 [57.0, 294.2] < 0.001 AKI occur time (days) 64.1 [25.0, 152.1] 83.1 [28.1, 185.0] 69 [25.1, 178.3] 51.1 [24.0, 132.1] < 0.001 AKI occur in 90 days after initiation therapy n(%) 33 (45.2) 15 (48.4) 4 (30.8) 14 (48.3) – AKI occur in 180 days after initiation therapy n(%) 51 (69.9) 20 (64.5) 5 (38.5) 26 (89.7) – AKI occur in 360 days after initiation therapy n(%) 73 (100) 31 (100) 13 (100) 29 (100) – Extrarenal IRAEs Extrarenal IRAEs n(%) 464 (26.7) 255 (43.9) 106 (42.4) 103 (11.4) < 0.001 Thyroid dysfunction n(%) 176 (10.1) 85 (14.6) 36 (14.4) 55 (6.1) < 0.001 Skin injuries n(%) 53 (3.0) 18 (3.1) 10 (4.0) 25 (2.8) 0.547 Gastrointestinal symptoms n (%) 25 (1.4) 12 (2.1) 4 (1.6) 9 (1.0) 0.153 Fever n(%) 60 (3.5) 19 (3.3) 11 (4.4) 30 (3.3) 0.831 Pneumonia n(%) 17 (1.0) 5 (0.9) 4 (1.6) 8 (0.9) 0.856 Drug-induced liver injury n(%) 33 (1.9) 12 (2.1) 6 (2.4) 15 (1.7) 0.545 Other n(%) 164 (9.4) 119 (20.5) 40 (16.0) 5 (0.6) < 0.001 Combined medications PPI n(%) 1499 (86.2) 489 (84.2) 212 (84.8) 798 (88.0) 0.034 ACEI/ARB n(%) 254 (14.6) 117 (20.1) 45 (18.0) 92 (10.1) < 0.001 NSAIDs n(%) 1037 (59.7) 383 (65.9) 161 (64.4) 493 (54.4) < 0.001 H2 blockers n(%) 151 (8.7) 85 (14.6) 35 (14.0) 31 (3.4) < 0.001 Iohexol n(%) 1080 (62.1) 387 (66.6) 170 (68.0) 523 (57.7) < 0.001 Antibiotics n(%) 24 (1.4) 6 (1.0) 2 (0.8) 16 (1.8) 0.221 Diuretics n(%) 550 (31.6) 212 (36.5) 98 (39.2) 240 (26.5) < 0.001 Other antitumor drugs n(%) 1236 (71.1) 391 (67.3) 172 (68.8) 673 (74.2) 0.004 Platinum drugs n(%) 681 (39.2) 261 (44.9) 104 (41.6) 316 (34.8) < 0.001 Gemcitabine n(%) 141 (8.1) 47 (8.1) 15 (6.0) 79 (8.7) 0.387 Pemetrexed n(%) 96 (5.5) 24 (4.1) 16 (6.4) 56 (6.2) 0.256 Cytotoxic drugs n(%) 16 (0.9) 3 (0.5) 3 (1.2) 10 (1.1) 0.563 Targeted drug n(%) 321 (18.5) 91 (15.7) 37 (14.8) 193 (21.3) 0.002 Interleukin n(%) 243 (14.0) 151 (26.0) 74 (29.6) 18 (2.0) < 0.001 Classification of immune check point inhibitor PD-1 n(%) 1690 (97.2) 571 (98.3) 243 (97.2) 876 (96.6) 0.021 PD-L1 n(%) 36 (2.1) 10 (1.7) 6 (2.4) 20 (2.2) PD-1 and PD-L1 n(%) 12 (0.7) 0 (0.0) 1 (0.4) 11 (1.2) Times and dose of immune check point inhibitor (median [IQR]) Total dose 800 [400, 1800] 600 [400, 1200] 600 [400, 1350] 1200 [600, 2200] < 0.001 Pre AKI dose 800 [400, 1400] 400 [200, 800] 400 [200, 800] 1000 [600, 2200] < 0.001 Total times 4 [2, 9] 3 [2, 6] 3 [2, 6] 6 [3, 11] < 0.001 Pre AKI Times 4 [2, 7] 2 [1, 4] 2 [1, 4] 5 [3, 11] < 0.001 AKI, acute kidney injury; PPI, proton pump inhibitor; ACEI, angiotensin-converting enzyme inhibitors; ARB, angiotensin receptor blockers; NSAIDs, non-steroidal antiinflammatory drugs; H2 blockers, H2-receptor antagonists; PD-1, programmed cell death protein 1; PD-L1, programmed cell death ligand-1. Incidence and prognosis of anti-PD-1/PD-L1 antibodies related AKI Among the 1,738 patients, 73 (4.2%) developed severe AKI, with 47 (2.7%) in the AKI stage 2 and 26 (1.5%) in the AKI stage 3. Survival rates were significantly lower in the severe AKI group ( p 2  Fig. 2 Comparison of cumulative patient survival between the severe AKI group and the non-AKI group; Log-rank test, p Predictor selection and nomogram construction A total of 56 independent variables were included in the LASSO regression analysis. Based on the results, six variables were selected as potential predictors of severe AKI: baseline systolic blood pressure (SBP), aspartic transaminase (AST), serum albumin, combined therapy with nonsteroidal anti-inflammatory drugs (NSAIDs), combined therapy with diuretics, and the total dose of anti-PD-1/PD-L1 antibodies before AKI. The LASSO analysis screening results are shown in (Figs. 3 p p p 4  Fig. 3 Variable selection using the least absolute shrinkage and selection operator (LASSO): ( a b  Fig. 4 Multivariate COX regression analysis of the training set (SBP divided by 5; ALB divided by 10). SBP, systolic blood pressure; AST, aspartate aminotransferase; ALB, albumin; NSAIDs, non-steroidal anti-inflammatory drugs; AKI, acute kidney injury; PD-1, programmed cell death protein 1. Three independent predictors (elevated SBP, serum albumin level, and diuretic combination therapy) were incorporated into the model to construct a nomogram prediction model for severe AKI among patients undergoing therapy with antibodies against PD-1/PD-L1 (Fig. 5  Fig. 5 Nomogram of the severe acute kidney injury (AKI) model. In the nomogram, each patient’s value is displayed on an axis for each variable, and a line is drawn upward to determine the number of points each variable receives. The sum of these numbers is on the Total Points axis, and a line is drawn downward to the survival axes to determine the 90-, 180-, and 360-day probability of AKI. Alb, albumin; SBP, systolic blood pressure. Nomogram validation The calibration chart of the nomogram (Fig. 6 ) 7 7 8  Fig. 6 Calibration chart of the severe AKI model. ( a b c  Fig. 7 Receiver operating characteristic (ROC) curves based on the nomogram. ( a b c d  Fig. 8 Decision curve analysis (DCA) of the severe AKI model: ( a b c Discussion Using LASSO and COX regression analysis, we analyzed a large cohort from two centers to develop a clinically applicable nomogram prediction model based on three independent predictive factors (elevated systolic blood pressure, diuretic therapy, and lower serum albumin). This model demonstrated its value in individualized risk stratification for patients with cancer receiving anti-PD-1/PD-L1 antibody therapy. In the testing set, the C-statistics for predicting severe AKI at 90, 180, and 360 days were 0.710, 0.775, and 0.857, respectively. The C-statistics within the external validation set were 0.720, 0.772, and 0.757, respectively. These results demonstrate the excellent discriminatory capacity of the model in identifying patients at risk of developing severe AKI. The calibration and standard curves in the internal testing and external validation sets showed strong agreement, indicating that the predicted results closely matched the actual observations. This novel predictive nomogram for severe AKI represents a significant advancement, providing clinicians with a practical tool for risk stratification and effective patient management. Su J et al. 16 AKI is a common complication in patients undergoing treatment with anti-PD-1/PD-L1 antibodies. Earlier studies have indicated that the prevalence of severe AKI ranges from 2.3–4.1% 10 17 18 10 19 20 21 22 23 24 25 This study identified three predictive factors for AKI: elevated systolic blood pressure, diuretic therapy, and hypoproteinemia. These findings align with previous studies documenting the nephrotoxic potential of ICIs such as antibodies against PD-1 and PD-L1 9 26 28 26 29 9 26 28 30 31 33 34 35 2+ 36 Although this large multi-center study focused on AKI related to antibodies against PD-1/PD-L1 in the Chinese population, it has some limitations. First, as a retrospective cohort analysis, it might be subject to selection bias and confounding factors. However, we used LASSO regression to address the confounding factors, improve model accuracy, and prevent overfitting. Furthermore, our prediction model was validated using external datasets, partially addressing the limitations mentioned. Second, patients with hemodynamic, obstructive AKI, and abnormal renal function were excluded; however, due to the absence of pathological evidence, some cases of co-induced AKI may have been overlooked. And the absence of systematic records regarding gross hematuria or pre-existing primary/secondary nephropathy in patients may compromise the comprehensive identification of renal AKI risk factors. Third, the median follow-up period of 167.9 days may have been insufficient to capture long-term renal outcomes and chronic effects of AKI. Future studies should include a more extensive, multi-center cohort with an extended follow-up period to validate our findings and provide a more comprehensive understanding of this population’s AKI incidence and predictors. In conclusion AKI is a common complication in patients with cancer receiving anti-PD-1/PD-L1 antibody treatment, with severe AKI leading to decreased survival. Elevated systolic blood pressure, lower serum albumin, and diuretic therapy are independent predictors of severe AKI in these patients. The novel nomogram model developed in this study demonstrates good discriminative and predictive abilities, offering clinicians a tool for individualized predictions and effective preventive interventions to reduce severe AKI occurrence. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We would like to thank our colleagues at Dongyang Hospital and Zhejiang Provincial People’s Hospital for their valuable contributions to this study. We are grateful for the technical support and data platform from Yidu Cloud Technology Company Ltd. We would like to thank Editage (www.editage.cn) for English language editing. Author contributions L.S. & Q.L.: project design and development. S.B., Y.L., B.Z.: administrative support. W.Z., L.L.: collection, management, and assembly of data. A.Z., Y.R., L.L.: data collection, management, analysis. Q.L. & X.Y.: analysis, manuscript writing and editing. Data availability The datasets used in this study are available from the authors and corresponding authors upon reasonable request. Declarations Competing interests The authors declare no competing interests. Ethical approval This study was approved by the Ethics Research Committees of Dongyang People’s Hospital (approval number: 2024-YX-015) and Zhejiang Provincial People’s Hospital (approval number: QT2024180). Consent to participate As this was a retrospective study, the requirement for informed consent was waived. References 1. Deeks ED Nivolumab: A review of its use in patients with malignant melanoma Drugs 2014 74 11 1233 1239 10.1007/s40265-014-0234-4 25022950 Deeks, E. D. Nivolumab: A review of its use in patients with malignant melanoma. Drugs 74 25022950 10.1007/s40265-014-0234-4 2. Robert C A decade of immune-checkpoint inhibitors in cancer therapy Nat. Commun. 2020 11 1 3801 10.1038/s41467-020-17670-y 32732879 PMC7393098 Robert, C. A decade of immune-checkpoint inhibitors in cancer therapy. Nat. Commun. 11 32732879 10.1038/s41467-020-17670-y PMC7393098 3. Carlino MS Larkin J Long GV Immune checkpoint inhibitors in melanoma Lancet 2021 398 10304 1002 1014 10.1016/S0140-6736(21)01206-X 34509219 Carlino, M. S., Larkin, J. & Long, G. V. Immune checkpoint inhibitors in melanoma. Lancet 398 34509219 10.1016/S0140-6736(21)01206-X 4. Bagchi S Yuan R Engleman EG Immune checkpoint inhibitors for the treatment of cancer: Clinical impact and mechanisms of response and resistance Annu. Rev. Pathol. 2021 16 223 249 10.1146/annurev-pathol-042020-042741 33197221 Bagchi, S., Yuan, R. & Engleman, E. G. Immune checkpoint inhibitors for the treatment of cancer: Clinical impact and mechanisms of response and resistance. Annu. Rev. Pathol. 16 33197221 10.1146/annurev-pathol-042020-042741 5. Postow MA Sidlow R Hellmann MD Immune-related adverse events associated with immune checkpoint blockade N Engl. J. Med. 2018 378 2 158 168 10.1056/NEJMra1703481 29320654 Postow, M. A., Sidlow, R. & Hellmann, M. D. Immune-related adverse events associated with immune checkpoint blockade. N Engl. J. Med. 378 29320654 10.1056/NEJMra1703481 6. Sprangers B Leaf DE Porta C Soler MJ Perazella MA Diagnosis and management of immune checkpoint inhibitor-associated acute kidney injury Nat. Rev. Nephrol. 2022 18 12 794 805 10.1038/s41581-022-00630-8 36168055 Sprangers, B., Leaf, D. E., Porta, C., Soler, M. J. & Perazella, M. A. Diagnosis and management of immune checkpoint inhibitor-associated acute kidney injury. Nat. Rev. Nephrol. 18 36168055 10.1038/s41581-022-00630-8 7. Zhou P Immune checkpoint inhibitors and acute kidney injury Front. Immunol. 2024 15 1353339 10.3389/fimmu.2024.1353339 38464524 PMC10920224 Zhou, P. et al. Immune checkpoint inhibitors and acute kidney injury. Front. Immunol. 15 38464524 10.3389/fimmu.2024.1353339 PMC10920224 8. Xie W Incidence, mortality, and risk factors of acute kidney injury after immune checkpoint inhibitors: Systematic review and meta-analysis of real-world evidence Eur. J. Intern. Med. 2023 115 88 95 10.1016/j.ejim.2023.05.034 37263805 Xie, W. et al. Incidence, mortality, and risk factors of acute kidney injury after immune checkpoint inhibitors: Systematic review and meta-analysis of real-world evidence. Eur. J. Intern. Med. 115 37263805 10.1016/j.ejim.2023.05.034 9. Ji MS Incidence, risk factors and prognosis of acute kidney injury in patients treated with immune checkpoint inhibitors: a retrospective study Sci. Rep. 2022 12 1 18752 10.1038/s41598-022-21912-y 36335144 PMC9637155 Ji, M. S. et al. Incidence, risk factors and prognosis of acute kidney injury in patients treated with immune checkpoint inhibitors: a retrospective study. Sci. Rep. 12 36335144 10.1038/s41598-022-21912-y PMC9637155 10. Liu K Acute kidney injury in advanced lung cancer patients treated with PD-1 inhibitors: A single center observational study J. Cancer Res. Clin. Oncol. 2023 149 8 5061 5070 10.1007/s00432-022-04437-9 36326913 PMC11797402 Liu, K. et al. Acute kidney injury in advanced lung cancer patients treated with PD-1 inhibitors: A single center observational study. J. Cancer Res. Clin. Oncol. 149 36326913 10.1007/s00432-022-04437-9 PMC11797402 11. Cortazar FB Clinical features and outcomes of immune checkpoint inhibitor-associated AKI: A multicenter study J. Am. Soc. Nephrol. 2020 31 2 435 446 10.1681/ASN.2019070676 31896554 PMC7003302 Cortazar, F. B. et al. Clinical features and outcomes of immune checkpoint inhibitor-associated AKI: A multicenter study. J. Am. Soc. Nephrol. 31 31896554 10.1681/ASN.2019070676 PMC7003302 12. Schneider BJ Management of immune-Related adverse events in patients treated with immune checkpoint inhibitor therapy: ASCO guideline update J. Clin. Oncol. 2021 39 36 4073 4126 10.1200/JCO.21.01440 34724392 Schneider, B. J. et al. Management of immune-Related adverse events in patients treated with immune checkpoint inhibitor therapy: ASCO guideline update. J. Clin. Oncol. 39 34724392 10.1200/JCO.21.01440 13. Yu X Wu R Ji Y Huang M Feng Z Identifying patients at risk of acute kidney injury among patients receiving immune checkpoint inhibitors: A machine learning approach Diagnostics (Basel) 2022 12 12 3157 10.3390/diagnostics12123157 36553164 PMC9776989 Yu, X., Wu, R., Ji, Y., Huang, M. & Feng, Z. Identifying patients at risk of acute kidney injury among patients receiving immune checkpoint inhibitors: A machine learning approach. Diagnostics (Basel) 12 36553164 10.3390/diagnostics12123157 PMC9776989 14. Park SY Nomogram An analogue tool to deliver digital knowledge J. Thorac. Cardiovasc. Surg. 2018 155 4 1793 10.1016/j.jtcvs.2017.12.107 29370910 Park, S. Y. & Nomogram An analogue tool to deliver digital knowledge. J. Thorac. Cardiovasc. Surg. 155 29370910 10.1016/j.jtcvs.2017.12.107 15. Kellum JA Lameire N KDIGO AKI Guideline Work Group Diagnosis, evaluation, and management of acute kidney injury: A KDIGO summary (Part 1) Crit. Care 2013 17 1 204 10.1186/cc11454 23394211 PMC4057151 Kellum, J. A., Lameire, N. & KDIGO AKI Guideline Work Group. Diagnosis, evaluation, and management of acute kidney injury: A KDIGO summary (Part 1). Crit. Care 17 23394211 10.1186/cc11454 PMC4057151 16. Su J Development and validation of a nomogram for predicting the occurrence of renal dysfunction after treatment of immune checkpoint inhibitor: A retrospective case-control study BMJ Open. 2024 14 5 e082484 10.1136/bmjopen-2023-082484 38760047 PMC11103235 Su, J. et al. Development and validation of a nomogram for predicting the occurrence of renal dysfunction after treatment of immune checkpoint inhibitor: A retrospective case-control study. BMJ Open. 14 38760047 10.1136/bmjopen-2023-082484 PMC11103235 17. Seethapathy H The incidence, causes, and risk factors of acute kidney injury in patients receiving immune checkpoint inhibitors Clin. J. Am. Soc. Nephrol. 2019 14 12 1692 1700 10.2215/CJN.00990119 31672794 PMC6895474 Seethapathy, H. et al. The incidence, causes, and risk factors of acute kidney injury in patients receiving immune checkpoint inhibitors. Clin. J. Am. Soc. Nephrol. 14 31672794 10.2215/CJN.00990119 PMC6895474 18. Seethapathy H Incidence and clinical features of immune-related acute kidney injury in patients receiving programmed cell death Ligand-1 inhibitors Kidney Int. Rep. 2020 5 10 1700 1705 10.1016/j.ekir.2020.07.011 33102962 PMC7569697 Seethapathy, H. et al. Incidence and clinical features of immune-related acute kidney injury in patients receiving programmed cell death Ligand-1 inhibitors. Kidney Int. Rep. 5 33102962 10.1016/j.ekir.2020.07.011 PMC7569697 19. Lin C Development and validation of an early acute kidney injury risk prediction model for patients with sepsis in emergency departments Ren. Fail. 2024 46 2 2419523 10.1080/0886022X.2024.2419523 39477816 PMC11533258 Lin, C. et al. Development and validation of an early acute kidney injury risk prediction model for patients with sepsis in emergency departments. Ren. Fail. 46 39477816 10.1080/0886022X.2024.2419523 PMC11533258 20. Huang J Prediction models for acute kidney injury following liver transplantation: A systematic review and critical appraisal Intensive Crit. Care Nurs. 2024 86 103808 10.1016/j.iccn.2024.103808 39208611 Huang, J. et al. Prediction models for acute kidney injury following liver transplantation: A systematic review and critical appraisal. Intensive Crit. Care Nurs. 86 39208611 10.1016/j.iccn.2024.103808 21. Berezina, T. A., Berezin, O. O., Lichtenauer, M. & Berezin, A. E. Predictors for irreversibility of contrast-induced acute kidney injury in patients with obesity after contrast-enhanced computed tomography coronary angiography. Adv. Ther. 10.1007/s12325-024-03036-z 39527336 22. Zhuo XY Preoperative risk prediction models for acute kidney injury after noncardiac surgery: An independent external validation cohort study Br. J. Anaesth. 2024 133 3 508 518 10.1016/j.bja.2024.02.018 38527923 Zhuo, X. Y. et al. Preoperative risk prediction models for acute kidney injury after noncardiac surgery: an independent external validation cohort study. Br. J. Anaesth. 133 38527923 10.1016/j.bja.2024.02.018 23. Zhu, S. et al. A contemporary simple risk score for prediction of severe acute kidney injury after heart transplantation. ESC Heart Fail. 10.1002/ehf2.15108 PMC11911592 39535931 24. Gupta S Derivation and external validation of a simple risk score for predicting severe acute kidney injury after intravenous cisplatin: Cohort study BMJ 2024 384 e077169 10.1136/bmj-2023-077169 38538012 PMC10964715 Gupta, S. et al. Derivation and external validation of a simple risk score for predicting severe acute kidney injury after intravenous cisplatin: Cohort study. BMJ 384 38538012 10.1136/bmj-2023-077169 PMC10964715 25. Bhatraju PK A prediction model for severe AKI in critically ill adults that incorporates clinical and biomarker data Clin. J. Am. Soc. Nephrol. 2019 14 4 506 514 10.2215/CJN.04100318 30917991 PMC6450340 Bhatraju, P. K. et al. A prediction model for severe AKI in critically ill adults that incorporates clinical and biomarker data. Clin. J. Am. Soc. Nephrol. 14 30917991 10.2215/CJN.04100318 PMC6450340 26. Meraz-Muñoz A Acute kidney injury associated with immune checkpoint inhibitor therapy: incidence, risk factors and outcomes J. Immunother Cancer 2020 8 1 e000467 10.1136/jitc-2019-000467 32601079 PMC7326260 Meraz-Muñoz, A. et al. Acute kidney injury associated with immune checkpoint inhibitor therapy: incidence, risk factors and outcomes. J. Immunother Cancer 8 32601079 10.1136/jitc-2019-000467 PMC7326260 27. Koks MS Immune checkpoint inhibitor-associated acute kidney injury and mortality: An observational study PLoS One 2021 16 6 e0252978 10.1371/journal.pone.0252978 34101756 PMC8186792 Koks, M. S. et al. Immune checkpoint inhibitor-associated acute kidney injury and mortality: An observational study. PLoS One 16 34101756 10.1371/journal.pone.0252978 PMC8186792 28. Liu C Incidence and risk factors of acute kidney injury in cancer patients treated with immune checkpoint inhibitors: A systematic review and meta-analysis Front. Immunol. 2023 14 1173952 10.3389/fimmu.2023.1173952 37313406 PMC10258324 Liu, C. et al. Incidence and risk factors of acute kidney injury in cancer patients treated with immune checkpoint inhibitors: A systematic review and meta-analysis. Front. Immunol. 14 37313406 10.3389/fimmu.2023.1173952 PMC10258324 29. Ruiz-Hurtado G Ruilope LM Microvascular injury and the kidney in hypertension Hipertens Riesgo Vasc 2018 35 1 24 29 10.1016/j.hipert.2017.03.002 28431922 Ruiz-Hurtado, G. & Ruilope, L. M. Microvascular injury and the kidney in hypertension. Hipertens Riesgo Vasc 35 28431922 10.1016/j.hipert.2017.03.002 30. Zhou, L. et al. Loop diuretics are associated with increased risk of Hospital-Acquired acute kidney injury in adult patients: A retrospective study. J. Clin. Med. 11 10.3390/jcm11133665 PMC9267783 35806949 31. Guan C Hospitalized patients received furosemide undergoing acute kidney injury: The risk and prediction tool Eur. J. Med. Res. 2023 28 1 312 10.1186/s40001-023-01306-0 37660080 PMC10474726 Guan, C. et al. Hospitalized patients received furosemide undergoing acute kidney injury: The risk and prediction tool. Eur. J. Med. Res. 28 37660080 10.1186/s40001-023-01306-0 PMC10474726 32. Silbert BI Does furosemide increase oxidative stress in acute kidney injury Antioxid. Redox Signal. 2017 26 5 221 226 10.1089/ars.2016.6845 27530232 Silbert, B. I. et al. Does furosemide increase oxidative stress in acute kidney injury. Antioxid. Redox Signal. 26 27530232 10.1089/ars.2016.6845 33. Dilken O Ince C Kapucu A Heeman PM Ergin B Furosemide exacerbated the impairment of renal function, oxygenation and medullary damage in a rat model of renal ischemia/reperfusion induced AKI Intensive Care Med. Exp. 2023 11 1 25 10.1186/s40635-023-00509-3 37121963 PMC10149155 Dilken, O., Ince, C., Kapucu, A., Heeman, P. M. & Ergin, B. Furosemide exacerbated the impairment of renal function, oxygenation and medullary damage in a rat model of renal ischemia/reperfusion induced AKI. Intensive Care Med. Exp. 11 37121963 10.1186/s40635-023-00509-3 PMC10149155 34. Liu L Predictive value of hypoalbuminemia for contrast-associated acute kidney injury: A systematic review and meta-analysis Angiology 2021 72 7 616 624 10.1177/0003319721989185 33525920 Liu, L. et al. Predictive value of hypoalbuminemia for contrast-associated acute kidney injury: A systematic review and meta-analysis. Angiology 72 33525920 10.1177/0003319721989185 35. Wiedermann CJ Wiedermann W Joannidis M Hypoalbuminemia and acute kidney injury: A meta-analysis of observational clinical studies Intensive Care Med. 2010 36 10 1657 1665 10.1007/s00134-010-1928-z 20517593 PMC7728653 Wiedermann, C. J., Wiedermann, W. & Joannidis, M. Hypoalbuminemia and acute kidney injury: a meta-analysis of observational clinical studies. Intensive Care Med. 36 20517593 10.1007/s00134-010-1928-z PMC7728653 36. Shao M Wang S Parameswaran PK Hypoalbuminemia: A risk factor for acute kidney injury development and progression to chronic kidney disease in critically ill patients Int. Urol. Nephrol. 2017 49 2 295 302 10.1007/s11255-016-1453-2 27817055 Shao, M., Wang, S. & Parameswaran, P. K. Hypoalbuminemia: a risk factor for acute kidney injury development and progression to chronic kidney disease in critically ill patients. Int. Urol. Nephrol. 49 27817055 10.1007/s11255-016-1453-2 ",
  "metadata": {
    "Title of this paper": "Hypoalbuminemia: A risk factor for acute kidney injury development and progression to chronic kidney disease in critically ill patients",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474994/"
  }
}