{
  "title": "Paper_524",
  "abstract": "pmc Front Oncol Front Oncol 1755 frontonco Front. Oncol. Frontiers in Oncology 2234-943X Frontiers Media SA PMC12483896 PMC12483896.1 12483896 12483896 41040526 10.3389/fonc.2025.1589846 1 Oncology Systematic Review Perioperative immune checkpoint inhibitors in elderly patients with resectable NSCLC: a systematic review and meta-analysis Cao Yue  1 Tian Yumeng  2 Li Lin  2  *  1 Department of Pharmacy, Beijing Health Vocational College Beijing China  2 Department of Medical Oncology, Beijing Hospital, National Center of Gerontology, Institute of Geriatric Medicine, Chinese Academy of Medical Sciences Beijing China Edited by: Vera Rebmann Reviewed by: Ran Wang  Maria Anna Siciliano *Correspondence: Lin Li, lilin_51@hotmail.com 17 9 2025 2025 15 480898 1589846 08 3 2025 21 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Cao, Tian and Li. 2025 Cao, Tian and Li https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Perioperative immunotherapy has shown promising results in patients with resectable stage II-III non-small cell lung cancer (NSCLC). However, its benefits for the specific subgroup of elderly patients remain unclear. This study aims to evaluate the efficacy of perioperative immunotherapy in elderly NSCLC patients aged 65 and above, focusing on key metrics such as pathological complete response (pCR), event-free survival (EFS), and overall survival (OS). Methods We conducted a comprehensive meta-analysis of randomized clinical trials that reported subgroup data on elderly patients regarding pCR rates and hazard ratios (HRs) for EFS and OS. Data were retrieved from PubMed, EMBASE, and proceedings of oncology conferences from January 2020 to June 2025.A fixed effects model was used for the meta-analysis. Aggregated pooled HRs for time-to-event outcomes (EFS and OS), odds ratios (OR) and risk ratios (RRs) for dichotomous outcomes (pCR) were calculated specifically for patients aged ≥65 years who received perioperative immunotherapy or placebo. Results A total of 8 randomized controlled trials involving 1561 patients aged ≥65 years with resectable NSCLC were included. A significant benefit was observed in terms of pCR (risk ratio, 5.26; 95% CI, 3.54 – 7.82; I² = 0%) and EFS (HR, 0.64; 95% CI, 0.55 – 0.74; I² = 7%) for patients aged ≥65 years who received perioperative immunotherapy compared with placebo. Conclusion Our systematic review and meta-analysis demonstrated that perioperative immunotherapy was superior to placebo in terms of pathological and event-free survival for patients aged ≥65 years. These findings provide age-specific evidence to inform precision decision-making for treating the elderly patients. Systematic review registration  https://www.crd.york.ac.uk/prospero/ perioperative immunotherapy resectable NSCLC elderly patients meta-analysis pathologic complete response event-free survival (EFS) The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Thoracic Oncology Introduction Lung cancer poses a major public health challenge globally, being the foremost reason for cancer-related deaths, with non-small-cell lung cancer (NSCLC) comprising more than 80% of all lung cancer cases ( 1 2 3 4 For patients diagnosed with stage I to III NSCLC, surgical resection continues to be the primary treatment option, irrespective of age. Despite undergoing surgical resection, patients have a high risk of postoperative recurrence, ranging from 20% to 60% based on the disease stage ( 5 Immune checkpoint inhibitors enhance antitumor immunity by blocking inhibitory signaling through checkpoint receptors on T lymphocytes and their ligands in tumor cells, has revolutionized the treatment of NSCLC. Perioperative immunotherapy has been approved as standard of care for resectable stage II-III NSCLC without driver mutations. However, T lymphocytes functions are subject to age-related alterations ( 6 In this study, we undertook a systematic review and meta-analysis of clinical trials that focused on perioperative immunotherapy in aged ≥ 65 years resectable NSCLC patients. The efficacy and safety outcomes were evaluated across different groups. Methods This systematic review and meta-analysis followed the Preferred Reporting Items for Systematic Reviews and Meta-analyses reporting guideline ( 7 Data sources and search strategy A comprehensive literature search was conducted across databases including PubMed, Embase, and proceedings of oncology conferences from January 1, 2020, to the present (search last updated June 30, 2025). Search parameters encompassed primary terms as PD - 1/PD-L1, neoadjuvant, adjuvant, perioperative, NSCLC. Inclusion criteria Included studies (1) focused on patients with resectable NSCLC; (2) involved PD - 1 or PD-L1 inhibitors in neoadjuvant and/or adjuvant therapy; (3) compared groups receiving immunotherapy with placebo or chemo-immunotherapy with chemotherapy; (4) reported pCR, EFS and/or OS data in ≥65 years subgroup; and (5) were designed to be randomized clinical prospective studies. Data extraction and assessment of study quality Two authors (Yue Cao and Yumeng Tian) independently extracted data and resolved discrepancies by consensus. Collected data pertained to outcomes including pCR, EFS, OS and its subgroup data. Ancillary details were recorded in the predefined information sheet. Methodological integrity was assessed using the Cochrane Risk of Bias Tool ( 8 Main outcomes The co-primary outcomes encompass pCR, which is defined as the absence of residual invasive cancer on hematoxylin and eosin stained slides of the resected lung specimen and lymph nodes after the completion of neoadjuvant therapy, and EFS, which is defined as the duration from randomization to either local progression that impedes planned surgery, the presence of an unresectable tumor, disease progression or recurrence, or death in ≥65 years patients. The secondary outcome was OS in ≥65 years patients. Statistical analysis Depending on the level of detail in the data disclosure for the elderly subgroup, the analysis encompasses three distinct strategies: (1) Neoadjuvant treatment regimen impacts the pathological response rate. Consequently, studies on neoadjuvant therapy were categorized and included in the analysis of pCR; (2) The studies that included neoadjuvant plus adjuvant therapy were considered for the EFS outcomes; (3) Due to the limitations of follow-up duration, the subgroup data regarding overall survival in the elderly population are likely constrained. Consequently, the data from the intention-to-treat (ITT) population were subjected to a meta-analysis, which was then compared with the disclosed data of the ≥65 years subgroup. Initially, we performed direct meta-analysis comparing neoadjuvant chemoimmunotherapy with chemotherapy. The pooled relative risks (RRs) for pCR were derived via the Mantel-Haenszel method, whereas HRs for both EFS and OS were determined through the generic inverse-variance methods model. Intertrial heterogeneity was examined through the Cochran Q P I 2 9 For the subgroup analysis, we extracted relevant data from each study`s subgroups, pooled them through direct meta-analysis. Other statistical analyses were conducted with Review Manager software, version 5.4 (The Cochrane Collaboration). All tests were 2-sided, and a P value < .05 was considered significant unless otherwise indicated. Results Eight randomized trials (3384 patients in total, including 1561 patients aged ≥65 years) were analyzed; the detailed selection flowchart is presented in  Figure 1  Supplementary Table S1  Supplementary Figure S1 Figure 1 PRISMA diagram. Flowchart detailing the identification and screening process for studies via databases and oncology conferences. From databases, 213 records were identified from PubMed and 57 from EMBASE. After removing 41 duplicates, 229 records were screened, with 186 excluded. From conferences, records were identified from ASCO (5), ESMO (5), ESMO-IO (2), WCLC (3), AACR (2), and ELCC (2). In total, 43 reports were assessed; 34 were excluded for various reasons such as not being clinical trials or having unextractable data. Finally, 32 studies were included in the quantitative synthesis. Trial characteristics The characteristics and outcomes of the included trials are presented in  Table 1 Table 1 RCT study characteristics. Treatment pattern Identifier Study name Study phase Study design Neoadjuvant treatment regimen Adjuvant treatment regimen Main inclusion criteria Primary endpoint Patients, No. Median age, yr Maximum Age, yr ≥65 yr, % Neoadjuvant NCT02998528 CheckMate 816 ( 24 27 III Open label, randomized Niovlumab + Platinum-doublet chemotherapy / Stage IB-IIIA pCR, EFS 179 64 82 48% Platinum-doublet chemotherapy / 179 65 84 54% NCT04338620 TD-FOREKNOW ( 28 II Open label, randomized Camrelizumab + Platinum-doublet chemotherapy / Stage IIIA-IIIB pCR 43 61 65 26% Platinum-doublet chemotherapy / 45 61 65 31% Neoadjuvant and adjuvant NCT04025879 CheckMate 77T ( 29 III Double blind, randomized Niovlumab + Platinum-doublet chemotherapy Nivolumab Stage IIA-IIIB EFS 229 66 83 56% Platinum-doublet chemotherapy Placebo 229 66 86 57% NCT03838159 NADIM II ( 30 II Open label, randomized Nivolumab + Platinum-doublet chemotherapy Nivolumab Stage IIIA-IIIB pCR 57 65 70 49% Platinum-doublet chemotherapy / 29 63 66 38% NCT03425643 KEYNOTE-671 ( 31 33 III Double blind, randomized Pembrolizumab + Platinum-doublet chemotherapy Pembrolizumab Stage IIA-IIIB EFS, OS 397 63 81 44% Platinum-doublet chemotherapy Placebo 400 64 81 47% NCT04379635 RATIONALE-315 ( 34 36 III Double blind, randomized Tislelizumab + Platinum-doublet chemotherapy Tislelizumab Stage II-IIIA MPR, EFS 226 62 80 37% Platinum-doublet chemotherapy Placebo 227 63 78 43% NCT04158440 Neotorch 37 38 III Double blind, randomized Toripalimab + Platinum-doublet chemotherapy Toripalimab + Platinum-doublet chemotherapy for 1 cycle, then Toripalimab Stage IIIA-IIIB MPR, EFS 202 62 70 31% Platinum-doublet chemotherapy Platinum-doublet chemotherapy for 1 cycle, then Placebo 202 61 70 32% NCT03800134 AEGEAN ( 39 42 III Double blind, randomized Durvalumab + Platinum-doublet chemotherapy Durvalumab Stage IIA-IIIB pCR, EFS 366 65 88 52% Platinum-doublet chemotherapy Placebo 374 65 85 52% Due to the different American Joint Committee on Cancer staging versions used during the study, Checkmate 816 enrolled patients with resectable NSCLC from stage IB to III according to the 7th edition, while other studies followed the 8th edition and enrolled patients with resectable NSCLC from stage II to III. Although the inclusion criteria of Neotorch included patients with stage II - III, only the data of the stage III cohort has been published so far. In all experimental groups across these trials, 3 to 4 cycles of neoadjuvant PD - 1 or PD-L1 inhibitor plus platinum-based chemotherapy were administered. Predominantly, patients received a year of adjuvant immunotherapy, except in CheckMate 816 and TD-FOREKNOW. With a median follow-up time ranging from 18.3 to 57.6 months, the KEYNOTE - 671 and NADIM II study reported the OS data of the elderly patient subgroup. Comparison of pCR In the neoadjuvant immunotherapy group, the pCR rate across the included trials ranged from 17.2% to 40.7%. Through direct meta-analysis, compared with chemotherapy alone, the addition of neoadjuvant immunotherapy was associated with a higher pCR rate (risk ratio, 5.98; 95% CI, 4.67 – 7.66; I² = 30%) in the intention-to-treat (ITT) population (  Figure 2 Figure 2 Pooled risk ratios of pCR in ITT population (A) (B) (C) (D) Forest plots showing risk ratios for pCR in four different subgroups: (A) ITT population, (B) under sixty-five years, (C) sixty-five years and older, (D) sixty-five years and older treated with anti-PD-1. Each plot includes several studies with blue squares representing study-specific risk ratios and black diamonds indicating overall effect estimates. Horizontal lines show the confidence intervals, and the x-axis indicates the risk ratio range from 0.001 to 1000, favoring either control or ICIs. Statistical details are provided, including total events, heterogeneity, and test for overall effect for each subgroup. Comparison of EFS Fixed-effect meta-analysis estimated pooled EFS hazard ratios for perioperative immunotherapy versus placebo. A significant difference favoring perioperative immunotherapy over placebo was found in terms of EFS in the ITT population (HR, 0.59; 95% CI, 0.53 - 0.65; I² = 11%) (  Figure 3 Figure 3 Pooled hazard ratios of event-free survival in ITT population (A) (B) (C) (D) Forest plots depict hazard ratios for event-free survival (EFS) according to different subgroups. Panel A shows the intention-to-treat population, with a combined hazard ratio favoring immune checkpoint inhibitors (ICIs). Panel B depicts data for individuals under sixty-five years, showing similar results. Panel C presents findings for those aged sixty-five or older, favoring ICIs. Panel D is specific to the ≥65 subgroup treated with anti-PD-1, again favoring treatment. Red squares represent individual studies with lines indicating confidence intervals; diamonds summarize overall effects. All plots consistently show significant benefit of ICIs over control groups. Comparison of OS Among the perioperative immunotherapy studies, seven trails (AEGEAN, CheckMate 77T, CheckMate 816, KEYNOTE - 671, NADIM II, Neotorch, and RATIONALE - 315) reported the overall survival (OS) in the intention-to-treat (ITT) population, with KEYNOTE - 671 and NADIM II providing OS data for the ≥ 65 years subgroup. A significant difference favoring perioperative immunotherapy over placebo was found in terms of OS in the ITT population (HR, 0.75; 95% CI, 0.66 - 0.86; I² = 0%) (  Figure 4 Figure 4 Pooled hazard ratios of overall survival in ITT population (A) (B) (C) Forest plots comparing hazard ratios for different studies on overall survival. A: ITT population shows a pooled hazard ratio of 0.75 favoring ICIs. B: <65 years subgroup shows a pooled hazard ratio of 0.54 favoring ICIs. C: ≥65 years subgroup shows a pooled hazard ratio of 0.99, indicating no significant difference. Squares represent individual studies; diamonds indicate overall effect with 95% confidence intervals. Comparison of Surgical outcomes Perioperative immunotherapy increased the rate of minimally invasive surgery (risk ratio, 1.13; 95% CI, 1.00 – 1.28; I² = 0%) and the proportion of lobectomy (risk ratio, 1.07; 95% CI, 1.01 – 1.14; I² = 58%) in the ITT population (  Figure 5 Figure 5 Pooled risk ratios of surgical outcomes, minimally invasive (A) (B) Forest plots comparing the effectiveness of ICIs versus control for two surgical methods: A) Minimally invasive, and B) Lobectomy. Each section lists studies, event data, risk or odds ratios, and confidence intervals. The plots illustrate favorability towards ICIs or the control, with combined results showing a risk ratio of 1.14 for minimally invasive and an odds ratio of 1.37 for lobectomy. Comparison of treatment related adverse events In the ITT population, the incidence of TRAEs did not differ significantly between perioperative immunochemotherapy and chemotherapy alone (odds ratio 1.21; 95% CI 0.85 – 1.74; I² = 23%). Nevertheless, the addition of immunotherapy conferred a modest yet statistically significant increase in grade ≥3 TRAEs (odds ratio 1.24; 95% CI 1.08 – 1.43; I² = 21%) (  Figure 6 Figure 6 Pooled risk ratios of TRAEs (A) (B) Forest plots showing two analyses related to treatment-related adverse events (TRAEs). In panel A, odds ratios for TRAEs favor immune checkpoint inhibitors (ICIs) over control with a summary effect of 1.21. In panel B, odds ratios for grade 3 or higher TRAEs slightly favor ICIs with a summary effect of 1.24. Each study is listed with its individual odds ratio, 95% confidence interval, and relative weight. Heterogeneity and statistical significance values are provided for overall effects. Discussion To our knowledge, our meta-analysis is the first to show that adding perioperative PD - 1 or PD-L1 antibodies improves pCR and EFS in elderly patients with stage II-III resectable NSCLC. Moreover, the trend of benefit for elderly patients aligns with that of the ITT population and the <65 years subgroup, and increasing age does not diminish this advantage. Nevertheless, although an overall survival advantage was evident in the ITT population, this benefit was not replicated in the elderly subgroup. Research by the British Thoracic Association indicates that advanced age is not a contraindication for surgery ( 10 11 12 13 As elderly patients often exhibit diminished tolerance to conventional anticancer therapies, immune checkpoint inhibitors—characterized by a more favorable toxicity profile—offer renewed therapeutic option for this vulnerable population. In resectable NSCLC, CheckMate 159 ( 14 15 Regarding treatment modalities, both neoadjuvant-only and perioperative immunotherapy have yielded positive results, but it remains to be determined which approach is superior. The individual patient level data analysis of CheckMate 77T and CheckMate 816 shows that perioperative nivolumab demonstrated an improvement in EFS compared to neoadjuvant nivolumab alone in patients with resectable NSCLC ( 16  Supplementary Figure S2 15 We also observe that anti-PD-1 demonstrates improved pCR rate compared with anti-PD-L1. In terms of molecular mechanisms, PD - 1 antibodies bind to PD - 1 and simultaneously block the binding of PD - 1 to its ligands (PD-L1 and PD-L2). However, while PD-L1 antibodies inhibit the binding of PD - 1 to PD-L1, the interaction between PD - 1 and PD-L2 remains intact, potentially inhibiting T cell activation. Thus, tumors may escape antitumor immune responses through the PD - 1/PD-L2 axis when treated with anti-PD-L1. In the ITT population, the incidence of TRAEs was comparable between perioperative chemo-immunotherapy and chemotherapy alone; however, grade ≥3 TRAEs were more frequent with chemo-immunotherapy. Since the randomized controlled trial did not conduct an age-based subgroup analysis for adverse events, it was not possible to perform a meta-analysis. However, we have identified some data from real-world studies. Liu et al. retrospective compared the efficacy and safety of neoadjuvant immunochemotherapy in young and elderly patients with IIA-IIIB NSCLC in real world practice and found that the incidence of AEs was similar in young and elderly patients ( 17 18 19 21 Notably, immunotherapy yielded a favorable EFS yet unfavorable OS in elderly patients; several factors may explain this paradox. Firstly, elderly patients were not a predefined subgroup, which may lead to baseline imbalance. Secondly, death events in elderly patients are caused by multiple factors, with a higher incidence of non-tumor-related mortality. Using nationwide Japanese registry data, Yasufumi et al. found that non-cancer mortality rose to 31.6% by 4 years since diagnosis, driven mainly by heart (21.8%) and cerebrovascular disease (9.8%); both are markedly more common in the elderly cancer patients ( 22 23 Limitations This study had several limitations that make any recommendations preliminary. First, given the inclusion and exclusion criteria of the randomized controlled trial, the study involved elderly patients who were fit for surgical resection and chemoimmunotherapy, typically those with better physical fitness. As a result, the study’s findings are mainly applicable to this specific group of patients. Second, the follow-up duration in our study was relatively short, and only two studies reported the overall survival data for elderly patients aged 65 and above, so we could not clearly determine the long-term efficacy in elderly NSCLC patients. Third, the safety meta-analysis investigating the incidence of adverse events in elderly patients aged 65 and above was not conducted, due to insufficient original literature data. Conclusions In summary, this meta-analysis concluded that perioperative immunotherapy was superior to placebo in terms of pathological and efficacy outcomes for patients aged ≥65 years. Elderly patients derived benefits in terms of pathological complete response and event-free survival with perioperative immunotherapy. The study has spotted positive signs of perioperative immunotherapy for elderly patients with resectable stage II-III NSCLC. However, further prospective studies are needed to address this clinical question. Author contributions YC: Writing – original draft, Writing – review & editing. YT: Conceptualization, Formal analysis, Writing – review & editing. LL: Writing – original draft, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fonc.2025.1589846/full#supplementary-material References 1 Siegel RL Kratzer TB Giaquinto AN Sung H Jemal A Cancer statistics, 2025 CA Cancer J Clin 2025 75 10 45 10.3322/caac.21871 39817679 PMC11745215 2 Shi JF Wang L Wu N Li JL Hui ZG Liu SM Clinical characteristics and medical service utilization of lung cancer in China, 2005-2014: Overall design and results from a multicenter retrospective epidemiologic survey Lung Canc 2019 128 91 100 10.1016/j.lungcan.2018.11.031 30642458 3 Dotan E Walter LC Browner IS Clifton K Cohen HJ Extermann M NCCN guidelines(R) insights: older adult oncology, version 1.2021 J Natl Compr Canc Netw 2021 19 1006–19 10.6004/jnccn.2021.0043 34551388 4 Shenoy P Harugeri A Elderly patients’ participation in clinical trials Perspect Clin Res 2015 6 184–89 10.4103/2229-3485.167099 26623388 PMC4640010 5 Akamine T Takenaka T Yano T Okamoto T Yamazaki K Hamatake M Impact of timing and initial recurrence site on post-recurrence survival in resected non-small cell lung cancer Eur J Surg Oncol 2024 50 108374 10.1016/j.ejso.2024.108374 39178719 6 Xu Y Wang Z Li S Su J Gao L Ou J An in-depth understanding of the role and mechanisms of T cells in immune organ aging and age-related diseases Sci China Life Sci 2025 68 328–53 10.1007/s11427-024-2695-x 39231902 7 Moher D Liberati A Tetzlaff J Altman DG Group P Preferred reporting items for systematic reviews and meta-analyses: the PRISMA statement BMJ 2009 339 b2535 10.1136/bmj.b2535 19622551 PMC2714657 8 Higgins JP Altman DG Gotzsche PC Juni P Moher D Oxman AD The Cochrane Collaboration’s tool for assessing risk of bias in randomzsed trials BMJ 2011 343 d5928 10.1136/bmj.d5928 22008217 PMC3196245 9 Cumpston M Li T Page MJ Chandler J Welch VA Higgins JP Updated guidance for trusted systematic reviews: a new edition of the Cochrane Handbook for Systematic Reviews of Interventions Cochrane Database Syst Rev 2019 10 ED000142 10.1002/14651858.ED000142 31643080 PMC10284251 10 British Thoracic S Society of Cardiothoracic Surgeons of Great B, Ireland Working P BTS guidelines: guidelines on the selection of patients with lung cancer for surgery Thorax 2001 56 89 108 10.1136/thorax.56.2.89 11209097 PMC1745996 11 Guo Q Hu S Ye J Su L Wang S Zhang D Surgery offers survival advantage over radiotherapy in patients who are 80 years and older with Stage I and II NSCLC: A retrospective cohort study of 7,045 patients Front Surg 2022 9 1018320 10.3389/fsurg.2022.1018320 36268213 PMC9577077 12 Mao Y Gao Z Yin Y Complete video-assisted thoracoscopic surgery and traditional open surgery for elderly patients with NSCLC Front Surg 2022 9 863273 10.3389/fsurg.2022.863273 35372482 PMC8971185 13 Zhang X Lin G Li J Comparative effectiveness of lobectomy, segmentectomy, and wedge resection for pathological stage I non-small cell lung cancer in elderly patients: A population-based study Front Surg 2021 8 652770 10.3389/fsurg.2021.652770 33937317 PMC8082105 14 Forde PM Chaft JE Smith KN Anagnostou V Cottrell TR Hellmann MD Neoadjuvant PD-1 blockade in resectable lung cancer N Engl J Med 2018 378 1976–86 10.1056/NEJMoa1716078 29658848 PMC6223617 15 Forde PM Spicer JD Provencio M Mitsudomi T Awad MM Wang C Overall survival with neoadjuvant nivolumab plus chemotherapy in lung cancer N Engl J Med 2025 393 8 741–752 10.1056/NEJMoa2502931 40454642 16 Forde PM Peters S Donington J Meadows-Shropshire S Tran P Lucherini S PL02.08 Perioperative vs Neoadjuvant Nivolumab for Resectable NSCLC: Patient-Level Data Analysis of CheckMate 77T vs CheckMate 816 J Thorac Oncol 2024 19 S2 10.1016/j.jtho.2024.09.014 17 Liu J Huang X Yang Y Lv W Wang Y Xia P Comparison of efficacy and safety of neoadjuvant immunochemotherapy in young and elderly patients with IIA-IIIB non-small-cell lung cancer in real-world practice BMC Pulm Med 2024 24 592 10.1186/s12890-024-03417-8 39614293 PMC11606034 18 Muhammad A Ahmed A-A Mostafa A Muhammad Junaid T Safety of Immune checkpoint inhibitors in elderly patients over 75 years J Immunother Canc 1235 2023) 11 10.1136/jitc-2023-SITC2023.1235 19 Muchnik E Loh KP Strawderman M Magnuson A Mohile SG Estrah V Immune checkpoint inhibitors in real-world treatment of older adults with non-small cell lung cancer J Am Geriatr Soc 2019 67 905–12 10.1111/jgs.15750 30698276 PMC7814272 20 Tsukita Y Tozuka T Kushiro K Hosokawa S Sumi T Uematsu M Immunotherapy or chemoimmunotherapy in older adults with advanced non-small cell lung cancer JAMA Oncol 2024 10 439–47 10.1001/jamaoncol.2023.6277 38451530 PMC10921348 21 Gao J Zhang P Tang M Nie X Yuan Y Yang F Predictors of immune checkpoint inhibitor-related adverse events in older patients with lung cancer: a prospective real-world analysis J Cancer Res Clin Oncol 2023 149 8993 9006 10.1007/s00432-023-04792-1 37160811 PMC11798061 22 Gon Y Zha L Morishima T Kimura Y Asai K Kudo H Non-cancer-related deaths in cancer survivors: A nationwide population-based study in Japan J Epidemiol 2025 35 147–53 10.2188/jea.JE20240230 39183032 PMC11821378 23 Lian J Yue Y Yu W Zhang Y Immunosenescence: a key player in cancer development J Hematol Oncol 2020 13 151 10.1186/s13045-020-00986-z 33168037 PMC7653700 24 Forde PM Spicer J Lu S Provencio M Mitsudomi T Awad MM Neoadjuvant nivolumab plus chemotherapy in resectable lung cancer N Engl J Med 2022 386 1973–85 10.1056/NEJMoa2202170 35403841 PMC9844511 25 Girard N Spicer J Provencio M Lu S Broderick S Awad MM Abstract CT012: Nivolumab (NIVO) + platinum-doublet chemotherapy (chemo) vs chemo as neoadjuvant treatment for resectable (IB-IIIA) non-small cell lung cancer (NSCLC): Event-free survival (EFS) results from the phase 3 CheckMate 816 trial Cancer Res 2022 82 CT012–CT12 10.1158/1538-7445.Am2022-ct012 26 Forde PM Spicer J Girard N Provencio M Lu S Wang C 84O Neoadjuvant nivolumab (N) + platinum-doublet chemotherapy (C) for resectable NSCLC: 3-y update from CheckMate 816 J Thorac Oncol 2023 18 S89–90 10.1016/s1556-0864(23)00338-6 27 Spicer J Girard N Provencio M Wang C Mitsudomi T Awad MM Neoadjuvant nivolumab (NIVO) + chemotherapy (chemo) vs chemo in patients (pts) with resectable NSCLC: 4-year update from CheckMate 816 J Clin Oncol 2024 42 LBA8010–LBA10 10.1200/JCO.2024.42.17_suppl.LBA8010 28 Lei J Zhao J Gong L Ni Y Zhou Y Tian F Neoadjuvant camrelizumab plus platinum-based chemotherapy vs chemotherapy alone for chinese patients with resectable stage IIIA or IIIB (T3N2) non-small cell lung cancer: the TD-FOREKNOW randomized clinical trial JAMA Oncol 2023 9 1348–55 10.1001/jamaoncol.2023.2751 37535377 PMC10401395 29 Cascone T Awad MM Spicer JD He J Lu S Sepesi B Perioperative nivolumab in resectable lung cancer N Engl J Med 2024 390 1756–69 10.1056/NEJMoa2311926 38749033 30 Provencio M Nadal E Gonzalez-Larriba JL Martinez-Marti A Bernabe R Bosch-Barrera J Perioperative nivolumab and chemotherapy in stage III non-small-cell lung cancer N Engl J Med 2023 389 504–13 10.1056/NEJMoa2215530 37379158 31 Wakelee H Liberman M Kato T Tsuboi M Lee SH Gao S Perioperative pembrolizumab for early-stage non-small-cell lung cancer N Engl J Med 2023 389 491 503 10.1056/NEJMoa2302983 37272513 PMC11074923 32 Spicer JD Gao S Liberman M Kato T Tsuboi M Lee SH LBA56 Overall survival in the KEYNOTE-671 study of perioperative pembrolizumab for early-stage non-small-cell lung cancer (NSCLC) Ann Oncol 2023 34 S1297–S98 10.1016/j.annonc.2023.10.052 33 Majem M Garassino MC Zhao G Mennecier B Grohe C Ikeda N LBA3 Perioperative pembrolizumab (pembro) plus neoadjuvant chemotherapy (chemo) in early-stage non-small-cell lung cancer (NSCLC): A 4-year update of KEYNOTE-671 Immuno-Oncol Technol 2024 24 10.1016/j.iotech.2024.101027 34 Yue D Wang W Liu H Chen Q Chen C Liu L Perioperative tislelizumab plus neoadjuvant chemotherapy for patients with resectable non-small-cell lung cancer (RATIONALE-315): an interim analysis of a randomized clinical trial Lancet Respir Med 2025 13 119–29 10.1016/S2213-2600(24)00269-8 39581197 35 Yue D Tan L Xu S Mao N Hu J Zhang L 108O Surgical outcomes from RATIONALE-315: Randomized, double-blind, phase III study of perioperative tislelizumab with neoadjuvant chemotherapy in resectable NSCLC ESMO Open 2024 9 10.1016/j.esmoop.2024.102687 36 Yue D Wang W Liu H Chen Q Chen C Liu L VP1-2024: RATIONALE-315: Event-free survival (EFS) and overall survival (OS) of neoadjuvant tislelizumab (TIS) plus chemotherapy (CT) with adjuvant TIS in resectable non-small cell lung cancer (NSCLC) Ann Oncol 2024 35 332–33 10.1016/j.annonc.2024.01.005 37 Lu S Zhang W Wu L Wang W Zhang P Neotorch I Perioperative toripalimab plus chemotherapy for patients with resectable non-small cell lung cancer: the neotorch randomized clinical trial JAMA 2024 331 201–11 10.1001/jama.2023.24735 38227033 PMC10792477 38 Lu S Wu L Zhang W Zhang P Wang W Fang W Perioperative toripalimab + platinum-doublet chemotherapy vs chemotherapy in resectable stage II/III non-small cell lung cancer (NSCLC): Interim event-free survival (EFS) analysis of the phase III Neotorch study J Clin Oncol 2023 41 425126–26 10.1200/JCO.2023.41.36_suppl.425126 39 Heymach JV Harpole D Mitsudomi T Taube JM Galffy G Hochmair M Abstract CT005: AEGEAN: A phase 3 trial of neoadjuvant durvalumab + chemotherapy followed by adjuvant durvalumab in patients with resectable NSCLC Cancer Res 2023 83 CT005–CT05 10.1158/1538-7445.Am2023-ct005 40 Heymach JV Harpole D Mitsudomi T Taube JM Galffy G Hochmair M Perioperative durvalumab for resectable non-small-cell lung cancer N Engl J Med 2023 389 1672–84 10.1056/NEJMoa2304875 37870974 41 Heymach JV Harpole D Mitsudomi T Taube JM Gao S Urban L OA13.03 perioperative durvalumab for resectable NSCLC (R-NSCLC): updated outcomes from the phase 3 AEGEAN trial J Thorac Oncol 2024 19 S38–9 10.1016/j.jtho.2024.09.069 42 Mitsudomi T Heymach JV Reck M Taube JM Gao S Horio Y OA12.05 surgical outcomes with neoadjuvant durvalumab + Chemotherapy followed by adjuvant durvalumab in resectable NSCLC (AEGEAN) J Thorac Oncol 2023 18 S71–2 10.1016/j.jtho.2023.09.070 40545237 ",
  "metadata": {
    "Title of this paper": "OA12.05 surgical outcomes with neoadjuvant durvalumab + Chemotherapy followed by adjuvant durvalumab in resectable NSCLC (AEGEAN)",
    "Journal it was published in:": "Frontiers in Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483896/"
  }
}