{
  "title": "Paper_35",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490255 PMC12490255.1 12490255 12490255 40925374 10.1016/j.xcrm.2025.102322 S2666-3791(25)00395-7 102322 1 Article Modulation of fibronectin extracellular matrix enhances anti-tumor efficacy of immune checkpoint blockade Khan Kabir A. kabirkhanphd@gmail.com 1 2 5 ∗∗∗ Caunt Mitzner Maresa 3 5 Cruz-Munoz William 1 2 Li Grant 3 Himmels Patricia 3 Xu Ping 1 2 Kuo Hung Yang 1 2 Jesudason Raj 3 Gogineni Alvin 3 Weimer Robby 3 Chow Annabelle 1 2 Piskol Robert 4 Michael Iacovos P. 1 2 Ye Weilan ye.weilan@gene.com 3 6 ∗ Kerbel Robert S. robert.kerbel@sri.utoronto.ca 1 2 ∗∗ 1 2 3 4 ∗ ye.weilan@gene.com ∗∗ robert.kerbel@sri.utoronto.ca ∗∗∗ kabirkhanphd@gmail.com 5 These authors contributed equally 6 Lead contact 16 9 2025 08 9 2025 6 9 498186 102322 5 9 2024 5 5 2025 4 8 2025 08 09 2025 03 10 2025 03 10 2025 © 2025 Genentech, Inc. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary The success of immune checkpoint inhibitors is limited by multiple factors, including poor T cell infiltration and function within tumors, partly due to a dense extracellular matrix (ECM). Here, we investigate modulating the ECM by targeting integrin α5β1, a major fibronectin-binding and organizing integrin, to improve immunotherapy outcomes. Use of a function-blocking murinized α5β1 antibody reduces fibronectin fibril formation, enhances CD8 + Graphical abstract Highlights • Blocking mature fibronectin increases CD8 + • α5β1 antibody plus PD-L1 blockade improves efficacy in preclinical breast cancer • α5β1 and PD-L1 blockade reduces terminally exhausted CD8 + • High ITGA5 expression associates with poorer survival in several immunotherapy clinical trials Khan et al. demonstrate that mature fibronectin extracellular matrix (ECM) disruption, via α5β1 integrin targeting, can enhance immune checkpoint therapy preclinically. They also show that ECM modulation can enhance CD8 + Keywords tumor immunotherapy extracellular matrix cancer fibronectin integrin a5b1 combination atezolizumab pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: September 8, 2025 Introduction A major benefit of immune checkpoint blockade in oncology includes the remarkable durable and major tumor remissions induced in some patients in a wide spectrum of different tumor types. 1 + 2 , 3 , 4 , 5 6 7 8 6 TNBC tumors can be separated into four main subtypes when describing the tumor immune microenvironment (TIME): (1) fully inflamed (often responding well to PD-1/PD-L1 immune checkpoint blockade), (2) stroma-restricted, (3) margin-restricted, and (4) “immune deserts/cold tumors,” in which tumors are largely devoid of lymphocytes. 6 9 10 The hypothesis of physical resistance to T cell infiltration and migration, related to the heterogeneity and aberrant organization of the extracellular matrix (ECM), has led to emerging therapeutic strategies of modulating the ECM to enhance tumor immunotherapy outcomes. 11 , 12 13 , 14 15 16 17 18 19 20 , 21 22 Here, we show that antibody targeting of the intact α5β1 heterodimer can lead to disruptions in mature fibronectin fibril formation and the assembly of other ECM components such as collagen I. This ECM disruption correlates with increased transendothelial migration of activated CD8 + Results Blockade of α5β1 leads to disruption of fibronectin fibril formation and increases transendothelial migration of immune cells in vitro To investigate the expression of multiple integrins across different cell types, we used single-cell RNA sequencing analysis using a breast cancer dataset in which patients were treated with one dose of PD-1 antibody therapy. 23 Figure S1 Figure S1 24 in vitro Figures 1 S2 Figure 1 Figure 1 Figure 1 Figure 1 + 25 , 26 Figures 1 Figure 1 Fibronectin/ECM disruption using α5β1 antibodies increases CD8 + (A) Western blot of DOC-soluble or insoluble fractions of HUVEC lysates blotted for fibronectin (anti-FN), treated with isotype control or α5β1 antibodies. (B) Immunofluorescence microscopy of HUVECs cultured on fibronectin-coated plates treated with isotype control or α5β1 antibodies and stained with fibronectin antibodies, with cells intact or cells removed (decellularized), revealing disruptions in mature fibronectin matrix formation after 20 h of α5β1 antibody treatment. Scale bars represent 50 μm. (C) HUVEC permeability increased with addition of α5β1 antibodies, TNF-α (100 ng/mL) as positive control, unpaired t test of α5β1 10 μg/mL conditions in comparison to control treatment. ∗∗∗ p n (D) Schematic diagram of endothelial-immune cell adhesion and transmigration assays (made using BioRender). (E) CD8 + p p n (F) CD8 + p n Blocking α5β1 increases vessel permeability and disrupts fibronectin fibril formation in vivo With the goal of modulating the fibronectin ECM in preclinical mouse models, we utilized a monoclonal antibody (hamster clone 10E7) that recognizes the intact mouse integrin α5β1 heterodimer. 24 Figures 2 Figures 2 Figures 2 S2 27 , 28 , 29 Figures 2 Figure 2 α5β1 antibody targeting reduces fibronectin and collagen deposition and increases intratumoral vascular permeability in mice (A) Immunofluorescence microscopy of mouse lung endothelial cells stained with fibronectin antibodies after treatment in vitro (B) Quantification of percentage fibronectin per region of interest (ROI), n p (C) α5β1 antibody increased vascular permeability in mice bearing 66cl4 breast tumors, visualized by injection of near-infrared AngioSense dye after 24 h. Scale bars, 5 mm. (D) Quantification of fluorescence intensity after 24-h time period, n p (E) Representative western blot of tumor lysates from mice treated with IgG isotype antibody or α5β1 antibody bearing 66cl4 breast tumors; fibronectin was detected in deoxycholate (DOC)-soluble and insoluble fractions, normalized to β-actin and a ratio determined. (F) Statistical analysis of fibronectin insoluble/soluble ratios, n p n (G) Immunofluorescence microscopy of breast tumors demonstrates reductions in vessel (endomucin + (H) Quantification of vessel-associated collagen I H-score, unpaired t test, n p Combination of α5β1 and PD-L1 antibody blockade leads to increased survival in preclinical breast cancer model Analyses from The Cancer Genome Atlas Figure S3 30 , 31 , 32 Figure 3 Figures 3 Figures 3 STAR Methods Figure S4 Figure S4 Figure 3 Combination of α5β1 and PD-L1 antibody treatment in the primary E0771 orthotopic breast cancer model extends median survival (A) Waterfall plots demonstrating percentage tumor growth from time of treatment initiation. CRs were observed in 0/18 mice for isotype control antibody (black), 3/20 mice for α5β1 antibody (blue), 1/20 mice for PD-L1 antibody (green), and 8/21 mice for PD-L1 + α5β1 antibody (red). (B) Survival analyses were generated from mice that reached primary tumor endpoint from (A). The same isotype control antibody group is included in each for comparison. (C) Table displaying hazard ratios (Cox proportional hazards model) and p α5β1 antibody blockade affects CD8 + To gain an understanding of the TIME within mouse E0771 breast tumors under each treatment group, we performed a shorter treatment and characterized the tumor microenvironment ( Figure 4 + Figure 4 + + + Figures 4 + + + − − − Figure 4 + + 33 , 34 + + p p Figure S5 Figure 4 Analysis of the E0771 primary tumor microenvironment exposed to short-term therapy (A) Individual growth plots showing tumor volumes of E0771 treated with isotype control antibody, α5β1, PD-L1 antibody, or the α5β1 + PD-L1 antibody combination. CRs were observed in 0/8 for IgG isotype, 0/8 for α5β1 antibody, 1/8 for PD-L1 antibody, and 2/12 for PD-L1 + α5β1 antibody. Arrows represent antibody administration. (B) Contour flow cytometry plots of CD8 + + + + (C–E) Flow cytometry analysis of (C) pan-T cells (CD3 + + + n p + + + − − − p Combination of PD-L1 and α5β1 antibody blockade with PTX increases the survival of mice with advanced primary tumors When treating mice bearing E0771 tumors as described in Figure 3 3 Figure 3 3 Figure 5 Figure S6 3 Figures 5 S6 Figure 5 3 Figure S6 Figure S6 3 Figure 5 Figures 5 7 Figure 5 Combination α5β1 and PD-L1 antibody blockade with PTX chemotherapy increases survival in mice bearing E0771 tumors that are less responsive to α5β1 and PD-L1 antibody treatment alone (A) Mice bearing E0771 tumors less than 90 mm 3 (B) E0771 tumors larger than 90 mm 3 (C) Median OS, hazard ratios (cox proportional hazards model), log rank Mantel-Cox test, p (D) Percentage tumor growth inhibition of large (>90 mm 3 (E) Survival plots from (D). (F) Table displaying hazard ratios (Cox proportional hazards model) and p Combination of PD-L1 and α5β1 antibody blockade in additional preclinical models We next expanded the number of breast tumor models treated with the PD-L1 + α5β1 antibody combination strategy. As we had already observed increased tumor vessel permeability and decreased mature fibronectin fibril formation in the 66cl4 breast cancer model in response to α5β1 blockade, we wanted to determine whether combination with PD-L1 antibody would result in improved or synergistic anti-tumor efficacy. Addition of PD-L1 antibody to α5β1 antibody resulted in additive effects, which resulted in significant reductions in tumor growth after 21 days when compared with isotype control antibody treatment ( Figure S7 Figure S7 35 36 , 37 Figure S7 p Figure S7 + + 22 in vitro 37 Figures S7 High ITGA5 gene expression is frequently retrospectively associated with poorer OS in patients treated with atezolizumab (PD-L1 antibody) As we have shown that α5β1 antibody-mediated reduction in mature FN1 levels leads to increased CD8 + Figure 6 Figure 6 Figure 6 Figures 6 S8 Figures 6 S8 p Figures 6 S8 Figures 6 S9 Figure 6 Figures 6 S8 Figures 6 S8 Figures S9 Figures 6 S9 Figures S9 Figures S9 Figure 6 Elevated ITGA5 gene expression is associated with poor OS of patients in groups treated with atezolizumab in multiple phase 2 and phase 3 clinical trials (A–C) Data from patient tumors were pooled from all trials and separated into above median or below median expression of ITGA5 for patients in groups treated with (A) atezolizumab monotherapy, (B) atezolizumab combination (anti-angiogenic agent or chemotherapy), and (C) no atezolizumab treatment (control chemotherapy, control anti-angiogenic, or observation), which revealed significantly worse median OS in patients with high ITGA5 expression in the context of atezolizumab monotherapy or atezolizumab combination therapy. (D) Swimmer plots depicting hazard ratios using univariate Cox proportional hazards model and p Discussion The tumor-associated ECM is known to be a contributor to tumor aggressiveness, metastasis, and response to various anti-cancer drugs including immunotherapy. 38 , 39 + Disruption of fibronectin formation in vitro + 40 The murinized antibody targeting intact mouse α5β1 heterodimers (clone 10E7) replicated the reduction in fibronectin fibril formation on endothelial cells as reported with human α5β1-targeting antibodies. This surrogate mouse antibody also led to increased vascular permeability in tumors, in line with previous studies showing increased permeability when ITGA5 is genetically deleted. 41 + 13 42 The therapeutic combination of α5β1 and PD-L1 antibodies led to increased survival and a number of complete tumor regressions in the E0771 breast cancer model; these effects were more pronounced in smaller tumors at treatment initiation (<90 mm 3 43 + + + + 22 + 44 + When combined with PTX, PD-L1 and α5β1 antibodies improved anti-tumor efficacy in the E0771 model, even when treating larger tumors that were less responsive to the antibody combination treatment. The addition of PTX provides potentially translationally relevant information as PD-L1/PD-1 antibodies are administered with PTX for the treatment of patients with TNBC. 7 Further evaluation of our ECM modulation and immunotherapy strategy revealed varied effects, where the combination failed in the EMT6 parental line model but led to additive anti-tumor effects in the 66cl4 and the immunogenic EMT6-CDDP and CT26 MNNG + + 45 46 It is possible that other processes are interrupted by the targeting of α5β1 and the subsequent reduction in fibronectin fibrillogenesis. For example, reductions in fibronectin within the tumor microenvironment could lead to reductions in VEGF bound to fibronectin that has accumulated in the ECM, and VEGF bound to the ECM is known to increase its signaling potential. 47 48 , 49 50 51 Figure S10 A recent study detailing α5β1 targeting by peptides and antibodies against the α5 subunit showed synergistic combination with PD-L1 antibody blockade, and our study contributes more evidence to the potential of this treatment strategy. 22 22 52 , 53 + + 37 High gene expression of ITGA5 in patients treated with atezolizumab (as monotherapy or in combination with chemotherapy or VEGF antibodies) in multiple different cancer types was associated with decreased OS in some clinical trials described. This poses the possibility that in certain tumor subsets, the presence of ITGA5 worsens survival in the context of immune checkpoint blockade treatment and provides a rationale for combination treatment targeting ITGA5 in these patients. As immune checkpoint blockade therapy outcomes are dependent on T cell infiltration and activation, it is possible that high levels of ECM contribute to the dampening of CD8 + The accelerated approval of atezolizumab in combination with nab-PTX has recently been re-evaluated and is no longer FDA approved; additionally, the proportions of patients with TNBC who respond to approved pembrolizumab plus chemotherapy still need to be improved; in the neoadjuvant setting, ∼60% of patients show pathological complete responses with pembrolizumab plus chemotherapy vs. ∼50% treated with chemotherapy alone. 54 Limitations of the study Our study is limited in its clinical utility at this current stage; there remain many open questions such as whether fibronectin and ECM modulation would have effects on CD8 + Resource availability Lead contact Further information and requests for resources and reagents should be directed to and will be fulfilled by the lead contact, Weilan Ye ( ye.weilan@gene.com Materials availability This study did not generate new unique reagents. Data and code availability No custom code was used. Any additional information required to reanalyze the data reported in this work is available from the lead contact Acknowledgments This study was funded by a 10.13039/100001127 Genentech (USA) Author contributions Conceptualization, K.A.K., M.C.M., I.P.M., W.C.-M., W.Y., and R.S.K.; methodology, K.A.K. and M.C.M.; formal analysis, K.A.K., M.C.M., W.C.-M., R.P., R.J., G.L., P.H., and P.X.; investigation, K.A.K., M.C.M., W.C.-M., G.L., P.H., P.X., H.Y.K., A.G., R.W., and A.C.; resources, W.Y.; data curation, K.A.K., R.J., and R.P.; writing – original draft, K.A.K.; writing – review and editing, K.A.K., I.P.M., W.Y., and R.S.K.; visualization, K.A.K. and R.P.; supervision, K.A.K., M.C.M., W.Y., and R.S.K.; funding acquisition, W.Y. and R.S.K. Declaration of interests During the course of these studies, R.S.K. was a scientific advisory board (S.A.B) member of Novelty Nobility (Seoul, Republic of Korea), a consultant for Pharmabcine Inc (Daejeon, Republic of Korea) and a consultant to Eyepoint Pharmaceuticals (USA), and is currently an S.A.B member of OncoHost (Haifa, Israel). W.Y., R.P., R.W., A.G., R.J., and M.C.M. are or were employees of Genentech (a Roche subsidiary), and some hold Roche stocks. W.Y. has issued (US-8962275-B2) and pending patents regarding human integrin α5β1 antibodies. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies Anti-CD3e (for activation) eBiosciences RRID: AB_468854 Anti-Fibronectin Abcam RRID: AB_447655 Fibronectin RabMab antibody KO validated Abcam RRID: AB_2941028 Anti Collagen I Abcam RRID: AB_446161 Human α5β1 (hu18C12) antibody Genentech – Mouse α5β1 (10E7) antibody Genentech – Gp120 (3E5.2H12) antibody Genentech – Mouse PD-L1 (6E11) antibody Genentech – Mouse MOPC-21 antibody BioXcell RRID: AB_1107784 FcR block BD Biosciences RRID: AB_394657 CD45 APC-Cy7 BD Biosciences RRID: AB_396774 CD3 FITC Biolegend RRID: AB_312671 CD4 PerCP Cy5.5 Biolegend RRID: AB_893324 CD8a BV650 Biolegend RRID: AB_2563056 CD366 TIM-3 PE Biolegend RRID: AB_345377 PD-1 PE-Cy7 Biolegend RRID: AB_10696422 Cy3-AffiniPure Donkey Anti-Rabbit IgG (H + L) Jackson ImmunoResearch RRID: AB_2313568 Biological samples Various primary tumors from mice This paper – Chemicals, peptides, and recombinant proteins TNFα R&D systems # 210-TA Human VEGF-A 165 R&D systems # 293-VE Endothelial cell growth supplement (ECGS) Alfa Aesar # AAJ64516MF Human FGF-2 R&D systems #233-FB Human recombinant IL-2 R&D systems # 202-IL-010 Fibronectin Sigma Aldrich #F2006 CXCL12 R&D Systems #350-NS-050 FITC–dextran (40 kDa) Sigma-Aldrich #FD-40 AngioSenseIVM Perkin Elmer #NEV10054EX EndoGRO VEGF media Millipore #SCME002 Cell Tracker Green CMFDA Dye Thermoscientific #C7025 Critical commercial assays CD8 + Miltenyi Biotec 130-096-495 Experimental models: Cell lines E0771 ATCC RRID: CVCL_GR23 EMT6 ATCC RRID:CVCL_1923 HUVEC (EndoGRO TM HUVEC) Millipore SCCE001 mLungEC (mouse lung endothelial cells) Angiocrine Biosciences mVera-Lng-01 66cL4 Dr. F. Miller 55 RRID:CVCL_9721 CT26 MNNG + + Kuczynski et al. 37 – EMT6-CDDP Teicher et al. 35 – Experimental models: Organisms/strains C57Bl/6 mice Jackson Laboratories RRID:IMSR_JAX:000664 BALB/c mice Jackson Laboratories RRID:IMSR_JAX:000651 Software and algorithms R survival R RRID: SCR_021137 R Seurat R RRID: SCR_016341 Qupath 0.4.0 Qupath RRID: SCR_018257 Graphpad Prism 5 Graphpad RRID: SCR_002798 No custom code used Other Bassez et al. breast cancer scRNA-seq data http://biokey.lambrechtslab.org Accession number: EGAD00001006608 IMvigor210 European Genome-Phenome Archive Accession number: EGAS00001002556 IMvigor010 European Genome-Phenome Archive Accession number: EGAS00001004997 IMmotion151 European Genome-Phenome Archive Accession number: EGAC00001001813 OAK European Genome-Phenome Archive Accession number: EGAC00001002120 POPLAR European Genome-Phenome Archive Accession number: EGAC00001002120 IMmotion150 European Genome-Phenome Archive Accession number: EGAC00001001748 Experimental models and study participant details Cell culture Human umbilical vein endothelial cells (HUVECs) were cultured in EndoGro VEGF (Millipore # SCME002). Mouse Lung endothelial cells (mLungECs, mVera-Lng-01, Angiocrine Biosciences), were cultured on 0.1% gelatin coated plates in advanced DMEM/F12 (Sigma Aldrich) with 20% FCS, 1% L-glutamine, 1% penicillin, 1% streptomycin, 10 mM HEPES pH 7.0, 50 μg/mL heparin, MEM non-essential amino acids (Gibco), 50 μg/mL endothelial cell growth supplement (ECGS) (Alfa Aesar, cat no # AAJ64516MF), 20 ng/mL recombinant human FGF-2 (R&D Systems, 233-FB) and 10 ng/mL of recombinant human VEGF-A 165 35 + + 2 Animal experiments All mouse experiments were carried out in accordance with the guiding principles of the American Physiology Society and were approved by the Institutional Animal Care and Use Committee (IACUC) at Genentech, Inc and/or with the approval of the institutional Animal Care Committee of Sunnybrook Research Institute in accordance with the Canadian Council on Animal Care (CCAC) guidelines. All mice used in experiments were between 6 and 12 weeks of age and were housed under standard conditions with 12-h day-night cycles and ad libitum Method details HUVEC permeability assays HUVEC (Millipore Sigma #SCCE001) were seeded at 1 × 10 5 24 Leukocyte adhesion and transmigration assays Fibronectin (10 μg/mL) (Sigma cat no. F2006) in PBS was used to coat wells (40 μL per well) in an Incucyte ClearView 96 well plate, incubated at room temperature for 1 h (Sartorius, Cat no. 4582). HUVECs were seeded at 7500 cells per well in EndoGro Basal media, centrifuged at 25g for 3 min and allowed to culture for 24 h. Human CD8 + + + + + + + In vivo Tumor bearing mice were treated with 10mg/kg of α5β1 10E7 or control antibody (gp120) (n = 9–10 treatment group) and at 0 h and 24 h were injected intravenously with the fluorescent blood pool marker AngioSenseIVM (PerkinElmer, cat no. NEV10054EX). Distribution of AngioSense IVM within tumors was measured by visualizing fluorescence (650 nm excitation and/700nm emission) with a Kodak 4000 FX Pro imaging system (CareStream Health) and quantifying fluorescence intensities within regions of interest placed over tumor or adjoining tissue normalized to time = 0. At each indicated time point, animals were anesthetized under isoflurane, with body temperature maintained at 37°C, and were imaged. Biochemical analysis of DOC soluble and insoluble fibronectin fibrils The fibronectin Deoxycholate (DOC) insoluble/soluble assay was performed as described previously. 56 N N Fibronectin fibril staining in vitro HUVEC or mouse lung endothelial cells (mLungECs) were cultured on acid treated glass coverslips for 2 days and then treated with 10 μg/mL of IgG isotype control (against gp120, Genentech clone 3E5.2H12) or α5β1 10E7 antibody for 20 h. Glass coverslips were washed with PBS twice and incubated with frozen methanol for 5 min. Next coverslips were blocked in Dako blocking solution with 10% donkey serum for 30 min. Then incubated with FN1 antibodies for 1 h at room temperature; after PBST washes, antibodies were detected using donkey anti rabbit Cy3 1:150 dilution (Jackson Immunoresearch cat #711-166-152). Whole coverslips were scanned on a Zeiss AxioObserver with Colibri LED light source and random regions of interest were selected using Qupath 57 In vivo Animal experiments were carried out with the approval of the Institutional Animal Care Committee in accordance with Canadian Council on Animal Care (CCAC) guidelines, or in accordance with the Institutional Animal Care and Use Committee (IACUC) at Genentech, Inc. Female BALB/c or C57Bl/6 mice were purchased from Jackson Laboratories. For orthotopic breast cancer models female mice aged 6–8 weeks were implanted in the inguinal mammary fat pad with 100,000 cells of EMT6/P or EMT6-CDDP (BALB/c mice) or 100,000 E0771 cells (C57Bl/6 mice). For CT26 MNNG + + 3 3 Synergy analyses The Bliss independence model assumes that no drug interactions are occurring therefore an expected outcome of a combination is based upon the addition of its observed effects of monotherapies. 58 combo-expected α5β1 PD-L1 combo-expected combo-observed combo-expected α5β1 PD-L1 α5β1 PD-L1 Flow cytometry Primary tumors were resected from mice and digested in an enzymatic solution containing: 1% BSA, 12,500 units collagenase II ∼2 mg/mL (Worthington), 12,500 units collagenase IV ∼2 mg/mL (Worthington), and DNase I, 10 μg/mL (cat. no. LS006333 Figure S5 Clinical trial related bioinformatics analyses Overall survival was defined from the time of primary tumor diagnosis to death or the last day of follow-up (censor). Patients were stratified based on the median ITGA5 expression into “ITGA5 high” and “ITGA5 low” groups within each trial. p scRNAseq analysis A raw count matrix was obtained from Bassez et al. study as a rds file and metadata from cohort 1 (cohort A). 23 Gomori Trichrome Kidneys and livers were harvested from BALB/c mice bearing EMT6-CDDP tumors treated with IgG isotype or α5β1 antibody at 21 days post implantation. Tissues were fixed in zinc formalin (Sigma #Z2902) overnight (∼16 h). Tissues were paraffin embedded and sectioned at 6 μm. Trichrome staining was performed using Gomori aniline blue one-step (Newcomer Supply #1403C). Sections were deparaffinized and hydrated in distilled water, incubated in preheated Bouin’s solution (Sigma-Aldrich, cat. # HT10132-1L) at 56°C for 1 h. Slides were washed in running tap water until yellow coloration was removed, then rinsed in distilled water. Slides were stained in Weigert Iron Hematoxylin (Sigma-Aldrich, cat. # HT1079-1Set) for 10 min and rinsed in running tap water for 10 min. Then stained in Gomori One-step for 20 min at room temperature. Sections were differentiated in 0.5% acetic acid for 2 min and then dehydrated, cleared in xylene and mounted with Cytoseal 60. Whole slides were scanned using a Tissuescope LE (Huron Digital Pathology). Qupath was used to analyze Gomori stained collagen. 57 Quantification and statistical analysis Statistical tests were carried out using Graphpad Prism or R. Error bars represent standard error mean. Log rank tests were carried out to compare survival curves, unpaired t-tests were used for analysis between individual treatment groups. N numbers displayed in figure legends denote biological replicates unless stated otherwise. Details for statistics can be found in figure legends. References 1 Blasutig I.M. Farkona S. Buchbinder E.I. Luke J.J. Sharma P. Sznol M. The Phoenix Rises: The Rebirth of Cancer Immunotherapy Clin. Chem. 63 2017 1190 1195 28515097 10.1373/clinchem.2016.267849 2 Adams S. Schmid P. Rugo H.S. Winer E.P. Loirat D. Awada A. Cescon D.W. Iwata H. Campone M. Nanda R. Pembrolizumab monotherapy for previously treated metastatic triple-negative breast cancer: cohort A of the phase II KEYNOTE-086 study Ann. Oncol. 30 2019 397 404 30475950 10.1093/annonc/mdy517 3 Emens L.A. Cruz C. Eder J.P. Braiteh F. Chung C. Tolaney S.M. Kuter I. Nanda R. Cassier P.A. Delord J.-P. Long-term Clinical Outcomes and Biomarker Analyses of Atezolizumab Therapy for Patients With Metastatic Triple-Negative Breast Cancer: A Phase 1 Study JAMA Oncol. 5 2019 74 82 30242306 10.1001/jamaoncol.2018.4224 PMC6439773 4 Adams S. Loi S. Toppmeyer D. Cescon D.W. De Laurentiis M. Nanda R. Winer E.P. Mukai H. Tamura K. Armstrong A. Pembrolizumab monotherapy for previously untreated, PD-L1-positive, metastatic triple-negative breast cancer: cohort B of the phase II KEYNOTE-086 study Ann. Oncol. 30 2019 405 411 30475947 10.1093/annonc/mdy518 5 Dirix L.Y. Takacs I. Jerusalem G. Nikolinakos P. Arkenau H.-T. Forero-Torres A. Boccia R. Lippman M.E. Somer R. Smakal M. Avelumab, an anti-PD-L1 antibody, in patients with locally advanced or metastatic breast cancer: a phase 1b JAVELIN Solid Tumor study Breast Cancer Res. Treat. 167 2018 671 686 29063313 10.1007/s10549-017-4537-5 PMC5807460 6 Bianchini G. De Angelis C. Licata L. Gianni L. Treatment landscape of triple-negative breast cancer - expanded options, evolving needs Nat. Rev. Clin. Oncol. 19 2022 91 113 34754128 10.1038/s41571-021-00565-2 7 Cortes J. Cescon D.W. Rugo H.S. Nowecki Z. Im S.-A. Yusof M.M. Gallardo C. Lipatov O. Barrios C.H. Holgado E. Pembrolizumab plus chemotherapy versus placebo plus chemotherapy for previously untreated locally recurrent inoperable or metastatic triple-negative breast cancer (KEYNOTE-355): a randomised, placebo-controlled, double-blind, phase 3 clinical trial Lancet 396 2020 1817 1828 33278935 10.1016/S0140-6736(20)32531-9 8 Schmid P. Adams S. Rugo H.S. Schneeweiss A. Barrios C.H. Iwata H. Diéras V. Hegg R. Im S.-A. Shaw Wright G. Atezolizumab and Nab-Paclitaxel in Advanced Triple-Negative Breast Cancer N. Engl. J. Med. 379 2018 2108 2121 30345906 10.1056/NEJMoa1809615 9 Loi S. Salgado R. Adams S. Pruneri G. Francis P.A. Lacroix-Triki M. Joensuu H. Dieci M.V. Badve S. Demaria S. Tumor infiltrating lymphocyte stratification of prognostic staging of early-stage triple negative breast cancer NPJ Breast Cancer 8 2022 3 35017545 10.1038/s41523-021-00362-1 PMC8752727 10 Zhang J. Endres S. Kobold S. Enhancing tumor T cell infiltration to enable cancer immunotherapy Immunotherapy 11 2019 201 213 30730277 10.2217/imt-2018-0111 11 Peranzoni E. Rivas-Caicedo A. Bougherara H. Salmon H. Donnadieu E. Positive and negative influence of the matrix architecture on antitumor immune surveillance Cell. Mol. Life Sci. 70 2013 4431 4448 23649148 10.1007/s00018-013-1339-8 PMC11113382 12 Huang J. Zhang L. Wan D. Zhou L. Zheng S. Lin S. Qiao Y. Extracellular matrix and its therapeutic potential for cancer treatment Signal Transduct. Target. Ther. 6 2021 153 33888679 10.1038/s41392-021-00544-0 PMC8062524 13 Peng D.H. Rodriguez B.L. Diao L. Chen L. Wang J. Byers L.A. Wei Y. Chapman H.A. Yamauchi M. Behrens C. Collagen promotes anti-PD-1/PD-L1 resistance in cancer through LAIR1-dependent CD8 T cell exhaustion Nat. Commun. 11 2020 4520 32908154 10.1038/s41467-020-18298-8 PMC7481212 14 Nicolas-Boluda A. Vaquero J. Vimeux L. Guilbert T. Barrin S. Kantari-Mimoun C. Ponzo M. Renault G. Deptula P. Pogoda K. Tumor stiffening reversion through collagen crosslinking inhibition improves T cell migration and anti-PD-1 treatment eLife 10 2021 e58688 10.7554/eLife.58688 PMC8203293 34106045 15 Mpekris F. Panagi M. Charalambous A. Voutouri C. Stylianopoulos T. Modulating cancer mechanopathology to restore vascular function and enhance immunotherapy Cell Rep. Med. 5 2024 101626 10.1016/j.xcrm.2024.101626 PMC11293360 38944037 16 Adu-Berchie K. Liu Y. Zhang D.K.Y. Freedman B.R. Brockman J.M. Vining K.H. Nerger B.A. Garmilla A. Mooney D.J. Generation of functionally distinct T-cell populations by altering the viscoelasticity of their extracellular matrix Nat. Biomed. Eng. 7 2023 1374 1391 37365267 10.1038/s41551-023-01052-y PMC10749992 17 Yeow Y.L. Kotamraju V.R. Wang X. Chopra M. Azme N. Wu J. Schoep T.D. Delaney D.S. Feindel K. Li J. Immune-mediated ECM depletion improves tumour perfusion and payload delivery EMBO Mol. Med. 11 2019 e10923 10.15252/emmm.201910923 PMC6895610 31709774 18 Salmon H. Franciszkiewicz K. Damotte D. Dieu-Nosjean M.-C. Validire P. Trautmann A. Mami-Chouaib F. Donnadieu E. Matrix architecture defines the preferential localization and migration of T cells into the stroma of human lung tumors J. Clin. Investig. 122 2012 899 910 22293174 10.1172/JCI45817 PMC3287213 19 Zhang Y. Pei P. Zhou H. Xie Y. Yang S. Shen W. Hu L. Zhang Y. Liu T. Yang K. Nattokinase-Mediated Regulation of Tumor Physical Microenvironment to Enhance Chemotherapy, Radiotherapy, and CAR-T Therapy of Solid Tumor ACS Nano 17 2023 7475 7486 37057972 10.1021/acsnano.2c12463 20 Singh P. Carraher C. Schwarzbauer J.E. Assembly of fibronectin extracellular matrix Annu. Rev. Cell Dev. Biol. 26 2010 397 419 20690820 10.1146/annurev-cellbio-100109-104020 PMC3628685 21 Wolanska K.I. Morgan M.R. Fibronectin remodelling: cell-mediated regulation of the microenvironment Biochem. Soc. Trans. 43 2015 122 128 25619257 10.1042/BST20140313 22 Lu L. Gao Y. Huang D. Liu H. Yin D. Li M. Zheng J. Wang S. Wu W. Zhao L. Targeting integrin α5 in fibroblasts potentiates colorectal cancer response to PD-L1 blockade by affecting extracellular-matrix deposition J. Immunother. Cancer 11 2023 e007447 10.1136/jitc-2023-007447 PMC10693881 38040421 23 Bassez A. Vos H. Van Dyck L. Floris G. Arijs I. Desmedt C. Boeckx B. Vanden Bempt M. Nevelsteen I. Lambein K. A single-cell map of intratumoral changes during anti-PD1 treatment of patients with breast cancer Nat. Med. 27 2021 820 832 33958794 10.1038/s41591-021-01323-8 24 Vitorino P. Yeung S. Crow A. Bakke J. Smyczek T. West K. McNamara E. Eastham-Anderson J. Gould S. Harris S.F. MAP4K4 regulates integrin-FERM binding to control endothelial cell motility Nature 519 2015 425 430 25799996 10.1038/nature14323 25 Okabe S. Fukuda S. Kim Y.-J. Niki M. Pelus L.M. Ohyashiki K. Pandolfi P.P. Broxmeyer H.E. Stromal cell-derived factor-1alpha/CXCL12-induced chemotaxis of T cells involves activation of the RasGAP-associated docking protein p62Dok-1 Blood 105 2005 474 480 15345598 10.1182/blood-2004-03-0843 26 Lim K. Hyun Y.-M. Lambert-Emo K. Capece T. Bae S. Miller R. Topham D.J. Kim M. Neutrophil trails guide influenza-specific CD8 + Science 349 2015 aaa4352 10.1126/science.aaa4352 PMC4809646 26339033 27 McDonald J.A. Kelley D.G. Broekelmann T.J. Role of fibronectin in collagen deposition: Fab’ to the gelatin-binding domain of fibronectin inhibits both fibronectin and collagen organization in fibroblast extracellular matrix J. Cell Biol. 92 1982 485 492 7061591 10.1083/jcb.92.2.485 PMC2112086 28 Engvall E. Ruoslahti E. Binding of soluble form of fibroblast surface protein, fibronectin, to collagen Int. J. Cancer 20 1977 1 5 903179 10.1002/ijc.2910200102 29 Spada S. Tocci A. Di Modugno F. Nisticò P. Fibronectin as a multiregulatory molecule crucial in tumor matrisome: from structural and functional features to clinical practice in oncology J. Exp. Clin. Cancer Res. 40 2021 102 33731188 10.1186/s13046-021-01908-8 PMC7972229 30 Cubas R. Moskalenko M. Cheung J. Yang M. McNamara E. Xiong H. Hoves S. Ries C.H. Kim J. Gould S. Chemotherapy Combines Effectively with Anti-PD-L1 Treatment and Can Augment Antitumor Responses J. Immunol. 201 2018 2273 2286 30209192 10.4049/jimmunol.1800275 31 Monjazeb A.M. Wang Z. Vick L.V. Dunai C. Minnar C. Khuat L.T. Murphy W.J. Mouse Preclinical Cancer Immunotherapy Modeling Involving Anti-PD-1 Therapies Reveals the Need to Use Mouse Reagents to Mirror Clinical Paradigms Cancers (Basel) 13 2021 729 10.3390/cancers13040729 PMC7916633 33578798 32 Mall C. Sckisel G.D. Proia D.A. Mirsoian A. Grossenbacher S.K. Pai C.-C.S. Chen M. Monjazeb A.M. Kelly K. Blazar B.R. Murphy W.J. Repeated PD-1/PD-L1 monoclonal antibody administration induces fatal xenogeneic hypersensitivity reactions in a murine model of breast cancer OncoImmunology 5 2016 e1075114 10.1080/2162402X.2015.1075114 PMC4801432 27057446 33 Zheng H. Liu X. Zhang J. Rice S.J. Wagman M. Kong Y. Zhu L. Zhu J. Joshi M. Belani C.P. Expression of PD-1 on CD4+ T cells in peripheral blood associates with poor clinical outcome in non-small cell lung cancer Oncotarget 7 2016 56233 56240 27191652 10.18632/oncotarget.9316 PMC5302910 34 Wu C. Duan L. Li H. Liu X. Cai T. Yang Y. Yin Y. Chang W. Zhong L. Zhang L. PD1 CD200 CD4 exhausted T cell increase immunotherapy resistance and tumour progression by promoting epithelial-mesenchymal transition in bladder cancer Clin. Transl. Med. 13 2023 e1303 10.1002/ctm2.1303 PMC10265167 37313656 35 Teicher B.A. Herman T.S. Holden S.A. Wang Y.Y. Pfeffer M.R. Crawford J.W. Frei E. 3rd Tumor resistance to alkylating agents conferred by mechanisms operative only in vivo Science 247 1990 1457 1461 2108497 10.1126/science.247.4949.1457 36 Khan K.A. Ponce de Léon J.L. Benguigui M. Xu P. Chow A. Cruz-Muñoz W. Man S. Shaked Y. Kerbel R.S. Immunostimulatory and anti-tumor metronomic cyclophosphamide regimens assessed in primary orthotopic and metastatic murine breast cancer NPJ Breast Cancer 6 2020 29 32704531 10.1038/s41523-020-0171-1 PMC7371860 37 Kuczynski E.A. Krueger J. Chow A. Xu P. Man S. Sundaravadanam Y. Miller J.K. Krzyzanowski P.M. Kerbel R.S. Impact of Chemical-Induced Mutational Load Increase on Immune Checkpoint Therapy in Poorly Responsive Murine Tumors Mol. Cancer Ther. 17 2018 869 882 29483207 10.1158/1535-7163.MCT-17-1091 38 Cox T.R. The matrix in cancer Nat. Rev. Cancer 21 2021 217 238 33589810 10.1038/s41568-020-00329-7 39 Gordon-Weeks A. Yuzhalin A.E. Cancer Extracellular Matrix Proteins Regulate Tumour Immunity Cancers 12 2020 3331 10.3390/cancers12113331 PMC7696558 33187209 40 Pelletier A.J. van der Laan L.J. Hildbrand P. Siani M.A. Thompson D.A. Dawson P.E. Torbett B.E. Salomon D.R. Presentation of chemokine SDF-1 alpha by fibronectin mediates directed migration of T cells Blood 96 2000 2682 2690 11023498 41 Yang J.T. Rayburn H. Hynes R.O. Embryonic mesodermal defects in alpha 5 integrin-deficient mice Development 119 1993 1093 1105 7508365 10.1242/dev.119.4.1093 42 Bunting M.D. Vyas M. Requesens M. Langenbucher A. Schiferle E.B. Manguso R.T. Lawrence M.S. Demehri S. Extracellular matrix proteins regulate NK cell function in peripheral tissues Sci. Adv. 8 2022 eabk3327 10.1126/sciadv.abk3327 PMC8926340 35294229 43 Sun X. Wu B. Chiang H.-C. Deng H. Zhang X. Xiong W. Liu J. Rozeboom A.M. Harris B.T. Blommaert E. Tumour DDR1 promotes collagen fibre alignment to instigate immune exclusion Nature 599 2021 673 678 34732895 10.1038/s41586-021-04057-2 PMC8839149 44 Zhang J. Li J. Hou Y. Lin Y. Zhao H. Shi Y. Chen K. Nian C. Tang J. Pan L. Osr2 functions as a biomechanical checkpoint to aggravate CD8 T cell exhaustion in tumor Cell 187 2024 3409 3426 38744281 10.1016/j.cell.2024.04.023 45 Gandhi L. Rodríguez-Abreu D. Gadgeel S. Esteban E. Felip E. De Angelis F. Domine M. Clingan P. Hochmair M.J. Powell S.F. Pembrolizumab plus Chemotherapy in Metastatic Non-Small-Cell Lung Cancer N. Engl. J. Med. 378 2018 2078 2092 29658856 10.1056/NEJMoa1801005 46 Tsai A.K. Kagalwalla S. Langer J. Le-Kumar T. Le-Kumar V. Antonarakis E.S. Pembrolizumab for metastatic castration-resistant prostate cancer: trials and tribulations Expert Opin. Biol. Ther. 24 2024 51 62 38284349 10.1080/14712598.2024.2311750 47 Wijelath E.S. Rahman S. Namekata M. Murray J. Nishimura T. Mostafavi-Pour Z. Patel Y. Suda Y. Humphries M.J. Sobel M. Heparin-II domain of fibronectin is a vascular endothelial growth factor-binding domain: enhancement of VEGF biological activity by a singular growth factor/matrix protein synergism Circ. Res. 99 2006 853 860 17008606 10.1161/01.RES.0000246849.17887.66 PMC3175430 48 Motz G.T. Coukos G. The parallel lives of angiogenesis and immunosuppression: cancer and other tales Nat. Rev. Immunol. 11 2011 702 711 21941296 10.1038/nri3064 49 Khan K.A. Kerbel R.S. Improving immunotherapy outcomes with anti-angiogenic treatments and vice versa Nat. Rev. Clin. Oncol. 15 2018 310 324 29434333 10.1038/nrclinonc.2018.9 50 Martino M.M. Hubbell J.A. The 12th-14th type III repeats of fibronectin function as a highly promiscuous growth factor-binding domain FASEB J. 24 2010 4711 4721 20671107 10.1096/fj.09-151282 51 Weekes C.D. Rosen L.S. Capasso A. Wong K.M. Ye W. Anderson M. McCall B. Fredrickson J. Wakshull E. Eppler S. Phase I study of the anti-α5β1 monoclonal antibody MINT1526A with or without bevacizumab in patients with advanced solid tumors Cancer Chemother. Pharmacol. 82 2018 339 351 29905898 10.1007/s00280-018-3622-8 52 André T. Shiu K.-K. Kim T.W. Jensen B.V. Jensen L.H. Punt C. Smith D. Garcia-Carbonero R. Benavides M. Gibbs P. Pembrolizumab in Microsatellite-Instability-High Advanced Colorectal Cancer N. Engl. J. Med. 383 2020 2207 2218 33264544 10.1056/NEJMoa2017699 53 Diaz L.A. Jr. Shiu K.-K. Kim T.-W. Jensen B.V. Jensen L.H. Punt C. Smith D. Garcia-Carbonero R. Benavides M. Gibbs P. Pembrolizumab versus chemotherapy for microsatellite instability-high or mismatch repair-deficient metastatic colorectal cancer (KEYNOTE-177): final analysis of a randomised, open-label, phase 3 study Lancet Oncol. 23 2022 659 670 35427471 10.1016/S1470-2045(22)00197-8 PMC9533375 54 Schmid P. Cortes J. Pusztai L. McArthur H. Kümmel S. Bergh J. Denkert C. Park Y.H. Hui R. Harbeck N. Pembrolizumab for Early Triple-Negative Breast Cancer N. Engl. J. Med. 382 2020 810 821 32101663 10.1056/NEJMoa1910549 55 Miller B.E. Roi L.D. Howard L.M. Miller F.R. Quantitative selectivity of contact-mediated intercellular communication in a metastatic mouse mammary tumor line Cancer Res. 43 1983 4102 4107 6871851 56 Wierzbicka-Patynowski I. Mao Y. Schwarzbauer J.E. Analysis of fibronectin matrix assembly Curr. Protoc. Cell Biol. 25 2004 10 12 10.1002/0471143030.cb1012s25 18228438 57 Bankhead P. Loughrey M.B. Fernández J.A. Dombrowski Y. McArt D.G. Dunne P.D. McQuaid S. Gray R.T. Murray L.J. Coleman H.G. QuPath: Open source software for digital pathology image analysis Sci. Rep. 7 2017 16878 10.1038/s41598-017-17204-5 PMC5715110 29203879 58 Goldoni M. Johansson C. A mathematical approach to study combined effects of toxicants in vitro: evaluation of the Bliss independence criterion and the Loewe additivity model Toxicol. Vitro 21 2007 759 769 10.1016/j.tiv.2007.03.003 17420112 Supplemental information  Document S1. Figures S1–S10 Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102322 ",
  "metadata": {
    "Title of this paper": "A mathematical approach to study combined effects of toxicants in vitro: evaluation of the Bliss independence criterion and the Loewe additivity model",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490255/"
  }
}