{
  "title": "Paper_33",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490260 PMC12490260.1 12490260 12490260 40845840 10.1016/j.xcrm.2025.102311 S2666-3791(25)00384-2 102311 1 Article BACH2 promotes seeding and establishment of long-lived HIV-1 reservoir in memory CD4 + Gao Hongbo 1 9 Li Yuhao 1 Tiwari Ritudwhaj 1 Pinzone Marilia 1 Qin Xiwen 1 Clark Kolin M. 1 Nicholson Sara K. 1 Yao Tony 2 Rome Kelly 3 4 Scaglione Michael 3 4 Bailis Will 3 4 Presti Rachel M. 1 Sereti Irini 5 Saligrama Naresha 2 6 Wang Leyao 7 9 Shan Liang shanliang@smart.org.cn 1 6 8 9 ∗ 1 2 3 4 5 6 7 ∗ shanliang@smart.org.cn 8 Lead contact 9 Current address: Institute of Human Immunology, Shenzhen Medical Academy of Research and Translation 16 9 2025 21 8 2025 6 9 498186 102311 27 8 2024 1 7 2025 28 7 2025 21 08 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). BACH2 shapes tissue resident memory T cell programs to promote HIV-1 persistence 16 8 2025 S1074-7613(25)00331-0 Immunity 10.1016/j.immuni.2025.07.022 40845842 Summary Despite antiretroviral therapy, HIV-1 mainly persists in memory CD4 + + + + Graphical abstract Highlights • CCR5 expression requires the fate commitment of T cells to terminal differentiation • BACH2 demarcates effector and memory differentiation of activated CCR5 + + • BACH2-mediated memory differentiation drives seeding of long-lived HIV-1 reservoirs • Seeding of long-lived HIV-1 reservoirs is partially inhibited before antiretroviral therapy Gao et al. dissect the cellular and molecular mechanisms governing the seeding of long-lived HIV-1 reservoirs in memory CD4 + Keywords HIV-1 viral reservoirs CCR5 CD4 + BACH2 terminal differentiation memory differentiation humanized mice ART pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: August 21, 2025 Introduction Although antiretroviral therapy (ART) suppresses viral replication in people living with HIV-1 (PLWH), it cannot cure HIV-1 infection due to the lifelong persistence of integrated, transcriptionally inactive, and replication-competent proviruses primarily in a small pool of resting memory CD4 + 1 , 2 , 3 , 4 , 5 , 6 7 , 8 , 9 10 , 11 , 12 13 , 14 10 , 11 , 14 , 15 , 16 17 , 18 , 19 , 20 , 21 CCR5 and CXCR4 are two co-receptors for HIV-1 entry. 22 , 23 24 , 25 26 , 27 28 , 29 , 30 31 , 32 , 33 , 34 35 , 36 + 37 , 38 , 39 , 40 , 41 , 42 , 43 , 44 , 45 + + 46 , 47 , 48 , 49 50 + + + 51 + + + + Results CCR5 + + We first utilized the available single-cell RNA sequencing (scRNA-seq) datasets 52 + Figures 1 S1 + + Figure 1 + + + + Figures 1 S2 + Figures S2 Figures 1 S2 + + Figure S2 + − Figures 1 + − + + Figures 1 + + Figure 1 CCR5 + + (A) Uniform manifold approximation and projection analysis of scRNA-seq data from lymphoid tissue CD4 + (B) CyTOF analysis of unstimulated blood CD4 + (C) IFN-γ and TNF-α expression by quantitative reverse-transcription PCR (RT-qPCR). CCR5 + − + POLR2A + (D–G) Viability of CCR5 + − + + n n (H–J) Protein synthesis in CCR5 + − + + p p p p p CCR5 expression requires the fate commitment of T cells to terminal differentiation Naive CD4 + in vitro Figure S3 + + + + Figures 2 S3 − Figure 2 Figure 2 + − + Figures 2 S3 BACH2 TCF7 − Figure 2 GSE275936 + Figure 2 TCF7 53 54 , 55 , 56 + Figure 2 57 + Figure 2 + Figures 2 S3 + Figures S3 58 , 59 , 60 + Figure 2 + Figures 2 S3 Figure 2 CCR5 expression requires T cell terminal differentiation post stimulation Peripheral blood CD4 + (A) Phenotypic profiling of activated CD4 + (B) Expression of CD69, HLA-DR, and PD-1 by CCR5 + − + (C and D) Cell proliferation and viability of CCR5 + − + (E) Transcriptome analyses of activated CCR5 + − + + − + − p p (F) TCF1 expression in CCR5 + − + (G and H) TOX BLIMP-1 + − POLR2A + (I and J) Mitochondria membrane potential of activated CCR5 + − + (K and L) JQ1 reduces TOX + + TOX POLR2A + In (B), p p p p p BACH2 demarcates effector and memory differentiation of activated CCR5 + + Since commitment to terminal differentiation is a prerequisite for producing CCR5 + + + + Figure S3 + + + Figures 3 S4 + + Figure 3 + − − − Figures 3 + in vitro Figures 3 S4 + Figure 3 Bifurcated differentiation of CCR5 + (A–C) Differentiation of activated CCR5 + + + + + (D–F) Viability and proliferation of MP and EFF cells upon restimulation. MP and EFF cells were differentiated from activated CCR5 + + (G and H) Activated CCR5 + + In (A) and (G), tSNE plots were generated as described in Figure 2 p p p p p According to the RNA sequencing (RNA-seq) analysis of differentially expressed transcription factors between CCR5 + − BACH2 TCF7 LEF1 − Figure 2 + BACH2 TCF7 TOX BLIMP-1 Figure 4 + + 61 , 62 + 63 , 64 + Figure S5 + BACH2 + Figures S3 S5 + Figures 4 S5 BACH2 + BACH2 Figure 4 Figure 4 + + TCF7 Figure S5 + TCF7 Figures S5 BACH2 + + + + + − TCF + 65 Figure 4 BACH2 controls differentiation and functional preservation of CCR5-derived MP cells (A) BACH2 TCF7 TOX BLIMP-1 + POLR2A + (B and C) Phenotypic profiling of differentiated BACH2 + BACH2 + + Figure 3 Figure 2 + (D) TCF1 expression in BACH2 BACH2 + (E) Viability and proliferation of BACH2 BACH2 (F–H) BACH2 overexpression suppresses the differentiation of CCR5 + + in vitro in vivo + in vitro + + n (I) BACH2 overexpression forces differentiation of activated CCR5 + + in vitro + In (G) and (H), p p p p p Since BACH2 suppressed effector T cell differentiation, it may modulate the differentiation of CCR5 + + + + Figure S5 + + Figure 4 Figures S5 in vivo + + + Figures 4 + + + + + Figure 4 BACH2 + + + Memory differentiation of CCR5 + + Although cellular reservoirs for HIV-1 are seeded throughout the course of untreated infection, a vast majority of them are short lived, whereas the ones seeded near the time of therapy initiation are more likely to persist. In PLWH before ART initiation, most productively infected cells (HIV-1 RNA + + 66 + 39 , 67 68 Figure 5 Figures 5 S6 + Figures 5 Figure S6 + + Figure 5 Figure 5 Figure 5 Memory differentiation of CCR5 + + (A) Sample collection scheme. (B) Plasma IL-18 concentration determined by ELISA. Indicated pre- and post-ART samples from 83 study participants were included. (C and D) IL-18Rα expression in activated CD4 + + (E and F) Activated CCR5 + Figure 3 POLR2A + (G–L) The impact of ART on CD4 recovery (G), TCF1 expression (H–K), and BACH2 transcription (L). The percentage of CD4 + − + + (M and N) The role of BACH2 in HIV-1 transcription in latent reservoir cells. CD4 + BACH2 In (G), (J), (K), and (L), p p p p p p To seek evidence beyond the in vitro Figure 5 BACH2 + + Figures 5 Figure S6 Figure 5 in vitro ex vivo BACH2 + Figure S6 BACH2 + Figure S6 Figure S6 BACH2 + 69 , 70 , 71 Figures 5 + BACH2 is required for HIV-1 persistence in vivo To this end, we used the MISTRG-6-15 humanized mouse model 72 BACH2 + BACH2 73 Figure 6 BACH2 BACH2 Figures S7 in vivo BACH2 + Figure 6 + BACH2 + Figures 6 74 + BACH2 Figure S7 BaL Figure 6 + Figure 6 + Figure 6 Figures 6 Figure 6 Generation of BACH2 (A) Strategy for generating BACH2 (B) Human immune cell reconstitution and T cell development in mice engrafted with BACH2 Cas9 + (C and D) Human T cell and macrophage development in mice engrafted with BACH2 Cas9 + + + − + − − + + + (E and F) HIV-1 infection in mice engrafted with BACH2 Cas9 + + (G–I) Quantification of HIV-1 infection. The frequency of p24 + + − + In (F), p p p p p Next, we generated animal cohorts to interrogate the role of BACH2 in the early HIV-1 reservoir seeding. Mice reconstituted with a control or BACH2 BaL 72 Figure 7 + Figure 7 BACH2 Figure 7 BACH2 Figure 7 BACH2 Figures 7 S7 CM + CM + Figure 7 CM + BACH2 + Figures 4 Figure 7 BACH2 is required for the seeding and establishment of long-lived HIV-1 reservoir in memory CD4 + (A) HIV-1 infection and ART in the control and BACH2 BaL Cas9 n BACH2 n (B–D) Viral rebound. CD8-depleted total splenocytes from ART-treated mice are adoptively transferred into the HIV-1-negative unengrafted MISTRG-6-15 mice. Each recipient mouse receives the whole splenocyte population from one ART mice. Blood samples were collected once per week to monitor virus rebound. Virus rebound is confirmed when plasma viral load is >1,000 copies per mL. Cas9 n BACH2 n (E and F) Frequency of HIV-1 DNA + CM + + − + CM + + − − + Cas9 n BACH2 n Cas9 n BACH2 n In (C), the p p p p p Discussions The enormous diversity and heterogeneity of residual viral reservoirs in PLWH are among the central challenges to finding a cure for HIV-1. They are established prior to ART initiation 75 76 77 , 78 To this end, we aimed to identify the precursors to reservoir cells, which are cells that have been infected by HIV-1 immediately before ART initiation and have the potential to differentiate into long-lived memory cells. These precursors must share common features, such as expressing the viral co-receptor CCR5 and permissiveness to viral reverse transcription and integration. CCR5 expression is enriched within a small fraction of CD4 + 79 + + Figure 2 + + Single-cell multiome analysis provides evidence of epigenetic regulation of HIV-1 reservoirs by BACH2 in blood and tissue CD4 + 39 , 80 + + BACH2 BACH2 81 , 82 , 83 , 84 , 85 BACH2 86 , 87 88 BACH2 + 38 , 45 + + BACH2 + In summary, our study explains why most cells infected by HIV-1 are unable to contribute to viral reservoirs and preventing HIV-1 reservoir cells from transforming into long-lived cells at the time of ART initiation by targeting the BACH2 pathway could have a major impact on the total viral reservoir and viral persistence. Our study elucidates the essential role of BACH2 in memory differentiation of CCR5 + + + + + BACH2 −/− + 74 + + + + + + + + Limitations of the study We have demonstrated both in vitro + + BACH2 Resource availability Lead contact Further information and requests for resources and reagents should be directed to and will be fulfilled by the lead contact, Liang Shan ( shanliang@smart.org.cn Materials availability Requests of plasmids and cell lines generated in this study will be available upon request from the lead contact Data and code availability All data reported in this paper will be shared by the lead contact key resources table sdac.data@sdac.harvard.edu lead contact Acknowledgments We gratefully acknowledge all the members of the ACTG A5142 team and commend all the staff at the ACTG sites for their effort. We particularly thank Ronald J. Bosch and Kevin Wongsodirdjo for their support in this study. We thank the Regeneron Pharmaceuticals and the Richard Flavell Laboratory at Yale University for generating the MISTRG-6-15 human cytokine knockin mice, the Immunomonitoring Laboratory at the Bursky Center for Human Immunology and Immunotherapy at Washington University for the immune profiling experiments, and Dr. Francesco Simonetti (Johns Hopkins University) for critical insight and manuscript review. The following reagents were obtained through the AIDS Research and Reference Reagent Program, Division of AIDS, NIAID, NIH: pNL4-3-ΔEnv-EGFP (ARP-11100), HIV-1 BaL.01 Env Expression Vector (ARP-11445), HIV BaL NIH R01AI162203 R01AI155162 R01AI176594 R21AI181675 F31AI165251 CRISPR UM1AI164568 NIAID NIMH NIDA NINDS NIDDK NHLB NIH/National Center for Advancing Translational Sciences CTSA UL1TR002345 NIAID/NIH UM1AI068634 UM1AI068636 UM1AI106701 ACTG&SDAC NIAID/NIH Author contributions L.S. and H.G. designed the study and analyzed the data. H.G., Y.L., and X.Q. performed the in vitro + Declaration of interests The authors declare no competing interests. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies anti-Puromycin-AF 647 Sigma Cat# MABE343-AF647; RRID: AB_2736876 anti-human CD197 (CCR7)-BV421 BD Biosciences Cat# 562555; RRID: AB_2728119 anti-human CD57-Pacific Blue BioLegend Cat# 359608; RRID: AB_2562459 anti-human CD69-BV605 BioLegend Cat# 310938; RRID: AB_2562307 anti-human CD69-FITC BioLegend Cat# 310904; RRID: AB_314839 anti-human CD45RA-BV650 BioLegend Cat# 304136; RRID: AB_2563653 anti-human/mouse/rat CD278 (ICOS)-BV711 BioLegend Cat# 313548; RRID: AB_2734289 anti-human CD27-BV750 BioLegend Cat# 302849; RRID: AB_2750389 anti-human HLA-DR-BV785 BioLegend Cat# 307642; RRID: AB_2563461 anti-human TIGIT-Vio® Bright B515 Miltenyi Biotec Cat# 130-116-938; RRID: AB_2751351 anti-human CD195 (CCR5)-PE BioLegend Cat# 359106; RRID: AB_2562335 anti-human CD127 PE/Dazzle594 BD Biosciences Cat# 562397; RRID: AB_11154212 anti-human CD223 (LAG3)-PE/Fire640 BioLegend Cat# 369221; RRID: AB_2922583 anti-human CD95 (Fas)-PE-Cy7 BioLegend Cat# 305622; RRID: AB_2100369 anti-human CD45RO-APC BioLegend Cat# 304210; RRID: AB_314426 anti-human CD62L-Spark NIR 685 BioLegend Cat# 304861; RRID: AB_2860808 anti-human CD279 (PD-1)-AF700 BioLegend Cat# 329951; RRID: AB_2566363 anti-human CD279 (PD-1)-PE-Cy7 BioLegend Cat# 329918; RRID: AB_2159324 anti-human CD38-APC/Fire810 BioLegend Cat# 303549; RRID: AB_2860783 anti-human TCF1 BioLegend Cat# 655204; RRID: AB_2566620 anti-human Ki-67 BioLegend Cat# 350514; RRID: AB_10959327 Human TruStain FcX BioLegend Cat# 422302; RRID: AB_2818986 TruStain FcX anti-mouse CD16/32 BioLegend Cat# 101320; RRID: AB_1574975 anti-mouse CD45-FITC BioLegend Cat# 103108; RRID: AB_312973 anti-human CD45-Pacific Blue BioLegend Cat# 304029; RRID: AB_2174123 anti-human CD3-BV785 BioLegend Cat# 317330; RRID: AB_2563507 anti-human CD19-PE-Cy7 BioLegend Cat# 302216; RRID: AB_314246 anti-human CD56-PE BioLegend Cat# 362508; RRID: AB_2563925 anti-human CD14-APC BioLegend Cat# 301808; RRID: AB_314190 anti-human CD4-BUV395 BD Biosciences Cat# 563550; RRID: AB_2738273 anti-human CD8-BUV737 BD Biosciences Cat# 612754; RRID: AB_2870085 anti-human CD195 (CCR5)-BV421 BioLegend Cat# 359118; RRID: AB_2563577 anti-human CD197 (CCR7)-AF647 BioLegend Cat# 353218; RRID: AB_10917385 anti-human CCR7-PE BD Biosciences Cat# 566742; RRID: AB_2864275 anti-human CD27-PE-Cy7 BioLegend Cat# 302838; RRID: AB_2561919 anti-human CD3-BUV737 BioLegend Cat# 612752; RRID: AB_2870083 anti-human CD45-BV785 BioLegend Cat# 304048; RRID: AB_2563129 anti-human Foxp3-BV421 BioLegend Cat# 320124; RRID: AB_2565972 anti-human CD25-APC BioLegend Cat# 302610; RRID: AB_314280 anti-p24-PE Beckman Coulter Cat# KC57-RD1; RRID: AB_1575989 anti-human IFN-γ-FITC BD Biosciences Cat# 554551; RRID: AB_395473 anti-human TNF-α-BV421 BioLegend Cat# 502931; RRID: AB_10898321 anti-human IL-2-AF 647 BioLegend Cat# 500315; RRID: AB_493370 anti-human CD192 (CCR2)-BV785 BioLegend Cat# 357233; RRID: AB_2800971 anti-human CD186 (CXCR6)-BV421 BioLegend Cat# 356013; RRID: AB_2562514 anti-Human CD218a (IL-18Rα) BioLegend Cat# 564675; RRID: AB_2738885 Anti-human CD45-089Y Fluidigm Cat# 3089003B; RRID: AB_2938863 Anti-human CD57-142ND Fluidigm Cat# 3142007B; RRID: AB_2868399 Anti-human CD45RA −143ND Fluidigm Cat# 3143006B; RRID: AB_2651156 Anti-human CD270 (HVEM, TR2)-144ND Fluidigm Cat# 3144022B; RRID: Anti-human CD4-145ND Fluidigm Cat# 3145001B; RRID: AB_2661789 Anti-human CD8a-146ND Fluidigm Cat# 3146001B; RRID: AB_2687641 Anti-human CD278/ICOS-148ND Fluidigm Cat# 3148019B; RRID: AB_2756435 Anti-human CD45RO-149Sm Fluidigm Cat# 3149001B; RRID: AB_2687851 Anti-human CD134 (OX40)-150ND Fluidigm Cat# 3150023B; RRID: AB_2938869 Anti-human CD95/Fas-152Sm Fluidigm Cat# 3152017B; RRID: AB_2920762 Anti-human TIM-3-153Eu Fluidigm Cat# 3153008B; RRID: AB_2938868 Anti-human TIGIT-154Sm Fluidigm Cat# 3154016B; RRID: AB_2888926 Anti-human CD27-155Gd Fluidigm Cat# 3155001B; RRID: AB_2687645 Anti-human CD184 (CXCR4)-156Gd Fluidigm Cat# 3156029B; RRID: Anti-human CD137/4-1BB-158Gd Fluidigm Cat# 3158013B; RRID: AB_2888927 Anti-human CD357 (GITR)-159Tb Fluidigm Cat# 3159020B; RRID: AB_2858232 Anti-human CD28-160Gd Fluidigm Cat# 3160003B; RRID: AB_2868400 Anti-human CD152 (CTLA-4)-161Dy Fluidigm Cat# 3161004B; RRID: AB_2687649 Anti-human CD69-162Dy Fluidigm Cat# 3162001B; RRID: AB_3096016 Anti-human CD272 (BTLA)-163Dy Fluidigm Cat# 3163009B; RRID: AB_2910546 Anti-human CD161-164Dy Fluidigm Cat# 3164009B; RRID: AB_2687651 Anti-human CD40-165Ho Fluidigm Cat# 3165005B; RRID: Anti-human CD197 (CCR7)-167Er Fluidigm Cat# 3167009A; RRID: AB_2858236 Anti-human CD127 (IL-7Ra)-168Er Fluidigm Cat# 3168017B; RRID: AB_2756425 Anti-human CD25 (IL-2R)-169Tm Fluidigm Cat# 3169003B; RRID: AB_2938861 Anti-human CD122-170Er Fluidigm Cat# 3170004B; RRID: Anti-human CD38-172Yb Fluidigm Cat# 3172007B; RRID: AB_2756288 Anti-human HLA-DR-173Yb Fluidigm Cat# 3173005B; RRID: AB_2810248 Anti-human CD279 (PD-1)-174Yb Fluidigm Cat# 3174020B; RRID: AB_2868402 Anti-human CD223/LAG-3-175Lu Fluidigm Cat# 3175033B; RRID: AB_2888932 Mouse monoclonal anti-BACH2 BioLegend Cat# 695602; RRID: AB_2650879 Mouse monoclonal anti-Beta-actin Invitrogen Cat# MA1-140; RRID: AB_2536844 HRP-conjugated goat anti-mouse IgG Cell Signaling Technology Cat# 7076; RRID: AB_330924 Virus strains pNL4-3-ΔEnv-EGFP NIH HIV Reagent Program ARP-11100 HIV-1 BaL.01 Env Expression Vector NIH HIV Reagent Program ARP-11445 HIV BaL NIH HIV Reagent Program ARP-510 psPAX2 Addgene 12260 pLenti-mC-BACH2 this paper N/A pLenti-mC-BΔzip this paper N/A pVSVG Addgene 8454 Chemicals, peptides, and recombinant proteins APC Annexin V BioLegend 640941 7-AAD Viability Staining Solution BioLegend 420404 Zombie NIR™ Fixable Viability Kit BioLegend 423106 Zombie Aqua™ Fixable Viability Kit BioLegend 423102 (+)-JQ1 Selleckchem S7110 AZD5153 6-hydroxy-2-naphthoic acid Selleckchem S8344 Ultra-LEAF™ Purified anti-human CD3 Biolegend 300333 Ultra-LEAF™ Purified anti-human CD28 Biolegend 302943 Recombinant Human IL-2 BioLegend 589106 Recombinant Human IL-7 BioLegend 581904 Recombinant Human IL-12(p70) BioLegend 573004 Recombinant Human IL-15 BioLegend 570306 Recombinant Human IL-18 BioLegend 592106 Recombinant Human TNF-α BioLegend 570104 Recombinant Human SCF STEMCELL Technologies 78062 Recombinant Human FLT3 STEMCELL Technologies 78009 Recombinant Human TPO STEMCELL Technologies 78210 Phytohemagglutinin-L (PHA-L) Sigma 11249738001 Enfuvirtide (T-20) MedChemExpress HY-P0052 Raltegravir (RAL) MedChemExpress HY-10353 Recombinant Cas9 protein IDT 1081059 Random Primers Invitrogen 48190–011 ProtoScript II Reverse Transcriptase NEB M0368 RNase Inhibitor, Murine NEB M0314L Oligo(dT)12–18 Primer Invitrogen 18418012 TaqMan™ Fast Advanced Master Mix for qPCR Applied Biosystems 4444556 Lenti-X Concentrator TaKaRa 631232 Ficoll-Paque PLUS GE Healthcare 17144003 Percoll® Sigma GE17-0891-01 HEPARIN Sodium Sagent Pharmaceuticals 25021 Citrate-dextrose solution (ACD) Sigma-Aldrich C3821 RBC Lysis Buffer (10×) Biolegend 420302 Paraformaldehyde Solution, 4% in PBS Thermo Fisher Scientific J19943K2 DNAse I Sigma 11284932001 Collagenase D Sigma 11088858001 EDTA (0.5 M), pH 8.0, RNase-free Invitrogen AM9260G Puromycin (hydrochloride) Cayman Chemical 13884 Critical commercial assays MojoSort™ Human CD4 T cell Isolation Kit BioLegend 480010 Human cord blood CD34 isolation kit STEMCELL Technologies 17896 MojoSort™ Human CD8 Nanobeads BioLegend 480108 Human IFN-alpha 2 Quantikine HS ELISA Kit R&D Systems HSIFNA2 Human Total IL-18 DuoSet ELISA R&D Systems DY318-05 P3 Primary Cell 4D-Nucleofector X Kit Lonza V4XP-3032 Quick-RNA Viral Kit Zymo Research R1035 Quick-RNA Microprep Kit Zymo Research R1051 Direct-zol RNA Miniprep Kit Zymo Research R2051 CFSE Cell Division Tracker Kit BioLegend 423801 MitoProbe™ JC-1 Assay Kit Invitrogen M34152 MitoTracker™ Dyes for Mitochondria Labeling Invitrogen M22426 QIAamp DNA Mini Kit Qiagen 51304 ZymoPURE II Plasmid Maxiprep Kit Zymo Research D4202 BD Cytofix/Cytoperm™ Fixation/Permeabilization Kit BD Biosciences 554714 eBioscience™ Foxp3/Transcription Factor Staining Buffer Set Invitrogen 00-5523-00 Human ProcartaPlex Mix&Match 15-plex Invitrogen PPX-15-MX9HK3C TaqMan® Gene Expression Assay-human TOX Thermo Fisher Scientific Hs01049519_m1 TaqMan® Gene Expression Assay-human BACH2 Thermo Fisher Scientific Hs00935338_m1 TaqMan® Gene Expression Assay-human POLR2A Thermo Fisher Scientific Hs00172187_m1 TaqMan® Gene Expression Assay-human PRDM-1 Thermo Fisher Scientific Hs00153357_m1 Deposited data RNA-seq data This paper GSE275936 Experimental models: Cell lines HEK 293T ATCC CRL-3216 Molt4-CCR5 NIH HIV Reagent Program ARP-4984 Human T Lymphocyte J-Lat Full Length Cells (6.3) NIH HIV Reagent Program ARP-9846 Human T Lymphocyte J-Lat Full-Length Cells (Clone 9.2) NIH HIV Reagent Program ARP-9848 Human T Lymphocyte J-Lat Full Length Cells (10.6) NIH HIV Reagent Program ARP-9849 Experimental models: Organisms/strains MISTRG-6-15 This paper N/A Software and algorithms FlowJo v10 BD Biosciences https://www.flowjo.com/ GraphPad Prism 10 GraphPad Software https://www.graphpad.com/ Image Lab Software Bio-Rad https://www.bio-rad.com/en-us/product/image-lab-software?ID=KRE6P5E8Z Adobe Illustrator Adobe https://www.adobe.com/products/illustrator.html Biorender Biorender https://www.biorender.com/ Mega11 Tamura, Stecher, and Kumar 89 https://www.megasoftware.net/ Python v3.8.5 Python Software Foundation https://www.python.org ETE3 v3.1.3 Huertas-Cepas, Serra, and Bork 90 http://etetoolkit.org/ Phylo Pic PhyloPic https://www.phylopic.org/ PyMSAviz v.0.4.0 Yuki Shimoyama 91 https://pypi.org/project/pyMSAviz/ Expasy Translator Tool Gasteiger et al. 92 https://web.expasy.org/translate/ STAR v2.7.9a Dobin et al. 93 https://github.com/alexdobin/STAR Integrative Genomics Viewer v2.16.2 Robinson et al. 94 https://igv.org/ Cytobank Beckman Coulter https://premium.cytobank.org/ Experimental model and subject details Human subjects Anonymous peripheral blood samples were collected from the Mississippi Valley Regional Blood Center as waste cellular products. Anonymous human cord blood samples were acquired from the Cleveland Cord Blood Center. Human tonsils were collected from elective tonsillectomies from the Saint Louis Children’s Hospital, which were provided as surgical waste without identifying information. For inflammatory cytokine analyses, pre- and post-ART plasma samples were obtained from the ACTG trial A5142. 68 + NCT00286767 NCT02147405 Mice strains The MISTRG-6-15 human cytokine knock-in mice was described previously. 72 Cell lines & primary cells HEK 293T cells were cultured in DMEM containing 10% heat-inactivated fetal bovine serum (FBS), 1 U/mL penicillin, and 100 mg/mL streptomycin. Molt4-CCR5 cells were cultured in RPMI 1640 containing 10% heat-inactivated FBS, 1 U/mL penicillin, 100 mg/mL streptomycin, and 1 mg/mL G418. Human T Lymphocyte J-Lat Full Length Cells (6.3), Human T Lymphocyte J-Lat Full Length Cells (9.2) and Human T Lymphocyte J-Lat Full Length Cells (10.6) were cultured in RPMI 1640 containing 10% heat-inactivated FBS. PBMCs were isolated by ficoll from human peripheral blood. CD4 + + + + + Method details Plasmids and viruses To prepare replication-defective HIV-1 reporter viruses, HEK293T cells were transfected with pNL4-3-ΔEnv-EGFP and CCR5 tropic envelope expressing plasmid. The replication-competent HIV BaL In vitro To investigate the effect of BET bromodomain inhibitors on the commitment to effector differentiation, activated CD4 + TOX To assess the differentiation of CCR5 + in vitro + + + + Cell viability and mitochondria assays Cell viability was determined by using Annexin V and 7-AAD according to the manufacturer’s instructions. The mitochondrial transmembrane potential of cells was measured with the JC-1 dye according to the manufacturer’s instructions. The MitoTracker dye was used to access the mitochondrial mass according to the manufacturer’s instructions. To track cell proliferation in vitro + For cellular biosynthesis measurement, unstimulated CD4 + Mouse tissue cell suspensions were incubated with Zombie Aqua or NIR for 15 min at 4°C, followed by washing and incubation with Human and mouse TruStain FcX blocking antibodies for 15 min at room temperature. After another wash, the cells were incubated with antibodies for 30 min on ice. For tissue samples from HIV-1-infected mice, cells were fixed with 4% paraformaldehyde for 10 min after antibody staining. Immunoblotting, ELISA, and multiplex bead array Lysates from 1×10 6 BACH2 To quantify the level of inflammatory cytokines in PLWH before and after ART, plasma samples were analyzed using ProcartaPlex multiplex immunoassays according to the manufacturer’s instructions. The 15-plex kit included the following analytes: IFN-γ, IL-1β, IL-10, IL-12p70, IL-15, IL-17A, IL-18, IL-2, IL-22, IL-6, IL-8, IP-10, MCP-1, RANKL and TNFα. In addition, IL-18 concentration was determined using the Human Total IL-18 DuoSet ELISA (R&D Systems). Gene expression analysis To determine host gene transcription levels, total RNA was using the Quick-RNA Microprep Kit before reverse transcription using the ProtoScript II Reverse Transcriptase and random primers. Expression of target genes was measured using pre-designed gene-specific TaqMan probes on a QuantStudio 5 Real-Time PCR System. RNA polymerase II subunit A ( POLR2A BACH2 overexpression assay Bulk CD4 + + + 6 CRISPR-Cas9 editing in CD4 + + CRISPR editing of CD4 + + 73 + + BACH2 TCF1 Table S1 6 + 6 + + + + + + + + Mass cytometry For mass cytometry analysis, metal-tagged antibodies were either purchased from Fluidigm or custom-conjugated using the Maxpar X8 Antibody Labeling Kit according to the manufacturer’s instructions. The following metal-conjugated antibodies were used in this study: anti-hCD45, anti-hCD57, anti-hCD45RA, anti-hCD270, anti-hCD4, anti-hCD8a, anti-hICOS, anti-hCD45RO, anti-hOX40, anti-hTIM-3, anti-hCD95, anti-hTIGIT, anti-hCD27, anti-h4-1BB, anti-hCXCR4, anti-hCD357, anti-hCD28, anti-hCTLA-4, anti-hCD272, anti-hCD69, anti-hCD161, anti-hCD40, anti-anti-hCD127, hCCR7, anti-hCD25, anti-hCD38, anti-hCD122, anti-hHLA-DR, anti-hPD-1, and anti-hLAG-3. 5∗10 6 + lo + + + 95 , 96 RNA-seq and data analysis CCR5 + - + 97 98 98 Single cell RNA-seq data analysis Processed single-Cell sequencing data from various tissues were downloaded from https://www.tissueimmunecellatlas.org 52 + 99 100 https://ggplot2.tidyverse.org + 101 , 102 , 103 Figure S1 Flow cytometry analysis For surface staining, cells were washed and then stained with antibodies for 30 min on ice. For surface staining of chemokine receptors such as CCR5 and CCR7, cells were stained at room temperature using pre-warmed buffer. Dead cells were labeled with either 7-AAD or the Zombie Fixable Viability Kit. Intracellular IFNγ, TNFα, IL-2 and HIV-1 p24 staining was performed using the BD Cytofix/Cytoperm Fixation/Permeabilization kit. eBioscience Foxp3/Transcription Factor Staining Buffer Set was used for Foxp3, TCF1, or Ki67 staining according to the manufacturer’s instructions. For intracellular cytokine staining, cells were stimulated with 50ng/mL PMA+1 μg/mL ionomycin with the presence of monensin for 5h according to the manufacturer’s instructions. To phenotypically profile total CD4 + + + 104 Virus reactivation in CD4 + CD4 + + + Table S2 Generation of humanized mice for HIV-1 infection and ART One-to three-day-old newborn MISTRG-6-15 mice received an intrahepatic injection of 1.5–2×10 4 + BaL Quantification of HIV-1 infection in humanized mice Blood samples were collected weekly in ACD-A tubes via facial vein bleeding to quantify plasma HIV-1 RNA. The viral RNA was extracted using the Quick-RNA Viral Kit. For tissue analyses, spleens and liver of each mouse were processed through cell strainer (100μm) into single-cell suspensions. Lung samples were collected, chopped, and incubated in Collagenase D (2mg/mL) with DNase I (100μg/mL) for 30 min at 37°C. Leukocytes from liver and lung were isolated using 27% Percoll. Subsequently, cells from each tissue were subject to red blood cell lysis to obtain single cell suspensions for genomic DNA extraction using the QIAamp DNA Mini Kit (Qiagen). Plasma viral RNA was reverse transcribed with ProtoScript II Reverse Transcriptase. Genomic DNA samples and cDNA products from plasma viral RNA were used for qPCR analyses using an HIV-1 gag-based qPCR assay. 71 To study viral rebound, splenic cell suspensions from each mouse in both the BACH2 Amplicon deep sequencing In the first step, specific primers were used for the BACH2 loci (BACH2-F and BACH2-R). In a second round of PCR, primers containing sample-specific barcodes and adapters were employed ( Table S3 105 Quantification and statistical analysis The statistical analysis was conducted using Prism 10. Phylogenetic statistics and analysis were performed as above. The methods for statistical analysis are described in the figure legends. The error bars indicate the standard error of the mean. References 1 Ho Y.-C. Shan L. Hosmane N.N. Wang J. Laskey S.B. Rosenbloom D.I.S. Lai J. Blankson J.N. Siliciano J.D. Siliciano R.F. Replication-Competent Noninduced Proviruses in the Latent Reservoir Increase Barrier to HIV-1 Cure Cell 155 2013 540 551 10.1016/j.cell.2013.09.020 24243014 PMC3896327 2 Chun T.-W. Finzi D. Margolick J. Chadwick K. Schwartz D. Siliciano R.F. In vivo fate of HIV-1-infected T cells: Quantitative analysis of the transition to stable latency Nat. Med. 1 1995 1284 1290 10.1038/nm1295-1284 7489410 3 Chun T.-W. Carruth L. Finzi D. Shen X. DiGiuseppe J.A. Taylor H. Hermankova M. Chadwick K. Margolick J. Quinn T.C. Quantification of latent tissue reservoirs and total body viral load in HIV-1 infection Nature 387 1997 183 188 10.1038/387183a0 9144289 4 Finzi D. Hermankova M. Pierson T. Carruth L.M. Buck C. Chaisson R.E. Quinn T.C. Chadwick K. Margolick J. Brookmeyer R. Identification of a Reservoir for HIV-1 in Patients on Highly Active Antiretroviral Therapy Science 278 1997 1295 1300 10.1126/science.278.5341.1295 9360927 5 Wong J.K. Hezareh M. Günthard H.F. Havlir D.V. Ignacio C.C. Spina C.A. Richman D.D. Recovery of Replication-Competent HIV Despite Prolonged Suppression of Plasma Viremia Science 278 1997 1291 1295 10.1126/science.278.5341.1291 9360926 6 Chun T.-W. Stuyver L. Mizell S.B. Ehler L.A. Mican J.A. Baseler M. Lloyd A.L. Nowak M.A. Fauci A.S. Presence of an inducible HIV-1 latent reservoir during highly active antiretroviral therapy Proc. Natl. Acad. Sci. USA 94 1997 13193 13197 10.1073/pnas.94.24.13193 9371822 PMC24285 7 Gantner P. Buranapraditkun S. Pagliuzza A. Dufour C. Pardons M. Mitchell J.L. Kroon E. Sacdalan C. Tulmethakaan N. Pinyakorn S. HIV rapidly targets a diverse pool of CD4+ T cells to establish productive and latent infections Immunity 56 2023 653 668.e5 10.1016/j.immuni.2023.01.030 36804957 PMC10023508 8 Chun T.-W. Engel D. Berrey M.M. Shea T. Corey L. Fauci A.S. Early establishment of a pool of latently infected, resting CD4+ T cells during primary HIV-1 infection Proc. Natl. Acad. Sci. USA 95 1998 8869 8873 10.1073/pnas.95.15.8869 9671771 PMC21169 9 Butler K.M. Gavin P. Coughlan S. Rochford A. Mc Donagh S. Cunningham O. Poulsom H. Watters S.A. Klein N. Rapid Viral Rebound After 4 Years of Suppressive Therapy in a Seronegative HIV-1 Infected Infant Treated From Birth Pediatr. Infect. Dis. J. 34 2015 e48 e51 10.1097/INF.0000000000000570 25742088 10 Brooks K. Jones B.R. Dilernia D.A. Wilkins D.J. Claiborne D.T. McInally S. Gilmour J. Kilembe W. Joy J.B. Allen S.A. HIV-1 variants are archived throughout infection and persist in the reservoir PLoS Pathog. 16 2020 e1008378 10.1371/journal.ppat.1008378 PMC7295247 32492044 11 Brodin J. Zanini F. Thebo L. Lanz C. Bratt G. Neher R.A. Albert J. Establishment and stability of the latent HIV-1 DNA reservoir eLife 5 2016 e18889 10.7554/eLife.18889 PMC5201419 27855060 12 Jones B.R. Kinloch N.N. Horacsek J. Ganase B. Harris M. Harrigan P.R. Jones R.B. Brockman M.A. Joy J.B. Poon A.F.Y. Brumme Z.L. Phylogenetic approach to recover integration dates of latent HIV sequences within-host Proc. Natl. Acad. Sci. USA 115 2018 E8958 E8967 10.1073/pnas.1802028115 30185556 PMC6156657 13 Brooks K. Omondi F.H. Liang R.H. Sudderuddin H. Jones B.R. Joy J.B. Brumme C.J. Hunter E. Brumme Z.L. Proviral Turnover During Untreated HIV Infection Is Dynamic and Variable Between Hosts, Impacting Reservoir Composition on ART Front. Microbiol. 12 2021 719153 10.3389/fmicb.2021.719153 PMC8417368 34489909 14 Pankau M.D. Reeves D.B. Harkins E. Ronen K. Jaoko W. Mandaliya K. Graham S.M. McClelland R.S. Matsen Iv F.A. Schiffer J.T. Dynamics of HIV DNA reservoir seeding in a cohort of superinfected Kenyan women PLoS Pathog. 16 2020 e1008286 10.1371/journal.ppat.1008286 PMC7028291 32023326 15 Abrahams M.-R. Joseph S.B. Garrett N. Tyers L. Moeser M. Archin N. Council O.D. Matten D. Zhou S. Doolabh D. The replication-competent HIV-1 latent reservoir is primarily established near the time of therapy initiation Sci. Transl. Med. 11 2019 eaaw5589 10.1126/scitranslmed.aaw5589 PMC7233356 31597754 16 Kinloch N.N. Shahid A. Dong W. Kirkby D. Jones B.R. Beelen C.J. MacMillan D. Lee G.Q. Mota T.M. Sudderuddin H. HIV reservoirs are dominated by genetically younger and clonally enriched proviruses mBio 14 2023 e02417-23 10.1128/mbio.02417-23 PMC10746175 37971267 17 Lian X. Seiger K.W. Parsons E.M. Gao C. Sun W. Gladkov G.T. Roseto I.C. Einkauf K.B. Osborn M.R. Chevalier J.M. Progressive transformation of the HIV-1 reservoir cell profile over two decades of antiviral therapy Cell Host Microbe 31 2023 83 96.e5 10.1016/j.chom.2022.12.002 36596305 PMC9839361 18 Jiang C. Lian X. Gao C. Sun X. Einkauf K.B. Chevalier J.M. Chen S.M.Y. Hua S. Rhee B. Chang K. Distinct viral reservoirs in individuals with spontaneous control of HIV-1 Nature 585 2020 261 267 10.1038/s41586-020-2651-8 32848246 PMC7837306 19 Lian X. Gao C. Sun X. Jiang C. Einkauf K.B. Seiger K.W. Chevalier J.M. Yuki Y. Martin M. Hoh R. Signatures of immune selection in intact and defective proviruses distinguish HIV-1 elite controllers Sci. Transl. Med. 13 2021 eabl4097 10.1126/scitranslmed.abl4097 PMC9202005 34910552 20 Deng K. Pertea M. Rongvaux A. Wang L. Durand C.M. Ghiaur G. Lai J. McHugh H.L. Hao H. Zhang H. Broad CTL response is required to clear latent HIV-1 due to dominance of escape mutations Nature 517 2015 381 385 10.1038/nature14053 25561180 PMC4406054 21 Huang S.-H. Ren Y. Thomas A.S. Chan D. Mueller S. Ward A.R. Patel S. Bollard C.M. Cruz C.R. Karandish S. Latent HIV reservoirs exhibit inherent resistance to elimination by CD8 + J. Clin. Investig. 128 2018 876 889 10.1172/JCI97555 29355843 PMC5785246 22 Doms R.W. Chemokine receptors and HIV entry AIDS 15 2001 S34 S35 10.1097/00002030-200102001-00051 11403007 23 Berger E.A. Murphy P.M. Farber J.M. Chemokine receptors as HIV-1 coreceptors: roles in viral entry, tropism, and disease Annu. Rev. Immunol. 17 1999 657 700 10.1146/annurev.immunol.17.1.657 10358771 24 Shaw G.M. Hunter E. HIV transmission Cold Spring Harb. Perspect. Med. 2 2012 a006965 10.1101/cshperspect.a006965 PMC3543106 23043157 25 Margolis L. Shattock R. Selective transmission of CCR5-utilizing HIV-1: the “gatekeeper” problem resolved? Nat. Rev. Microbiol. 4 2006 312 317 10.1038/nrmicro1387 16541138 26 Scarlatti G. Tresoldi E. Björndal A. Fredriksson R. Colognesi C. Deng H.K. Malnati M.S. Plebani A. Siccardi A.G. Littman D.R. In vivo evolution of HIV-1 co-receptor usage and sensitivity to chemokine-mediated suppression Nat. Med. 3 1997 1259 1265 10.1038/nm1197-1259 9359702 27 Koot M. Keet I.P. Vos A.H. de Goede R.E. Roos M.T. Coutinho R.A. Miedema F. Schellekens P.T. Tersmette M. Prognostic value of HIV-1 syncytium-inducing phenotype for rate of CD4+ cell depletion and progression to AIDS Ann. Intern. Med. 118 1993 681 688 10.7326/0003-4819-118-9-199305010-00004 8096374 28 Shan L. Deng K. Gao H. Xing S. Capoferri A.A. Durand C.M. Rabi S.A. Laird G.M. Kim M. Hosmane N.N. Transcriptional Reprogramming during Effector-to-Memory Transition Renders CD4+ T Cells Permissive for Latent HIV-1 Infection Immunity 47 2017 766 775.e3 10.1016/j.immuni.2017.09.014 29045905 PMC5948104 29 Pierson T. Hoffman T.L. Blankson J. Finzi D. Chadwick K. Margolick J.B. Buck C. Siliciano J.D. Doms R.W. Siliciano R.F. Characterization of chemokine receptor utilization of viruses in the latent reservoir for human immunodeficiency virus type 1 J. Virol. 74 2000 7824 7833 10.1128/jvi.74.17.7824-7833.2000 10933689 PMC112312 30 Soulié C. Fourati S. Lambert-Niclot S. Malet I. Wirden M. Tubiana R. Valantin M.-A. Katlama C. Calvez V. Marcelin A.-G. Factors associated with proviral DNA HIV-1 tropism in antiretroviral therapy-treated patients with fully suppressed plasma HIV viral load: implications for the clinical use of CCR5 antagonists J. Antimicrob. Chemother. 65 2010 749 751 10.1093/jac/dkq029 20150182 31 Hsu J. Van Besien K. Glesby M.J. Pahwa S. Coletti A. Warshaw M.G. Petz L. Moore T.B. Chen Y.H. Pallikkuth S. HIV-1 remission and possible cure in a woman after haplo-cord blood transplant Cell 186 2023 1115 1126.e8 10.1016/j.cell.2023.02.030 36931242 PMC10616809 32 Hütter G. Nowak D. Mossner M. Ganepola S. Müssig A. Allers K. Schneider T. Hofmann J. Kücherer C. Blau O. Long-term control of HIV by CCR5 Delta32/Delta32 stem-cell transplantation N. Engl. J. Med. 360 2009 692 698 10.1056/NEJMoa0802905 19213682 33 Gupta R.K. Abdul-Jawad S. McCoy L.E. Mok H.P. Peppa D. Salgado M. Martinez-Picado J. Nijhuis M. Wensing A.M.J. Lee H. HIV-1 remission following CCR5Δ32/Δ32 haematopoietic stem-cell transplantation Nature 568 2019 244 248 10.1038/s41586-019-1027-4 30836379 PMC7275870 34 Jensen B.-E.O. Knops E. Cords L. Lübke N. Salgado M. Busman-Sahay K. Estes J.D. Huyveneers L.E.P. Perdomo-Celis F. Wittner M. In-depth virological and immunological characterization of HIV-1 cure after CCR5Δ32/Δ32 allogeneic hematopoietic stem cell transplantation Nat. Med. 29 2023 583 587 10.1038/s41591-023-02213-x 36807684 PMC10033413 35 Kincer L.P. Joseph S.B. Gilleece M.M. Hauser B.M. Sizemore S. Zhou S. Di Germanio C. Zetterberg H. Fuchs D. Deeks S.G. Rebound HIV-1 in cerebrospinal fluid after antiviral therapy interruption is mainly clonally amplified R5 T cell-tropic virus Nat. Microbiol. 8 2023 260 271 10.1038/s41564-022-01306-6 36717718 PMC10201410 36 Bednar M.M. Hauser B.M. Zhou S. Jacobson J.M. Eron J.J. Frank I. Swanstrom R. Diversity and Tropism of HIV-1 Rebound Virus Populations in Plasma Level After Treatment Discontinuation J. Infect. Dis. 214 2016 403 407 10.1093/infdis/jiw172 27132284 PMC4936648 37 Duette G. Hiener B. Morgan H. Mazur F.G. Mathivanan V. Horsburgh B.A. Fisher K. Tong O. Lee E. Ahn H. The HIV-1 proviral landscape reveals that Nef contributes to HIV-1 persistence in effector memory CD4+ T cells J. Clin. Investig. 132 2022 e154422 10.1172/JCI154422 PMC8970682 35133986 38 Venanzi Rullo E. Pinzone M.R. Cannon L. Weissman S. Ceccarelli M. Zurakowski R. Nunnari G. O’Doherty U. Persistence of an intact HIV reservoir in phenotypically naive T cells JCI Insight 5 2020 e133157 10.1172/jci.insight.133157 PMC7605525 33055422 39 Wei Y. Davenport T.C. Collora J.A. Ma H.K. Pinto-Santini D. Lama J. Alfaro R. Duerr A. Ho Y.-C. Single-cell epigenetic, transcriptional, and protein profiling of latent and active HIV-1 reservoir revealed that IKZF3 Immunity 56 2023 2584 2601.e7 10.1016/j.immuni.2023.10.002 37922905 PMC10843106 40 Chomont N. El-Far M. Ancuta P. Trautmann L. Procopio F.A. Yassine-Diab B. Boucher G. Boulassel M.-R. Ghattas G. Brenchley J.M. HIV reservoir size and persistence are driven by T cell survival and homeostatic proliferation Nat. Med. 15 2009 893 900 10.1038/nm.1972 19543283 PMC2859814 41 Bruner K.M. Wang Z. Simonetti F.R. Bender A.M. Kwon K.J. Sengupta S. Fray E.J. Beg S.A. Antar A.A.R. Jenike K.M. A quantitative approach for measuring the reservoir of latent HIV-1 proviruses Nature 566 2019 120 125 10.1038/s41586-019-0898-8 30700913 PMC6447073 42 Weymar G.H.J. Bar-On Y. Oliveira T.Y. Gaebler C. Ramos V. Hartweger H. Breton G. Caskey M. Cohn L.B. Jankovic M. Nussenzweig M.C. Distinct gene expression by expanded clones of quiescent memory CD4+ T cells harboring intact latent HIV-1 proviruses Cell Rep. 40 2022 111311 10.1016/j.celrep.2022.111311 PMC9471989 36070690 43 Wu V.H. Nordin J.M.L. Nguyen S. Joy J. Mampe F. Del Rio Estrada P.M. Torres-Ruiz F. González-Navarro M. Luna-Villalobos Y.A. Ávila-Ríos S. Profound phenotypic and epigenetic heterogeneity of the HIV-1-infected CD4+ T cell reservoir Nat. Immunol. 24 2023 359 370 10.1038/s41590-022-01371-3 36536105 PMC9892009 44 Sun W. Gao C. Hartana C.A. Osborn M.R. Einkauf K.B. Lian X. Bone B. Bonheur N. Chun T.-W. Rosenberg E.S. Phenotypic signatures of immune selection in HIV-1 reservoir cells Nature 614 2023 309 317 10.1038/s41586-022-05538-8 36599977 PMC9908552 45 Pinzone M.R. Weissman S. Pasternak A.O. Zurakowski R. Migueles S. O’Doherty U. Naive infection predicts reservoir diversity and is a formidable hurdle to HIV eradication JCI Insight 6 2021 e150794 10.1172/jci.insight.150794 PMC8409977 34228640 46 Li Y. Gao H. Clark K.M. Shan L. IL-15 enhances HIV-1 infection by promoting survival and proliferation of CCR5+CD4+ T cells JCI Insight 8 2023 e166292 10.1172/jci.insight.166292 PMC10132148 36821374 47 Loetscher P. Uguccioni M. Bordoli L. Baggiolini M. Moser B. Chizzolini C. Dayer J.M. CCR5 is characteristic of Th1 lymphocytes Nature 391 1998 344 345 10.1038/34814 9450746 48 Qin S. Rottman J.B. Myers P. Kassam N. Weinblatt M. Loetscher M. Koch A.E. Moser B. Mackay C.R. The chemokine receptors CXCR3 and CCR5 mark subsets of T cells associated with certain inflammatory reactions J. Clin. Investig. 101 1998 746 754 10.1172/JCI1422 9466968 PMC508621 49 El Hed A. Khaitan A. Kozhaya L. Manel N. Daskalakis D. Borkowsky W. Valentine F. Littman D.R. Unutmaz D. Susceptibility of human Th17 cells to human immunodeficiency virus and their perturbation during infection J. Infect. Dis. 201 2010 843 854 10.1086/651021 20144043 PMC2849315 50 Miller S.M. Miles B. Guo K. Folkvord J. Meditz A.L. McCarter M.D. Levy D.N. MaWhinney S. Santiago M.L. Connick E. Follicular Regulatory T Cells Are Highly Permissive to R5-Tropic HIV-1 J. Virol. 91 2017 e00430-17 10.1128/JVI.00430-17 PMC5553166 28615202 51 Meditz A.L. Haas M.K. Folkvord J.M. Melander K. Young R. McCarter M. Mawhinney S. Campbell T.B. Lie Y. Coakley E. HLA-DR+ CD38+ CD4+ T lymphocytes have elevated CCR5 expression and produce the majority of R5-tropic HIV-1 RNA in vivo J. Virol. 85 2011 10189 10200 10.1128/JVI.02529-10 21813616 PMC3196402 52 Domínguez Conde C. Xu C. Jarvis L.B. Rainbow D.B. Wells S.B. Gomes T. Howlett S.K. Suchanek O. Polanski K. King H.W. Cross-tissue immune cell analysis reveals tissue-specific features in humans Science 376 2022 eabl5197 10.1126/science.abl5197 PMC7612735 35549406 53 Zhao X. Shan Q. Xue H.-H. TCF1 in T cell immunity: a broadened frontier Nat. Rev. Immunol. 22 2022 147 157 10.1038/s41577-021-00563-6 34127847 54 Khan O. Giles J.R. McDonald S. Manne S. Ngiow S.F. Patel K.P. Werner M.T. Huang A.C. Alexander K.A. Wu J.E. TOX transcriptionally and epigenetically programs CD8+ T cell exhaustion Nature 571 2019 211 218 10.1038/s41586-019-1325-x 31207603 PMC6713202 55 Alfei F. Kanev K. Hofmann M. Wu M. Ghoneim H.E. Roelli P. Utzschneider D.T. von Hoesslin M. Cullen J.G. Fan Y. TOX reinforces the phenotype and longevity of exhausted T cells in chronic viral infection Nature 571 2019 265 269 10.1038/s41586-019-1326-9 31207605 56 Scott A.C. Dündar F. Zumbo P. Chandran S.S. Klebanoff C.A. Shakiba M. Trivedi P. Menocal L. Appleby H. Camara S. TOX is a critical regulator of tumour-specific T cell differentiation Nature 571 2019 270 274 10.1038/s41586-019-1324-y 31207604 PMC7698992 57 Rutishauser R.L. Martins G.A. Kalachikov S. Chandele A. Parish I.A. Meffre E. Jacob J. Calame K. Kaech S.M. Transcriptional repressor Blimp-1 promotes CD8(+) T cell terminal differentiation and represses the acquisition of central memory T cell properties Immunity 31 2009 296 308 10.1016/j.immuni.2009.05.014 19664941 PMC2783637 58 Milner J.J. Toma C. Quon S. Omilusik K. Scharping N.E. Dey A. Reina-Campos M. Nguyen H. Getzler A.J. Diao H. Bromodomain protein BRD4 directs and sustains CD8 T cell differentiation during infection J. Exp. Med. 218 2021 e20202512 10.1084/jem.20202512 PMC8160575 34037670 59 Kagoya Y. Nakatsugawa M. Yamashita Y. Ochi T. Guo T. Anczurowski M. Saso K. Butler M.O. Arrowsmith C.H. Hirano N. BET bromodomain inhibition enhances T cell persistence and function in adoptive immunotherapy models J. Clin. Investig. 126 2016 3479 3494 10.1172/JCI86437 27548527 PMC5004946 60 Cheung K. Lu G. Sharma R. Vincek A. Zhang R. Plotnikov A.N. Zhang F. Zhang Q. Ju Y. Hu Y. BET N-terminal bromodomain inhibition selectively blocks Th17 cell differentiation and ameliorates colitis in mice Proc. Natl. Acad. Sci. USA 114 2017 2952 2957 10.1073/pnas.1615601114 28265070 PMC5358349 61 Roychoudhuri R. Clever D. Li P. Wakabayashi Y. Quinn K.M. Klebanoff C.A. Ji Y. Sukumar M. Eil R.L. Yu Z. BACH2 regulates CD8(+) T cell differentiation by controlling access of AP-1 factors to enhancers Nat. Immunol. 17 2016 851 860 10.1038/ni.3441 27158840 PMC4918801 62 Roychoudhuri R. Hirahara K. Mousavi K. Clever D. Klebanoff C.A. Bonelli M. Sciumè G. Zare H. Vahedi G. Dema B. BACH2 represses effector programs to stabilize Treg-mediated immune homeostasis Nature 498 2013 506 510 10.1038/nature12199 23728300 PMC3710737 63 Utzschneider D.T. Gabriel S.S. Chisanga D. Gloury R. Gubser P.M. Vasanthakumar A. Shi W. Kallies A. Early precursor T cells establish and propagate T cell exhaustion in chronic infection Nat. Immunol. 21 2020 1256 1266 10.1038/s41590-020-0760-z 32839610 64 Herndler-Brandstetter D. Ishigame H. Shinnakasu R. Plajer V. Stecher C. Zhao J. Lietzenmayer M. Kroehling L. Takumi A. Kometani K. KLRG1+ Effector CD8+ T Cells Lose KLRG1, Differentiate into All Memory T Cell Lineages, and Convey Enhanced Protective Immunity Immunity 48 2018 716 729.e8 10.1016/j.immuni.2018.03.015 29625895 PMC6465538 65 Abadie K. Clark E.C. Valanparambil R.M. Ukogu O. Yang W. Daza R.M. Ng K.K.H. Fathima J. Wang A.L. Lee J. Reversible, tunable epigenetic silencing of TCF1 generates flexibility in the T cell memory decision Immunity 57 2024 271 286.e13 10.1016/j.immuni.2023.12.006 38301652 PMC10922671 66 Collora J.A. Liu R. Pinto-Santini D. Ravindra N. Ganoza C. Lama J.R. Alfaro R. Chiarella J. Spudich S. Mounzer K. Single-cell multiomics reveals persistence of HIV-1 in expanded cytotoxic T cell clones Immunity 55 2022 1013 1031.e7 10.1016/j.immuni.2022.03.004 35320704 PMC9203927 67 Lee G.Q. Orlova-Fink N. Einkauf K. Chowdhury F.Z. Sun X. Harrington S. Kuo H.-H. Hua S. Chen H.-R. Ouyang Z. Clonal expansion of genome-intact HIV-1 in functionally polarized Th1 CD4+ T cells J. Clin. Investig. 127 2017 2689 2696 10.1172/JCI93289 28628034 PMC5490740 68 Riddler S.A. Haubrich R. DiRienzo A.G. Peeples L. Powderly W.G. Klingman K.L. Garren K.W. George T. Rooney J.F. Brizz B. Class-sparing regimens for initial treatment of HIV-1 infection N. Engl. J. Med. 358 2008 2095 2106 10.1056/NEJMoa074609 18480202 PMC3885902 69 Yukl S.A. Kaiser P. Kim P. Telwatte S. Joshi S.K. Vu M. Lampiris H. Wong J.K. HIV latency in isolated patient CD4+ T cells may be due to blocks in HIV transcriptional elongation, completion, and splicing Sci. Transl. Med. 10 2018 eaap9927 10.1126/scitranslmed.aap9927 PMC5959841 29491188 70 Shan L. Rabi S.A. Laird G.M. Eisele E.E. Zhang H. Margolick J.B. Siliciano R.F. A novel PCR assay for quantification of HIV-1 RNA J. Virol. 87 2013 6521 6525 10.1128/JVI.00006-13 23536672 PMC3648108 71 Gao H. Ozantürk A.N. Wang Q. Harlan G.H. Schmitz A.J. Presti R.M. Deng K. Shan L. Evaluation of HIV-1 latency reversal and antibody-dependent viral clearance by quantification of singly spliced HIV-1 vpu/env mRNA J. Virol. 95 2021 e02124-20 10.1128/JVI.02124-20 PMC8139706 33762408 72 Sungur C.M. Wang Q. Ozantürk A.N. Gao H. Schmitz A.J. Cella M. Yokoyama W.M. Shan L. Human NK cells confer protection against HIV-1 infection in humanized mice J. Clin. Investig. 132 2022 e162694 10.1172/JCI162694 PMC9753998 36282589 73 Wang Q. Clark K.M. Tiwari R. Raju N. Tharp G.K. Rogers J. Harris R.A. Raveendran M. Bosinger S.E. Burdo T.H. The CARD8 inflammasome dictates HIV/SIV pathogenesis and disease progression Cell 187 2024 1223 1237.e16 10.1016/j.cell.2024.01.048 38428396 PMC10919936 74 Tsukumo S.i. Unno M. Muto A. Takeuchi A. Kometani K. Kurosaki T. Igarashi K. Saito T. Bach2 maintains T cells in a naive state by suppressing effector memory-related genes Proc. Natl. Acad. Sci. USA 110 2013 10735 10740 10.1073/pnas.1306691110 23754397 PMC3696756 75 Siliciano J.D. Siliciano R.F. Biomarkers of HIV replication Curr. Opin. HIV AIDS 5 2010 491 497 10.1097/COH.0b013e32833f206f 20978392 76 Huang S.-H. McCann C.D. Mota T.M. Wang C. Lipkin S.M. Jones R.B. Have Cells Harboring the HIV Reservoir Been Immunoedited? Front. Immunol. 10 2019 1842 10.3389/fimmu.2019.01842 PMC6691121 31447850 77 Armani-Tourret M. Bone B. Tan T.S. Sun W. Bellefroid M. Struyve T. Louella M. Yu X.G. Lichterfeld M. Immune targeting of HIV-1 reservoir cells: a path to elimination strategies and cure Nat. Rev. Microbiol. 22 2024 328 344 10.1038/s41579-024-01010-8 38337034 PMC11131351 78 Fromentin R. Chomont N. HIV persistence in subsets of CD4+ T cells: 50 shades of reservoirs Semin. Immunol. 51 2021 101438 10.1016/j.smim.2020.101438 PMC8164644 33272901 79 Lederman M.M. Penn-Nicholson A. Cho M. Mosier D. Biology of CCR5 and its role in HIV infection and treatment JAMA 296 2006 815 826 10.1001/jama.296.7.815 16905787 80 Wei Y. Ma H.K. Wong M.E. Papasavvas E. Konnikova L. Tebas P. Morgenstern R. Montaner L.J. Ho Y.-C. BACH2-driven tissue resident memory programs promote HIV-1 persistence Preprint at: bioRxiv 2024 10.1101/2024.12.16.628794 PMC12385486 40845842 81 Bale M.J. Katusiime M.G. Wells D. Wu X. Spindler J. Halvas E.K. Cyktor J.C. Wiegand A. Shao W. Cotton M.F. Early Emergence and Long-Term Persistence of HIV-Infected T-Cell Clones in Children mBio 12 2021 e00568-21 10.1128/mBio.00568-21 PMC8092253 33832973 82 Ikeda T. Shibata J. Yoshimura K. Koito A. Matsushita S. Recurrent HIV-1 integration at the BACH2 locus in resting CD4+ T cell populations during effective highly active antiretroviral therapy J. Infect. Dis. 195 2007 716 725 10.1086/510915 17262715 83 Wagner T.A. McLaughlin S. Garg K. Cheung C.Y.K. Larsen B.B. Styrchak S. Huang H.C. Edlefsen P.T. Mullins J.I. Frenkel L.M. HIV latency. Proliferation of cells with HIV integrated into cancer genes contributes to persistent infection Science 345 2014 570 573 10.1126/science.1256304 25011556 PMC4230336 84 Maldarelli F. Wu X. Su L. Simonetti F.R. Shao W. Hill S. Spindler J. Ferris A.L. Mellors J.W. Kearney M.F. HIV latency. Specific HIV integration sites are linked to clonal expansion and persistence of infected cells Science 345 2014 179 183 10.1126/science.1254194 24968937 PMC4262401 85 Simonetti F.R. Zhang H. Soroosh G.P. Duan J. Rhodehouse K. Hill A.L. Beg S.A. McCormick K. Raymond H.E. Nobles C.L. Antigen-driven clonal selection shapes the persistence of HIV-1-infected CD4+ T cells in vivo J. Clin. Investig. 131 2021 e145254 10.1172/JCI145254 PMC7843227 33301425 86 Christian M.L. Dapp M.J. Scharffenberger S.C. Jones H. Song C. Frenkel L.M. Krumm A. Mullins J.I. Rawlings D.J. CRISPR/Cas9-Mediated Insertion of HIV Long Terminal Repeat within BACH2 Promotes Expansion of T Regulatory-like Cells J. Immunol. 208 2022 1700 1710 10.4049/jimmunol.2100491 35264460 PMC8976747 87 Cesana D. Santoni de Sio F.R. Rudilosso L. Gallina P. Calabria A. Beretta S. Merelli I. Bruzzesi E. Passerini L. Nozza S. HIV-1-mediated insertional activation of STAT5B and BACH2 trigger viral reservoir in T regulatory cells Nat. Commun. 8 2017 498 10.1038/s41467-017-00609-1 PMC5591266 28887441 88 Coffin J.M. Bale M.J. Wells D. Guo S. Luke B. Zerbato J.M. Sobolewski M.D. Sia T. Shao W. Wu X. Integration in oncogenes plays only a minor role in determining the in vivo distribution of HIV integration sites before or during suppressive antiretroviral therapy PLoS Pathog. 17 2021 e1009141 10.1371/journal.ppat.1009141 PMC8055010 33826675 89 Tamura K. Stecher G. Kumar S. MEGA11: Molecular Evolutionary Genetics Analysis Version 11 Molecular Biology and Evolution 38 7 2021 3022 3027 33892491 10.1093/molbev/msab120 PMC8233496 90 Huerta-Cepas J. Serra F. Bork P. ETE 3: Reconstruction, Analysis, and Visualization of Phylogenomic Data Molecular Biology and Evolution 33 2016 1635 1638 10.1093/molbev/msw046 26921390 PMC4868116 91 Shimoyama, Y. pyMSAviz (Version 0.4.0) [Computer software]. 2022. Retrieved from https://github.com/moshi4/pyMSAviz 92 Gasteiger E. Gattiker A. Hoogland C. Ivanyi I. Appel R.D. Bairoch A. ExPASy: The proteomics server for in-depth protein knowledge and analysis Nucleic Acids Res. 31 2003 3784 3788 10.1093/nar/gkg563 12824418 PMC168970 93 Dobin A. Davis C.A. Schlesinger F. Drenkow J. Zaleski C. Jha S. Batut P. Chaisson M. Gingeras T.R. STAR: ultrafast universal RNA-seq aligner Bioinformatics 29 2013 15 21 10.1093/bioinformatics/bts635 23104886 PMC3530905 94 Robinson J.T. Thorvaldsdottir H. Winckler W. Guttman M. Lander E.S. Getz G. Mesirov J.P. Integrative genomics viewer Nat. Biotechnol. 29 2011 24 26 10.1038/nbt.1754 21221095 PMC3346182 95 Amir E.a.D. Davis K.L. Tadmor M.D. Simonds E.F. Levine J.H. Bendall S.C. Shenfeld D.K. Krishnaswamy S. Nolan G.P. Pe’er D. viSNE enables visualization of high dimensional single-cell data and reveals phenotypic heterogeneity of leukemia Nat. Biotechnol. 31 2013 545 552 10.1038/nbt.2594 23685480 PMC4076922 96 Bandyopadhyay S. Yu L. Fisher D.A.C. Malkova O. Oh S.T. Identification of Functionally Primitive and Immunophenotypically Distinct Subpopulations in Secondary Acute Myeloid Leukemia By Mass Cytometry Blood 128 2016 4278 10.1182/blood.V128.22.4278.4278 PMC6343486 30426661 97 Love M.I. Huber W. Anders S. Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2 Genome Biol. 15 2014 550 10.1186/s13059-014-0550-8 PMC4302049 25516281 98 Fornes O. Castro-Mondragon J.A. Khan A. van der Lee R. Zhang X. Richmond P.A. Modi B.P. Correard S. Gheorghe M. Baranašić D. JASPAR 2020: update of the open-access database of transcription factor binding profiles Nucleic Acids Res. 48 2020 D87 D92 10.1093/nar/gkz1001 31701148 PMC7145627 99 Korsunsky I. Millard N. Fan J. Slowikowski K. Zhang F. Wei K. Baglaenko Y. Brenner M. Loh P.R. Raychaudhuri S. Fast, sensitive and accurate integration of single-cell data with Harmony Nat. Methods 16 2019 1289 1296 10.1038/s41592-019-0619-0 31740819 PMC6884693 100 Hao Y. Hao S. Andersen-Nissen E. Mauck W.M. Zheng S. Butler A. Lee M.J. Wilk A.J. Darby C. Zager M. Integrated analysis of multimodal single-cell data Cell 184 2021 3573 3587.e29 10.1016/j.cell.2021.04.048 34062119 PMC8238499 101 Zheng L. Qin S. Si W. Wang A. Xing B. Gao R. Ren X. Wang L. Wu X. Zhang J. Pan-cancer single-cell landscape of tumor-infiltrating T cells Science 374 2021 abe6474 10.1126/science.abe6474 34914499 102 Wang X.-M. Zhang J.-Y. Xing X. Huang H.-H. Xia P. Dai X.-P. Hu W. Zhang C. Song J.-W. Fan X. Global transcriptomic characterization of T cells in individuals with chronic HIV-1 infection Cell Discov. 8 2022 29 10.1038/s41421-021-00367-x PMC8964811 35351857 103 Jaeger N. Gamini R. Cella M. Schettini J.L. Bugatti M. Zhao S. Rosadini C.V. Esaulova E. Di Luccia B. Kinnett B. Single-cell analyses of Crohn’s disease tissues reveal intestinal intraepithelial T cells heterogeneity and altered subset distributions Nat. Commun. 12 2021 1921 10.1038/s41467-021-22164-6 PMC7997960 33771991 104 Van Gassen S. Callebaut B. Van Helden M.J. Lambrecht B.N. Demeester P. Dhaene T. Saeys Y. FlowSOM: Using self-organizing maps for visualization and interpretation of cytometry data Cytometry. A. 87 2015 636 645 10.1002/cyto.a.22625 25573116 105 Clement K. Rees H. Canver M.C. Gehrke J.M. Farouni R. Hsu J.Y. Cole M.A. Liu D.R. Joung J.K. Bauer D.E. Pinello L. CRISPResso2 provides accurate and rapid genome editing sequence analysis Nat. Biotechnol. 37 2019 224 226 10.1038/s41587-019-0032-3 30809026 PMC6533916 Supplemental information  Document S1. Figures S1–S7 and Tables S1–S3 Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102311 ",
  "metadata": {
    "Title of this paper": "CRISPResso2 provides accurate and rapid genome editing sequence analysis",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490260/"
  }
}