{
  "title": "Paper_1185",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472872 PMC12472872.1 12472872 12472872 41011166 10.3390/ph18091295 pharmaceuticals-18-01295 1 Article Analysis of Immune Checkpoints on Peripheral Blood Mononuclear Cells Can Predict Clinical Outcome and Reveal Potential of HVEM-BTLA Axis in Epithelial Ovarian Cancers https://orcid.org/0000-0002-5550-421X Lai Yen-Ling 1 2 † https://orcid.org/0000-0002-8269-5074 Lin Han-Wei 2 † https://orcid.org/0000-0002-0063-2222 Huang Yu-Wen 3 https://orcid.org/0000-0002-1711-8246 Chen Jung 2 4 Tai Ming-Chien 2 https://orcid.org/0000-0001-9431-5916 Wu Chia-Ying 2 https://orcid.org/0009-0001-1522-8302 Yang Tyan-Shin 2 Oblin Valentina 5 Shea Kristin 6 Chen Yu-Li 2 * Velasco-Velázquez Marco A. Academic Editor 1 adina@kimo.com 2 handway_rc@hotmail.com jjchen915@gmail.com s90091724@yahoo.com.tw ascheetah@msn.com jessica0617xyz@gmail.com 3 yuwen719@ntuh.gov.tw 4 5 valentina.oblin@meduniwien.ac.at 6 kristin.shea25@gmail.com * uly1007@yahoo.com.tw † These authors contributed equally to this work. 29 8 2025 9 2025 18 9 497460 1295 08 7 2025 25 8 2025 27 8 2025 29 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Methods: + + Results: + + + + + + + + + Conclusions: + PD-1-expressing T lymphocytes prognosis BTLA-HVEM axis cancer immunotherapy epithelial ovarian cancer National Science and Technology Council of Taiwan 110-2314-B-002-058-MY3 113-2314-B-002-247-MY3 National Taiwan University Hospital 113-S0204 National Taiwan University Hospital Yun-Lin Branch 113-N007 This study was supported by grants from the National Science and Technology Council of Taiwan [110-2314-B-002-058-MY3 and 113-2314-B-002-247-MY3], National Taiwan University Hospital [113-S0204], and National Taiwan University Hospital Yun-Lin Branch [113-N007]. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Epithelial ovarian cancer (EOC) is the most lethal malignancy of all gynecological cancers [ 1 2 3 4 5 6 7 Immune checkpoint inhibitors (ICIs), one of the immunomodulatory therapies, enhances the activity of host immune system by inhibiting the suppressive signals of checkpoint molecules. These agents can lead to activation and proliferation of tumor-specific T cells, which are able to eliminate tumor cells [ 8 9 10 11 12 13 14 15 BTLA is an inhibitory checkpoint receptor expressed on T cells, B cells, macrophages, dendritic cells, and natural killer cells. Its primary ligand, HVEM, is broadly expressed and can also bind CD160 or LIGHT (homologous to lymphotoxin, exhibits inducible expression and competes with HSV glycoprotein D for binding to HVEM), although BTLA has higher affinity for HVEM [ 16 17 18 + 19 20 21 Most previous studies investigated prognostic role or therapeutic potential of ICs in cancer patients using immune components from tumor microenvironment (TME). In this current study, peripheral blood mononuclear cells (PBMCs) of the advanced EOC cases were utilized to analyze the correlation between IC-expressing immune cells and survival outcomes of patients. The status of co-expression of various checkpoint molecules on the T lymphocytes from these EOC cases was further examined by t-distributed stochastic neighbor embedding (t-SNE) algorithm. Finally, the potential role of therapeutic antibodies (Abs) targeting associated IC signaling on the modulation of T lymphocytes was evaluated in vitro using PBMCs from the healthy donors. 2. Results 2.1. PD-1 + Based on the clinico-pathological characteristics of the study population ( Supplementary Table S1 A representative dot plot from flow cytometry illustrating the gating strategy and a heatmap of the expression of various immunocytes in PBMCs from 69 EOC patients are shown in Figure 1 + + + + Figure 1 Figure 1 + + + + + + + + + + Figure 1 − + − + Figure 1 + Figure 1 + Figure 1 + + Figure 1 Various IC expression in the lymphocytes of PBMCs was analyzed and the mean of fluorescence intensity (MFI) is presented in Figure 2 Figure 2 + + + + + + Figure 2 Figure 2 + + Figure 2 + Figure 2 Representative histograms of the range of PD-1 MFI in various immunocytes from 69 EOC patients are presented in Figure 3 + + + + Figure 3 + + + + Figure 3 + + + + + + Figure 3 + + Figure 3 + + Figure 3 + + + + + + 2.2. Co-Expression of HVEM on PD-1 + The percentage of CD3 + + + + + + 18 19 20 21 22 For the CD3 + + + Supplementary Figure S1A Figure 4 Figure 4 + + + Supplementary Figure S1B + + + Supplementary Figure S1C Figure 4 + + + Figure 4 Supplementary Figure S1D + + + Supplementary Figure S1E Figure 4 + + + Figure 4 For the CD3 + + + Supplementary Figure S1F Figure 4 Figure 4 + + + Supplementary Figure S1G + + + Supplementary Figure S1H Figure 4 + + + Figure 4 Supplementary Figure S1I + + + Supplementary Figure S1J Figure 4 + + + Figure 4 2.3. Addition of Anti-BTLA Ab to Other ICIs Can Generate More Potent Tumoricidal Effects As shown in Figure 5 + + + + + + + + + + + + Figure 5 Supplementary Figure S2 + + + Expression of CD25, CD107a, interferon-gamma (IFN-γ), or tumor necrosis factor-alpha (TNF-α) in the PD-1 + + + Figure 5 + + + Figure 5 + + + + Figure 5 Figure 5 Among the PBMCs from healthy donors treated with various ICIs, the activation markers, CD25 and CD107a on CD3 + + Figure 6 + + Figure 6 Figure 6 Figure 6 + + + + + + + + + + + Figure 6 Figure 6 + + + Figure 6 Figure 6 Figure 6 + + + 3. Discussion This study showed that percentages of PD-1 + + + + + + + + + + + + + In the early development of some cancer sites, including EOCs, the tumor-associated antigens can be immunogenic [ 23 24 25 24 24 26 A study by Hamanish et al. has demonstrated that prognosis of patients with high expression of PD-L1 in ovarian cancer specimens was poorer than that of cases with a low PD-L1 expression level [ 12 27 Supplementary Table S1 + Figure 3 + Figure 5 Supplementary Figure S2 28 29 30 In the tumor-bearing hosts, PD-1 expression on T lymphocytes in PBMCs is associated with an activated phenotype. These primed PD-1 + 31 18 21 + Figure 4 Based on the presence and distribution of associated T cells, tumors can be classified into hot, immunosuppressed, excluded, and cold groups. Except for hot tumors, complex pathways leading to tumor development are identified in other subtypes. Combinational strategies targeting different mechanism could be considered in the treatment of immunosuppressed tumors, including EOCs [ 32 33 22 34 Figure 5 Figure 6 18 Inhibitory checkpoint pathways in the suppressive TME act as an obstacle in the immune escape [ 8 35 Although our analysis suggested that investigation of IC profiling on PBMCs can reveal the ICs with prognostic and therapeutic potentials in EOC patients, several limitations were still noted in this study. First, the role of certain immune cells, such as CD3 + + 36 4. Materials and Methods 4.1. Patient and PBMC Preparation A total of 69 women diagnosed with advanced EOCs were enrolled. The clinical records, therapeutic strategies, and disease follow-up protocols of these cases were described in our previous study [ 34 37 g 4.2. Surface and Intracellular Staining of PBMCs Analyzed by Flow Cytometry, t-SNE, XShift, and FlowSOM Surface and intracellular markers of PBMCs were stained with various Abs ( Supplementary Tables S2 and S3 38 39 TM 22 4.3. Preparation of Cell Lines Ovarian cancer cell lines SKOV-3 and OVACR-3 were purchased from ATCC (American Type Culture Collection, Manassas, VA, USA). SKOV-3 cells were maintained in McCoy’s 5a medium with 10% fetal bovine serum (FBS) at 37 °C in a 5% carbon dioxide atmosphere. OVCAR-3 cells were maintained in RPMI1640 with human recombinant insulin (4 mg/mL) and 20% FBS at 37 °C in a 5% carbon dioxide atmosphere. 4.4. Preparation of PTX and Anti-PD-1, CTLA-4, and BTLA Abs Paclitaxel (PTX) (Sigma-Aldrich, St. Louis, MI, USA), anti-human CTLA-4 (Ipilimumab Biosimilar, Bio X cell, Lebanon, NH, USA), and PD-1 (Pembrolizumab Biosimilar, Bio X cell, Lebanon, NH, USA) Abs were purchased. PTX was initially dissolved in DMSO and subsequently diluted with PBS for experimental use. All antibodies were stored in PBS (pH 7.0) and diluted in the same buffer prior to use. The anti-BTLA neutralizing Ab was generated to block the BTLA-HVEM axis. Based on the binding sequence of BTLA and HVEM [ 40 4.5. Activation Potential of PD-1 + + PBMCs (5 × 10 5 4 4 + + + + Supplementary Table S3 (A,B) 22 + + + + 4.6. Tumoricidal Abilities of PBMCs from the Healthy Donors Treated with Various ICI Strategies SKOV-3 and OVCAR-3 cells were seeded into 24-well plates (2 × 10 4 5 4.7. Impact of Respective ICIs on Activation of T Cells in PMBCs from Healthy Donors Anti-BTLA (20 μg/mL), anti-CTLA-4 (20 μg/mL), and anti-PD-1 (20 μg/mL) Abs were cocultured with PBMCs from healthy donors for 24 h. PBS was used as negative control. Brefeldin A (1 μg/mL) was added to each well 4 h before analysis. All cells were then stained and analyzed for activation markers of CD4 + + Supplementary Table S3 41 42 4.8. Statistical Analyses All statistical analyses were performed in SPSS for Windows version 15.0 (SPSS Inc., Chicago, IL, USA). The data were expressed as geometric mean ± geometric standard deviation factor. The 25th percentile was derived from the lowest quartile of all patient samples for the percentage of each immune cell population or expression level of each immune checkpoint by ranking the data and taking the value at the cumulative 25% position. This cutoff was chosen because the study aimed to identify molecules with potential as therapeutic targets which required a minimum level of expression. The association between expression level of respective immune cell and patient survival was assessed using the Kaplan–Meier method. Residual disease status after cytoreductive surgery has been considered as one of the most important prognostic factors for disease progression of advanced EOCs [ 28 29 p 43 44 45 5. Conclusions In conclusion, percentages of PD-1 + + + + + Acknowledgments This work was also supported by (1) the 3rd and 7th core laboratory facilities of Department of Medical Research, National Taiwan University Hospital, and (2) the service provided by the Flow Cytometric Analyzing and Sorting Core Facility at National Taiwan University Hospital. Free original icons used in the graphical abstract were sourced from The Noun Project website. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ph18091295/s1 Author Contributions Y.-L.L., H.-W.L. and Y.-L.C. were involved in the design and conduct of experiments, data analyses, and manuscript writing. H.-W.L., Y.-W.H. and M.-C.T. performed the in vitro experiments and analyzed the data. J.C., C.-Y.W., T.-S.Y., V.O. and K.S. participated in the experimental design, collection of patient data, survival analyses of patients, and t-SNE data analyses. Y.-L.C. critically revised the manuscript and supervised the project. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was approved and performed in accordance with the guidelines and regulations of National Taiwan University Hospital Research Ethics Committee (200706002R, approved on 20 June 2025 and 201303101RIND, approved on 26 June 2025). Informed consent was obtained from all individual participants. Informed Consent Statement Informed consent for participation was obtained from all subjects in the study. Data Availability Statement Data are contained within the article and Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: EOC epithelial ovarian cancer PTX paclitaxel PARP poly-ADP ribose polymerase ICIs immune checkpoint inhibitors CTLA-4 cytotoxic T lymphocyte antigen 4 PD-1 programmed cell death 1 PD-L1 programmed death-ligand 1 ICs immune checkpoints TME tumor microenvironment PBMCs peripheral blood mononuclear cells t-SNE t-distributed stochastic neighbor embedding Abs antibodies DFS disease-free survival OS overall survival FBS fetal bovine serum BTLA B and T lymphocyte attenuator HVEM herpes virus entry mediator PMA phorbol myristate acetate Tregs regulatory T cells TCF-1 T-cell factor 1 ROC curve receiver operating characteristic curve AUROC area under the ROC curve TIM-3 T-cell immunoglobulin domain and mucin domain 3 GZMB granzyme B References 1. Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram I. Jemal A. Bray F. Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J. Clin. 2021 71 209 249 10.3322/caac.21660 33538338 2. Bowtell D.D. Böhm S. Ahmed A.A. Aspuria P.-J. Bast R.C. Beral V. Berek J.S. Birrer M.J. Blagden S. Bookman M.A. Rethinking Ovarian Cancer II: Reducing Mortality from High-Grade Serous Ovarian Cancer Nat. Rev. Cancer 2015 15 668 679 10.1038/nrc4019 26493647 PMC4892184 3. Armstrong D.K. Alvarez R.D. Bakkum-Gamez J.N. Barroilhet L. Behbakht K. Berchuck A. Chen L.-M. Cristea M. DeRosa M. Eisenhauer E.L. Ovarian Cancer, Version 2.2020, NCCN Clinical Practice Guidelines in Oncology J. Natl. Compr. Canc Netw. 2021 19 191 226 10.6004/jnccn.2021.0007 33545690 4. Moore K. Colombo N. Scambia G. Kim B.-G. Oaknin A. Friedlander M. Lisyanskaya A. Floquet A. Leary A. Sonke G.S. Maintenance Olaparib in Patients with Newly Diagnosed Advanced Ovarian Cancer N. Engl. J. Med. 2018 379 2495 2505 10.1056/NEJMoa1810858 30345884 5. González-Martín A. Pothuri B. Vergote I. DePont Christensen R. Graybill W. Mirza M.R. McCormick C. Lorusso D. Hoskins P. Freyer G. Niraparib in Patients with Newly Diagnosed Advanced Ovarian Cancer N. Engl. J. Med. 2019 381 2391 2402 10.1056/NEJMoa1910962 31562799 6. Ledermann J. Harter P. Gourley C. Friedlander M. Vergote I. Rustin G. Scott C.L. Meier W. Shapira-Frommer R. Safra T. Olaparib Maintenance Therapy in Patients with Platinum-Sensitive Relapsed Serous Ovarian Cancer: A Preplanned Retrospective Analysis of Outcomes by BRCA Status in a Randomised Phase 2 Trial Lancet Oncol. 2014 15 852 861 10.1016/S1470-2045(14)70228-1 24882434 7. Poveda A.M. Selle F. Hilpert F. Reuss A. Savarese A. Vergote I. Witteveen P. Bamias A. Scotto N. Mitchell L. Bevacizumab Combined with Weekly Paclitaxel, Pegylated Liposomal Doxorubicin, or Topotecan in Platinum-Resistant Recurrent Ovarian Cancer: Analysis by Chemotherapy Cohort of the Randomized Phase III AURELIA Trial J. Clin. Oncol. 2015 33 3836 3838 10.1200/JCO.2015.63.1408 26282651 8. Pardoll D.M. The Blockade of Immune Checkpoints in Cancer Immunotherapy Nat. Rev. Cancer 2012 12 252 264 10.1038/nrc3239 22437870 PMC4856023 9. Topalian S.L. Hodi F.S. Brahmer J.R. Gettinger S.N. Smith D.C. McDermott D.F. Powderly J.D. Carvajal R.D. Sosman J.A. Atkins M.B. Safety, Activity, and Immune Correlates of Anti-PD-1 Antibody in Cancer N. Engl. J. Med. 2012 366 2443 2454 10.1056/NEJMoa1200690 22658127 PMC3544539 10. Hodi F.S. O’Day S.J. McDermott D.F. Weber R.W. Sosman J.A. Haanen J.B. Gonzalez R. Robert C. Schadendorf D. Hassel J.C. Improved Survival with Ipilimumab in Patients with Metastatic Melanoma N. Engl. J. Med. 2010 363 711 723 10.1056/NEJMoa1003466 20525992 PMC3549297 11. Hamid O. Robert C. Daud A. Hodi F.S. Hwu W.-J. Kefford R. Wolchok J.D. Hersey P. Joseph R.W. Weber J.S. Safety and Tumor Responses with Lambrolizumab (Anti-PD-1) in Melanoma N. Engl. J. Med. 2013 369 134 144 10.1056/NEJMoa1305133 23724846 PMC4126516 12. Hamanishi J. Mandai M. Iwasaki M. Okazaki T. Tanaka Y. Yamaguchi K. Higuchi T. Yagi H. Takakura K. Minato N. Programmed Cell Death 1 Ligand 1 and Tumor-Infiltrating CD8+ T lymphocytes Are Prognostic Factors of Human Ovarian Cancer Proc. Natl. Acad. Sci. USA 2007 104 3360 3365 10.1073/pnas.0611533104 17360651 PMC1805580 13. Ma V.T. Milhem M.M. Hidalgo M. Shields A.F. Segar J.M. Khalil M. Davis A.A. Verschraegen C.F. Wong D.J.L. Schilder R.J. Phase I Dose-Escalation and Cohort Expansion Study of the Anti-BTLA Antibody, Tifcemalimab, in Combination with Toripalimab (Anti-PD-1) in Heavily Pretreated Patients (Pts) with Advanced Malignancies J. Clin. Oncol. 2024 42 2596 10.1200/JCO.2024.42.16_suppl.2596 14. Xu C. Cai Q. Ma J. Yang K. Wang S. Shen L. Qu S. Huang J. Huang X. Tang L.-L. Combination of Tim-3 Blockade TQB2618 with Penpulimab and Chemotherapy in the First-Line Treatment of Recurrent/Metastatic Nasopharyngeal Carcinoma (R/M NPC): A Multicenter, Single-Arm, Two-Cohort, Phase 2 Study J. Clin. Oncol. 2025 43 6031 10.1200/JCO.2025.43.16_suppl.6031 15. Sun Q. Hong Z. Zhang C. Wang L. Han Z. Ma D. Immune Checkpoint Therapy for Solid Tumours: Clinical Dilemmas and Future Trends Sig Transduct. Target. Ther. 2023 8 320 10.1038/s41392-023-01522-4 37635168 PMC10460796 16. Sordo-Bahamonde C. Lorenzo-Herrero S. Granda-Díaz R. Martínez-Pérez A. Aguilar-García C. Rodrigo J.P. García-Pedrero J.M. Gonzalez S. Beyond the Anti-PD-1/PD-L1 Era: Promising Role of the BTLA/HVEM Axis as a Future Target for Cancer Immunotherapy Mol. Cancer 2023 22 142 10.1186/s12943-023-01845-4 37649037 PMC10466776 17. Cheung T.C. Oborne L.M. Steinberg M.W. Macauley M.G. Fukuyama S. Sanjo H. D’Souza C. Norris P.S. Pfeffer K. Murphy K.M. T Cell Intrinsic Heterodimeric Complexes between HVEM and BTLA Determine Receptivity to the Surrounding Microenvironment J. Immunol. 2009 183 7286 7296 10.4049/jimmunol.0902490 19915044 PMC2865256 18. Peng H. He X. Wang Q. Immune Checkpoint Blockades in Gynecological Cancers: A Review of Clinical Trials Acta Obstet. Gynecol. Scand. 2022 101 941 951 10.1111/aogs.14412 35751489 PMC9564814 19. Thommen D.S. Schreiner J. Müller P. Herzig P. Roller A. Belousov A. Umana P. Pisa P. Klein C. Bacac M. Progression of Lung Cancer Is Associated with Increased Dysfunction of T Cells Defined by Coexpression of Multiple Inhibitory Receptors Cancer Immunol. Res. 2015 3 1344 1355 10.1158/2326-6066.CIR-15-0097 26253731 20. Demerlé C. Gorvel L. Olive D. BTLA-HVEM Couple in Health and Diseases: Insights for Immunotherapy in Lung Cancer Front. Oncol. 2021 11 682007 10.3389/fonc.2021.682007 34532285 PMC8438526 21. Wherry E.J. Kurachi M. Molecular and Cellular Insights into T Cell Exhaustion Nat. Rev. Immunol. 2015 15 486 499 10.1038/nri3862 26205583 PMC4889009 22. Sun W.-Z. Lin H.-W. Chen W.-Y. Chien C.-L. Lai Y.-L. Chen J. Chen Y.-L. Cheng W.-F. Dual Inhibition of BTLA and PD-1 Can Enhance Therapeutic Efficacy of Paclitaxel on Intraperitoneally Disseminated Tumors J. Immunother. Cancer 2023 11 e006694 10.1136/jitc-2023-006694 37463789 PMC10357656 23. Curiel T.J. Coukos G. Zou L. Alvarez X. Cheng P. Mottram P. Evdemon-Hogan M. Conejo-Garcia J.R. Zhang L. Burow M. Specific Recruitment of Regulatory T Cells in Ovarian Carcinoma Fosters Immune Privilege and Predicts Reduced Survival Nat. Med. 2004 10 942 949 10.1038/nm1093 15322536 24. Palucka A.K. Coussens L.M. The Basis of Oncoimmunology Cell 2016 164 1233 1247 10.1016/j.cell.2016.01.049 26967289 PMC4788788 25. Zhang L. Conejo-Garcia J.R. Katsaros D. Gimotty P.A. Massobrio M. Regnani G. Makrigiannakis A. Gray H. Schlienger K. Liebman M.N. Intratumoral T Cells, Recurrence, and Survival in Epithelial Ovarian Cancer N. Engl. J. Med. 2003 348 203 213 10.1056/NEJMoa020177 12529460 26. Schreiber R.D. Old L.J. Smyth M.J. Cancer Immunoediting: Integrating Immunity’s Roles in Cancer Suppression and Promotion Science 2011 331 1565 1570 10.1126/science.1203486 21436444 27. Chatterjee J. Dai W. Aziz N.H.A. Teo P.Y. Wahba J. Phelps D.L. Maine C.J. Whilding L.M. Dina R. Trevisan G. Clinical Use of Programmed Cell Death-1 and Its Ligand Expression as Discriminatory and Predictive Markers in Ovarian Cancer Clin. Cancer Res. 2017 23 3453 3460 10.1158/1078-0432.CCR-16-2366 27986748 28. Greer A. Gockley A. Manning-Geist B. Melamed A. Sisodia R.C. Berkowitz R. Horowitz N. Del Carmen M. Growdon W.B. Worley M. Impact of Residual Disease at Interval Debulking Surgery on Platinum Resistance and Patterns of Recurrence for Advanced-Stage Ovarian Cancer Int. J. Gynecol. Cancer 2021 31 1341 1347 10.1136/ijgc-2020-001505 34429355 29. Sørensen S.M. Schnack T.H. Høgdall C. Impact of Residual Disease on Overall Survival in Women with Federation of Gynecology and Obstetrics Stage IIIB-IIIC vs Stage IV Epithelial Ovarian Cancer after Primary Surgery Acta Obstet. Gynecol. Scand. 2019 98 34 43 10.1111/aogs.13453 30168853 30. Dabi Y. Huchon C. Ouldamer L. Bendifallah S. Collinet P. Bricou A. Daraï E. Ballester M. Lavoue V. Haddad B. Patients with Stage IV Epithelial Ovarian Cancer: Understanding the Determinants of Survival J. Transl. Med. 2020 18 134 10.1186/s12967-020-02295-y 32293460 PMC7087387 31. MacFarlane A.W. Jillab M. Plimack E.R. Hudes G.R. Uzzo R.G. Litwin S. Dulaimi E. Al-Saleem T. Campbell K.S. PD-1 Expression on Peripheral Blood Cells Increases with Stage in Renal Cell Carcinoma Patients and Is Rapidly Reduced after Surgical Tumor Resection Cancer Immunol. Res. 2014 2 320 331 10.1158/2326-6066.CIR-13-0133 24764579 PMC4007343 32. Galon J. Bruni D. Approaches to Treat Immune Hot, Altered and Cold Tumours with Combination Immunotherapies Nat. Rev. Drug Discov. 2019 18 197 218 10.1038/s41573-018-0007-y 30610226 33. Blanc-Durand F. Clemence Wei Xian L. Tan D.S.P. Targeting the Immune Microenvironment for Ovarian Cancer Therapy Front. Immunol. 2023 14 1328651 10.3389/fimmu.2023.1328651 38164130 PMC10757966 34. Chen Y.-L. Lin H.-W. Chien C.-L. Lai Y.-L. Sun W.-Z. Chen C.-A. Cheng W.-F. BTLA Blockade Enhances Cancer Therapy by Inhibiting IL-6/IL-10-Induced CD19high B lymphocytes J. Immunother. Cancer 2019 7 313 10.1186/s40425-019-0744-4 31753019 PMC6868712 35. Wilky B.A. Immune Checkpoint Inhibitors: The Linchpins of Modern Immunotherapy Immunol. Rev. 2019 290 6 23 10.1111/imr.12766 31355494 36. Emoto M. Kaufmann S.H.E. Liver NKT Cells: An Account of Heterogeneity Trends Immunol. 2003 24 364 369 10.1016/S1471-4906(03)00162-5 12860526 37. Chen Y.-L. Chang M.-C. Huang C.-Y. Chiang Y.-C. Lin H.-W. Chen C.-A. Hsieh C.-Y. Cheng W.-F. Serous Ovarian Carcinoma Patients with High Alpha-Folate Receptor Had Reducing Survival and Cytotoxic Chemo-Response Mol. Oncol. 2012 6 360 369 10.1016/j.molonc.2011.11.010 22265591 PMC5528335 38. Han P. Goularte O.D. Rufner K. Wilkinson B. Kaye J. An Inhibitory Ig Superfamily Protein Expressed by lymphocytes and APCs Is Also an Early Marker of Thymocyte Positive Selection J. Immunol. 2004 172 5931 5939 10.4049/jimmunol.172.10.5931 15128774 39. Chang M.-C. Chen Y.-L. Lin H.-W. Chiang Y.-C. Chang C.-F. Hsieh S.-F. Chen C.-A. Sun W.-Z. Cheng W.-F. Irradiation Enhances Abscopal Anti-Tumor Effects of Antigen-Specific Immunotherapy through Regulating Tumor Microenvironment Mol. Ther. 2018 26 404 419 10.1016/j.ymthe.2017.11.011 29248428 PMC5835145 40. Compaan D.M. Gonzalez L.C. Tom I. Loyet K.M. Eaton D. Hymowitz S.G. Attenuating Lymphocyte Activity: The Crystal Structure of the BTLA-HVEM Complex J. Biol. Chem. 2005 280 39553 39561 10.1074/jbc.M507629200 16169851 41. Kim H.-J. Barnitz R.A. Kreslavsky T. Brown F.D. Moffett H. Lemieux M.E. Kaygusuz Y. Meissner T. Holderried T.A.W. Chan S. Stable Inhibitory Activity of Regulatory T Cells Requires the Transcription Factor Helios Science 2015 350 334 339 10.1126/science.aad0616 26472910 PMC4627635 42. Wu T. Ji Y. Moseman E.A. Xu H.C. Manglani M. Kirby M. Anderson S.M. Handon R. Kenyon E. Elkahloun A. The TCF1-Bcl6 Axis Counteracts Type I Interferon to Repress Exhaustion and Maintain T Cell Stemness Sci. Immunol. 2016 1 eaai8593 10.1126/sciimmunol.aai8593 28018990 PMC5179228 43. Schober P. Boer C. Schwarte L.A. Correlation Coefficients: Appropriate Use and Interpretation Anesth. Analg. 2018 126 1763 10.1213/ANE.0000000000002864 29481436 44. Chen Y.-L. Cheng W.-F. Chang M.-C. Lin H.-W. Huang C.-T. Chien C.-L. Chen C.-A. Interferon-Gamma in Ascites Could Be a Predictive Biomarker of Outcome in Ovarian Carcinoma Gynecol. Oncol. 2013 131 63 68 10.1016/j.ygyno.2013.07.105 23917082 45. Chen Y.-L. Chou C.-Y. Chang M.-C. Lin H.-W. Huang C.-T. Hsieh S.-F. Chen C.-A. Cheng W.-F. IL17a and IL21 Combined with Surgical Status Predict the Outcome of Ovarian Cancer Patients Endocr. Relat. Cancer 2015 22 703 711 10.1530/ERC-15-0145 26150382 Figure 1 Survival impact of various immunocytes in lymphocytes of PBMCs. ( A B C + + + + D O + + + + + + + + + + − + − + D E + F G + + H I + + J K − + L M − + N O − + Figure 2 Survival impact of various IC-expressing cells in lymphocytes of PBMCs. ( A B C + + + + + + D O + + D E + F G + H I + J K + L M + N O + Figure 3 Correlation between various immunocytes and PD-1 + A B + + + + + + C + + + + D G + + + + + + + + + + + + + + + + D E + + + F G + + + Figure 4 Co-expression of other ICs on CD3 + + + + + + A + + + B + + + C + + + D + + + E + + + F + + + G + + + H + + + I + + + J + + + Figure 5 Role of PD-1 + A B + + + + C + + + + n D + + + + E + + + + n F n G n p p Figure 6 Potential of anti-BTLA Ab for activation of T lymphocytes. ( A + + B + + + + n C + + D + + + + n E + + + + + + + + + + n F + + + + + + + + + + n G + + + + + + + + + + + n H + + + + + + + + + + + + + n I + + + + + + + n J + + + + + + + n K + + + + + + + n p p ",
  "metadata": {
    "Title of this paper": "IL17a and IL21 Combined with Surgical Status Predict the Outcome of Ovarian Cancer Patients",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472872/"
  }
}