{
  "title": "Paper_372",
  "abstract": "pmc J Nanobiotechnology J Nanobiotechnology 142 nanobio Journal of Nanobiotechnology 1477-3155 BMC PMC12486976 PMC12486976.1 12486976 12486976 41034872 10.1186/s12951-025-03656-9 3656 1 Research Magnetically navigated nano-PROTAC ameliorates acute lung injury Chen Sheng 1 2 Chen Enen 1 Su Jianfen 1 Gong Yingjie 1 Tang Shiqi 1 Qin Aiping 1 Shen Ao shenao@gzhmu.edu.cn 1 Tang Shunqing tshunqt@jnu.edu.cn 2 Zhang Lingmin zhanglm@gzhmu.edu.cn 1 1 https://ror.org/00zat6v61 grid.410737.6 0000 0000 8653 1072 The Affiliated Panyu Central Hospital, The Fifth Affiliated Hospital, Guangzhou Municipal and Guangdong Provincial Key Laboratory of Molecular Target & Clinical Pharmacology, the NMPA and State Key Laboratory of Respiratory Disease, School of Pharmaceutical Sciences, Guangzhou Medical University, 2 https://ror.org/02xe5ns62 grid.258164.c 0000 0004 1790 3548 Department of Biomedical Engineering, Jinan University, 1 10 2025 2025 23 478190 622 7 4 2025 5 8 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Introduction Acute lung injury (ALI) is an acute inflammatory lung disease with high rates of morbidity and mortality. The lack of efficient pharmacological treatments for ALI resulted in poor outcomes and prognosis. Methods Poly(lactic-co-glycolic acid) (PLGA) was used to carry magnetic nanoparticles and TRIM24-targeted PROTAC (dTRIM24), which was further camouflaged with the exosome membranes derived from M1 macrophages to obtain nano-PROTAC (EM/PLGA/Magnetic nanoparticles/dTRIM24, EMPLANT). We evaluated the nanoparticles on the physicochemical properties, cellular uptake, in vitro toxicity, anti-inflammatory effects, in vivo biodistribution, in vivo therapeutic effect, anti-inflammatory capacity, and in vivo safety. Results This nano-PROTAC EMPLANT, shows dual-targeting capability by magnetic navigation and inflammatory specificity. EMPLANT selectively accumulates in the inflammatory lungs in ALI model mice under an external magnetic field, reduces lung injuries, and drastically prolongs survival. Mechanistically, the degradation of TRIM24 upregulates the expression of STAT6 and thus promotes an efficient phenotypic switch of macrophages from M1 to M2. This strategy can ameliorate ALI greatly and increase the survival ratio to nearly 100%. Conclusion The nano-PROTAC demonstrates a promising therapeutic strategy for ALI through precisely in situ reprogramming macrophages. To the best of our knowledge, we are the first to develop this type of magnetically navigated artificial exosomes to deliver PROTAC and use it for ALI treatment. Graphical abstract  Supplementary Information The online version contains supplementary material available at 10.1186/s12951-025-03656-9. Keywords PROTAC Acute lung injury Macrophage polarization Pulmonary inflammation Magnetic navigation National Natural Science Foundation of China 82170008 32171312 82072047 Qin Aiping Tang Shunqing Zhang Lingmin pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Acute lung injury (ALI) is a general term for the syndrome of injurious pulmonary inflammation with variable types, often marked by excessive inflammation leading to hypoxemic respiratory failure [ 1 2 3 4 5 6 7 8 Macrophages are specialized immune cells with high plasticity that defend the host against infection and play a vital role in the progression of ALI [ 9 10 11 12 13 14 15 16 17 TRIM24, a member of the tripartite motif (TRIM) family, is a multifunctional protein that has E3 ubiquitin ligase, nuclear receptors binding, chromatin remodeling, and transcriptional cofactor activities [ 18 19 20 21 Exosomes are nano-sized extracellular vesicles released by virtually all cell types, serving as critical mediators of intercellular communication [ 22 24 25 26 27 28 29 30 31 32 33 35 36 To this end, we developed a type of magnetically navigated artificial exosomes, which was able to carry the proteolysis-targeting chimera (PROTAC) reagent and target to inflammatory lungs during ALI, and switch macrophages from pathogenic M1 to protective M2. To direct M2 polarization, we chose the PROTAC reagent specifically degrading TRIM24, a protein involved in macrophage polarization. Considering that the single dependence of blood flow pulsation may increase the non-specific biodistribution and hinder their therapeutic efficacy, the external magnetic field was used to facilitate the PROTAC accumulation at particular tissues. Briefly, the nanoparticles were constructed by double-emulsification using US Food and Drug Administration (FDA) approved Poly (lactic-co-glycolic acid) (PLGA), magnetic nanoparticles and TRIM24-targeted PROTAC reagent (dTRIM24), followed by the camouflage with M1-Exos membranes. We hypothesized that this type of magnetically navigated nano-PROTAC ( EM PL a n T EMPLANT 1 1  Scheme 1 The preparation of EMPLANT and the therapeutic effect on ALI mice. ( A B Experimental section Cell cultures NIH-3T3 (mouse fibroblast), MLE-12 (mouse lung type-II epithelial cell), and RAW 264.7 (mouse macrophage) cell lines were obtained from the Cell Resource Center, Peking Union Medical College (Beijing, China). Cells were authenticated with STR profiling and checked free of mycoplasma. Cells were cultured with Dulbecco’s modified Eagle’s medium (DMEM) containing 10% fetal bovine serum (Gibco, USA) and 1% penicillin/streptomycin (Thermo Fisher, USA) in a 37 °C, 5% CO2 humidified incubator atmosphere. Isolation and characterization of exosomes RAW 264.7 cells were polarized to M1 or M2 macrophages by treating with LPS 50 ng/mL (Sigma-Aldrich, USA) or 10 ng/mL IL-4 (Peprotech, USA) for 24 h, respectively. Exosomes derived from M1 and M2 macrophages (M1-Exos and M2-Exos) were extracted from the conditioned medium using a multi-step centrifugation process: initially at 3,000 rpm for 10 min to clear cells, then at 10,000 g for 30 min to remove debris, and finally at 100,000 g for 2 h to collect the exosomes. The harvested exosomes were resuspended using PBS and cryopreserved at −80 °C for further use. Size distribution was analyzed using a ZetaView nanoparticle tracking analyzer (Particle Metrix, Germany), and morphological features were assessed via transmission electron microscopy (TEM) using a JEM-1400Plus (JEOL, Japan). Protein concentrations of M1 macrophages and M1-Exos were quantified using a Pierce BCA protein assay kit (Thermo Fisher, USA). Equal protein amounts were separated by SDS-PAGE, and then transferred to nitrocellulose membranes, and probed overnight with CD63 and HSP-70 primary antibodies (Abcam, USA). After incubation with HRP-conjugated secondary antibody (Abcam, USA) for 1.5 h, protein bands were visualized using SuperSignal West Pico PLUS ECL reagent (Thermo Fisher, USA) and imaged with the Amersham 600 Imager (GE Healthcare Life Sciences, USA). Cellular uptake of exosomes by M1 macrophages Exosomes of M1 macrophages and M2 macrophages (M1-Exos and M2-Exos) were labeled by 20 mg/mL fluorescent DiD for 15 min (Solarbio, China), and then the cellular uptake by M1 macrophages was evaluated. In brief, M1 macrophages were seeded into 35 mm confocal dishes. When approximately 80% confluence, the cells were washed using PBS and incubated with an equal amount of DiD-labeled M1-Exos or M2-Exos in the medium for indicated times. After incubation, the cells were washed and nuclei were labeled using Hoechst33342 (1 µg/mL for 10 min, Beyotime, China). Cellular uptake was analyzed using an LSM880 confocal laser microscope (Carl Zeiss, Germany). Synthesis of magnetic nanoparticles (Fe 3 4 The magnetic nanoparticles were synthesized according to the previous work [ 37 3 4 2 3 2 −1 2 Preparation of plga/magnetic nanoparticles/dTRIM24 (PLANT) PLANT was synthesized by a double emulsification method. In short, under the condition of sonication, 500 µL of Fe 3 4 3 4 Preparation of em/plga/magnetic nanoparticles/dTRIM24 (EMPLANT) EMPLANT was prepared according to our previous work with minor modifications [ 33 Characterization of the nanoparticles EMPLANT was measured by Zetasizer Nano ZS90 (Malvern Panalytical, USA) for particle sizes, polydispersity index (PDI), and Zeta potential. The morphology of PLANT and EMPLANT was observed by TEM imaging. M1-Exos, exosome membranes, and EMPLANT were resuspended in RIPA buffer (Beyotime, China), and an equal amount of proteins from each group (20 µg/well), as determined by the BCA assay, were analyzed by SDS-PAGE electrophoresis and Coomassie Brilliant Blue staining (Beyotime, CN). In vitro release of EMPLANT EMPLANT at a volume of 1 mL was loaded in a Millipore D-Tube dialyzer (MWCO 3.5 kDa, Sigma-Aldrich, USA) and submerged in 10 mL of dialysis buffer at a given pH (pH 5.0 or 7.4). At specified intervals (1, 2, 4, 6, 8, 10, 12, 24, 48, and 72 h), 10 mL of dialysate was collected and substituted with an equal volume of fresh dialysate. The UV absorption of the sampled dialysate, indicative of dTRIM24 release from EMPLANT, was analyzed using a UV-Vis spectrophotometer. Cellular uptake of EMPLANT To evaluate the cellular uptake of EMPLANT, EM/PLGA/Magnetic nanoparticles/DiD (EMPLAN/DiD) was synthesized in the same way as EMPLANT, except that dTRIM24 was replaced by DiD dye during the procedure. The mass of DiD in EMPLAN/DiD was 0.1% of the nanoparticles. Macrophages of the M1 type were seeded into 35 mm confocal dishes. Upon reaching around 80% confluency, the M1 cells were rinsed and cultured in a newly prepared DMEM medium supplemented with EMPLAN/DiD (EMPLAN concentrations ranging from 25 to 400 µg/mL) for 12 h. Subsequently, the cells were thoroughly washed three times using PBS. Hoechst33342 (1 µg/mL, 10 min) and actin-tracker (1:200, 30 min, Beyotime, China) were used to stain cells. Cell imaging was performed under a CLSM (LSM880, Carl Zeiss, Germany). Alternatively, cells were trypsinized and analyzed by an ImageStreamX Imaging Flow Cytometer for quantification (Amnis, USA). In another set of experiments, cellular uptake over time (4, 8, 12, and 16 h) of EMPLAN/DiD (EMPLAN equivalent to 200 µg/mL) was performed in the same way as above. In addition, the cellular uptake of EMPLAN/DiD was also observed by an LSM880 confocal laser microscope after co-incubation with the nanoparticles in MLE-12, NIH-3T3, or M1 macrophages for 12 h. Cytotoxicity of EMPLANT Macrophages of the M1 type were seeded into 35 mm confocal dishes. Upon reaching approximately 80% confluency, the cells were incubated in the fresh medium supplemented with EMPLANT and varying concentrations of dTRIM24. For control purposes, PBS and 75% ethanol were used as the baseline and positive/negative controls, respectively. Following a 48-hour incubation period, cellular viability and toxicity were evaluated using a Calcein-AM/PI dual staining assay (Beyotime), and the results were visualized through confocal laser scanning microscopy (LSM880, Carl Zeiss). Additionally, quantitative cell viability measurements were conducted using the CCK-8 assay (Solarbio, China) in parallel experiments. Extraction of RNA and analysis of RT-qPCR Total RNA isolation was performed using the SteadyPure universal RNA extraction kit II, followed by cDNA synthesis with the Evo M-MLV RT kit with gDNA Clean for qPCR. Quantitative PCR analysis was conducted on the LightCycler 480 II system (Roche, USA) employing SYBR Green premix pro-Taq HS qPCR kit (Accurate Biotechnology, China). Gene expression quantification was determined through the ΔΔCt method, with GAPDH serving as the internal reference control. Primer sequences for target genes are detailed in Table S1 The reprogramming of M1 macrophages in vitro M1 macrophages were seeded in 6-well plates and treated with varying concentrations of EMPLANT. Following a 12 h exposure, the medium was refreshed and cells were maintained for an additional 36 h. Cellular proteins were extracted using RIPA buffer, mixed with SDS-PAGE loading buffer (Beyotime, China), and denatured at 100 °C for 5 min. Proteins were resolved using SDS-PAGE and subsequently transferred onto PVDF membranes via electroblotting. The membranes were then blocked with nonfat milk and probed with primary antibodies targeting TRIM24, STAT6, iNOS, and Arg-1 (diluted 1:1000, Abcam), followed by incubation with appropriate secondary antibodies. Tubulin was used as an internal reference for normalization. Protein bands were detected using SuperSignal West Pico PLUS ECL reagent (Thermo Fisher, USA) and imaged with the Amersham 600 system (GE Healthcare Life Sciences, USA). Parallel experiments assessed the mRNA expression profiles of the macrophage surface markers iNOS and Arg-1, as well as the cytokines TGF-β, IL-10, IL-6, and TNF-α through RT-qPCR analysis following established protocols. Animals and treatments BALB/C mice (6 ~ 8 weeks old, 18 ~ 20 g) were obtained from HFK Bioscience (Beijing, China). The mice were fed in the specific pathogen-free animal room. The animal experiments were approved by the Institutional Animal Care and Use Committee of Guangzhou Medical University and performed in compliance with National Institutes of Health guidelines for the care and use of laboratory animals (approved number, GY2023-693). Lipopolysaccharide (LPS) was used to induce mouse ALI and pneumonia by tracheal injection (3 mg/kg). After the LPS injection for 4 h, the ALI mouse model was constructed. The therapeutic effects in vivo The ALI model mice were randomly divided into six groups (5 per group) and a magnet was taped to the thoracic region of each mouse, then the mice were subjected to saline, dTRIM24, PLANT, EMPLT, EMPLANT (no MF), and EMPLANT by tail-vein injection. All groups received 200 µL solutions with the same amount of dTRIM24 (5 mg/kg) except for the saline group. The survival periods were monitored during treatments. Following the treatment period, pulmonary tissues were harvested for molecular analysis, with the levels of iNOS and Arg-1 quantified through RT-qPCR. The expression of TRIM24 and STAT6 was assessed by western blot analysis, following established protocols. The cytokines including IL-6, IL-10, IL-1β, and TGF-β in lung tissue homogenate were quantified by ELISA kits (Neobioscience, China). In another set of experiments, samples of major organs (heart, liver, spleen, lungs, and kidneys) from mice were collected, and the organs were embedded and sectioned, followed by staining with H&E. Histological and immunofluorescence staining analysis Post-treatment lung specimens from ALI mice underwent comprehensive histological analysis. Following fixation in 4% paraformaldehyde and paraffin embedding, the sections from lung tissues were stained with hematoxylin-eosin (H&E), and immunofluorescence staining was also performed on the lung tissue sections. Briefly, the sections were washed with PBST after antigen fixation, followed by protein blocking for about 1 h at room temperature with BSA. After incubation with iNOS (Servicebio, 1:200, GB11119) and Arg-1 (Santa Cruz, 1:200, sc-271430) at 4 °C overnight, tissue sections were treated with fluorophore-conjugated secondary antibodies, then counterstained with DAPI (Invitrogen, USA) for nuclear visualization. Fluorescence microscopy analysis was conducted using CLSM, with subsequent quantitative evaluation of Arg-1 and iNOS expression levels performed through fluorescence intensity measurements with ImageJ software. Statistical analysis All experimental procedures were replicated in triplicate under independent conditions, with results expressed as mean ± SD. Statistical evaluations were conducted using GraphPad Prism 9.5, employing unpaired Student’s t-test for comparisons between two groups. Significance thresholds were established at * P P P P Results Preparation and characterization of exosomes To construct the M1 macrophages, we used mouse monocytic macrophage leukemia cell line RAW 264.7 as the model cells, which were treated with either LPS or IL-4 for 24 h to construct M1 or M2 macrophages, respectively (Fig. 1 1 1 To explore the cellular uptake of M1-Exos and M2-Exo (derived from M2 macrophages) in M1 macrophages, M1-Exos or M2-Exos were labeled with the fluorescent DiD and incubated with M1 macrophages for different time. The findings demonstrate that M1-Exos was efficiently internalized by macrophages in a time-dependent manner, as indicated by confocal laser microscopy (CLSM) and flow cytometry, with much higher cellular uptake at 12 h than the one at 6 h (Fig. 1  Fig. 1 The properties of different exosomes derived from macrophages. A B C D E P P The preparation and characterizations of EMPLANT To prepare the nano-PROTAC, the FDA-approved polymer PLGA was used to encapsulate dTRIM24 and magnetic nanoparticles. PLGA, magnetic nanoparticles, and dTRIM24 were first constructed to PLGA/Magnetic nanoparticles/dTRIM24 (PLANT) by emulsification. The weight ratio of PLGA to magnetic nanoparticles has been optimized (PLGA/magnetic nanoparticles = 100/1), thereby achieving a relatively small size and a satisfactory particle dispersity index (PDI) (Fig. S3A), as well as the loading efficiency of ~ 90% at most (Fig. S3B). The nanoparticles were further decorated with M1-Exos membranes (EM) according to our previous work. [28] TEM analysis indicated that the magnetic nanoparticles exhibited a spherical morphology with an approximate diameter of 10 nm (Fig. S4A). The magnetic nanoparticles showed good magnetism in the presence of an external magnetic field (MF) (Fig. S4B). After the magnetic nanoparticles and dTRIM24 were loaded with PLGA, PLANT was formed. TEM imaging revealed distinct morphological characteristics between the nanoparticles: PLANT displayed a spherical morphology with a diameter of around 150 nm, while its membrane-camouflaged counterpart, EMPLANT, exhibited a core-shell architecture with an outer layer of 10 nm. Size characterization through dynamic light scattering (DLS) demonstrated a hydrodynamic diameter increase from 162 ± 3 nm for PLANT to 209 ± 7 nm for EMPLANT (Fig. 2A, B). The successful membrane coating was further substantiated by Coomassie Brilliant Blue staining, which detected the specific surface antigens derived from M1-Exos membranes on EMPLANT (Fig. 2 3 4 2 2 2 2  Fig. 2 The characterization of the magnetically navigated artificial exosomes. A B C D E F 3 4 G Cellular uptake Next, we sought to evaluate the cellular uptake of EM-based nanoparticles by macrophages. The fluorescence dye DiD was used as a substitution for dTRIM24 (EM/PLGA/Magnetic nanoparticles/DiD, EMPLAN/DiD) because dTRIM24 did not show fluorescence. As expected, both CLSM and FACS analyses demonstrated dose- and time-dependent cellular internalization of EMPLAN/DiD, with optimal uptake conditions identified at 200 µg/mL (ENPLAN equivalent) and 12-hour incubation, achieving approximately 95% DiD-positive cell population (Fig. 3 3  Fig. 3 Cellular uptake of the nanoparticles in different conditions. A B C 5 Cytotoxicity and the anti-inflammatory effects in vitro We evaluated the cell viability and anti-inflammatory effects induced by EMPLANT in M1 macrophages. The Live/Dead assay indicated that EMPLANT displayed no significant cytotoxicity within the working concentrations on M1 macrophages, as evidenced by most of the cells being calcein-positive (green fluorescence) (Fig. 4 4 4 4 4 4 4  Fig. 4 Cell viability and the biological effect induced by the magnetically navigated nanoparticles in different dosages. A B C D E P P P The biological effects induced by different formulations were also evaluated at the protein and mRNA levels. WB analysis indicated that the dTRIM24-containing formulations including PLGA/dTRIM24 (PLT), EM/PLGA/dTRIM24 (EMPLT), PLANT, and EMPLANT induced effective changes on the protein levels such as TRIM24, STAT6, iNOS, and Arg-1. In particular, EMPLANT almost degraded TRIM24 completely, resulting in the effective expression of STAT6 (Fig. 5 5 5 5  Fig. 5 The biological effect induced by different formulations. A B C P P P The biodistribution in vivo The biodistribution of exosome-based nanoparticles was investigated in vivo. The LPS-induced ALI mice were constructed to evaluate the inflammatory-targeting ability and therapeutic response of different dTRIM24-containing nanoparticles. Because dTRIM24 did not have fluorescence properties, the fluorescence dye 1,1’-Dioctadecyl-3,3,3’,3’-Tetramethylindotricarbocyanine Iodide (DiR) was applied as an indicator to visualize the distribution of various formulations in vivo. The ALI mice were divided into six groups (Saline, DiR, PLAN/DiR, EMPL/DiR, EMPLAN/DiR (No MF), and EMPLAN/DiR). Except for the EMPLAN/DiR (No MF) group, magnets were fixed above the thoracic lungs of mice in other groups using adhesive tape. Following intravenous administration of DiR-labeled nanoparticles, real-time biodistribution patterns were monitored using IVIS at 1, 6, and 12-hour intervals, comparing groups with and without magnetic field (MF) application. Fluorescent image analysis revealed significantly enhanced fluorescence intensity in MF-treated EMPLAN/DiR groups, with predominant pulmonary accumulation observed at the 12 h time point (Fig. 6 6 6 38  Fig. 6 The biodistribution of magnetically navigated nanoparticles. A B C P P The therapeutic effects on ALI mice We further examined the anti-inflammatory efficacy of EMPLANT in the ALI mice. The ALI mouse models were randomly assigned to six groups, which were then subjected to different treatments (saline, dTRIM24, PLANT, EMPLT, EMPLANT (No MF), and EMPLANT). EMPLANT in the presence of a magnetic field showed the most effective degradation of TRIM24, which in turn, induced the highest level of STAT6 (Fig. 7 7 7  Fig. 7 The therapeutic effects induced by different formulations. A B C D P P P Hematoxylin & eosin (H&E) and immunofluorescence staining We evaluated the therapeutic effects of ALI induced by different formulations. H&E staining indicated that the lung injury was ameliorated significantly by EMPLANT in the presence of MF, as was evidenced by the reduction of inflammatory cell infiltration (Fig. 8 8 8 8 8  Fig. 8 The H&E staining and immunofluorescence staining of the lung tissues. A B C D P P Discussion ALI is still challenged by the present approaches [ 39 40 41 42 PROTAC has emerged as an efficient and precise tool for the degradation of proteins [ 43 44 45 46 Exosomes act as communicators between the cells, which show great potential in drug delivery based on their excellent properties, such as excellent prolonged circulation lifetime, high stability, and good plasticity [ 47 48 49 50 Our work opened a new avenue to treat ALI with PROTAC by developing a type of artificial exosome to load PROTAC regent dTRIM24 named EMPLANT, which can not only target to the site of inflammatory sites but also alleviate the progression of pneumonia and tissue repair by modulating macrophage polarization. Specifically, the PROTAC regent is loaded onto the nanoparticles and camouflaged with exosome membranes. Moreover, the magnetic nanoparticles Fe 3 4 51 52 54 We chose PROTAC regent dTRIM24, which can specifically degrade TRIM24 protein, thereby increasing the expression level of STAT6 and promoting the conversion of pro-inflammatory M1-type macrophages into anti-inflammatory M2 ones (Fig. S12), further alleviating the progression of pneumonia and promoting tissue repair. EMPLANT can be considered a safe, efficient, and targeted artificial exosome, which can precisely alleviate lung inflammation and provide a new therapeutic approach for ALI treatment. Currently, research on drug delivery systems based on cell membranes and exosomes has been extensively studied. In this study, exosome membranes were used. On one hand, compared to cell membranes, the use of exosome membranes in this study can further enhance the biocompatibility of nanoparticles and reduce immunogenicity. On the other hand, coating PLGA nanoparticles with exosome membranes can effectively address the limitation of low drug loading capacity in exosome-based drug delivery systems. Moreover, the encapsulation of magnetic nanoparticles into the PLGA nanoparticles enhances their ability to accumulate in the lungs. The camouflage with exosome membranes-derived from macrophages promotes the targeting of nanoparticles to M1 macrophages, thereby improving drug efficacy. Notably, the metabolism of the nanoparticles is closed relative to the safety. EMPLANT is constructed by exosome membrane, magnetic nanoparticles, and PLGA. The exosomes are natural products in the body that can fuse with or be internalized by membranes through direct interaction between exosome surface proteins and cytoplasmic membrane receptors, subsequently releasing their contents [ 55 56 57 Thus, EMPLANT can be considered a safe, efficient, and targeted artificial exosome, which can precisely alleviate lung inflammation and provide a new therapeutic approach for ALI treatment. Conclusion In conclusion, we developed a type of magnetically navigated nano-PROTAC (EMPLANT), which was constructed by using PLGA to load the magnetic nanoparticles and PROTAC regents and further camouflaged with exosome membranes derived from M1 macrophages. EMPLANT can improve the accumulation of PROTAC in the inflammatory lungs of experimental ALI mice under an external magnetic field, and increase the specificity to M1 macrophages, resulting in the reduction of lung injuries and drastic extension of the survival rate in mice effectively. Mechanistically, the degradation of TRIM24 upregulates the expression of STAT6 and thus promotes an efficient phenotypic switch of macrophages from M1 to M2 both in vitro and in vivo. Moreover, EMPLANT shows an improved inhibition of pro-inflammatory cytokines and promotion of anti-inflammatory cytokines over all other versions of PROTAC being tested. Overall, this type of magnetically navigated nano-PROTAC demonstrates a promising therapeutic strategy for injurious pulmonary inflammation through precisely reprogramming macrophages in situ. To the best of our knowledge, we are the first to develop this type of magnetically navigated artificial exosomes to deliver PROTAC and use it for ALI treatment. Supplementary Information  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Sheng Chen, Enen Chen, Jianfen Su and Yingjie Gong have contributed equally to the work. Acknowledgements The work was supported by National Natural Science Foundation of China (32171312, 82072047, and 82170008), Major Project of Guangzhou National Laboratory (GZNL2024A01013), the Guangzhou Science and Technology Project (2024A03J0891, 202201011593, and SL2022A03J00613), Plan on enhancing scientific research in GMU (2025SRP003 and 02-410-2302068XM). We thank for the help from BioRender.com for drawing illustration. Author contributions S. Chen, E. Chen, J. Su, and Y. Gong contributed to the work equally. S. Chen, E. Chen, J. Su, and Y. Gong carried out laboratory research. A. Shen and A. Qin performed the data analysis. A. Shen, S. Tang, and L. Zhang wrote and edited the manuscript. S. Tang and L. Zhang conceived and supervised the work. All authors read and approved the final manuscript. Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate All animal experiments were performed under the approval of the Institutional Authority for Laboratory Animal Care of Guangzhou Medical University (Ethics authorization number GY2023-693). Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Gorman EA O’Kane CM McAuley DF Acute respiratory distress syndrome in adults: diagnosis, outcomes, long-term sequelae, and management Lancet 2022 400 10358 1157 70 10.1016/S0140-6736(22)01439-8 36070788 Gorman EA, O’Kane CM, McAuley DF. Acute respiratory distress syndrome in adults: diagnosis, outcomes, long-term sequelae, and management. Lancet. 2022;400(10358):1157–70. 36070788 10.1016/S0140-6736(22)01439-8 2. Fan E Brodie D Slutsky AS Acute respiratory distress syndrome: advances in diagnosis and treatment JAMA 2018 319 7 698 710 10.1001/jama.2017.21907 29466596 Fan E, Brodie D, Slutsky AS. Acute respiratory distress syndrome: advances in diagnosis and treatment. JAMA. 2018;319(7):698–710. 29466596 10.1001/jama.2017.21907 3. Ma W Tang S Yao P Zhou T Niu Q Liu P Advances in acute respiratory distress syndrome: focusing on heterogeneity, pathophysiology, and therapeutic strategies Signal Transduct Target Ther 2025 10 1 75 10.1038/s41392-025-02127-9 40050633 PMC11885678 Ma W, Tang S, Yao P, Zhou T, Niu Q, Liu P, et al. Advances in acute respiratory distress syndrome: focusing on heterogeneity, pathophysiology, and therapeutic strategies. Signal Transduct Target Ther. 2025;10(1): 75. 40050633 10.1038/s41392-025-02127-9 PMC11885678 4. Bos LDJ Ware LB Acute respiratory distress syndrome: causes, pathophysiology, and phenotypes Lancet 2022 400 10358 1145 56 10.1016/S0140-6736(22)01485-4 36070787 Bos LDJ, Ware LB. Acute respiratory distress syndrome: causes, pathophysiology, and phenotypes. Lancet. 2022;400(10358):1145–56. 36070787 10.1016/S0140-6736(22)01485-4 5. Sun ZC Liao R Xian C Lin R Wang L Fang Y Natural pachypodol integrated, lung targeted and inhaled lipid nanomedicine ameliorates acute lung injury via anti-inflammation and repairing lung barrier J Control Release 2024 375 300 15 10.1016/j.jconrel.2024.09.013 39265826 Sun ZC, Liao R, Xian C, Lin R, Wang L, Fang Y, et al. Natural pachypodol integrated, lung targeted and inhaled lipid nanomedicine ameliorates acute lung injury via anti-inflammation and repairing lung barrier. J Control Release. 2024;375:300–15. 39265826 10.1016/j.jconrel.2024.09.013 6. Xu Y Lv L Wang Q Yao Q Kou L Zhang H Emerging application of nanomedicine-based therapy in acute respiratory distress syndrome Colloids Surf B Biointerfaces 2024 237 113869 10.1016/j.colsurfb.2024.113869 38522285 Xu Y, Lv L, Wang Q, Yao Q, Kou L, Zhang H. Emerging application of nanomedicine-based therapy in acute respiratory distress syndrome. Colloids Surf B Biointerfaces. 2024;237: 113869. 38522285 10.1016/j.colsurfb.2024.113869 7. Matthay MA Zemans RL Zimmerman GA Arabi YM Beitler JR Mercat A Acute respiratory distress syndrome Nat Rev Dis Primers 2019 5 1 18 10.1038/s41572-019-0069-0 30872586 PMC6709677 Matthay MA, Zemans RL, Zimmerman GA, Arabi YM, Beitler JR, Mercat A, et al. Acute respiratory distress syndrome. Nat Rev Dis Primers. 2019;5(1):18. 30872586 10.1038/s41572-019-0069-0 PMC6709677 8. Chen T Zhu G Meng X Zhang X Recent developments of small molecules with anti-inflammatory activities for the treatment of acute lung injury Eur J Med Chem 2020 207 112660 10.1016/j.ejmech.2020.112660 32916382 Chen T, Zhu G, Meng X, Zhang X. Recent developments of small molecules with anti-inflammatory activities for the treatment of acute lung injury. Eur J Med Chem. 2020;207: 112660. 32916382 10.1016/j.ejmech.2020.112660 9. Roquilly A Jacqueline C Davieau M Mollé A Sadek A Fourgeux C Alveolar macrophages are epigenetically altered after inflammation, leading to long-term lung immunoparalysis Nat Immunol 2020 21 6 636 48 10.1038/s41590-020-0673-x 32424365 Roquilly A, Jacqueline C, Davieau M, Mollé A, Sadek A, Fourgeux C, et al. Alveolar macrophages are epigenetically altered after inflammation, leading to long-term lung immunoparalysis. Nat Immunol. 2020;21(6):636–48. 32424365 10.1038/s41590-020-0673-x 10. Chen X Tang J Shuai W Meng J Feng J Han Z Macrophage polarization and its role in the pathogenesis of acute lung injury/acute respiratory distress syndrome Inflamm Res 2020 69 9 883 95 10.1007/s00011-020-01378-2 32647933 PMC7347666 Chen X, Tang J, Shuai W, Meng J, Feng J, Han Z. Macrophage polarization and its role in the pathogenesis of acute lung injury/acute respiratory distress syndrome. Inflamm Res. 2020;69(9):883–95. 32647933 10.1007/s00011-020-01378-2 PMC7347666 11. Liang L Peng W Qin A Zhang J Chen R Zhou D Intracellularly synthesized artificial exosome treats acute lung injury ACS Nano 2024 18 32 21009 23 10.1021/acsnano.4c01900 39087239 Liang L, Peng W, Qin A, Zhang J, Chen R, Zhou D, et al. Intracellularly synthesized artificial exosome treats acute lung injury. ACS Nano. 2024;18(32):21009–23. 39087239 10.1021/acsnano.4c01900 12. Park MD Silvin A Ginhoux F Merad M Macrophages in health and disease Cell 2022 185 23 4259 79 10.1016/j.cell.2022.10.007 36368305 PMC9908006 Park MD, Silvin A, Ginhoux F, Merad M. Macrophages in health and disease. Cell. 2022;185(23):4259–79. 36368305 10.1016/j.cell.2022.10.007 PMC9908006 13. Liang L, Xu W, Shen A, Fu X, Cen H, Wang S et al. Inhibition of YAP1 activity ameliorates acute lung injury through promotion of M2 macrophage polarization. MedComm (2020). 2023, 4(3):e293. 10.1002/mco2.293 PMC10242261 37287755 14. Li X Chen G Zhou X Peng X Li M Chen D Roles of Akirin1 in early prediction and treatment of graft kidney ischemia–reperfusion injury Smart Medicine 2024 3 2 e20230043 10.1002/SMMD.20230043 39188701 PMC11235893 Li X, Chen G, Zhou X, Peng X, Li M, Chen D, et al. Roles of Akirin1 in early prediction and treatment of graft kidney ischemia–reperfusion injury. Smart Medicine. 2024;3(2): e20230043. 39188701 10.1002/SMMD.20230043 PMC11235893 15. Li J Jiang X Li H Gelinsky M Gu Z Tailoring materials for modulation of macrophage fate Adv Mater 2021 33 12 e2004172 10.1002/adma.202004172 33565154 PMC9245340 Li J, Jiang X, Li H, Gelinsky M, Gu Z. Tailoring materials for modulation of macrophage fate. Adv Mater. 2021;33(12): e2004172. 33565154 10.1002/adma.202004172 PMC9245340 16. Chen S Saeed A Liu Q Jiang Q Xu H Xiao GG Macrophages in immunoregulation and therapeutics Signal Transduct Target Ther 2023 8 1 207 10.1038/s41392-023-01452-1 37211559 PMC10200802 Chen S, Saeed A, Liu Q, Jiang Q, Xu H, Xiao GG, et al. Macrophages in immunoregulation and therapeutics. Signal Transduct Target Ther. 2023;8(1): 207. 37211559 10.1038/s41392-023-01452-1 PMC10200802 17. Liu C Xi L Liu Y Mak JCW Mao S Wang Z An inhalable hybrid biomimetic nanoplatform for sequential drug release and remodeling lung immune homeostasis in acute lung injury treatment ACS Nano 2023 17 12 11626 44 10.1021/acsnano.3c02075 37285229 Liu C, Xi L, Liu Y, Mak JCW, Mao S, Wang Z, et al. An inhalable hybrid biomimetic nanoplatform for sequential drug release and remodeling lung immune homeostasis in acute lung injury treatment. ACS Nano. 2023;17(12):11626–44. 37285229 10.1021/acsnano.3c02075 18. Zhu Q Yu T Gan S Wang Y Pei Y Zhao Q TRIM24 facilitates antiviral immunity through mediating K63-linked TRAF3 ubiquitination J Exp Med 2020 217 7 e20192083 10.1084/jem.20192083 32324863 PMC7336305 Zhu Q, Yu T, Gan S, Wang Y, Pei Y, Zhao Q, et al. TRIM24 facilitates antiviral immunity through mediating K63-linked TRAF3 ubiquitination. J Exp Med. 2020;217(7): e20192083. 32324863 10.1084/jem.20192083 PMC7336305 19. Yu T Gan S Zhu Q Dai D Li N Wang H Modulation of M2 macrophage polarization by the crosstalk between Stat6 and Trim24 Nat Commun 2019 10 1 4353 10.1038/s41467-019-12384-2 31554795 PMC6761150 Yu T, Gan S, Zhu Q, Dai D, Li N, Wang H, et al. Modulation of M2 macrophage polarization by the crosstalk between Stat6 and Trim24. Nat Commun. 2019;10(1):4353. 31554795 10.1038/s41467-019-12384-2 PMC6761150 20. Guan X Xu X Tao Y Deng X He L Lin Z Dual targeting and bioresponsive nano-PROTAC induced precise and effective lung cancer therapy J Nanobiotechnol 2024 22 1 692 10.1186/s12951-024-02967-7 PMC11552110 39523308 Guan X, Xu X, Tao Y, Deng X, He L, Lin Z, et al. Dual targeting and bioresponsive nano-PROTAC induced precise and effective lung cancer therapy. J Nanobiotechnol. 2024;22(1):692. 10.1186/s12951-024-02967-7 PMC11552110 39523308 21. Huang JH Huang CJ Yu LN Guan XL Liang SW Li JH Bioinspired PROTAC-induced macrophage fate determination alleviates atherosclerosis Acta Pharmacol Sin 2023 44 10 1962 76 10.1038/s41401-023-01088-5 37169852 PMC10545710 Huang JH, Huang CJ, Yu LN, Guan XL, Liang SW, Li JH, et al. Bioinspired PROTAC-induced macrophage fate determination alleviates atherosclerosis. Acta Pharmacol Sin. 2023;44(10):1962–76. 37169852 10.1038/s41401-023-01088-5 PMC10545710 22. Kalluri R LeBleu VS The biology, function, and biomedical applications of exosomes Science 2020 367 6478 eaau6977 10.1126/science.aau6977 32029601 PMC7717626 Kalluri R, LeBleu VS. The biology, function, and biomedical applications of exosomes. Science. 2020, 367(6478):eaau6977. 10.1126/science.aau6977 32029601 10.1126/science.aau6977 PMC7717626 23. Zhu L Tian W Yuan L Chi C Wang Y Xiao Q Aptamer-based extracellular vesicle isolation, analysis and therapeutics Interdiscip Med 2023 1 2 e20220019 10.1002/INMD.20220019 Zhu L, Tian W, Yuan L, Chi C, Wang Y, Xiao Q, et al. Aptamer-based extracellular vesicle isolation, analysis and therapeutics. Interdiscip Med. 2023;1(2): e20220019. 24. Qiao R Wang H Li D Yang Y Shu J Song X Stevioside protects against acute kidney injury by inhibiting gasdermin D pathway Smart Medicine 2024 3 2 e20240010 10.1002/SMMD.20240010 39188700 PMC11235599 Qiao R, Wang H, Li D, Yang Y, Shu J, Song X, et al. Stevioside protects against acute kidney injury by inhibiting gasdermin D pathway. Smart Medicine. 2024;3(2): e20240010. 39188700 10.1002/SMMD.20240010 PMC11235599 25. Yu D Li Y Wang M Gu J Xu W Cai H Exosomes as a new frontier of cancer liquid biopsy Mol Cancer 2022 21 1 56 10.1186/s12943-022-01509-9 35180868 PMC8855550 Yu D, Li Y, Wang M, Gu J, Xu W, Cai H, et al. Exosomes as a new frontier of cancer liquid biopsy. Mol Cancer. 2022;21(1):56. 35180868 10.1186/s12943-022-01509-9 PMC8855550 26. Liang Y Duan L Lu J Xia J Engineering exosomes for targeted drug delivery Theranostics 2021 11 7 3183 95 10.7150/thno.52570 33537081 PMC7847680 Liang Y, Duan L, Lu J, Xia J. Engineering exosomes for targeted drug delivery. Theranostics. 2021;11(7):3183–95. 33537081 10.7150/thno.52570 PMC7847680 27. Wang J Yuan S Tu Y Lv Z Cheng H Ding X Extracellular vesicles in skin health, diseases, and aging Interdiscip Med 2024 2 e20240011 10.1002/INMD.20240011 Wang J, Yuan S, Tu Y, Lv Z, Cheng H, Ding X. Extracellular vesicles in skin health, diseases, and aging. Interdiscip Med. 2024;2: e20240011. 28. Chavda VP Pandya A Kumar L Raval N Vora LK Pulakkat S Exosome nanovesicles: a potential carrier for therapeutic delivery Nano Today 2023 49 101771 10.1016/j.nantod.2023.101771 Chavda VP, Pandya A, Kumar L, Raval N, Vora LK, Pulakkat S, et al. Exosome nanovesicles: a potential carrier for therapeutic delivery. Nano Today. 2023;49:101771. 29. Gui X Zhang H Zhang R Li Q Zhu W Nie Z Exosomes incorporated with black phosphorus quantum dots attenuate retinal angiogenesis via disrupting glucose metabolism Mater Today Bio 2023 19 100602 10.1016/j.mtbio.2023.100602 36942311 PMC10024194 Gui X, Zhang H, Zhang R, Li Q, Zhu W, Nie Z, et al. Exosomes incorporated with black phosphorus quantum dots attenuate retinal angiogenesis via disrupting glucose metabolism. Mater Today Bio. 2023;19: 100602. 36942311 10.1016/j.mtbio.2023.100602 PMC10024194 30. Wang P Wang H Huang Q Peng C Yao L Chen H Exosomes from M1-polarized macrophages enhance Paclitaxel antitumor activity by activating macrophages-mediated inflammation Theranostics 2019 9 6 1714 27 10.7150/thno.30716 31037133 PMC6485189 Wang P, Wang H, Huang Q, Peng C, Yao L, Chen H, et al. Exosomes from M1-polarized macrophages enhance Paclitaxel antitumor activity by activating macrophages-mediated inflammation. Theranostics. 2019;9(6):1714–27. 31037133 10.7150/thno.30716 PMC6485189 31. Gunassekaran GR Poongkavithai Vadevoo SM Baek MC Lee B M1 macrophage exosomes engineered to foster M1 polarization and target the IL-4 receptor inhibit tumor growth by reprogramming tumor-associated macrophages into M1-like macrophages Biomaterials 2021 278 121137 10.1016/j.biomaterials.2021.121137 34560422 Gunassekaran GR, Poongkavithai Vadevoo SM, Baek MC, Lee B. M1 macrophage exosomes engineered to foster M1 polarization and target the IL-4 receptor inhibit tumor growth by reprogramming tumor-associated macrophages into M1-like macrophages. Biomaterials. 2021;278:121137. 34560422 10.1016/j.biomaterials.2021.121137 32. Du T Yang CL Ge MR Liu Y Zhang P Li H M1 macrophage derived exosomes aggravate experimental autoimmune neuritis via modulating Th1 response Front Immunol 2020 11 1603 10.3389/fimmu.2020.01603 32793234 PMC7390899 Du T, Yang CL, Ge MR, Liu Y, Zhang P, Li H, et al. M1 macrophage derived exosomes aggravate experimental autoimmune neuritis via modulating Th1 response. Front Immunol. 2020;11:1603. 32793234 10.3389/fimmu.2020.01603 PMC7390899 33. Liu C Zhang W Li Y Chang J Tian F Zhao F Microfluidic sonication to assemble exosome membrane-coated nanoparticles for immune evasion-mediated targeting Nano Lett 2019 19 11 7836 44 10.1021/acs.nanolett.9b02841 31597431 Liu C, Zhang W, Li Y, Chang J, Tian F, Zhao F, et al. Microfluidic sonication to assemble exosome membrane-coated nanoparticles for immune evasion-mediated targeting. Nano Lett. 2019;19(11):7836–44. 31597431 10.1021/acs.nanolett.9b02841 34. Zhang H Mao Y Nie Z Li Q Wang M Cai C Iron oxide nanoparticles engineered macrophage-derived exosomes for targeted pathological angiogenesis therapy ACS Nano 2024 18 7644 55 10.1021/acsnano.4c00699 38412252 PMC10938920 Zhang H, Mao Y, Nie Z, Li Q, Wang M, Cai C, et al. Iron oxide nanoparticles engineered macrophage-derived exosomes for targeted pathological angiogenesis therapy. ACS Nano. 2024;18:7644–55. 38412252 10.1021/acsnano.4c00699 PMC10938920 35. Lin Y Guan X Su J Chen S Fu X Xu X Cell membrane-camouflaged nanoparticles mediated nucleic acids delivery Int J Nanomedicine 2023 18 8001 21 10.2147/IJN.S433737 38164266 PMC10758188 Lin Y, Guan X, Su J, Chen S, Fu X, Xu X, et al. Cell membrane-camouflaged nanoparticles mediated nucleic acids delivery. Int J Nanomedicine. 2023;18:8001–21. 38164266 10.2147/IJN.S433737 PMC10758188 36. Li H Li S Lin Y Chen S Yang L Huang X Artificial exosomes mediated spatiotemporal-resolved and targeted delivery of epigenetic inhibitors J Nanobiotechnol 2021 19 1 364 10.1186/s12951-021-01107-9 PMC8597284 34789273 Li H, Li S, Lin Y, Chen S, Yang L, Huang X, et al. Artificial exosomes mediated spatiotemporal-resolved and targeted delivery of epigenetic inhibitors. J Nanobiotechnol. 2021;19(1):364. 10.1186/s12951-021-01107-9 PMC8597284 34789273 37. Lan Q Liu C Yang F Liu S Xu J Sun D Synthesis of bilayer oleic acid-coated Fe 3 4 J Colloid Interface Sci 2007 310 1 260 9 10.1016/j.jcis.2007.01.081 17382339 Lan Q, Liu C, Yang F, Liu S, Xu J, Sun D. Synthesis of bilayer oleic acid-coated Fe 3 4 17382339 10.1016/j.jcis.2007.01.081 38. Zhang D Teng KX Zhao L Niu LY Yang QZ Ultra-small nano-assemblies as tumor-targeted and renal clearable theranostic agent for photodynamic therapy Adv Mater 2023 35 19 e2209789 10.1002/adma.202209789 36861334 Zhang D, Teng KX, Zhao L, Niu LY, Yang QZ. Ultra-small nano-assemblies as tumor-targeted and renal clearable theranostic agent for photodynamic therapy. Adv Mater. 2023;35(19): e2209789. 36861334 10.1002/adma.202209789 39. Zoulikha M, Xiao Q, Boafo GF, Sallam MA, Chen Z, He W. Pulmonary delivery of SiRNA against acute lung injury/acute respiratory distress syndrome. Acta Pharm Sin B. 2022;12(2):600–20. 10.1016/j.apsb.2021.08.009 PMC8359643 34401226 40. Martin TR Zemans RL Ware LB Schmidt EP Riches DWH Bastarache L New insights into clinical and mechanistic heterogeneity of the acute respiratory distress syndrome: summary of the Aspen Lung Conference 2021 Am J Respir Cell Mol Biol 2022 67 3 284 308 10.1165/rcmb.2022-0089WS 35679511 PMC9447141 Martin TR, Zemans RL, Ware LB, Schmidt EP, Riches DWH, Bastarache L, et al. New insights into clinical and mechanistic heterogeneity of the acute respiratory distress syndrome: summary of the Aspen Lung Conference 2021. Am J Respir Cell Mol Biol. 2022;67(3):284–308. 35679511 10.1165/rcmb.2022-0089WS PMC9447141 41. Qiao Q Liu X Yang T Cui K Kong L Yang C Nanomedicine for acute respiratory distress syndrome: the latest application, targeting strategy, and rational design Acta Pharm Sin B 2021 11 10 3060 91 10.1016/j.apsb.2021.04.023 33977080 PMC8102084 Qiao Q, Liu X, Yang T, Cui K, Kong L, Yang C, et al. Nanomedicine for acute respiratory distress syndrome: the latest application, targeting strategy, and rational design. Acta Pharm Sin B. 2021;11(10):3060–91. 33977080 10.1016/j.apsb.2021.04.023 PMC8102084 42. Liao R Sun ZC Wang L Xian C Lin R Zhuo G Inhalable and bioactive lipid-nanomedicine based on Bergapten for targeted acute lung injury therapy via orchestrating macrophage polarization Bioact Mater 2025 43 406 22 39411684 10.1016/j.bioactmat.2024.09.020 PMC11474395 Liao R, Sun ZC, Wang L, Xian C, Lin R, Zhuo G, et al. Inhalable and bioactive lipid-nanomedicine based on Bergapten for targeted acute lung injury therapy via orchestrating macrophage polarization. Bioact Mater. 2025;43:406–22. 39411684 10.1016/j.bioactmat.2024.09.020 PMC11474395 43. Békés M Langley DR Crews CM Protac targeted protein degraders: the past is prologue Nat Rev Drug Discov 2022 21 3 181 200 10.1038/s41573-021-00371-6 35042991 PMC8765495 Békés M, Langley DR, Crews CM. Protac targeted protein degraders: the past is prologue. Nat Rev Drug Discov. 2022;21(3):181–200. 35042991 10.1038/s41573-021-00371-6 PMC8765495 44. Huang J Yao Z Li B Ping Y Targeted delivery of PROTAC-based prodrug activated by bond-cleavage bioorthogonal chemistry for microneedle-assisted cancer therapy J Control Release 2023 361 270 9 10.1016/j.jconrel.2023.07.062 37541594 Huang J, Yao Z, Li B, Ping Y. Targeted delivery of PROTAC-based prodrug activated by bond-cleavage bioorthogonal chemistry for microneedle-assisted cancer therapy. J Control Release. 2023;361:270–9. 37541594 10.1016/j.jconrel.2023.07.062 45. Yang L Yang Y Zhang J Li M Yang L Wang X Sequential responsive nano-PROTACs for precise intracellular delivery and enhanced degradation efficacy in colorectal cancer therapy Signal Transduct Target Ther 2024 9 1 275 10.1038/s41392-024-01983-1 39419977 PMC11486899 Yang L, Yang Y, Zhang J, Li M, Yang L, Wang X, et al. Sequential responsive nano-PROTACs for precise intracellular delivery and enhanced degradation efficacy in colorectal cancer therapy. Signal Transduct Target Ther. 2024;9(1): 275. 39419977 10.1038/s41392-024-01983-1 PMC11486899 46. Zhang HT Peng R Chen S Shen A Zhao L Tang W Versatile nano-PROTAC-induced epigenetic reader degradation for efficient lung cancer therapy Adv Sci 2022 9 29 e2202039 10.1002/advs.202202039 PMC9561860 35988145 Zhang HT, Peng R, Chen S, Shen A, Zhao L, Tang W, et al. Versatile nano-PROTAC-induced epigenetic reader degradation for efficient lung cancer therapy. Adv Sci. 2022;9(29):e2202039. 10.1002/advs.202202039 PMC9561860 35988145 47. Zhang Y Liu Q Zhang X Huang H Tang S Chai Y Recent advances in exosome-mediated nucleic acid delivery for cancer therapy J Nanobiotechnol 2022 20 1 279 10.1186/s12951-022-01472-z PMC9194774 35701788 Zhang Y, Liu Q, Zhang X, Huang H, Tang S, Chai Y, et al. Recent advances in exosome-mediated nucleic acid delivery for cancer therapy. J Nanobiotechnol. 2022;20(1):279. 10.1186/s12951-022-01472-z PMC9194774 35701788 48. Duan L Xu L Xu X Qin Z Zhou X Xiao Y Exosome-mediated delivery of gene vectors for gene therapy Nanoscale 2021 13 3 1387 97 10.1039/D0NR07622H 33350419 Duan L, Xu L, Xu X, Qin Z, Zhou X, Xiao Y, et al. Exosome-mediated delivery of gene vectors for gene therapy. Nanoscale. 2021;13(3):1387–97. 33350419 10.1039/d0nr07622h 49. Zhang L Lin Y Li S Guan X Jiang X In situ reprogramming of tumor-associated macrophages with internally and externally engineered exosomes Angew Chem Int Ed 2023 62 11 e202217089 10.1002/anie.202217089 36658634 Zhang L, Lin Y, Li S, Guan X, Jiang X. In situ reprogramming of tumor-associated macrophages with internally and externally engineered exosomes. Angew Chem Int Ed. 2023;62(11): e202217089. 10.1002/anie.202217089 36658634 50. Lin Y, Yi M, Guan X, Chen E, Yang L, Li S, et al. Two birds with one stone strategy for the lung cancer therapy with bioinspired AIE aggregates. J Nanobiotechnol. 2023;21(1):49. 10.1186/s12951-023-01799-1 PMC9912660 36759822 51. Tian Y Han W Yeung KL Magnetic microsphere scaffold-based soft microbots for targeted mesenchymal stem cell delivery Small 2023 19 32 e2300430 10.1002/smll.202300430 37058085 Tian Y, Han W, Yeung KL. Magnetic microsphere scaffold-based soft microbots for targeted mesenchymal stem cell delivery. Small. 2023;19(32): e2300430. 37058085 10.1002/smll.202300430 52. Li N Fei P Tous C Rezaei Adariani M Hautot ML Ouedraogo I Human-scale navigation of magnetic microrobots in hepatic arteries Sci Robot 2024 9 87 eadh8702 10.1126/scirobotics.adh8702 38354257 Li N, Fei P, Tous C, Rezaei Adariani M, Hautot ML, Ouedraogo I, et al. Human-scale navigation of magnetic microrobots in hepatic arteries. Sci Robot. 2024;9(87): eadh8702. 38354257 10.1126/scirobotics.adh8702 53. Chen J Ren T Xie L Hu H Li X Maitusong M Enhancing aortic valve drug delivery with PAR2-targeting magnetic nano-cargoes for calcification alleviation Nat Commun 2024 15 1 557 10.1038/s41467-024-44726-0 38228638 PMC10792006 Chen J, Ren T, Xie L, Hu H, Li X, Maitusong M, et al. Enhancing aortic valve drug delivery with PAR2-targeting magnetic nano-cargoes for calcification alleviation. Nat Commun. 2024;15(1):557. 38228638 10.1038/s41467-024-44726-0 PMC10792006 54. Zhang H Li Z Gao C Fan X Pang Y Li T Dual-responsive biohybrid neutrobots for active target delivery Sci Robot 2021 6 52 eaaz9519 10.1126/scirobotics.aaz9519 34043546 Zhang H, Li Z, Gao C, Fan X, Pang Y, Li T, et al. Dual-responsive biohybrid neutrobots for active target delivery. Sci Robot. 2021;6(52): eaaz9519. 34043546 10.1126/scirobotics.aaz9519 55. Mathieu M Martin-Jaular L Lavieu G Théry C Specificities of secretion and uptake of exosomes and other extracellular vesicles for cell-to-cell communication Nat Cell Biol 2019 21 1 9 17 10.1038/s41556-018-0250-9 30602770 Mathieu M, Martin-Jaular L, Lavieu G, Théry C. Specificities of secretion and uptake of exosomes and other extracellular vesicles for cell-to-cell communication. Nat Cell Biol. 2019;21(1):9–17. 30602770 10.1038/s41556-018-0250-9 56. Nowak-Jary J Machnicka B Pharmacokinetics of magnetic iron oxide nanoparticles for medical applications J Nanobiotechnol 2022 20 1 305 10.1186/s12951-022-01510-w PMC9235206 35761279 Nowak-Jary J, Machnicka B. Pharmacokinetics of magnetic iron oxide nanoparticles for medical applications. J Nanobiotechnol. 2022;20(1):305. 10.1186/s12951-022-01510-w PMC9235206 35761279 57. Zhao D Zhu T Li J Cui L Zhang Z Zhuang X Ding J Poly(lactic-co-glycolic acid)-based composite bone-substitute materials Bioact Mater 2021 6 2 346 60 32954053 10.1016/j.bioactmat.2020.08.016 PMC7475521 Zhao D, Zhu T, Li J, Cui L, Zhang Z, Zhuang X, Ding J. Poly(lactic-co-glycolic acid)-based composite bone-substitute materials. Bioact Mater. 2021;6(2):346–60. 32954053 10.1016/j.bioactmat.2020.08.016 PMC7475521 ",
  "metadata": {
    "Title of this paper": "Poly(lactic-co-glycolic acid)-based composite bone-substitute materials",
    "Journal it was published in:": "Journal of Nanobiotechnology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486976/"
  }
}