{
  "title": "Paper_155",
  "abstract": "J Aerosol Med Pulm Drug Deliv J Aerosol Med Pulm Drug Deliv 1146 jamp jamp Journal of Aerosol Medicine and Pulmonary Drug Delivery 1941-2711 1941-2703 Mary Ann Liebert, Inc. PMC11502635 PMC11502635.1 11502635 11502635 39388691 10.1089/jamp.2024.0016 10.1089/jamp.2024.0016 1 Review Articles Current Overview of the Biology and Pharmacology in Sugen/Hypoxia-Induced Pulmonary Hypertension in Rats CORBOZ ET AL. THE SUGEN 5416/HYPOXIA RAT MODEL FOR PULMONARY HYPERTENSION Corboz Michel R. PhD https://orcid.org/0000-0002-3034-8134 Nguyen Tam L. PhD Stautberg Andy PhD Cipolla David PhD Perkins Walter R. PhD Chapman Richard W. PhD  * Insmed Incorporated, Bridgewater, New Jersey, USA. Address correspondence to: Michel R. Corboz, PhD, Insmed Incorporated, 202/206 North, Bridgewater, NJ 08807, USA Michel.corboz@insmed.com  * Deceased. i https://orcid.org/0000-0002-3034-8134 10 2024 03 10 2024 37 5 473513 241 283 03 4 2024 Received on April 03, 2024 03 7 2024 in final form, July 03, 2024 03 10 2025 03 10 2025 26 10 2024 03 10 2025 Copyright 2024, Mary Ann Liebert, Inc., publishers 2024 Mary Ann Liebert, Inc., publishers Abstract The Sugen 5416/hypoxia (Su/Hx) rat model of pulmonary arterial hypertension (PAH) demonstrates most of the distinguishing features of PAH in humans, including increased wall thickness and obstruction of the small pulmonary arteries along with plexiform lesion formation. Recently, significant advancement has been made describing the epidemiology, genomics, biochemistry, physiology, and pharmacology in Su/Hx challenge in rats. For example, there are differences in the overall reactivity to Su/Hx challenge in different rat strains and only female rats respond to estrogen treatments. These conditions are also encountered in human subjects with PAH. Also, there is a good translation in both the biochemical and metabolic pathways in the pulmonary vasculature and right heart between Su/Hx rats and humans, particularly during the transition from the adaptive to the nonadaptive phase of right heart failure. Noninvasive techniques such as echocardiography and magnetic resonance imaging have recently been used to evaluate the progression of the pulmonary vascular and cardiac hemodynamics, which are important parameters to monitor the efficacy of drug treatment over time. From a pharmacological perspective, most of the compounds approved clinically for the treatment of PAH are efficacious in Su/Hx rats. Several compounds that show efficacy in Su/Hx rats have advanced into phase II/phase III studies in humans with positive results. Results from these drug trials, if successful, will provide additional treatment options for patients with PAH and will also further validate the excellent translation that currently exists between Su/Hx rats and the human PAH condition. current and novel therapies for PAH PAH pathogenesis pulmonary arterial pressure (PAH) Sugen 5416/hypoxia rat model translation between the Su/Hx rat model and human PAH pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Current Overview of the Biology and Pharmacology in Sugen/Hypoxia-Induced Pulmonary Hypertension in Rats",
    "Journal it was published in:": "Journal of Aerosol Medicine and Pulmonary Drug Delivery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11502635/"
  }
}