{
  "title": "Paper_1064",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12474900 PMC12474900.1 12474900 12474900 41006573 10.1038/s41598-025-17982-3 17982 1 Article Discovery of novel disulfide-containing PD-1/PD-L1 inhibitor with in vivo influenza therapeutic efficacy Hirata Yoshiyuki 1 Hayashi Kyoko 2 Kato Takuma 1 Nagaoka Yasuo 3 Doi Mitsunobu 1 Uesato Shinichi shinichi.uesato@ompu.ac.jp 1 1 https://ror.org/01y2kdt21 grid.444883.7 0000 0001 2109 9431 Faculty of Pharmacy, Osaka Medical and Pharmaceutical University, 2 https://ror.org/02sps0775 grid.254217.7 0000 0000 8868 2202 College of Life and Health Sciences, Chubu University, 3 https://ror.org/03xg1f311 grid.412013.5 0000 0001 2185 3035 Faculty of Chemistry, Materials and Bioengineering, Kansai University, 26 9 2025 2025 15 478255 32998 9 4 2025 28 8 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Monoclonal antibody-based immune checkpoint inhibitors, which have brought breakthrough effects in cancer treatments, are expected to assist in the treatment of viral diseases. However, antibody therapies may cause immune-related side effects, such as inflammation and pneumonia, due to cytokine storms. Small-molecule PD-1/PD-L1 inhibitors are an alternative to monoclonal antibody-based therapeutics. We have identified a novel small-molecule PD-1/PD-L1 inhibitor having a functional group (disulfide group), namely compound 2 2 D 2 2 2 2 2 Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-17982-3. Subject terms Drug discovery and development Pharmacology Screening Structure-based drug design pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Antagonistic substances against immune checkpoint proteins, such as programmed cell death 1 (PD-1), programmed cell death-ligand 1 (PD-L1), and cytotoxic T-lymphocyte-associated protein 4 (CTLA4), were initially developed as anticancer treatments because cancers exploit these proteins to evade detection by the immune system. To date, eight monoclonal antibodies (anti-PD-1 antibodies: nivolumab, pembrolizumab, and cemiplimab; anti-PD-L1 antibodies: atezolizumab, avelumab, and durvalumab; anti-CTLA4 antibodies: ipilimumab and tremelimumab) have been approved by the U.S. Food and Drug Administration 1 12 13 14 15 16 17 18 19 20 21 23 21 23 24 28 29 30 31 We previously hypothesized that some thiol- or disulfide-containing compounds can disrupt protein–protein interactions (PPIs) by binding to the cysteine-cysteine disulfide or cysteine-thiol of proteins, respectively, via 8 In this study, we searched for new PD-1/PD-L1 binding inhibitors from our library of sulfur-based and related compounds, aiming to perform oral administration experiments using mice pre-infected with influenza virus (IFV). The screening for PD-1/PD-L1 inhibitors by ELISA led to the identification of 2-benzamido diphenyl disulfide ( 2 50 50 33 38 2 D 2 2 2 Results Identification of new type of PD-1/PD-L1 inhibitor 2 by ELISA analysis For the first screening, we assessed the inhibition effect of the dimeric disulfide compounds ( 1 2 3 4a e 5 6 7 8 9 10 1 Methods 1 2 4a 3 8 4b d 2 5 2 6 6 2 2 6 2 5 11 6 12 13 8 14 15 2 16 17 18 1 Fig. 1 Screening of sulfur-containing compounds for the inhibition of PD-1/PD-L1 interaction by ELISA. ( A B C p p versus Fig. 2 Characterization of the PD-1/PDL1 interaction inhibitors by SPR. ( A B C 2 D 2 As shown in Fig. 1 2 2 Determination of the binding preference of compound 2 to PD-L1 over PD-1 by surface plasmon resonance (SPR) Subsequently, we performed SPR to confirm the above results 39 41 2 2 2 2 2 2 2 2 2 D 2 versus 2 2 T-cell activation recovery assay To evaluate the capability of 2 2 5 11 3 2 5 11 3 2 2 3 2 2 2 3 2 Fig. 3 Effect of 2 A p p versus B C B C p p versus Docking simulation of BMS-202 and compound 2 into the PD-L1 dimer As shown in Fig. 4 2 2 PDB: 5J89 21 4 C D 21 C C C + 2 C 2 4 C C 2 D 42 2 C 2 D 4 Fig. 4 Docking diagram of BMS-202 and compound 2 A 2 B C 2 D 2 where BMS-202 (magenta) and 2 2 D 2 16 2 2 D Oral administration of compound 2, 7, and oseltamivir to mice with IFV (A/NWS/33, H1N1 subtype) We orally administered 2 7 2 7 2 7 5 2 7 p p p 5 5 2 5 5 p 7 Fig. 5 Effects of 2 7 A B 5 p p versus C D p versus E p versus In vitro In order to investigate the possibility that the influenza therapeutic effect of compound 2 in vitro 2 50 2 50 2 50 50 Discussion The ELISA and SPR assays demonstrated that 2 2 2 2 D 2 2 The oral administration of 2 43 44 15 18 19 20 2 in vitro 2 2 2 2 2 45 2 2 17 46 48 Small molecule immune checkpoint inhibitors are generally less effective than antibody drugs, and there are concerns about side effects due to off-target effects, making their development difficult. However, some small molecule drugs having multiple mechanisms of action on the market are referred to as “dirty drugs,” and are actually more effective than drugs with a single mechanism. Since small molecule immune checkpoint inhibitors are expected to possess many advantages compared to the antibody drugs as described at the beginning, they might have a potential to be used as medicines particularly for early symptoms of diseases. For example, they might be developed as medicines for early symptoms of coronavirus infection and influenza virus infection as described above, because their efficacies are somewhat milder than those of the antibody drugs. Compound 2 49 53 49 51 Methods Ethics statement Committees from the Faculty of Pharmacy, Osaka Medical and Pharmaceutical University, and Faculty of Chemistry, Materials and Bioengineering, Kansai University approved the experimental protocols. All animal experiments were performed in accordance with the animal experimentation guidelines of Chubu University and were approved by the Animal Care Committee of Chubu University (permission number: 3010057). All infections and sample collections were conducted under anesthesia with sodium pentobarbital (50 mg/kg), and human endpoints were used during the study, that is, animals with > 20% weight loss within 2 days were sacrificed using sodium pentobarbital treatment (150 mg/kg). The results were reported in accordance with ARRIVE guidelines. No side effects such as diarrhea were observed due to drug administration throughout the experiments. General procedures BMS-1 and BMS-1166 were purchased from Cayman Chemical (MI, USA), and CA-170 was purchased from MedChem Express (NJ, USA). We described the synthetic methods of compounds 1 3 6 8 17 32 Cells and virus MDCK cells and IFV (A/NWS/33, H1N1 subtype) were obtained from Denka Seiken Co., Ltd. (Tokyo, Japan). The cells were grown in minimum essential medium (MEM) supplemented with 5% fetal bovine serum, 100 units/mL penicillin G and 100 mg/mL streptomycin. Jurkat cells (E6-1) and MDA-MB-231cells were purchased from American Type Culture Collection (ATCC). Biotinylation of PD-1 We biotinylated the PD-1 Fc Chimera using a CromaLink ® 54 PD-1/PD-L1 inhibition assay with ELISA We treated Ni-coated 96-well plates (Thermo Scientific Pierce, MA, USA) with 0.25 μM/100 μL/well of His-tagged PD-L1 and washed them using Tris-buffered saline with Tween 20 (TBS-T) (pH 7.2). We plotted standard curves using the wells with 0–1.0 μM/mL biotinylated PD-1 Fc Chimera in each plate. We diluted the test compounds or BMS-1 (all at 10 mM in DMSO) in 20% Blocking One (Nacalai Tesque, Kyoto, Japan) to reach 100 μM. Next, we placed the mixture (100 μL) of the compound (10 μL, final concentration: 10 μM) and PD-1 (90 μL, final concentration: 0.25 μM) into the 96-well plate with His-tagged PD-L1. After incubation for 1 h, we washed the plate with TBST (pH 7.2) and detected bound PD-1 by adding streptavidin-HRP (R&D Systems, MN, USA) and then colorizing with a TMB solution (Nacalai Tesque, Kyoto, Japan) in a conventional manner. We calculated percentage binding ratios by diving the absorbance at 450 nm obtained from the co-incubation of PD-1/PD-L1 and test compound by the absorbance obtained from the incubation of these proteins alone. SPR analysis We performed the binding assay of PD-L1 and PD-1 and evaluated the inhibition of the PD-L1 and PD-1 interaction using a Biacore T200 system with a Sensor Chip CM5 (Cytiva, MA, USA). We injected His-tagged PD-L1 (final concentration: 1.0 μM) in sodium acetate buffer (pH 4.0) through a ligand cell to allow immobilization on the Sensor Chip CM5 by condensation between -COOH and NH 2 N- + 2 2 2 D Effects of BMS-1, CA-170, BMS-1166, 2, 5, and 11 on the viability of Jurkat (E6-1) and MDA-MB-231 cells We seeded Jurkat (E6-1) (4 × 10 4 4 T cell activation recovery assay We cultured Jurkat (E6-1) cells in RPMI 1640 Medium (Nacalai Tesque, Kyoto, Japan) supplemented with 10% fetal bovine serum (FBS) (Sigma-Aldrich, MO, USA) and 0.5% penicillin/streptomycin at 37 °C in a 95% air and 5% CO 2 6 7 4 4 In the same way, we tested the cytokine levels in MDA-MB-231 and anti-CD3/CD28-activated Jurkat (E6-1) cell culture solutions, respectively, without or with a test compound. Molecular docking As a PD-L1 structure reference, we used the X-ray data of BMS-202 co-crystallized with PD-L1 ( PDB: 5J89 2 Mouse experiments Female BALB/c mice (5–6 weeks old) were purchased from Japan SLC (Shizuoka, Japan). On day 0, mice (n = 10 per group) were intranasally infected with 2 × 10 4 2 7 55 In vitro anti-IFV assays Compound 2 2 2 4 2 50 2 50 2 50 50 Statistical analysis Data are expressed as the mean ± standard deviation. We compared the samples with the control using student’s t Reporting summary Further information on the research design is available in the Nature Reporting Summary linked to this article. Supplementary Information  Supplementary Information. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We thank MS Hinata Nishino and BS He Zhaoyang at Kansai University for their assistance with the ELISA measurements, synthesis of some inhibitors, and measurement of NMR and MS spectra. We also thank Dr. Yasuyuki Kawaratani and MS Akinori Kozatani at Kansai University for their support in constructing the sulfur-containing compound library. Author contributions S.U. and Y.H. contributed equally to this work. S.U. supervised the entire study and drafted the manuscript. S.U., Y.H., Y.N., K.H., T.K., and M.D. interpreted data and approved the final manuscript. S.U. designed and supervised the synthesis of the evaluated compounds. Y.H. performed all in vitro assays. K.H. performed the in vivo virus infection experiments. T.K. and M.D. conducted the molecular docking simulations. Data availability The data generated or analyzed during this study are included in this published article and its supplementary information files. The data are available upon request from the corresponding author. Declarations Competing interests The authors declare no competing interests. References 1. Sui X The anticancer immune response of anti-PD-1/PD-L1 and the genetic determinants of response to anti-PD-1/PD-L1 antibodies in cancer patients Oncotarget 2015 6 19393 19404 10.18632/oncotarget.5107 26305724 PMC4637293 Sui, X. et al. The anticancer immune response of anti-PD-1/PD-L1 and the genetic determinants of response to anti-PD-1/PD-L1 antibodies in cancer patients. Oncotarget 6 26305724 10.18632/oncotarget.5107 PMC4637293 2. Brahmer JR Safety and activity of anti–PD-L1 antibody in patients with advanced cancer N. Engl. J. Med. 2012 366 2455 2465 10.1056/NEJMoa1200694 22658128 PMC3563263 Brahmer, J. R. et al. Safety and activity of anti–PD-L1 antibody in patients with advanced cancer. N. Engl. J. Med. 366 22658128 10.1056/NEJMoa1200694 PMC3563263 3. Topalian SL Safety, activity, and immune correlates of anti–PD-1 antibody in cancer N. Engl. J. Med. 2012 366 2443 2454 10.1056/NEJMoa1200690 22658127 PMC3544539 Topalian, S. L. et al. Safety, activity, and immune correlates of anti–PD-1 antibody in cancer. N. Engl. J. Med. 366 22658127 10.1056/NEJMoa1200690 PMC3544539 4. Sharma P Allison JP Immune checkpoint targeting in cancer therapy: Toward combination strategies with curative potential Cell 2015 161 205 214 10.1016/j.cell.2015.03.030 25860605 PMC5905674 Sharma, P. & Allison, J. P. Immune checkpoint targeting in cancer therapy: Toward combination strategies with curative potential. Cell 161 25860605 10.1016/j.cell.2015.03.030 PMC5905674 5. Topalian SL Drake CG Pardoll DM Immune checkpoint blockade: A common denominator approach to cancer therapy Cancer Cell 2015 27 450 461 10.1016/j.ccell.2015.03.001 25858804 PMC4400238 Topalian, S. L., Drake, C. G. & Pardoll, D. M. Immune checkpoint blockade: A common denominator approach to cancer therapy. Cancer Cell 27 25858804 10.1016/j.ccell.2015.03.001 PMC4400238 6. Mahoney KM Rennert PD Freeman GJ Combination cancer immunotherapy and new immunomodulatory targets Nat. Rev. Drug Discov. 2015 14 561 584 10.1038/nrd4591 26228759 Mahoney, K. M., Rennert, P. D. & Freeman, G. J. Combination cancer immunotherapy and new immunomodulatory targets. Nat. Rev. Drug Discov. 14 26228759 10.1038/nrd4591 7. Patnaik A Phase I study of pembrolizumab (MK-3475; anti–PD-1 monoclonal antibody) in patients with advanced solid tumors Clin. Cancer Res. 2015 21 4286 4293 10.1158/1078-0432.CCR-14-2607 25977344 Patnaik, A. et al. Phase I study of pembrolizumab (MK-3475; anti–PD-1 monoclonal antibody) in patients with advanced solid tumors. Clin. Cancer Res. 21 25977344 10.1158/1078-0432.CCR-14-2607 8. Khalil DN The future of cancer treatment: Immunomodulation, CARs and combination immunotherapy Nat. Rev. Clin. Oncol. 2016 13 273 290 10.1038/nrclinonc.2016.25 26977780 PMC5551685 Khalil, D. N. et al. The future of cancer treatment: Immunomodulation, CARs and combination immunotherapy. Nat. Rev. Clin. Oncol. 13 26977780 10.1038/nrclinonc.2016.25 PMC5551685 9. Hoos A Development of immuno-oncology drugs—From CTLA4 to PD1 to the next generations Nat. Rev. Drug Discov. 2016 15 235 247 10.1038/nrd.2015.35 26965203 Hoos, A. Development of immuno-oncology drugs—From CTLA4 to PD1 to the next generations. Nat. Rev. Drug Discov. 15 26965203 10.1038/nrd.2015.35 10. Vanella V PD-L1 Inhibitors in the pipeline: Promise and progress Oncoimmunology 2017 7 e1365209 10.1080/2162402X.2017.1365209 29296516 PMC5739559 Vanella, V. et al. PD-L1 Inhibitors in the pipeline: Promise and progress. Oncoimmunology 7 29296516 10.1080/2162402X.2017.1365209 PMC5739559 11. Yang J Hu L Immunomodulators targeting the PD-1/PD-L1 protein-protein interaction: From antibodies to small molecules Med. Res. Rev. 2019 39 265 301 10.1002/med.21530 30215856 Yang, J. & Hu, L. Immunomodulators targeting the PD-1/PD-L1 protein-protein interaction: From antibodies to small molecules. Med. Res. Rev. 39 30215856 10.1002/med.21530 12. Patel TH FDA approval summary: Tremelimumab in combination with durvalumab for the treatment of patients with unresectable hepatocellular carcinoma Clin. Cancer Res. 2024 30 269 273 10.1158/1078-0432.CCR-23-2124 37676259 PMC10841291 Patel, T. H. et al. FDA approval summary: Tremelimumab in combination with durvalumab for the treatment of patients with unresectable hepatocellular carcinoma. Clin. Cancer Res. 30 37676259 10.1158/1078-0432.CCR-23-2124 PMC10841291 13. Joller N LAG-3, TIM-3, and TIGIT: Distinct functions in immune regulation Immunity 2024 57 206 222 10.1016/j.immuni.2024.01.010 38354701 PMC10919259 Joller, N. et al. LAG-3, TIM-3, and TIGIT: Distinct functions in immune regulation. Immunity 57 38354701 10.1016/j.immuni.2024.01.010 PMC10919259 14. Cai L Targeting LAG-3, TIM-3, and TIGIT for cancer immunotherapy J Hematol. Oncol. 2023 16 101 10.1186/s13045-023-01499-1 37670328 PMC10478462 Cai, L. et al. Targeting LAG-3, TIM-3, and TIGIT for cancer immunotherapy. J Hematol. Oncol. 16 37670328 10.1186/s13045-023-01499-1 PMC10478462 15. McNally B Local blockade of epithelial PDL-1 in the airways enhances T cell function and viral clearance during influenza virus infection J. Virol. 2013 87 12916 12924 10.1128/JVI.02423-13 24067957 PMC3838157 McNally, B. et al. Local blockade of epithelial PDL-1 in the airways enhances T cell function and viral clearance during influenza virus infection. J. Virol. 87 24067957 10.1128/JVI.02423-13 PMC3838157 16. Boumaza X Progressive multifocal leukoencephalopathy treated by immune checkpoint inhibitors Ann. Neurol. 2023 93 257 270 10.1002/ana.26512 36151879 PMC10092874 Boumaza, X. et al. Progressive multifocal leukoencephalopathy treated by immune checkpoint inhibitors. Ann. Neurol. 93 36151879 10.1002/ana.26512 PMC10092874 17. Wykes MN Lewin SR Immune checkpoint blockade in infectious diseases Nat. Rev. Immunol. 2018 18 91 104 10.1038/nri.2017.112 28990586 PMC5991909 Wykes, M. N. & Lewin, S. R. Immune checkpoint blockade in infectious diseases. Nat. Rev. Immunol. 18 28990586 10.1038/nri.2017.112 PMC5991909 18. Xiao W PD-1/PD-L1 signal pathway participates in HCV F protein-induced T cell dysfunction in chronic HCV infection Immunol. Res. 2016 64 412 423 10.1007/s12026-015-8680-y 26286967 Xiao, W. et al. PD-1/PD-L1 signal pathway participates in HCV F protein-induced T cell dysfunction in chronic HCV infection. Immunol. Res. 64 26286967 10.1007/s12026-015-8680-y 19. Jarczak D Nierhaus A Cytokine storm—Definition, causes, and implications Int. J. Mol. Sci. 2022 23 11740 10.3390/ijms231911740 36233040 PMC9570384 Jarczak, D. & Nierhaus, A. Cytokine storm—Definition, causes, and implications. Int. J. Mol. Sci. 23 36233040 10.3390/ijms231911740 PMC9570384 20. Choi J Lee SY Clinical characteristics and treatment of immune-related adverse events of immune checkpoint inhibitors Immune. Netw. 2020 20 1 21 10.4110/in.2020.20.e9 PMC7049586 32158597 Choi, J. & Lee, S. Y. Clinical characteristics and treatment of immune-related adverse events of immune checkpoint inhibitors. Immune. Netw. 20 10.4110/in.2020.20.e9 PMC7049586 32158597 21. Zak KM Structural basis for small molecule targeting of the programmed death ligand 1 (PD-L1) Oncotarget 2016 7 30323 30335 10.18632/oncotarget.8730 27083005 PMC5058683 Zak, K. M. et al. Structural basis for small molecule targeting of the programmed death ligand 1 (PD-L1). Oncotarget 7 27083005 10.18632/oncotarget.8730 PMC5058683 22. Guzik K Small-molecule inhibitors of the programmed cell death-1/programmed death-ligand 1 (PD-1/PD-L1) interaction via transiently induced protein states and dimerization of PD-L1 J. Med. Chem. 2017 60 5857 5867 10.1021/acs.jmedchem.7b00293 28613862 Guzik, K. et al. Small-molecule inhibitors of the programmed cell death-1/programmed death-ligand 1 (PD-1/PD-L1) interaction via transiently induced protein states and dimerization of PD-L1. J. Med. Chem. 60 28613862 10.1021/acs.jmedchem.7b00293 23. Skalniak L Small-molecule inhibitors of PD-1/PD-L1 immune checkpoint alleviate the PD-L1-induced exhaustion of T-cells Oncotarget 2017 8 72167 72181 10.18632/oncotarget.20050 29069777 PMC5641120 Skalniak, L. et al. Small-molecule inhibitors of PD-1/PD-L1 immune checkpoint alleviate the PD-L1-induced exhaustion of T-cells. Oncotarget 8 29069777 10.18632/oncotarget.20050 PMC5641120 24. Li K Tian H Development of small-molecule immune checkpoint inhibitors of PD-1/PD-L1 as a new therapeutic strategy for tumour immunotherapy J. Drug Target. 2019 27 244 256 10.1080/1061186X.2018.1440400 29448849 Li, K. & Tian, H. Development of small-molecule immune checkpoint inhibitors of PD-1/PD-L1 as a new therapeutic strategy for tumour immunotherapy. J. Drug Target. 27 29448849 10.1080/1061186X.2018.1440400 25. Guzik K Development of the inhibitors that target the PD-1/PD-L1 interaction-a brief look at progress on small molecules, peptides and macrocycles Molecules 2019 24 2071 10.3390/molecules24112071 31151293 PMC6600339 Guzik, K. et al. Development of the inhibitors that target the PD-1/PD-L1 interaction-a brief look at progress on small molecules, peptides and macrocycles. Molecules 24 31151293 10.3390/molecules24112071 PMC6600339 26. Han Y PD-1/PD-L1 inhibitor screening of caffeoylquinic acid compounds using surface plasmon resonance spectroscopy Anal. Biochem. 2018 547 52 56 10.1016/j.ab.2018.02.003 29428377 Han, Y. et al. PD-1/PD-L1 inhibitor screening of caffeoylquinic acid compounds using surface plasmon resonance spectroscopy. Anal. Biochem. 547 29428377 10.1016/j.ab.2018.02.003 27. Basu S Yang J Design, synthesis, evaluation, and structural studies of C2-symmetric small molecule inhibitors of programmed cell death-1/programmed death-ligand 1 protein–protein interaction J. Med. Chem. 2019 62 7250 7263 10.1021/acs.jmedchem.9b00795 31298541 Basu, S. et al. Design, synthesis, evaluation, and structural studies of C2-symmetric small molecule inhibitors of programmed cell death-1/programmed death-ligand 1 protein–protein interaction. J. Med. Chem. 62 31298541 10.1021/acs.jmedchem.9b00795 28. Liu L Syntheses, biological evaluations, and mechanistic studies of benzo[c][1,2,5]oxadiazole derivatives as potent PD-L1 inhibitors with in vivo antitumor activity J. Med. Chem. 2021 64 8391 8409 10.1021/acs.jmedchem.1c00392 34115499 Liu, L. et al. Syntheses, biological evaluations, and mechanistic studies of benzo[c][1,2,5]oxadiazole derivatives as potent PD-L1 inhibitors with in vivo antitumor activity. J. Med. Chem. 64 34115499 10.1021/acs.jmedchem.1c00392 29. Musielak B CA-170-A potent small-molecule PD-L1 inhibitor or not? Molecules 2019 24 2804 10.3390/molecules24152804 31374878 PMC6695792 Musielak, B. et al. CA-170-A potent small-molecule PD-L1 inhibitor or not?. Molecules 24 31374878 10.3390/molecules24152804 PMC6695792 30. Sasikumar PG PD-1 Derived CA-170 is an oral immune checkpoint inhibitor that exhibits preclinical anti-tumor efficacy Commun. Biol. 2021 4 699 10.1038/s42003-021-02191-1 34103659 PMC8187357 Sasikumar, P. G. et al. PD-1 Derived CA-170 is an oral immune checkpoint inhibitor that exhibits preclinical anti-tumor efficacy. Commun. Biol. 4 34103659 10.1038/s42003-021-02191-1 PMC8187357 31. Geng Q Synthesis and peliminary ealuation of ainophenol drivatives as mlecular glues bocking PD-1/PD-L1 interaction J. Mol. Struct. 2023 1289 135900 10.1016/j.molstruc.2023.135900 Geng, Q. et al. Synthesis and peliminary ealuation of ainophenol drivatives as mlecular glues bocking PD-1/PD-L1 interaction. J. Mol. Struct. 1289 32. Uesato S Discovery of new low-molecular-weight p53-mdmx disruptors and their anti-cancer activities Bioorg. Med. Chem. 2016 24 1919 1926 10.1016/j.bmc.2016.03.021 27010502 Uesato, S. et al. Discovery of new low-molecular-weight p53-mdmx disruptors and their anti-cancer activities. Bioorg. Med. Chem. 24 27010502 10.1016/j.bmc.2016.03.021 33. Chupak, L. S. & Zheng, X. Compounds useful as immunomodulators. WO2015034820A1 (2015). 34. Farkona S Diamandis EP Blasutig IM Cancer immunotherapy: The beginning of the end of cancer? BMC Med. 2016 14 73 10.1186/s12916-016-0623-5 27151159 PMC4858828 Farkona, S., Diamandis, E. P. & Blasutig, I. M. Cancer immunotherapy: The beginning of the end of cancer?. BMC Med. 14 27151159 10.1186/s12916-016-0623-5 PMC4858828 35. Antonia SJ Vansteenkiste JF Moon E Immunotherapy: Beyond anti-PD-1 and anti-PD-L1 therapies Am. Soc. Clin. Oncol. Educ. Book 2016 35 e450 e458 10.1200/EDBK_158712 27249753 Antonia, S. J., Vansteenkiste, J. F. & Moon, E. Immunotherapy: Beyond anti-PD-1 and anti-PD-L1 therapies. Am. Soc. Clin. Oncol. Educ. Book 35 27249753 10.1200/EDBK_158712 36. Norde WJ Coinhibitory molecules in hematologic malignancies: Targets for therapeutic intervention Blood 2012 120 728 736 10.1182/blood-2012-02-412510 22563087 Norde, W. J. et al. Coinhibitory molecules in hematologic malignancies: Targets for therapeutic intervention. Blood 120 22563087 10.1182/blood-2012-02-412510 37. Zhao Y Depression promotes hepatocellular carcinoma progression through a glucocorticoid-mediated upregulation of PD-1 expression in tumor-infiltrating NK cells Carcinogenesis 2019 40 1132 1141 30715244 10.1093/carcin/bgz017 Zhao, Y. et al. Depression promotes hepatocellular carcinoma progression through a glucocorticoid-mediated upregulation of PD-1 expression in tumor-infiltrating NK cells. Carcinogenesis 40 30715244 10.1093/carcin/bgz017 38. Zhang H Utilizing VEGF165b mutant as an effective immunization adjunct to augment antitumor immune response Vaccine 2019 37 2090 2098 10.1016/j.vaccine.2019.02.055 30837171 Zhang, H. et al. Utilizing VEGF165b mutant as an effective immunization adjunct to augment antitumor immune response. Vaccine 37 30837171 10.1016/j.vaccine.2019.02.055 39. Ghiotto M PD-L1 and PD-L2 Differ in their molecular mechanisms of interaction with PD-1 Int. Immunol. 2010 22 651 660 10.1093/intimm/dxq049 20587542 PMC3168865 Ghiotto, M. et al. PD-L1 and PD-L2 Differ in their molecular mechanisms of interaction with PD-1. Int. Immunol. 22 20587542 10.1093/intimm/dxq049 PMC3168865 40. Pascolutti R Structure and dynamics of PD-L1 and an ultra-high-affinity PD-1 receptor mutant Structure 2016 24 1719 1728 10.1016/j.str.2016.06.026 27618663 PMC5052120 Pascolutti, R. et al. Structure and dynamics of PD-L1 and an ultra-high-affinity PD-1 receptor mutant. Structure 24 27618663 10.1016/j.str.2016.06.026 PMC5052120 41. Ganesan A Comprehensive in vitro characterization of PD-L1 small molecule inhibitors Sci. Rep. 2019 9 12392 10.1038/s41598-019-48826-6 31455818 PMC6712002 Ganesan, A. et al. Comprehensive in vitro characterization of PD-L1 small molecule inhibitors. Sci. Rep. 9 31455818 10.1038/s41598-019-48826-6 PMC6712002 42. Veljković IS What is the preferred geometry of sulfur–disulfide interactions? CrystEngComm 2020 22 7262 7271 10.1039/D0CE00211A Veljković, I. S. et al. What is the preferred geometry of sulfur–disulfide interactions?. CrystEngComm 22 43. Walls AC SARS-CoV-2 Breakthrough infections elicit potent, broad, and durable neutralizing antibody responses Cell 2022 185 872 880.E3 10.1016/j.cell.2022.01.011 35123650 PMC8769922 Walls, A. C. et al. SARS-CoV-2 Breakthrough infections elicit potent, broad, and durable neutralizing antibody responses. Cell 185 35123650 10.1016/j.cell.2022.01.011 PMC8769922 44. Tsurudome Y Immunogenicity and safety of an inactivated quadrivalent influenza vaccine in healthy adults: A Phase II, open-label, uncontrolled trial in Japan Microbiol. Immunol. 2015 59 597 604 10.1111/1348-0421.12316 26272602 Tsurudome, Y. et al. Immunogenicity and safety of an inactivated quadrivalent influenza vaccine in healthy adults: A Phase II, open-label, uncontrolled trial in Japan. Microbiol. Immunol. 59 26272602 10.1111/1348-0421.12316 45. Lienlaf M Essential role of HDAC6 in the regulation of PD-L1 in melanoma Mol. Oncol. 2016 10 735 750 10.1016/j.molonc.2015.12.012 26775640 PMC4870131 Lienlaf, M. et al. Essential role of HDAC6 in the regulation of PD-L1 in melanoma. Mol. Oncol. 10 26775640 10.1016/j.molonc.2015.12.012 PMC4870131 46. Gatto L Potential protective and therapeutic role of immune checkpoint inhibitors against viral infections and COVID-19 Immunotherapy 2020 12 1111 1114 10.2217/imt-2020-0109 32594820 PMC7325496 Gatto, L. et al. Potential protective and therapeutic role of immune checkpoint inhibitors against viral infections and COVID-19. Immunotherapy 12 32594820 10.2217/imt-2020-0109 PMC7325496 47. Cosimo SD Immune checkpoint inhibitors: A physiology-driven approach to the treatment of coronavirus disease 2019 Eur. J. Cancer 2020 135 62 65 10.1016/j.ejca.2020.05.026 32544799 PMC7269953 Cosimo, S. D. et al. Immune checkpoint inhibitors: A physiology-driven approach to the treatment of coronavirus disease 2019. Eur. J. Cancer 135 32544799 10.1016/j.ejca.2020.05.026 PMC7269953 48. Gambichler T On the use of immune checkpoint inhibitors in patients with viral infections including COVID-19 J. Immunother. Cancer 2020 8 e001145 10.1136/jitc-2020-001145 32611687 PMC7358098 Gambichler, T. et al. On the use of immune checkpoint inhibitors in patients with viral infections including COVID-19. J. Immunother. Cancer 8 32611687 10.1136/jitc-2020-001145 PMC7358098 49. Garner CE Disposition and metabolism of 2’, 2’-dithiobisbenzanilide in rodents following intravenous and oral administration and dermal application Toxicol. Rep. 2020 7 883 892 10.1016/j.toxrep.2020.07.006 32760656 PMC7390853 Garner, C. E. et al. Disposition and metabolism of 2’, 2’-dithiobisbenzanilide in rodents following intravenous and oral administration and dermal application. Toxicol. Rep. 7 32760656 10.1016/j.toxrep.2020.07.006 PMC7390853 50. Shibata T Study on the effect of tire and road wear particles on the environment and human health J. Mater. Cycles Waste Manage. 2022 33 386 391 Shibata, T. Study on the effect of tire and road wear particles on the environment and human health. J. Mater. Cycles Waste Manage. 33 51. Maji UJ Toxicological effects of tire rubber-derived 6PPD-quinone, a species-specific toxicant, and dithiobisbenzanilide (DTBBA) in the marine rotifer Brachionus koreanus Mar. Pollut. Bull. 2023 192 115002 10.1016/j.marpolbul.2023.115002 37182240 Maji, U. J. et al. Toxicological effects of tire rubber-derived 6PPD-quinone, a species-specific toxicant, and dithiobisbenzanilide (DTBBA) in the marine rotifer Brachionus koreanus Mar. Pollut. Bull. 192 37182240 10.1016/j.marpolbul.2023.115002 52. Kreider ML Physical and chemical characterization of tire-related particles: Comparison of particles generated using different methodologies Sci. Total Environ. 2010 408 652 659 10.1016/j.scitotenv.2009.10.016 19896165 Kreider, M. L. et al. Physical and chemical characterization of tire-related particles: Comparison of particles generated using different methodologies. Sci. Total Environ. 408 19896165 10.1016/j.scitotenv.2009.10.016 53. Unice KM Kreider ML Panko JM Comparison of tire and road wear particle concentrations in sediment for watersheds in France, Japan, and the United States by quantitative pyrolysis GC/MS analysis Environ. Sci. Technol. 2013 47 9223 9231 10.1021/es400871j 23841521 Unice, K. M., Kreider, M. L. & Panko, J. M. Comparison of tire and road wear particle concentrations in sediment for watersheds in France, Japan, and the United States by quantitative pyrolysis GC/MS analysis. Environ. Sci. Technol. 47 10.1021/es400871j 23841521 54. Green NM A spectrophotometric assay for avidin and biotin based on binding of dyes by avidin Biochem. J. 1965 94 23C 24C 10.1042/bj0940023C 14340040 Green, N. M. A spectrophotometric assay for avidin and biotin based on binding of dyes by avidin. Biochem. J. 94 14340040 10.1042/bj0940023c 55. Ohta Y In vivo anti-influenza virus activity of an immunomodulatory acidic polysaccharide isolated from Cordyceps militaris J. Agric. Food Chem. 2007 55 10194 10199 10.1021/jf0721287 17988090 Ohta, Y. et al. In vivo anti-influenza virus activity of an immunomodulatory acidic polysaccharide isolated from Cordyceps militaris J. Agric. Food Chem. 55 17988090 10.1021/jf0721287 ",
  "metadata": {
    "Title of this paper": "In vivo anti-influenza virus activity of an immunomodulatory acidic polysaccharide isolated from ",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474900/"
  }
}