{
  "title": "Paper_1072",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12474816 PMC12474816.1 12474816 12474816 41003875 10.1007/s12672-025-03558-0 3558 1 Research Early antibiotic exposure does not affect prognosis in patients with advanced gastric cancer treated with PD-1 inhibitors Qu Ziting Wang Yuyan Wang Zhikun Zhang Yiyin Zhang Yan http://orcid.org/0000-0002-5800-5256 Gu Kangsheng gukangsheng@ahmu.edu.cn https://ror.org/03t1yn780 grid.412679.f 0000 0004 1771 3402 Department of Oncology, The First Affiliated Hospital of Anhui Medical University, 26 9 2025 12 2025 16 478248 1719 2 4 2025 1 9 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Purpose To explore the prognostic impact of antibiotic exposure during programmed death receptor-1 (PD-1) inhibitor therapy in patients with advanced gastric cancer (AGC). Methods Data of 218 AGC patients treated with PD-1 inhibitors were retrospectively collected. The impact of antibiotic exposure in different time windows and other clinical factors on the prognosis of AGC patients was analyzed. Results Antibiotic exposure prior to PD-1 inhibitor therapy (pATB) was significantly correlated with peritoneal metastasis ( P P P P P P P P P P P Conclusion There is no evidence that antibiotics affect the long-term OS prognosis of AGC patients receiving PD-1 inhibitor therapy. Therefore, physicians should not delay PD-1 inhibitor combination treatment regimens in AGC patients who have recently received antibiotics. Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03558-0. Keywords Antibiotics Gastric cancer PD-1 inhibitors Prognosis Anhui Medical University Graduate Student Research and Practice Innovation Program YJS20240020 Qu Ziting the Basic and Clinical Collaborative Research Enhancement Project of Anhui Medical University 2023xkjT039 Zhang Yiyin the Health Research Project of Anhui Province AHWJ2023A10025 Gu Kangsheng pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction Gastric cancer is one of the leading causes of cancer-related deaths worldwide, and advanced gastric cancer (AGC) patients have limited treatment options and low 5-year survival [ 1 2 3 4 Emerging evidence implicates the gut microbiome as a pivotal modulator of systemic and anti-tumor immunity, fundamentally shaping host responses to ICIs [ 5 6 7 8 5 According to a recent study, older cancer patients who were exposed to antibiotics before receiving ICI therapy had a worse overall survival (OS) [ 9 10 11 Therefore, this research systematically assessed the impact of antibiotic exposure and other clinical variables on the prognosis of PD-1 inhibitors in AGC patients using a retrospective cohort. The main points were as follows: (1) The correlation between antibiotic exposure and baseline clinical characteristics was analyzed. (2) The effects of ATB exposure on long-term survival in different time windows were analyzed. (3) The relevance of ATB exposure and other clinical features in the prognostic evaluation of AGC patients receiving PD-1 inhibitor treatment was investigated. Materials and methods Patient collection A retrospective collection of 218 AGC patients who were hospitalized in the oncology-related departments from the First Affiliated Hospital of Anhui Medical University between July 17, 2019, and November 25, 2022, was performed. The patients received combined PD-1 inhibitor treatment during hospitalization. The following were the requirements for inclusion: (1) patients with advanced unresectable gastric cancer; (2) patients with physical conditions that could tolerate PD-1 inhibitor treatment; (3) patients with a complete antibiotic exposure record within a specified period of time; and (4) patients with complete clinicopathologic data who could be followed up regularly. The following were the requirements for exclusion: (1) incomplete clinical data for evaluation and follow-up; (2) any active autoimmune disease; (3) two or more primary malignancies, and (4) a medical condition that could not tolerate PD-1 inhibitor therapy. Prior to starting ICIs treatment, each patient signed an informed consent form. The Anhui Medical University’s Ethics Committee gave its approval to this study (Quick-PJ 2023-14-77). Delineation of the duration of antibiotic exposure Data were collected through the medical record system of the First Affiliated Hospital of Anhui Medical University to obtain records on the time of immunotherapy initiation, antibiotic initiation, and antibiotic use. Regarding the definition of the antibiotic window period, researches reported that the recovery of the microbiome after antibiotic treatment takes 6–8 weeks [ 12 13 14 15 Efficacy evaluation and survival follow-up The effectiveness assessment was conducted using the Response Evaluation Criteria for Solid Tumors 1.1 (RECIST1.1), and the survival follow-up was conducted over the phone or using an electronic medical record system. OS and progression free survival (PFS) were the study’s main endpoints. PFS was defined as the interval between the onset of PD-1 inhibitor treatment and the date of the patient’s death, last follow-up, or disease progression. OS was defined as the interval between the day they began using PD-1 inhibitors and patient’s death or last follow-up. The final follow-up cutoff date was December 1, 2023. Statistical analysis Fisher’s exact test or the chi-square test was used to compare qualitative variables. The Kaplan-Meier curves were used to plot survival curves, and the Log-rank test was used to evaluate them. To find prognostic factors, univariate and multivariate Cox regression analysis with 95%CI were conducted. In order to create the final multivariate model, factors with P P P Rusults Relationship between characteristics and antibiotic exposure The cohort in our study comprised 218 patients diagnosed with advanced gastric cancer (AGC) who had undergone PD-1 inhibitor combination therapy between July 17, 2019, and November 25, 2022. Of these patients, 66 had been exposed to antibiotics within 60 days before starting PD-1 inhibitor treatment (pATB), and 52 had concurrent antibiotic exposure (cATB) within 60 days of starting treatment. Table 1 P P P  Table 1 Patient demographics and baseline characteristics Characteristic pATB exposure cATB exposure No, N 1 Yes, N 1 P 2 No, N 1 Yes, N 1 P 2 Gender 0.053 0.058 Male 110 (72.4%) 39 (59.1%) 119 (71.7%) 30 (57.7%) Female 42 (27.6%) 27 (40.9%) 47 (28.3%) 22 (42.3%) Age (years) 0.180 0.990 ≤ 65 89 (58.6%) 45 (68.2%) 102 (61.4%) 32 (61.5%) > 65 63 (41.4%) 21 (31.8%) 64 (38.6%) 20 (38.5%) Peritoneal metastasis  0.007 0.160 Negative 119 (78.3%) 40 (60.6%) 125 (75.3%) 34 (65.4%) Positive 33 (21.7%) 26 (39.4%) 41 (24.7%) 18 (34.6%) Liver metastasis 0.777 0.567 Negative 89 (58.6%) 40 (60.6%) 100 (60.2%) 29 (55.8%) Positive 63 (41.4%) 26 (39.4%) 66 (39.8%) 23 (44.2%) Lung metastasis 0.818 0.530 Negative 133 (87.5%) 57 (86.4%) 146 (88.0%) 44 (84.6%) Positive 19 (12.5%) 9 (13.6%) 20 (12.0%) 8 (15.4%) Metastatic sites 0.399 0.125 ≤ 2 127 (83.6%) 52 (78.8%) 140 (84.3%) 39 (75.0%) ≥ 3 25 (16.4%) 14 (21.2%) 26 (15.7%) 13 (25.0%) ECOG PS 0.270  < 0.001 ≤ 1 133 (87.5%) 54 (81.8%) 150 (90.4%) 37 (71.2%) ≥ 2 19 (12.5%) 12 (18.2%) 16 (9.6%) 15 (28.8%) Treatment types 0.386  0.012 PD-1 + chemotherapy 89 (58.6%) 36 (54.5%) 104 (62.7%) 21 (40.4%) PD-1 + targeted therapy 18 (11.8%) 5 (7.6%) 17 (10.2%) 6 (11.5%) Others 45 (29.6%) 25 (37.9%) 45 (27.1%) 25 (48.1%) Treatment lines 0.343 0.180 ≤ 2 113 (74.3%) 53 (80.3%) 130 (78.3%) 36 (69.2%) ≥ 3 39 (25.7%) 13 (19.7%) 36 (21.7%) 16 (30.8%) HER-2 0.360 > 0.999 Negative 137 (90.1%) 62 (93.9%) 151 (91.0%) 48 (92.3%) Positive 15 (9.9%) 4 (6.1%) 15 (9.0%) 4 (7.7%) CEA 0.497 0.576 ≤ 5 73 (48.0%) 35 (53.0%) 84 (50.6%) 24 (46.2%) > 5 79 (52.0%) 31 (47.0%) 82 (49.4%) 28 (53.8%) Effect of antibiotic exposure in different time windows on patient prognosis After conducting Cox regression analysis for ATB exposure at various time windows, we found that ATB exposure from 60 days before to 30 days before treatment and from 30 days before to 1 day before treatment did not significantly affect PFS ( P P P P 2 P P P P P P P P P  Table 2 Univariate Cox regression analysis of PFS and OS in patients with AGC treated with PD-1 inhibitors ATB exposure PFS OS HR 1 1 P-value HR 1 1 P-value 60 days before therapy to 30 days therapy treatment No 1 (Reference) 1 (Reference) Yes 1.008 (0.695–1.462) 0.965 1.013 (0.664–1.545) 0.953 30 days before therapy to 1 day therapy treatment No 1 (Reference) 1 (Reference) Yes 1.129 (0.789–1.615) 0.507 0.963 (0.631–1.468) 0.860 Beginning of therapy to 30 days therapy treatment No 1 (Reference) 1 (Reference) Yes 1.535 (1.038–2.269)  0.031 1.294 (0.825–2.030) 0.260 30 days after therapy to 60 days therapy treatment No 1 (Reference) 1 (Reference) Yes 1.528 (1.030–2.268)  0.034 1.183 (0.743–1.885) 0.479 pATB exposure No 1 (Reference) 1 (Reference) Yes 1.089 (0.793–1.494) 0.598 0.955 (0.661–1.379) 0.804 cATB exposure No 1 (Reference) 1 (Reference) Yes 1.591 (1.131–2.239)  0.007 1.221 (0.820–1.817) 0.324 Adjusted cATB exposure No 1 (Reference) 1 (Reference) Yes 1.400 (0.966–2.028) 0.074 1.148 (0.746–1.766) 0.530 1 Prognostic factors affecting patients’ PFS and OS According to characteristic with P P P P 3 P P 4  Table 3 Cox regression analysis of PFS in AGC patients treated with PD-1 inhibitors Characteristic Univariate Multivariate HR 1 1 P-value HR 1 1 P-value Gender Male 1 (Reference) Female 0.931 (0.679–1.278) 0.660 - - Age ≤ 65 1 (Reference) > 65 0.814 (0.595–1.114) 0.198 - - Peritoneum metastasis Negative 1 (Reference) Positive 1.293 (0.936–1.786) 0.118 - - Liver metastasis Negative 1 (Reference) Positive 1.425 (1.052–1.932)  0.022 - - Lung metastasis Negative 1 (Reference) Positive 0.825 (0.527–1.292) 0.401 - - Metastasis sites ≤ 2 1 (Reference) ≥ 3 1.183 (0.808–1.732) 0.387 - - ECOG PS ≤ 1 1 (Reference) ≥ 2 0.991 (0.652–1.506) 0.965 - - Treatment types  0.004 PD-1 + chemotherapy 1 (Reference) PD-1 + targeted therapy 2.131 (1.348–3.369) 0.001 - - Others 1.014 (0.730–1.409) 0.934 - - Treatment lines ≤ 2 1 (Reference) ≥ 3 1.589 (1.344–1.878)  < 0.001 1.550 (1.309–1.835)  < 0.001 pATB exposure No 1 (Reference) Yes 1.089 (0.793–1.494) 0.598 - - cATB exposure No 1 (Reference) Yes 1.591 (1.131–2.239)  0.007 1.508 (1.067–2.132)  0.027 HER-2 Negative/Unknown 1 (Reference) Positive 0.939 (0.544–1.623) 0.823 - - CEA ≤ 5 1 (Reference) > 5 1.398 (1.035–1.888)  0.028 - - 1  Table 4 Cox regression analysis of OS in AGC patients treated with PD-1 inhibitors Characteristic Univariate Multivariate HR 1 1 P-value HR 1 1 P-value Gender Male 1 (Reference) Female 1.080 (0.751–1.553) 0.678 – – Age ≤ 65 1 (Reference) > 65 0.826 (0.578–1.179) 0.292 – – Peritoneum metastasis Negative 1 (Reference) Positive 1.469 (1.017–2.122)  0.039 1.840 (1.250–2.710)  0.002 Liver metastasis Negative 1 (Reference) Positive 0.961 (0.681–1.355) 0.819 – – Lung metastasis Negative 1 (Reference) Positive 1.024 (0.630–1.665) 0.922 – – Metastasis sites ≤ 2 1 (Reference) ≥ 3 1.136 (0.754–1.714) 0.541 – – ECOG PS ≤ 1 1 (Reference) ≥ 2 0.859 (0.509–1.449) 0.568 – – Treatment types  0.002 – – PD-1 + chemotherapy 1 (Reference) PD-1 + targeted therapy 2.311 (1.403–3.808) 0.001 – – Others 0.967 (0.662–1.412) 0.862 – – Treatment lines ≤ 2 1 (Reference) ≥ 3 1.408 (1.174–1.688)  < 0.001 1.366 (1.103–1.692)  0.004 pATB exposure No 1 (Reference) Yes 0.955 (0.661–1.379) 0.804 – – cATB exposure No 1 (Reference) Yes 1.221 (0.820–1.817) 0.324 – – HER-2 Negative/Unknown 1 (Reference) Positive 0.887 (0.500-1.573) 0.681 – – CEA ≤ 5 1 (Reference) > 5 1.470 (1.046–2.067)  0.026 – – 1 Survival curves analysis In this study, the median follow-up time for patients was 19.614 months (95% CI: 18.507–20.721). Figure 1 p 1 p 1 p 1 p 1  Fig. 1 Kaplan-Meier curves for progression-free survival (PFS) and overall survival (OS) of AGC patients treated with PD-1 inhibitors. (a) cATB exposure in PFS. (b) Treatment lines in PFS. (c) peritoneal metastasis in OS. (d) Treatment lines in OS. Discussion Therapeutic approaches for malignant tumors have greatly improved in recent years with the advent of immune checkpoint inhibitors, especially, PD-1 inhibitors [ 16 17 Prior researchs involving PD-1 inhibitor monotherapy in non-small cell lung cancer (NSCLC) patients found that those who received antibiotics experienced notably shorter PFS and OS [ 18 19 10 11 20 The question of whether exposure to antibiotics reduces the effectiveness of PD-1 inhibitor treatment is still significant and contentious. In this research, we particularly looked at the relationship between the clinical prognosis and the time of ATB exposure in 218 AGC patients receiving PD-1 inhibitors. By analyzing the impact of ATB use in different time windows on patient prognosis, our findings fill an important gap in understanding how antibiotic exposure affects the prognosis of gastric cancer patients. Specifically, we observed that pATB did not influence the prognosis of AGC patients undergoing PD-1 inhibitor combination therapy. In contrast, cATB adversely affected PFS in AGC patients ( P P 21 18 22 P P P 23 A previous study reported that pATB led to shorter PFS and OS in gastric cancer patients receiving PD-1 therapy [ 10 24 11 Notably, patients with advanced cancer with poorer general conditions face an increased risk of developing infections and are more likely to undergo antibiotic therapy. The relatively poor prognosis of these patients may be a confounding factor that affects the overall prognosis [ 25 P It is worth noting that specific types of antibiotic therapy can lead to specific changes in the bacterial microbiota. Previous research analyzed the effects of 144 antibiotics on gut microbiota. For example, macrolide antibiotics nearly inhibited all tested commensal bacteria, providing a potential explanation for their strong impact on gut microbiota. The authors also proposed strategies to mitigate their adverse effects on gut microbiota. This study enhances our understanding of how antibiotics influence gut microbiota [ 26 27 10 Despite our systematic approach to explore the impact of antibiotic exposure in different time windows on the prognosis of AGS patients treated with PD-1 inhibitors, the single-center retrospective research has some limitations. First, although we adjusted for factors such as ECOG PS and treatment lines, the retrospective design cannot rule out potential confounding factors and selection bias. Second, there is a lack of in-depth exploration of fecal microbiome data and associated mechanism. Additionally, due to the confounding effects of antibiotic use in clinical practice and the absence of uniform definition criteria, we did not perform subgroup analyses for different types, doses, and durations of antibiotics. Third, although we recorded the categories of antibiotics, this study did not consider heterogeneity in antibiotic spectrum (e.g., broad-spectrum vs. narrow-spectrum), total dose, or treatment duration, which may influence gut microbiota composition and immunotherapy efficacy. For example, broad-spectrum antibiotics may cause more severe microbial imbalance compared to narrow-spectrum antibiotics. Similarly, long-term antibiotics use may lead to sustained microbiota suppression. Future studies should establish prospective cohorts with standardized antibiotic records (including antibiotic type, dose, and duration) and incorporate microbiome sequencing data to validate the effects of antibiotics on the microbiome and immunotherapy. Finally, the study did not consider other medications that may interact with immunotherapy (e.g., corticosteroids, proton pump inhibitors). And due to the limited sample size of immunotherapy monotherapy, future studies should include cohorts receiving immunotherapy combination therapy and immunotherapy monotherapy to compare the differences in the effects of antibiotic exposure on immunotherapy between different treatment regimens. In summary, our findings require validation through further prospective, large-scale cohort studies. Conclusion In conclusion, our findings indicate that there is no evidence suggesting that exposure to antibiotics affects the long-term prognosis of AGC patients received PD-1 inhibitor combination treatment. Therefore, physicians should not delay the PD-1 inhibitor combination regimen in AGC patients who have recently received antibiotics. In the future, the effect of antibiotic exposure on PD-1 inhibitor treatment warrants further in-depth investigation through larger prospective studies. Supplementary Information  Additional file 1. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Ziting Qu and Yuyan Wang contributed equally to this work. Acknowledgements The authors would like to thank all the patients who participated in this study. Author contributions Conceptualization: Kangsheng Gu; data curation: Zhikun Wang and Yan Zhang; writing—original draft: Ziting Qu and Yuyan Wang; writing—review and editing: Yiyin Zhang. Funding This study was supported by the Health Research Project of Anhui Province (No. AHWJ2023A10025), the Basic and Clinical Collaborative Research Enhancement Project of Anhui Medical University (No. 2023xkjT039), and Anhui Medical University Graduate Student Research and Practice Innovation Program (No. YJS20240020). Data availability The datasets generated during and/or analysed during the current study are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate This study was conducted in accordance with the principles of the Declaration of Helsinki. This study involving human participants was approved by the Ethics Committee of Anhui Medical University (Quick-PJ 2023-14-77). Informed consent was obtained from all individual participants included in the study. Consent for publication All authors have provided their consent for publication. Competing interests The authors declare no competing interests. References 1. Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 3 209 49 10.3322/caac.21660 33538338 Sung H, Ferlay J, Siegel RL, Laversanne M, Soerjomataram I, Jemal A, et al. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2021;71(3):209–49. 10.3322/caac.21660. 33538338 10.3322/caac.21660 2. Kang YK Chen LT Ryu MH Oh DY Oh SC Chung HC Nivolumab plus chemotherapy versus placebo plus chemotherapy in patients with HER2-negative, untreated, unresectable advanced or recurrent gastric or gastro-oesophageal junction cancer (ATTRACTION-4): a randomised, multicentre, double-blind, placebo-controlled, phase 3 trial Lancet Oncol 2022 23 2 234 47 10.1016/S1470-2045(21)00692-6 35030335 Kang YK, Chen LT, Ryu MH, Oh DY, Oh SC, Chung HC, et al. Nivolumab plus chemotherapy versus placebo plus chemotherapy in patients with HER2-negative, untreated, unresectable advanced or recurrent gastric or gastro-oesophageal junction cancer (ATTRACTION-4): a randomised, multicentre, double-blind, placebo-controlled, phase 3 trial. Lancet Oncol. 2022;23(2):234–47. 10.1016/S1470-2045(21)00692-6. 35030335 10.1016/S1470-2045(21)00692-6 3. Janjigian YY Shitara K Moehler M Garrido M Salman P Shen L First-line nivolumab plus chemotherapy versus chemotherapy alone for advanced gastric, gastro-oesophageal junction, and oesophageal adenocarcinoma (CheckMate 649): a randomised, open-label, phase 3 trial Lancet (London England) 2021 398 10294 27 40 10.1016/S0140-6736(21)00797-2 34102137 PMC8436782 Janjigian YY, Shitara K, Moehler M, Garrido M, Salman P, Shen L, et al. First-line nivolumab plus chemotherapy versus chemotherapy alone for advanced gastric, gastro-oesophageal junction, and oesophageal adenocarcinoma (CheckMate 649): a randomised, open-label, phase 3 trial. Lancet (London England). 2021;398(10294):27–40. 10.1016/S0140-6736(21)00797-2. 34102137 10.1016/S0140-6736(21)00797-2 PMC8436782 4. Xu J Jiang H Pan Y Gu K Cang S Han L Sintilimab plus chemotherapy for unresectable gastric or gastroesophageal junction cancer: the ORIENT-16 randomized clinical trial JAMA 2023 330 21 2064 74 10.1001/jama.2023.19918 38051328 PMC10698618 Xu J, Jiang H, Pan Y, Gu K, Cang S, Han L, et al. Sintilimab plus chemotherapy for unresectable gastric or gastroesophageal junction cancer: the ORIENT-16 randomized clinical trial. JAMA. 2023;330(21):2064–74. 10.1001/jama.2023.19918. 38051328 10.1001/jama.2023.19918 PMC10698618 5. Routy B Le Chatelier E Derosa L Duong CPM Alou MT Daillère R Gut Microbiome influences efficacy of PD-1-based immunotherapy against epithelial tumors Sci (New York NY) 2018 359 6371 91 7 10.1126/science.aan3706 29097494 Routy B, Le Chatelier E, Derosa L, Duong CPM, Alou MT, Daillère R, et al. Gut Microbiome influences efficacy of PD-1-based immunotherapy against epithelial tumors. Sci (New York NY). 2018;359(6371):91–7. 10.1126/science.aan3706. 10.1126/science.aan3706 29097494 6. Gazzaniga FS, Kasper DL. The gut Microbiome and cancer response to immune checkpoint inhibitors. J Clin Invest. 2025;135(3). 10.1172/JCI184321. 10.1172/JCI184321 PMC11785914 39895632 7. Derosa L Hellmann MD Spaziano M Halpenny D Fidelle M Rizvi H Negative association of antibiotics on clinical activity of immune checkpoint inhibitors in patients with advanced renal cell and non-small-cell lung cancer Ann Oncol 2018 29 6 1437 44 10.1093/annonc/mdy103 29617710 PMC6354674 Derosa L, Hellmann MD, Spaziano M, Halpenny D, Fidelle M, Rizvi H, et al. Negative association of antibiotics on clinical activity of immune checkpoint inhibitors in patients with advanced renal cell and non-small-cell lung cancer. Ann Oncol. 2018;29(6):1437–44. 10.1093/annonc/mdy103. 29617710 10.1093/annonc/mdy103 PMC6354674 8. Wada A Enokida T Okano S Sato M Tanaka H Ueda Y Proton pump inhibitors and antibiotics adversely effect the efficacy of nivolumab in patients with recurrent or metastatic squamous cell carcinoma of the head and neck Eur J Cancer 2023 184 30 8 10.1016/j.ejca.2023.02.011 36898232 Wada A, Enokida T, Okano S, Sato M, Tanaka H, Ueda Y, et al. Proton pump inhibitors and antibiotics adversely effect the efficacy of nivolumab in patients with recurrent or metastatic squamous cell carcinoma of the head and neck. Eur J Cancer. 2023;184:30–8. 10.1016/j.ejca.2023.02.011. 36898232 10.1016/j.ejca.2023.02.011 9. Eng L Sutradhar R Niu Y Liu N Liu Y Kaliwal Y Impact of antibiotic exposure before immune checkpoint inhibitor treatment on overall survival in older adults with cancer: a population-based study J Clin Oncol 2023 41 17 3122 34 10.1200/JCO.22.00074 36827626 Eng L, Sutradhar R, Niu Y, Liu N, Liu Y, Kaliwal Y, et al. Impact of antibiotic exposure before immune checkpoint inhibitor treatment on overall survival in older adults with cancer: a population-based study. J Clin Oncol. 2023;41(17):3122–34. 10.1200/JCO.22.00074. 36827626 10.1200/JCO.22.00074 10. Kim CG Koh JY Shin SJ Shin JH Hong M Chung HC Prior antibiotic administration disrupts anti-PD-1 responses in advanced gastric cancer by altering the gut Microbiome and systemic immune response Cell Rep Med 2023 4 11 101251 10.1016/j.xcrm.2023.101251 37890486 PMC10694627 Kim CG, Koh JY, Shin SJ, Shin JH, Hong M, Chung HC, et al. Prior antibiotic administration disrupts anti-PD-1 responses in advanced gastric cancer by altering the gut Microbiome and systemic immune response. Cell Rep Med. 2023;4(11):101251. 10.1016/j.xcrm.2023.101251. 37890486 10.1016/j.xcrm.2023.101251 PMC10694627 11. Zhang F Ding Z Lian Y Prophylactic antibiotic use is associated with better clinical outcomes in gastric cancer patients receiving immunotherapy Oncologist 2025 30 2 oyae362 10.1093/oncolo/oyae362 40036772 PMC11879193 Zhang F, Ding Z, Lian Y, et al. Prophylactic antibiotic use is associated with better clinical outcomes in gastric cancer patients receiving immunotherapy. Oncologist. 2025;30(2):oyae362. 10.1093/oncolo/oyae362. 40036772 10.1093/oncolo/oyae362 PMC11879193 12. Palleja A Mikkelsen KH Forslund SK Recovery of gut microbiota of healthy adults following antibiotic exposure Nat Microbiol 2018 3 11 1255 65 10.1038/s41564-018-0257-9 30349083 Palleja A, Mikkelsen KH, Forslund SK, et al. Recovery of gut microbiota of healthy adults following antibiotic exposure. Nat Microbiol. 2018;3(11):1255–65. 10.1038/s41564-018-0257-9. 30349083 10.1038/s41564-018-0257-9 13. Modi SR Collins JJ Relman DA Antibiotics and the gut microbiota J Clin Invest 2014 124 10 4212 8 10.1172/JCI72333 25271726 PMC4191029 Modi SR, Collins JJ, Relman DA. Antibiotics and the gut microbiota. J Clin Invest. 2014;124(10):4212–8. 10.1172/JCI72333. 25271726 10.1172/JCI72333 PMC4191029 14. Gaucher L Adda L Séjourné A Joachim C Guillaume C Poulet C Associations between dysbiosis-inducing drugs, overall survival and tumor response in patients treated with immune checkpoint inhibitors Ther Adv Med Oncol 2021 13 17588359211000591 10.1177/17588359211000591 33796151 PMC7968039 Gaucher L, Adda L, Séjourné A, Joachim C, Guillaume C, Poulet C, et al. Associations between dysbiosis-inducing drugs, overall survival and tumor response in patients treated with immune checkpoint inhibitors. Ther Adv Med Oncol. 2021;13:17588359211000591. 10.1177/17588359211000591. 33796151 10.1177/17588359211000591 PMC7968039 15. Greally M Chou JF Chatila WK Margolis M Capanu M Hechtman JF Clinical and molecular predictors of response to immune checkpoint inhibitors in patients with advanced esophagogastric cancer Clin Cancer Res 2019 25 20 6160 9 10.1158/1078-0432.CCR-18-3603 31337644 PMC6905384 Greally M, Chou JF, Chatila WK, Margolis M, Capanu M, Hechtman JF, et al. Clinical and molecular predictors of response to immune checkpoint inhibitors in patients with advanced esophagogastric cancer. Clin Cancer Res. 2019;25(20):6160–9. 10.1158/1078-0432.CCR-18-3603. 31337644 10.1158/1078-0432.CCR-18-3603 PMC6905384 16. Sharma P Goswami S Raychaudhuri D Siddiqui BA Singh P Nagarajan A Immune checkpoint therapy-current perspectives and future directions Cell 2023 186 8 1652 69 10.1016/j.cell.2023.03.006 37059068 Sharma P, Goswami S, Raychaudhuri D, Siddiqui BA, Singh P, Nagarajan A, et al. Immune checkpoint therapy-current perspectives and future directions. Cell. 2023;186(8):1652–69. 10.1016/j.cell.2023.03.006. 37059068 10.1016/j.cell.2023.03.006 17. Macandog ADG, Catozzi C, Capone M, Nabinejad A, Nanaware PP, Liu S et al. Longitudinal analysis of the gut microbiota during anti-PD-1 therapy reveals stable microbial features of response in melanoma patients. Cell Host Microbe. 2024; 32(11):2004–2018.e2009. 10.1016/j.chom.2024.10.006 10.1016/j.chom.2024.10.006 PMC11629153 39481388 18. Cortellini A, Di Maio M, Nigro O, Leonetti A, Cortinovis DL, Aerts JG, et al. Differential influence of antibiotic therapy and other medications on oncological outcomes of patients with non-small cell lung cancer treated with first-line pembrolizumab versus cytotoxic chemotherapy. J Immunother Cancer. 2021. 10.1136/jitc-2021-002421. 10.1136/jitc-2021-002421 PMC8031700 33827906 19. Chalabi M Cardona A Nagarkar DR Dhawahir Scala A Gandara DR Rittmeyer A Efficacy of chemotherapy and Atezolizumab in patients with non-small-cell lung cancer receiving antibiotics and proton pump inhibitors: pooled post hoc analyses of the OAK and POPLAR trials Ann Oncol 2020 31 4 525 31 10.1016/j.annonc.2020.01.006 32115349 Chalabi M, Cardona A, Nagarkar DR, Dhawahir Scala A, Gandara DR, Rittmeyer A, et al. Efficacy of chemotherapy and Atezolizumab in patients with non-small-cell lung cancer receiving antibiotics and proton pump inhibitors: pooled post hoc analyses of the OAK and POPLAR trials. Ann Oncol. 2020;31(4):525–31. 10.1016/j.annonc.2020.01.006. 32115349 10.1016/j.annonc.2020.01.006 20. Cortellini A Ricciuti B Facchinetti F Alessi JVM Venkatraman D Dall’Olio FG Antibiotic-exposed patients with non-small-cell lung cancer preserve efficacy outcomes following first-line chemo-immunotherapy Ann Oncol 2021 32 11 1391 9 10.1016/j.annonc.2021.08.1744 34400292 Cortellini A, Ricciuti B, Facchinetti F, Alessi JVM, Venkatraman D, Dall’Olio FG, et al. Antibiotic-exposed patients with non-small-cell lung cancer preserve efficacy outcomes following first-line chemo-immunotherapy. Ann Oncol. 2021;32(11):1391–9. 10.1016/j.annonc.2021.08.1744. 34400292 10.1016/j.annonc.2021.08.1744 21. Fessas P Naeem M Pinter M Marron TU Szafron D Balcar L Early antibiotic exposure is not detrimental to therapeutic effect from immunotherapy in hepatocellular carcinoma Liver Cancer 2021 10 6 583 92 10.1159/000519108 34950181 PMC8647090 Fessas P, Naeem M, Pinter M, Marron TU, Szafron D, Balcar L, et al. Early antibiotic exposure is not detrimental to therapeutic effect from immunotherapy in hepatocellular carcinoma. Liver Cancer. 2021;10(6):583–92. 10.1159/000519108. 34950181 10.1159/000519108 PMC8647090 22. Nan K Zhong Z Yue Y Shen Y Zhang H Wang Z Fasting-mimicking diet-enriched bifidobacterium pseudolongum suppresses colorectal cancer by inducing memory CD8(+) T cells Gut 2025 10.1136/gutjnl-2024-333020 39870395 Nan K, Zhong Z, Yue Y, Shen Y, Zhang H, Wang Z, et al. Fasting-mimicking diet-enriched bifidobacterium pseudolongum suppresses colorectal cancer by inducing memory CD8(+) T cells. Gut. 2025. 10.1136/gutjnl-2024-333020. 39870395 10.1136/gutjnl-2024-333020 23. Kobayashi D Kodera Y Fukushima R Morita M Fushida S Yamashita N Phase II study of intraperitoneal administration of Paclitaxel combined with S-1 and cisplatin for gastric cancer with peritoneal metastasis Ann Surg Oncol 2024 31 2 735 43 10.1245/s10434-023-14240-6 37952018 Kobayashi D, Kodera Y, Fukushima R, Morita M, Fushida S, Yamashita N, et al. Phase II study of intraperitoneal administration of Paclitaxel combined with S-1 and cisplatin for gastric cancer with peritoneal metastasis. Ann Surg Oncol. 2024;31(2):735–43. 10.1245/s10434-023-14240-6. 37952018 10.1245/s10434-023-14240-6 24. Björk JR Bolte LA Maltez Thomas A Lee KA Rossi N Wind TT Longitudinal gut Microbiome changes in immune checkpoint blockade-treated advanced melanoma Nat Med 2024 30 3 785 96 10.1038/s41591-024-02803-3 38365950 PMC10957474 Björk JR, Bolte LA, Maltez Thomas A, Lee KA, Rossi N, Wind TT, et al. Longitudinal gut Microbiome changes in immune checkpoint blockade-treated advanced melanoma. Nat Med. 2024;30(3):785–96. 10.1038/s41591-024-02803-3. 38365950 10.1038/s41591-024-02803-3 PMC10957474 25. Poizeau F Dupuy A Analyzing the impact of exposure to antibiotics on immune checkpoint inhibitor efficacy: stop at a methodological checkpoint J Clin Oncol 2023 41 32 5072 3 10.1200/JCO.23.00730 37611217 Poizeau F, Dupuy A. Analyzing the impact of exposure to antibiotics on immune checkpoint inhibitor efficacy: stop at a methodological checkpoint. J Clin Oncol. 2023;41(32):5072–3. 10.1200/JCO.23.00730. 37611217 10.1200/JCO.23.00730 26. Maier L Goemans CV Wirbel J Unravelling the collateral damage of antibiotics on gut bacteria Nature 2021 599 7883 120 4 10.1038/s41586-021-03986-2 34646011 PMC7612847 Maier L, Goemans CV, Wirbel J, et al. Unravelling the collateral damage of antibiotics on gut bacteria. Nature. 2021;599(7883):120–4. 10.1038/s41586-021-03986-2. 34646011 10.1038/s41586-021-03986-2 PMC7612847 27. Yuan L Pan L Wang Y Characterization of the landscape of the intratumoral microbiota reveals that Streptococcus anginosus increases the risk of gastric cancer initiation and progression Cell Discov 2024 10 1 117 10.1038/s41421-024-00746-0 39587089 PMC11589709 Yuan L, Pan L, Wang Y, et al. Characterization of the landscape of the intratumoral microbiota reveals that Streptococcus anginosus increases the risk of gastric cancer initiation and progression. Cell Discov. 2024;10(1):117. 10.1038/s41421-024-00746-0. Published 2024 Nov 26. 39587089 10.1038/s41421-024-00746-0 PMC11589709 ",
  "metadata": {
    "Title of this paper": "Characterization of the landscape of the intratumoral microbiota reveals that Streptococcus anginosus increases the risk of gastric cancer initiation and progression",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474816/"
  }
}