{
  "title": "Paper_311",
  "abstract": "pmc Oncologist Oncologist 1643 oncologist oncolo The Oncologist 1083-7159 1549-490X Oxford University Press PMC12488228 PMC12488228.1 12488228 12488228 40828901 10.1093/oncolo/oyaf260 oyaf260 1 Brief Communication Immuno-Oncology AcademicSubjects/MED00010 Acquired hemophilia due to immune checkpoint inhibitors: a case series introducing emicizumab treatment https://orcid.org/0000-0001-9955-5433 Wolff Louis Conceptualization Validation Writing - original draft Writing - review & editing  Department of Internal Medicine, Institut Jules Bordet, Hôpital Universitaire de Bruxelles (H.U.B.), Université Libre de Bruxelles (ULB) Belgium  Belgian Multidisciplinary Immunotoxicity Board (BITOX) Ertl Carolin Resources  Department of Dermatology and Allergy, LMU University Hospital, LMU Munich Germany https://orcid.org/0000-0001-5718-3643 Heinzerling Lucie Supervision Validation Writing - review & editing  Department of Dermatology and Allergy, LMU University Hospital, LMU Munich Germany  Department of Dermatology, Friedrich-Alexander-Universität Erlangen-Nürnberg (FAU), Universitätsklinikum Erlangen Germany https://orcid.org/0000-0001-6598-9161 Aspeslagh Sandrine Writing - review & editing  Belgian Multidisciplinary Immunotoxicity Board (BITOX)  Department of Medical Oncology, Vrije Universiteit Brussel (VUB), Universitair Ziekenhuis Brussel (UZ Brussel) Belgium  Department of Internal Medicine, Vrije Universiteit Brussel (VUB), Universitair Ziekenhuis Brussel (UZ Brussel) Belgium https://orcid.org/0000-0002-3054-7969 Verhaert Marthe Validation Writing - review & editing  Belgian Multidisciplinary Immunotoxicity Board (BITOX)  Department of Medical Oncology, Vrije Universiteit Brussel (VUB), Universitair Ziekenhuis Brussel (UZ Brussel) Belgium Lattenist Raphael Supervision Validation Writing - review & editing  Department of Hematology, Pôle Hospitalier Jolimont, Réseau HELORA Belgium Confente Caterina Investigation  Department of Medical Oncology, Pôle Hospitalier Jolimont, Réseau HELORA Belgium Lambert Catherine Validation Writing - review & editing  Unité d‘hémostase-thrombose, Service d‘hématologie, Cliniques universitaires Saint-Luc, UCLouvain Belgium Ilzkovitz Maxime Validation Writing - original draft Writing - review & editing  Department of Internal Medicine, Institut Jules Bordet, Hôpital Universitaire de Bruxelles (H.U.B.), Université Libre de Bruxelles (ULB) Belgium  Belgian Multidisciplinary Immunotoxicity Board (BITOX) Corresponding author: Louis Wolff, Department of Internal Medicine, Institut Jules Bordet, Hôpital Universitaire de Bruxelles (H.U.B.), Université Libre de Bruxelles (ULB), Rue Meylemeersch 90, 1070 Brussels, Belgium ( louis.wolff@hubruxelles.be  www.serio-registry.org 10 2025 19 8 2025 30 10 498124 oyaf260 02 12 2024 16 8 2025 01 10 2025 19 08 2025 02 10 2025 02 10 2025 © The Author(s) 2025. Published by Oxford University Press. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract Background Acquired hemophilia A (AHA) is a rare but potentially life-threatening autoimmune bleeding disorder and immune-related adverse event (irAE) associated with immune checkpoint inhibitors (ICI). This study discusses 3 new cases of ICI-induced AHA from Belgium and the SERIO-Side Effect Registry Immuno-Oncology ( www.serio-registry.org Methods One case was encountered at a tertiary care center in Belgium. SERIO was queried and yielded another 2 cases. A comprehensive literature review using PubMed identified 8 additional cases. Results A total of 11 patients were analyzed, with a median age of 68 years (range: 56-71), 10 were male. Most (9/11) were treated with anti-PD-1 monotherapy. In 5 cases, toxicity appeared before the fourth cycle. Immunosuppressive therapy successfully achieved complete resolution of AHA in 9 of 11 patients. For the first time, one patient was successfully treated with emicizumab, a monoclonal bispecific antibody, which bridges activated factor IX and factor X. Conclusions Clinicians should be vigilant about ICI-induced AHA as a potentially severe irAE. Prolonged aPTT requires thorough evaluation. Upon AHA confirmation, eradication of anti-FVIII antibodies with corticosteroids, rituximab, or other immunosuppressant should be attempted. Emicizumab offers advantages over traditional replacement therapy, including ease of use and a potential reduction in immunosuppressive drug requirements—an important consideration in ICI-treated patients. Further research is needed to fully understand the pathophysiology and optimize treatment strategy for AHA. hemophilia immune checkpoint inhibitors emicizumab immunotherapy anti-PD1 anti-PDL1 anti-CTLA4 AHA pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Background Among the various immune-related adverse events (irAE) induced by immune checkpoint inhibitors (ICI), hematological toxicities (hem-irAE) are rare but can be life-threatening and require immediate recognition and management. These include thrombocytopenia, leucopenia and neutropenia, hemophagocytic lymphohistiocytosis, aplastic anemia, coagulation deficiency, and acquired hemophilia A (AHA). 1 2 3–5 Methods One case was encountered at a tertiary care center in Belgium. SERIO was queried and yielded another 2 cases. A comprehensive literature review using PubMed identified 8 additional cases. Results We describe a 68-year-old man with melanoma, metastasized to the lungs and brain, treated with nivolumab and ipilimumab. He presented with subcutaneous bleeding, arms and trunk, and a prolonged activated Partial Thromboplastin Time (aPTT). Additionally work up demonstrated a FVIII < 1% with the presence of inhibitor titer at 120 BU/mL, leading to a diagnosis of acquired hemophilia (see Table 1 Table 1. aPCC: activated prothrombin complex concentrates. Year Country Sex Age Cancer ICI Timing of toxicity Lab results Clinical manifestations Immuno-suppressive treatments Treatments to prevent bleeding ICI Outcome  2011 France Male 42 Metastatic melanoma Ipilimumab After 9 weeks aPTT 102 sec, FVIII <1%, 26 BU Macroscopic hematuria GC TXA, rFVIIa N/A Inhibitor persisted  2018 Japan Male 68 Metastatic lung squamous cell carcinoma Nivolumab After 17 months aPTT 71 sec, FVIII 3%, 15 BU Melena GC 1 mg/kg/d, CYC rFVIIa Stopped Partial remission  2018 Germany Male 71 Metastatic melanoma Pembrolizumab After 18 weeks N/A N/A RTX rFVIIa, aPCC N/A Complete resolution  2019 USA Male 76 Metastatic lung squamous cell carcinoma Nivolumab After 6 weeks aPTT 93 sec, FVIII <1%, 31 BU Diffuse ecchymoses, hematuria GC, RTX rFVIII, aPCC Stopped Complete resolution  2022 Italy Male 67 Metastatic melanoma Nivolumab After 13 weeks aPTT 99 sec, FVIII <1%, 26 BU Macroscopic hematuria GC 1 mg/kg/d, RTX rFVIIa Stopped Complete resolution  2022 Italy Male 70 Metastatic melanoma Pembrolizumab After 21 weeks aPTT 70 sec, FVIII <1%, 71 BU Diffuse ecchymoses GC, RTX rFVIIa Stopped Complete resolution  2022 Australia Male 56 Metastatic lung adenocarcinoma Atezolizumab After 16 months aPTT 78 sec, FVIII 4%, 14.6 BU Anemia, bruising and hemarthrosis GC 1 mg/kg/d, RTX rFVIIa Complete resolution  2023 Lebanon Female 52 Metastatic lung adenocarcinoma Not reported After 6 weeks aPTT 95 sec Gynaecological bleeding GC 1 mg/kg/d Complete resolution  2024 Australia Male 88 Invasive high-grade urothelial carcinoma Pembrolizumab After 3 weeks aPTT 76 sec, FVIII 1%, 89 BU Diffuse ecchymoses, severe anemia GC, CYC rFVIIa, rFVIII Complete resolution  2024 Belgium Male 68 Metastatic melanoma Nivolumab/Ipilumab After 12 weeks aPTT 78, FVIII < 1%, 126 BU Diffuse ecchymoses GC, RTX Emicizumab Stopped Complete resolution  N/A Germany Male 69 Not reported Pembrolizumab Not reported Not reported Not reported GC 1 mg/kg/d, RTX rFVIIA, aPCC N/A Complete resolution Sources: Refs. [ 6–12 Abbreviations: aPTT, activated partial thromboplastin time; BU, Bethesda Unit; CYC, cyclophosphamide; GC, glucocorticoids; rFVIIa, activated recombinant FVIIa; rFVIII, recombinant FVIII; RTX, rituximab; TXA, tranexamic Acid; N/A, Not available With 3 new cases reported, a total of 11 patients with AHA induced by ICI with a median age of 68-year old (range: 56-71) was collected. Cancer types included 5 patients with metastatic melanoma, 4 with metastatic lung, and one with metastatic urothelial cancer. Seven patients were treated with anti-PD1, 1 with anti-PDL1, 1 with anti-CTLA4, and 1 with a combination of anti-PD1/CTLA4. In 5/11 (45%) cases, toxicity appeared before the fourth cycle. None of the patients died from a bleeding complication, even though 6 patients presented with severe AHA depicted with FVIII < 1% and inhibitor titer >20 BU/mL. All patients were treated for their toxicity with glucocorticoid (GC). Other treatments comprised cyclophosphamide (CYC), rituximab (RTX). Immunosuppression successfully achieved complete eradication of the inhibitor against FVIII in 9 out of 11 patients. One patient with recurrence of AHA was only treated with GC, the other was treated with GC and CYC ( Table 1 Discussion AHA is a rare auto-immune bleeding disorder characterized by the development of neutralizing antibodies against factor VIII, leading to a deficiency in factor VIII activity. We describe the largest series of ICI-induced AHA and the first case treated with emicizumab, a humanized bispecific monoclonal antibody that binds and bridges activated FIX and FX, partially mimicking FVIII activity. The pathophysiology of ICI-induced AHA is thought to involve the loss of self-tolerance and the activation of autoreactive T- and B- cells and can be induced by ICI therapy. ICI block inhibitory checkpoints on T-cells, leading to enhanced T-cell activation. This loss of self-tolerance may result in the production of autoantibodies against factor VIII, causing a deficiency in factor VIII activity and an increased risk of bleeding. The diagnosis of AHA is established by the presence of a highly prolonged aPTT, low factor VIII activity, and the detection of factor VIII inhibitors. Before concluding to an irAE, it is important to exclude other causes of AHA such as infections, other drug exposures and paraneoplastic phenomena. 13 Treatment of acute bleeding episodes relies on hemostatic therapy while autoantibody eradication depends on immunosuppressive therapy. Corticosteroids are the first line treatment in patients with non-severe prognosis, suppressing autoantibodies in 60%-70% of the cases. Cyclophosphamide (CYC) and rituximab (RTX) are used as add-on therapy in severe cases. 13 , 14 According to the latest international AHA guidelines, the use of rFVIIa, aPCC, or rpFVIII is preferred over human FVIII or desmopressin for the treatment of clinically relevant bleeding in patients with AHA. 13 A new prophylactic hemostatic strategy with emicizumab has been developed in both congenital and acquired AHA, regardless the presence of inhibitors. This drug presents several advantages: ease of use with subcutaneous administration, activity regardless of factor VIII concentration and inhibitor’s titer, and reliability for long-term prophylaxis. It is important to note that emicizumab alters aPTT-derived coagulation parameters, and therefore, requires specific monitoring using a specialized bovine-derived test. Moreover, 2 side effects require careful monitoring during the use of emicizumab: thrombotic microangiopathy (only in case of association with high dose of aPCC). As immunosuppressive therapies carry a high risk of morbidity, including infection, using emicizumab allows to delay the use of immunosuppressive agent in the early phase of AHA diagnosis. This is of high interest in patients treated with ICI, as we are avoiding drugs that may alter the mechanisms of ICI. 1 The question of rechallenging a patient with ICI after a severe toxicity such as AHA remains difficult. To date, no cases of rechallenge of patients with AHA have been published. It could be considered as all AHA patients survived, and nearly all had a complete resolution of the AHA. Second, a case-report of a patient with pre-existing AHA was treated with immunotherapy and did not relapse of AHA. 15 Conclusion This case report highlights the rare but potentially fatal complication of AHA induced by ICI. It is crucial for clinicians to be aware of this possible irAE and, in case of clinical suspicion or unexplained aPTT elevation, to evaluate FVIII and inhibitors. Confirmed cases of ICI-induced AHA should be managed like non-ICI-induced AHA. Further research is needed to fully elucidate the pathophysiology of ICI-induced AHA and to optimize treatment and prophylaxis strategies. As a non-immunosuppressive treatment, the newly developed emicizumab appears to be a very interesting option to prevent bleeds in this type of toxicity. Author contributions Louis Wolff conception of the draft, Carolin Ertl and Caterina Confente gathered data, Louis Wolff, Maxime Ilzkovitz, Lucie Heinzerling, Sandrine Aspeslagh, Marthe Verhaert, Raphael Lattenist, Catherine Lambert gathered data, manuscript writing, and final approval of manuscript. Funding This research was conducted independently, and no specific grant from funding agencies in the public, commercial, or not-for-profit sectors was received. Conflicts of interest M.V.: Personal PhD mandate from Research Foundation Flanders (1SH4A24N). Honoraria for presentations from Ipsen, MSD, Roche, Domus Medica, Pfizer and Jansen: all paid to institution Travel support to attend meetings from Ipsen and Sanofi. S.A.: membership on an advisory board or board of directors the last 36 months: MSD, Sanofi, Roche, BMS, Pfizer, Ipsen, Galapagos, Astellas. L.W., M.I., M.V., and S.A. are board members of BITOX, the Belgian national multidisciplinary immunotoxicity board, which is sponsored by BMS, MSD, Pfizer, Merck, Roch, AstraZeneca, Ipsen and Sanofi. Sponsorship paid to Belgian Society of Medical Oncology. L.H. is a speaker and a memberof advisory boards for BMS, Immunocore, Novartis, Therakos in 12 last months. Involved in clinical studies in her institution with Agenus, Astrazeneca, BMS, Huya Bioscience, Immunocore, IO Biotech, Merck, Pfizer, Pierre Fabre, Regneron, Replimune, Sanofi, Sol-gel technologies. C.E. reports speaker fees from Bristol Myers Squibb, GSK, Immunocore, Kyowa Kirin, MSD. C.L. reports speakers and members of advisory board for Amgen, CSL Behring, LFB, Octapharma, Sanofi, Sobi, Roche. Data availability All data generated or analyzed during this study are included in this published article. The authors commit to providing additional information upon reasonable request. References 1 Omar NE El-Fass KA Abushouk AI et al Diagnosis and management of hematological adverse events induced by immune checkpoint inhibitors: a systematic review Front Immunol 2020 11 1354 10.3389/fimmu.2020.01354 33193289 PMC7640759 2 Ertl C Ruf T Mentzer D et al The side effect registry immuno-oncology (SERIO) - a tool for systematic analysis of immunotherapy-­induced side effects Eur J Cancer 2024 199 113505 10.1016/j.ejca.2023.113505 38262306 3 Shima M Amano K Ogawa Y et al A prospective, multicenter, open-label phase III study of emicizumab prophylaxis in patients with acquired hemophilia A J Thromb Haemost 2023 21 534 545 10.1016/j.jtha.2022.10.004 36696195 4 Tiede A Hart C Knöbl P et al Emicizumab prophylaxis in patients with acquired haemophilia A (GTH-AHA-EMI): an open-label, single-arm, multicentre, phase 2 study Lancet Haematol 2023 10 e913 e921 10.1016/S2352-3026(23)00280-6 37858328 5 Ikbel G Hela B Yassine KM Hamida K Kamel BS. Outcomes of emicizumab in acquired hemophilia patients: a systematic review Clin Appl Thromb Hemost 2024 30 10760296241298661 10.1177/10760296241298661 39543979 PMC11565686 6 Delyon J Mateus C Lambert T. Hemophilia a induced by ipilimumab N Engl J Med 2011 365 1747 1748 10.1056/NEJMc111092322047582 22047582 7 Gokozan HN Friedman JD Schmaier AH Downes KA Farah LA Reeves HM. Acquired hemophilia a after nivolumab therapy in a patient with metastatic squamous cell carcinoma of the lung successfully managed with rituximab Clin Lung Cancer 2019 20 e560 e563 10.1016/j.cllc.2019.06.022 31311716 8 Kato R Hayashi H Sano K et al Nivolumab-induced hemophilia a presenting as gastric ulcer bleeding in a patient with NSCLC J Thorac Oncol 2018 13 e239 e241 10.1016/j.jtho.2018.06.024 30017828 9 Fletcher J Bird R McLean AJW O’Byrne K Xu W. Acquired hemophilia a secondary to an immune checkpoint inhibitor: a case report JTO Clin Res Rep 2022 3 100409 10.1016/j.jtocrr.2022.100409 36275909 PMC9579496 10 Gidaro A Palmieri G Donadoni M et al A diagnostic of acquired hemophilia following PD1/PDL1 inhibitors in advanced melanoma: the experience of two patients and a literature review Diagnostics (Basel) 2022 12 2559 10.3390/diagnostics12102559 36292248 PMC9600358 11 Gandour G Salme TM Badra T Adawiye A El Hachem G. CT-277 acquired hemophilia A: an unusual complication of immune checkpoint inhibitors Clin Lymphoma Myeloma Leuk. 2023 23 S524 S525 10.1016/S2152-2650(23)01504-5 12 Archibald WJ Kouides PA Refaai MA Lachant NA. Acquired bleeding disorders secondary to immune checkpoint inhibitors: a case report and systematic literature review Blood Coagul Fibrinolysis Int J Haemost Thromb 2023 34 427 431 10.1097/MBC.0000000000001244 37695569 13 Tiede A Collins P Knoebl P et al International recommendations on the diagnosis and treatment of acquired hemophilia A Haematologica 2020 105 1791 1801 10.3324/haematol.2019.230771 32381574 PMC7327664 14 Lévesque H Viallard JF Houivet E et al Cyclophosphamide vs rituximab for eradicating inhibitors in acquired hemophilia A: a randomized trial in 108 patients Thromb Res 2024 237 79 87 10.1016/j.thromres.2024.03.012 38555718 15 Mostafa MA Elseidy S Metwally RA Mahmoud A Abdelhay A Imran FS. First reported use of immune checkpoint inhibitor for treatment of cancer in a patient with acquired hemophilia A Clin Immunol Commun 2024 5 41 44 10.1016/j.clicom.2024.04.001 ",
  "metadata": {
    "Title of this paper": "First reported use of immune checkpoint inhibitor for treatment of cancer in a patient with acquired hemophilia A",
    "Journal it was published in:": "The Oncologist",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488228/"
  }
}