{
  "title": "Paper_34",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490256 PMC12490256.1 12490256 12490256 40782796 10.1016/j.xcrm.2025.102264 S2666-3791(25)00337-4 102264 1 Review Cardiovascular inflammaging: Mechanisms, consequences, and therapeutic perspectives Spray Luke 1 Richardson Gavin 2 Haendeler Judith 3 4 Altschmied Joachim 3 4 Rumampouw Valencia 1 Wallis Sienna B. 1 Georgiopoulos Georgios 5 White Stephen 2 Unsworth Amanda 6 Stellos Konstantinos 2 7 8 9 10 Tual-Chalot Simon simon.tual-chalot@newcastle.ac.uk 2 ∗ Spyridopoulos Ioakim ioakim.spyridopoulos@ncl.ac.uk 1 ∗∗ 1 2 3 4 5 6 7 8 9 10 ∗ simon.tual-chalot@newcastle.ac.uk ∗∗ ioakim.spyridopoulos@ncl.ac.uk 16 9 2025 08 8 2025 6 9 498186 102264 08 08 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Summary Both aging and systemic inflammation are major risk factors for cardiovascular disease. This review summarizes the interrelationship of aging and inflammation—known as inflammaging—and the consequences for cardiovascular health. We discuss mechanisms including epigenetic modification, mitochondrial dysfunction, cellular senescence, and gut dysbiosis, many of which are themselves interrelated. Increasing understanding of inflammaging provides an array of biomarkers, some of which are now recommended in international guidelines. We also discuss therapeutic strategies aiming to modify the process of inflammaging and improve cardiovascular disease outcomes, either with immunomodulating agents or with therapies targeted at specific mechanisms, such as senolytics, telomerase activators, and pre- and probiotic supplementation. We conclude that inflammaging is a key part of cardiovascular aging and provides encouraging opportunities for new therapies. Graphical abstract The complex interplay of aging, inflammation, and cardiovascular disease is explored in this review by Spray et al. Cellular senescence, mitochondrial dysfunction, epigenetic alterations, and the aging gut microbiome are explored, with discussion of clinical sequelae and novel treatment strategies. Keywords inflammation inflammaging cardiovascular disease senescence mitochondrial dysfunction pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction The concept of inflammaging was introduced by Franceschi and colleagues in 2000, who used the network theory of aging to argue that repeated antigenic stimuli throughout life contributes to aging through a persistent stress response. 1 2 3 4 5 6 The mechanisms by which inflammaging impacts the CV system are broad, and this review will cover hallmarks of CV aging including cellular senescence, dysregulation of leukocytes, mitochondrial dysfunction, epigenetic changes, and gut dysbiosis. 7 Mechanisms of CV inflammaging Cellular senescence and senescence-associated secretory phenotype Cellular senescence was originally defined as a cell fate decision resulting in irreversible growth arrest, governed by tumor-suppressor pathways centered on p53/p21 CIP1 INK4a 8 9 , 10 9 11 12 Although senescence is often viewed as a detrimental process that contributes to tissue dysfunction and age-related disease, it is, in fact, an evolutionarily conserved program with important beneficial roles, particularly in early life. During embryonic development, senescence occurs at defined anatomical sites to facilitate tissue patterning and organogenesis, after which senescent cells are efficiently cleared by macrophages as part of normal developmental remodeling. 13 14 15 16 Senescent cells are characteristically resistant to apoptosis due to the upregulation of pro-survival and anti-apoptotic genes, collectively referred to as senescence cell anti-apoptotic pathways (SCAPs), a property believed to also contribute to their accumulation and persistence with age. Transcriptomic analyses have shown that senescent cells overexpress anti-apoptotic proteins such as BCL-2 and BCL-xL and activate pro-survival pathways like phosphoinositide 3-kinase (PI3K)/Akt. 17 17 Immune system aging and dysregulation Increased myeloid differentiation from hematopoietic stem cells (HSCs), with reduced lymphopoiesis, has been identified as a hallmark of immune aging. 18 19 20 21 22 In the heart, macrophages have a central role in regulating inflammation. CCR2− macrophages are embryonically derived, are self-sustaining, and appear to contribute to repair and the resolution of inflammation after myocardial injury, with upregulation of genes involved in myogenesis, epithelial-to-mesenchymal transition, and signal transducer and activator of transcription-5 (STAT5)/interleukin (IL)-2 signaling. 23 23 24 Adaptive immunity also undergoes significant alterations with advancing age. Most striking is the involution of the thymus, the organ responsible for a diverse and specific repertoire of T cell receptors (TCRs). 25 25 26 + + 27 It is also now understood that immunological memory is present in both the adaptive and innate immune systems, and in the latter it is termed trained immunity innate immune memory 28 29 30 31 32 In summary, aging is associated with changes across the immune system in both mice and humans, and there are multiple mechanisms by which these changes can cause chronic, low-level inflammation and promote CVD. Mitochondrial dysfunction and oxidative stress Mitochondria are responsible for the generation of adenosine triphosphate, act as a metabolic hub involved in myriad processes, and are critical signaling organelles in cellular homeostasis. Reactive oxygen species (ROSs) generated in mitochondria play a central role in various signaling pathways 33 Mitochondrial dysfunction is one of the hallmarks of aging 34 35 , 36 35 , 37 38 39 Besides serving as DAMPs, mitochondrial components can directly trigger activation of the inflammasome. Peroxidation of the mitochondrial lipid cardiolipin leads to its translocation from the inner to the outer mitochondrial membrane, where it can directly bind and activate the NLRP3 inflammasome, leading to the production of pro-inflammatory cytokines. 40 41 , 42 , 43 , 44 Epigenetic changes and dysregulated gene expression Epigenetic modifications, which regulate gene expression without altering the DNA sequences, are a key driver of chronic low-grade inflammation in aging CV systems, 45 46 47 48 49 DNA methylation involves the addition or removal of methyl groups by DNA methyltransferases (DNMTs) and ten-eleven translocation dioxygenases (TETs), primarily targeting CpG sites. This dynamic process, regulated by genetic and environmental factors, influences inflammatory pathways in circulating leukocytes, cytokine release, and CVD progression. 50 51 52 53 54 Aging impacts histone levels and post-translational modifications, altering chromatin structure and accessibility, shifting from a tightly packed heterochromatin to loosely organized euchromatin. This transition contributes to genomic instability, loss of gene silencing, and increased retrotransposon activity 55 13 56 Non-coding RNAs, including microRNAs, long non-coding RNAs, and circular RNAs, play critical roles in aging and inflammation and are associated with all-cause mortality and age-related traits. 57 , 58 59 59 60 Gut microbiome and systemic inflammation The human gastrointestinal tract hosts a large diversity of microorganisms. With aging, the gut microbiome loses this diversity and undergoes a change in the proportion of different microbes termed dysbiosis ( Figure 1 61 Faecalibacterium prauznitzii Clostridium cluster XIVa 62 F. prauznitzii 63 Clostridium cluster XIVa F. prauznitzii 64 65 Proteobacteria 62 66 67 68 69 Figure 1 Age-related gut dysbiosis enhances systemic inflammation CD40L, cluster of differentiation 40 ligand; IL-1β, interleukin-1 beta; IL-6, interleukin 6; LPS, lipopolysaccharide; NF-κB, nuclear factor κB; ROS, reactive oxygen species; TLR4, Toll-like receptor 4; TMAO, trimethylamine N-oxide; TML, trimethyllsine; TNF-α, tumor necrosis factor alpha. Consequences of CV inflammaging Atherosclerosis development and plaque instability There is an inextricable link between aging, the development of atherosclerosis, and its consequence in triggering acute coronary syndromes (ACSs). 70 71 72 Atherosclerosis is primed by endothelial dysfunction, which limits the early stages of disease to sites of disturbed flow, especially in males. 73 74 , 75 76 77 78 , 79 77 Aging plays a role in all stages of atherosclerotic plaque development, 74 80 81 82 83 84 85 The accumulation of senescent cells has also been implicated in the pathogenesis and progression of atherosclerosis. In murine models of atherosclerosis, such as Ldl r−/− Ink4a 86 Ldlr −/− 86 ApoE −/− 87 86 The role of aging in plaque rupture and resultant atherothrombosis are largely the consequences of the processes mentioned earlier. Biomechanical failure of the fibrous cap that leads to plaque rupture is promoted by SMC apoptosis and senescence preventing the replenishment of collagen within the fibrous cap. 88 89 90 91 92 90 Endothelial dysfunction and vascular stiffness Increased oxidative stress is a common denominator within aging-related pathology, driving cellular dysfunction and senescence while also increasing many pro-atherogenic processes. 93 74 94 72 , 95 As previously discussed, quenching of NO by prooxidant free radicals provides a permissive environment for smooth muscle cell proliferation, migration, and expansion of the intima. Additionally, prosenescent changes within the endothelium reduce the bioavailability of NO and result in a reduced capacity to repair. 96 97 98 , 99 100 101 102 103 Cellular plasticity may also play a role in aging-related vascular remodeling, through additional contribution to intimal hyperplasia and matrix production. The role of synthetic smooth muscle cells in forming the intimal hyperplasia is well established, 104 105 Cardiac remodeling and heart failure HF is a major public health problem, with high rates of hospitalization and death despite advances in medical therapy. Inflammation, both within the myocardium and systemically, is a key driver of adverse left ventricular remodeling in both ischemic and non-ischemic HF. 106 107 , 108 After left anterior desending artery (LAD) ligation, the development of ischemic HF is attenuated in mice without CD4 + 109 + 110 111 112 Much previous research has focused on HFrEF, but it is HFpEF, which most appears to be a disease of aging. 113 113 114 Thrombosis and coagulation changes Conditions associated with chronic inflammation are associated with an increased risk of thrombosis and CV events. 115 116 117 Both inflammation and aging are associated with increased platelet hyperreactivity. Prolonged exposure to TNF-α, IL-6, and IL-1β, in both the plasma and the bone marrow, primes platelets for activation, aggregation, 118 119 120 121 122 Over time, these effects of inflammaging lead to a hemostatic imbalance and prothrombotic state, increasing the risk of MI or stroke, and, in clinical studies, markers of thrombosis (soluble P-selectin, PAI-1, and VWF) 123 124 , 125 126 127 128 , 129 , 130 131 132 Figure 2 Figure 2 Inflammation predisposing to thrombus formation and target pathways of commonly used anti-thrombotic drugs Biomarkers of CV inflammaging Circulating biomarkers CRP, IL-6, and fibrinogen are well studied in the association of inflammation with CV aging. 1 , 2 133 134 , 135 136 137 Amyloid-beta 1-40 peptide is increasingly recognized as a key mediator of inflammaging in circulating leukocytes and the vascular wall. 138 , 139 138 , 139 138 , 139 140 , 141 49 The complex interplay between pro- and anti-inflammatory markers in inflammaging underscores the concept that an array of inflammatory biomarkers, rather than a single one, holds value for characterizing and assessing CVD risk. Circulating markers like CRP, IL-6, and fibrinogen enhance CVD risk assessment by providing insights beyond established traditional factors. From a primary prevention perspective, a level of high-sensitivity CRP ≥ 2.0 mg/L is suggested as a CV risk factor by the American College of Cardiology/American Heart Association for CVD prevention. 142 143 144 Imaging biomarkers CV inflammation can be detected, directly or indirectly, with diverse imaging modalities including ultrasonography, cardiovascular magnetic resonance (CMR), computed tomography (CT), and radionuclide imaging ( Figure 3 145 146 Figure 3 Markers available to assess cardiovascular inflammaging ROS, reactive oxygen species; CAC, coronary artery calcium scores; scRNA-seq, single-cell RNA sequencing; MMP, matrix metalloproteinase; CIMT, carotid intima-medial thickness; CT, computed tomography; FAI, fat attenuation index; PET-CT, positron emission tomography CT; CMR, cardiovascular magnetic resonance. CMR is often the first-line modality for assessment of cardiac inflammation due to its accessibility, lack of ionizing radiation, and unparalleled contrast resolution. Active inflammation is best visualized through mapping of transverse relaxation time (T2), with raised T2 either globally or in a specific region, being a histologically validated surrogate marker of myocardial edema. Longitudinal relaxation time (T1) mapping is less specific for inflammation but more sensitive to chronic injury and fibrosis, for which inflammation is one possible cause. The use of gadolinium-based contrast agents can show specific patterns of late-gadolinium enhancement, suggesting different etiologies. 147 148 The excellent spatial and temporal resolution of CT imaging make it first-line for non-invasively imaging the coronary arteries and also allows assessment of perivascular adipose tissue. When next to a high-risk atherosclerotic plaque (HRP), pre-adipocytes are prevented from developing into larger, lipid-rich adipocytes through peroxisome proliferator–activated receptor (PPAR)-γ signaling. 149 150 Radionuclide imaging is also indispensable in imaging CV inflammation. The radionuclide tracer 18F-fluorodeoxyglucose (18F-FDG) is a glucose analog, which accumulates in cells with high metabolic glucose utilization. Immune cells, particularly macrophages, in inflamed tissues have high glucose metabolism, and 18F-FDG uptake therefore functions as a marker of tissue inflammation. 18F-FDG positron emission tomography (PET)-CT is the gold-standard imaging modality for assessment of cardiac inflammation, with European guidelines recommending 18F-FDG PET-CT in the diagnosis of cardiac sarcoidosis. 151 Beyond these overtly inflammatory diseases, PET-CT shows promise in identifying HRP, using the tracer 18F-NaF, which localizes to tissues with micro-calcification, a marker of HRP. 152 153 Cellular biomarkers/CD28 null Senescent-like CD28 null null 154 + + null null 155 + 154 + null + null 155 3 156 , 157 null null + 158 null 158 Therapeutic interventions targeting CV inflammaging Anti-inflammatory drugs The theory that drugs exerting anti-inflammatory effects may benefit the CV system is not new, although historic trials, such as those of TNF-α inhibitors in HF, have been disappointing. 107 , 108 159 144 Three seminal randomised controlled trials—CANTOS, 160 161 162 49 160 A meta-analysis of six randomized clinical trials involving nearly 15,000 patients with prior coronary disease demonstrated a consistent benefit of colchicine for the prevention of major adverse CV events. 163 164 Upstream regulators of inflammation, such as mitochondrial function, are also a promising target for immunomodulating therapies in CVD. In a randomized clinical trial in 90 patients with MI aged >65 years, treatment with the mitochondrial telomerase activator TA-65 reduced circulating inflammatory markers and increased the numbers of adaptive immune cells compared with placebo. 42 Emerging studies on cell-based therapeutics suggest the potential for more precise interventions compared to traditional compound-based approaches. Notably, novel strategies involving the ex vivo 165 , 166 , 167 Senolytics and senomorphics The two major therapeutic strategies being actively investigated as interventions for cellular senescence, and the impact of the SASP on CVD, are senolytics and senomorphics. Senolytics are a class of drugs that selectively eliminate senescent cells by exploiting their dependence on pro-survival pathways, known as SCAPs. 168 17 , 169 The first identified senolytic combination—dasatinib (D) and quercetin (Q)—remains the most widely studied. 17 17 , 170 17 , 87 171 172 Beyond these, additional senolytic compounds—including cardiac glycosides (digoxin and digitoxin), HSP90 inhibitors, and p53-targeting molecules—have demonstrated broad-spectrum senolytic activity. 173 174 175 176 Therefore senomorphics (or senostatics), which act by modulating the SASP, reducing inflammatory cytokine secretion without inducing apoptosis, may offer an alternative therapeutic approach. Several existing drugs have been repurposed as senomorphics due to their ability to suppress SASP-associated inflammation. Metformin, a widely used adenosine monophosphate-activated protein kinase (AMPK) activator used to treat type 2 diabetes, reduces SASP expression by inhibiting NF-κB signaling and IL-6 secretion. 177 177 178 179 180 Senescence-associated mitochondrial dysfunction can also be reversed by targeting senescence. 172 181 181 181 Lifestyle interventions Exercise, diet, and sleep patterns are all significant determinants of CV health. 182 , 183 184 184 185 ad libitum 186 187 188 Gut microbiome modulation Several interventions can be done to modulate and change the gut microbiome, including probiotics, prebiotics, and fecal microbiome transplantation (FMT). Probiotics consist of living microorganisms that increase the quantity of beneficial bacteria, such as Lactobacillus Eubacterium Enterococcus Pseudomonas 189 190 191 Lactobacillus 192 Clostridium difficile 193 194 Conclusion: Inflammaging as an opportunity for personalized medicine Currently, CV risk assessment and management are largely based on conventional risk factors, such as the presence or absence of diabetes or level of LDL cholesterol. 195 196 197 198 Declaration of interests The authors declare no competing interests. References 1 Franceschi C. Bonafè M. Valensin S. Olivieri F. De Luca M. Ottaviani E. De Benedictis G. Inflamm-aging. An evolutionary perspective on immunosenescence Ann. N. Y. Acad. Sci. 908 2000 244 254 10.1111/j.1749-6632.2000.tb06651.x 10911963 2 Gardner I.D. The effect of aging on susceptibility to infection Rev. Infect. Dis. 2 1980 801 810 10.1093/clinids/2.5.801 6763306 3 Ershler W.B. Interleukin-6: a cytokine for gerontologists J. Am. Geriatr. Soc. 41 1993 176 181 10.1111/j.1532-5415.1993.tb02054.x 8426042 4 Liu Z. Liang Q. Ren Y. Guo C. Ge X. Wang L. Cheng Q. Luo P. Zhang Y. Han X. Immunosenescence: molecular mechanisms and diseases Signal Transduct. Target. Ther. 8 2023 200 10.1038/s41392-023-01451-2 37179335 PMC10182360 5 Centers for Disease Control and Prevention. National Vital Statistics System, Mortality 2018-2023 on CDC WONDER Online Database, released in 2024. Data are from the Multiple Cause of Death Files, 2018-2023, as compiled from data provided by the 57 vital statistics jurisdictions through the Vital Statistics Cooperative Program. 8th May 2025 ( http://wonder.cdc.gov/ucd-icd10-expanded.html 6 Martin S.S. Aday A.W. Almarzooq Z.I. Anderson C.A. Arora P. Avery C.L. Baker-Smith C.M. Barone Gibbs B. Beaton A.Z. Boehme A.K. 2024 Heart Disease and Stroke Statistics: A Report of US and Global Data From the American Heart Association Circulation 149 2024 e347 e913 10.1161/CIR.0000000000001209 38264914 PMC12146881 7 Abdellatif M. Rainer P.P. Sedej S. Kroemer G. Hallmarks of cardiovascular ageing Nat. Rev. Cardiol. 20 2023 754 777 10.1038/s41569-023-00881-3 37193857 8 Campisi J. Aging, cellular senescence, and cancer Annu. Rev. Physiol. 75 2013 685 705 10.1146/annurev-physiol-030212-183653 23140366 PMC4166529 9 Acosta J.C. Banito A. Wuestefeld T. Georgilis A. Janich P. Morton J.P. Athineos D. Kang T.W. Lasitschka F. Andrulis M. A complex secretory program orchestrated by the inflammasome controls paracrine senescence Nat. Cell Biol. 15 2013 978 990 10.1038/ncb2784 23770676 PMC3732483 10 Passos J.F. Simillion C. Hallinan J. Wipat A. von Zglinicki T. Cellular senescence: unravelling complexity Age (Dordr) 31 2009 353 363 10.1007/s11357-009-9108-1 19618294 PMC2813046 11 Chien Y. Scuoppo C. Wang X. Fang X. Balgley B. Bolden J.E. Premsrirut P. Luo W. Chicas A. Lee C.S. Control of the senescence-associated secretory phenotype by NF-κB promotes senescence and enhances chemosensitivity Genes Dev. 25 2011 2125 2136 10.1101/gad.17276711 21979375 PMC3205583 12 Anderson R. Lagnado A. Maggiorani D. Walaszczyk A. Dookun E. Chapman J. Birch J. Salmonowicz H. Ogrodnik M. Jurk D. Length-independent telomere damage drives post-mitotic cardiomyocyte senescence Embo j 38 2019 e100492 10.15252/embj.2018100492 PMC6396144 30737259 13 Rhinn M. Ritschka B. Keyes W.M. Cellular senescence in development, regeneration and disease Development 146 2019 dev151837 10.1242/dev.151837 31575608 14 Serrano M. Lin A.W. McCurrach M.E. Beach D. Lowe S.W. Oncogenic ras provokes premature cell senescence associated with accumulation of p53 and p16INK4a Cell 88 1997 593 602 10.1016/s0092-8674(00)81902-9 9054499 15 Baker D.J. Narita M. Muñoz-Cánoves P. Cellular senescence: beneficial, harmful, and highly complex FEBS J. 290 2023 1156 1160 10.1111/febs.16735 36856679 16 Giaimo S. d'Adda di Fagagna F. Is cellular senescence an example of antagonistic pleiotropy? Aging Cell 11 2012 378 383 10.1111/j.1474-9726.2012.00807.x 22329645 17 Zhu Y. Tchkonia T. Pirtskhalava T. Gower A.C. Ding H. Giorgadze N. Palmer A.K. Ikeno Y. Hubbard G.B. Lenburg M. The Achilles' heel of senescent cells: from transcriptome to senolytic drugs Aging Cell 14 2015 644 658 10.1111/acel.12344 25754370 PMC4531078 18 Shaw A.C. Goldstein D.R. Montgomery R.R. Age-dependent dysregulation of innate immunity Nat. Rev. Immunol. 13 2013 875 887 10.1038/nri3547 24157572 PMC4096436 19 Cho R.H. Sieburg H.B. Muller-Sieburg C.E. A new mechanism for the aging of hematopoietic stem cells: aging changes the clonal composition of the stem cell compartment but not individual stem cells Blood 111 2008 5553 5561 10.1182/blood-2007-11-123547 18413859 PMC2424153 20 Pang W.W. Price E.A. Sahoo D. Beerman I. Maloney W.J. Rossi D.J. Schrier S.L. Weissman I.L. Human bone marrow hematopoietic stem cells are increased in frequency and myeloid-biased with age Proc. Natl. Acad. Sci. USA 108 2011 20012 20017 10.1073/pnas.1116110108 22123971 PMC3250139 21 Dillon K. Goodman Z.T. Kaur S.S. Levin B. McIntosh R. Neutrophil-to-Lymphocyte Ratio Amplifies the Effects of Aging on Decrements in Grip Strength and Its Functional Neural Underpinnings J. Gerontol. A Biol. Sci. Med. Sci. 78 2023 882 889 10.1093/gerona/glad048 36757160 PMC10235193 22 He Y. Liu X. Wang M. Ke H. Ge C. Neutrophil-to-lymphocyte ratio as a predictor of cardiovascular mortality in cancer survivors Sci. Rep. 14 2024 20980 10.1038/s41598-024-72027-5 PMC11385526 39251691 23 Bajpai G. Schneider C. Wong N. Bredemeyer A. Hulsmans M. Nahrendorf M. Epelman S. Kreisel D. Liu Y. Itoh A. The human heart contains distinct macrophage subsets with divergent origins and functions Nat. Med. 24 2018 1234 1245 10.1038/s41591-018-0059-x 29892064 PMC6082687 24 Molawi K. Wolf Y. Kandalla P.K. Favret J. Hagemeyer N. Frenzel K. Pinto A.R. Klapproth K. Henri S. Malissen B. Progressive replacement of embryo-derived cardiac macrophages with age J. Exp. Med. 211 2014 2151 2158 10.1084/jem.20140639 25245760 PMC4203946 25 Thapa P. Farber D.L. The Role of the Thymus in the Immune Response Thorac. Surg. Clin. 29 2019 123 131 10.1016/j.thorsurg.2018.12.001 30927993 PMC6446584 26 Desdín-Micó G. Soto-Heredero G. Aranda J.F. Oller J. Carrasco E. Gabandé-Rodríguez E. Blanco E.M. Alfranca A. Cussó L. Desco M. T cells with dysfunctional mitochondria induce multimorbidity and premature senescence Science 368 2020 1371 1376 10.1126/science.aax0860 32439659 PMC7616968 27 Tyrrell D.J. Wragg K.M. Chen J. Wang H. Song J. Blin M.G. Bolding C. Vardaman D. 3rd Giles K. Tidwell H. Clonally expanded memory CD8(+) T cells accumulate in atherosclerotic plaques and are pro-atherogenic in aged mice Nat. Aging 3 2023 1576 1590 10.1038/s43587-023-00515-w 37996758 PMC11924142 28 Netea M.G. Joosten L.A.B. Latz E. Mills K.H.G. Natoli G. Stunnenberg H.G. O'Neill L.A.J. Xavier R.J. Trained immunity: A program of innate immune memory in health and disease Science 352 2016 aaf1098 10.1126/science.aaf1098 PMC5087274 27102489 29 Riksen N.P. Bekkering S. Mulder W.J.M. Netea M.G. Trained immunity in atherosclerotic cardiovascular disease Nat. Rev. Cardiol. 20 2023 799 811 10.1038/s41569-023-00894-y 37322182 30 Geng S. Chen K. Yuan R. Peng L. Maitra U. Diao N. Chen C. Zhang Y. Hu Y. Qi C.F. The persistence of low-grade inflammatory monocytes contributes to aggravated atherosclerosis Nat. Commun. 7 2016 13436 10.1038/ncomms13436 PMC5105176 27824038 31 Geng S. Zhang Y. Lee C. Li L. Novel reprogramming of neutrophils modulates inflammation resolution during atherosclerosis Sci. Adv. 5 2019 eaav2309 10.1126/sciadv.aav2309 PMC6365109 30775441 32 Lavillegrand J.-R. Al-Rifai R. Thietart S. Guyon T. Vandestienne M. Cohen R. Duval V. Zhong X. Yen D. Ozturk M. Alternating high-fat diet enhances atherosclerosis by neutrophil reprogramming Nature 634 2024 447 456 10.1038/s41586-024-07693-6 39232165 PMC12019644 33 Shadel G.S. Horvath T.L. Mitochondrial ROS signaling in organismal homeostasis Cell 163 2015 560 569 10.1016/j.cell.2015.10.001 26496603 PMC4634671 34 Hernandez-Segura A. Nehme J. Demaria M. Hallmarks of Cellular Senescence Trends Cell Biol. 28 2018 436 453 10.1016/j.tcb.2018.02.001 29477613 35 LaRocca T.J. Hearon C.M. Jr. Henson G.D. Seals D.R. Mitochondrial quality control and age-associated arterial stiffening Exp. Gerontol. 58 2014 78 82 10.1016/j.exger.2014.07.008 25034910 PMC4252265 36 Foote K. Reinhold J. Yu E.P.K. Figg N.L. Finigan A. Murphy M.P. Bennett M.R. Restoring mitochondrial DNA copy number preserves mitochondrial function and delays vascular aging in mice Aging Cell 17 2018 e12773 10.1111/acel.12773 PMC6052475 29745022 37 Tyrrell D.J. Blin M.G. Song J. Wood S.C. Goldstein D.R. Aging Impairs Mitochondrial Function and Mitophagy and Elevates Interleukin 6 Within the Cerebral Vasculature J. Am. Heart Assoc. 9 2020 e017820 10.1161/jaha.120.017820 PMC7763766 33225820 38 Jiménez-Loygorri J.I. Villarejo-Zori B. Viedma-Poyatos Á. Zapata-Muñoz J. Benítez-Fernández R. Frutos-Lisón M.D. Tomás-Barberán F.A. Espín J.C. Area-Gómez E. Gomez-Duran A. Boya P. Mitophagy curtails cytosolic mtDNA-dependent activation of cGAS/STING inflammation during aging Nat. Commun. 15 2024 830 10.1038/s41467-024-45044-1 38280852 PMC10821893 39 Huang Y. Jiang W. Zhou R. DAMP sensing and sterile inflammation: intracellular, intercellular and inter-organ pathways Nat. Rev. Immunol. 24 2024 703 719 10.1038/s41577-024-01027-3 38684933 40 Iyer S.S. He Q. Janczy J.R. Elliott E.I. Zhong Z. Olivier A.K. Sadler J.J. Knepper-Adrian V. Han R. Qiao L. Mitochondrial cardiolipin is required for Nlrp3 inflammasome activation Immunity 39 2013 311 323 10.1016/j.immuni.2013.08.001 23954133 PMC3779285 41 Ale-Agha N. Jakobs P. Goy C. Zurek M. Rosen J. Dyballa-Rukes N. Metzger S. Greulich J. von Ameln F. Eckermann O. Mitochondrial Telomerase Reverse Transcriptase Protects From Myocardial Ischemia/Reperfusion Injury by Improving Complex I Composition and Function Circulation 144 2021 1876 1890 10.1161/circulationaha.120.051923 34672678 42 Bawamia B. Spray L. Wangsaputra V.K. Bennaceur K. Vahabi S. Stellos K. Kharatikoopaei E. Ogundimu E. Gale C.P. Keavney B. Activation of telomerase by TA-65 enhances immunity and reduces inflammation post myocardial infarction Geroscience 45 2023 2689 2705 10.1007/s11357-023-00794-6 37086366 PMC10122201 43 Ale-Agha N. Goy C. Jakobs P. Spyridopoulos I. Gonnissen S. Dyballa-Rukes N. Aufenvenne K. von Ameln F. Zurek M. Spannbrucker T. CDKN1B/p27 is localized in mitochondria and improves respiration-dependent processes in the cardiovascular system-New mode of action for caffeine PLoS Biol. 16 2018 e2004408 10.1371/journal.pbio.2004408 PMC6013014 29927970 44 Li K. Liu P. Ye J. Liu M. Zhu L. Causal association of metformin treatment with diverse cardiovascular diseases: a Mendelian randomization analysis Aging (Albany NY) 16 2024 7668 7682 10.18632/aging.205775 38683129 PMC11132001 45 Yang J.H. Hayano M. Griffin P.T. Amorim J.A. Bonkowski M.S. Apostolides J.K. Salfati E.L. Blanchette M. Munding E.M. Bhakta M. Loss of epigenetic information as a cause of mammalian aging Cell 186 2023 305 326 10.1016/j.cell.2022.12.027 36638792 PMC10166133 46 Zhu X. Chen Z. Shen W. Huang G. Sedivy J.M. Wang H. Ju Z. Inflammation, epigenetics, and metabolism converge to cell senescence and ageing: the regulation and intervention Signal Transduct. Target. Ther. 6 2021 245 10.1038/s41392-021-00646-9 34176928 PMC8236488 47 Asllanaj E. Zhang X. Ochoa Rosales C. Nano J. Bramer W.M. Portilla-Fernandez E. Braun K.V.E. Gonzalez-Jaramillo V. Ahrens W. Ikram A. Sexually dimorphic DNA-methylation in cardiometabolic health: A systematic review Maturitas 135 2020 6 26 10.1016/j.maturitas.2020.02.005 32252966 48 Sanchez-Cabo F. Fuster V. Silla-Castro J.C. González G. Lorenzo-Vivas E. Alvarez R. Callejas S. Benguría A. Gil E. Núñez E. Subclinical atherosclerosis and accelerated epigenetic age mediated by inflammation: a multi-omics study Eur. Heart J. 44 2023 2698 2709 10.1093/eurheartj/ehad361 37339167 PMC10393076 49 Liberale L. Tual-Chalot S. Sedej S. Ministrini S. Georgiopoulos G. Grunewald M. Bäck M. Bochaton-Piallat M.L. Boon R.A. Ramos G.C. Roadmap for alleviating the manifestations of ageing in the cardiovascular system Nat. Rev. Cardiol. 22 2025 577 605 10.1038/s41569-025-01130-5 39972009 50 Jaiswal S. Libby P. Clonal haematopoiesis: connecting ageing and inflammation in cardiovascular disease Nat. Rev. Cardiol. 17 2020 137 144 10.1038/s41569-019-0247-5 31406340 PMC9448847 51 Benayoun B.A. Pollina E.A. Brunet A. Epigenetic regulation of ageing: linking environmental inputs to genomic stability Nat. Rev. Mol. Cell Biol. 16 2015 593 610 10.1038/nrm4048 26373265 PMC4736728 52 Zaina S. Heyn H. Carmona F.J. Varol N. Sayols S. Condom E. Ramírez-Ruz J. Gomez A. Gonçalves I. Moran S. Esteller M. DNA methylation map of human atherosclerosis Circ. Cardiovasc. Genet. 7 2014 692 700 10.1161/CIRCGENETICS.113.000441 25091541 53 Matt S.M. Lawson M.A. Johnson R.W. Aging and peripheral lipopolysaccharide can modulate epigenetic regulators and decrease IL-1beta promoter DNA methylation in microglia Neurobiol. Aging 47 2016 1 9 10.1016/j.neurobiolaging.2016.07.006 27500965 PMC5075520 54 Svensson E.C. Madar A. Campbell C.D. He Y. Sultan M. Healey M.L. Xu H. D'Aco K. Fernandez A. Wache-Mainier C. TET2-Driven Clonal Hematopoiesis and Response to Canakinumab: An Exploratory Analysis of the CANTOS Randomized Clinical Trial JAMA Cardiol. 7 2022 521 528 10.1001/jamacardio.2022.0386 35385050 PMC8988022 55 Cheung P. Vallania F. Warsinske H.C. Donato M. Schaffert S. Chang S.E. Dvorak M. Dekker C.L. Davis M.M. Utz P.J. Single-Cell Chromatin Modification Profiling Reveals Increased Epigenetic Variations with Aging Cell 173 2018 1385 1397 10.1016/j.cell.2018.03.079 29706550 PMC5984186 56 Wang K. Liu H. Hu Q. Wang L. Liu J. Zheng Z. Zhang W. Ren J. Zhu F. Liu G.H. Epigenetic regulation of aging: implications for interventions of aging and diseases Signal Transduct. Target. Ther. 7 2022 374 10.1038/s41392-022-01211-8 36336680 PMC9637765 57 Jusic A. Thomas P.B. Wettinger S.B. Dogan S. Farrugia R. Gaetano C. Tuna B.G. Pinet F. Robinson E.L. Tual-Chalot S. Noncoding RNAs in age-related cardiovascular diseases Ageing Res. Rev. 77 2022 101610 10.1016/j.arr.2022.101610 35338919 58 Badi I. Burba I. Ruggeri C. Zeni F. Bertolotti M. Scopece A. Pompilio G. Raucci A. MicroRNA-34a Induces Vascular Smooth Muscle Cells Senescence by SIRT1 Downregulation and Promotes the Expression of Age-Associated Pro-inflammatory Secretory Factors J. Gerontol. A Biol. Sci. Med. Sci. 70 2015 1304 1311 10.1093/gerona/glu180 25352462 59 Gatsiou A. Georgiopoulos G. Vlachogiannis N.I. Pfisterer L. Fischer A. Sachse M. Laina A. Bonini F. Delialis D. Tual-Chalot S. Additive contribution of microRNA-34a/b/c to human arterial ageing and atherosclerosis Atherosclerosis 327 2021 49 58 10.1016/j.atherosclerosis.2021.05.005 34038763 60 Sachse M. Tual-Chalot S. Ciliberti G. Amponsah-Offeh M. Stamatelopoulos K. Gatsiou A. Stellos K. RNA-binding proteins in vascular inflammation and atherosclerosis Atherosclerosis 374 2023 55 73 10.1016/j.atherosclerosis.2023.01.008 36759270 61 Zeng M.Y. Inohara N. Nuñez G. Mechanisms of inflammation-driven bacterial dysbiosis in the gut Mucosal Immunol. 10 2017 18 26 10.1038/mi.2016.75 27554295 PMC5788567 62 Biagi E. Nylund L. Candela M. Ostan R. Bucci L. Pini E. Nikkïla J. Monti D. Satokari R. Franceschi C. Through ageing, and beyond: gut microbiota and inflammatory status in seniors and centenarians PLoS One 5 2010 e10667 10.1371/journal.pone.0010667 PMC2871786 20498852 63 Sokol H. Pigneur B. Watterlot L. Lakhdari O. Bermúdez-Humarán L.G. Gratadoux J.J. Blugeon S. Bridonneau C. Furet J.P. Corthier G. Faecalibacterium prausnitzii is an anti-inflammatory commensal bacterium identified by gut microbiota analysis of Crohn disease patients Proc. Natl. Acad. Sci. USA 105 2008 16731 16736 10.1073/pnas.0804812105 18936492 PMC2575488 64 Van den Abbeele P. Belzer C. Goossens M. Kleerebezem M. De Vos W.M. Thas O. De Weirdt R. Kerckhof F.M. Van de Wiele T. Butyrate-producing Clostridium cluster XIVa species specifically colonize mucins in an in vitro gut model Isme j 7 2013 949 961 10.1038/ismej.2012.158 23235287 PMC3635240 65 Segain J.P. Raingeard de la Blétière D. Bourreille A. Leray V. Gervois N. Rosales C. Ferrier L. Bonnet C. Blottière H.M. Galmiche J.P. Butyrate inhibits inflammatory responses through NFkappaB inhibition: implications for Crohn's disease Gut 47 2000 397 403 10.1136/gut.47.3.397 10940278 PMC1728045 66 Lu Y.C. Yeh W.C. Ohashi P.S. LPS/TLR4 signal transduction pathway Cytokine 42 2008 145 151 10.1016/j.cyto.2008.01.006 18304834 67 Nesci A. Carnuccio C. Ruggieri V. D'Alessandro A. Di Giorgio A. Santoro L. Gasbarrini A. Santoliquido A. Ponziani F.R. Gut Microbiota and Cardiovascular Disease: Evidence on the Metabolic and Inflammatory Background of a Complex Relationship Int. J. Mol. Sci. 24 2023 9087 10.3390/ijms24109087 PMC10219307 37240434 68 Duttaroy A.K. Role of Gut Microbiota and Their Metabolites on Atherosclerosis, Hypertension and Human Blood Platelet Function: A Review Nutrients 13 2021 144 10.3390/nu13010144 PMC7824497 33401598 69 Jia Q. Li H. Zhou H. Zhang X. Zhang A. Xie Y. Li Y. Lv S. Zhang J. Role and Effective Therapeutic Target of Gut Microbiota in Heart Failure Cardiovasc. Ther. 2019 2019 5164298 10.1155/2019/5164298 PMC6885196 31819762 70 Sundaram V. Bloom C. Zakeri R. Halcox J. Cohen A. Bowrin K. Briere J.B. Banerjee A. Simon D.I. Cleland J.G.F. Temporal trends in the incidence, treatment patterns, and outcomes of coronary artery disease and peripheral artery disease in the UK, 2006–2015 Eur. Heart J. 41 2020 1636 1649 10.1093/eurheartj/ehz880 31883328 71 Aranda J.F. Ramírez C.M. Mittelbrunn M. Inflammageing, a targetable pathway for preventing cardiovascular diseases Cardiovasc. Res. 12 2024 cvae240 10.1093/cvr/cvae240 PMC12391671 39530590 72 Buford T.W. Hypertension and aging Ageing Res. Rev. 26 2016 96 111 10.1016/j.arr.2016.01.007 26835847 PMC4768730 73 Wentzel J.J. Bos D. White S.J. van der Heiden K. Kavousi M. Evans P.C. Sex-related differences in coronary and carotid vessel geometry, plaque composition and shear stress obtained from imaging Atherosclerosis 395 2024 117616 10.1016/j.atherosclerosis.2024.117616 38944895 74 Donato A.J. Machin D.R. Lesniewski L.A. Mechanisms of Dysfunction in the Aging Vasculature and Role in Age-Related Disease Circ. Res. 123 2018 825 848 10.1161/CIRCRESAHA.118.312563 30355078 PMC6207260 75 Augustin H.G. Koh G.Y. A systems view of the vascular endothelium in health and disease Cell 187 2024 4833 4858 10.1016/j.cell.2024.07.012 39241746 76 Jeremy J.Y. Rowe D. Emsley A.M. Newby A.C. Nitric oxide and the proliferation of vascular smooth muscle cells Cardiovasc. Res. 43 1999 580 594 10.1016/s0008-6363(99)00171-6 10690330 77 Virmani R. Kolodgie F.D. Burke A.P. Farb A. Schwartz S.M. Lessons from sudden coronary death - A comprehensive morphological classification scheme for atherosclerotic lesions Arterioscler. Thromb. Vasc. Biol. 20 2000 1262 1275 10807742 10.1161/01.atv.20.5.1262 78 Roy P. Orecchioni M. Ley K. How the immune system shapes atherosclerosis: roles of innate and adaptive immunity Nat. Rev. Immunol. 22 2022 251 265 10.1038/s41577-021-00584-1 34389841 PMC10111155 79 Rhoads J.P. Major A.S. How Oxidized Low-Density Lipoprotein Activates Inflammatory Responses Crit. Rev. Immunol. 38 2018 333 342 10.1615/CritRevImmunol.2018026483 30806246 PMC6527110 80 Snijckers R.P.M. Foks A.C. Adaptive immunity and atherosclerosis: aging at its crossroads Front. Immunol. 15 2024 1350471 10.3389/fimmu.2024.1350471 PMC11056569 38686373 81 Li H. Côté P. Kuoch M. Ezike J. Frenis K. Afanassiev A. Greenstreet L. Tanaka-Yano M. Tarantino G. Zhang S. The dynamics of hematopoiesis over the human lifespan Nat. Methods 2 2024 422 434 10.1038/s41592-024-02495-0 PMC11908799 39639169 82 Tyrrell D.J. Goldstein D.R. Ageing and atherosclerosis: vascular intrinsic and extrinsic factors and potential role of IL-6 Nat. Rev. Cardiol. 18 2021 58 68 10.1038/s41569-020-0431-7 32918047 PMC7484613 83 Wang S. Hu S. Luo X. Bao X. Li J. Liu M. Lv Y. Zhao C. Zeng M. Chen X. Prevalence and prognostic significance of DNMT3A- and TET2- clonal haematopoiesis-driver mutations in patients presenting with ST-segment elevation myocardial infarction EBioMedicine 78 2022 103964 10.1016/j.ebiom.2022.103964 PMC8960977 35339897 84 Gerhardt T. Haghikia A. Stapmanns P. Leistner D.M. Immune Mechanisms of Plaque Instability Front. Cardiovasc. Med. 8 2021 797046 10.3389/fcvm.2021.797046 PMC8787133 35087883 85 Sun Y. Wang X. Liu T. Zhu X. Pan X. The multifaceted role of the SASP in atherosclerosis: from mechanisms to therapeutic opportunities Cell Biosci. 12 2022 74 10.1186/s13578-022-00815-5 35642067 PMC9153125 86 Childs B.G. Baker D.J. Wijshake T. Conover C.A. Campisi J. van Deursen J.M. Senescent intimal foam cells are deleterious at all stages of atherosclerosis Science 354 2016 472 477 10.1126/science.aaf6659 27789842 PMC5112585 87 Roos C.M. Zhang B. Palmer A.K. Ogrodnik M.B. Pirtskhalava T. Thalji N.M. Hagler M. Jurk D. Smith L.A. Casaclang-Verzosa G. Chronic senolytic treatment alleviates established vasomotor dysfunction in aged or atherosclerotic mice Aging Cell 15 2016 973 977 10.1111/acel.12458 26864908 PMC5013022 88 Bentzon J.F. Otsuka F. Virmani R. Falk E. Mechanisms of Plaque Formation and Rupture Circ. Res. 114 2014 1852 1866 10.1161/circresaha.114.302721 24902970 89 Wang L. Hong W. Zhu H. He Q. Yang B. Wang J. Weng Q. Macrophage senescence in health and diseases Acta Pharm. Sin. B 14 2024 1508 1524 10.1016/j.apsb.2024.01.008 38572110 PMC10985037 90 Satta S. Beal R. Smith R. Luo X. Ferris G.R. Langford-Smith A. Teasdale J. Ajime T.T. Serré J. Hazell G. A Nrf2-OSGIN1&2-HSP70 axis mediates cigarette smoke-induced endothelial detachment: implications for plaque erosion Cardiovasc. Res. 119 2023 1869 1882 10.1093/cvr/cvad022 36804807 PMC10405570 91 White S.J. Newby A.C. Johnson T.W. Endothelial erosion of plaques as a substrate for coronary thrombosis Thromb. Haemost. 115 2016 509 519 10.1160/TH15-09-0765 26791872 92 Farhat N. Thorin-Trescases N. Voghel G. Villeneuve L. Mamarbachi M. Perrault L.P. Carrier M. Thorin E. Stress-induced senescence predominates in endothelial cells isolated from atherosclerotic chronic smokers Can. J. Physiol. Pharmacol. 86 2008 761 769 10.1139/Y08-082 19011671 PMC3701584 93 Liguori I. Russo G. Curcio F. Bulli G. Aran L. Della-Morte D. Gargiulo G. Testa G. Cacciatore F. Bonaduce D. Abete P. Oxidative stress, aging, and diseases Clin. Interv. Aging 13 2018 757 772 10.2147/cia.S158513 29731617 PMC5927356 94 Dickhout J.G. Hossain G.S. Pozza L.M. Zhou J. Lhoták S. Austin R.C. Peroxynitrite causes endoplasmic reticulum stress and apoptosis in human vascular endothelium: implications in atherogenesis Arterioscler. Thromb. Vasc. Biol. 25 2005 2623 2629 10.1161/01.ATV.0000189159.96900.d9 16210571 95 Sharifi-Rad M. Anil Kumar N.V. Zucca P. Varoni E.M. Dini L. Panzarini E. Rajkovic J. Tsouh Fokou P.V. Azzini E. Peluso I. Lifestyle, Oxidative Stress, and Antioxidants: Back and Forth in the Pathophysiology of Chronic Diseases Front. Physiol. 11 2020 694 10.3389/fphys.2020.00694 PMC7347016 32714204 96 Han Y. Kim S.Y. Endothelial senescence in vascular diseases: current understanding and future opportunities in senotherapeutics Exp. Mol. Med. 55 2023 1 12 10.1038/s12276-022-00906-w 36599934 PMC9898542 97 Davies M.J. Woolf N. Rowles P.M. Pepper J. Morphology of the endothelium over atherosclerotic plaques in human coronary arteries Br. Heart J. 60 1988 459 464 10.1136/hrt.60.6.459 3066389 PMC1224883 98 Chen P.-Y. Qin L. Li G. Tellides G. Simons M. Fibroblast growth factor (FGF) signaling regulates transforming growth factor beta (TGFβ)-dependent smooth muscle cell phenotype modulation Sci. Rep. 6 2016 33407 10.1038/srep33407 PMC5025753 27634335 99 Smith S.A. Newby A.C. Bond M. Ending Restenosis: Inhibition of Vascular Smooth Muscle Cell Proliferation by cAMP Cells 8 2019 1447 https://www.mdpi.com/2073-4409/8/11/1447 31744111 10.3390/cells8111447 PMC6912325 100 Aronson D. Cross-linking of glycated collagen in the pathogenesis of arterial and myocardial stiffening of aging and diabetes J. Hypertens. 21 2003 3 12 10.1097/00004872-200301000-00002 12544424 101 Vogel V. Sheetz M. Local force and geometry sensing regulate cell functions Nat. Rev. Mol. Cell Biol. 7 2006 265 275 10.1038/nrm1890 16607289 102 Xu Z. Chen Y. Wang Y. Han W. Xu W. Liao X. Zhang T. Wang G. Matrix stiffness, endothelial dysfunction and atherosclerosis Mol. Biol. Rep. 50 2023 7027 7041 10.1007/s11033-023-08502-5 37382775 103 He H. Zeng B. Wu X. Hou J. Wang Y. Wang Y. Lin Y. Wu P. Zheng C. Yin H. Wang N. Higher matrix stiffness promotes VSMC senescence by affecting mitochondria-ER contact sites and mitochondria/ER dysfunction Faseb j 37 2023 e23318 10.1096/fj.202301198RR 37997545 104 Yu Y. Cai Y. Yang F. Yang Y. Cui Z. Shi D. Bai R. Vascular smooth muscle cell phenotypic switching in atherosclerosis Heliyon 10 2024 e37727 10.1016/j.heliyon.2024.e37727 PMC11416558 39309965 105 Singh B. Cui K. Eisa-Beygi S. Zhu B. Cowan D.B. Shi J. Wang D.Z. Liu Z. Bischoff J. Chen H. Elucidating the crosstalk between endothelial-to-mesenchymal transition (EndoMT) and endothelial autophagy in the pathogenesis of atherosclerosis Vascul. Pharmacol. 155 2024 107368 10.1016/j.vph.2024.107368 PMC11303600 38548093 106 Murphy S.P. Kakkar R. McCarthy C.P. Januzzi J.L. Inflammation in Heart Failure J. Am. Coll. Cardiol. 75 2020 1324 1340 10.1016/j.jacc.2020.01.014 32192660 107 Chung E.S. Packer M. Lo K.H. Fasanmade A.A. Willerson J.T. Anti-TNF Therapy Against Congestive Heart Failure Investigators Randomized, double-blind, placebo-controlled, pilot trial of infliximab, a chimeric monoclonal antibody to tumor necrosis factor-alpha, in patients with moderate-to-severe heart failure: results of the anti-TNF Therapy Against Congestive Heart Failure (ATTACH) trial Circulation 107 2003 3133 3140 10.1161/01.Cir.0000077913.60364.D2 12796126 108 Mann D.L. McMurray J.J.V. Packer M. Swedberg K. Borer J.S. Colucci W.S. Djian J. Drexler H. Feldman A. Kober L. Targeted anticytokine therapy in patients with chronic heart failure: results of the Randomized Etanercept Worldwide Evaluation (RENEWAL) Circulation 109 2004 1594 1602 10.1161/01.Cir.0000124490.27666.B2 15023878 109 Yang Z. Day Y.J. Toufektsian M.C. Xu Y. Ramos S.I. Marshall M.A. French B.A. Linden J. Myocardial infarct-sparing effect of adenosine A2A receptor activation is due to its action on CD4+ T lymphocytes Circulation 114 2006 2056 2064 10.1161/circulationaha.106.649244 17060376 110 Maisel A. Cesario D. Baird S. Rehman J. Haghighi P. Carter S. Experimental autoimmune myocarditis produced by adoptive transfer of splenocytes after myocardial infarction Circ. Res. 82 1998 458 463 10.1161/01.res.82.4.458 9506706 111 Laroumanie F. Douin-Echinard V. Pozzo J. Lairez O. Tortosa F. Vinel C. Delage C. Calise D. Dutaur M. Parini A. Pizzinat N. CD4+ T cells promote the transition from hypertrophy to heart failure during chronic pressure overload Circulation 129 2014 2111 2124 10.1161/circulationaha.113.007101 24657994 112 Bansal S.S. Ismahil M.A. Goel M. Zhou G. Rokosh G. Hamid T. Prabhu S.D. Dysfunctional and Proinflammatory Regulatory T-Lymphocytes Are Essential for Adverse Cardiac Remodeling in Ischemic Cardiomyopathy Circulation 139 2019 206 221 10.1161/circulationaha.118.036065 30586716 PMC6322956 113 Roh J. Hill J.A. Singh A. Valero-Muñoz M. Sam F. Heart Failure With Preserved Ejection Fraction: Heterogeneous Syndrome, Diverse Preclinical Models Circ. Res. 130 2022 1906 1925 10.1161/circresaha.122.320257 35679364 PMC10035274 114 Smolgovsky S. Bayer A.L. Kaur K. Sanders E. Aronovitz M. Filipp M.E. Thorp E.B. Schiattarella G.G. Hill J.A. Blanton R.M. Impaired T cell IRE1α/XBP1 signaling directs inflammation in experimental heart failure with preserved ejection fraction J. Clin. Investig. 133 2023 e171874 10.1172/jci171874 PMC10721145 37874641 115 Stark K. Massberg S. Interplay between inflammation and thrombosis in cardiovascular pathology Nat. Rev. Cardiol. 18 2021 666 682 10.1038/s41569-021-00552-1 33958774 PMC8100938 116 Sprague A.H. Khalil R.A. Inflammatory cytokines in vascular dysfunction and vascular disease Biochem. Pharmacol. 78 2009 539 552 10.1016/j.bcp.2009.04.029 19413999 PMC2730638 117 Riegger J. Byrne R.A. Joner M. Chandraratne S. Gershlick A.H. Ten Berg J.M. Adriaenssens T. Guagliumi G. Godschalk T.C. Neumann F.J. Histopathological evaluation of thrombus in patients presenting with stent thrombosis. A multicenter European study: a report of the prevention of late stent thrombosis by an interdisciplinary global European effort consortium Eur. Heart J. 37 2016 1538 1549 10.1093/eurheartj/ehv419 26761950 PMC4872283 118 Davizon-Castillo P. McMahon B. Aguila S. Bark D. Ashworth K. Allawzi A. Campbell R.A. Montenont E. Nemkov T. D'Alessandro A. TNF-α-driven inflammation and mitochondrial dysfunction define the platelet hyperreactivity of aging Blood 134 2019 727 740 10.1182/blood.2019000200 31311815 PMC6716075 119 Ridker P.M. Buring J.E. Rifai N. Soluble P-selectin and the risk of future cardiovascular events Circulation 103 2001 491 495 10.1161/01.cir.103.4.491 11157711 120 Vajen T. Mause S.F. Koenen R.R. Microvesicles from platelets: novel drivers of vascular inflammation Thromb. Haemost. 114 2015 228 236 10.1160/th14-11-0962 25994053 PMC6374945 121 Foley J.H. Conway E.M. Cross Talk Pathways Between Coagulation and Inflammation Circ. Res. 118 2016 1392 1408 10.1161/CIRCRESAHA.116.306853 27126649 122 Meltzer M.E. Lisman T. de Groot P.G. Meijers J.C.M. le Cessie S. Doggen C.J.M. Rosendaal F.R. Venous thrombosis risk associated with plasma hypofibrinolysis is explained by elevated plasma levels of TAFI and PAI-1 Blood 116 2010 113 121 10.1182/blood-2010-02-267740 20385790 123 Chen J. Chung D.W. Inflammation, von Willebrand factor, and ADAMTS13 Blood 132 2018 141 147 10.1182/blood-2018-02-769000 29866815 PMC6043979 124 Liu Y. Guan S. Xu H. Zhang N. Huang M. Liu Z. Inflammation biomarkers are associated with the incidence of cardiovascular disease: a meta-analysis Front. Cardiovasc. Med. 10 2023 1175174 10.3389/fcvm.2023.1175174 PMC10360053 37485268 125 Kritchevsky S.B. Cesari M. Pahor M. Inflammatory markers and cardiovascular health in older adults Cardiovasc. Res. 66 2005 265 275 10.1016/j.cardiores.2004.12.026 15820195 126 Eikelboom J.W. Connolly S.J. Bosch J. Dagenais G.R. Hart R.G. Shestakovska O. Diaz R. Alings M. Lonn E.M. Anand S.S. Rivaroxaban with or without Aspirin in Stable Cardiovascular Disease N. Engl. J. Med. 377 2017 1319 1330 10.1056/NEJMoa1709118 28844192 127 Gadi I. Fatima S. Elwakiel A. Nazir S. Mohanad Al-Dabet M. Rana R. Bock F. Manoharan J. Gupta D. Biemann R. Different DOACs Control Inflammation in Cardiac Ischemia-Reperfusion Differently Circ. Res. 128 2021 513 529 10.1161/circresaha.120.317219 33353373 PMC8293866 128 Fuchs T.A. Brill A. Duerschmied D. Schatzberg D. Monestier M. Myers D.D. Jr. Wrobleski S.K. Wakefield T.W. Hartwig J.H. Wagner D.D. Extracellular DNA traps promote thrombosis Proc. Natl. Acad. Sci. USA 107 2010 15880 15885 10.1073/pnas.1005743107 20798043 PMC2936604 129 Jeong H.S. Hong S.J. Cho S.A. Kim J.H. Cho J.Y. Lee S.H. Joo H.J. Park J.H. Yu C.W. Lim D.S. Comparison of Ticagrelor Versus Prasugrel for Inflammation, Vascular Function, and Circulating Endothelial Progenitor Cells in Diabetic Patients With Non-ST-Segment Elevation Acute Coronary Syndrome Requiring Coronary Stenting: A Prospective, Randomized, Crossover Trial JACC Cardiovasc. Interv. 10 2017 1646 1658 10.1016/j.jcin.2017.05.064 28838475 130 Morris T. Stables M. Hobbs A. de Souza P. Colville-Nash P. Warner T. Newson J. Bellingan G. Gilroy D.W. Effects of low-dose aspirin on acute inflammatory responses in humans J. Immunol. 183 2009 2089 2096 10.4049/jimmunol.0900477 19597002 131 Slater A. Khattak S. Thomas M.R. GPVI inhibition: Advancing antithrombotic therapy in cardiovascular disease Eur. Heart J. Cardiovasc. Pharmacother. 10 2024 465 473 10.1093/ehjcvp/pvae018 38453424 PMC11323372 132 South K. Saleh O. Lemarchand E. Coutts G. Smith C.J. Schiessl I. Allan S.M. Robust thrombolytic and anti-inflammatory action of a constitutively active ADAMTS13 variant in murine stroke models Blood 139 2022 1575 1587 10.1182/blood.2021012787 34780600 PMC11017955 133 Pasceri V. Willerson J.T. Yeh E.T. Direct proinflammatory effect of C-reactive protein on human endothelial cells Circulation 102 2000 2165 2168 10.1161/01.cir.102.18.2165 11056086 134 Zeb I. Jorgensen N.W. Blumenthal R.S. Burke G.L. Lloyd-Jones D. Blaha M.J. Wong N.D. Nasir K. Budoff M.J. Association of inflammatory markers and lipoprotein particle subclasses with progression of coronary artery calcium: The multi-ethnic study of atherosclerosis Atherosclerosis 339 2021 27 34 10.1016/j.atherosclerosis.2021.11.003 34826751 135 Evans B.R. Yerly A. van der Vorst E.P.C. Baumgartner I. Bernhard S.M. Schindewolf M. Döring Y. Inflammatory Mediators in Atherosclerotic Vascular Remodeling Front. Cardiovasc. Med. 9 2022 868934 10.3389/fcvm.2022.868934 PMC9114307 35600479 136 Rosa M. Chignon A. Li Z. Boulanger M.C. Arsenault B.J. Bossé Y. Thériault S. Mathieu P. A Mendelian randomization study of IL6 signaling in cardiovascular diseases, immune-related disorders and longevity NPJ Genom. Med. 4 2019 23 10.1038/s41525-019-0097-4 31552141 PMC6754413 137 Surma S. Banach M. Fibrinogen and Atherosclerotic Cardiovascular Diseases-Review of the Literature and Clinical Studies Int. J. Mol. Sci. 23 2021 193 10.3390/ijms23010193 PMC8745133 35008616 138 Aivalioti E. Georgiopoulos G. Tual-Chalot S. Bampatsias D. Delialis D. Sopova K. Drakos S.G. Stellos K. Stamatelopoulos K. Amyloid-beta metabolism in age-related neurocardiovascular diseases Eur. Heart J. 46 2025 250 272 10.1093/eurheartj/ehae655 39527015 PMC11735085 139 Stakos D.A. Stamatelopoulos K. Bampatsias D. Sachse M. Zormpas E. Vlachogiannis N.I. Tual-Chalot S. Stellos K. The Alzheimer's Disease Amyloid-Beta Hypothesis in Cardiovascular Aging and Disease: JACC Focus Seminar J. Am. Coll. Cardiol. 75 2020 952 967 10.1016/j.jacc.2019.12.033 32130931 PMC7042886 140 Stamatelopoulos K. Sibbing D. Rallidis L.S. Georgiopoulos G. Stakos D. Braun S. Gatsiou A. Sopova K. Kotakos C. Varounis C. Amyloid-beta (1-40) and the risk of death from cardiovascular causes in patients with coronary heart disease J. Am. Coll. Cardiol. 65 2015 904 916 10.1016/j.jacc.2014.12.035 25744007 141 Delialis D. Georgiopoulos G. Tual-Chalot S. Angelidakis L. Aivalioti E. Mavraganis G. Sopova K. Argyris A. Kostakou P. Konstantaki C. Amyloid beta is associated with carotid wall echolucency and atherosclerotic plaque composition Sci. Rep. 14 2024 14944 10.1038/s41598-024-64906-8 PMC11213915 38942831 142 Arnett D.K. Blumenthal R.S. Albert M.A. Buroker A.B. Goldberger Z.D. Hahn E.J. Himmelfarb C.D. Khera A. Lloyd-Jones D. McEvoy J.W. ACC/AHA Guideline on the Primary Prevention of Cardiovascular Disease: Executive Summary: A Report of the American College of Cardiology/American Heart Association Task Force on Clinical Practice Guidelines J. Am. Coll. Cardiol. 74 2019 1376 1414 10.1016/j.jacc.2019.03.009 30894319 PMC8344373 143 Ridker P.M. Buring J.E. Rifai N. Cook N.R. Development and validation of improved algorithms for the assessment of global cardiovascular risk in women: the Reynolds Risk Score JAMA 297 2007 611 619 10.1001/jama.297.6.611 17299196 144 Ridker P.M. Danielson E. Fonseca F.A.H. Genest J. Gotto A.M. Jr. Kastelein J.J.P. Koenig W. Libby P. Lorenzatti A.J. MacFadyen J.G. Rosuvastatin to prevent vascular events in men and women with elevated C-reactive protein N. Engl. J. Med. 359 2008 2195 2207 10.1056/NEJMoa0807646 18997196 145 Ling Y. Wan Y. Barinas-Mitchell E. Fujiyoshi A. Cui H. Maimaiti A. Xu R. Li J. Suo C. Zaid M. Varying Definitions of Carotid Intima-Media Thickness and Future Cardiovascular Disease: A Systematic Review and Meta-Analysis J. Am. Heart Assoc. 12 2023 e031217 10.1161/JAHA.123.031217 PMC10727343 38014663 146 Engström G. Melander O. Hedblad B. Carotid intima-media thickness, systemic inflammation, and incidence of heart failure hospitalizations Arterioscler. Thromb. Vasc. Biol. 29 2009 1691 1695 10.1161/atvbaha.109.193490 19644052 147 Ferreira V.M. Schulz-Menger J. Holmvang G. Kramer C.M. Carbone I. Sechtem U. Kindermann I. Gutberlet M. Cooper L.T. Liu P. Friedrich M.G. Cardiovascular Magnetic Resonance in Nonischemic Myocardial Inflammation: Expert Recommendations J. Am. Coll. Cardiol. 72 2018 3158 3176 10.1016/j.jacc.2018.09.072 30545455 148 Puntmann V.O. Martin S. Shchendrygina A. Hoffmann J. Ka M.M. Giokoglu E. Vanchin B. Holm N. Karyou A. Laux G.S. Long-term cardiac pathology in individuals with mild initial COVID-19 illness Nat. Med. 28 2022 2117 2123 10.1038/s41591-022-02000-0 36064600 PMC9556300 149 Bassols J. Ortega F.J. Moreno-Navarrete J.M. Peral B. Ricart W. Fernández-Real J.M. Study of the proinflammatory role of human differentiated omental adipocytes J. Cell. Biochem. 107 2009 1107 1117 10.1002/jcb.22208 19492335 150 Oikonomou E.K. Marwan M. Desai M.Y. Mancio J. Alashi A. Hutt Centeno E. Thomas S. Herdman L. Kotanidis C.P. Thomas K.E. Non-invasive detection of coronary inflammation using computed tomography and prediction of residual cardiovascular risk (the CRISP CT study): a post-hoc analysis of prospective outcome data Lancet 392 2018 929 939 10.1016/s0140-6736(18)31114-0 30170852 PMC6137540 151 Sharma R. Kouranos V. Cooper L.T. Metra M. Ristic A. Heidecker B. Baksi J. Wicks E. Merino J.L. Klingel K. Management of cardiac sarcoidosis: A clinical consensus statement of the Heart Failure Association, the European Association of Cardiovascular Imaging, the ESC Working Group on Myocardial & Pericardial Diseases, and the European Heart Rhythm Association of the ESC Eur. Heart J. 45 2024 2697 2726 10.1093/eurheartj/ehae356 38923509 152 Kwiecinski J. Slomka P.J. Dweck M.R. Newby D.E. Berman D.S. Vulnerable plaque imaging using (18)F-sodium fluoride positron emission tomography Br. J. Radiol. 93 2020 20190797 10.1259/bjr.20190797 PMC7465847 31804143 153 Moss A. Daghem M. Tzolos E. Meah M.N. Wang K.L. Bularga A. Adamson P.D. Kwiecinski J. Fletcher A. Dawson D. Coronary Atherosclerotic Plaque Activity and Future Coronary Events JAMA Cardiol. 8 2023 755 764 10.1001/jamacardio.2023.1729 37379010 PMC10308296 154 Liuzzo G. Kopecky S.L. Frye R.L. O'Fallon W.M. Maseri A. Goronzy J.J. Weyand C.M. Perturbation of the T-cell repertoire in patients with unstable angina Circulation 100 1999 2135 2139 10.1161/01.cir.100.21.2135 10571971 155 Dumitriu I.E. Baruah P. Finlayson C.J. Loftus I.M. Antunes R.F. Lim P. Bunce N. Kaski J.C. High levels of costimulatory receptors OX40 and 4-1BB characterize CD4+CD28null T cells in patients with acute coronary syndrome Circ. Res. 110 2012 857 869 10.1161/circresaha.111.261933 22282196 156 Yadav A.K. Lal A. Jha V. Association of circulating fractalkine (CX3CL1) and CX3CR1(+)CD4(+) T cells with common carotid artery intima-media thickness in patients with chronic kidney disease J. Atheroscler. Thromb. 18 2011 958 965 10.5551/jat.8722 21873805 157 Spray L. Park C. Cormack S. Mohammed A. Panahi P. Boag S. Bennaceur K. Sopova K. Richardson G. Stangl V.M. The Fractalkine Receptor CX(3)CR1 Links Lymphocyte Kinetics in CMV-Seropositive Patients and Acute Myocardial Infarction With Adverse Left Ventricular Remodeling Front. Immunol. 12 2021 605857 10.3389/fimmu.2021.605857 PMC8147691 34046028 158 Bullenkamp J. Mengoni V. Kaur S. Chhetri I. Dimou P. Astroulakis Z.M.J. Kaski J.C. Dumitriu I.E. Interleukin-7 and interleukin-15 drive CD4+CD28null T lymphocyte expansion and function in patients with acute coronary syndrome Cardiovasc. Res. 117 2021 1935 1948 10.1093/cvr/cvaa202 32647892 PMC8262639 159 Spyridopoulos I. Haendeler J. Urbich C. Brummendorf T.H. Oh H. Schneider M.D. Zeiher A.M. Dimmeler S. Statins enhance migratory capacity by upregulation of the telomere repeat-binding factor TRF2 in endothelial progenitor cells Circulation 110 2004 3136 3142 10.1161/01.Cir.0000142866.50300.Eb 15520325 160 Ridker P.M. Everett B.M. Thuren T. MacFadyen J.G. Chang W.H. Ballantyne C. Fonseca F. Nicolau J. Koenig W. Anker S.D. Antiinflammatory Therapy with Canakinumab for Atherosclerotic Disease N. Engl. J. Med. 377 2017 1119 1131 10.1056/NEJMoa1707914 28845751 161 Tardif J.C. Kouz S. Waters D.D. Bertrand O.F. Diaz R. Maggioni A.P. Pinto F.J. Ibrahim R. Gamra H. Kiwan G.S. Efficacy and Safety of Low-Dose Colchicine after Myocardial Infarction N. Engl. J. Med. 381 2019 2497 2505 10.1056/NEJMoa1912388 31733140 162 Nidorf S.M. Fiolet A.T.L. Mosterd A. Eikelboom J.W. Schut A. Opstal T.S.J. The S.H.K. Xu X.F. Ireland M.A. Lenderink T. Colchicine in Patients with Chronic Coronary Disease N. Engl. J. Med. 383 2020 1838 1847 10.1056/NEJMoa2021372 32865380 163 Fiolet A.T.L. Poorthuis M.H.F. Opstal T.S.J. Amarenco P. Boczar K.E. Buysschaert I. Budgeon C. Chan N.C. Cornel J.H. Jolly S.S. Colchicine for secondary prevention of ischaemic stroke and atherosclerotic events: a meta-analysis of randomised trials eClinicalMedicine 76 2024 102835 10.1016/j.eclinm.2024.102835 PMC11490869 39431112 164 Jolly S.S. d'Entremont M.A. Lee S.F. Mian R. Tyrwhitt J. Kedev S. Montalescot G. Cornel J.H. Stanković G. Moreno R. Colchicine in Acute Myocardial Infarction N. Engl. J. Med. 392 2024 633 642 10.1056/NEJMoa2405922 39555823 165 Geng S. Zhang Y. Yi Z. Lu R. Li L. Resolving monocytes generated through TRAM deletion attenuate atherosclerosis JCI Insight 6 2021 e149651 10.1172/jci.insight.149651 PMC8564896 34499622 166 Geng S. Lu R. Zhang Y. Wu Y. Xie L. Caldwell B.A. Pradhan K. Yi Z. Hou J. Xu F. Monocytes Reprogrammed by 4-PBA Potently Contribute to the Resolution of Inflammation and Atherosclerosis Circ. Res. 135 2024 856 872 10.1161/circresaha.124.325023 39224974 PMC11424066 167 Geng S. Zhang Y. Lu R. Irimia D. Li L. Resolving neutrophils through genetic deletion of TRAM attenuate atherosclerosis pathogenesis iScience 27 2024 110097 10.1016/j.isci.2024.110097 PMC11179630 38883832 168 Kirkland J.L. Tchkonia T. Senolytic drugs: from discovery to translation J. Intern. Med. 288 2020 518 536 10.1111/joim.13141 32686219 PMC7405395 169 Zhu Y. Doornebal E.J. Pirtskhalava T. Giorgadze N. Wentworth M. Fuhrmann-Stroissnigg H. Niedernhofer L.J. Robbins P.D. Tchkonia T. Kirkland J.L. New agents that target senescent cells: the flavone, fisetin, and the BCL-X-L inhibitors, A1331852 and A1155463 Aging-Us 9 2017 955 963 10.18632/aging.101202 PMC5391241 28273655 170 Olave N.C. Grenett M.H. Cadeiras M. Grenett H.E. Higgins P.J. Upstream stimulatory factor-2 mediates quercetin-induced suppression of PAI-1 gene expression in human endothelial cells J. Cell. Biochem. 111 2010 720 726 10.1002/jcb.22760 20626032 PMC3521593 171 Walaszczyk A. Dookun E. Redgrave R. Tual-Chalot S. Victorelli S. Spyridopoulos I. Owens A. Arthur H.M. Passos J.F. Richardson G.D. Pharmacological clearance of senescent cells improves survival and recovery in aged mice following acute myocardial infarction Aging Cell 18 2019 e12945 10.1111/acel.12945 PMC6516151 30920115 172 Dookun E. Walaszczyk A. Redgrave R. Palmowski P. Tual-Chalot S. Suwana A. Chapman J. Jirkovsky E. Donastorg Sosa L. Gill E. Clearance of senescent cells during cardiac ischemia-reperfusion injury improves recovery Aging Cell 19 2020 e13249 10.1111/acel.13249 PMC7576252 32996233 173 Dookun E. Passos J.F. Arthur H.M. Richardson G.D. Therapeutic Potential of Senolytics in Cardiovascular Disease Cardiovasc. Drugs Ther. 36 2022 187 196 10.1007/s10557-020-07075-w 32979174 PMC8770386 174 Schoenwaelder S.M. Jarman K.E. Gardiner E.E. Hua M. Qiao J. White M.J. Josefsson E.C. Alwis I. Ono A. Willcox A. Bcl-xL-inhibitory BH3 mimetics can induce a transient thrombocytopathy that undermines the hemostatic function of platelets Blood 118 2011 1663 1674 10.1182/blood-2011-04-347849 21673344 175 Xu Z. Cang S. Yang T. Liu D. Cardiotoxicity of tyrosine kinase inhibitors in chronic myelogenous leukemia therapy Hematol. Rep. 1 2009 4 176 Brave M. Goodman V. Kaminskas E. Farrell A. Timmer W. Pope S. Harapanhalli R. Saber H. Morse D. Bullock J. Sprycel for Chronic Myeloid Leukemia and Philadelphia Chromosome–Positive Acute Lymphoblastic Leukemia Resistant to or Intolerant of Imatinib Mesylate Clin. Cancer Res. 14 2008 352 359 10.1158/1078-0432.Ccr-07-4175 18223208 177 Abdelgawad I.Y. Agostinucci K. Sadaf B. Grant M.K.O. Zordoky B.N. Metformin mitigates SASP secretion and LPS-triggered hyper-inflammation in Doxorubicin-induced senescent endothelial cells Front. Aging 4 2023 1170434 10.3389/fragi.2023.1170434 PMC10164964 37168843 178 Barzilai N. Crandall J.P. Kritchevsky S.B. Espeland M.A. Metformin as a Tool to Target Aging Cell Metab. 23 2016 1060 1065 10.1016/j.cmet.2016.05.011 27304507 PMC5943638 179 Selvarani R. Mohammed S. Richardson A. Effect of rapamycin on aging and age-related diseases-past and future Geroscience 43 2021 1135 1158 10.1007/s11357-020-00274-1 33037985 PMC8190242 180 Flynn J.M. O'Leary M.N. Zambataro C.A. Academia E.C. Presley M.P. Garrett B.J. Zykovich A. Mooney S.D. Strong R. Rosen C.J. Late-life rapamycin treatment reverses age-related heart dysfunction Aging Cell 12 2013 851 862 10.1111/acel.12109 23734717 PMC4098908 181 Kelly G. Kataura T. Panek J. Ma G. Salmonowicz H. Davis A. Kendall H. Brookes C. Ayine-Tora D.M. Banks P. Suppressed basal mitophagy drives cellular aging phenotypes that can be reversed by a p62-targeting small molecule Dev. Cell 59 2024 1924 1939 10.1016/j.devcel.2024.04.020 38897197 182 Lao X.Q. Liu X. Deng H.B. Chan T.C. Ho K.F. Wang F. Vermeulen R. Tam T. Wong M.C.S. Tse L.A. Sleep Quality, Sleep Duration, and the Risk of Coronary Heart Disease: A Prospective Cohort Study With 60,586 Adults J. Clin. Sleep Med. 14 2018 109 117 10.5664/jcsm.6894 29198294 PMC5734879 183 Diao T. Liu K. Lyu J. Zhou L. Yuan Y. Yang H. Wu T. Zhang X. Changes in Sleep Patterns, Genetic Susceptibility, and Incident Cardiovascular Disease in China JAMA Netw. Open 7 2024 e247974 10.1001/jamanetworkopen.2024.7974 PMC11040405 38652473 184 Pillon N.J. Gabriel B.M. Dollet L. Smith J.A.B. Sardón Puig L. Botella J. Bishop D.J. Krook A. Zierath J.R. Transcriptomic profiling of skeletal muscle adaptations to exercise and inactivity Nat. Commun. 11 2020 470 10.1038/s41467-019-13869-w 31980607 PMC6981202 185 Estruch R. Ros E. Salas-Salvadó J. Covas M.I. Corella D. Arós F. Gómez-Gracia E. Ruiz-Gutiérrez V. Fiol M. Lapetra J. Primary Prevention of Cardiovascular Disease with a Mediterranean Diet Supplemented with Extra-Virgin Olive Oil or Nuts N. Engl. J. Med. 378 2018 e34 10.1056/NEJMoa1800389 29897866 186 Sun M.L. Yao W. Wang X.Y. Gao S. Varady K.A. Forslund S.K. Zhang M. Shi Z.Y. Cao F. Zou B.J. Intermittent fasting and health outcomes: an umbrella review of systematic reviews and meta-analyses of randomised controlled trials eClinicalMedicine 70 2024 102519 10.1016/j.eclinm.2024.102519 PMC10945168 38500840 187 Roberts M.N. Wallace M.A. Tomilov A.A. Zhou Z. Marcotte G.R. Tran D. Perez G. Gutierrez-Casado E. Koike S. Knotts T.A. A Ketogenic Diet Extends Longevity and Healthspan in Adult Mice Cell Metab. 27 2018 1156 10.1016/j.cmet.2018.04.005 PMC5957496 29719228 188 Caprio M. Infante M. Moriconi E. Armani A. Fabbri A. Mantovani G. Mariani S. Lubrano C. Poggiogalle E. Migliaccio S. Very-low-calorie ketogenic diet (VLCKD) in the management of metabolic diseases: systematic review and consensus statement from the Italian Society of Endocrinology (SIE) J. Endocrinol. Investig. 42 2019 1365 1386 10.1007/s40618-019-01061-2 31111407 189 Wierzbicka A. Mańkowska-Wierzbicka D. Mardas M. Stelmach-Mardas M. Role of Probiotics in Modulating Human Gut Microbiota Populations and Activities in Patients with Colorectal Cancer-A Systematic Review of Clinical Trials Nutrients 13 2021 1160 10.3390/nu13041160 33915854 PMC8066620 190 Yoo S. Jung S.C. Kwak K. Kim J.S. The Role of Prebiotics in Modulating Gut Microbiota: Implications for Human Health Int. J. Mol. Sci. 25 2024 4834 10.3390/ijms25094834 PMC11084426 38732060 191 Roy S. Dhaneshwar S. Role of prebiotics, probiotics, and synbiotics in management of inflammatory bowel disease: Current perspectives World J. Gastroenterol. 29 2023 2078 2100 10.3748/wjg.v29.i14.2078 37122604 PMC10130969 192 Herisson F.M. Cluzel G.L. Llopis-Grimalt M.A. O'Donovan A.N. Koc F. Karnik K. Laurie I. Canene-Adams K. Ross R.P. Stanton C. Caplice N.M. Targeting the Gut-Heart Axis Improves Cardiac Remodeling in a Clinical Scale Model of Cardiometabolic Syndrome JACC. Basic Transl. Sci. 10 2025 1 15 10.1016/j.jacbts.2024.09.004 39906593 PMC11788474 193 Ramai D. Zakhia K. Ofosu A. Ofori E. Reddy M. Fecal microbiota transplantation: donor relation, fresh or frozen, delivery methods, cost-effectiveness Ann. Gastroenterol. 32 2019 30 38 10.20524/aog.2018.0328 30598589 PMC6302197 194 Hatahet J. Cook T.M. Bonomo R.R. Elshareif N. Gavini C.K. White C.R. Jesse J. Mansuy-Aubert V. Aubert G. Fecal microbiome transplantation and tributyrin improves early cardiac dysfunction and modifies the BCAA metabolic pathway in a diet induced pre-HFpEF mouse model Front. Cardiovasc. Med. 10 2023 1105581 10.3389/fcvm.2023.1105581 PMC9944585 36844730 195 Vrints C. Andreotti F. Koskinas K.C. Rossello X. Adamo M. Ainslie J. Banning A.P. Budaj A. Buechel R.R. Chiariello G.A. 2024 ESC Guidelines for the management of chronic coronary syndromes Eur. Heart J. 45 2024 3415 3537 10.1093/eurheartj/ehae177 39210710 196 Mitchell J.D. Fergestrom N. Gage B.F. Paisley R. Moon P. Novak E. Cheezum M. Shaw L.J. Villines T.C. Impact of Statins on Cardiovascular Outcomes Following Coronary Artery Calcium Scoring J. Am. Coll. Cardiol. 72 2018 3233 3242 10.1016/j.jacc.2018.09.051 30409567 PMC6309473 197 Vernon S.T. Coffey S. Bhindi R. Soo Hoo S.Y. Nelson G.I. Ward M.R. Hansen P.S. Asrress K.N. Chow C.K. Celermajer D.S. Increasing proportion of ST elevation myocardial infarction patients with coronary atherosclerosis poorly explained by standard modifiable risk factors Eur. J. Prev. Cardiol. 24 2017 1824 1830 10.1177/2047487317720287 28703626 198 Benetos A. Petrovic M. Strandberg T. Hypertension Management in Older and Frail Older Patients Circ. Res. 124 2019 1045 1060 10.1161/CIRCRESAHA.118.313236 30920928 ",
  "metadata": {
    "Title of this paper": "Hypertension Management in Older and Frail Older Patients",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490256/"
  }
}