{
  "title": "Paper_786",
  "abstract": "J Am Soc Nephrol J Am Soc Nephrol 612 jnephrol JASN Journal of the American Society of Nephrology : JASN 1046-6673 1533-3450 American Society of Nephrology PMC11452132 PMC11452132.1 11452132 11452132 38889205 10.1681/ASN.0000000000000425 JASN-2024-000014 1 3 Clinical Research Chronic Kidney Disease Estimated Effect of Restarting Renin-Angiotensin System Inhibitors after Discontinuation on Kidney Outcomes and Mortality https://orcid.org/0000-0002-7018-0049 Hattori Koki  1 https://orcid.org/0000-0002-0987-5423 Sakaguchi Yusuke  1 https://orcid.org/0000-0002-9507-3506 Oka Tatsufumi  1 Asahina Yuta  1 https://orcid.org/0009-0009-0987-2941 Kawaoka Takayuki  1 https://orcid.org/0000-0002-5165-291X Doi Yohei  1 https://orcid.org/0000-0002-1221-1900 Hashimoto Nobuhiro  2 https://orcid.org/0000-0003-2466-3143 Kusunoki Yasuo  3 Yamamoto Satoko  4 https://orcid.org/0000-0002-0001-6235 Yamato Masafumi  5 https://orcid.org/0000-0003-2610-9824 Yamamoto Ryohei  1  6 https://orcid.org/0000-0001-8378-6130 Matsui Isao  1 https://orcid.org/0000-0003-2543-8108 Mizui Masayuki  1 https://orcid.org/0000-0001-6892-3942 Kaimori Jun-Ya  1 https://orcid.org/0000-0002-0820-7167 Isaka Yoshitaka  1 1 2 3 4 5 6 Correspondence: sakaguchi@kid.med.osaka-u.ac.jp 10 2024 18 6 2024 35 10 472222 1391 1401 3 1 2024 12 6 2024 01 10 2025 01 10 2025 05 10 2024 01 10 2025 Copyright © 2024 by the American Society of Nephrology 2024 Navigating Renin-Angiotensin System Inhibitors in Patients with Declines in eGFR 35 10 13 8 2024 1309 1311 Journal of the American Society of Nephrology : JASN 10.1681/ASN.0000000000000470 PMC11452186 39137049 Visual Abstract Key Points  Restarting renin-angiotensin system inhibitor after discontinuation was associated with a lower risk of kidney outcomes and mortality but not related to hyperkalemia. Our findings support a proactive approach to restarting renin-angiotensin system inhibitor among patients with CKD. Background While renin-angiotensin system inhibitors (RASi) have been the mainstream treatment for patients with CKD, they are often discontinued because of adverse effects such as hyperkalemia and AKI. It is unknown whether restarting RASi after discontinuation improves clinical outcomes. Methods Using the Osaka Consortium for Kidney disease Research database, we performed a target trial emulation study including 6065 patients with an eGFR of 10–60 ml/min per 1.73 m 2 2 Results Among those who discontinued RASi (mean [SD] age 66 [15] years, 62% male, mean [SD] eGFR 40 [26] ml/min per 1.73 m 2 Conclusions Restarting RASi after discontinuation was associated with a lower risk of kidney outcomes and mortality but not related to the incidence of hyperkalemia. ACE inhibitors CKD ESKD pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes SDC T Read-along YES ",
  "metadata": {
    "Title of this paper": "Navigating Renin-Angiotensin System Inhibitors in Patients with Declines in eGFR",
    "Journal it was published in:": "Journal of the American Society of Nephrology : JASN",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11452132/"
  }
}