{
  "title": "Paper_319",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12488058 PMC12488058.1 12488058 12488058 41040779 10.7759/cureus.91430 1 Hematology Oncology Malignancy-Associated Renal Infarction: A Case of Prostate Cancer Presenting With Flank Pain and Hematuria Muacevic Alexander Adler John R Stinson Connor J 1 Pupo Alec 1 Laird Patrick 2  1  2 Connor J. Stinson cs264904@pcom.edu 1 9 2025 9 2025 17 9 495976 e91430 1 9 2025 01 09 2025 02 10 2025 03 10 2025 Copyright © 2025, Stinson et al. 2025 Stinson et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/395033-malignancy-associated-renal-infarction-a-case-of-prostate-cancer-presenting-with-flank-pain-and-hematuria Renal infarction is an uncommon but critical diagnosis that is frequently overlooked due to its nonspecific presentation and overlap with more common causes of abdominal or flank pain. Patients with malignancy, including metastatic prostate cancer, are at increased risk of thromboembolic events due to the intrinsic hypercoagulable state promoted by cancer, yet arterial events, such as renal infarction, remain underrecognized. We present the case of a 74-year-old male with metastatic castrate-sensitive prostate cancer who developed acute abdominal pain, nausea, and vomiting. Evaluation revealed elevated blood pressure, microscopic hematuria, and increased lactate dehydrogenase (LDH). CT scan of the abdomen and pelvis with contrast demonstrated wedge-shaped perfusion defects in the left kidney, consistent with renal infarction, allowing for the timely initiation of anticoagulation. This case underscores the importance of recognizing renal infarction as a potential complication of malignancy-associated thrombophilia. The classic triad of flank pain, hematuria, and elevated LDH should raise clinical suspicion, prompting early cross-sectional imaging to facilitate diagnosis and prevent irreversible renal injury. acute arterial thrombosis androgen depriving therapy flank pain malignancy-associated hypercoagulability prostate cancer renal infarct pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Renal infarction is a rare but critical diagnosis that is often missed due to its silent presentation, nonspecific symptoms, and overlap with more common abdominal pathologies. Flank pain, hematuria, nausea, and vomiting frequently lead clinicians down diagnostic pathways for nephrolithiasis, pyelonephritis, or gastrointestinal causes, while renal infarct is a differential diagnosis that is less often considered. The true incidence of renal infarction remains underestimated, in part because non-contrast imaging, the typical first step in stone evaluation, often fails to identify perfusion defects [ 1 Cancer patients live in a prothrombotic state, and while malignancy-associated venous thrombosis is well-established, arterial thrombotic events like renal infarction are less frequently recognized. Prostate cancer, particularly in advanced stages, further elevates this risk through hypercoagulability, proinflammatory cytokine release, and androgen deprivation therapy (ADT)-related metabolic changes [ 2 3 We report a case of renal infarction in a patient with metastatic castrate-sensitive prostate cancer, illustrating the diagnostic pitfalls and emphasizing the need for heightened clinical suspicion when encountering the classic triad of flank pain, hematuria, and elevated lactate dehydrogenase (LDH) in oncologic patients. Case presentation A 74-year-old male with a history of metastatic castrate-sensitive prostate cancer, chronic mild neutropenia, and hemorrhoids presented from home with nausea, vomiting, and abdominal pain. He states his symptoms began the previous evening, around 7 pm, when he developed sharp periumbilical abdominal pain. Hours later, nausea with vomiting ensued. He reported a suspected fever at home the same day, but did not check his temperature. His symptoms persisted through the night, prompting him to seek care. He was first diagnosed with prostate adenocarcinoma 6 years ago following a prostate biopsy with 13 of 15 positive cores. His highest Gleason Score was 8. At the time, an MRI of his abdomen revealed right pelvic lymph node involvement. He was started on leuprolide, abiraterone, and prednisone for two years of treatment. After two years, his PSA was < 0.05, and repeat imaging showed no evidence of disease progression, so he was monitored off anti-neoplastics. After three years, his prostate cancer showed evidence of local recurrence, now with metastatic retroperitoneal lymph node involvement. He was started back on leuprolide, abiraterone, and prednisone, which he had been on for approximately one year prior to presentation. These are his only current medications; he does not take anti-coagulation. On arrival at the ED, his temperature was 98.7. He had an elevated blood pressure of 160/85, while his vital signs were otherwise stable. On exam, he had diffuse abdominal tenderness and no flank pain bilaterally. There was no edema of the lower extremities. The cardiovascular exam showed a regular rate and rhythm. ECG showed normal sinus rhythm with non-specific ST and T wave abnormalities in the precordial leads. Noteworthy labs are outlined in Table 1 Table 1 Laboratory values *Creatinine reference ranges vary slightly by lab and sex; 0.6–1.3 mg/dL is typical for adult males. LDH: lactate dehydrogenase; eGFR: estimated glomerular filtration rate; AST: aspartate aminotransferase; ALT: alanine aminotransferase; UA: urinalysis Test Result Reference Range Units LDH 218 140–280 U/L LDH (15 hr later) 593 140-280 U/L Creatinine 1.18 0.6–1.3 (M)* mg/dL eGFR 64 >90 mL/min/1.73 m^2 AST 21 15-37 U/L ALT 21 12-78 U/L Alk Phos 94 46-116 U/L Total Br 0.5 0.2-1 mg/dL Troponin 6 < 22 ng/L Lipase 12 0–160 U/L UA – RBCs 0–2 0–3 /HPF UA – Blood Trace Negative — UA – Bacteria Occasional None — UA – WBCs 0–5 0–5 /HPF Pyelonephritis was considered but thought less likely due to the patient’s lack of documented fever, absent leukocytosis, and non-infectious appearing urinalysis. Nephrolithiasis was considered, given the patient’s sharp abdominal pain, nausea with vomiting, and faint blood in the urine. Our leading differential diagnosis was renal infarction, given the nature of the patient’s symptoms, elevated blood pressure, elevated LDH, and microscopic hematuria. Ultimately, a CT abdomen pelvis with contrast was completed, showing wedge-shaped areas of low perfusion in the left kidney (Figures 1 2 Figure 1 Left kidney renal infarct (white arrow) Wedge-shaped renal infarct of the left kidney Figure 2 Multiple renal infarcts of the left kidney (white arrows) The patient was determined not to be a candidate for emergent revascularization due to low perceived benefit. He was started on a heparin drip. Prior to discharge, he was transitioned to Eliquis 10 mg twice daily for seven days, followed by Eliquis 5 mg twice daily for three months, followed by prophylactic anticoagulation with Eliquis 2.5 mg twice daily indefinitely. Discussion Renal infarction arises when arterial blood flow to a segment of the kidney is acutely disrupted, due to an embolic or thrombotic event, leading to ischemia and tissue necrosis [ 4 4 2 2 5 Taking a look beyond the pathophysiology, these mechanisms have been demonstrated by clinical studies quantifying the increased risk of thromboembolic events in patients with cancer. Prostate cancer has a relatively lower associated risk of venous thromboembolism (VTE) compared to other cancers like pancreatic, colorectal, lung, and brain [ 6 3 7 7 Clinically, renal infarction commonly presents with abrupt flank or abdominal pain, often accompanied by microscopic or gross hematuria, reflecting necrosis of renal parenchyma [ 4 4 Laboratory values typically show a striking elevation in serum LDH, as massive cellular destruction releases intracellular enzymes. Often, LDH levels can exceed four times the upper limit of normal, helping distinguish infarction from more benign causes of flank pain such as nephrolithiasis or pyelonephritis [ 4 4 After the diagnosis of renal infarct was secured in our patient, Interventional Radiology was contacted to evaluate for the potential benefit of revascularization therapy. Because of his only mildly diminished renal function and patency of the renal artery on imaging, it was determined that there was likely little benefit to revascularization techniques. Some methods of revascularization that are utilized as standard practice include: endovascular thrombectomy, local thrombolysis, angioplasty, and stent placement. Systemic fibrinolytic therapy may be used in settings where endovascular intervention is not available (provided dissection is not the cause of infarct); however, there is limited data to support this approach [ 8 9 8 Renal infarction is often misdiagnosed or overlooked due to its nonspecific presentation and clinical overlap with more common conditions such as nephrolithiasis, pyelonephritis, diverticulitis, or musculoskeletal pain. Symptoms like acute flank pain, hematuria, and leukocytosis are frequently attributed to these alternatives, particularly when non-contrast CT, commonly used for stone evaluation, misses perfusion defects. Key diagnostic clues, including a markedly elevated LDH and sudden-onset hypertension, are often underrecognized [ 1 Conclusions The classic triad of flank pain, hematuria, and elevated lactate dehydrogenase (LDH) should raise clinical suspicion for renal infarction. This case report aims to increase awareness of renal infarction as a diagnostic consideration in patients with underlying malignancy. The prothrombotic state associated with cancer significantly elevates the risk of arterial thrombosis, including infarction of the renal vasculature. Given that many patients, such as in this case, may present with only one or two of the hallmark findings or remain entirely asymptomatic, clinicians must maintain a high index of suspicion and a low threshold to obtain early cross-sectional imaging (CT-angiography), particularly in oncologic patients, where the risk for ischemic vascular events is inherently higher. Disclosures Human subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Supervision: References 1 Atherosclerotic renovascular disease: medical therapy versus medical therapy plus renal artery stenting in preventing renal failure progression: the rationale and study design of a prospective, multicenter and randomized trial (NITER) J Nephrol Scarpioni R Michieletti E Cristinelli L 423 428 18 2005 http://pubmed.ncbi.nlm.nih.gov/16245247/ 16245247 2 Incidence of venous thromboembolism and its effect on survival among patients with common cancers Arch Intern Med Chew HK Wun T Harvey D Zhou H White RH 458 464 166 2006 16505267 10.1001/archinte.166.4.458 3 Incidence of venous thromboembolism in patients with cancer - a cohort study using linked United Kingdom databases Eur J Cancer Walker AJ Card TR West J Crooks C Grainge MJ 1404 1413 49 2013 23146958 10.1016/j.ejca.2012.10.021 4 Renal infarction StatPearls [Internet] Mulayamkuzhiyil Saju J Leslie SW Treasure Island (FL) StatPearls Publishing 2024 https://www.ncbi.nlm.nih.gov/sites/books/NBK582139/ 35881744 5 Lung cancer embolization causing acute limb ischemia: a case report J Med Case Rep Hussain SM 56 17 2023 36797755 10.1186/s13256-023-03769-5 PMC9936652 6 The hypercoagulable state of malignancy: pathogenesis and current debate Neoplasia Caine GJ Stonelake PS Lip GY Kehoe ST 465 473 4 2002 https://pmc.ncbi.nlm.nih.gov/articles/PMC1550339/ 12407439 10.1038/sj.neo.7900263 PMC1550339 7 Androgen deprivation therapy for prostate cancer and the risk of venous thromboembolism Eur Urol Klil-Drori AJ Yin H Tagalakis V Aprikian A Azoulay L 56 61 70 2016 26138040 10.1016/j.eururo.2015.06.022 8 Revascularization for renovascular disease: a scientific statement from the American Heart Association Hypertension Bhalla V Textor SC Beckman JA 0 43 79 2022 https://www.ahajournals.org/doi/10.1161/HYP.0000000000000217#sec-5 10.1161/HYP.0000000000000217 PMC11731842 35708012 9 Acute renal artery occlusion: presentation, treatment, and outcome J Vasc Surg Silverberg D Menes T Rimon U Salomon O Halak M 1026 1032 64 2016 27345378 10.1016/j.jvs.2016.04.043 ",
  "metadata": {
    "Title of this paper": "Acute renal artery occlusion: presentation, treatment, and outcome",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488058/"
  }
}