{
  "title": "Paper_644",
  "abstract": "pmc Endocr Metab Immune Disord Drug Targets Endocr Metab Immune Disord Drug Targets 585 benthamopen EMIDDT Endocrine, Metabolic & Immune Disorders Drug Targets 1871-5303 2212-3873 pmc-is-collection-domain yes pmc-collection-title Bentham Open Access PMC12481543 PMC12481543.1 12481543 12481543 39390833 10.2174/0118715303337748240910093934 EMIDDT-25-8-665 1 Pharmacology, Medicine, Endocrinology, Immunology, Inflammation & Allergy, Biochemistry and Molecular Biology Bulky Isolated Adrenal Metastasis as First Presentation of Occult Hepatocellular Carcinoma (HCC) in a Patient with a Synchronous Squamous Carcinoma of the Tongue Lodin Marco 1 Ragni Alberto 2 * Renzelli Valerio 3 Rossi Maura 4 Traverso Elena Silvia 4 Gallo Marco 2 1 General Surgery Unit, Azienda Ospedaliero-Universitaria SS. Antonio e Biagio e Cesare Arrigo of Alessandria, Alessandria Italy 2 Endocrinology and Metabolic Diseases Unit, Azienda Ospedaliero-Universitaria SS. Antonio e Biagio e Cesare Arrigo of Alessandria, Alessandria Italy 3 Diabetologist and Endocrinologist Rome Italy 4 Oncology Unit, Azienda Ospedaliero-Universitaria SS. Antonio e Biagio e Cesare Arrigo of Alessandria, Alessandria Italy * Via alberto.ragni@ospedale.al.it 10 10 2024 2025 25 8 497984 665 669 15 6 2024 21 8 2024 23 8 2024 30 09 2025 01 10 2025 01 10 2025 © 2025 The Author(s). Published by Bentham Science Publisher. 2025 The Author(s) https://creativecommons.org/licenses/by/4.0/ © 2025 The Author(s). Published by Bentham Science Publishers. This is an open access article published under CC BY 4.0 https://creativecommons.org/licenses/by/4.0/legalcode Background The diagnostic workup of an adrenal mass should always rule out the possibility of an adrenal metastasis, especially in a patient followed-up for a known primitive cancer. Sometimes, however, the incidental finding of a bulky lesion in a cancer patient can lead to the unexpected diagnosis of metastasis from a second occult cancer. Here, we report the case of a voluminous, isolated left adrenal metastasis from unknown and persistently occult hepatocellular carcinoma (HCC), incidentally found during the follow-up for squamous carcinoma of the tongue. Case Description A 72-year-old HBV/HCV-negative male patient with a history of alcohol abuse was referred to our hospital for gastric bleeding. Some weeks before, the patient was operated on for a locally advanced squamous cell carcinoma of the tongue, which required cervical lymph node neck dissection, temporary tracheostomy, jejunostomy, and plastic reconstruction. Subsequent diagnostic imaging revealed a left adrenal mass sized 9x15 cm with suspicious features. The hormonal workout was negative for pheochromocytoma and a hyperfunctioning adrenal lesion. The patient underwent laparotomic left adrenalectomy. The exploration of the liver was compatible with alcoholic cirrhosis and did not reveal any other palpable lesion. The adrenal mass histologically turned out to be a poorly differentiated G3 HCC. Subsequent radiological exams were unable to identify the primary liver lesion or any other neoplasms. Conversely, α-FP levels were initially high but reduced after treatment with sorafenib. After 2 years of follow-up, the patient is alive and well, albeit with evidence of locoregional inter-aortocaval lymphadenopathy. The primary HCC has never been identified, thus suggesting the hypothesis of a diffuse cirrhosis-like HCC. Conclusion The suspicion of an adrenal metastasis in a patient with primary cancer with a low potential for adrenal metastatic spreading must raise the diagnostic suspect for another synchronous occult cancer beyond that for primary adrenal cancer. HCC can rarely first manifest as a metastatic adrenal lesion. Keywords Isolated adrenal metastasis occult hepatocellular carcinoma HCC bulky lesion squamous carcinoma sorafenib primary cancer pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 INTRODUCTION 1.1 Background The finding of an adrenal lesion in a patient with a known primary cancer is a relatively frequent event, especially for tumours with a high propensity to metastasize to theadrenal gland ( e.g., 1 3 4 5 1.2 Rationale and Knowledge Gap HCC is a highly aggressive neoplasm often presenting with locally advanced or metastatic disease. Consequently, despite recent progress and therapeutic improvements, overall survival remains poor. Only a few case reports have described the unusual event of an HCC presenting with an adrenal metastatic lesion [ 1 6 7 2 CASE PRESENTATION A 72-year-old HBV/HCV-negative male patient with a history of alcohol abuse was referred to our hospital for gastric bleeding. Some weeks before, the patient had undergone right hemi-pelvi-glossectomy with right lymph node neck dissection (I-IV levels), temporary tracheostomy, jejunostomy, and reconstruction with myocutaneous flap of the right pectoralis major muscle for the treatment of an ulcerated squamous cell carcinoma of the middle-distal third of the right lingual border (pT4aN0; Stage IVa according to AJCC 2017, 8 th 1 18 Given the clinical suspicion of a primitive adrenal malignancy, a biopsy of the adrenal lesion was considered but not undertaken due to the potential risk of neoplastic seeding. The patient, therefore, underwent laparotomic left adrenalectomy (Fig. 2 18 3 DISCUSSION The finding of adrenal metastasis from HCC is an infrequent occurrence in clinical practice [ 8 9 10 Given the high adrenal blood supply and the fact that both adrenal glands seem equally affected, the plausible pathogenetic mechanism is hematogenic spread [ 11 Adrenal metastases from HCC are usually synchronous, while metachronous metastases are rare [ 12 13 3 14 Our case report represents an even rarer occurrence, an adrenal lesion as the first manifestation of HCC. Adrenal metastases are usually found in advanced HCC stages, with poor liver function and patient performance status, thus limiting treatment options [ 1 In patients with good performance status and clinically fit, surgery is the only curative option for adrenal metastases from HCC. Compared to other therapeutic options, surgery has shown potential survival benefits [ 15 e.g., 5 16 1 17 18 18 17 19 20 In our patient, the primary lesion still remains unknown, even two years after the initial diagnosis. To our knowledge, only five cases with an unknown primary tumor have been published to date [ 1 21 24 1 Given the hypothesis of diffuse cancer-cirrhosis in our patient, sorafenib therapy was initiated, resulting in a sustained clinical response. This is a rare variant of HCC, with a few previously reported cases in which HCC produces diffuse small nodules mimicking cirrhosis [ 25 26 Regarding the response to sorafenib, we found a case report of a patient treated with sorafenib who developed left adrenal metachronous metastasis, which responded to subsequent treatment with atezolizumab plus bevacizumab [ 27 CONCLUSION In the follow-up of a known malignant neoplasm, particularly one with a low potential for adrenal metastatic spreading, the discovery of an adrenal mass that exhibits a malignant appearance on radiographic imaging warrants thorough consideration. It is essential to include the possibility of an ACC in the differential diagnosis, given the aggressive nature of this tumor. Additionally, the adrenal mass could represent a metastasis from another synchronous occult cancer that may not have been previously detected. In rare instances, HCC can present initially as a metastatic lesion in the adrenal gland, even when it has not been identified in the liver or other typical sites through traditional imaging methods. This scenario poses a diagnostic challenge because HCC might not always be evident through standard imaging techniques, potentially leading to its initial detection as an adrenal mass. In such cases, measuring serum alpha-fetoprotein (αFP) levels could be a useful diagnostic tool as its detection in the presence of an adrenal mass might support the suspicion of HCC as the underlying primary malignancy. Despite all investigations, sometimes, as in our case, the primary tumor may remain unknown, and systemic treatment might still represent a therapeutic option. ACKNOWLEDGEMENTS Declared none. AUTHORS’ CONTRIBUTIONS MG and ML proposed the idea. MG, MR, AR, and EST contributed to the material preparation, data collection, and analysis. MG, ML, AR, and VR wrote the first draft of the manuscript. All authors commented on previous versions of the manuscript. MG and MR supervised the manuscript drafting. All authors read and approved the final manuscript. LIST OF ABBREVIATIONS HCC Hepatocellular Carcinoma ACC Adrenocortical Carcinoma αFP Alpha-Fetoprotein ETHICS APPROVAL AND CONSENT TO PARTICIPATE Not applicable. HUMAN AND ANIMAL RIGHTS Not applicable. CONSENT FOR PUBLICATION Written informed consent was obtained from the patient. STANDARDS OF REPORTING CARE guidelines were followed. AVAILABILITY OF DATA AND MATERIALS All data generated or analysed during this study are included in this published article. FUNDING None. CONFLICT OF INTEREST The authors declared no conflict of interest, financial or otherwise. REFERENCES 1 Tsalis K. Zacharakis E. Sapidis N. Lambrou I. Zacharakis E. Betsis D. Adrenal metastasis as first presentation of hepatocellular carcinoma. World J. Surg. Oncol. 2005 3 1 50 10.1186/1477-7819-3-50 16042808 PMC1187929 2 Teegen E.M. Mogl M.T. Pratschke J. Rayes N. Adrenal metastasis of hepatocellular carcinoma in patients following liver resection or liver transplantation: Experience from a tertiary referral center. Int. J. Surg. Oncol. 2018 2018 1 6 10.1155/2018/4195076 30151282 PMC6087597 3 Kwak H.V. Hsu D.S. Chang C.K. Isolated adrenal metastasis for hepatocellular carcinoma: a case report and literature review. AME Case Rep. 2022 6 18 18 10.21037/acr-21-75 35475017 PMC9010317 4 Mclean K. Lilienfeld H. Caracciolo J.T. Hoffe S. Tourtelot J.B. Carter W.B. Management of isolated adrenal lesions in cancer patients. Cancer Contr. 2011 18 2 113 126 10.1177/107327481101800206 21451454 5 Staubitz J.I. Hoppe-Lotichius M. Baumgart J. Mittler J. Lang H. Musholt T.J. Survival after adrenalectomy for metastatic hepatocellular carcinoma: A 25-year institutional experience. World J. Surg. 2021 45 4 1118 1125 10.1007/s00268-020-05909-0 33354731 PMC7921034 6 Gondin-Hernandez L. Trejo J. Sandoval B. Bruder J.M. Granda-Rodriguez R. SAT-183 right adrenal mass: An unusual presentation. J. Endocr. Soc. 2020 4 Suppl. 1 SAT-183 10.1210/jendso/bvaa046.1588 7 S. Rodríguez E. Ríos León R. Flores de Miguel Á. Guerrero García A. Pian H. G. Rodríguez F. A. Martínez A. Metástasis adrenal como presentación de un hepatocarcinoma. Gastroenterol. Hepatol. 2019 42 3 171 172 10.1016/j.gastrohep.2018.03.001 29650454 8 Panwar V. Cai Q. Jia L. Metastatic diseases to the adrenal gland: A comprehensive study from an academic institution with emphasis on clinical occult cases. Pathol. Res. Pract. 2024 261 155487 10.1016/j.prp.2024.155487 39079382 9 Nakashima T. Okuda K. Kojiro M. Jimi A. Yamaguchi R. Sakamoto K. Ikari T. Pathology of hepatocellular carcinoma in Japan: 232 consecutive cases autopsied in ten years. Cancer 1983 51 5 863 877 10.1002/1097-0142(19830301)51:5&#x0003c;863::AID-CNCR2820510520&#x0003e;3.0.CO;2-D 6295617 10 Katyal S. Oliver J.H. III Peterson M.S. Ferris J.V. Carr B.S. Baron R.L. Extrahepatic metastases of hepatocellular carcinoma. Radiology 2000 216 3 698 703 10.1148/radiology.216.3.r00se24698 10966697 11 Hong S. Kim T. Sung K.B. Kim P. Ha H. Kim A. Lee M.G. Extrahepatic spread of hepatocellular carcinoma: A pictorial review. Eur. Radiol. 2003 13 4 874 882 10.1007/s00330-002-1519-7 12664129 12 Ueda T. Oe S. Yoneda A. Koya Y. Nebuya S. Miyagawa K. Honma Y. Shibata M. Shimajiri S. Harada M. A case of adrenal metastasis of hepatocellular carcinoma diagnosed by endoscopic ultrasound-guided fine-needle aspiration. DEN Open 2024 4 1 e362 10.1002/deo2.362 38601272 PMC11004765 13 Paganetti C. Heigl A. Rosenberg R. Vetter M. Haslbauer J. Steuerwald M. Case report: 65-year-old man with metachronous left sided adrenal metastasis of hepatocellular carcinoma. Int. J. Surg. Case Rep. 2024 119 109683 10.1016/j.ijscr.2024.109683 38688153 PMC11067464 14 Zeineddine F.A. Ahmed Z. Victor D. Farach A. Divatia M. Kodali S. Hepatocellular carcinoma recurrence as isolated adrenal metastasis. ACG Case Rep. J. 2023 10 6 e01065 10.14309/crj.0000000000001065 38549945 PMC10977528 15 Rubio E. González J. Jimenéz M. Lucena J.L. Gimenez L. Martinez Arrieta F. Cuervas-Mons V. Turrión V.S. Right adrenal metastases of hepatocarcinoma after liver transplantation: Case report and literature review. Transplant. Proc. 2009 41 3 1067 1069 10.1016/j.transproceed.2009.02.018 19376429 16 Park J.S. Yoon D.S. Kim K.S. Choi J.S. Lee W.J. Chi H.S. Kim B.R. What is the best treatment modality for adrenal metastasis from hepatocellular carcinoma? J. Surg. Oncol. 2007 96 1 32 36 10.1002/jso.20773 17345596 17 Hasegawa T. Yamakado K. Nakatsuka A. Uraki J. Yamanaka T. Fujimori M. Miki M. Sasaki T. Sakuma H. Sugimura Y. Unresectable adrenal metastases: Clinical outcomes of radiofrequency ablation. Radiology 2015 277 2 584 593 10.1148/radiol.2015142029 25997031 18 Yuan H. Liu F. Li X. Guan Y. Wang M. Clinical efficacy of chemoembolization with simultaneous radiofrequency ablation for treatment of adrenal metastases from hepatocellular carcinoma. Cancer Imaging 2018 18 1 24 10.1186/s40644-018-0157-5 30064514 PMC6069544 19 Sakamoto Y. Kubota K. Mori M. Inoue K. Abe H. Harihara Y. Bandai Y. Makuuchi M. Surgical management for adrenal gland metastasis of hepatocellular carcinoma. Hepatogastroenterol. 1999 46 26 1036 1041 10370663 20 Goletti O. De Negri F. Pucciarelli M. Sidoti F. Bertolucci A. Chiarugi M. Seccia M. Subcutaneous seeding after percutaneous ethanol injection of liver metastasis. Radiology 1992 183 3 785 786 10.1148/radiology.183.3.1584934 1584934 21 Wei N. Wong V. Matz A. Vemulakonda L.A. Wang X. Phillips J. Ectopic hepatocellular carcinoma presenting as a right adrenal mass with IVC thrombus: Case report and review of the literature. Urol. Case Rep. 2022 40 101900 10.1016/j.eucr.2021.101900 34712591 PMC8528669 22 Pradeep P.V. Mampilly N. Prabhakaran P.B. Isolated unilateral adrenal metastasis as a presenting feature of occult hepatocellular carcinoma. Saudi. Surg. J. 2016 4 2 87 10.4103/2320-3846.183702 23 Mundada P. Tan M.L. Soh A.W.E. Radiologically occult hepatocellular carcinoma in a cirrhotic liver presenting with bilateral adrenal metastases. Med. J. Malaysia 2015 70 4 256 258 26358025 24 Longmaid H.E. III Seltzer S.E. Costello P. Gordon P. Hepatocellular carcinoma presenting as primary extrahepatic mass on CT. AJR Am. J. Roentgenol. 1986 146 5 1005 1009 10.2214/ajr.146.5.1005 3008540 25 Jakate S. Yabes A. Giusto D. Naini B. Lassman C. Yeh M.M. Ferrell L.D. Diffuse cirrhosis-like hepatocellular carcinoma: a clinically and radiographically undetected variant mimicking cirrhosis. Am. J. Surg. Pathol. 2010 34 7 935 941 10.1097/PAS.0b013e3181ddf52f 20463569 26 Xiong M.J. Patel C.R. Manne U. Al Diffalha S. Cirrhotomimetic hepatocellular carcinoma: experience of a single institution and review of the literature. Hepat. Oncol. 2021 8 1 HEP28 10.2217/hep-2020-0015 33680429 PMC7907961 27 Ishikawa N. Kamimura K. Endo S. Ishii S. Ogawa K. Sakai N. Abe H. Ko M. Shibata O. Koseki Y. Yokoyama J. Sakamaki A. Terai S. Effects of atezolizumab and bevacizumab on adrenal gland metastasis of hepatocellular carcinoma: A case report and review of literature. Intern. Med. 2022 61 21 3233 3237 10.2169/internalmedicine.9341-22 35431306 PMC9683801 Fig. (1) Pre-operative CT showing the left adrenal lesion. Fig. (2) Surgery specimen of the adrenal lesion. Table 1 HCC metastasis without primary known tumor. Sex History Lesion 71y Male [ 17 Known unchanged non-PET avid 2.2 cm hepatic lesion and normal AFP levels, considered heterotopic tissue RA 9.1 x 8.2 × 8.6 cm 69y Male [ 18 Left-sided abdominal pain; no known liver disease; LA 7.6 x 6.9 x 7 cm; no hepatic lesions found 32y Male [ 19 Weight loss and abdominal bloating in the last 4 months; acute abdominal pain, hematemesis and melena; HBV+ RA 10 x 7 cm; LA 14 x 12 cm; atrophy of hepatic left lobe and hypertrophy of the caudate, with regenerative nodules; no signs of HCC 76y Male [ 1 Macroscopic hematuria and lumbar pain; HBV+; LA 11.5 x 7.5 cm; no hepatic lesions; 7 months later developed multiple hepatic lesions 44y Female [ 20 Epigastric pain, no known liver disease RA (size not reported) with multiple smaller hepatic lesions interpreted as metastasis Abbreviations: ",
  "metadata": {
    "Title of this paper": "Effects of atezolizumab and bevacizumab on adrenal gland metastasis of hepatocellular carcinoma: A case report and review of literature.",
    "Journal it was published in:": "Endocrine, Metabolic & Immune Disorders Drug Targets",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481543/"
  }
}