{
  "title": "Paper_48",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490215 PMC12490215.1 12490215 12490215 40876451 10.1016/j.xcrm.2025.102315 S2666-3791(25)00388-X 102315 1 Review Addressing clinical needs in NSCLC immunotherapy: Mechanisms of resistance and promising combination strategies Kang Kai 1 2 3 Liu Shanghai 1 2 3 Yao Zhuoran yaozhuoran@outlook.com 1 2 3 ∗ Xue Jianxin 1 2 3 Lu You 1 2 3 1 2 3 ∗ yaozhuoran@outlook.com 16 9 2025 27 8 2025 6 9 498186 102315 27 08 2025 03 10 2025 03 10 2025 © 2025 Published by Elsevier Inc. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary PD-(L)1 monoclonal antibody-based immunotherapy has become the cornerstone of treatment for non-small cell lung cancer without driver gene alterations. However, resistance, including primary and acquired resistance, remains a major clinical challenge. In this review, we summarize the delayed separation of progression-free survival curves observed in randomized clinical trials, which reflects the emergence of resistance at different treatment stages and the dynamic evolution of anti-tumor immune responses. The development of effective combination strategies should therefore be guided by a thorough understanding of the complex biological mechanisms governing tumor-immune interactions. We review the underlying mechanisms of immunotherapy resistance and propose potential combination strategies. Finally, we emphasize several key considerations for future clinical trial design, including the sequencing of combination therapies, biomarker-guided treatment selection, and optimized management of treatment-related toxicities. Graphical abstract Kang et al. review mechanisms of primary and acquired resistance to anti-PD-(L)1 immunotherapy in NSCLC and discuss emerging combination strategies including radiotherapy, anti-angiogenic therapy, antibody-drug conjugates (ADCs), and adoptive cell therapy, aligned with specific resistance mechanisms. They also highlight key considerations for optimizing combination strategies and improving clinical outcomes. Keywords non-small cell lung cancer immunotherapy resistance combination treatment pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Lung cancer is among the most common and lethal cancers, and non-small cell lung cancer (NSCLC) accounts for approximately 85% of all lung cancer cases. 1 2 , 3 4 , 5 Unfortunately, despite the overall improvement in efficacy observed in clinical trials, some patients remain completely unresponsive to ICIs and experience rapid disease progression owing to primary resistance, even when ICIs are combined with chemotherapy. 6 , 7 8 8 In this review, we aimed to summarize recent advances in numerous clinical trials of immunotherapy for NSCLC, integrating them into the resistance characteristics of immunotherapy. This emphasizes the distinctive mechanisms underlying various combination approaches used to enhance ICI efficacy. Finally, this review aimed to discuss the challenges and future directions of these combination strategies, including optimizing treatment sequencing, identifying reliable biomarkers, and ensuring the safety of therapeutic regimens. Characteristics of immunotherapy resistance Classifications and clinical patterns of resistance The concepts of primary and acquired resistance to ICIs originate from other anti-tumor therapies such as chemotherapy and targeted therapy. 9 10 10 Figure 1 Table S1 Figure 1 Figure 1 Summary of PFS curve characteristics from clinical trials of first-line immunotherapy for advanced NSCLC (A) Each point on the scatterplot represents the time at which the PFS curves of the experimental and control arms intersect, as well as the remaining PFS probability at that time. The size of each point corresponds to the total number of patients in both the experimental and control arms, while the color indicates whether the experimental arm received immunotherapy alone or immunotherapy combined with chemotherapy. (B) Schematic representation of the PFS curves for immunotherapy in NSCLC. Mechanisms of primary resistance Resistance to ICIs differs from chemotherapy and targeted therapy, as it involves both tumor-intrinsic factors and the external tumor microenvironment (TME). Effective immunotherapy depends on a functioning cancer-immune cycle in which tumor cells release antigens, antigen-presenting cells activate and recruit cytotoxic T lymphocytes (CTLs), and CTLs recognize and eliminate tumor cells. 11 Tumor-intrinsic factors of primary resistance The immunogenicity of tumor cells is largely influenced by their mutation burden and neoantigen load, both of which are critical in shaping effective anti-tumor immune responses. 12 13 EGFR ALK 14 , 15 STK11 KEAP1 16 In addition, genetic alteration in signaling pathways, such as mitogen-activated protein kinase (MAPK), phosphatase and tensin homolog (PTEN), and interferon-gamma (IFNγ), affects T cell recruitment and antigen presentation through downstream signaling, ultimately contributing to resistance to immunotherapy. 7 , 9 17 + 18 Tumor-extrinsic factors of primary resistance Pre-existing tumor-extrinsic factors, including immunosuppressive cells, aberrant angiogenesis, and cancer-associated fibroblasts (CAFs), have also been identified as contributors to primary resistance. Myeloid-derived suppressor cells, Tregs, and M2-like tumor-associated macrophages (TAMs) suppress ICI efficacy by secreting immunosuppressive cytokines such as IL-10 and TGF-β and by expressing inhibitory immune checkpoints such as cytotoxic T lymphocyte-associated antigen-4 (CTLA-4) and T cell immunoglobulin mucin 3 (TIM-3). 19 , 20 , 21 With advances in research and single-cell transcriptomic technologies, analyses of immunosuppressive cells have progressed from the cellular to the molecular level, revealing significant functional heterogeneity even within the same cell type. Compared to Tregs in normal tissues, those within the TME are more likely to exhibit a CCR8 + − 22 , 23 + 24 Aberrant tumor vasculature, primarily driven by excessive VEGF, promotes immune evasion through multiple mechanisms: inhibiting CTL trafficking and effector functions, suppressing dendritic cell (DC) maturation and antigen presentation, and facilitating the recruitment and proliferation of the aforementioned immunosuppressive cells. 25 , 26 26 + 27 Additionally, CAFs act as physical and functional barriers to T cell recognition of tumor cells, not only hindering T cell infiltration through deposited matrix but also promoting T cell exhaustion via TGF-β signaling and enhancing immune checkpoint expression. 28 + + 29 + 30 , 31 Mechanisms of acquired resistance Acquired resistance arises more rapidly after an initial clinical benefit, whereas drivers of primary resistance are more likely rooted in years of co-evolution between the tumor and the host’s immune response. 32 Tumor-intrinsic factors of acquired resistance Tumor-intrinsic factors of acquired resistance primarily contribute to defective antigen presentation. Loss of neoantigens during immunotherapy, through either the elimination of tumor subclones or deletion of chromosomal regions, has been linked to acquired resistance. 33 34 32 , 35 Interestingly, in addition to pathway inactivation caused by relevant mutations, persistent activation of the tumor-intrinsic IFNγ signaling can also lead to acquired resistance. Unlike primary resistance, tumors with acquired resistance often retain or even enhance inflammatory features rather than exhibiting a non-inflamed phenotype. The marked upregulation of IFNγ suggests a persistent yet insufficient anti-tumor immune response, where chronic IFNγ signaling promotes immune evasion by inducing T cell dysfunction and disrupting antigen presentation, thereby underscoring the therapeutic potential of reprogramming this pathway. 36 Tumor-extrinsic factors of acquired resistance Tumor-extrinsic factors also play a crucial role in acquired resistance, with exhaustion of T cell function and reduction in T cell numbers being the primary contributors. In addition to the primary targets, PD-1 and PD-L1, T cell dysfunction is further exacerbated by the cumulative expression of multiple inhibitory receptors. Following the failure of the PD-1 pathway blockade, alternative immune checkpoints, particularly TIM-3, are upregulated in T cells. 37 , 38 35 39 Strategies to overcome primary resistance Radiotherapy: Promoting antigenicity and overcoming immune desertification Radiotherapy has long been a key component of cancer treatment. In recent years, in addition to its direct cytotoxic effects, radiotherapy exerts immunomodulatory effects on the TME. 40 Primary resistance to immunotherapy often stems from insufficient tumor antigenicity and a suppressive TME. Radiotherapy can exert immunostimulatory effects that specifically target these mechanisms, thereby helping to overcome primary resistance to immunotherapy through multiple mechanisms ( Figure 2 41 , 42 43 , 44 Figure 2 Overview of primary resistance mechanisms to immunotherapy in NSCLC and potential combination strategies to overcome primary resistance The potential of radiotherapy combined with immunotherapy has been validated in multiple preclinical NSCLC models, yet the transition to clinical research presents increased complexity. 45 , 46 47 48 For patients with unresectable stage III NSCLC, the PACIFIC trial demonstrated that maintenance treatment with durvalumab following concurrent chemoradiotherapy significantly improved survival outcomes compared with placebo. 49 50 51 52 These clinical trials suggest that the combination of immunotherapy with radiotherapy does not automatically mean that it will work well. Radiotherapy has long focused on maximizing tumor cell eradication while minimizing toxicity to healthy tissues, often overlooking its immunomodulatory effects. Considering the dual nature of radiotherapy in immunomodulation, in addition to the immunostimulatory effect, immunosuppressive effects are also available including the accumulation of M2-like TAMs, Tregs, CAFs, and other immunosuppressive cells under the support of TGF-β, as well as lymph node dysfunction and reduction of immune effector cells caused by radiation. 44 , 53 53 Implementing the concept of adaptive immunoradiotherapy involves refining radiation doses, fractionation schedules, and radiation fields to minimize damage to immune effector cells. Optimization of the sequencing of radiotherapy and immunotherapy is also required to enhance the synergistic effects while limiting toxicity to normal tissues. Several studies have explored the feasibility of this concept. In patients with metastatic NSCLC, a strategy combining SBRT for small lesions aimed at releasing tumor antigens to prime CTLs and low-dose radiotherapy (LDRT) for larger lesions designed to reshape the TME along with immunotherapy has been investigated. 54 , 55 56 57 , 58 Taken together, the inconsistent results observed across clinical trials may stem from heterogeneity in study designs, including variations in radiation dose, fractionation, target volume, and the timing or duration of immunotherapy. 59 Anti-angiogenic therapy: Normalizing vasculature to facilitate immune cell infiltration Dysregulation of pro- and anti-angiogenic factors leading to abnormal vasculature is a hallmark of tumors. In addition to promoting tumor invasion and metastasis, an abnormal tumor vasculature induces an immunosuppressive TME. 26 Figure 2 26 The combination of anti-angiogenic therapy and immunotherapy has been a long-standing area of development, with multiple phase 3 randomized controlled trials exploring the efficacy of combination treatments in different populations of patients with NSCLC. For patients with driver mutation-positive NSCLC whose disease progresses while receiving targeted therapy, optimal treatment options remain limited. Both the CheckMate 722 and KEYNOTE-789 trials failed to demonstrate that adding immunotherapy to platinum-based doublet chemotherapy provides PFS or OS benefits for patients with EGFR-mutated NSCLC who progressed to EGFR tyrosine kinase inhibitor (TKI) therapy. 60 , 61 62 63 64 Interim analyses of the ORIENT-31 and HARMONi-A trials provided promising results for patients with EGFR-mutated non-squamous NSCLC who progressed with EGFR-TKI therapy. The ORIENT-31 study showed that the combination of sintilimab, the bevacizumab biosimilar IBI305, and chemotherapy significantly improved PFS, yielding a median PFS of 5.5 months, compared to 4.3 months with chemotherapy alone. 65 66 The combination of immunotherapy and anti-angiogenic therapy also holds substantial promise for patients with advanced NSCLC lacking EGFR or ALK genetic alterations. While the previously mentioned IMpower150 and IMpower151 trials showed inconsistent benefits for patients who progressed to targeted therapies for driver mutations, the subgroup of patients without driver mutations consistently demonstrated a trend toward survival benefits. 62 , 63 67 In summary, the divergent outcomes observed across clinical trials of anti-angiogenic therapy combined with immunotherapy may be attributed to two main factors. First, patients with EGFR-mutated NSCLC often exhibit a more immunosuppressive TME, which limits the efficacy of immunotherapy. Second, differences in drug design also play a critical role. In particular, BsAb such as ivonescimab may achieve better spatiotemporal synergy by co-targeting VEGF and PD-1, thereby enhancing therapeutic specificity while minimizing toxicity and efficacy dilution. 68 Antibody-drug conjugates Antibody-drug conjugates (ADCs) have recently emerged as a focal point for lung cancer treatment. ADCs typically comprise three key components: an antibody that targets tumor cell surface antigens, a cytotoxic payload, and a chemical linker that connects them. Once ADC binds to the surface of a tumor cell, it becomes internalized and transported into the cell, where the cytotoxic payload is released within lysosomes, exerting its anti-tumor effects. 69 Figure 2 70 , 71 71 The most commonly targeted antigens for ADCs in treating NSCLC are trophoblast cell surface antigen 2 (TROP2), HER2, and HER3, which are widely overexpressed in the tumor cell membranes of patients with NSCLC. ADCs targeting TROP2 have been extensively explored in combination with immunotherapy. Several early clinical trials have mutually validated the safety and feasibility of ADCs targeting TROP2, with various designs, as first-line treatments in combination with immunotherapy for NSCLC. 72 , 73 , 74 , 75 74 75 ADCs are emerging as rising stars in precision chemotherapy with significant potential for combined application with immunotherapy. However, the current diversity and heterogeneity of ADCs pose challenges. Large-scale clinical trials are essential for evaluating the efficacy of different targets, ADC designs, and bispecific ADCs in combination with immunotherapies. Small-molecule drugs: Targeting tumor-intrinsic pathways Small-molecule drugs and antibody-based therapies, based on immunoglobulin frameworks, are two distinct classes of therapeutic agents. Compared with small-molecule drugs, monoclonal antibodies exhibit higher specificity for binding to their targets. However, owing to their prolonged half-life, immune-related adverse events associated with antibodies are difficult to mitigate through dose adjustments and often require treatment discontinuation for 1–2 months to alleviate symptoms. 76 Figure 2 Mutations in the KRAS gene family were once considered undruggable; however, the KRAS G12C G12C 77 G12C G12C 78 NCT04613596 G12D 79 During active DNA replication, tumor cells inevitably accumulate replication errors. Typically, the DDR recognizes DNA damage and activates repair mechanisms to maintain genomic integrity. However, a faulty DDR can lead to the production of immunogenic DNA fragments and can be recognized by receptors such as cGAS-STING, thereby stimulating anti-tumor immunity. 80 81 81 , 82 76 , 80 Strategies to overcome acquired resistance While various strategies with ongoing clinical evidence are exploring ways to remodel the TME and overcome primary resistance to immune checkpoint blockade, there remains a need for approaches that sustain long-term anti-tumor immune responses. Considering the potential factors that drive acquired resistance, such as T cell exhaustion and defective antigen presentation, future strategies may focus on two main tactics: prolonging T cell persistence or boosting antigen recognition of T cells. These efforts aim to establish a lasting anti-tumor response and raise the tail of the survival curve. Dual blockade immunotherapy: Reversing T cell dysfunction Immunosuppressive mechanisms in TME induce T cell exhaustion and anergy, leading to attenuated anti-tumor immune responses. This attenuation contributes to the development of acquired resistance to immunotherapy. Blocking these inhibitory signals or strengthening T cell function through co-stimulation with agonists is an effective approach for sustaining T cell activity ( Figure 3 Figure 3 Overview of acquired resistance mechanisms to immunotherapy in NSCLC and potential combination strategies to overcome acquired resistance By releasing the brakes between antigen-presenting cells and the initial activation phase of T cells, a dual checkpoint blockade combining PD-1/PD-L1 and CTLA-4 monoclonal antibodies should elicit more robust activation of the immune system than PD-1 inhibition alone. However, randomized controlled trials have indicated that this dual immunotherapeutic approach may not achieve the anticipated synergistic effects. 83 , 84 , 85 86 , 87 , 88 Interestingly, the advent of BsAbs has overcome this impasse. Advances in molecular biology and genetic engineering have facilitated the design of more delicate and precise structural constructs. Therefore, BsAbs are not merely cocktails of two monoclonal antibodies; instead, they exhibit enhanced synergistic therapeutic effects. BsAbs targeting PD-1 × CTLA-4, including volrustomig and cadonilimab, have increased accumulation in the TME and preferable CTLA-4 blockade on PD-1 + – 89 , 90 + 91 92 , 93 , 94 95 In addition to the co-inhibition of immunosuppressive receptors, combinations of PD-1 blockade with agonist antibodies against costimulatory receptors can take the foot off the brake and simultaneously hit the gas of T cells. ATG-101 is a tetravalent PD-L1 × 4-1BB BsAb with high PD-L1 affinity and low 4-1BB affinity. 96 Adoptive cell transfer: Replenishment of exogenous T cells While endogenous T cell function could be maintained through immune signaling pathway agonists/antagonists, supplementation with exogenous tumor-specific T cells may offer a promising alternative strategy. Previous studies have demonstrated that effective anti-tumor immunity can be restored by replenishing the TME with fresh, non-exhausted immune cells originating from peripheral sites, suggesting the importance of active T cell trafficking. 97 98 ex vivo Figure 3 The disruption of the PD-L1/PD-1 signaling pathways inherently complements ACT strategies, as T cells naturally undergo activation-induced upregulation of co-inhibitory pathways, which can limit anti-tumor immune responses when T cells bind to their complementary ligands. 99 100 , 101 , 102 99 103 ex vivo TILs TIL therapy has emerged early in the field of cancer immunotherapy; however, its development has been fraught with numerous challenges. Over the years, TIL therapy has undergone a tumultuous journey characterized by technical hurdles in isolating and expanding sufficient numbers of functional lymphocytes, a lack of in vivo 104 105 , 106 , 107 The lone-completed trial utilizing TILs as therapy was conducted as a single-arm phase 1 trial of TILs administered with nivolumab in 20 patients with advanced NSCLC following initial progression to nivolumab monotherapy. 108 STK11 109 102 TCR-engineered T cells TCRs are pivotal mediators in the activation, recognition, and cytolysis of tumor cells by T lymphocytes. When TCR binds to an MHC-peptide antigen complex on the surface of a tumor cell, it triggers signal transduction pathways that activate T lymphocytes, initiating an immune response. The diversity of TCRs arises from the random rearrangement of multiple separate gene segments during V(D)J recombination in germline genes. This diversity endows individuals with an almost limitless capacity for antigen recognition and response, enabling TCRs to identify a wide array of tumor antigens and exert cytotoxic and surveillance functions against tumor cells. 110 TCR-engineered T cell (TCR-T) therapy leverages genetic engineering techniques to modify a patient’s T cells, enabling them to express specific TCRs that recognize and target tumor-specific antigens. Currently, the mainstream TCR-T targets are classified into two categories. The former targets common tumor-associated antigens, including New York esophageal squamous cell carcinoma 1 (NY-ESO-1), melanoma-associated antigen A4 (MAGE-A4), human papillomavirus type 16, and GP100, allowing for broader clinical applicability and wider patient coverage. 111 112 113 Tumor neoantigen-specific TCRs can be identified using high-throughput sequencing technology, thereby developing patient-specific TCR-T therapies. Foy et al. initiated a pioneering neoTCR T cell therapy phase 1 trial. 114 CAR-T cells Unlike TIL and TCR-T cell therapies, chimeric antigen receptor T cell (CAR-T) therapy is the most successful form of cellular immunotherapy to date. CAR-T therapy has achieved significant efficacy and widespread clinical application in hematological malignancies, such as lymphoma and multiple myeloma. 115 Currently, CAR-T cell therapies targeting solid tumors are being rapidly developed. In the domain of gastrointestinal tumors, CAR-T therapies targeting antigens such as glypican-3 (GPC3), claudin18.2, GCC19, and GUCY2C have demonstrated promising efficacy in early-phase clinical trials. 116 , 117 , 118 , 119 , 120 121 122 123 , 124 122 , 125 126 , 127 To date, the development of ACT therapies with clinical utility for NSCLC remains challenging. Several potentially challenging issues, including (1) insufficiently specific target antigens (creating the risk of on-target or off-tumor toxicity), (2) poor trafficking, (3) short persistence, (4) loss of effector function, and (5) tumor antigen heterogeneity and immune evasion, have been thoroughly summarized and discussed in several excellent reviews. 115 , 128 , 129 129 , 130 Neoantigen vaccines: Sustaining T cell activity Even when T cells are present, the immunosuppressive TME in resistant disease often drives T cell dysfunction or exhaustion. Chronic antigen exposure without effective tumor clearance can push T cells into a terminally exhausted state, where they express multiple inhibitory receptors and lose effector function. 131 132 Figure 3 Recent advances in cancer immunology, neoantigen prediction, bioinformatic algorithms, and vaccine technologies have sparked renewed interest in these therapeutic vaccination strategies. The success of mRNA vaccines against infectious diseases has accelerated the development of personalized cancer vaccines, with several promising clinical trials demonstrating their potential for use in various cancer types, particularly melanoma. 133 , 134 135 , 136 , 137 Regarding clinical application strategies, vaccine therapy is unlikely to serve as a standalone treatment but rather needs to be optimally combined with existing therapeutic modalities. Sequential or concurrent immunotherapy may produce synergistic effects, prolong T cell persistence, and control disease progression. For example, a CAR-T cell-amplifying RNA vaccine (CARVac) targeting CLDN6 may increase the persistence of adoptively transferred CAR-T cells. The CLDN6 CAR-T + CARVac combination resulted in strong clinical activity in patients with CLDN6-positive solid tumors. 138 139 140 141 Bispecific T cell engager: Enhancing T cell recognition Bispecific T cell engagers (BiTEs) have emerged as rising stars in the era of antibody therapeutics. BiTEs effectively redirect CTLs to malignant cells by harnessing their ability to simultaneously bind to T and tumor cells. Reduced antigen epitope presentation is recognized as a mechanism of acquired resistance; however, BiTEs can bypass MHC-mediated recognition to directly target tumor cells and mediate crosslinking between T cells and tumor cells ( Figure 3 142 To date, tarlatamab, a DLL3×CD3 BiTE, has been approved by the FDA for second- or later-line treatment of small cell lung cancer. 143 144 145 Future perspectives for immuno-combination strategies in NSCLC Explosive advancements in tumor drug research and development have introduced numerous possibilities for treatment strategies for patients with NSCLC. We have summarized several representative ongoing randomized controlled trials comparing immunotherapy and immunotherapy-based combination strategies in NSCLC ( Table S2 Figure 4 Figure 4 Figure 4 Cross-level resistance mechanisms to immunotherapy in NSCLC (A) Schematic representation of specific mechanisms contributing to resistance across different levels. (B) Conceptual illustration of the dynamics of immunotherapy resistance over treatment time and potential combination strategies to overcome resistance. Optimizing the sequencing of combinational strategies Different therapeutic agents may exert their optimal effects when used in specific contexts or combination. Theoretically, combination strategies to overcome primary ICI resistance should be employed first. By enhancing tumor immunogenicity, promoting antigen release, and disrupting the physical barriers of the TME, a subpopulation of patients can transition from an initially immunologically unresponsive state to an immune-responsive state, thus becoming better prepared for T cell activation and cytotoxicity mediated by ICIs. Afterward, during the maintenance phase of immunotherapy, the introduction of novel strategies is essential to prevent the development of acquired resistance. Additional agents or interventions, such as ACT and vaccines, can sustain and potentiate the anti-tumor immune response, prolonging the durability of clinical outcomes. Rational combination strategies that enhance tumor immunogenicity and sustain immune activation can contribute to better long-term efficacy. 146 147 Biomarker identification A multitude of combination strategies are currently available; however, the indiscriminate addition of therapies can lead to overtreatment and unnecessary toxicity. The future development of immunotherapy combinations should be based on a thorough understanding of the mechanisms underlying immune resistance, enabling the targeted design of strategies to overcome these barriers. The discovery of predictive biomarkers is crucial for patient stratification and personalization of therapy. For instance, in patients with low tumor mutational burden, immunogenic approaches such as local irradiation or ADCs can induce ICD and prime a de novo Mitigation of adverse events in combination treatment Combination therapies offer the potential to enhance anti-tumor efficacy by targeting multiple pathways; however, they inevitably increase the risk of adverse events due to additive or synergistic toxicities. Mitigating these heightened risks is imperative for ensuring patient safety and treatment tolerability. Therefore, centering on the core mechanisms by which immunotherapy exerts its effects to adaptively adjust both the duration of treatment and the dosage of medications is important. For instance, a lower dose and shorter course of radiotherapy may lessen the harm to the body and lymphocytes, thus acting as a better partner for immunotherapy than traditional radiotherapy protocols. Nevertheless, the involvement of a multidisciplinary team (MDT) is crucial. MDT, including oncologists, internists, immunologists, pharmacists, and nurses, facilitates the comprehensive monitoring and management of systemic multi-organ adverse reactions. By enabling early detection and coordinated management of toxicities, MDT plays a pivotal role in making adverse events associated with combination therapies more controllable. This collaborative approach improves patient outcomes and maximizes the therapeutic potential of combination treatments by balancing efficacy and safety. Conclusion As our understanding of tumor immune mechanisms and immunotherapeutic agents deepens, the landscape of lung cancer immunotherapy, or even the entire oncological treatment paradigm, has entered a new era. In the post–PD-(L)1 context, the critical challenge is to identify innovative and effective combination immunotherapy strategies with considerable attention to the dynamics of anti-tumor immunity. This pursuit holds significant practical importance and research value and urgently necessitates validation through further clinical trials. By leveraging a comprehensive understanding of immune resistance mechanisms, designing targeted treatments to overcome both primary and acquired resistances is possible. Multidisciplinary collaboration and rigorous scientific research are essential for advancing these novel therapies and ultimately improving the prognosis of patients with this challenging disease. Acknowledgments This work was supported by the 1·3·5 Project for Disciplines of Excellence, 10.13039/501100013365 West China Hospital, Sichuan University ZYJC21003 10.13039/501100001809 National Natural Science Foundation of China 82350128 National Natural Science Foundation of China 82303694 82303772 Author contributions Y.L., J.X., Z.Y., and K.K. contributed to the concept. Z.Y., S.L., and K.K. were involved in the analysis and assembly of data from randomized controlled trials. Z.Y. and K.K. wrote the original draft. All authors revised the manuscript and approved the final version submitted for publication. Declaration of interests Y.L. has an invited speaker/project lead/principal investigator role with Roche, AstraZeneca, BeiGene, and Hengrui Pharmaceuticals and an invited speaker role with Pfizer, Merck Sharp & Dohme, and Bristol-Myers Squibb. References 1 Siegel R.L. Giaquinto A.N. Jemal A. Cancer statistics, 2024 CA Cancer J. Clin. 74 2024 12 49 10.3322/caac.21820 38230766 2 Reck M. Rodriguez-Abreu D. Robinson A.G. Hui R. Csoszi T. Fulop A. Gottfried M. Peled N. Tafreshi A. Cuffe S. Five-Year Outcomes With Pembrolizumab Versus Chemotherapy for Metastatic Non-Small-Cell Lung Cancer With PD-L1 Tumor Proportion Score >/= 50 J. Clin. Oncol. 39 2021 2339 2349 10.1200/JCO.21.00174 33872070 PMC8280089 3 Jassem J. de Marinis F. Giaccone G. Vergnenegre A. Barrios C.H. Morise M. Felip E. Oprean C. Kim Y.C. Andric Z. Updated Overall Survival Analysis From IMpower110: Atezolizumab Versus Platinum-Based Chemotherapy in Treatment-Naive Programmed Death-Ligand 1-Selected NSCLC J. Thorac. Oncol. 16 2021 1872 1882 10.1016/j.jtho.2021.06.019 34265434 4 Garassino M.C. Gadgeel S. Speranza G. Felip E. Esteban E. Dómine M. Hochmair M.J. Powell S.F. Bischoff H.G. Peled N. Pembrolizumab Plus Pemetrexed and Platinum in Nonsquamous Non-Small-Cell Lung Cancer: 5-Year Outcomes From the Phase 3 KEYNOTE-189 Study J. Clin. Oncol. 41 2023 1992 1998 10.1200/JCO.22.01989 36809080 PMC10082311 5 Novello S. Kowalski D.M. Luft A. Gümüş M. Vicente D. Mazières J. Rodríguez-Cid J. Tafreshi A. Cheng Y. Lee K.H. Pembrolizumab Plus Chemotherapy in Squamous Non-Small-Cell Lung Cancer: 5-Year Update of the Phase III KEYNOTE-407 Study J. Clin. Oncol. 41 2023 1999 2006 10.1200/JCO.22.01990 36735893 PMC10082300 6 Walsh R.J. Soo R.A. Resistance to immune checkpoint inhibitors in non-small cell lung cancer: biomarkers and therapeutic strategies Ther. Adv. Med. Oncol. 12 2020 1758835920937902 10.1177/1758835920937902 PMC7339077 32670423 7 Sharma P. Hu-Lieskovan S. Wargo J.A. Ribas A. Primary, Adaptive, and Acquired Resistance to Cancer Immunotherapy Cell 168 2017 707 723 10.1016/j.cell.2017.01.017 28187290 PMC5391692 8 Schoenfeld A.J. Hellmann M.D. Acquired Resistance to Immune Checkpoint Inhibitors Cancer Cell 37 2020 443 455 10.1016/j.ccell.2020.03.017 32289269 PMC7182070 9 Passaro A. Brahmer J. Antonia S. Mok T. Peters S. Managing Resistance to Immune Checkpoint Inhibitors in Lung Cancer: Treatment and Novel Strategies J. Clin. Oncol. 40 2022 598 610 10.1200/JCO.21.01845 34985992 10 Kluger H.M. Tawbi H.A. Ascierto M.L. Bowden M. Callahan M.K. Cha E. Chen H.X. Drake C.G. Feltquate D.M. Ferris R.L. Defining tumor resistance to PD-1 pathway blockade: recommendations from the first meeting of the SITC Immunotherapy Resistance Taskforce J. Immunother. Cancer 8 2020 e000398 10.1136/jitc-2019-000398 PMC7174063 32238470 11 Chen D.S. Mellman I. Oncology meets immunology: the cancer-immunity cycle Immunity 39 2013 1 10 10.1016/j.immuni.2013.07.012 23890059 12 Rizvi N.A. Hellmann M.D. Snyder A. Kvistborg P. Makarov V. Havel J.J. Lee W. Yuan J. Wong P. Ho T.S. Cancer immunology. Mutational landscape determines sensitivity to PD-1 blockade in non-small cell lung cancer Science 348 2015 124 128 10.1126/science.aaa1348 25765070 PMC4993154 13 Marabelle A. Le D.T. Ascierto P.A. Di Giacomo A.M. De Jesus-Acosta A. Delord J.-P. Geva R. Gottfried M. Penel N. Hansen A.R. Efficacy of Pembrolizumab in Patients With Noncolorectal High Microsatellite Instability/Mismatch Repair-Deficient Cancer: Results From the Phase II KEYNOTE-158 Study J. Clin. Oncol. 38 2020 1 10 10.1200/JCO.19.02105 31682550 PMC8184060 14 Mazieres J. Drilon A. Lusque A. Mhanna L. Cortot A.B. Mezquita L. Thai A.A. Mascaux C. Couraud S. Veillon R. Immune checkpoint inhibitors for patients with advanced lung cancer and oncogenic driver alterations: results from the IMMUNOTARGET registry Ann. Oncol. 30 2019 1321 1328 10.1093/annonc/mdz167 31125062 PMC7389252 15 Otano I. Ucero A.C. Zugazagoitia J. Paz-Ares L. At the crossroads of immunotherapy for oncogene-addicted subsets of NSCLC Nat. Rev. Clin. Oncol. 20 2023 143 159 10.1038/s41571-022-00718-x 36639452 16 Skoulidis F. Araujo H.A. Do M.T. Qian Y. Sun X. Cobo A.G. Le J.T. Montesion M. Palmer R. Jahchan N. CTLA4 blockade abrogates KEAP1/STK11-related resistance to PD-(L)1 inhibitors Nature 635 2024 462 471 10.1038/s41586-024-07943-7 39385035 PMC11560846 17 Liu C. Peng W. Xu C. Lou Y. Zhang M. Wargo J.A. Chen J.Q. Li H.S. Watowich S.S. Yang Y. BRAF inhibition increases tumor infiltration by T cells and enhances the antitumor activity of adoptive immunotherapy in mice Clin. Cancer Res. 19 2013 393 403 10.1158/1078-0432.CCR-12-1626 23204132 PMC4120472 18 Exposito F. Redrado M. Houry M. Hastings K. Molero-Abraham M. Lozano T. Solorzano J.L. Sanz-Ortega J. Adradas V. Amat R. PTEN Loss Confers Resistance to Anti-PD-1 Therapy in Non-Small Cell Lung Cancer by Increasing Tumor Infiltration of Regulatory T Cells Cancer Res. 83 2023 2513 2526 10.1158/0008-5472.CAN-22-3023 37311042 19 Highfill S.L. Cui Y. Giles A.J. Smith J.P. Zhang H. Morse E. Kaplan R.N. Mackall C.L. Disruption of CXCR2-mediated MDSC tumor trafficking enhances anti-PD1 efficacy Sci. Transl. Med. 6 2014 237ra67 10.1126/scitranslmed.3007974 PMC6980372 24848257 20 Tie Y. Tang F. Wei Y.-Q. Wei X.-W. Immunosuppressive cells in cancer: mechanisms and potential therapeutic targets J. Hematol. Oncol. 15 2022 61 10.1186/s13045-022-01282-8 35585567 PMC9118588 21 Sasidharan Nair V. Elkord E. Immune checkpoint inhibitors in cancer therapy: a focus on T-regulatory cells Immunol. Cell Biol. 96 2018 21 33 10.1111/imcb.1003 29359507 22 Zhang C. Sun Y.-X. Yi D.-C. Jiang B.-Y. Yan L.-X. Liu Z.-D. Peng L.-S. Zhang W.-J. Sun H. Chen Z.-Y. Neoadjuvant sintilimab plus chemotherapy in EGFR-mutant NSCLC: Phase 2 trial interim results (NEOTIDE/CTONG2104) Cell Rep. Med. 5 2024 101615 10.1016/j.xcrm.2024.101615 PMC11293361 38897205 23 Liu Z. Yang Z. Wu J. Zhang W. Sun Y. Zhang C. Bai G. Yang L. Fan H. Chen Y. A single-cell atlas reveals immune heterogeneity in anti-PD-1-treated non-small cell lung cancer Cell 188 2025 3081 3096.e19 10.1016/j.cell.2025.03.018 40147443 24 Chen P. Wang H. Tang Z. Shi J. Cheng L. Zhao C. Li X. Zhou C. Selective Depletion of CCR8+Treg Cells Enhances the Antitumor Immunity of Cytotoxic T Cells in Lung Cancer by Dendritic Cells J. Thorac. Oncol. 20 2025 1050 1074 10.1016/j.jtho.2025.02.029 40056978 25 Hegde P.S. Wallin J.J. Mancao C. Predictive markers of anti-VEGF and emerging role of angiogenesis inhibitors as immunotherapeutics Semin. Cancer Biol. 52 2018 117 124 10.1016/j.semcancer.2017.12.002 29229461 26 Fukumura D. Kloepper J. Amoozgar Z. Duda D.G. Jain R.K. Enhancing cancer immunotherapy using antiangiogenics: opportunities and challenges Nat. Rev. Clin. Oncol. 15 2018 325 340 10.1038/nrclinonc.2018.29 29508855 PMC5921900 27 Alnaqbi H. Becker L.M. Mousa M. Alshamsi F. Azzam S.K. Emini Veseli B. Hymel L.A. Alhosani K. Alhusain M. Mazzone M. Immunomodulation by endothelial cells: prospects for cancer therapy Trends Cancer 10 2024 1072 1091 10.1016/j.trecan.2024.08.002 39289084 28 Arpinati L. Scherz-Shouval R. From gatekeepers to providers: regulation of immune functions by cancer-associated fibroblasts Trends Cancer 9 2023 421 443 10.1016/j.trecan.2023.01.007 36870916 29 Grout J.A. Sirven P. Leader A.M. Maskey S. Hector E. Puisieux I. Steffan F. Cheng E. Tung N. Maurin M. Spatial Positioning and Matrix Programs of Cancer-Associated Fibroblasts Promote T-cell Exclusion in Human Lung Tumors Cancer Discov. 12 2022 2606 2625 10.1158/2159-8290.CD-21-1714 36027053 PMC9633420 30 Krishnamurty A.T. Shyer J.A. Thai M. Gandham V. Buechler M.B. Yang Y.A. Pradhan R.N. Wang A.W. Sanchez P.L. Qu Y. LRRC15+ myofibroblasts dictate the stromal setpoint to suppress tumour immunity Nature 611 2022 148 154 10.1038/s41586-022-05272-1 36171287 PMC9630141 31 Dominguez C.X. Müller S. Keerthivasan S. Koeppen H. Hung J. Gierke S. Breart B. Foreman O. Bainbridge T.W. Castiglioni A. Single-Cell RNA Sequencing Reveals Stromal Evolution into LRRC15+ Myofibroblasts as a Determinant of Patient Response to Cancer Immunotherapy Cancer Discov. 10 2020 232 253 10.1158/2159-8290.CD-19-0644 31699795 32 Wang M. Herbst R.S. Boshoff C. Toward personalized treatment approaches for non-small-cell lung cancer Nat. Med. 27 2021 1345 1356 10.1038/s41591-021-01450-2 34385702 33 Anagnostou V. Smith K.N. Forde P.M. Niknafs N. Bhattacharya R. White J. Zhang T. Adleff V. Phallen J. Wali N. Evolution of Neoantigen Landscape during Immune Checkpoint Blockade in Non-Small Cell Lung Cancer Cancer Discov. 7 2017 264 276 10.1158/2159-8290.CD-16-0828 28031159 PMC5733805 34 Gettinger S. Choi J. Hastings K. Truini A. Datar I. Sowell R. Wurtz A. Dong W. Cai G. Melnick M.A. Impaired HLA Class I Antigen Processing and Presentation as a Mechanism of Acquired Resistance to Immune Checkpoint Inhibitors in Lung Cancer Cancer Discov. 7 2017 1420 1435 10.1158/2159-8290.CD-17-0593 29025772 PMC5718941 35 Ricciuti B. Lamberti G. Puchala S.R. Mahadevan N.R. Lin J.-R. Alessi J.V. Chowdhury A. Li Y.Y. Wang X. Spurr L. Genomic and Immunophenotypic Landscape of Acquired Resistance to PD-(L)1 Blockade in Non-Small-Cell Lung Cancer J. Clin. Oncol. 42 2024 1311 1321 10.1200/JCO.23.00580 38207230 PMC11095860 36 Memon D. Schoenfeld A.J. Ye D. Fromm G. Rizvi H. Zhang X. Keddar M.R. Mathew D. Yoo K.J. Qiu J. Clinical and molecular features of acquired resistance to immunotherapy in non-small cell lung cancer Cancer Cell 42 2024 209 224.e9 10.1016/j.ccell.2023.12.013 38215748 PMC11249385 37 Thommen D.S. Schreiner J. Müller P. Herzig P. Roller A. Belousov A. Umana P. Pisa P. Klein C. Bacac M. Progression of Lung Cancer Is Associated with Increased Dysfunction of T Cells Defined by Coexpression of Multiple Inhibitory Receptors Cancer Immunol. Res. 3 2015 1344 1355 10.1158/2326-6066.CIR-15-0097 26253731 38 Koyama S. Akbay E.A. Li Y.Y. Herter-Sprie G.S. Buczkowski K.A. Richards W.G. Gandhi L. Redig A.J. Rodig S.J. Asahina H. Adaptive resistance to therapeutic PD-1 blockade is associated with upregulation of alternative immune checkpoints Nat. Commun. 7 2016 10501 10.1038/ncomms10501 PMC4757784 26883990 39 Wang M. Wang Y. Pan X. Wang B. Wang Y. Luo X. Deng X. Liu L. Chen X. Zhai X. Acquired resistance to immunotherapy by physical barriers with cancer cell-expressing collagens in non-small cell lung cancer Proc. Natl. Acad. Sci. USA 122 2025 e2500019122 10.1073/pnas.2500019122 PMC12184647 40498460 40 Weichselbaum R.R. Liang H. Deng L. Fu Y.X. Radiotherapy and immunotherapy: a beneficial liaison? Nat. Rev. Clin. Oncol. 14 2017 365 379 10.1038/nrclinonc.2016.211 28094262 41 Lussier D.M. Alspach E. Ward J.P. Miceli A.P. Runci D. White J.M. Mpoy C. Arthur C.D. Kohlmiller H.N. Jacks T. Radiation-induced neoantigens broaden the immunotherapeutic window of cancers with low mutational loads Proc. Natl. Acad. Sci. USA 118 2021 e2102611118 10.1073/pnas.2102611118 PMC8214694 34099555 42 Lhuillier C. Rudqvist N.P. Yamazaki T. Zhang T. Charpentier M. Galluzzi L. Dephoure N. Clement C.C. Santambrogio L. Zhou X.K. Radiotherapy-exposed CD8+ and CD4+ neoantigens enhance tumor control J. Clin. Investig. 131 2021 e138740 10.1172/JCI138740 PMC7919731 33476307 43 Golden E.B. Frances D. Pellicciotta I. Demaria S. Helen Barcellos-Hoff M. Formenti S.C. Radiation fosters dose-dependent and chemotherapy-induced immunogenic cell death OncoImmunology 3 2014 e28518 10.4161/onci.28518 PMC4106151 25071979 44 Cytlak U.M. Dyer D.P. Honeychurch J. Williams K.J. Travis M.A. Illidge T.M. Immunomodulation by radiotherapy in tumour control and normal tissue toxicity Nat. Rev. Immunol. 22 2022 124 138 10.1038/s41577-021-00568-1 34211187 45 Herter-Sprie G.S. Koyama S. Korideck H. Hai J. Deng J. Li Y.Y. Buczkowski K.A. Grant A.K. Ullas S. Rhee K. Synergy of radiotherapy and PD-1 blockade in Kras-mutant lung cancer JCI Insight 1 2016 e87415 10.1172/jci.insight.87415 PMC5033933 27699275 46 Ban Y. Markowitz G.J. Zou Y. Ramchandani D. Kraynak J. Sheng J. Lee S.B. Wong S.T.C. Altorki N.K. Gao D. Mittal V. Radiation-activated secretory proteins of Scgb1a1(+) club cells increase the efficacy of immune checkpoint blockade in lung cancer Nat. Cancer 2 2021 919 931 10.1038/s43018-021-00245-1 34917944 PMC8670735 47 Chang J.Y. Lin S.H. Dong W. Liao Z. Gandhi S.J. Gay C.M. Zhang J. Chun S.G. Elamin Y.Y. Fossella F.V. Stereotactic ablative radiotherapy with or without immunotherapy for early-stage or isolated lung parenchymal recurrent node-negative non-small-cell lung cancer: an open-label, randomised, phase 2 trial Lancet 402 2023 871 881 10.1016/S0140-6736(23)01384-3 37478883 PMC10529504 48 Pircher A. Sótér S. Eaton M. Galffy G. Kowalski D. Hata A. Bustamante A.A.V. Frost N. Levchenko E. Monteiro M. 117O Stereotactic body radiotherapy (SBRT) with pembrolizumab (pembro) for unresected stage I/II non-small cell lung cancer (NSCLC): The randomized, double-blind, phase III KEYNOTE-867 study Immunooncol. Technol. 24 2024 100746 10.1016/j.iotech.2024.100746 49 Spigel D.R. Faivre-Finn C. Gray J.E. Vicente D. Planchard D. Paz-Ares L. Vansteenkiste J.F. Garassino M.C. Hui R. Quantin X. Five-Year Survival Outcomes From the PACIFIC Trial: Durvalumab After Chemoradiotherapy in Stage III Non-Small-Cell Lung Cancer J. Clin. Oncol. 40 2022 1301 1311 10.1200/JCO.21.01308 35108059 PMC9015199 50 Wu Y.L. Wu L. Bi N. Cil T. Ge H. Zhu Z. Wang C.L. Zhang W. Lv D. Sun J. LBA6 PACIFIC-5: A phase III study of consolidation durvalumab (D) in patients (pts) with unresectable stage III NSCLC and no progression after concurrent or sequential chemoradiotherapy (cCRT or sCRT) Ann. Oncol. 35 2024 S1624 51 Bradley J.D. Sugawara S. Lee K.H.H. Ostoros G. Demirkazik A. Zemanova M. Sriuranpong V. Gelatti A. Menezes J. Zurawski B. LBA1 Durvalumab in combination with chemoradiotherapy for patients with unresectable stage III NSCLC: Final results from PACIFIC-2 ESMO Open 9 2024 102986 52 Iyengar P. Hu C. Gomez D.R. Timmerman R.D. Simone C.B. Robinson C.G. Gerber D.E. Waqar S.N. Donington J. Swisher S. NRG-LU002: Randomized phase II/III trial of maintenance systemic therapy versus local consolidative therapy (LCT) plus maintenance systemic therapy for limited metastatic non-small cell lung cancer (NSCLC) J. Clin. Oncol. 42 2024 8506 10.1200/JCO.2024.42.16_suppl.8506 53 Galluzzi L. Aryankalayil M.J. Coleman C.N. Formenti S.C. Emerging evidence for adapting radiotherapy to immunotherapy Nat. Rev. Clin. Oncol. 20 2023 543 557 10.1038/s41571-023-00782-x 37280366 54 Zhou X. Zhou L. Yao Z. Huang M. Gong Y. Zou B. Zhu J. Liu Y. Peng F. Zhang Y. Safety and Tolerability of Low-Dose Radiation and Stereotactic Body Radiotherapy + Sintilimab for Treatment-Naive Stage IV PD-L1+ Non-Small Cell Lung Cancer Patients Clin. Cancer Res. 29 2023 4098 4108 10.1158/1078-0432.CCR-23-0315 37581611 55 Patel R.R. He K. Barsoumian H.B. Chang J.Y. Tang C. Verma V. Comeaux N. Chun S.G. Gandhi S. Truong M.T. High-dose irradiation in combination with non-ablative low-dose radiation to treat metastatic disease after progression on immunotherapy: Results of a phase II trial Radiother. Oncol. 162 2021 60 67 10.1016/j.radonc.2021.06.037 34237343 PMC11905861 56 Zhao Z.R. Liu S.L. Zhou T. Chen G. Long H. Su X.D. Zhang X. Fu J.H. Lin P. Zhang L.J. Stereotactic body radiotherapy with sequential tislelizumab and chemotherapy as neoadjuvant therapy in patients with resectable non-small-cell lung cancer in China (SACTION01): a single-arm, single-centre, phase 2 trial Lancet Respir. Med. 12 2024 988 996 10.1016/S2213-2600(24)00215-7 39305910 57 Griffin R.J. Ahmed M.M. Amendola B. Belyakov O. Bentzen S.M. Butterworth K.T. Chang S. Coleman C.N. Djonov V. Formenti S.C. Understanding High-Dose, Ultra-High Dose Rate, and Spatially Fractionated Radiation Therapy Int. J. Radiat. Oncol. Biol. Phys. 107 2020 766 778 10.1016/j.ijrobp.2020.03.028 32298811 58 Luo R. Yu M. Wu Y. Su Z. Kang K. Yao Z. Xiu W. Zhang X. Xu Y. Liu Y. The Eclipse-Radiotherapy Combined with ICI Orchestrates CD8+ T Cell- and NK Cell-Dependent Anti-Tumor Efficacy against Bulky Tumors Int. J. Radiat. Oncol. Biol. Phys. 120 2024 S95 10.1016/j.ijrobp.2024.07.170 59 Vanpouille-Box C. Formenti S.C. Demaria S. Toward Precision Radiotherapy for Use with Immune Checkpoint Blockers Clin. Cancer Res. 24 2018 259 265 10.1158/1078-0432.CCR-16-0037 28751442 PMC5771850 60 Mok T. Nakagawa K. Park K. Ohe Y. Girard N. Kim H.R. Wu Y.L. Gainor J. Lee S.H. Chiu C.H. Nivolumab Plus Chemotherapy in Epidermal Growth Factor Receptor-Mutated Metastatic Non-Small-Cell Lung Cancer After Disease Progression on Epidermal Growth Factor Receptor Tyrosine Kinase Inhibitors: Final Results of CheckMate 722 J. Clin. Oncol. 42 2024 1252 1264 10.1200/JCO.23.01017 38252907 PMC11095864 61 Yang J.C.H. Lee D.H. Lee J.S. Fan Y. de Marinis F. Iwama E. Inoue T. Rodríguez-Cid J. Zhang L. Yang C.T. Phase III KEYNOTE-789 Study of Pemetrexed and Platinum With or Without Pembrolizumab for Tyrosine Kinase Inhibitor‒Resistant, EGFR-Mutant, Metastatic Nonsquamous Non-Small Cell Lung Cancer J. Clin. Oncol. 42 2024 4029 4039 10.1200/JCO.23.02747 39173098 PMC11608596 62 Socinski M.A. Jotte R.M. Cappuzzo F. Orlandi F. Stroyakovskiy D. Nogami N. Rodríguez-Abreu D. Moro-Sibilot D. Thomas C.A. Barlesi F. Atezolizumab for First-Line Treatment of Metastatic Nonsquamous NSCLC N. Engl. J. Med. 378 2018 2288 2301 10.1056/NEJMoa1716948 29863955 63 Zhou C. Dong X. Chen G. Wang Z. Wu X. Yao Y. Zhang Y. Cheng Y. Pan H. Zhang X. OA09.06 IMpower151: Phase III Study of Atezolizumab + Bevacizumab + Chemotherapy in 1L Metastatic Nonsquamous NSCLC J. Thorac. Oncol. 18 2023 S64 S65 10.1016/j.jtho.2023.09.059 64 Park S. Kim T.M. Han J.Y. Lee G.W. Shim B.Y. Lee Y.G. Kim S.W. Kim I.H. Lee S. Kim Y.J. Phase III, Randomized Study of Atezolizumab Plus Bevacizumab and Chemotherapy in Patients With EGFR- or ALK-Mutated Non-Small-Cell Lung Cancer (ATTLAS, KCSG-LU19-04) J. Clin. Oncol. 42 2024 1241 1251 10.1200/JCO.23.01891 37861993 PMC11095857 65 Lu S. Wu L. Jian H. Cheng Y. Wang Q. Fang J. Wang Z. Hu Y. Han L. Sun M. Sintilimab plus chemotherapy for patients with EGFR-mutated non-squamous non-small-cell lung cancer with disease progression after EGFR tyrosine-kinase inhibitor therapy (ORIENT-31): second interim analysis from a double-blind, randomised, placebo-controlled, phase 3 trial Lancet Respir. Med. 11 2023 624 636 10.1016/S2213-2600(23)00135-2 37156249 66 HARMONi-A Study Investigators Fang W. Zhao Y. Luo Y. Yang R. Huang Y. He Z. Zhao H. Li M. Li K. Ivonescimab Plus Chemotherapy in Non-Small Cell Lung Cancer With EGFR Variant: A Randomized Clinical Trial JAMA 332 2024 561 570 10.1001/jama.2024.10613 38820549 PMC11337070 67 Xiong A. Wang L. Chen J. Wu L. Liu B. Yao J. Zhong H. Li J. Cheng Y. Sun Y. Ivonescimab versus pembrolizumab for PD-L1-positive non-small cell lung cancer (HARMONi-2): a randomised, double-blind, phase 3 study in China Lancet (London, England) 405 2025 839 849 10.1016/S0140-6736(24)02722-3 40057343 68 Herbst R.S. Chen L. The evolving immuno-angiogenic paradigm in NSCLC: lessons from ivonescimab Nat. Rev. Clin. Oncol. 22 2025 461 462 10.1038/s41571-025-01024-y 40329050 69 Dumontet C. Reichert J.M. Senter P.D. Lambert J.M. Beck A. Antibody-drug conjugates come of age in oncology Nat. Rev. Drug Discov. 22 2023 641 661 10.1038/s41573-023-00709-2 37308581 70 Fuentes-Antras J. Genta S. Vijenthira A. Siu L.L. Antibody-drug conjugates: in search of partners of choice Trends Cancer 9 2023 339 354 10.1016/j.trecan.2023.01.003 36746689 71 Boshuizen J. Pencheva N. Krijgsman O. Altimari D.D. Castro P.G. de Bruijn B. Ligtenberg M.A. Gresnigt-Van den Heuvel E. Vredevoogd D.W. Song J.Y. Cooperative Targeting of Immunotherapy-Resistant Melanoma and Lung Cancer by an AXL-Targeting Antibody-Drug Conjugate and Immune Checkpoint Blockade Cancer Res. 81 2021 1775 1787 10.1158/0008-5472.CAN-20-0434 33531370 72 Goto Y. Su W.-C. Levy B.P. Rixe O. Yang T.-Y. Tolcher A.W. Lou Y. Zenke Y. Savvides P. Felip E. TROPION-Lung02: Datopotamab deruxtecan (Dato-DXd) plus pembrolizumab (pembro) with or without platinum chemotherapy (Pt-CT) in advanced non-small cell lung cancer (aNSCLC) J. Clin. Oncol. 41 2023 9004 10.1200/JCO.2023.41.16_suppl.9004 73 Borghaei H. Waqar S.N. Bruno D.S. Kitazono S. Wakuda K. Spira A.I. Olivares J. Mak G. Lovick S. Goodwin L. Papadopoulos K.P. TROPION-Lung04: Phase 1b, multicenter study of datopotamab deruxtecan (Dato-DXd) in combination with immunotherapy ± carboplatin in advanced/metastatic non-small cell lung cancer (mNSCLC) J. Clin. Oncol. 41 2023 TPS3158 10.1200/JCO.2023.41.16_suppl.TPS3158 74 Fang W. Wang Q. Cheng Y. Luo Y. Qu X. Zhu H. Ding Z. Li X. Wu L. Wang Y. Sacituzumab tirumotecan (SKB264/MK-2870) in combination with KL-A167 (anti-PD-L1) as first-line treatment for patients with advanced NSCLC from the phase II OptiTROP-Lung01 study J. Clin. Oncol. 42 2024 8502 10.1200/JCO.2024.42.16_suppl.8502 75 Patel J.D. Cho B.C. Cobo M. Reyes Cabanillas R. Vicente D. Fuentes Pradera J. Garon E.B. Mok T.S.K. Cappuzzo F. Neal J.W. Sacituzumab govitecan (SG) + pembrolizumab (pembro) in first-line (1L) metastatic non-small cell lung cancer (mNSCLC) with PD-L1 ≥ 50%: Cohort A of EVOKE-02 J. Clin. Oncol. 42 2024 8592 10.1200/JCO.2024.42.16_suppl.8592 76 Offringa R. Kötzner L. Huck B. Urbahns K. The expanding role for small molecules in immuno-oncology Nat. Rev. Drug Discov. 21 2022 821 840 10.1038/s41573-022-00538-9 35982333 77 Briere D.M. Li S. Calinisan A. Sudhakar N. Aranda R. Hargis L. Peng D.H. Deng J. Engstrom L.D. Hallin J. The KRAS(G12C) Inhibitor MRTX849 Reconditions the Tumor Immune Microenvironment and Sensitizes Tumors to Checkpoint Inhibitor Therapy Mol. Cancer Ther. 20 2021 975 985 10.1158/1535-7163.MCT-20-0462 33722854 PMC8444277 78 Garassino M.C. Theelen W.S.M.E. Jotte R. Laskin J. de Marinis F. Aguado C. Badin F.B. Chmielewska I. Hochmair M.J. Lu S. LBA65 KRYSTAL-7: Efficacy and safety of adagrasib with pembrolizumab in patients with treatment-naïve, advanced non-small cell lung cancer (NSCLC) harboring a KRASG12C mutation Ann. Oncol. 34 2023 S1309 S1310 10.1016/j.annonc.2023.10.066 79 Mahadevan K.K. McAndrews K.M. LeBleu V.S. Yang S. Lyu H. Li B. Sockwell A.M. Kirtley M.L. Morse S.J. Moreno Diaz B.A. KRAS(G12D) inhibition reprograms the microenvironment of early and advanced pancreatic cancer to promote FAS-mediated killing by CD8(+) T cells Cancer Cell 41 2023 1606 1620.e8 10.1016/j.ccell.2023.07.002 37625401 PMC10785700 80 Kornepati A.V.R. Rogers C.M. Sung P. Curiel T.J. The complementarity of DDR, nucleic acids and anti-tumour immunity Nature 619 2023 475 486 10.1038/s41586-023-06069-6 37468584 81 Besse B. Pons-Tostivint E. Park K. Hartl S. Forde P.M. Hochmair M.J. Awad M.M. Thomas M. Goss G. Wheatley-Price P. Biomarker-directed targeted therapy plus durvalumab in advanced non-small-cell lung cancer: a phase 2 umbrella trial Nat. Med. 30 2024 716 729 10.1038/s41591-024-02808-y 38351187 PMC10957481 82 Passiglia F. Righi L. Bironzo P. Listì A. Farinea G. Capelletto E. Novello S. Merlini A. Scagliotti G.V. Niraparib plus Dostarlimab in Pleural Mesothelioma or Non-Small Cell Lung Cancer Harboring HRR Mutations: Interim Results of the UNITO-001 Phase II Prospective Trial Clin. Cancer Res. 30 2024 959 964 10.1158/1078-0432.CCR-23-2431 38109438 83 Shiraishi Y. Nomura S. Sugawara S. Horinouchi H. Yoneshima Y. Hayashi H. Azuma K. Hara S. Niho S. Morita R. Comparison of platinum combination chemotherapy plus pembrolizumab versus platinum combination chemotherapy plus nivolumab-ipilimumab for treatment-naive advanced non-small-cell lung cancer in Japan (JCOG2007): an open-label, multicentre, randomised, phase 3 trial Lancet Respir. Med. 12 2024 877 887 10.1016/S2213-2600(24)00185-1 39159638 84 Gettinger S.N. Redman M.W. Bazhenova L. Hirsch F.R. Mack P.C. Schwartz L.H. Bradley J.D. Stinchcombe T.E. Leighl N.B. Ramalingam S.S. Nivolumab Plus Ipilimumab vs Nivolumab for Previously Treated Patients With Stage IV Squamous Cell Lung Cancer: The Lung-MAP S1400I Phase 3 Randomized Clinical Trial JAMA Oncol. 7 2021 1368 1377 10.1001/jamaoncol.2021.2209 34264316 PMC8283667 85 Boyer M. Sendur M.A.N. Rodriguez-Abreu D. Park K. Lee D.H. Cicin I. Yumuk P.F. Orlandi F.J. Leal T.A. Molinier O. Pembrolizumab Plus Ipilimumab or Placebo for Metastatic Non-Small-Cell Lung Cancer With PD-L1 Tumor Proportion Score >/= 50%: Randomized, Double-Blind Phase III KEYNOTE-598 Study J. Clin. Oncol. 39 2021 2327 2338 10.1200/JCO.20.03579 33513313 86 Cho B.C. Abreu D.R. Hussein M. Cobo M. Patel A.J. Secen N. Lee K.H. Massuti B. Hiret S. Yang J.C.H. Tiragolumab plus atezolizumab versus placebo plus atezolizumab as a first-line treatment for PD-L1-selected non-small-cell lung cancer (CITYSCAPE): primary and follow-up analyses of a randomised, double-blind, phase 2 study Lancet Oncol. 23 2022 781 792 10.1016/S1470-2045(22)00226-1 35576957 87 Morgensztern D. Chaudhry A. Iannotti N. Acevedo A. Balaburski G. Balogh A. Peters S. 1359TiP RELATIVITY-104: First-line relatlimab (RELA) + nivolumab (NIVO) with chemotherapy vs nivo with chemotherapy in stage IV or recurrent non-small cell lung cancer (NSCLC): A phase II, randomized, double-blind study Ann. Oncol. 32 2021 S1030 10.1016/j.annonc.2021.08.1960 88 Besse B. Italiano A. Cousin S. Ruiter G. Felip E. Castanon Alvarez E. Ramalingam S.S. Rolfo C.D. Spigel D.R. Andrew D. 1313MO Safety and preliminary efficacy of AZD7789, a bispecific antibody targeting PD-1 and TIM-3, in patients (pts) with stage IIIB–IV non-small-cell lung cancer (NSCLC) with previous anti-PD-(L)1 therapy Ann. Oncol. 34 2023 S755 10.1016/j.annonc.2023.09.2347 89 Pang X. Huang Z. Zhong T. Zhang P. Wang Z.M. Xia M. Li B. Cadonilimab, a tetravalent PD-1/CTLA-4 bispecific antibody with trans-binding and enhanced target binding avidity mAbs 15 2023 2180794 10.1080/19420862.2023.2180794 PMC10012886 36872527 90 Dovedi S.J. Elder M.J. Yang C. Sitnikova S.I. Irving L. Hansen A. Hair J. Jones D.C. Hasani S. Wang B. Design and Efficacy of a Monovalent Bispecific PD-1/CTLA4 Antibody That Enhances CTLA4 Blockade on PD-1(+) Activated T Cells Cancer Discov. 11 2021 1100 1117 10.1158/2159-8290.CD-20-1445 33419761 91 Cheng W. Kang K. Zhao A. Wu Y. Dual blockade immunotherapy targeting PD-1/PD-L1 and CTLA-4 in lung cancer J. Hematol. Oncol. 17 2024 54 10.1186/s13045-024-01581-2 39068460 PMC11283714 92 Li J. Yu S. Zhao W. Li H. Li C. Shen H. Li M. Wang C. Wang J. Yi C. The efficacy and safety of a novel PD-1/CTLA-4 bispecific antibody cadonilimab (AK104) in advanced non-small cell lung cancer: A multicenter retrospective observational study in China J. Clin. Oncol. 42 2024 e20518 10.1200/JCO.2024.42.16_suppl.e20518 PMC11554550 39390972 93 Wang L. Su C. EP.11D.01 A Phase II Study of Cadonilimab Plus Chemotherapy as First-Line Treatment for PD-L1-Negative Advanced Non-Small Cell Lung Cancer:LungCadX J. Thorac. Oncol. 19 2024 S614 10.1016/j.jtho.2024.09.1152 94 Spigel D.R. Ahn M.J. Majem M. Medina Rodríguez L. Lee K.H. Carcereny E. Hernández A.A. Insa A. Cho E.K. Besse B. OA11.04 Volrustomig + platinum doublet chemotherapy (CTx) in first-line non-small cell lung cancer (NSCLC): Phase 1b trial update J. Thorac. Oncol. 19 2024 S33 S34 10.1016/j.jtho.2024.09.062 95 Johnson M.L. Arriola E. Kato T. Girard N. Gadgeel S.M. Wang J. Li X. Lowery C. Krug L.M. Ahn M.-J. eVOLVE-Lung02: A phase 3 study of first-line (1L) volrustomig plus chemotherapy (CT) versus pembrolizumab plus CT in metastatic non-small-cell lung cancer (mNSCLC) with PD-L1 tumor cell (TC) expression <50% J. Clin. Oncol. 42 2024 TPS8652 10.1200/JCO.2024.42.16_suppl.TPS8652 96 Yuwen H. Wang H. Li T. Ren Y. Zhang Y.K. Chen P. Sun A. Bian G. Li B. Flowers D. ATG-101 Is a Tetravalent PD-L1x4-1BB Bispecific Antibody That Stimulates Antitumor Immunity through PD-L1 Blockade and PD-L1-Directed 4-1BB Activation Cancer Res. 84 2024 1680 1698 10.1158/0008-5472.CAN-23-2701 38501978 PMC11094422 97 Wu T.D. Madireddi S. de Almeida P.E. Banchereau R. Chen Y.J.J. Chitre A.S. Chiang E.Y. Iftikhar H. O'Gorman W.E. Au-Yeung A. Peripheral T cell expansion predicts tumour infiltration and clinical response Nature 579 2020 274 278 10.1038/s41586-020-2056-8 32103181 98 Chrusciel E. Urban-Wojciuk Z. Arcimowicz L. Kurkowiak M. Kowalski J. Gliwinski M. Marjanski T. Rzyman W. Biernat W. Dziadziuszko R. Adoptive Cell Therapy-Harnessing Antigen-Specific T Cells to Target Solid Tumours Cancers (Basel) 12 2020 683 10.3390/cancers12030683 32183246 PMC7140076 99 Grosser R. Cherkassky L. Chintala N. Adusumilli P.S. Combination Immunotherapy with CAR T Cells and Checkpoint Blockade for the Treatment of Solid Tumors Cancer Cell 36 2019 471 482 10.1016/j.ccell.2019.09.006 31715131 PMC7171534 100 Gray K.D. McCloskey J.E. Vedvyas Y. Kalloo O.R. Eshaky S.E. Yang Y. Shevlin E. Zaman M. Ullmann T.M. Liang H. PD1 Blockade Enhances ICAM1-Directed CAR T Therapeutic Efficacy in Advanced Thyroid Cancer Clin. Cancer Res. 26 2020 6003 6016 10.1158/1078-0432.CCR-20-1523 32887724 PMC7709864 101 Aggen D.H. Garcia A. Saro Suarez J.M. Sauer A. Cristiani S. Brophy F.E. Streets S. Norry E. Nelson A.A. Kilari D. New phase 1 SURPASS trial cohort: Early-line ADP-A2M4CD8 T-cell receptor T-cell therapy plus pembrolizumab in urothelial carcinoma J. Clin. Oncol. 42 2024 TPS708 10.1200/JCO.2024.42.4_suppl.TPS708 102 Creelan B.C. He K. Garon E. Chesney J. Lee S. Nieva J. Sacher A. Finckenstein F.G. Gastman B. Chou J. 1488 A multicenter phase 2 trial of lifileucel plus pembrolizumab in patients with checkpoint inhibitor-naive metastatic NSCLC: updated results J. Immunother. Cancer 12 2024 10.1136/jitc-2024-SITC2024.1488 A1718–A1718 103 Lu Y. Xue J. Deng T. Zhou X. Yu K. Deng L. Huang M. Yi X. Liang M. Wang Y. Safety and feasibility of CRISPR-edited T cells in patients with refractory non-small-cell lung cancer Nat. Med. 26 2020 732 740 10.1038/s41591-020-0840-5 32341578 104 Rohaan M.W. Borch T.H. van den Berg J.H. Met Ö. Kessels R. Geukes Foppen M.H. Stoltenborg Granhøj J. Nuijen B. Nijenhuis C. Jedema I. Tumor-Infiltrating Lymphocyte Therapy or Ipilimumab in Advanced Melanoma N. Engl. J. Med. 387 2022 2113 2125 10.1056/NEJMoa2210233 36477031 105 Sarnaik A.A. Hamid O. Khushalani N.I. Lewis K.D. Medina T. Kluger H.M. Thomas S.S. Domingo-Musibay E. Pavlick A.C. Whitman E.D. Lifileucel, a Tumor-Infiltrating Lymphocyte Therapy, in Metastatic Melanoma J. Clin. Oncol. 39 2021 2656 2666 10.1200/JCO.21.00612 33979178 PMC8376325 106 Chesney J. Lewis K.D. Kluger H. Hamid O. Whitman E. Thomas S. Wermke M. Cusnir M. Domingo-Musibay E. Phan G.Q. Efficacy and safety of lifileucel, a one-time autologous tumor-infiltrating lymphocyte (TIL) cell therapy, in patients with advanced melanoma after progression on immune checkpoint inhibitors and targeted therapies: pooled analysis of consecutive cohorts of the C-144-01 study J. Immunother. Cancer 10 2022 e005755 10.1136/jitc-2022-005755 PMC9748991 36600653 107 Reardon S. First cell therapy for solid tumours heads to the clinic: what it means for cancer treatment Nature 2024 10.1038/d41586-024-00673-w 38467817 108 Creelan B.C. Wang C. Teer J.K. Toloza E.M. Yao J. Kim S. Landin A.M. Mullinax J.E. Saller J.J. Saltos A.N. Tumor-infiltrating lymphocyte treatment for anti-PD-1-resistant metastatic lung cancer: a phase 1 trial Nat. Med. 27 2021 1410 1418 10.1038/s41591-021-01462-y 34385708 PMC8509078 109 Schoenfeld A.J. Lee S.M. Doger de Spéville B. Gettinger S.N. Häfliger S. Sukari A. Papa S. Rodríguez-Moreno J.F. Graf Finckenstein F. Fiaz R. Lifileucel, an Autologous Tumor-Infiltrating Lymphocyte Monotherapy, in Patients with Advanced Non-Small Cell Lung Cancer Resistant to Immune Checkpoint Inhibitors Cancer Discov. 14 2024 1389 1402 10.1158/2159-8290.CD-23-1334 38563600 PMC11294887 110 Baulu E. Gardet C. Chuvin N. Depil S. TCR-engineered T cell therapy in solid tumors: State of the art and perspectives Sci. Adv. 9 2023 eadf3700 10.1126/sciadv.adf3700 PMC9931212 36791198 111 Zhang Y. Liu Z. Wei W. Li Y. TCR engineered T cells for solid tumor immunotherapy Exp. Hematol. Oncol. 11 2022 38 10.1186/s40164-022-00291-0 35725570 PMC9210724 112 D'Angelo S.P. Araujo D.M. Abdul Razak A.R. Agulnik M. Attia S. Blay J.Y. Carrasco Garcia I. Charlson J.A. Choy E. Demetri G.D. Afamitresgene autoleucel for advanced synovial sarcoma and myxoid round cell liposarcoma (SPEARHEAD-1): an international, open-label, phase 2 trial Lancet 403 2024 1460 1471 10.1016/S0140-6736(24)00319-2 38554725 PMC11419333 113 Xia Y. Tian X. Wang J. Qiao D. Liu X. Xiao L. Liang W. Ban D. Chu J. Yu J. Treatment of metastatic non-small cell lung cancer with NY-ESO-1 specific TCR engineered-T cells in a phase I clinical trial: A case report Oncol. Lett. 16 2018 6998 7007 10.3892/ol.2018.9534 30546433 PMC6256329 114 Foy S.P. Jacoby K. Bota D.A. Hunter T. Pan Z. Stawiski E. Ma Y. Lu W. Peng S. Wang C.L. Non-viral precision T cell receptor replacement for personalized cell therapy Nature 615 2023 687 696 10.1038/s41586-022-05531-1 36356599 PMC9768791 115 Albelda S.M. CAR T cell therapy for patients with solid tumours: key lessons to learn and unlearn Nat. Rev. Clin. Oncol. 21 2024 47 66 10.1038/s41571-023-00832-4 37904019 116 Zhang Q. Fu Q. Cao W. Wang H. Xu X. Huang J. Zou A. Zhu J. Wan H. Yao Y. Phase I study of C-CAR031, a GPC3-specific TGFβRIIDN armored autologous CAR-T, in patients with advanced hepatocellular carcinoma (HCC) J. Clin. Oncol. 42 2024 4019 10.1200/JCO.2024.42.16_suppl.4019 117 Nakajima T.E. Kuboki Y. Fukahori M. Shimazu Y. Kondo S. Katsuya Y. Ikeda M. Satake T. Kagehara H. Akaike T. Updated results from first-in-human phase 1 dose-escalation trial of TAK-102, a GPC3-targeted armored CAR T cells, in patients with advanced solid tumors J. Clin. Oncol. 42 2024 2543 10.1200/JCO.2024.42.16_suppl.2543 118 Qi C. Liu C. Gong J. Liu D. Wang X. Zhang P. Qin Y. Ge S. Zhang M. Peng Z. Claudin18.2-specific CAR T cells in gastrointestinal cancers: phase 1 trial final results Nat. Med. 30 2024 2224 2234 10.1038/s41591-024-03037-z 38830992 119 Keenan B.P. Lieu C.H. Fakih M. Venook A.P. Chen D. Rowinsky E.K. Lu V. Xiao L. Schlechter B.L. A phase 1 dose-escalation study of GCC19CART: A novel CAR T-cell therapy for metastatic colorectal cancer in the United States J. Clin. Oncol. 43 2025 175 10.1200/JCO.2025.43.4_suppl.175 120 Qi C. Liu C. Li J. Gong J. Wang X. Wang Z. Lu X.-a. He T. Ding Y. Wu F. Phase I study of GUCY2C CAR-T therapy IM96 in patients with metastatic colorectal cancer J. Clin. Oncol. 42 2024 2518 10.1200/JCO.2024.42.16_suppl.2518 121 da Cunha Santos G. Shepherd F.A. Tsao M.S. EGFR mutations and lung cancer Annu. Rev. Pathol. 6 2011 49 69 10.1146/annurev-pathol-011110-130206 20887192 122 Ma H.Y. Das J. Prendergast C. De Jong D. Braumuller B. Paily J. Huang S. Liou C. Giarratana A. Hosseini M. Advances in CAR T Cell Therapy for Non-Small Cell Lung Cancer Curr. Issues Mol. Biol. 45 2023 9019 9038 10.3390/cimb45110566 37998743 PMC10670348 123 Haas A.R. Golden R.J. Litzky L.A. Engels B. Zhao L. Xu F. Taraszka J.A. Ramones M. Granda B. Chang W.J. Two cases of severe pulmonary toxicity from highly active mesothelin-directed CAR T cells Mol. Ther. 31 2023 2309 2325 10.1016/j.ymthe.2023.06.006 37312454 PMC10422001 124 Liu H. Ma Y. Yang C. Xia S. Pan Q. Zhao H. Fang W. Chen X. Zhang Y. Zou B. Severe delayed pulmonary toxicity following PD-L1-specific CAR-T cell therapy for non-small cell lung cancer Clin. Transl. Immunology 9 2020 e1154 10.1002/cti2.1154 PMC7546952 33072320 125 Chen L. Chen F. Li J. Pu Y. Yang C. Wang Y. Lei Y. Huang Y. CAR-T cell therapy for lung cancer: Potential and perspective Thorac. Cancer 13 2022 889 899 10.1111/1759-7714.14375 35289077 PMC8977151 126 Wang Y. Zhao G. Wang S. Li N. DNTGF-betaR armored CAR-T cell therapy against tumors from bench to bedside J. Transl. Med. 22 2024 45 10.1186/s12967-023-04829-6 38212769 PMC10782706 127 Lesch S. Blumenberg V. Stoiber S. Gottschlich A. Ogonek J. Cadilha B.L. Dantes Z. Rataj F. Dorman K. Lutz J. T cells armed with C-X-C chemokine receptor type 6 enhance adoptive cell therapy for pancreatic tumours Nat. Biomed. Eng. 5 2021 1246 1260 10.1038/s41551-021-00737-6 34083764 PMC7611996 128 Wagner J. Wickman E. DeRenzo C. Gottschalk S. CAR T Cell Therapy for Solid Tumors: Bright Future or Dark Reality? Mol. Ther. 28 2020 2320 2339 10.1016/j.ymthe.2020.09.015 32979309 PMC7647674 129 Hou A.J. Chen L.C. Chen Y.Y. Navigating CAR-T cells through the solid-tumour microenvironment Nat. Rev. Drug Discov. 20 2021 531 550 10.1038/s41573-021-00189-2 33972771 130 Kirtane K. Elmariah H. Chung C.H. Abate-Daga D. Adoptive cellular therapy in solid tumor malignancies: review of the literature and challenges ahead J. Immunother. Cancer 9 2021 e002723 10.1136/jitc-2021-002723 PMC8311333 34301811 131 Baessler A. Vignali D.A.A. T Cell Exhaustion Annu. Rev. Immunol. 42 2024 179 206 10.1146/annurev-immunol-090222-110914 38166256 132 Dolina J.S. Lee J. Brightman S.E. McArdle S. Hall S.M. Thota R.R. Zavala K.S. Lanka M. Ramamoorthy Premlal A.L. Greenbaum J.A. Linked CD4+/CD8+ T cell neoantigen vaccination overcomes immune checkpoint blockade resistance and enables tumor regression J. Clin. Investig. 133 2023 e164258 10.1172/JCI164258 PMC10471175 37655661 133 Carvalho T. Personalized anti-cancer vaccine combining mRNA and immunotherapy tested in melanoma trial Nat. Med. 29 2023 2379 2380 10.1038/d41591-023-00072-0 37773210 134 Killock D. Personalized neoantigen mRNA vaccine mitigates melanoma recurrence Nat. Rev. Clin. Oncol. 21 2024 168 10.1038/s41571-024-00867-1 38302646 135 Ding Z. Li Q. Zhang R. Xie L. Shu Y. Gao S. Wang P. Su X. Qin Y. Wang Y. Personalized neoantigen pulsed dendritic cell vaccine for advanced lung cancer Signal Transduct. Target. Ther. 6 2021 26 10.1038/s41392-020-00448-5 33473101 PMC7817684 136 Atmaca A. Alt J. Baz D.V. Dziadziuszko R. Moreno V. Pose V. Juan-Vidal O. Munshi N. Markman J.L. Chen V. 1486 Preliminary results from LuCa-MERIT-1, a phase I trial evaluating BNT116, a fixed antigen mRNA vaccine, plus cemiplimab in advanced non-small cell lung cancer after progression on PD-1 inhibition Journal for ImmunoTherapy of Cancer 12 2024 A1716 10.1136/jitc-2024-SITC2024.1486 137 Adotevi O. Vernerey D. Jacoulet P. Meurisse A. Laheurte C. Almotlak H. Jacquin M. Kaulek V. Boullerot L. Malfroy M. Safety, Immunogenicity, and 1-Year Efficacy of Universal Cancer Peptide-Based Vaccine in Patients With Refractory Advanced Non-Small-Cell Lung Cancer: A Phase Ib/Phase IIa De-Escalation Study J. Clin. Oncol. 41 2023 373 384 10.1200/JCO.22.00096 36070539 138 Mackensen A. Haanen J.B.A.G. Koenecke C. Alsdorf W. Wagner-Drouet E. Borchmann P. Heudobler D. Ferstl B. Klobuch S. Bokemeyer C. CLDN6-specific CAR-T cells plus amplifying RNA vaccine in relapsed or refractory solid tumors: the phase 1 BNT211-01 trial Nat. Med. 29 2023 2844 2853 10.1038/s41591-023-02612-0 37872225 PMC10667102 139 Wu D.W. Jia S.P. Xing S.J. Ma H.L. Wang X. Tang Q.Y. Li Z.W. Wu Q. Bai M. Zhang X.Y. Personalized neoantigen cancer vaccines: current progression, challenges and a bright future Clin. Exp. Med. 24 2024 229 10.1007/s10238-024-01436-7 39325256 PMC11427492 140 Ingels J. De Cock L. Stevens D. Mayer R.L. Théry F. Sanchez G.S. Vermijlen D. Weening K. De Smet S. Lootens N. Neoantigen-targeted dendritic cell vaccination in lung cancer patients induces long-lived T cells exhibiting the full differentiation spectrum Cell Rep. Med. 5 2024 101516 10.1016/j.xcrm.2024.101516 PMC11148567 38626769 141 Lee J.M. Spicer J. Nair S. Khattak A. Brown M. Meehan R.S. shariati n.M. Deng X. Samkari A. Chaft J.E. The phase 3 INTerpath-002 study design: Individualized neoantigen therapy (INT) V940 (mRNA-4157) plus pembrolizumab vs placebo plus pembrolizumab for resected early-stage non–small-cell lung cancer (NSCLC) J. Clin. Oncol. 42 2024 TPS8116 10.1200/JCO.2024.42.16_suppl.TPS8116 142 Klein C. Brinkmann U. Reichert J.M. Kontermann R.E. The present and future of bispecific antibodies for cancer therapy Nat. Rev. Drug Discov. 23 2024 301 319 10.1038/s41573-024-00896-6 38448606 143 Tendler S. Rudin C.M. Tarlatamab: New Star on the Horizon for Small-Cell Lung Cancer? J. Clin. Oncol. 41 2023 2877 2880 10.1200/JCO.23.00148 37098228 PMC10414700 144 Passlick B. Schmittel A. Friccius-Quecke H. Kanniess F. Wiewrodt R. Lindhofer H. Jaeger M. Sebastian M. Treatment of non-small cell lung cancer (NSCLC) patients with the trifunctional antibody catumaxomab (anti-EpCAM x anti-CD3): Results of a phase I/II study J. Clin. Oncol. 24 2006 2540 10.1200/jco.2006.24.18_suppl.2540 PMC11030102 17410361 145 Segal N.H. Melero I. Moreno V. Steeghs N. Marabelle A. Rohrberg K. Rodriguez-Ruiz M.E. Eder J.P. Eng C. Manji G.A. CEA-CD3 bispecific antibody cibisatamab with or without atezolizumab in patients with CEA-positive solid tumours: results of two multi-institutional Phase 1 trials Nat. Commun. 15 2024 4091 10.1038/s41467-024-48479-8 38750034 PMC11096172 146 Butterfield L.H. Najjar Y.G. Immunotherapy combination approaches: mechanisms, biomarkers and clinical observations Nat. Rev. Immunol. 24 2024 399 416 10.1038/s41577-023-00973-8 38057451 PMC11460566 147 Zemek R.M. Anagnostou V. Pires da Silva I. Long G.V. Lesterhuis W.J. Exploiting temporal aspects of cancer immunotherapy Nat. Rev. Cancer 24 2024 480 497 10.1038/s41568-024-00699-2 38886574 Supplemental information  Document S1. Tables S1 and S2 Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102315 ",
  "metadata": {
    "Title of this paper": "Exploiting temporal aspects of cancer immunotherapy",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490215/"
  }
}