{
  "title": "Paper_848",
  "abstract": "pmc Int J Nanomedicine Int J Nanomedicine 616 intjnano ijn International Journal of Nanomedicine 1176-9114 1178-2013 Dove Press PMC12478456 PMC12478456.1 12478456 12478456 41030573 10.2147/IJN.S529127 529127 1 Review Nano-Drug Delivery System Targeting the Oxidative Stress Microenvironment: A Prospective Strategy for Intervertebral Disc Degeneration Treatment Wang et al Wang et al Wang Yidian 1 * Wen Pengfei 1 * Zhang Bin-Fei 1 Hu Shouye 1 Yang Zhi 1 1 Department of Joint Surgery, Honghui Hospital, Xi’an Jiaotong University Xi’an Shaanxi People’s Republic of China Correspondence: Zhi Yang; Yidian Wang, Department of Joint Surgery, Honghui Hospital, Xi’an Jiaotong University Xi’an Shaanxi People’s Republic of China * These authors contributed equally to this work 25 9 2025 2025 20 478586 11717 11780 19 3 2025 29 7 2025 25 09 2025 30 09 2025 01 10 2025 © 2025 Wang et al. 2025 Wang et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Abstract Intervertebral disc degeneration (IDD) is the main cause of low back pain (LBP), which imposes a heavy burden on individuals and society. At present, the treatment methods for IDD aim to control clinical symptoms, and it is difficult to fundamentally reverse IDD and reconstruct its mechanical function. Related studies have shown that oxidative stress is a key factor in promoting intervertebral disc (IVD) degeneration and impeding its repair, so antioxidant therapy may be effective in improving or reversing IDD progression. However, considering the non-targeted systemic cytotoxicity and limited bioavailability of antioxidant biopharmaceuticals, it is urgent to establish an efficient drug delivery system. With the development and innovation of nanomedicine and materials science, nano-drug delivery systems (NDDSs) have shown broad application prospects in various diseases. Relying on the characteristics of nanoscale materials, NDDSs can achieve good biodegradability, biocompatibility, targeted drug delivery, and controlled drug release, thereby enhancing the efficacy of antioxidant preparations. This review not only summarizes the research progress of NDDSs in the treatment of IDD, but also evaluates the advantages and challenges faced by various NDDSs. We anticipate that the perspectives articulated in this review will offer valuable insights for the precise management of IDD. Graphical Abstract  Keywords intervertebral disc degeneration oxidative stress reactive oxygen species drug delivery system nanoparticles pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Low back pain (LBP) is considered as pain or discomfort in the area below the rib margin and above the buttock crease, and it is a common musculoskeletal disorder. 1 2 3 4 5 6 7 8 3 9 4 10 11 12 Figure 1 The main pathogenic factors of IDD. Figure 2 Different developmental stages of IDD and their manifestations. Figure 3 Diagnosis and current IDD treatments. Figure 4 Redox disorders and their pathogenic mechanisms in degenerative IVD. Figure 5 Complex signalling networks in degenerating IVD cells and their interaction with the oxidative stress microenvironment. The intervertebral disc (IVD) is a fibrocartilaginous tissue located between the vertebrae, consisting primarily of the nucleus pulposus (NP), annulus fibrosus (AF), and cartilaginous endplate (CEP), which plays a crucial role in maintaining spinal stability, cushioning spinal pressure, and enhancing spinal mobility. 13 14–17 Figure 1 8 18 19 19 20 21 11 22 23 2 24 25 25 26 27 The aim of this review is to briefly review the changing pathophysiology of IDD and the limitations of current treatments. In addition, we also emphasized the oxidative stress microenvironment in degenerative IVDs and its role in IDD. Importantly, we demonstrated that biomedical engineering approaches can be used to ameliorate the oxidative stress microenvironment of IDD, thereby promoting regeneration and recovery of IDD, which may help advance the development of NDDSs in the treatment of IDD. The Pathophysiology of IDD Normal Structure and Function of IVD The IVD is an integral part of the spinal tissue and biomechanical composition. The normal spine comprises a minimum of 23 highly hydrated IVDs that connect adjacent vertebrae, playing a crucial role in enhancing spinal mobility and optimizing load distribution. 28 NP is located between the center and posterior of IVD, serving as the core of IVD. 29 30 31 4 31–34 35 36 37 11 38 39 The AF is located on the periphery of NP, consisting of well-arranged concentric rings or lamellae composed of collagen fibers and proteoglycans. 4 37 40 21 21 41 42–44 The endplate is the boundary between the IVD and the adjacent vertebral bodies, including the bony endplate and CEP. The main cell type within the CEP is the chondrocyte, which primarily secretes Col II and proteoglycans. 45 46 47 48 The IVD is the largest avascular tissue in the body. 49 50 51 52 53 54 55 56 57 58 Degenerative IVD: Molecular, Tissue and Mechanical Functions IDD is an age-related degenerative process that is influenced and accelerated by other unfavourable factors, such as genetic and environmental factors. 59 Figure 2 Although the traditional view holds that IDD is an age-related disease, it cannot be denied that genetic factors may play a significant role in determining this condition. 60 61 62 63 64–66 67 In fact, IVD had already undergone degradation in the first decade of life. 68 36 69 70 71 72 73 74 74 74–76 76 Early IVD degeneration lasts for a considerable period of time (10 or 20 years or more), which may be accelerated by other unfavorable factors (genetics, trauma and abnormal loads) and enters the radical phase. During the radical phase, the microenvironment within the IVD is severely deteriorated, accompanied by inflammation and oxidative stress storms. 77 47 78 22 32 19 19 79 80 72 81 82 18 83 84–86 When entering the late stage of IDD, IVD will gradually lose its mechanical function and result in IVD-related LBP. At this time, the normally active NP cells are almost completely damaged, and proteoglycan and Col II are replaced by Col I. 87 87 87 88 89 90 91 92–94 94 95 96 97 98 98 Diagnosis and Treatment of IDD The initial diagnosis of IDD is mainly based on the patient’s symptoms and physical signs. Patients with IDD typically present with LBP. This type of pain is often characterized by an unclear location, primarily concentrated in the central region of the lower back or adjacent to the IVD, and worsens after prolonged standing or sitting. When the protruding NP directly compresses or the inflammatory response irritates the nerve root, LBP may worsen and radiate to one or both limbs. In addition to clinical symptoms and signs, the diagnosis of IDD is mainly based on X-ray, CT scan or MRI, and its severity is further assessed by IVD hydration status (Pfirrmann) or CEP Modic changes. 99 100 Currently, the treatment of IDD includes conservative treatment and surgical treatment according to the patient’s symptoms ( Figure 3 101–103 102 21 103 103 104 104–106 Oxidative Stress and IDD Oxidative Stress in IDD ROS are a class of unstable and highly reactive molecules, including superoxide anion (O 2 − 2 2 − 107 108 80 109 110 111 Figure 4 111 112–115 79 116 Redox Imbalance Within the IVD Increased ROS Production in Degenerative IVD Mitochondria are the center of oxidative metabolism and the main site of ROS production, because 1–2% O 2 117 118 2 2 119 2 2 120 121 122 42 123 124 125 126 127 127 128 The NADPH oxidase (Nox) family comprises seven isoforms (Nox1, Nox2, Nox3, Nox4, Nox5, Duox1, and Duox2), which exhibit distinct expression patterns across various cell types and subcellular compartments. 129 2 − 2 2 130 131 132 133 134–136 137 2 138 139 140 141 142 142 143 42 2+ 2+ 139 144 42 120 145–147 Reduced Antioxidant Defense in Degenerative IVD The complete intracellular antioxidant defence system mainly consists of antioxidant enzymes, non-enzymatic small molecules and redox signal transduction. 116 148 149 150 2 − 2 2 151 152 2 2 2 151 153–155 156 157 97 158 159 160 116 160 161 162 163 164 Role of Oxidative Stress in IDD ROS is an important signaling molecule within cells, which means it can directly or indirectly interact with dynamic signal networks composed of different signaling pathways and complex feedback loops, thereby regulating the physiological and pathological processes of IDD 151 Figure 5 Oxidative Stress and Cell Death The balance of anabolic and catabolic metabolism within the IVD is dependent on the metabolic capacity conferred by a sufficient number of cells and normal cellular function. When excessive cell death occurs within the IVD, this balance is disrupted and promotes the progression of IDD. ROS are potent inducers of cell death, and here we focus on three cell death types, including apoptosis, pyroptosis, and ferroptosis. 165 166 Apoptosis is a controlled cell death that includes two major pathways: intrinsic and extrinsic, 167 168 169 170–173 168 2 2 174 175 114 162 176 177 178 179 180 Pyroptosis is a type of programmed cell death between apoptosis and necrosis that depends on the activation of inflammasomes. 181 182 182 183 184 185 2 2 186 187 188 189 190 191 192 186 193 194–196 197 188 Ferroptosis is a form of iron-driven cell death characterized by intracellular iron accumulation and oxidative stress, resulting in lipid peroxidation and membrane damage. 198 199 2+ 2 2 200 201 202 203 204 204–206 207 208 194 209 84 210 211 212 Oxidative Stress and Cellular Senescence Cellular senescence is the process by which cells gradually lose their function and proliferative capacity during their life cycle, including replicative senescence and stress-induced senescence. 213 113 214 16 39 215 216 19 217 218 219 220 174 220 221 222 223 224 225 226 Oxidative Stress and Cellular Autophagy Autophagy is an evolutionarily conserved self-degradation system that degrades and recycles intracellular proteins and damaged organelles to maintain cell homeostasis and function. 227 228 229 230 231 82 232–234 235 235 236 237–239 240 116 162 188 241 242 Oxidative Stress and Inflammation The inflammatory response is a defence mechanism against pathogens, damaged cells or specific stimuli, which is induced by a stressor and leads to the expression of inflammatory cytokines through a series of intracellular signal transduction. 243 244 245 246 247 248 249 249 250 251 252 19 248 253 254 Oxidative Stress and ECM Degradation The complete biomechanical function of IVD depends on the integrity of its tissue structure. With the progression of IVD degeneration, there have been significant changes in the quality and composition of ECM. Due to the death and aging of a large number of IVD cells, the synthesis of ECM is significantly reduced. 255 139 77 18 151 225 256 257 Oxidative Stress and Epigenetics Epigenetics refers to the mechanisms that can influence gene expression without altering the DNA sequence, and these changes can be passed on to future generations. 258 259 260 DNA methylation is a crucial epigenetic modification involving the addition of a methyl group at specific positions on the DNA molecule, predominantly occurring at the 5′ carbon position of cytosine (C) bases, resulting in the formation of 5-methylcytosine (5-mC). 261 262 261 263 264 264 265 266 2 267 268 269 18 256 270 42 Histone modifications refer to covalent chemical modifications that occur on histone molecules. 271 272 273 274 275–277 278 2+ 2+ 3+ 279 280 2 − 2+ 3+ 281 282 283 284 285 ncRNA is a class of RNA molecules that do not encode proteins, mainly including microRNAs (miRNAs), long non-coding RNAs (lncRNAs), and circular RNAs (circRNAs). 286 287 288 289 290 291 Advantages of NDDSs for the Treatment of IDD At present, the administration methods of drugs and bioactive agents for the treatment of IDD mainly include systemic administration and IVD in situ injection, but both have the disadvantages of poor curative effect and many side effects. Due to the non-vascular nature of IVDs, systemic administration makes it difficult to maintain adequate drug concentration and duration of action within the IVD, which results in limited bioavailability in local tissues. 292 293 294 295 296 Nanomedicine refers to the application of nanoscience and technology to solve medical problems, which involves all aspects of diagnosis, prevention and treatment of disease. 297 298 299 37 22 37 300 292 Table 1 Common Nano-Drug Delivery Systems in IDD Treatment Category Size Advantages Disadvantages Reference Liposome 50nm-5μm 1. High biocompatibility 1. Complex preparation process [ 299 301 Polymeric nanoparticles 1-1000nm 1. Good biocompatibility and biodegradability 1. Potential toxicity [ 302 303 Inorganic nanoparticles 1-100nm 1. Unique physical, chemical and biological properties 1. Low solubility and degradation rate [ 22 304 Polymer micelles Varied 1. Increase drug solubility 1. Particle aggregation [ 305 306 Nanofibers Varied 1. Prolonged drug release and improved drug stability 1. Low reproducibility [ 307 308 Nanohydrogel Mesh size of 5–100nm 1. Good biocompatibility 1. Drug retention and potential toxicity [ 299 309 Exosomes 30-150 nm 1. Good biocompatibility and low immunogenicity 1. Complex preparation and low encapsulation rate [ 310 311 Many NDDSs carrying therapeutic agents have been used to ameliorate the oxidative stress microenvironment of degenerating IVDs and to promote IVD repair. 37 Table 1 Table 2 Table 2 Recent Studies on Nano-Drug Delivery Systems for the Treatment of IDD. Classification Formulation Particle Size (nm) Release Rate Therapeutic Agents In vivo Model Tested Administration Methods Experiment Duration Outcome Study Year Common NDDSs PNPs 38.06 Not applicable (NA) GA, Mn 7+ Rats In situ injection (IS) 8 w Scavenges ROS and ameliorates mitochondrial dysfunction, apoptosis and ECM degradation in NP cells. [ 312 2024 PNPs 494.3 ± 64.4 80.8% in 2 d ABT263 Rats IS 6 w Inhibits cellular senescence, inflammatory response and ECM degradation [ 313 2022 PNPs 295 NA CNO Rats IS 8 w Scavenges ROS and attenuates oxidative stress, apoptosis, inflammatory responses and ECM degradation [ 314 2024 Metal NPs 400-500 NA MnO 2 Rats IS 4 w Targeted scavenging of intracellular ROS in macrophages and attenuation of NP cell apoptosis, inflammatory response and ECM degradation [ 315 2024 Metal NPs 80 NA PB Rats IS 4 w Reduces SOD degradation and improves mitochondrial function [ 316 2022 Metal NPs 24.81±1.4 NA Cu Rats IS 8 w Scavenging ROS, improving mitochondrial function, apoptosis and ECM degradation [ 317 2024 Metal NPs 180 NA Mn Rats IS 8 w Scavenges ROS and inhibits cell ferroptosis and ECM degradation [ 318 Carbon-based NPs 25-45 NA NA Rabbits IS 12 w Scavenging ROS and inhibiting ECM degradation [ 319 Carbon-based NPs 200 NA LINC02569 siRNA NA NA NA Inhibition of NF-κB signaling pathway and attenuation of inflammatory response and aging [ 320 Carbon-based NPs 7-16 NA NA Rats IS 4 w Scavenges ROS and attenuates mitochondrial dysfunction, apoptosis and ECM degradation in NP cells [ 321 2023 Carbon-based NPs 4.8±0.6 NA NA Rats IS 8 w Scavenges ROS and attenuates mitochondrial dysfunction, cellular pyroptosis and ECM degradation in NP cells [ 322 2024 Carbon-based NPs 60 NA NA Rats IS 4 w Scavenges mitochondrial ROS and attenuates NP cell senescence, catabolism, and inflammatory responses [ 323 2024 PM 49.8 90% in 4 h KGN, APO Rats IS 16 w Inhibits oxidative stress in ADSCs and promotes NP-like differentiation [ 324 2021 PM 302 NA CoQ10 Rats IS 6 w Enhances antioxidant capacity and inhibits inflammatory response and ECM degradation [ 325 2022 Nanofiber NA ≈40% in 10 h Fucoidan Rats IS 4 w Inhibits inflammatory responses and oxidative stress in AF cells and promotes cell proliferation and ECM synthesis [ 326 2022 Nanohydrogel 100 80% in 20 d MT Rats IS 8 w Inhibition of oxidative stress, inflammatory response and ECM degradation [ 327 2023 Nanohydrogel 278.8–722.4 NA Platelet-rich plasma Rats IS 8 w Provides mechanical stability and inhibits inflammatory response and ECM degradation [ 328 2023 Nanohydrogel 218.36±2.76 56.4±2.4% in 28 d TGF-β3 NA NA NA Induction of MSC NP-like cell differentiation [ 329 2016 Nanohydrogel 160 NA Curcumin NA NA NA Suppression of immune cell activation and inflammation [ 330 2022 Nanohydrogel 211.6±11.53 NA TrkA Rats IS 3 w Inhibition of macrophage M1 polarisation, inflammatory response and nerve infiltration [ 331 2023 Nanohydrogel ≈30 NA LM Rats IS 8 w Activates cellular autophagy and inhibits apoptosis and ECM degradation [ 332 2024 Nanohydrogel 121.6 NA Platelet extracellular vesicle Rats IS 17 w Inhibition of oxidative stress, inflammatory response, cellular pyroptosis and ECM degradation [ 333 2024 Nanohydrogel NA NA miR-5590 Rats IS 8 w Activates cellular autophagy and inhibits apoptosis [ 334 2023 Nanohydrogel 268 NA MnO 2 NA NA NA Inhibits oxidative stress and activates cellular autophagy [ 335 2024 Nanohydrogel 78.56±21.45 ≈75% in 21 d BPQDs Rats IS 8 w Modulation of acid-sensitive ion channel 3 and attenuation of oxidative stress, inflammation and ECM degradation [ 336 2022 Nanohydrogel 146.7±1.88 60.7±2.62% in 18 d TGF-β1 Rats IS 8 w Inhibition of the PI3K/Akt pathway and consequent reduction of the inflammatory response [ 337 2024 Nanohydrogel 141.8 85.4±2.30% in12 d Aspirin Rats IS 2 w Inhibits inflammatory response and ECM degradation [ 338 2020 Nanohydrogel 294 ± 20 NA Chondroitin sulfate NA NA NA Promotes chondrogenic differentiation of MSC [ 339 2015 Nanohydrogel 76 NA PB Rats IS 8 w Inhibition of oxidative stress and ECM degradation [ 340 2022 Nanohydrogel NA NA Celecoxib NA NA NA Promote NP cell proliferation and ECM synthesis [ 341 2024 Nanohydrogel 100-200 NA siDDIT4 Rats IS 5 w Alleviate mitochondrial dysfunction and pyroptosis in NP cells [ 193 2024 Redox-responsive NDDSs PPS-PEG 150 ≈80% in 40 h MR409 Rats IS 12 w Inhibition of oxidative stress and IL-1β production [ 342 2021 Diselenide 100 63% in 36 h IGK Rats IS 8 w Scavenging ROS in NP cells and enhancing autophagy in NP cells to inhibit ECM degradation and apoptosis [ 343 2023 Hydrogel NA 80% in 3 d Rapamycin Rats IS 12 w Scavenging ROS and promoting macrophage M2 polarization [ 344 2020 LN@PM 150 50% in 14 d NO Rats IS 8 w Scavenging of ROS, inhibiting the expression of inflammatory cytokines (IL-1β, IL-6, and TNF-α), promoting macrophage M2 polarization, and alleviating mitochondrial dysfunction [ 345 2024 PH-responsive NDDSs HPDA 182 ≈50% in 30 h (pH6.8) AB Rats IS 12 w Inhibits oxidative stress, inflammatory response and ECM degradation [ 346 2023 SiO 2 95.8±2.3 50% in 48 h (pH 4.5) SP Rats IS 4 w Improvement of mitochondrial membrane potential function and ROS production, and inhibition of NP cell senescence [ 347 2024 GelMA ≈200 ≈75% in 120 h (pH6.2) CAT and TGF-β Rats IS 8 w Attenuates oxidative stress, inflammatory response and ECM degradation in NP cells [ 348 2024 Enzyme -responsive NDDSs PGPC@HG 72 40% in 14 d (0.1 µg/mL MMP-2) miRNA −29a Rabbits IS 8 w miRNA-29a regulates fibrosis by inhibiting β-catenin/Wnt signaling pathway [ 349 2018 PEG-PIB 39.9 35% in 72 h (120 U/mL porcine esterase) Ibuprofen Rats IS 18 w Inhibiting the COX2/NF-κB/Caspase-1 signaling pathway effectively alleviates NPPCs pyroptosis [ 350 2022 Multistimuli -responsive NDDSs Collagen hydrogel NA NA H 2 Rats IS 16 w Inhibition of NP cell apoptosis and ECM degradation through modulation of the NF-κB signaling pathway [ 351 2019 MnO 2 ≈200 ≈80% in 5 h (pH6.5, 100 μM H 2 2 TGF-β3 Rats IS 8 w Inhibition of H 2 2 [ 352 2022 PDA 170.41±13.33 ≈60% in 30 h (pH6.4, 100 μM H 2 2 SPD Rats IS 12 w Promotes cellular autophagy and inhibits inflammatory responses, oxidative stress and ECM degradation [ 353 2024 Temperature -responsive NDDSs CS@MnOx 34.2±0.2 NA BMSCs Rats IS 4 w Inhibition of oxidative stress, senescence, apoptosis and ECM degradation in BMSCs and maintenance of their stemness [ 354 2024 Ultrasound-responsive NDDSs PFC-PLGA 567.3 ± 114.7 60% in 6 h (low-intensity US) RES Rats IS 8 w Attenuates NP cell apoptosis and ECM degradation [ 355 2018 PFC 500 NA Simvastatin Ex vivo rabbit discs IS 2 w NA [ 356 2019 Major Types of NDDSs for IDD Liposomes Liposome is a kind of nanoscale double-layer spherical structure mainly composed of lipid materials such as phospholipids and cholesterol, which makes liposomes have the ability to transport drugs, genes or other active molecules. 357 358 359 360 361 22 362–364 365–367 368 Currently, many challenges remain for liposome-associated drug delivery in IDD, including enhancement of drug encapsulation, tissue targeting, prolonged circulation and reduction of biotoxicity, and these optimisations can help to improve the therapeutic efficacy of liposomal systems. 369 370 371 372 301 373 374 375 376 377 378 379 380 381 382 Polymeric Nanoparticles Polymeric nanoparticles (PNPs) are typically nanoscale homogeneous spherical structures composed of biocompatible and biodegradable polymers, which can encapsulate hydrophilic and hydrophobic pharmaceutical drugs inside the particles or attach to the particle surface. 383 384 Natural polymers typically come from plants or animals, including polysaccharides, polyphenols, fibroin proteins, gelatin (Gel), collagen protein and albumin. 384 385 386 387 388 2 2 389 390 390 391 392 393 393 394 2+ 312 2+ Figure 6 395 Figure 6 Metallo phenolic nanoparticles targeting mitochondria for the treatment of IDD. ( A B C 2 − D 2 2 E F G H I J 312 Figure 7 PDA@CNO nanoparticles can mimic the activities of multiple antioxidant enzymes to alleviate oxidative stress in degenerated IVD. ( A B C D E 314 Figure 8 MnO 2 A B C 2 D E https://creativecommons.org/licenses/by/4.0/ 315 Figure 9 Mitochondria-targeted carbon dots treat IDD by exerting antioxidant enzyme-like activity. ( A C D E F G 323 Figure 10 Injectable mesoporous bioactive glass/sodium alginate hydrogel loaded with melatonin for intervertebral disc regeneration. ( A B C D E F G H https://creativecommons.org/licenses/by/4.0/ 327 Figure 11 Injectable decellularized NP hydrogel can be used as a carrier for MSCs to repair degenerated IVD. ( A B 2 C D E F 2 # G 2 2 2 H # ## I J https://creativecommons.org/licenses/by/4.0/ 332 Synthetic polymers are synthesized by chemical methods, mainly including polyesters, polyamino acids, phosphate-based polymers, vinyl polymers and PEG, etc. 302 396 302 397 398 399 400 313 401 314 Figure 7 2 − 2 2 205 402 Inorganic Nanoparticles Inorganic NPs come from inorganic materials, mainly including metal NPs and non-metal NPs. 403 404 22 Metal NPs usually include metal-based NPs and their oxides, including silver (Ag), gold (Au), copper (Cu), iron (Fe), zinc (Zn), Mn, cadmium (Cd) and cobalt (Co). 404 405 2 406 335 407 2+ 408 2 409 410 2 315 Figure 8 18 7 18 411 316 317 317 412 413 312 317 318 312 318 At present, the common inorganic non-metallic NPs in IDD treatment are mainly carbon-based NPs, including fullerenes, carbon nanotubes, graphene and carbon quantum dots. 414 415 416 417 418 2 2 319 419 420 421 320 422 423 424 321 322 2 2 425 323 Figure 9 Polymer Micelles Polymer micelle (PM) is a nanostructure formed by self-assembly of amphiphilic polymers in solution. 426 427 428 429 430 In 2021, Yu et al designed a new amphiphilic copolymer PEG-PAPO, which can self-assemble into nanomicelles and load kartogenin (KGN) and apocynin (APO). 324 431 325 Nanofiber Nanofibres are typically fabricated through phase separation, self-assembly, and electrostatic spinning using biodegradable natural polymers, synthetic polymers, and polymer blends. 307 432–434 435 436 Initially, nanofibers were mainly used as tissue engineering scaffolds to repair AF. 437 438 439 440 441 432 442 326 Nanohydrogel Nanohydrogel is a three-dimensional network structure formed by cross-linking hydrogel and nanomaterials through chemical or physical methods. 309 443 309 444 445–447 448 The skeleton materials of natural hydrogels are usually composed of natural polymers from animals and plants, including Gel, chondroitin, alginate, HA and chitosan (CS). 449 450 451 327 Figure 10 328 452 329 330 453 331 454 2 332 Figure 11 333 334 Synthetic hydrogels are obtained by processing natural products or other industrial raw materials and are highly customizable biomaterials. 446 309 455 447 456 457 456 335 336 337 338 Composite hydrogels are hydrogel materials composed of two or more different types of polymers. 458 459 339 340 Figure 12 341 438 461 193 2 2 Figure 12 Dual-dynamic-bond cross-linked injectable hydrogel of multifunction for intervertebral disc degeneration therapy. ( A B C D E F G I https://creativecommons.org/licenses/by/4.0/ 340 Figure 13 Exosome-loaded temperature-sensitive decellularised ECM hydrogels for the treatment of IDD. ( A B C D E F G H https://creativecommons.org/licenses/by/4.0/ 73 Figure 14 NO-loaded ROS-responsive system for amelioration of oxidative stress microenvironment in degenerating IVDs. ( A B D F G H I J K 345 Figure 15 pH-responsive NDDS targeting senescent NP cells for the treatment of IDD. ( A B C D E F G H https://creativecommons.org/licenses/by/4.0/ 347 Figure 16 Hydrogen Ion Capturing Hydrogel Microspheres for the treatment of IDD. ( A B C D E F G H I # 348 Figure 17 Sustained and bioresponsive two-stage delivery of therapeutic miRNA by injectable hydrogel loaded with polymeric micelles to inhibit IVD fibrosis. ( A B C 349 Figure 18 Multi-responsive spermidine delivery system for improving oxidative stress microenvironment in degenerated IVD. ( A B C D E F G H I # 353 Figure 19 MnOx-functionalized temperature-sensitive nanohydrogels contribute to the removal of endogenous ROS and provide a promising stem cell delivery platform for IDD. ( A B C D 2 2 E F G H I 354 Exosomes Exosomes (Exos) are tiny membrane vesicles produced by intracellular multivesicular bodies (MVBs), with a diameter of approximately 30–150 nanometers. 462 463 464 465 466 467 468 469 470 471 472 473 473 474 73 Figure 13 475 476 Special Stimuli-Responsive Drug Delivery System Stimuli-responsive nano-drug delivery systems are smart drug carriers that can control drug release based on changes in the internal or external environment. 477 25 Internal Stimuli-Responsive Drug Delivery System Redox-Responsive Nano-Drug Delivery System We have previously described the disturbance of redox state in degenerating IVDs, which can induce the transformation of physicochemical properties, structural changes, functional regulation and degradation of redox-responsive NDDSs, thereby achieving controlled and targeted drug release. 478 479 480 481 482 478 483 484 IL-1β is a major component of the inflammatory microenvironment of degenerating IVDs. Under oxidative stress conditions, it is produced by lysosomal-independent secretory autophagy in macrophages, in which tripartite motif containing 16 (TRIM16) plays an important role. 342 342 2 2 485 343 2 2 344 486 487 488 345 Figure 14 Although redox-responsive NDDSs show excellent efficacy in alleviating oxidative stress in degenerative IVDs, there are still some issues worth considering. Firstly, it is necessary to systematically detect the redox status of IVDs at different stages of degeneration to distinguish the different ROS levels in normal and degenerated IVDs. Secondly, the sensitivity of the material depends on the specific functional groups and structure of the polymer, which may require individualized design at different disease stages. In addition, redox-responsive NDDSs should have good biocompatibility, degradability, and low cytotoxicity, which can avoid causing additional damage. Finally, while ensuring adequate drug concentration in the IVD, the rate of drug release should be delayed as much as possible through solubility changes and bond cleavage, which can increase efficacy and patient compliance. pH -Responsive Nano-Drug Delivery System Compared with the pH of normal IVD (7.1), the pH of mildly, moderately, and severely degraded IVD is 6.8, 6.5, and 6.2, respectively. 489 490 491 492 493 483 493 Hydrogen (H 2 494 2 346 2 495 496 497 347 Figure 15 2 152 498 499 348 Figure 16 The pH-responsive NDDSs utilize the subtle differences in pH between normal and degenerated intervertebral discs, which requires the pH-sensitive functional groups to exhibit sensitive responses to slight changes in acidic microenvironments. The acidic environment in various subcellular organelles is the most commonly used stimulus to trigger the release of drugs from pH-responsive NDDSs. It is important to be aware that some pH-sensitive nanomaterials can induce lysosomal membrane damage and the release of hydrolases, leading to cell autophagy and death. 500 501 502 2 503 2 504 Enzyme-Responsive Nano-Drug Delivery System Enzyme-responsive NDDSs are an advanced drug delivery technology that utilizes the activity of specific enzymes to control the release of drugs. It usually consists of two parts, including enzyme-sensitive nanomaterials and therapeutic agents wrapped in biodegradable encapsulation materials. 505 478 83 506 507 Protease can catalyze the hydrolysis of peptide bonds within protein molecules, thereby breaking down large molecular proteins into smaller peptides or amino acids. 508 76 391 509 510 349 Figure 17 511 512 513 514 350 At present, a variety of enzyme-responsive NDDSs have been successfully developed for promoting the repair of degenerated IVDs with efficient drug delivery performance and good application prospects. However, no studies have attempted to alleviate oxidative stress in IDD. Prior to undertaking the task, it is imperative to quantitatively assess alterations in enzyme content within IVDs. Multi-Stimulus-Responsive Nano-Drug Delivery System There are complex microenvironmental changes in degenerating IVDs, including hypoxia, low pH, oxidative stress, and promotion of catabolism. Therefore, combining the metabolic characteristics of two or more microenvironments can achieve multi-stimulus responsive drug delivery, which will further improve the targeting and side effects of drug delivery. 515 501 516 As an important signaling molecule, H 2 517 518 2 519 520 2 521 2 2 2 522 2 2 2 523 2 351 2 2 2 2 2 524 525 2 2 2 2 352 2 2 2 2 2 526 527 353 2 2 Figure 18 Although these systems demonstrate targeted and controlled drug release advantages, their triggering conditions are too complex, which may lead to the failure of encapsulated drug release. To determine the feasibility of these strategies, modulation of responses to each stimulus needs to be demonstrated both in vitro and in vivo. External Stimulus-Responsive Drug Delivery System External stimulus-responsive NODDs can control drug release through a variety of external signals (such as light, temperature, magnetism, and ultrasound). 528 528 529 Thermo-Responsive Nano-Drug Delivery System Thermo-responsive NDDSs control drug release based on the temperature difference between the lesion site and normal tissue, which requires that the properties of at least one component of the nanocarrier material change dramatically and nonlinearly with temperature. 501 530 531 532 533 534 535 In 2024, Wang et al developed a temperature-sensitive hydrogel composed of CS and glycerophosphate (GP), in which MnOx NPs with excellent water dispersibility were uniformly incorporated (CS@MnOx) 354 Figure 19 536–538 73 539 540 541 542 Currently, the challenge of thermo-responsive NDDSs is to increase biocompatibility and reduce cytotoxicity while maintaining their thermosensitive properties. Because the thermo-responsive nanocarriers based on the mainstream thermosensitive material PNIPAM are not degradable in the body, which may bring therapeutic side effects. 541 Light-Responsive Nano-Drug Delivery System Light-responsive NDDSs are typically made of nanoscale carrier materials, which can encapsulate drugs and remain stable in the body. 501 541 37 543 544 As early as 2014, Kumar et al constructed a photocurable, biocompatible, degradable and injectable synthetic polymer hydrogel. 545 546 547 Although these studies have shown that photoresponsive nanomaterials can be used to repair IDD, no studies have yet explored the use of photoresponsive drug carriers to improve the oxidative stress microenvironment of IDD. In addition, compared with the non-nanomaterials mentioned above, nanoscale carriers have the advantages of high specific surface area, excellent biodistribution and strong targeting. 548 541 544 549 550 551 552 549 Ultrasound-Responsive Nano-Drug Delivery System With the development of modern medicine, ultrasound has become an indispensable and important means for the diagnosis and treatment of various diseases. Due to its non-invasive, cost-effective, safe, easy-to-operate, and highly penetrative characteristics, ultrasound has broad prospects in the field of drug delivery. 553 554 555 556 557 558 559 560 561 Microbubbles are the most common ultrasound-responsive drug delivery method. 562 556 553 355 563 564 2 565 553 356 2 562 566 Although ultrasound-responsive drug carriers have many advantages, there are still many challenges in balancing the sensitivity of ultrasound response and the stability of the carrier in vivo. 567 Magnetic-Responsive Nano Drug-Delivery System Magnetic-responsive NDDSs are an advanced drug delivery technology that utilizes magnetic NPs as carriers and controls drug release through an external magnetic field. 568 37 569 570 571 572 483 573 574 3 4 501 575 Despite the numerous advantages of magnetic responsive NDDSs, their application is limited by the complexity of external magnetic field setup and the potential biotoxicity of magnetic NPs. 570 576 577 Conclusions and Future Perspectives IDD is a common age-related musculoskeletal disorder, which is characterised by high morbidity, high disability and high healthcare costs. Numerous studies have shown that oxidative stress is an important factor in accelerating IDD. Oxidative stress not only affects the survival and metabolic characteristics of IVD cells by activating downstream signaling pathways, but also interferes with endogenous and exogenous repair by promoting the deterioration of the IVD microenvironment. The current primary objective in the treatment of IDD is to manage clinical symptoms rather than ameliorate pathological changes in degenerative IVD. Meanwhile, these conventional treatment modalities also exhibit limitations including significant invasiveness, numerous systemic adverse reactions, suboptimal patient adherence, and a heightened risk of recurrence. Although some emerging therapies (growth factors, cell therapies, and gene editing technologies) have been tested in preclinical and clinical studies over the past few decades, these approaches have not yet been truly applied in the clinic. The main obstacles leading to repair failure include the avascular structure of IVD, the harsh microenvironment, and the insufficient endogenous repair potential. Fortunately, rapid advances in nanomedicine and NDDSs have brought light to the treatment of IDD. These disruptive and rapidly developing approaches have the potential to address the challenges of current treatment approaches and provide innovative solutions for repairing and reversing IDD. In this study, we conducted a comprehensive review of NDDSs that have the potential to enhance the oxidative stress microenvironment. We thoroughly analyzed their strengths, weaknesses, and future prospects for development. The ideal NDDSs should possess the advantages of biocompatibility, degradability, high drug encapsulation efficiency, controllable release, robust mechanical performance, low toxicity and facile clinical application. Based on the current study, we believe that nanohydrogels may be relatively more promising NDDSs for IDD repair. As NP repair and drug carrier, nanohydrogels not only have similar mechanical properties to natural tissues, but also provide ideal microenvironment to improve the proliferation, differentiation and signal transduction of endogenous or exogenous cells. In addition, nanohydrogels can achieve multifunctional properties by incorporating functionalized nanoparticles, such as improved controlled drug release, enhanced targeting, and increased cell adhesion. However, nanohydrogels also have limitations for the treatment of IDD and are not a perfect repair medium. For example, nanohydrogels have a better repair effect on NP, but the repair effect on AF is quite limited. In this regard, nanofiber scaffolds can better repair defective AF tissue. In addition, in order to better target lesion tissues to improve the efficacy of the drug and reduce side effects, stimuli-responsive drug delivery systems were introduced into drug delivery. In particular, redox-responsive NDDSs, which target diseased tissues or subcellular regions, can significantly improve the oxidative stress microenvironment in degenerative IVDs. However, stimuli-responsive drug delivery systems also face significant challenges in moving from the laboratory to clinical success. Internal stimuli-responsive NDDSs are dependent on changes in the microenvironment within the IVD and carrier-specific functional groups, demanding conditions that may limit their clinical application. As for external stimuli-responsive NDDSs, they often have difficulty in distinguishing between normal and diseased tissues, and therefore cannot be truly targeted. In summary, these finer vectors often involve limited application conditions or complex synthetic techniques, which make large-scale production and clinical application of vectors more difficult. Therefore, more active targeting strategies for identifying biomarkers in diseased tissues or cells should be introduced in the future. Furthermore, although many potential antioxidants have shown some efficacy in the treatment of IDD. However, it is undeniable that antioxidant therapy alone is not sufficient to halt or reverse the degenerative process. To achieve better clinical outcomes, NDDSs may need to be combined with other more cutting-edge treatments, such as NDDS combined with stem cells or gene therapy. These treatments will help to further enhance targeting and precision while encompassing the multiple pathological processes involved in IVD degeneration. Although NDDSs have made great progress in treating IDD, they are still a long way from true clinical application, which involves many regulatory and ethical considerations. The progression of IDD is a chronic process, so the efficacy and safety of NDDSs need to be determined by long-term observation. However, the experimental periods of current studies are relatively short. Secondly, the good biocompatibility and biodegradability of nanocarriers is a prerequisite for their wide application, so minimizing immunogenicity and biotoxicity is the focus for further optimization. Currently, regeneration of NP is the current focus of attention, but future treatment should focus on synergistic recovery of NP, AF and CEP. In addition, the model animals currently used to evaluate the therapeutic effects of IDD are mainly rats and rabbits. The anatomical structure and tissue composition of these two animal IVDs differ greatly from humans, 578 579 580 In conclusion, continuous research on the oxidative stress microenvironment of degenerative IVD, development of antioxidant drugs or treatment methods, and optimization of drug delivery strategies may potentially achieve a comprehensive treatment for IDD. Acknowledgments This work was supported by the Cultivation Project of Xi’an Health and Construction Commission (Program No. 2024ms14) and the Innovative Talent Promotion Plan-Technology Innovation Team (Program No. 2024RS-CXTD-86). Data Sharing Statement Data sharing not applicable to this article as no data sets were generated or analysed during the current study. Disclosure The authors report no conflicts of interest in this work. References 1. Wong CK Mak RY Kwok TS Prevalence, Incidence, and Factors Associated With Non-Specific Chronic Low Back Pain in Community-Dwelling Older Adults Aged 60 Years and Older: a Systematic Review and Meta-Analysis J Pain 2022 23 4 509 534 34450274 10.1016/j.jpain.2021.07.012 2. Buchbinder R van Tulder M Öberg B Low back pain: a call for action Lancet (London, England) 2018 391 10137 2384 2388 10.1016/S0140-6736(18)30488-4 29573871 3. Hartvigsen J Hancock MJ Kongsted A What low back pain is and why we need to pay attention Lancet (London, England) 2018 391 10137 2356 2367 10.1016/S0140-6736(18)30480-X 29573870 4. Mohd Isa IL Teoh SL Mohd Nor NH Mokhtar SA Discogenic Low Back Pain: anatomy, Pathophysiology and Treatments of Intervertebral Disc Degeneration Int J Mol Sci 2022 24 1 208 10.3390/ijms24010208 36613651 PMC9820240 5. Morris LD Daniels KJ Ganguli B Louw QA An update on the prevalence of low back pain in Africa: a systematic review and meta-analyses BMC Musculoskeletal Disorders 2018 19 1 196 10.1186/s12891-018-2075-x 30037323 PMC6055346 6. Garcia JB Hernandez-Castro JJ Nunez RG Prevalence of low back pain in Latin America: a systematic literature review Pain Physician 2014 17 5 379 391 10.36076/ppj.2014/17/379 25247896 7. Sharma S Jensen MP Pathak A Sharma S Pokharel M Abbott JH State of clinical pain research in Nepal: a systematic scoping review Pain Reports 2019 4 6 e788 10.1097/PR9.0000000000000788 31984293 PMC6903326 8. Wang Y Hu S Zhang W Zhang B Yang Z Emerging role and therapeutic implications of p53 in intervertebral disc degeneration Cell Death Discovery 2023 9 1 433 10.1038/s41420-023-01730-5 38040675 PMC10692240 9. GBD 2015 Disease and Injury Incidence and Prevalence Collaborators Global, regional, and national incidence, prevalence, and years lived with disability for 310 diseases and injuries, 1990-2015: a systematic analysis for the Global Burden of Disease Study 2015 Lancet 2016 388 10053 1545 1602 10.1016/S0140-6736(16)31678-6 27733282 PMC5055577 10. Hall JA Jowett S Lewis M Oppong R Konstantinou K The STarT Back stratified care model for nonspecific low back pain: a model-based evaluation of long-term cost-effectiveness Pain 2021 162 3 702 710 10.1097/j.pain.0000000000002057 32868748 11. Kamali A Ziadlou R Lang G Small molecule-based treatment approaches for intervertebral disc degeneration: current options and future directions Theranostics 2021 11 1 27 47 10.7150/thno.48987 33391459 PMC7681102 12. Bennett RL The epigenetic underpinnings of lower back pain Clinical and Translational Medicine 2022 12 6 e868 10.1002/ctm2.868 35678043 PMC9178365 13. Yang S Zhang F Ma J Ding W Intervertebral disc ageing and degeneration: the antiapoptotic effect of oestrogen Ageing Res Rev 2020 57 100978 10.1016/j.arr.2019.100978 31669486 14. Dickinson PJ Bannasch DL Current Understanding of the Genetics of Intervertebral Disc Degeneration Frontiers in Veterinary Science 2020 7 431 10.3389/fvets.2020.00431 32793650 PMC7393939 15. Theodore N Ahmed AK Fulton T Genetic Predisposition to Symptomatic Lumbar Disk Herniation in Pediatric and Young Adult Patients Spine 2019 44 11 E640 e649 10.1097/BRS.0000000000002949 30475332 16. Song C Zhou Y Cheng K Cellular senescence - Molecular mechanisms of intervertebral disc degeneration from an immune perspective Biomed Pharmacother 2023 162 114711 10.1016/j.biopha.2023.114711 37084562 17. Cannata F Vadalà G Ambrosio L Intervertebral disc degeneration: a focus on obesity and type 2 diabetes Diabetes/Metab Res Rev 2020 36 1 e3224 10.1002/dmrr.3224 31646738 18. Zhang GZ Liu MQ Chen HW NF-κB signalling pathways in nucleus pulposus cell function and intervertebral disc degeneration Cell Proliferation 2021 54 7 e13057 10.1111/cpr.13057 34028920 PMC8249791 19. Wang Y Cheng H Wang T Zhang K Zhang Y Kang X Oxidative stress in intervertebral disc degeneration: molecular mechanisms, pathogenesis and treatment Cell Proliferation 2023 56 9 e13448 10.1111/cpr.13448 36915968 PMC10472537 20. Kloppenburg M Berenbaum F Osteoarthritis year in review 2019: epidemiology and therapy Osteoarthritis Cartilage 2020 28 3 242 248 10.1016/j.joca.2020.01.002 31945457 21. Xin J Wang Y Zheng Z Wang S Na S Zhang S Treatment of Intervertebral Disc Degeneration Orthopaedic Surgery 2022 14 7 1271 1280 10.1111/os.13254 35486489 PMC9251272 22. Liu W Ma Z Wang Y Yang J Multiple nano-drug delivery systems for intervertebral disc degeneration: current status and future perspectives Bioact Mater 2023 23 274 299 10.1016/j.bioactmat.2022.11.006 36439088 PMC9679278 23. Mansour A Romani M Acharya AB Rahman B Verron E Badran Z Drug Delivery Systems in Regenerative Medicine: an Updated Review Pharmaceutics 2023 15 2 695 10.3390/pharmaceutics15020695 36840018 PMC9967372 24. Zhang S Wang L Kang Y Wu J Zhang Z Nanomaterial-based reactive oxygen species scavengers for osteoarthritis therapy Acta Biomater 2023 162 1 19 10.1016/j.actbio.2023.03.030 36967052 25. Yu H Gao R Liu Y Fu L Zhou J Li L Stimulus-Responsive Hydrogels as Drug Delivery Systems for Inflammation Targeted Therapy Advanced Science (Weinheim, Baden-Wurttemberg, Germany) 2024 11 1 e2306152 10.1002/advs.202306152 37985923 PMC10767459 26. Zhang Q Wang Y Wu D Chen Z Stimuli-responsive nanoscale drug delivery system for epilepsy theranostics Acta Biomater 2025 194 58 79 10.1016/j.actbio.2025.01.046 39880180 27. Morici L Allémann E Rodríguez-Nogales C Jordan O Cartilage-targeted drug nanocarriers for osteoarthritis therapy Int J Pharm 2024 666 124843 10.1016/j.ijpharm.2024.124843 39424088 28. Newell N Little JP Christou A Adams MA Adam CJ Masouros SD Biomechanics of the human intervertebral disc: a review of testing techniques and results J Mech Behav Biomed Mater 2017 69 420 434 10.1016/j.jmbbm.2017.01.037 28262607 29. Samanta A Lufkin T Kraus P Intervertebral disc degeneration-Current therapeutic options and challenges Front Public Health 2023 11 1156749 10.3389/fpubh.2023.1156749 37483952 PMC10359191 30. Yang B Wendland MF O’Connell GD Direct Quantification of Intervertebral Disc Water Content Using MRI Journal of Magnetic Resonance Imaging: JMRI 2020 52 4 1152 1162 10.1002/jmri.27171 32338812 31. Song C Hu P Peng R Li F Fang Z Xu Y Bioenergetic dysfunction in the pathogenesis of intervertebral disc degeneration Pharmacol Res 2024 202 107119 10.1016/j.phrs.2024.107119 38417775 32. Risbud MV Shapiro IM Role of cytokines in intervertebral disc degeneration: pain and disc content Nat Rev Rheumatol 2014 10 1 44 56 10.1038/nrrheum.2013.160 24166242 PMC4151534 33. Hunter CJ Matyas JR Duncan NA The notochordal cell in the nucleus pulposus: a review in the context of tissue engineering Tissue Eng 2003 9 4 667 677 10.1089/107632703768247368 13678445 34. Rodrigues-Pinto R Richardson SM Hoyland JA An understanding of intervertebral disc development, maturation and cell phenotype provides clues to direct cell-based tissue regeneration therapies for disc degeneration European Spine Journal: Official Publication of the European Spine Society, the European Spinal Deformity Society, and the European Section of the Cervical Spine Research Society 2014 23 9 1803 1814 10.1007/s00586-014-3305-z 24777668 35. Peng H Qiao J Wang G Shi W Xia F Qiao R Dong B: a collagen-rich arch in the urochordate notochord coordinates cell shaping and multi-tissue elongation Current Biology: CB 2023 33 24 5390 5403.e5393 10.1016/j.cub.2023.11.001 37995694 36. Erwin WM Inman RD Inman RD: notochord cells regulate intervertebral disc chondrocyte proteoglycan production and cell proliferation Spine 2006 31 10 1094 1099 10.1097/01.brs.0000216593.97157.dd 16648742 37. Tang J Luo Y Wang Q Wu J Wei Y Stimuli-Responsive Delivery Systems for Intervertebral Disc Degeneration Int J Nanomed 2024 19 4735 4757 10.2147/IJN.S463939 PMC11135562 38813390 38. Koroth J Buko EO Abbott R Macrophages and Intervertebral Disc Degeneration Int J Mol Sci 2023 24 2 1367 10.3390/ijms24021367 36674887 PMC9863885 39. Silwal P Nguyen-Thai AM Mohammad HA Cellular Senescence in Intervertebral Disc Aging and Degeneration: molecular Mechanisms and Potential Therapeutic Opportunities Biomolecules 2023 13 4 686 10.3390/biom13040686 37189433 PMC10135543 40. Zhang A Cheng Z Chen Y Shi P Gan W Zhang Y Emerging tissue engineering strategies for annulus fibrosus therapy Acta Biomater 2023 167 1 15 10.1016/j.actbio.2023.06.012 37330029 41. Mohd Isa IL Mokhtar SA Fauzi MB Devitt A Devitt A Pandit A Intervertebral Disc Degeneration: biomaterials and Tissue Engineering Strategies toward Precision Medicine Adv Healthcare Mater 2022 11 13 e2102530 10.1002/adhm.202102530 PMC11469247 35373924 42. Chen X Zhang A Zhao K The role of oxidative stress in intervertebral disc degeneration: mechanisms and therapeutic implications Ageing Res Rev 2024 98 102323 10.1016/j.arr.2024.102323 38734147 43. Molladavoodi S McMorran J Gregory D Mechanobiology of annulus fibrosus and nucleus pulposus cells in intervertebral discs Cell Tissue Res 2020 379 3 429 444 10.1007/s00441-019-03136-1 31844969 44. Raj PP Intervertebral disc: anatomy-physiology-pathophysiology-treatment Pain Practice: the Official Journal of World Institute of Pain 2008 8 1 18 44 10.1111/j.1533-2500.2007.00171.x 18211591 45. Ashinsky BG Bonnevie ED Mandalapu SA Intervertebral Disc Degeneration Is Associated With Aberrant Endplate Remodeling and Reduced Small Molecule Transport J Bone Miner Res 2020 35 8 1572 1581 10.1002/jbmr.4009 32176817 PMC8207249 46. Mwale F Roughley P Antoniou J Distinction between the extracellular matrix of the nucleus pulposus and hyaline cartilage: a requisite for tissue engineering of intervertebral disc Eur Cells Mater 2004 8 58 63 10.22203/eCM.v008a06 15602703 47. Sun K Jiang J Wang Y The role of nerve fibers and their neurotransmitters in regulating intervertebral disc degeneration Ageing Res Rev 2022 81 101733 10.1016/j.arr.2022.101733 36113765 48. Zhang H Yang X Huang Y Reviving Intervertebral Discs: treating Degeneration Using Advanced Delivery Systems Mol Pharmaceut 2024 21 2 373 392 10.1021/acs.molpharmaceut.3c00579 38252032 49. Zhang S Wang P Hu B Inhibiting Heat Shock Protein 90 Attenuates Nucleus Pulposus Fibrosis and Pathologic Angiogenesis Induced by Macrophages via Down-Regulating Cell Migration-Inducing Protein Am J Pathol 2023 193 7 960 976 10.1016/j.ajpath.2023.03.014 37088454 50. Fournier DE Kiser PK Shoemaker JK Battié MC Séguin CA Vascularization of the human intervertebral disc: a scoping review JOR spine 2020 3 4 e1123 10.1002/jsp2.1123 33392458 PMC7770199 51. Nerlich AG Schaaf R Wälchli B Boos N Temporo-spatial distribution of blood vessels in human lumbar intervertebral discs Eur Spine J 2007 16 4 547 555 10.1007/s00586-006-0213-x 16947015 PMC2229818 52. Wang Z Chen H Tan Q Inhibition of aberrant Hif1α activation delays intervertebral disc degeneration in adult mice Bone Res 2022 10 1 2 10.1038/s41413-021-00165-x 34983922 PMC8727577 53. De Geer CM Intervertebral Disk Nutrients and Transport Mechanisms in Relation to Disk Degeneration: a Narrative Literature Review Journal of Chiropractic Medicine 2018 17 2 97 105 10.1016/j.jcm.2017.11.006 30166966 PMC6112070 54. Ejeskär A Holm S Oxygen tension measurements in the intervertebral disc. A methodological and experimental study Upsala Journal of Medical Sciences 1979 84 1 83 93 10.3109/03009737909179143 35874 55. De Santis V Singer M Tissue oxygen tension monitoring of organ perfusion: rationale, methodologies, and literature review Br J Anaesth 2015 115 3 357 365 10.1093/bja/aev162 26198717 56. Madhu V Hernandez-Meadows M Boneski PK The mitophagy receptor BNIP3 is critical for the regulation of metabolic homeostasis and mitochondrial function in the nucleus pulposus cells of the intervertebral disc Autophagy 2023 19 6 1821 1843 10.1080/15548627.2022.2162245 36628478 PMC10262801 57. Johnston SN Silagi ES Madhu V Nguyen DH Shapiro IM Risbud MV GLUT1 is redundant in hypoxic and glycolytic nucleus pulposus cells of the intervertebral disc JCI Insight 2023 8 8 10.1172/jci.insight.164883 PMC10243741 36917198 58. Binch AL Cole AA Breakwell LM Nerves are more abundant than blood vessels in the degenerate human intervertebral disc Arthritis Res Therapy 2015 17 1 370 10.1186/s13075-015-0889-6 PMC4704545 26695177 59. Francisco V Pino J González-Gay M A new immunometabolic perspective of intervertebral disc degeneration Nat Rev Rheumatol 2022 18 1 47 60 10.1038/s41584-021-00713-z 34845360 60. Hanaei S Khoshnevisan A Kepler CK Rezaei N Rezaei N Genetic aspects of intervertebral disc degeneration Reviews in the Neurosciences 2015 26 5 581 606 10.1515/revneuro-2014-0077 25996483 61. Sambrook PN MacGregor AJ Spector TD Genetic influences on cervical and lumbar disc degeneration: a magnetic resonance imaging study in twins Arthritis Rheum 1999 42 2 366 372 10.1002/1529-0131(199902)42:2&#x0003c;366::AID-ANR20&#x0003e;3.0.CO;2-6 10025932 62. Videman T Battié MC Ripatti S Gill K Manninen H Kaprio J Determinants of the progression in lumbar degeneration: a 5-year follow-up study of adult male monozygotic twins Spine 2006 31 6 671 678 10.1097/01.brs.0000202558.86309.ea 16540872 63. Williams FM Sambrook PN Jones AF Spector TD MacGregor AJ MacGregor AJ Progression of lumbar disc degeneration over a decade: a heritability study Ann Rheumatic Dis 2011 70 7 1203 1207 10.1136/ard.2010.146001 PMC3103702 21402564 64. Williams FM Bansal AT van Meurs JB Novel genetic variants associated with lumbar disc degeneration in Northern Europeans: a meta-analysis of 4600 subjects Ann Rheumatic Dis 2013 72 7 1141 1148 10.1136/annrheumdis-2012-201551 PMC3686263 22993228 65. Wu F Huang X Zhang Z Shao Z A Meta-analysis Assessing the Association Between COL11A1 and GDF5 Genetic Variants and Intervertebral Disc Degeneration Susceptibility Spine 2020 45 11 E616 e623 10.1097/BRS.0000000000003371 31923126 66. Mogensen MS Karlskov-Mortensen P Proschowsky HF Genome-wide association study in Dachshund: identification of a major locus affecting intervertebral disc calcification The Journal of Heredity 2011 102 1 S81 86 10.1093/jhered/esr021 21846751 67. Bjornsdottir G Stefansdottir L Thorleifsson G Rare SLC13A1 variants associate with intervertebral disc disorder highlighting role of sulfate in disc pathology Nat Commun 2022 13 1 634 10.1038/s41467-022-28167-1 35110524 PMC8810832 68. TYK A Lam TK Peng Y Transformation of resident notochord-descendent nucleus pulposus cells in mouse injury-induced fibrotic intervertebral discs Aging Cell 2020 19 11 e13254 10.1111/acel.13254 33084203 PMC7681061 69. McCann MR Séguin CA Notochord Cells in Intervertebral Disc Development and Degeneration Journal of Developmental Biology 2016 4 1 3 10.3390/jdb4010003 27252900 PMC4885739 70. McCann MR Bacher CA Séguin CA Exploiting notochord cells for stem cell-based regeneration of the intervertebral disc J Cell Commun Signal 2011 5 1 39 43 10.1007/s12079-010-0116-9 21484587 PMC3058196 71. Liao Z Liu H Ma L Engineering Extracellular Vesicles Restore the Impaired Cellular Uptake and Attenuate Intervertebral Disc Degeneration ACS nano 2021 15 9 14709 14724 10.1021/acsnano.1c04514 34476937 72. Teng Y Yu H Wu C Nimbolide targeting SIRT1 mitigates intervertebral disc degeneration by reprogramming cholesterol metabolism and inhibiting inflammatory signaling Acta Pharmaceutica Sinica B 2023 13 5 2269 2280 10.1016/j.apsb.2023.02.018 37250166 PMC10213799 73. Xing H Zhang Z Mao Q Injectable exosome-functionalized extracellular matrix hydrogel for metabolism balance and pyroptosis regulation in intervertebral disc degeneration J Nanobiotechnol 2021 19 1 264 10.1186/s12951-021-00991-5 PMC8419940 34488795 74. Oichi T Taniguchi Y Oshima Y Tanaka S Saito T Pathomechanism of intervertebral disc degeneration JOR spine 2020 3 1 e1076 10.1002/jsp2.1076 32211588 PMC7084053 75. Luo L Gong J Wang Z Injectable cartilage matrix hydrogel loaded with cartilage endplate stem cells engineered to release exosomes for non-invasive treatment of intervertebral disc degeneration Bioact Mater 2022 15 29 43 10.1016/j.bioactmat.2021.12.007 35386360 PMC8940768 76. Vo NV Hartman RA Yurube T Jacobs LJ Sowa GA Kang JD Expression and regulation of metalloproteinases and their inhibitors in intervertebral disc aging and degeneration Spine J 2013 13 3 331 341 10.1016/j.spinee.2012.02.027 23369495 PMC3637842 77. Kang L Zhang H Jia C Zhang R Shen C Targeting Oxidative Stress and Inflammation in Intervertebral Disc Degeneration: therapeutic Perspectives of Phytochemicals Front Pharmacol 2022 13 956355 10.3389/fphar.2022.956355 35903342 PMC9315394 78. Kang L Zhang H Jia C Zhang R Shen C Epigenetic modifications of inflammation in intervertebral disc degeneration Ageing Res Rev 2023 87 101902 10.1016/j.arr.2023.101902 36871778 79. Wen P Zheng B Ma T Hao L Zhang Y Zhang Y The role of ageing and oxidative stress in intervertebral disc degeneration Front Mol Biosci 2022 9 1052878 10.3389/fmolb.2022.1052878 36419928 PMC9676652 80. Feng C Yang M Liu C ROS: crucial Intermediators in the Pathogenesis of Intervertebral Disc Degeneration Oxid Med Cell Longev 2017 2017 1 5601593 10.1155/2017/5601593 28392887 PMC5368368 81. Shi ZW Zhu L Song ZR Liu TJ Hao DJ Roles of p38 MAPK signalling in intervertebral disc degeneration Cell Proliferation 2023 56 8 e13438 10.1111/cpr.13438 36872558 PMC10392072 82. Chen HW Zhou JW Zhang GZ Luo ZB Li L Kang XW Emerging role and therapeutic implication of mTOR signalling in intervertebral disc degeneration Cell Proliferation 2023 56 1 e13338 10.1111/cpr.13338 36193577 PMC9816935 83. Liang H Luo R Li G Zhang W Song Y Yang C The Proteolysis of ECM in Intervertebral Disc Degeneration Int J Mol Sci 2022 23 3 1715 35163637 10.3390/ijms23031715 PMC8835917 84. Yang G Liu X Chen F Wang W Shao Y Cui X Astaxanthin suppresses oxidative stress and calcification in vertebral cartilage endplate via activating Nrf-2/HO-1 signaling pathway Int immunopharmacol 2023 119 110159 10.1016/j.intimp.2023.110159 37054647 85. Aigner T Gresk-otter KR Fairbank JC von der Mark K Urban JP Variation with age in the pattern of type X collagen expression in normal and scoliotic human intervertebral discs Calcified Tissue International 1998 63 3 263 268 10.1007/s002239900524 9701632 86. Grant MP Epure LM Bokhari R Roughley P Antoniou J Mwale F Human cartilaginous endplate degeneration is induced by calcium and the extracellular calcium-sensing receptor in the intervertebral disc Eur Cells Mater 2016 32 137 151 10.22203/eCM.v032a09 27452962 87. Kritschil R Scott M Sowa G Vo N Role of autophagy in intervertebral disc degeneration J Cell Physiol 2022 237 2 1266 1284 10.1002/jcp.30631 34787318 PMC8866220 88. Bermudez-Lekerika P Crump KB Tseranidou S Immuno-Modulatory Effects of Intervertebral Disc Cells Front Cell Develop Biol 2022 10 924692 10.3389/fcell.2022.924692 PMC9277224 35846355 89. Wu XT Wang YX Sun HH Feng M Sun -H-H Update on the roles of macrophages in the degeneration and repair process of intervertebral discs Joint Bone Spine 2023 90 3 105514 10.1016/j.jbspin.2022.105514 36529418 90. Sun Z Liu B Luo ZJ The Immune Privilege of the Intervertebral Disc: implications for Intervertebral Disc Degeneration Treatment Int J Med Sci 2020 17 5 685 692 10.7150/ijms.42238 32210719 PMC7085207 91. Capossela S Schläfli P Bertolo A Degenerated human intervertebral discs contain autoantibodies against extracellular matrix proteins Eur Cells Mater 2014 27 251 263 10.22203/eCM.v027a18 24706108 92. Lisiewski LE Jacobsen HE Viola DCM Kenawy HM Kiridly DN Chahine NO Intradiscal inflammatory stimulation induces spinal pain behavior and intervertebral disc degeneration in vivo FASEB j 2024 38 1 e23364 10.1096/fj.202300227R 38091247 PMC10795732 93. Staszkiewicz R Gładysz D Gralewski M Usefulness of Detecting Brain-Derived Neurotrophic Factor in Intervertebral Disc Degeneration of the Lumbosacral Spine Medical Science Monitor: International Medical Journal of Experimental and Clinical Research 2023 29 e938663 10.12659/MSM.938663 36642939 PMC9854178 94. Damle SR Krzyzanowska AK Korsun MK Inducing Angiogenesis in the Nucleus Pulposus Cells 2023 12 20 2488 10.3390/cells12202488 37887332 PMC10605635 95. Lyu FJ Cui H Mc Cheung K Cao X Iatridis JC Zheng Z Painful intervertebral disc degeneration and inflammation: from laboratory evidence to clinical interventions Bone Res 2021 9 1 7 10.1038/s41413-020-00125-x 33514693 PMC7846842 96. Yu P Mao F Chen J Characteristics and mechanisms of resorption in lumbar disc herniation Arthritis Res Therapy 2022 24 1 205 10.1186/s13075-022-02894-8 PMC9396855 35999644 97. Cheng Z Xiang Q Wang J Zhang Y The potential role of melatonin in retarding intervertebral disc ageing and degeneration: a systematic review Ageing Res Rev 2021 70 101394 10.1016/j.arr.2021.101394 34139338 98. Vergroesen PP Kingma I Emanuel KS Mechanics and biology in intervertebral disc degeneration: a vicious circle Osteoarthritis Cartilage 2015 23 7 1057 1070 10.1016/j.joca.2015.03.028 25827971 99. Haughton V Imaging intervertebral disc degeneration J Bone Joint Surg Am Vol 2006 88 2 15 20 10.2106/JBJS.F.00010 16595437 100. Tamagawa S Sakai D Nojiri H Sato M Imaging Evaluation of Intervertebral Disc Degeneration and Painful Discs-Advances and Challenges in Quantitative MRI Diagnostics 2022 12 3 707 35328260 10.3390/diagnostics12030707 PMC8946895 101. Zhang AS Xu A Ansari K Anderson G Alsoof D Daniels AH Lumbar Disc Herniation: diagnosis and Management Am J Med 2023 136 7 645 651 10.1016/j.amjmed.2023.03.024 37072094 102. Kreiner DS Hwang SW Easa JE An evidence-based clinical guideline for the diagnosis and treatment of lumbar disc herniation with radiculopathy Spine J 2014 14 1 180 191 24239490 10.1016/j.spinee.2013.08.003 103. Hlubek RJ Mundis Jr GM Treatment for Recurrent Lumbar Disc Herniation Current Reviews in Musculoskeletal Medicine 2017 10 4 517 520 10.1007/s12178-017-9450-3 29103156 PMC5685971 104. Latka D Miekisiak G Jarmuzek P Lachowski M Kaczmarczyk J Treatment of lumbar disc herniation with radiculopathy. Clinical practice guidelines endorsed by The Polish Society of Spinal Surgery Neurologia i neurochirurgia polska 2016 50 2 101 108 26969566 10.1016/j.pjnns.2015.12.001 105. Sköld C Tropp H Berg S Five-year follow-up of total disc replacement compared to fusion: a randomized controlled trial European Spine Journal: Official Publication of the European Spine Society, the European Spinal Deformity Society, and the European Section of the Cervical Spine Research Society 2013 22 10 2288 2295 10.1007/s00586-013-2926-y PMC3804684 23893083 106. Berg S Tropp HT Leivseth G Disc height and motion patterns in the lumbar spine in patients operated with total disc replacement or fusion for discogenic back pain. Results from a randomized controlled trial Spine J 2011 11 11 991 998 10.1016/j.spinee.2011.08.434 21978518 107. Cheung EC Vousden KH The role of ROS in tumour development and progression Nat Rev Cancer 2022 22 5 280 297 35102280 10.1038/s41568-021-00435-0 108. Yang S Lian G ROS and diseases: role in metabolism and energy supply Mol Cell Biochem 2020 467 1–2 1 12 31813106 10.1007/s11010-019-03667-9 PMC7089381 109. Bai R Guo J Ye XY Xie Y Xie T Oxidative stress: the core pathogenesis and mechanism of Alzheimer’s disease Ageing Res Rev 2022 77 101619 10.1016/j.arr.2022.101619 35395415 110. Reczek CR Chandel NS ROS-dependent signal transduction Curr Opin Cell Biol 2015 33 8 13 10.1016/j.ceb.2014.09.010 25305438 PMC4380867 111. Li Y Chen L Gao Y Zou X Wei F Oxidative Stress and Intervertebral Disc Degeneration: pathophysiology, Signaling Pathway, and Therapy Oxid Med Cell Longev 2022 2022 1984742 10.1155/2022/1984742 36262281 PMC9576411 112. Xiang Q Cheng Z Wang J Allicin Attenuated Advanced Oxidation Protein Product-Induced Oxidative Stress and Mitochondrial Apoptosis in Human Nucleus Pulposus Cells Oxid Med Cell Longev 2020 2020 6685043 10.1155/2020/6685043 33381267 PMC7758128 113. Jitjumnong M Chalermkitpanit P Suantawee T Dechsupa S Vajarintarangoon L Honsawek S Telomere Shortening and Increased Oxidative Stress in Lumbar Disc Degeneration Int J Mol Sci 2022 23 17 1 10.3390/ijms231710125 PMC9456205 36077523 114. Song Y Li S Geng W Sirtuin 3-dependent mitochondrial redox homeostasis protects against AGEs-induced intervertebral disc degeneration Redox Biol 2018 19 339 353 10.1016/j.redox.2018.09.006 30216853 PMC6139007 115. Yang F Zhu D Wang Z Role of Advanced Glycation End Products in Intervertebral Disc Degeneration: mechanism and Therapeutic Potential Oxid Med Cell Longev 2022 2022 1 7299005 10.1155/2022/7299005 36573114 PMC9789911 116. Wang DK Zheng HL Zhou WS Mitochondrial Dysfunction in Oxidative Stress-Mediated Intervertebral Disc Degeneration Orthopaedic Surgery 2022 14 8 1569 1582 35673928 10.1111/os.13302 PMC9363752 117. Palma FR Gantner BN Sakiyama MJ ROS production by mitochondria: function or dysfunction? Oncogene 2024 43 5 295 303 38081963 10.1038/s41388-023-02907-z 118. Guo Y Guan T Shafiq K Mitochondrial dysfunction in aging Ageing Res Rev 2023 88 101955 37196864 10.1016/j.arr.2023.101955 119. Zhao RZ Jiang S Zhang L Yu ZB Mitochondrial electron transport chain, ROS generation and uncoupling (Review) IntJ Mol Med 2019 44 1 3 15 10.3892/ijmm.2019.4188 31115493 PMC6559295 120. Fukai T Ushio-Fukai M Cross-Talk between NADPH Oxidase and Mitochondria: role in ROS Signaling and Angiogenesis Cells 2020 9 8 10.3390/cells9081849 PMC7466096 32781794 121. Okoye CN Koren SA Wojtovich AP Mitochondrial complex I ROS production and redox signaling in hypoxia Redox Biol 2023 67 102926 10.1016/j.redox.2023.102926 37871533 PMC10598411 122. Read AD Bentley RE Archer SL Dunham-Snary KJ Mitochondrial iron-sulfur clusters: structure, function, and an emerging role in vascular biology Redox Biol 2021 47 102164 10.1016/j.redox.2021.102164 34656823 PMC8577454 123. Hadrava Vanova K Kraus M Neuzil J Rohlena J Mitochondrial complex II and reactive oxygen species in disease and therapy Redox Report: Communications in Free Radical Research 2020 25 1 26 32 10.1080/13510002.2020.1752002 32290794 PMC7178880 124. Paddenberg R Ishaq B Goldenberg A Essential role of complex II of the respiratory chain in hypoxia-induced ROS generation in the pulmonary vasculature Am J Physiol Lung Cell Mol Physiol 2003 284 5 L710 719 10.1152/ajplung.00149.2002 12676762 125. Song Y Liang H Li G The NLRX1-SLC39A7 complex orchestrates mitochondrial dynamics and mitophagy to rejuvenate intervertebral disc by modulating mitochondrial Zn(2+) trafficking Autophagy 2024 20 4 809 829 10.1080/15548627.2023.2274205 37876250 PMC11062375 126. Mao J Wu Q Shang Q SIRT5-related desuccinylation modification of AIFM1 protects against compression-induced intervertebral disc degeneration by regulating mitochondrial homeostasis Exp Mol Med 2023 55 1 253 268 10.1038/s12276-023-00928-y 36653443 PMC9898264 127. Song Y Lu S Geng W Mitochondrial quality control in intervertebral disc degeneration Exp Mol Med 2021 53 7 1124 1133 10.1038/s12276-021-00650-7 34272472 PMC8333068 128. Chen C Zhou Y Hu C Wang Y Yan Z Wu R Mitochondria and oxidative stress in ovarian endometriosis Free Radic Biol Med 2019 136 22 34 10.1016/j.freeradbiomed.2019.03.027 30926565 129. Brandes RP Weissmann N Schröder K Nox family NADPH oxidases: molecular mechanisms of activation Free Radic Biol Med 2014 76 208 226 25157786 10.1016/j.freeradbiomed.2014.07.046 130. Bedard K Krause KH The NOX family of ROS-generating NADPH oxidases: physiology and pathophysiology Physiol Rev 2007 87 1 245 313 10.1152/physrev.00044.2005 17237347 131. Pecchillo Cimmino T Ammendola R Cattaneo F Esposito G NOX Dependent ROS Generation and Cell Metabolism Int J Mol Sci 2023 24 3 2086 10.3390/ijms24032086 36768405 PMC9916913 132. Li Z Chen S Huang D Peng Y Chen S Ma K TIGAR impedes compression-induced intervertebral disc degeneration by suppressing nucleus pulposus cell apoptosis and autophagy J Cell Physiol 2020 235 2 1780 1794 10.1002/jcp.29097 31317559 133. Jiang LB Cao L Ma YQ TIGAR mediates the inhibitory role of hypoxia on ROS production and apoptosis in rat nucleus pulposus cells Osteoarthritis Cartilage 2018 26 1 138 148 10.1016/j.joca.2017.10.007 29061494 134. Liu C Liu YJ Ai X A positive feedback loop between EZH2 and NOX4 regulates nucleus pulposus cell senescence in age-related intervertebral disc degeneration Cell Division 2020 15 1 2 10.1186/s13008-020-0060-x 32025238 PMC6995653 135. Dai X Chen Y Yu Z Advanced oxidation protein products induce annulus fibrosus cell senescence through a NOX4-dependent, MAPK-mediated pathway and accelerate intervertebral disc degeneration PeerJ 2022 10 e13826 10.7717/peerj.13826 35935259 PMC9354796 136. Liu Q Tan Z Xie C Ling L Hu H Oxidative stress as a critical factor might involve in intervertebral disc degeneration via regulating NOXs/FOXOs Journal of Orthopaedic Science: Official Journal of the Japanese Orthopaedic Association 2023 28 1 105 111 10.1016/j.jos.2021.09.010 34772597 137. Chang HI Chen CN Huang KY Mechanical Stretch-Induced NLRP3 Inflammasome Expression on Human Annulus Fibrosus Cells Modulated by Endoplasmic Reticulum Stress Int J Mol Sci 2022 23 14 4 10.3390/ijms23147951 PMC9323355 35887297 138. Feng C Zhang Y Yang M Liu H Huang B Zhou Y Oxygen-Sensing Nox4 Generates Genotoxic ROS to Induce Premature Senescence of Nucleus Pulposus Cells through MAPK and NF- κ B Pathways Oxid Med Cell Longev 2017 2017 1 7426458 10.1155/2017/7426458 29147462 PMC5632907 139. Yao D Chen E Li Y The role of endoplasmic reticulum stress, mitochondrial dysfunction and their crosstalk in intervertebral disc degeneration Cell. Signalling 2024 114 110986 10.1016/j.cellsig.2023.110986 38007189 140. Cui X Zhang Y Lu Y Xiang M ROS and Endoplasmic Reticulum Stress in Pulmonary Disease Front Pharmacol 2022 13 879204 10.3389/fphar.2022.879204 35559240 PMC9086276 141. Ren J Bi Y Sowers JR Hetz C Zhang Y Endoplasmic reticulum stress and unfolded protein response in cardiovascular diseases Nat Rev Cardiol 2021 18 7 499 521 10.1038/s41569-021-00511-w 33619348 142. Oakes SA Papa FR The role of endoplasmic reticulum stress in human pathology Annual Review of Pathology 2015 10 1 173 194 10.1146/annurev-pathol-012513-104649 PMC5568783 25387057 143. Huang J Zhou Q Ren Q Luo L Ji G Zheng T Endoplasmic reticulum stress associates with the development of intervertebral disc degeneration Front Endocrinol (Lausanne) 2022 13 1094394 10.3389/fendo.2022.1094394 36714579 PMC9877331 144. Miglioranza Scavuzzi B Holoshitz J Endoplasmic Reticulum Stress, Oxidative Stress, and Rheumatic Diseases Antioxidants (Basel, Switzerland) 2022 11 7 10.3390/antiox11071306 PMC9312221 35883795 145. Niemann B Rohrbach S Miller MR Newby DE Fuster V Kovacic JC Oxidative Stress and Cardiovascular Risk: obesity, Diabetes, Smoking, and Pollution: part 3 of a 3-Part Series Journal of the American College of Cardiology 2017 70 2 230 251 10.1016/j.jacc.2017.05.043 28683970 PMC5568826 146. Caliri AW Tommasi S Besaratinia A Relationships among smoking, oxidative stress, inflammation, macromolecular damage, and cancer Mutation Research Reviews in Mutation Research 2021 787 108365 10.1016/j.mrrev.2021.108365 34083039 PMC8287787 147. Cheng W Shi X Zhang J Role of PI3K-AKT Pathway in Ultraviolet Ray and Hydrogen Peroxide-Induced Oxidative Damage and Its Repair by Grain Ferments Foods (Basel, Switzerland) 2023 12 4 3 10.3390/foods12040806 PMC9957031 36832881 148. Wang Q Yu Q Wu M Antioxidant and neuroprotective actions of resveratrol in cerebrovascular diseases Front Pharmacol 2022 13 948889 10.3389/fphar.2022.948889 36133823 PMC9483202 149. Li S Novel insight into functions of ascorbate peroxidase in higher plants: more than a simple antioxidant enzyme Redox Biol 2023 64 102789 10.1016/j.redox.2023.102789 37352686 PMC10333675 150. Zelko IN Mariani TJ Folz RJ Superoxide dismutase multigene family: a comparison of the CuZn-SOD (SOD1), Mn-SOD (SOD2), and EC-SOD (SOD3) gene structures, evolution, and expression Free Radic Biol Med 2002 33 3 337 349 10.1016/S0891-5849(02)00905-X 12126755 151. Xiang Q Zhao Y Lin J Jiang S Li W The Nrf2 antioxidant defense system in intervertebral disc degeneration: molecular insights Exp Mol Med 2022 54 8 1067 1075 10.1038/s12276-022-00829-6 35978054 PMC9440120 152. Xiao L Xu SJ Liu C Wang J Hu B Xu HG Sod2 and catalase improve pathological conditions of intervertebral disc degeneration by modifying human adipose-derived mesenchymal stem cells Life Sci 2021 267 118929 10.1016/j.lfs.2020.118929 33359244 153. Hou G Lu H Chen M Yao H Zhao H Oxidative stress participates in age-related changes in rat lumbar intervertebral discs Arch Gerontol Geriatrics 2014 59 3 665 669 10.1016/j.archger.2014.07.002 25081833 154. Zhang Q Li J Li Y Bmi deficiency causes oxidative stress and intervertebral disc degeneration which can be alleviated by antioxidant treatment J Cell & Mol Med 2020 24 16 8950 8961 10.1111/jcmm.15528 32583517 PMC7417700 155. Tamagawa S Sakai D Nojiri H SOD2 orchestrates redox homeostasis in intervertebral discs: a novel insight into oxidative stress-mediated degeneration and therapeutic potential Redox Biol 2024 71 103091 10.1016/j.redox.2024.103091 38412803 PMC10907854 156. Chandran S Binninger D Role of Oxidative Stress, Methionine Oxidation and Methionine Sulfoxide Reductases (MSR) in Alzheimer’s Disease Antioxidants (Basel, Switzerland) 2023 13 1 10.3390/antiox13010021 PMC10812627 38275641 157. Gruber HE Watts JA Hoelscher GL Mitochondrial gene expression in the human annulus: in vivo data from annulus cells and selectively harvested senescent annulus cells Spine J 2011 11 8 782 791 10.1016/j.spinee.2011.06.012 21784712 158. Bastani NE Sakhi AK Karlsen A Reduced antioxidant defense and increased oxidative stress in spinal cord injured patients Arch Phys Med Rehabil 2012 93 12 2223 2228.e2222 10.1016/j.apmr.2012.06.021 22772083 159. Liu S Pi J Zhang Q Signal amplification in the KEAP1-NRF2-ARE antioxidant response pathway Redox Biol 2022 54 102389 10.1016/j.redox.2022.102389 35792437 PMC9287733 160. Wang L Zhang X Xiong X Nrf2 Regulates Oxidative Stress and Its Role in Cerebral Ischemic Stroke Antioxidants (Basel, Switzerland) 2022 11 12 2 10.3390/antiox11122377 PMC9774301 36552584 161. Pan C Hou W Deng X The Pivotal Role of Nrf2 Signal Axis in Intervertebral Disc Degeneration J Inflamm Res 2023 16 5819 5833 10.2147/JIR.S432575 38076332 PMC10710182 162. Kang L Liu S Li J Tian Y Xue Y Liu X The mitochondria-targeted anti-oxidant MitoQ protects against intervertebral disc degeneration by ameliorating mitochondrial dysfunction and redox imbalance Cell Proliferation 2020 53 3 e12779 10.1111/cpr.12779 32020711 PMC7106957 163. Da W Chen Q Shen B The current insights of mitochondrial hormesis in the occurrence and treatment of bone and cartilage degeneration Biol Res 2024 57 1 37 10.1186/s40659-024-00494-1 38824571 PMC11143644 164. Lin Z Xu G Lu X Chondrocyte-targeted exosome-mediated delivery of Nrf2 alleviates cartilaginous endplate degeneration by modulating mitochondrial fission J Nanobiotechnol 2024 22 1 281 10.1186/s12951-024-02517-1 PMC11127380 38790015 165. Foo J Bellot G Pervaiz S Alonso S Mitochondria-mediated oxidative stress during viral infection Trends in Microbiology 2022 30 7 679 692 10.1016/j.tim.2021.12.011 35063304 166. Zheng D Liu J Piao H Zhu Z Wei R Liu K ROS-triggered endothelial cell death mechanisms: focus on pyroptosis, parthanatos, and ferroptosis Front Immunol 2022 13 1039241 10.3389/fimmu.2022.1039241 36389728 PMC9663996 167. Newton K Strasser A Kayagaki N Dixit VM Cell death Cell 2024 187 2 235 256 10.1016/j.cell.2023.11.044 38242081 168. Czabotar PE Garcia-Saez AJ Mechanisms of BCL-2 family proteins in mitochondrial apoptosis Nat Rev Mol Cell Biol 2023 24 10 732 748 10.1038/s41580-023-00629-4 37438560 169. Sahoo G Samal D Khandayataray P Murthy MK A Review on Caspases: key Regulators of Biological Activities and Apoptosis Molecular Neurobiology 2023 60 10 5805 5837 10.1007/s12035-023-03433-5 37349620 170. Kumari S Dhapola R Reddy DH Apoptosis in Alzheimer’s disease: insight into the signaling pathways and therapeutic avenues Apoptosis: an International Journal on Programmed Cell Death 2023 28 7–8 943 957 10.1007/s10495-023-01848-y 37186274 171. Verdin E Hirschey MD Finley LW Haigis MC Sirtuin regulation of mitochondria: energy production, apoptosis, and signaling Trends Biochem Sci 2010 35 12 669 675 10.1016/j.tibs.2010.07.003 20863707 PMC2992946 172. Cantoni O Zito E Guidarelli A Fiorani M Ghezzi P Mitochondrial ROS ER Stress, and Nrf2 Crosstalk in the Regulation of Mitochondrial Apoptosis Induced by Arsenite Antioxidants (Basel, Switzerland) 2022 11 5 10.3390/antiox11051034 PMC9137803 35624898 173. Turco MC Romano MF Petrella A Bisogni R Tassone P Venuta S NF-kappaB/Rel-mediated regulation of apoptosis in hematologic malignancies and normal hematopoietic progenitors Leukemia 2004 18 1 11 17 10.1038/sj.leu.2403171 14574329 174. Huang ZN Wang ZY Cheng XF Melatonin alleviates oxidative stress-induced injury to nucleus pulposus-derived mesenchymal stem cells through activating PI3K/Akt pathway Journal of Orthopaedic Translation 2023 43 66 84 10.1016/j.jot.2023.10.002 38089645 PMC10711395 175. Zhang Z Wang C Lin J Therapeutic Potential of Naringin for Intervertebral Disc Degeneration: involvement of Autophagy Against Oxidative Stress-Induced Apoptosis in Nucleus Pulposus Cells Am J Chin Med 2018 1 20 10.1142/S0192415X18500805 30284462 176. Zhu P Wu X Ni L Inhibition of PP2A ameliorates intervertebral disc degeneration by reducing annulus fibrosus cells apoptosis via p38/MAPK signal pathway Biochim Biophys Acta Mol Basis Dis 2024 1870 1 166888 10.1016/j.bbadis.2023.166888 37722489 177. Xiao H Wang K Peng L Yin Z Laquinimod attenuates oxidative stress-induced mitochondrial injury and alleviates intervertebral disc degeneration by inhibiting the NF-κB signaling pathway Int immunopharmacol 2024 131 111804 10.1016/j.intimp.2024.111804 38457986 178. Chen J Luo Y Li Y Chen D Yu B He J Chlorogenic Acid Attenuates Oxidative Stress-Induced Intestinal Epithelium Injury by Co-Regulating the PI3K/Akt and IκBα/NF-κB Signaling Antioxidants (Basel, Switzerland) 2021 10 12 1 10.3390/antiox10121915 PMC8750628 34943017 179. Guo Q Jin Y Chen X NF-κB in biology and targeted therapy: new insights and translational implications Signal Transduction and Targeted Therapy 2024 9 1 53 10.1038/s41392-024-01757-9 38433280 PMC10910037 180. Strasser A O’Connor L Dixit VM Apoptosis signaling Annu Rev Biochem 2000 69 1 217 245 10.1146/annurev.biochem.69.1.217 10966458 181. Yu P Zhang X Liu N Tang L Peng C Chen X Pyroptosis: mechanisms and diseases Signal Transduction and Targeted Therapy 2021 6 1 128 10.1038/s41392-021-00507-5 33776057 PMC8005494 182. Sharma BR Kanneganti TD NLRP3 inflammasome in cancer and metabolic diseases Nat Immunol 2021 22 5 550 559 10.1038/s41590-021-00886-5 33707781 PMC8132572 183. Huang Y Xu W Zhou R NLRP3 inflammasome activation and cell death Cell Mol Immunol 2021 18 9 2114 2127 10.1038/s41423-021-00740-6 34321623 PMC8429580 184. Burdette BE Esparza AN Zhu H Wang S Gasdermin D in pyroptosis Acta Pharmaceutica Sinica B 2021 11 9 2768 2782 10.1016/j.apsb.2021.02.006 34589396 PMC8463274 185. Bai Z Liu W He D Protective effects of autophagy and NFE2L2 on reactive oxygen species-induced pyroptosis of human nucleus pulposus cells Aging 2020 12 8 7534 7548 10.18632/aging.103109 32320383 PMC7202523 186. Ma H Xie C Chen Z MFG-E8 alleviates intervertebral disc degeneration by suppressing pyroptosis and extracellular matrix degradation in nucleus pulposus cells via Nrf2/TXNIP/NLRP3 axis Cell Death Discovery 2022 8 1 209 10.1038/s41420-022-01002-8 35440086 PMC9018842 187. Chen Y Luo X Xu B Bao X Jia H Yu B Oxidative Stress-Mediated Programmed Cell Death: a Potential Therapy Target for Atherosclerosis Cardiovasc Drugs Ther 2024 38 4 819 832 10.1007/s10557-022-07414-z 36522550 188. Ma Z Tang P Dong W SIRT1 alleviates IL-1β induced nucleus pulposus cells pyroptosis via mitophagy in intervertebral disc degeneration Int immunopharmacol 2022 107 108671 10.1016/j.intimp.2022.108671 35305383 189. Tian K Yang Y Zhou K The role of ROS-induced pyroptosis in CVD Frontiers in Cardiovascular Medicine 2023 10 1116509 10.3389/fcvm.2023.1116509 36873396 PMC9978107 190. Zhao Y Liu B Xu L ROS-Induced mtDNA Release: the Emerging Messenger for Communication between Neurons and Innate Immune Cells during Neurodegenerative Disorder Progression Antioxidants 2021 10 12 1917 34943020 10.3390/antiox10121917 PMC8750316 191. Lu P Zheng H Liu C Duan L Sun T Mitochondrial DNA induces nucleus pulposus cell pyroptosis via the TLR9-NF-κB-NLRP3 axis J Transl Med 2023 21 1 389 10.1186/s12967-023-04266-5 37322517 PMC10273761 192. Choi EH Park SJ TXNIP: a key protein in the cellular stress response pathway and a potential therapeutic target Exp Mol Med 2023 55 7 1348 1356 10.1038/s12276-023-01019-8 37394581 PMC10393958 193. Ma M Zhang C Zhong Z siRNA incorporated in slow-release injectable hydrogel continuously silences DDIT4 and regulates nucleus pulposus cell pyroptosis through the ROS/TXNIP/NLRP3 axis to alleviate intervertebral disc degeneration Bone & Joint Research 2024 13 5 247 260 10.1302/2046-3758.135.BJR-2023-0320.R1 38771134 PMC11107476 194. Wu J Han W Zhang Y Glutamine Mitigates Oxidative Stress-Induced Matrix Degradation, Ferroptosis, and Pyroptosis in Nucleus Pulposus Cells via Deubiquitinating and Stabilizing Nrf2 Antioxid. Redox Signaling 2024 41 4–6 278 295 10.1089/ars.2023.0384 38504579 195. Li T Yang J Tan A Chen H Irisin suppresses pancreatic β cell pyroptosis in T2DM by inhibiting the NLRP3-GSDMD pathway and activating the Nrf2-TrX/TXNIP signaling axis Diabetol Metab Syndr 2023 15 1 239 10.1186/s13098-023-01216-5 37993958 PMC10664367 196. Li Z Deng H Guo X Effective dose/duration of natural flavonoid quercetin for treatment of diabetic nephropathy: a systematic review and meta-analysis of rodent data Phytomedicine: International Journal of Phytotherapy and Phytopharmacology 2022 105 154348 10.1016/j.phymed.2022.154348 35908521 197. Jin X Fu W Zhou J Shuai N Yang Y Wang B Oxymatrine attenuates oxidized low‑density lipoprotein‑induced HUVEC injury by inhibiting NLRP3 inflammasome‑mediated pyroptosis via the activation of the SIRT1/Nrf2 signaling pathway IntJ Mol Med 2021 48 4 10.3892/ijmm.2021.5020 PMC8416146 34368883 198. Lei G Zhuang L Gan B Targeting ferroptosis as a vulnerability in cancer Nat Rev Cancer 2022 22 7 381 396 10.1038/s41568-022-00459-0 35338310 PMC10243716 199. Hu Y He B Cao Q Crosstalk of ferroptosis and oxidative stress in infectious diseases Front Mol Biosci 2023 10 1315935 10.3389/fmolb.2023.1315935 38131014 PMC10733455 200. Galaris D Barbouti A Pantopoulos K Iron homeostasis and oxidative stress: an intimate relationship Biochim Biophys Acta Mol Cell Res 2019 1866 12 118535 10.1016/j.bbamcr.2019.118535 31446062 201. Yang Y Wu Q Shan X Ginkgolide B attenuates cerebral ischemia-reperfusion injury via inhibition of ferroptosis through disrupting NCOA4-FTH1 interaction J Ethnopharmacol 2024 318 Pt B 116982 10.1016/j.jep.2023.116982 37532074 202. Liu Y Jiang Y Zhang L Cheng W GPX4: the hub of lipid oxidation, ferroptosis, disease and treatment Biochim. Biophys. Acta, Rev. Cancer 2023 1878 3 188890 10.1016/j.bbcan.2023.188890 37001616 203. Rudeck M Volk T Sitte N Grune T Ferritin oxidation in vitro: implication of iron release and degradation by the 20S proteasome IUBMB Life 2000 49 5 451 456 10.1080/152165400410317 10902578 204. Yang RZ Xu WN Zheng HL Involvement of oxidative stress-induced annulus fibrosus cell and nucleus pulposus cell ferroptosis in intervertebral disc degeneration pathogenesis J Cell Physiol 2021 236 4 2725 2739 10.1002/jcp.30039 32892384 PMC7891651 205. Yang X Chen Y Guo J Polydopamine Nanoparticles Targeting Ferroptosis Mitigate Intervertebral Disc Degeneration Via Reactive Oxygen Species Depletion, Iron Ions Chelation, and GPX4 Ubiquitination Suppression Advanced Science (Weinheim, Baden-Wurttemberg, Germany) 2023 10 13 e2207216 10.1002/advs.202207216 36951540 PMC10161035 206. Wang W Jing X Du T Iron overload promotes intervertebral disc degeneration via inducing oxidative stress and ferroptosis in endplate chondrocytes Free Radic Biol Med 2022 190 234 246 10.1016/j.freeradbiomed.2022.08.018 35981695 207. Ganz T Systemic iron homeostasis Physiol Rev 2013 93 4 1721 1741 10.1152/physrev.00008.2013 24137020 208. Lu S Song Y Luo R Ferroportin-Dependent Iron Homeostasis Protects against Oxidative Stress-Induced Nucleus Pulposus Cell Ferroptosis and Ameliorates Intervertebral Disc Degeneration In Vivo Oxid Med Cell Longev 2021 2021 6670497 10.1155/2021/6670497 33628376 PMC7889334 209. Wang H Liu X Yang H Activation of the Nrf-2 pathway by pinocembrin safeguards vertebral endplate chondrocytes against apoptosis and degeneration caused by oxidative stress Life Sci 2023 333 122162 10.1016/j.lfs.2023.122162 37820754 210. Zhu J Sun R Yan C Hesperidin mitigates oxidative stress-induced ferroptosis in nucleus pulposus cells via Nrf2/NF-κB axis to protect intervertebral disc from degeneration Cell Cycle (Georgetown, Tex) 2023 22 10 1196 1214 10.1080/15384101.2023.2200291 37055945 PMC10193898 211. Li C Zhang Y Deng Y Fisetin suppresses ferroptosis through Nrf2 and attenuates intervertebral disc degeneration in rats Eur J Pharmacol 2024 964 176298 10.1016/j.ejphar.2023.176298 38145645 212. Zhu J Sun R Sun K The deubiquitinase USP11 ameliorates intervertebral disc degeneration by regulating oxidative stress-induced ferroptosis via deubiquitinating and stabilizing Sirt3 Redox Biol 2023 62 102707 10.1016/j.redox.2023.102707 37099926 PMC10149406 213. Di Micco R Krizhanovsky V Baker D d’Adda Di Fagagna F d’Adda di Fagagna F: cellular senescence in ageing: from mechanisms to therapeutic opportunities Nat Rev Mol Cell Biol 2021 22 2 75 95 10.1038/s41580-020-00314-w 33328614 PMC8344376 214. Kim KW Chung HN Ha KY Lee JS Kim YY Senescence mechanisms of nucleus pulposus chondrocytes in human intervertebral discs Spine J 2009 9 8 658 666 10.1016/j.spinee.2009.04.018 19540815 215. Wang F Shi R Wang XH Wu XT Wu X-T Aging and age related stresses: a senescence mechanism of intervertebral disc degeneration Osteoarthritis Cartilage 2016 24 3 398 408 10.1016/j.joca.2015.09.019 26455958 216. Beck J Turnquist C Horikawa I Harris C Targeting cellular senescence in cancer and aging: roles of p53 and its isoforms Carcinogenesis 2020 41 8 1017 1029 10.1093/carcin/bgaa071 32619002 PMC7422622 217. Bhattacharyya S Dudeja PK Tobacman JK ROS, Hsp27, and IKKbeta mediate dextran sodium sulfate (DSS) activation of IkappaBa, NFkappaB, and IL-8 Inflammatory Bowel Diseases 2009 15 5 673 683 10.1002/ibd.20821 19085995 PMC2688460 218. Li P Gan Y Wang L 17beta-estradiol Attenuates TNF-α-Induced Premature Senescence of Nucleus Pulposus Cells through Regulating the ROS/NF-κB Pathway Int J Bio Sci 2017 13 2 145 156 10.7150/ijbs.16770 28255267 PMC5332869 219. Han Y Zhou CM Shen H Attenuation of ataxia telangiectasia mutated signalling mitigates age-associated intervertebral disc degeneration Aging Cell 2020 19 7 e13162 10.1111/acel.13162 32567210 PMC7406969 220. Fruman DA Chiu H Hopkins BD Bagrodia S Cantley LC Abraham RT The PI3K Pathway in Human Disease Cell 2017 170 4 605 635 10.1016/j.cell.2017.07.029 28802037 PMC5726441 221. Zhang Y Liu L Qi Y Lactic acid promotes nucleus pulposus cell senescence and corresponding intervertebral disc degeneration via interacting with Akt Cellular and Molecular Life Sciences: CMLS 2024 81 1 24 10.1007/s00018-023-05094-y 38212432 PMC11071984 222. Yao C Guo G Huang R Manual therapy regulates oxidative stress in aging rat lumbar intervertebral discs through the SIRT1/FOXO1 pathway Aging 2022 14 5 2400 2417 10.18632/aging.203949 35289767 PMC8954973 223. Song Y Wang Z Liu L Qian Y Zhang H Qian Y 1,4-Dihydropyridine (DHP) suppresses against oxidative stress in nucleus pulposus via activating sirtuin-1 Biomed Pharmacother 2020 121 109592 10.1016/j.biopha.2019.109592 31706101 224. Wang J Nisar M Huang C Small molecule natural compound agonist of SIRT3 as a therapeutic target for the treatment of intervertebral disc degeneration Exp Mol Med 2018 50 11 1 14 10.1038/s12276-018-0173-3 PMC6232087 30420619 225. Shen J Lan Y Ji Z Liu H Sirtuins in intervertebral disc degeneration: current understanding Molecular Medicine (Cambridge, Mass) 2024 30 1 44 10.1186/s10020-024-00811-0 38553713 PMC10981339 226. Yang M Peng Y Liu W Zhou M Meng Q Yuan C Sirtuin 2 expression suppresses oxidative stress and senescence of nucleus pulposus cells through inhibition of the p53/p21 pathway Biochem Biophys Res Commun 2019 513 3 616 622 10.1016/j.bbrc.2019.03.200 30981502 227. Debnath J Gammoh N Ryan KM Autophagy and autophagy-related pathways in cancer Nat Rev Mol Cell Biol 2023 24 8 560 575 10.1038/s41580-023-00585-z 36864290 PMC9980873 228. Gruber HE Hoelscher GL Ingram JA Bethea S Hanley Jr EN Autophagy in the Degenerating Human Intervertebral Disc: in Vivo Molecular and Morphological Evidence, and Induction of Autophagy in Cultured Annulus Cells Exposed to Proinflammatory Cytokines-Implications for Disc Degeneration Spine 2015 40 11 773 782 10.1097/BRS.0000000000000865 26091153 229. Ye W Xu K Huang D Age-related increases of macroautophagy and chaperone-mediated autophagy in rat nucleus pulposus Connective Tissue Res 2011 52 6 472 478 10.3109/03008207.2011.564336 21591930 230. Filomeni G De Zio D Cecconi F Oxidative stress and autophagy: the clash between damage and metabolic needs Cell Death Differ 2015 22 3 377 388 10.1038/cdd.2014.150 25257172 PMC4326572 231. Gu Y Han J Jiang C Zhang Y Biomarkers, oxidative stress and autophagy in skin aging Ageing Res Rev 2020 59 101036 10.1016/j.arr.2020.101036 32105850 232. Xu K He Y Moqbel SAA Zhou X Wu L Bao J SIRT3 ameliorates osteoarthritis via regulating chondrocyte autophagy and apoptosis through the PI3K/Akt/mTOR pathway Int J Biol Macromol 2021 175 351 360 10.1016/j.ijbiomac.2021.02.029 33556400 233. Li Y Mei J Wu W High fat diet-induced obesity leads to depressive and anxiety-like behaviors in mice via AMPK/mTOR-mediated autophagy Exp Neurol 2022 348 113949 10.1016/j.expneurol.2021.113949 34902357 234. Zhang Q Wang X Cao S Berberine represses human gastric cancer cell growth in vitro and in vivo by inducing cytostatic autophagy via inhibition of MAPK/mTOR/p70S6K and Akt signaling pathways Biomed Pharmacother 2020 128 110245 10.1016/j.biopha.2020.110245 32454290 235. Li Z Wang J Deng X Huang D Shao Z Ma K Compression stress induces nucleus pulposus cell autophagy by inhibition of the PI3K/AKT/mTOR pathway and activation of the JNK pathway Connective Tissue Res 2021 62 3 337 349 10.1080/03008207.2020.1736578 32180463 236. Zhang S Liang W Abulizi Y Quercetin Alleviates Intervertebral Disc Degeneration by Modulating p38 MAPK-Mediated Autophagy Biomed Res. Int 2021 2021 1 6631562 10.1155/2021/6631562 34055990 PMC8133869 237. Xie C Shi Y Chen Z Apigenin Alleviates Intervertebral Disc Degeneration via Restoring Autophagy Flux in Nucleus Pulposus Cells Front Cell Develop Biol 2021 9 787278 10.3389/fcell.2021.787278 PMC8795835 35096819 238. Chen K Lv X Li W Yu F Lin J Xiao D Autophagy Is a Protective Response to the Oxidative Damage to Endplate Chondrocytes in Intervertebral Disc: implications for the Treatment of Degenerative Lumbar Disc Oxid Med Cell Longev 2017 2017 1 4041768 10.1155/2017/4041768 28321270 PMC5340961 239. Tong T Liu Z Zhang H Age-dependent expression of the vitamin D receptor and the protective effect of vitamin D receptor activation on H(2)O(2)-induced apoptosis in rat intervertebral disc cells J Steroid Biochem Mol Biol 2019 190 126 138 10.1016/j.jsbmb.2019.03.013 30905826 240. Picca A Faitg J Ferrucci L D’Amico D D’Amico D Mitophagy in human health, ageing and disease Nat Metab 2023 5 12 2047 2061 10.1038/s42255-023-00930-8 38036770 PMC12159423 241. Xu WN Yang RZ Zheng HL Yu W Zheng XF Li B PGC-1α acts as an mediator of Sirtuin2 to protect annulus fibrosus from apoptosis induced by oxidative stress through restraining mitophagy Int J Biol Macromol 2019 136 1007 1017 10.1016/j.ijbiomac.2019.06.163 31238070 242. Hu S Zhang C Qian T Bai Y Wang X Jin H Promoting Nrf2/Sirt3-Dependent Mitophagy Suppresses Apoptosis in Nucleus Pulposus Cells and Protects against Intervertebral Disc Degeneration Oxid Med Cell Longev 2021 2021 1 6694964 10.1155/2021/6694964 34211633 PMC8211502 243. Zhao Y Simon M Seluanov A Gorbunova V DNA damage and repair in age-related inflammation Nat Rev Immunol 2023 23 2 75 89 10.1038/s41577-022-00751-y 35831609 PMC10106081 244. Ansari MY Ahmad N Haqqi TM Oxidative stress and inflammation in osteoarthritis pathogenesis: role of polyphenols Biomed Pharmacother 2020 129 110452 10.1016/j.biopha.2020.110452 32768946 PMC8404686 245. Cheng X Lin J Chen Z CB2-mediated attenuation of nucleus pulposus degeneration via the amelioration of inflammation and oxidative stress in vivo and in vitro Molecular Medicine (Cambridge, Mass) 2021 27 1 92 10.1186/s10020-021-00351-x 34412587 PMC8377943 246. Lin Q Li S Jiang N PINK1-parkin pathway of mitophagy protects against contrast-induced acute kidney injury via decreasing mitochondrial ROS and NLRP3 inflammasome activation Redox Biol 2019 26 101254 10.1016/j.redox.2019.101254 31229841 PMC6597739 247. Wan L Bai X Zhou Q The advanced glycation end-products (AGEs)/ROS/NLRP3 inflammasome axis contributes to delayed diabetic corneal wound healing and nerve regeneration Int J Bio Sci 2022 18 2 809 825 10.7150/ijbs.63219 35002527 PMC8741862 248. Xu G Lu X Liu S MSC-Derived Exosomes Ameliorate Intervertebral Disc Degeneration By Regulating the Keap1/Nrf2 Axis Stem Cell Rev Rep 2023 19 7 2465 2480 10.1007/s12015-023-10570-w 37528254 249. Wang H Jiang Z Pang Z Zhou T Gu Y Acacetin Alleviates Inflammation and Matrix Degradation in Nucleus Pulposus Cells and Ameliorates Intervertebral Disc Degeneration in vivo Drug Des Devel Ther 2020 14 4801 4813 10.2147/DDDT.S274812 PMC7667005 33204066 250. Xie T Gu X Pan R Huang W Dong S Evodiamine ameliorates intervertebral disc degeneration through the Nrf2 and MAPK pathways Cytotechnology 2024 76 2 153 166 10.1007/s10616-023-00605-y 38495298 PMC10940566 251. Lu G Zhang C Li K Fu M Lyu C Quan Z Sinomenine Ameliorates IL-1β-Induced Intervertebral Disc Degeneration in Rats Through Suppressing Inflammation and Oxidative Stress via Keap1/Nrf2/NF-κB Signaling Pathways J Inflamm Res 2023 16 4777 4791 10.2147/JIR.S430423 37881650 PMC10596063 252. Zhao K An R Xiang Q Acid-sensing ion channels regulate nucleus pulposus cell inflammation and pyroptosis via the NLRP3 inflammasome in intervertebral disc degeneration Cell Proliferation 2021 54 1 e12941 10.1111/cpr.12941 33111436 PMC7791185 253. Yu H Zhang Z Wei F Hydroxytyrosol Ameliorates Intervertebral Disc Degeneration and Neuropathic Pain by Reducing Oxidative Stress and Inflammation Oxid Med Cell Longev 2022 2022 1 2240894 10.1155/2022/2240894 36388163 PMC9646310 254. Chen D Jiang X Zou H hASCs-derived exosomal miR-155-5p targeting TGFβR2 promotes autophagy and reduces pyroptosis to alleviate intervertebral disc degeneration Journal of Orthopaedic Translation 2023 39 163 176 10.1016/j.jot.2023.02.004 36950198 PMC10025964 255. Cao G Yang S Cao J The Role of Oxidative Stress in Intervertebral Disc Degeneration Oxid Med Cell Longev 2022 2022 1 2166817 10.1155/2022/2166817 35069969 PMC8769842 256. Zhang HJ Liao HY Bai DY Wang ZQ Xie XW MAPK /ERK signaling pathway: a potential target for the treatment of intervertebral disc degeneration Biomed Pharmacother 2021 143 112170 10.1016/j.biopha.2021.112170 34536759 257. Cannizzo ES Clement CC Morozova K Age-related oxidative stress compromises endosomal proteostasis Cell Rep 2012 2 1 136 149 10.1016/j.celrep.2012.06.005 22840404 PMC3408590 258. Wu Z Zhang W Qu J Liu GH Emerging epigenetic insights into aging mechanisms and interventions Trends Pharmacol Sci 2024 45 2 157 172 10.1016/j.tips.2023.12.002 38216430 259. Gu M Ren B Fang Y Epigenetic regulation in cancer MedComm 2024 5 2 e495 10.1002/mco2.495 38374872 PMC10876210 260. Hogg SJ Beavis PA Dawson MA Johnstone RW Targeting the epigenetic regulation of antitumour immunity Nat Rev Drug Discov 2020 19 11 776 800 10.1038/s41573-020-0077-5 32929243 261. Younesian S Yousefi AM Ghaffari SH Bashash D Bashash D The DNA Methylation in Neurological Diseases Cells 2022 11 21 10.3390/cells11213439 PMC9657829 36359835 262. Yousefi PD Suderman M Langdon R Whitehurst O Davey Smith G Relton CL DNA methylation-based predictors of health: applications and statistical considerations Nat Rev Genet 2022 23 6 369 383 10.1038/s41576-022-00465-w 35304597 263. Mattei AL Bailly N Meissner A DNA methylation: a historical perspective Trends in Genetics: TIG 2022 38 7 676 707 10.1016/j.tig.2022.03.010 35504755 264. Guillaumet-Adkins A Yañez Y Peris-Diaz MD Calabria I Palanca-Ballester C Sandoval J Epigenetics and Oxidative Stress in Aging Oxid Med Cell Longev 2017 2017 1 9175806 10.1155/2017/9175806 28808499 PMC5541801 265. Sundar V Ramasamy T Doke M Samikkannu T Psychostimulants influence oxidative stress and redox signatures: the role of DNA methylation Redox Report: Communications in Free Radical Research 2022 27 1 53 59 10.1080/13510002.2022.2043224 35227168 PMC8890556 266. Cyr AR Hitchler MJ Domann FE Regulation of SOD2 in cancer by histone modifications and CpG methylation: closing the loop between redox biology and epigenetics Antioxid. Redox Signaling 2013 18 15 1946 1955 10.1089/ars.2012.4850 PMC3624766 22946823 267. Chen X Zhang R Yu C Identification of HPCAL1 as a specific autophagy receptor involved in ferroptosis Autophagy 2023 19 1 54 74 10.1080/15548627.2022.2059170 35403545 PMC9809962 268. Nemeth E Ganz T Hepcidin-Ferroportin Interaction Controls Systemic Iron Homeostasis Int J Mol Sci 2021 22 12 6493 10.3390/ijms22126493 34204327 PMC8235187 269. Chen J Yang X Li Q Inhibiting DNA methyltransferase DNMT3B confers protection against ferroptosis in nucleus pulposus and ameliorates intervertebral disc degeneration via upregulating SLC40A1 Free Radic Biol Med 2024 220 139 153 10.1016/j.freeradbiomed.2024.05.007 38705495 270. Cheng P Wei HZ Chen HW Wang ZQ Mao P Zhang HH DNMT3a-mediated methylation of PPARγ promote intervertebral disc degeneration by regulating the NF-κB pathway J Cell & Mol Med 2024 28 2 e18048 10.1111/jcmm.18048 37986543 PMC10826446 271. Nagaraju GP Dariya B Kasa P Peela S El-Rayes BF Epigenetics in hepatocellular carcinoma Semi Cancer Biol 2022 86 Pt 3 622 632 10.1016/j.semcancer.2021.07.017 34324953 272. Bajbouj K Al-Ali A Ramakrishnan RK Saber-Ayad M Hamid Q Histone Modification in NSCLC: molecular Mechanisms and Therapeutic Targets Int J Mol Sci 2021 22 21 11701 10.3390/ijms222111701 34769131 PMC8584007 273. Ito F Yamada Y Shigemitsu A Role of Oxidative Stress in Epigenetic Modification in Endometriosis Reproductive Sciences (Thousand Oaks, Calif) 2017 24 11 1493 1502 10.1177/1933719117704909 28443478 274. Zheng X Sawalha AH The Role of Oxidative Stress in Epigenetic Changes Underlying Autoimmunity Antioxid. Redox Signaling 2022 36 7–9 423 440 10.1089/ars.2021.0066 PMC8982122 34544258 275. Chen Q Yang B Liu X Zhang XD Zhang L Liu T Histone acetyltransferases CBP/p300 in tumorigenesis and CBP/p300 inhibitors as promising novel anticancer agents Theranostics 2022 12 11 4935 4948 10.7150/thno.73223 35836809 PMC9274749 276. Haque ME Jakaria M Akther M Cho DY Kim IS Choi DK The GCN5: its biological functions and therapeutic potentials Clinical Science (London, England: 1979) 2021 135 1 231 257 10.1042/CS20200986 33443284 277. Mir US Bhat A Mushtaq A Pandita S Altaf M Pandita TK Role of histone acetyltransferases MOF and Tip60 in genome stability DNA Repair 2021 107 103205 10.1016/j.dnarep.2021.103205 34399315 278. Vasudevarao MD Mizar P Kumari S Naphthoquinone-mediated inhibition of lysine acetyltransferase KAT3B/p300, basis for non-toxic inhibitor synthesis J Biol Chem 2014 289 11 7702 7717 10.1074/jbc.M113.486522 24469461 PMC3953281 279. Hou H Yu H Structural insights into histone lysine demethylation Curr Opin Struct Biol 2010 20 6 739 748 10.1016/j.sbi.2010.09.006 20970991 PMC3010374 280. Yang J Chen S Yang Y Jumonji domain-containing protein 6 protein and its role in cancer Cell Proliferation 2020 53 2 e12747 10.1111/cpr.12747 31961032 PMC7046477 281. Niu Y DesMarais TL Tong Z Yao Y Costa M Oxidative stress alters global histone modification and DNA methylation Free Radic Biol Med 2015 82 22 28 10.1016/j.freeradbiomed.2015.01.028 25656994 PMC4464695 282. Polytarchou C Pfau R Hatziapostolou M Tsichlis PN The JmjC domain histone demethylase Ndy1 regulates redox homeostasis and protects cells from oxidative stress Mol Cell Biol 2008 28 24 7451 7464 10.1128/MCB.00688-08 18838535 PMC2593427 283. García-Giménez JL Garcés C Romá-Mateo C Pallardó FV Oxidative stress-mediated alterations in histone post-translational modifications Free Radic Biol Med 2021 170 6 18 10.1016/j.freeradbiomed.2021.02.027 33689846 284. Liu M Zhang Y Yang J ZIP4 Increases Expression of Transcription Factor ZEB1 to Promote Integrin α3β1 Signaling and Inhibit Expression of the Gemcitabine Transporter ENT1 in Pancreatic Cancer Cells Gastroenterology 2020 158 3 679 692.e671 10.1053/j.gastro.2019.10.038 31711924 PMC7837454 285. Shen M Li K Wang L ZIP4 upregulation aggravates nucleus pulposus cell degradation by promoting inflammation and oxidative stress by mediating the HDAC4-FoxO3a axis Aging 2024 16 1 685 700 10.18632/aging.205412 38217540 PMC10817398 286. Winkle M El-Daly SM Fabbri M Calin GA Noncoding RNA therapeutics - challenges and potential solutions Nat Rev Drug Discov 2021 20 8 629 651 10.1038/s41573-021-00219-z 34145432 PMC8212082 287. Guo HY Guo MK Wan ZY Song F Wang H-Q Wang HQ: emerging evidence on noncoding-RNA regulatory machinery in intervertebral disc degeneration: a narrative review Arthritis Res Therapy 2020 22 1 270 10.1186/s13075-020-02353-2 PMC7667735 33198793 288. Li H Tian L Li J The Roles of circRNAs in Intervertebral Disc Degeneration: inflammation, Extracellular Matrix Metabolism, and Apoptosis Analytical Cellular Pathology (Amsterdam) 2022 2022 9550499 10.1155/2022/9550499 35186669 PMC8856834 289. Li G Ma L He S WTAP-mediated m(6)A modification of lncRNA NORAD promotes intervertebral disc degeneration Nat Commun 2022 13 1 1469 10.1038/s41467-022-28990-6 35304463 PMC8933458 290. Xu X Shen L Qu Y Experimental validation and comprehensive analysis of m6A methylation regulators in intervertebral disc degeneration subpopulation classification Sci Rep 2024 14 1 8417 10.1038/s41598-024-58888-w 38600232 PMC11006851 291. Chen Z Song J Xie L N6-methyladenosine hypomethylation of circGPATCH2L regulates DNA damage and apoptosis through TRIM28 in intervertebral disc degeneration Cell Death Differ 2023 30 8 1957 1972 10.1038/s41418-023-01190-5 37438603 PMC10406905 292. Colella F Garcia JP Sorbona M Drug delivery in intervertebral disc degeneration and osteoarthritis: selecting the optimal platform for the delivery of disease-modifying agents Journal of Controlled Release: Official Journal of the Controlled Release Society 2020 328 985 999 10.1016/j.jconrel.2020.08.041 32860929 293. Guo Z Ye J Cheng X Nanodrug Delivery Systems in Antitumor Immunotherapy Biomater Res 2024 28 0015 10.34133/bmr.0015 38840653 PMC11045275 294. Zhou D Zhou F Sheng S Wei Y Chen X Su J Intra-articular nanodrug delivery strategies for treating osteoarthritis Drug Discovery Today 2023 28 3 103482 10.1016/j.drudis.2022.103482 36584875 295. Guterl CC See EY Blanquer SB Challenges and strategies in the repair of ruptured annulus fibrosus Eur Cells Mater 2013 25 1 21 10.22203/eCM.v025a01 PMC3655691 23283636 296. Krut Z Pelled G Gazit D Gazit Z Stem Cells and Exosomes: new Therapies for Intervertebral Disc Degeneration Cells 2021 10 9 2241 10.3390/cells10092241 34571890 PMC8471333 297. Fan D Cao Y Cao M Wang Y Cao Y Gong T Nanomedicine in cancer therapy Signal Transduction and Targeted Therapy 2023 8 1 293 37544972 10.1038/s41392-023-01536-y PMC10404590 298. Cheng J Huang H Chen Y Wu R Nanomedicine for Diagnosis and Treatment of Atherosclerosis Advanced Science (Weinheim, Baden-Wurttemberg, Germany) 2023 10 36 e2304294 10.1002/advs.202304294 37897322 PMC10754137 299. Hu Y Yang R Liu S Song Z Wang H The Emerging Roles of Nanocarrier Drug Delivery System in Treatment of Intervertebral Disc Degeneration-Current Knowledge, Hot Spots, Challenges and Future Perspectives Drug Des Devel Ther 2024 18 1007 1022 10.2147/DDDT.S448807 PMC10986407 38567254 300. Qiu Z Xu T Wang L Meng N Jin H Xu B Novel Nano-Drug Delivery System for Brain Tumor Treatment Cells 2022 11 23 3761 10.3390/cells11233761 36497021 PMC9737081 301. Jiang Y Li W Wang Z Lu J Lipid-Based Nanotechnology: liposome Pharmaceutics 2023 16 1 34 10.3390/pharmaceutics16010034 38258045 PMC10820119 302. Beach MA Nayanathara U Gao Y Polymeric Nanoparticles for Drug Delivery Chem Rev 2024 124 9 5505 5616 10.1021/acs.chemrev.3c00705 38626459 PMC11086401 303. Floyd TG Gurnani P Rho JY Characterisation of polymeric nanoparticles for drug delivery Nanoscale 2025 17 13 7738 7752 10.1039/D5NR00071H 40018862 304. Luther DC Huang R Jeon T Delivery of drugs, proteins, and nucleic acids using inorganic nanoparticles Adv. Drug Delivery Rev 2020 156 188 213 10.1016/j.addr.2020.06.020 PMC8559718 32610061 305. Ghezzi M Pescina S Padula C Polymeric micelles in drug delivery: an insight of the techniques for their characterization and assessment in biorelevant conditions J Control Release 2021 332 312 336 10.1016/j.jconrel.2021.02.031 33652113 306. Perumal S Atchudan R Lee W A Review of Polymeric Micelles and Their Applications Polymers 2022 14 12 2510 10.3390/polym14122510 35746086 PMC9230755 307. Hiwrale A Bharati S Pingale P Rajput A Nanofibers: a current era in drug delivery system Heliyon 2023 9 9 e18917 10.1016/j.heliyon.2023.e18917 37674834 PMC10477438 308. Zhou S Zhang M Wang J Chen X Xu Z Yan Y Nanofibers in Glioma Therapy: advances, Applications, and Overcoming Challenges Int J Nanomed 2025 20 4677 4703 10.2147/IJN.S510363 PMC12008729 40255668 309. Quazi MZ Park N Nanohydrogels: advanced Polymeric Nanomaterials in the Era of Nanotechnology for Robust Functionalization and Cumulative Applications Int J Mol Sci 2022 23 4 1943 10.3390/ijms23041943 35216058 PMC8875080 310. Liang Y Duan L Lu J Xia J Engineering exosomes for targeted drug delivery Theranostics 2021 11 7 3183 3195 10.7150/thno.52570 33537081 PMC7847680 311. Meng W He C Hao Y Wang L Zhu G Zhu G Prospects and challenges of extracellular vesicle-based drug delivery system: considering cell source Drug Delivery 2020 27 1 585 598 10.1080/10717544.2020.1748758 32264719 PMC7178886 312. Chen Q Qian Q Xu H Mitochondrial-Targeted Metal-Phenolic Nanoparticles to Attenuate Intervertebral Disc Degeneration: alleviating Oxidative Stress and Mitochondrial Dysfunction ACS nano 2024 18 12 8885 8905 10.1021/acsnano.3c12163 38465890 313. Lim S An SB Jung M Local Delivery of Senolytic Drug Inhibits Intervertebral Disc Degeneration and Restores Intervertebral Disc Structure Adv Healthcare Mater 2022 11 2 e2101483 10.1002/adhm.202101483 34699690 314. Wang J Wu R Liu Z Core-Shell Structured Nanozyme with PDA-Mediated Enhanced Antioxidant Efficiency to Treat Early Intervertebral Disc Degeneration ACS Appl Mater Interfaces 2024 16 4 5103 5119 10.1021/acsami.3c15938 38233333 315. Yang W Li K Pan Q An Engineered Bionic Nanoparticle Sponge as a Cytokine Trap and Reactive Oxygen Species Scavenger to Relieve Disc Degeneration and Discogenic Pain ACS nano 2024 18 4 3053 3072 10.1021/acsnano.3c08097 38237054 PMC10832058 316. Zhou T Yang X Chen Z Prussian Blue Nanoparticles Stabilize SOD1 from Ubiquitination-Proteasome Degradation to Rescue Intervertebral Disc Degeneration Advanced Science (Weinheim, Baden-Wurttemberg, Germany) 2022 9 10 e2105466 10.1002/advs.202105466 35128840 PMC8981911 317. Zhou H Qian Q Chen Q Enhanced Mitochondrial Targeting and Inhibition of Pyroptosis with Multifunctional Metallopolyphenol Nanoparticles in Intervertebral Disc Degeneration Small (Weinheim an der Bergstrasse, Germany) 2024 20 13 e2308167 10.1002/smll.202308167 37953455 318. Zhou H He J Liu R Microenvironment-responsive metal-phenolic network release platform with ROS scavenging, anti-pyroptosis, and ECM regeneration for intervertebral disc degeneration Bioact Mater 2024 37 51 71 10.1016/j.bioactmat.2024.02.036 38515609 PMC10954684 319. Yang X Jin L Yao L Shen FH Shimer AL Li X Antioxidative nanofullerol prevents intervertebral disk degeneration Int J Nanomed 2014 9 2419 2430 10.2147/IJN.S60853 PMC4035310 24876775 320. Huang Y Yang J Liu X Cationic Polymer Brush-Modified Carbon Nanotube-Meditated eRNA LINC02569 Silencing Attenuates Nucleus Pulposus Degeneration by Blocking NF-κB Signaling Pathway and Alleviate Cell Senescence Front Cell Develop Biol 2021 9 837777 10.3389/fcell.2021.837777 PMC8802762 35111765 321. Wu S Shi Y Jiang L N-Acetylcysteine-Derived Carbon Dots for Free Radical Scavenging in Intervertebral Disc Degeneration Adv Healthcare Mater 2023 12 24 e2300533 10.1002/adhm.202300533 37256605 322. Sun K Yan C Dai X Catalytic Nanodots-Driven Pyroptosis Suppression in Nucleus Pulposus for Antioxidant Intervention of Intervertebral Disc Degeneration Advanced Materials (Deerfield Beach, Fla) 2024 36 19 e2313248 10.1002/adma.202313248 38299823 323. Shi Y Bu W Chu D Rescuing Nucleus Pulposus Cells from ROS Toxic Microenvironment via Mitochondria-Targeted Carbon Dot-Supported Prussian Blue to Alleviate Intervertebral Disc Degeneration Adv Healthcare Mater 2024 13 8 e2303206 10.1002/adhm.202303206 38224563 324. Yu C Li D Wang C Injectable kartogenin and apocynin loaded micelle enhances the alleviation of intervertebral disc degeneration by adipose-derived stem cell Bioact Mater 2021 6 10 3568 3579 10.1016/j.bioactmat.2021.03.018 33842742 PMC8022109 325. Sun J Yang F Wang L Delivery of coenzyme Q10 loaded micelle targets mitochondrial ROS and enhances efficiency of mesenchymal stem cell therapy in intervertebral disc degeneration Bioact Mater 2023 23 247 260 10.1016/j.bioactmat.2022.10.019 36439087 PMC9676151 326. Yu Q Han F Yuan Z Fucoidan-loaded nanofibrous scaffolds promote annulus fibrosus repair by ameliorating the inflammatory and oxidative microenvironments in degenerative intervertebral discs Acta Biomater 2022 148 73 89 10.1016/j.actbio.2022.05.054 35671874 327. Wu R Huang L Xia Q Injectable mesoporous bioactive glass/sodium alginate hydrogel loaded with melatonin for intervertebral disc regeneration Mater Today Bio 2023 22 100731 10.1016/j.mtbio.2023.100731 PMC10393589 37533731 328. Li M Wu Y Li H Nanofiber reinforced alginate hydrogel for leak-proof delivery and higher stress loading in nucleus pulposus Carbohydr Polym 2023 299 120193 10.1016/j.carbpol.2022.120193 36876807 329. Gan Y Li S Li P A Controlled Release Codelivery System of MSCs Encapsulated in Dextran/Gelatin Hydrogel with TGF- β 3-Loaded Nanoparticles for Nucleus Pulposus Regeneration Stem Cells International 2016 2016 1 9042019 10.1155/2016/9042019 27774108 PMC5059651 330. Zamboni F Ren G Culebras M O’Driscoll J Ryan EJ Collins MN Curcumin encapsulated polylactic acid nanoparticles embedded in alginate/gelatin bioinks for in situ immunoregulation: characterization and biological assessment Int J Biol Macromol 2022 221 1218 1227 10.1016/j.ijbiomac.2022.09.014 36087752 331. Peng Y Chen X Rao Z Multifunctional annulus fibrosus matrix prevents disc-related pain via inhibiting neuroinflammation and sensitization Acta Biomater 2023 170 288 302 10.1016/j.actbio.2023.08.028 37598791 332. Peng Y Chen X Zhang Q Enzymatically Bioactive Nucleus Pulposus Matrix Hydrogel Microspheres for Exogenous Stem Cells Therapy and Endogenous Repair Strategy to Achieve Disc Regeneration Advanced Science (Weinheim, Baden-Wurttemberg, Germany) 2024 11 10 e2304761 10.1002/advs.202304761 38145353 PMC10933624 333. Wang D Zhang L He D A natural hydrogel complex improves intervertebral disc degeneration by correcting fatty acid metabolism and inhibiting nucleus pulposus cell pyroptosis Mater Today Bio 2024 26 101081 10.1016/j.mtbio.2024.101081 PMC11089368 38741924 334. Qingxin S Kai J Dandan Z Programmable DNA hydrogel provides suitable microenvironment for enhancing autophagy-based therapies in intervertebral disc degeneration treatment J Nanobiotechnol 2023 21 1 350 10.1186/s12951-023-02109-5 PMC10537074 37759249 335. Xu B Huang M Li J The MnO(2)/GelMA Composite Hydrogels Improve the ROS Microenvironment of Annulus Fibrosus Cells by Promoting the Antioxidant and Autophagy through the SIRT1/NRF2 Pathway Gels (Basel, Switzerland) 2024 10 5 10.3390/gels10050333 PMC11121468 38786250 336. Li Z Cai F Tang J Oxygen metabolism-balanced engineered hydrogel microspheres promote the regeneration of the nucleus pulposus by inhibiting acid-sensitive complexes Bioact. Mater 2023 24 346 360 36632505 10.1016/j.bioactmat.2022.12.025 PMC9822967 337. Zhou L Cai F Zhu H Immune-defensive microspheres promote regeneration of the nucleus pulposus by targeted entrapment of the inflammatory cascade during intervertebral disc degeneration Bioact Mater 2024 37 132 152 10.1016/j.bioactmat.2024.03.020 38549774 PMC10972768 338. Liu Y Du J Peng P Regulation of the inflammatory cycle by a controllable release hydrogel for eliminating postoperative inflammation after discectomy Bioact Mater 2021 6 1 146 157 10.1016/j.bioactmat.2020.07.008 32817921 PMC7426539 339. Nair MB Baranwal G Vijayan P Keyan KS Jayakumar R Composite hydrogel of chitosan-poly(hydroxybutyrate-co-valerate) with chondroitin sulfate nanoparticles for nucleus pulposus tissue engineering Colloids Surf. B 2015 136 84 92 10.1016/j.colsurfb.2015.08.026 26363270 340. Yang L Yu C Fan X Dual-dynamic-bond cross-linked injectable hydrogel of multifunction for intervertebral disc degeneration therapy J Nanobiotechnol 2022 20 1 433 10.1186/s12951-022-01633-0 PMC9526989 36182921 341. Nezadi M Keshvari H Shokrolahi F Shokrollahi P Injectable, self-healing hydrogels based on gelatin, quaternized chitosan, and laponite as localized celecoxib delivery system for nucleus pulpous repair Int J Biol Macromol 2024 266 Pt 2 131337 38574911 10.1016/j.ijbiomac.2024.131337 342. Zheng Q Shen H Tong Z A thermosensitive, reactive oxygen species-responsive, MR409-encapsulated hydrogel ameliorates disc degeneration in rats by inhibiting the secretory autophagy pathway Theranostics 2021 11 1 147 163 10.7150/thno.47723 33391467 PMC7681093 343. Yu H Teng Y Ge J Isoginkgetin-loaded reactive oxygen species scavenging nanoparticles ameliorate intervertebral disc degeneration via enhancing autophagy in nucleus pulposus cells J Nanobiotechnol 2023 21 1 99 10.1186/s12951-023-01856-9 PMC10029295 36941611 344. Bai J Zhang Y Fan Q Reactive Oxygen Species-Scavenging Scaffold with Rapamycin for Treatment of Intervertebral Disk Degeneration Adv. Healthcare Mater 2020 9 3 e1901186 10.1002/adhm.201901186 31820852 345. Feng Y Su L Chen Z Accurate Spatio-Temporal Delivery of Nitric Oxide Facilitates the Programmable Repair of Avascular Dense Connective Tissues Injury Adv Healthc Mater 2024 13 14 e2303740 10.1002/adhm.202303740 38413194 346. Wang W Xiao B Qiu Y pH-Responsive Delivery of H2 through Ammonia Borane-Loaded Hollow Polydopamine for Intervertebral Disc Degeneration Therapy Oxid Med Cell Longev 2023 2023 7773609 10.1155/2023/7773609 36778204 PMC9911255 347. Liu S Li K He Y PGC1α-Inducing Senomorphic Nanotherapeutics Functionalized with NKG2D-Overexpressing Cell Membranes for Intervertebral Disc Degeneration Advanced Science (Weinheim, Baden-Wurttemberg, Germany) 2024 11 22 e2400749 10.1002/advs.202400749 38554394 PMC11165536 348. Zheng D Chen W Chen T Hydrogen Ion Capturing Hydrogel Microspheres for Reversing Inflammaging Advanced Materials (Deerfield Beach, Fla) 2024 36 5 e2306105 10.1002/adma.202306105 37699155 349. Feng G Zha Z Huang Y Sustained and Bioresponsive Two-Stage Delivery of Therapeutic miRNA via Polyplex Micelle-Loaded Injectable Hydrogels for Inhibition of Intervertebral Disc Fibrosis Adv Healthcare Mater 2018 7 21 e1800623 10.1002/adhm.201800623 30296017 350. Xia KS Li DD Wang CG An esterase-responsive ibuprofen nano-micelle pre-modified embryo derived nucleus pulposus progenitor cells promote the regeneration of intervertebral disc degeneration Bioact Mater 2023 21 69 85 10.1016/j.bioactmat.2022.07.024 36017070 PMC9399388 351. Zheng Z Chen A He H pH and enzyme dual-responsive release of hydrogen sulfide for disc degeneration therapy J Mat Chem B 2019 7 4 611 618 10.1039/C8TB02566E 32254794 352. Zhu L Yang Y Yan Z Controlled Release of TGF-β3 for Effective Local Endogenous Repair in IDD Using Rat Model Int J Nanomed 2022 17 2079 2096 10.2147/IJN.S358396 PMC9113136 35592099 353. Wang D Lu K Zou G Wu D Cheng Y Sun Y Attenuating ntervertebral disc degeneration through spermidine-delivery nanoplatform based on polydopamine for persistent regulation of oxidative stress Int J Biol Macromol 2024 274 Pt 1 132881 10.1016/j.ijbiomac.2024.132881 38838900 354. Wang X Yu L Duan J Anti-Stress and Anti-ROS Effects of MnOx-Functionalized Thermosensitive Nanohydrogel Protect BMSCs for Intervertebral Disc Degeneration Repair Adv Healthcare Mater 2024 13 29 e2400343 10.1002/adhm.202400343 38738846 355. Shen J Zhuo N Xu S Song Z Hao J Guo X Resveratrol delivery by ultrasound-mediated nanobubbles targeting nucleus pulposus cells Nanomedicine (London, England) 2018 13 12 1433 1446 10.2217/nnm-2018-0019 29658365 356. Nguyen K Pan HY Haworth K Multiple-Exposure Drug Release from Stable Nanodroplets by High-Intensity Focused Ultrasound for a Potential Degenerative Disc Disease Treatment Ultrasound Med Biol 2019 45 1 160 169 10.1016/j.ultrasmedbio.2018.09.014 30482711 PMC6290355 357. Raza F Evans L Motallebi M Liposome-based diagnostic and therapeutic applications for pancreatic cancer Acta Biomater 2023 157 1 23 10.1016/j.actbio.2022.12.013 36521673 358. Gao Y Liu X Chen N Yang X Tang F Recent Advance of Liposome Nanoparticles for Nucleic Acid Therapy Pharmaceutics 2023 15 1 178 10.3390/pharmaceutics15010178 36678807 PMC9864445 359. Cheng R Liu L Xiang Y Advanced liposome-loaded scaffolds for therapeutic and tissue engineering applications Biomaterials 2020 232 119706 10.1016/j.biomaterials.2019.119706 31918220 360. Chang H Cai F Zhang Y Silencing Gene-Engineered Injectable Hydrogel Microsphere for Regulation of Extracellular Matrix Metabolism Balance Small Methods 2022 6 4 e2101201 10.1002/smtd.202101201 34994105 361. Banala RR Vemuri SK Dar GH Efficiency of dual siRNA-mediated gene therapy for intervertebral disc degeneration (IVDD) Spine J 2019 19 5 896 904 10.1016/j.spinee.2018.10.016 30439528 362. Liu X Wang P Zou YX Luo ZG Tamer TM Co-encapsulation of Vitamin C and β-Carotene in liposomes: storage stability, antioxidant activity, and in vitro gastrointestinal digestion Food Research International (Ottawa, Ont) 2020 136 109587 10.1016/j.foodres.2020.109587 32846615 363. Stone WL Mukherjee S Smith M Das SK Therapeutic uses of antioxidant liposomes Methods in Molecular Biology (Clifton, NJ) 2002 199 145 161 10.1385/1-59259-175-2:145 PMC7122272 12094566 364. Wang L Wang L Wang X Lu B Zhang J Preparation of blueberry anthocyanin liposomes and changes of vesicle properties, physicochemical properties, in vitro release, and antioxidant activity before and after chitosan modification Food Sci Nutr 2022 10 1 75 87 10.1002/fsn3.2649 35035911 PMC8751427 365. Xu T Zhang J Jin R Wang X Yuan C Physicochemical properties, antioxidant activities and in vitro sustained release behaviour of co-encapsulated liposomes as vehicle for vitamin E and β-carotene J Sci Food Agric 2022 102 13 5759 5767 10.1002/jsfa.11925 35398898 366. Zhao G Hu C Xue Y In vitro evaluation of chitosan-coated liposome containing both coenzyme Q10 and alpha-lipoic acid: cytotoxicity, antioxidant activity, and antimicrobial activity J Cosmet Dermatol 2018 17 2 258 262 10.1111/jocd.12369 28722258 367. Chen J Chen J Yu P A novel quercetin encapsulated glucose modified liposome and its brain-target antioxidative neuroprotection effects Molecules 2024 29 3 607 38338352 10.3390/molecules29030607 PMC10856503 368. Zhang C Hu Y Yuan Y Liposome-embedded SOD attenuated DSS-induced ulcerative colitis in mice by ameliorating oxidative stress and intestinal barrier dysfunction Food Funct 2023 14 9 4392 4405 10.1039/D2FO03312G 37092895 369. Tan C Wang J Sun B Biopolymer-liposome hybrid systems for controlled delivery of bioactive compounds: recent advances Biotechnol Adv 2021 48 107727 10.1016/j.biotechadv.2021.107727 33677025 370. Guimarães D Cavaco-Paulo A Nogueira E Design of liposomes as drug delivery system for therapeutic applications Int J Pharm 2021 601 120571 10.1016/j.ijpharm.2021.120571 33812967 371. Maritim S Boulas P Lin Y Comprehensive analysis of liposome formulation parameters and their influence on encapsulation, stability and drug release in glibenclamide liposomes Int J Pharm 2021 592 120051 10.1016/j.ijpharm.2020.120051 33161039 372. Sarfraz M Afzal A Yang T Development of Dual Drug Loaded Nanosized Liposomal Formulation by A Reengineered Ethanolic Injection Method and Its Pre-Clinical Pharmacokinetic Studies Pharmaceutics 2018 10 3 151 10.3390/pharmaceutics10030151 30200557 PMC6161256 373. Large DE Abdelmessih RG Fink EA Auguste DT Liposome composition in drug delivery design, synthesis, characterization, and clinical application Adv Drug Delivery Rev 2021 176 113851 10.1016/j.addr.2021.113851 34224787 374. Wang C Lan X Zhu L Construction Strategy of Functionalized Liposomes and Multidimensional Application Small (Weinheim an der Bergstrasse, Germany) 2024 20 25 e2309031 10.1002/smll.202309031 38258399 375. Ding Q Tang W Li X Mitochondrial-targeted brequinar liposome boosted mitochondrial-related ferroptosis for promoting checkpoint blockade immunotherapy in bladder cancer Journal of Controlled Release: Official Journal of the Controlled Release Society 2023 363 221 234 10.1016/j.jconrel.2023.09.024 37717657 376. Liu J Wu Z Liu Y ROS-responsive liposomes as an inhaled drug delivery nanoplatform for idiopathic pulmonary fibrosis treatment via Nrf2 signaling J Nanobiotechnol 2022 20 1 213 10.1186/s12951-022-01435-4 PMC9074278 35524280 377. Li Z Zhu H Liu H Synergistic dual cell therapy for atherosclerosis regression: ROS-responsive Bio-liposomes co-loaded with Geniposide and Emodin J Nanobiotechnol 2024 22 1 129 10.1186/s12951-024-02389-5 PMC10962080 38528554 378. Zahednezhad F Saadat M Valizadeh H Zakeri-Milani P Baradaran B Liposome and immune system interplay: challenges and potentials Journal of Controlled Release: Official Journal of the Controlled Release Society 2019 305 194 209 10.1016/j.jconrel.2019.05.030 31121278 379. Tenchov R Curtze AE Zhou Q Zhou Q Lipid Nanoparticles─From Liposomes to mRNA Vaccine Delivery, a Landscape of Research Diversity and Advancement ACS nano 2021 15 11 16982 17015 10.1021/acsnano.1c04996 34181394 380. Strachan JB Dyett BP Nasa Z Valery C Conn CE Toxicity and cellular uptake of lipid nanoparticles of different structure and composition J Colloid Interface Sci 2020 576 241 251 10.1016/j.jcis.2020.05.002 32428785 381. Lv H Zhang S Wang B Cui S Yan J Toxicity of cationic lipids and cationic polymers in gene delivery Journal of Controlled Release: Official Journal of the Controlled Release Society 2006 114 1 100 109 10.1016/j.jconrel.2006.04.014 16831482 382. Knudsen KB Northeved H Kumar PE In vivo toxicity of cationic micelles and liposomes Nanomedicine: Nanotechnology, Biology, and Medicine 2015 11 2 467 477 10.1016/j.nano.2014.08.004 25168934 383. Begines B Ortiz T Pérez-Aranda M Polymeric Nanoparticles for Drug Delivery: recent Developments and Future Prospects Nanomaterials (Basel, Switzerland) 2020 10 7 10.3390/nano10071403 PMC7408012 32707641 384. El-Say KM El-Sawy HS Polymeric nanoparticles: promising platform for drug delivery Int J Pharm 2017 528 1–2 675 691 10.1016/j.ijpharm.2017.06.052 28629982 385. Zhang M Ma H Wang X Yu B Cong H Shen Y Polysaccharide-based nanocarriers for efficient transvascular drug delivery Journal of Controlled Release: Official Journal of the Controlled Release Society 2023 354 167 187 10.1016/j.jconrel.2022.12.051 36581260 386. Barclay TG Day CM Petrovsky N Garg S Review of polysaccharide particle-based functional drug delivery Carbohydr Polym 2019 221 94 112 10.1016/j.carbpol.2019.05.067 31227171 PMC6626612 387. Yuan Q Yuan Y Zheng Y Anti-cerebral ischemia reperfusion injury of polysaccharides: a review of the mechanisms Biomed Pharmacother 2021 137 111303 10.1016/j.biopha.2021.111303 33517189 388. Fang CY Lou DY Zhou LQ Natural products: potential treatments for cisplatin-induced nephrotoxicity Acta Pharmacol Sin 2021 42 12 1951 1969 10.1038/s41401-021-00620-9 33750909 PMC8633358 389. He B Tao H Liu S Wei A Protective effect of carboxymethylated chitosan on hydrogen peroxide-induced apoptosis in nucleus pulposus cells Molecular Medicine Reports 2015 11 3 1629 1638 10.3892/mmr.2014.2942 25394560 PMC4270326 390. Li Y Tian X He W Fucoidan-functionalized gelatin methacryloyl microspheres ameliorate intervertebral disc degeneration by restoring redox and matrix homeostasis of nucleus pulposus Int J Biol Macromol 2023 250 126166 10.1016/j.ijbiomac.2023.126166 37553034 391. Yamamoto T Suzuki S Fujii T Efficacy of hyaluronic acid on intervertebral disc inflammation: an in vitro study using notochordal cell lines and human disc cells J Orthopaedic Res 2021 39 10 2197 2208 10.1002/jor.24933 33251629 392. Vasvani S Kulkarni P Rawtani D Hyaluronic acid: a review on its biology, aspects of drug delivery, route of administrations and a special emphasis on its approved marketed products and recent clinical studies Int J Biol Macromol 2020 151 1012 1029 10.1016/j.ijbiomac.2019.11.066 31715233 393. Zhang F Wang S Gao M Hyaluronic acid ameliorates intervertebral disc degeneration via promoting mitophagy activation Front Bioeng Biotechnol 2022 10 1057429 10.3389/fbioe.2022.1057429 36588938 PMC9800418 394. Xu Y Tang G Zhang C Wang N Feng Y Gallic Acid and Diabetes Mellitus: its Association with Oxidative Stress Molecules (Basel, Switzerland) 2021 26 23 7115 10.3390/molecules26237115 34885698 PMC8658971 395. Rahimi M Charmi G Matyjaszewski K Banquy X Pietrasik J Recent developments in natural and synthetic polymeric drug delivery systems used for the treatment of osteoarthritis Acta Biomater 2021 123 31 50 10.1016/j.actbio.2021.01.003 33444800 396. Pontes AP Welting TJM Rip J Creemers LB Polymeric Nanoparticles for Drug Delivery in Osteoarthritis Pharmaceutics 2022 14 12 2639 10.3390/pharmaceutics14122639 36559133 PMC9788411 397. Gorth DJ Mauck RL Chiaro JA IL-1ra delivered from poly(lactic-co-glycolic acid) microspheres attenuates IL-1β-mediated degradation of nucleus pulposus in vitro Arthritis Res Therapy 2012 14 4 R179 10.1186/ar3932 PMC3580573 22863285 398. Cicardi M Zuraw BL Angioedema Due to Bradykinin Dysregulation The Journal of allergy and Clinical Immunology in Practice 2018 6 4 1132 1141 10.1016/j.jaip.2018.04.022 30033914 399. Kayashima Y Smithies O Kakoki M The kallikrein-kinin system and oxidative stress Curr Opin Nephrol Hypertens 2012 21 1 92 96 10.1097/MNH.0b013e32834d54b1 22048723 PMC3657726 400. Qiu X Ma C Luo Z Bradykinin protects nucleus pulposus cells from tert-butyl hydroperoxide-induced damage and delays intervertebral disc degeneration Int immunopharmacol 2024 134 112161 10.1016/j.intimp.2024.112161 38728878 401. Wang Z Zou Y Li Y Cheng Y Metal-Containing Polydopamine Nanomaterials: catalysis, Energy, and Theranostics Small (Weinheim an der Bergstrasse, Germany) 2020 16 18 e1907042 10.1002/smll.201907042 32220006 402. Zielińska A Carreiró F Oliveira AM Polymeric Nanoparticles: production, Characterization, Toxicology and Ecotoxicology Molecules (Basel, Switzerland) 2020 25 16 3731 10.3390/molecules25163731 32824172 PMC7464532 403. Amaldoss MJN Yang JL Koshy P Unnikrishnan A Sorrell CC Inorganic nanoparticle-based advanced cancer therapies: promising combination strategies Drug Discovery Today 2022 27 12 103386 10.1016/j.drudis.2022.103386 36182068 404. Mohammadpour R Dobrovolskaia MA Cheney DL Greish KF Ghandehari H Subchronic and chronic toxicity evaluation of inorganic nanoparticles for delivery applications Adv Drug Delivery Rev 2019 144 112 132 10.1016/j.addr.2019.07.006 PMC6745262 31295521 405. Unnikrishnan G Joy A Megha M Kolanthai E Senthilkumar M Exploration of inorganic nanoparticles for revolutionary drug delivery applications: a critical review Discover Nano 2023 18 1 157 10.1186/s11671-023-03943-0 38112849 PMC10730791 406. Wen J Yang K Sun S MnO(2)-Based nanosystems for cancer therapy Chemical Communications (Cambridge, England) 2020 56 52 7065 7079 10.1039/D0CC02782K 32495760 407. Zhang W Yang M Sun T Zhang J Zhao Y Can Manganese Dioxide Microspheres be Used as Intermediaries to Alleviate Intervertebral Disc Degeneration With Strengthening Drugs? Front Bioeng Biotechnol 2022 10 866290 10.3389/fbioe.2022.866290 35433668 PMC9011040 408. Li C Zhao Z Luo Y Macrophage-Disguised Manganese Dioxide Nanoparticles for Neuroprotection by Reducing Oxidative Stress and Modulating Inflammatory Microenvironment in Acute Ischemic Stroke Advanced Science (Weinheim, Baden-Wurttemberg, Germany) 2021 8 20 e2101526 10.1002/advs.202101526 34436822 PMC8529435 409. Nakawaki M Uchida K Miyagi M Changes in Nerve Growth Factor Expression and Macrophage Phenotype Following Intervertebral Disc Injury in Mice J Orthopaedic Res 2019 37 8 1798 1804 10.1002/jor.24308 30977543 410. Lee S Hwang C Marini S NGF-TrkA signaling dictates neural ingrowth and aberrant osteochondral differentiation after soft tissue trauma Nat Commun 2021 12 1 4939 10.1038/s41467-021-25143-z 34400627 PMC8368242 411. Song X Ding Q Wei W Peptide-Functionalized Prussian Blue Nanomaterial for Antioxidant Stress and NIR Photothermal Therapy against Alzheimer’s Disease Small 2023 19 41 e2206959 10.1002/smll.202206959 37322406 412. Lan X Zhuo J Luo L Metal-phenolic networks derived CN-FeC hollow nanozyme with robust peroxidase-like activity for total antioxidant capacity detection Colloids Surf. B 2024 234 113640 10.1016/j.colsurfb.2023.113640 38042109 413. Chen J Pan S Zhou J Assembly of Bioactive Nanoparticles via Metal-Phenolic Complexation Adv Mater 2022 34 10 e2108624 10.1002/adma.202108624 34933398 414. Chatterjee N Kumar P Kumar K Misra SK What makes carbon nanoparticle a potent material for biological application? Wiley Interdiscip Rev Nanomed Nanobiotechnol 2022 14 3 e1782 10.1002/wnan.1782 35194963 415. Borisenkova AA Bolshakova OI Titova AV Fullerene C(60) Conjugate with Folic Acid and Polyvinylpyrrolidone for Targeted Delivery to Tumor Cells Int J Mol Sci 2024 25 10 5350 10.3390/ijms25105350 38791388 PMC11120752 416. Zhang G Fang H Chang S Fullerene [60] encapsulated water-soluble supramolecular cage for prevention of oxidative stress-induced myocardial injury Mater Today Bio 2023 21 100693 10.1016/j.mtbio.2023.100693 PMC10316085 37404456 417. Xiao L Huang R Zhang Y A New Formyl Peptide Receptor-1 Antagonist Conjugated Fullerene Nanoparticle for Targeted Treatment of Degenerative Disc Diseases ACS Appl. Mater. Interfaces 2019 11 42 38405 38416 10.1021/acsami.9b11783 31556594 PMC6935051 418. Pei Y Cui F Du X Antioxidative nanofullerol inhibits macrophage activation and development of osteoarthritis in rats Int J Nanomed 2019 14 4145 4155 10.2147/IJN.S202466 PMC6559768 31239673 419. Liu Q Jin L Shen FH Balian G Li XJ Fullerol nanoparticles suppress inflammatory response and adipogenesis of vertebral bone marrow stromal cells--a potential novel treatment for intervertebral disc degeneration Spine J 2013 13 11 1571 1580 10.1016/j.spinee.2013.04.004 23669123 PMC3841235 420. Zare H Ahmadi S Ghasemi A Carbon Nanotubes: smart Drug/Gene Delivery Carriers Int J Nanomed 2021 16 1681 1706 10.2147/IJN.S299448 PMC7936533 33688185 421. Raphey VR Henna TK Nivitha KP Sabu C Pramod K Pramod K Advanced biomedical applications of carbon nanotube Mater Sci Eng C Mater Biol Appl 2019 100 616 630 10.1016/j.msec.2019.03.043 30948098 422. Geng H Chen J Tu K Carbon dot nanozymes as free radicals scavengers for the management of hepatic ischemia-reperfusion injury by regulating the liver inflammatory network and inhibiting apoptosis J Nanobiotechnol 2023 21 1 500 10.1186/s12951-023-02234-1 PMC10734184 38129928 423. Jaleel JA Pramod K Artful and multifaceted applications of carbon dot in biomedicine Journal of Controlled Release: Official Journal of the Controlled Release Society 2018 269 302 321 29170139 10.1016/j.jconrel.2017.11.027 424. Kong J Zhou F Preparation and Application of Carbon Dots Nanozymes Antioxidants 2024 13 5 535 38790640 10.3390/antiox13050535 PMC11117996 425. Gong N Ma X Ye X Carbon-dot-supported atomically dispersed gold as a mitochondrial oxidative stress amplifier for cancer treatment Nature Nanotechnol 2019 14 4 379 387 10.1038/s41565-019-0373-6 30778211 426. Bodratti AM Alexandridis P Amphiphilic block copolymers in drug delivery: advances in formulation structure and performance Expert Opin Drug Delivery 2018 15 11 1085 1104 10.1080/17425247.2018.1529756 30259762 427. Hari SK Gauba A Shrivastava N Tripathi RM Jain SK Pandey AK Polymeric micelles and cancer therapy: an ingenious multimodal tumor-targeted drug delivery system Drug Delivery Transl Res 2023 13 1 135 163 10.1007/s13346-022-01197-4 35727533 428. Movassaghian S Merkel OM Torchilin VP Applications of polymer micelles for imaging and drug delivery Wiley Interdiscip Rev Nanomed Nanobiotechnol 2015 7 5 691 707 10.1002/wnan.1332 25683687 429. Hwang D Ramsey JD Kabanov AV Polymeric micelles for the delivery of poorly soluble drugs: from nanoformulation to clinical approval Adv Drug Delivery Rev 2020 156 80 118 10.1016/j.addr.2020.09.009 PMC8173698 32980449 430. Kotta S Aldawsari HM Badr-Eldin SM Nair AB Yt K Progress in Polymeric Micelles for Drug Delivery Applications Pharmaceutics 2022 14 8 1636 10.3390/pharmaceutics14081636 36015262 PMC9412594 431. Chang CC Tsou HK Chang HH Runx1 Messenger RNA Delivered by Polyplex Nanomicelles Alleviate Spinal Disc Hydration Loss in a Rat Disc Degeneration Model Int J Mol Sci 2022 23 1 565 35008997 10.3390/ijms23010565 PMC8745749 432. Pattnaik S Swain K Ramakrishna S Optimal delivery of poorly soluble drugs using electrospun nanofiber technology: challenges, state of the art, and future directions Wiley Interdiscip Rev Nanomed Nanobiotechnol 2023 15 2 e1859 10.1002/wnan.1859 36193733 433. Anup N Chavan T Chavan S Reinforced electrospun nanofiber composites for drug delivery applications J Biomed Mater Res Part A 2021 109 10 2036 2064 10.1002/jbm.a.37187 33834610 434. Wildy M Lu P Electrospun Nanofibers: shaping the Future of Controlled and Responsive Drug Delivery Materials 2023 16 22 7062 10.3390/ma16227062 38004992 PMC10672065 435. Jiang Z Zheng Z Yu S Nanofiber Scaffolds as Drug Delivery Systems Promoting Wound Healing Pharmaceutics 2023 15 7 1829 10.3390/pharmaceutics15071829 37514015 PMC10384736 436. Formica FA Öztürk E Hess SC A Bioinspired Ultraporous Nanofiber-Hydrogel Mimic of the Cartilage Extracellular Matrix Adv Healthcare Mater 2016 5 24 3129 3138 10.1002/adhm.201600867 27885831 437. Li C Chen J Lv Y Recent Progress in Electrospun Nanofiber-Based Degenerated Intervertebral Disc Repair ACS Biomater Sci Eng 2022 8 1 16 31 10.1021/acsbiomaterials.1c00970 34913688 438. Koepsell L Zhang L Neufeld D Fong H Deng Y Electrospun nanofibrous polycaprolactone scaffolds for tissue engineering of annulus fibrosus Macromol biosci 2011 11 3 391 399 10.1002/mabi.201000352 21080441 439. Martin JT Milby AH Chiaro JA Translation of an engineered nanofibrous disc-like angle-ply structure for intervertebral disc replacement in a small animal model Acta Biomater 2014 10 6 2473 2481 10.1016/j.actbio.2014.02.024 24560621 PMC4412172 440. Uysal O Arslan E Gulseren G Collagen Peptide Presenting Nanofibrous Scaffold for Intervertebral Disc Regeneration ACS Appl. Bio Mater 2019 2 4 1686 1695 10.1021/acsabm.9b00062 35026903 441. Liu C Xiao L Zhang Y Zhao Q Xu H Regeneration of annulus fibrosus tissue using a DAFM/PECUU-blended electrospun scaffold J biomater sci Poly ed 2020 31 18 2347 2361 10.1080/09205063.2020.1812038 32885742 442. Madhukiran D Jha A Kumar M Ajmal G Bonde GV Mishra B Electrospun nanofiber-based drug delivery platform: advances in diabetic foot ulcer management Expert Opin Drug Delivery 2021 18 1 25 42 10.1080/17425247.2021.1823966 32924638 443. Makhathini SS Kondiah PJ Kharodia ME Biomedicine Innovations and Its Nanohydrogel Classifications Pharmaceutics 2022 14 12 2839 10.3390/pharmaceutics14122839 36559335 PMC9787506 444. Damiri F Fatimi A Santos ACP Varma RS Berrada M Smart stimuli-responsive polysaccharide nanohydrogels for drug delivery: a review J Mat Chem B 2023 11 44 10538 10565 10.1039/d3tb01712e 37909361 445. Desai SU Srinivasan SS Kumbar SG Moss IL Hydrogel-Based Strategies for Intervertebral Disc Regeneration: advances, Challenges and Clinical Prospects Gels (Basel, Switzerland) 2024 10 1 10.3390/gels10010062 PMC10815657 38247785 446. Zheng K Du D Recent advances of hydrogel-based biomaterials for intervertebral disc tissue treatment: a literature review J Tissue Eng Regener Med 2021 15 4 299 321 10.1002/term.3172 33660950 447. Chen X Jing S Xue C Guan X Progress in the Application of Hydrogels in Intervertebral Disc Repair: a Comprehensive Review Current Pain and Headache Reports 2024 28 12 1333 1348 38985414 10.1007/s11916-024-01296-6 PMC11666692 448. Liu Y Zhao Z Guo C Application and development of hydrogel biomaterials for the treatment of intervertebral disc degeneration: a literature review Front Cell Develop Biol 2023 11 1286223 10.3389/fcell.2023.1286223 PMC10733535 38130952 449. Cao H Duan L Zhang Y Cao J Zhang K Current hydrogel advances in physicochemical and biological response-driven biomedical application diversity Signal Transduction and Targeted Therapy 2021 6 1 426 34916490 10.1038/s41392-021-00830-x PMC8674418 450. Mikhail AS Morhard R Mauda-Havakuk M Arrichiello A Wood BJ Hydrogel drug delivery systems for minimally invasive local immunotherapy of cancer Adv Drug Delivery Rev 2023 202 115083 10.1016/j.addr.2023.115083 PMC11616795 37673217 451. Shaikh MAJ Alharbi KS Almalki WH Sodium alginate based drug delivery in management of breast cancer Carbohydr Polym 2022 292 119689 35725179 10.1016/j.carbpol.2022.119689 452. Lai P Daear W Löbenberg R Prenner EJ Overview of the preparation of organic polymeric nanoparticles for drug delivery based on gelatine, chitosan, poly(d,l-lactide-co-glycolic acid) and polyalkylcyanoacrylate Colloids Surf B 2014 118 154 163 10.1016/j.colsurfb.2014.03.017 24769392 453. Serna JA Rueda-Gensini L Céspedes-Valenzuela DN Cifuentes J Cruz JC Muñoz-Camargo C Recent Advances on Stimuli-Responsive Hydrogels Based on Tissue-Derived ECMs and Their Components: towards Improving Functionality for Tissue Engineering and Controlled Drug Delivery Polymers 2021 13 19 3263 10.3390/polym13193263 34641079 PMC8512780 454. Dikici S Aldemir Dikici B MacNeil S Claeyssens F Decellularised extracellular matrix decorated PCL PolyHIPE scaffolds for enhanced cellular activity, integration and angiogenesis Biomater Sci 2021 9 21 7297 7310 10.1039/D1BM01262B 34617526 PMC8547328 455. Kurian AG Singh RK Patel KD Lee JH Kim HW Multifunctional GelMA platforms with nanomaterials for advanced tissue therapeutics Bioactive Mater 2022 8 267 295 10.1016/j.bioactmat.2021.06.027 PMC8424393 34541401 456. Lv B Lu L Hu L Recent advances in GelMA hydrogel transplantation for musculoskeletal disorders and related disease treatment Theranostics 2023 13 6 2015 2039 10.7150/thno.80615 37064871 PMC10091878 457. Li P Zhang M Chen Z Tian B Kang X Tissue-Engineered Injectable Gelatin-Methacryloyl Hydrogel-Based Adjunctive Therapy for Intervertebral Disc Degeneration ACS omega 2023 8 15 13509 13518 10.1021/acsomega.3c00211 37091429 PMC10116505 458. Ao Y Zhang E Liu Y Yang L Li J Wang F Advanced Hydrogels With Nanoparticle Inclusion for Cartilage Tissue Engineering Front Bioeng Biotechnol 2022 10 951513 35845428 10.3389/fbioe.2022.951513 PMC9277358 459. Zhang P Qi J Zhang R Recent advances in composite hydrogels: synthesis, classification, and application in the treatment of bone defects Biomater Sci 2024 12 2 308 329 38108454 10.1039/d3bm01795h 460. Chen Q He J Liu H Small extracellular vesicles-transported lncRNA TDRKH-AS1 derived from AOPPs-treated trophoblasts initiates endothelial cells pyroptosis through PDIA4/DDIT4 axis in preeclampsia J Transl Med 2023 21 1 496 37488572 10.1186/s12967-023-04346-6 PMC10364420 461. Zhidkova EM Lylova ES Grigoreva DD Nutritional Sensor REDD1 in Cancer and Inflammation: friend or Foe? Int J Mol Sci 2022 23 17 9686 10.3390/ijms23179686 36077083 PMC9456073 462. Han QF Li WJ Hu KS Exosome biogenesis: machinery, regulation, and therapeutic implications in cancer Mol Cancer 2022 21 1 207 10.1186/s12943-022-01671-0 36320056 PMC9623991 463. Arya SB Collie SP Parent CA The ins-and-outs of exosome biogenesis, secretion, and internalization Trends Cell Biol 2024 34 2 90 108 10.1016/j.tcb.2023.06.006 37507251 PMC10811273 464. Lu M Huang Y Bioinspired exosome-like therapeutics and delivery nanoplatforms Biomaterials 2020 242 119925 10.1016/j.biomaterials.2020.119925 32151860 465. Dad HA Gu TW Zhu AQ Huang LQ Peng LH Plant Exosome-like Nanovesicles: emerging Therapeutics and Drug Delivery Nanoplatforms Molecular Therapy: the Journal of the American Society of Gene Therapy 2021 29 1 13 31 10.1016/j.ymthe.2020.11.030 33278566 PMC7791080 466. Fan C Wang W Yu Z M1 macrophage-derived exosomes promote intervertebral disc degeneration by enhancing nucleus pulposus cell senescence through LCN2/NF-κB signaling axis J Nanobiotechnol 2024 22 1 301 10.1186/s12951-024-02556-8 PMC11140985 38816771 467. Li W Zhang S Wang D Exosomes Immunity Strategy: a Novel Approach for Ameliorating Intervertebral Disc Degeneration Front Cell Develop Biol 2021 9 822149 10.3389/fcell.2021.822149 PMC8870130 35223870 468. Sun Z Zhao H Liu B AF cell derived exosomes regulate endothelial cell migration and inflammation: implications for vascularization in intervertebral disc degeneration Life Sci 2021 265 118778 10.1016/j.lfs.2020.118778 33217442 469. CC C Chen J Wang WL Xie L Shao CQ Zhang YX Inhibition of the P53/P21 Pathway Attenuates the Effects of Senescent Nucleus Pulposus Cell-Derived Exosomes on the Senescence of Nucleus Pulposus Cells Orthopaedic Surgery 2021 13 2 583 591 10.1111/os.12886 33314719 PMC7957423 470. Guo Z Su W Zhou R Exosomal MATN3 of Urine-Derived Stem Cells Ameliorates Intervertebral Disc Degeneration by Antisenescence Effects and Promotes NPC Proliferation and ECM Synthesis by Activating TGF- β Oxid Med Cell Longev 2021 2021 1 5542241 10.1155/2021/5542241 34136064 PMC8175180 471. Xia C Zeng Z Fang B Mesenchymal stem cell-derived exosomes ameliorate intervertebral disc degeneration via anti-oxidant and anti-inflammatory effects Free Radic Biol Med 2019 143 1 15 10.1016/j.freeradbiomed.2019.07.026 31351174 472. Zeng H Guo S Ren X Wu Z Liu S Yao X Current Strategies for Exosome Cargo Loading and Targeting Delivery Cells 2023 12 10 1416 10.3390/cells12101416 37408250 PMC10216928 473. Sadeghi S Tehrani FR Tahmasebi S Shafiee A Hashemi SM Exosome engineering in cell therapy and drug delivery Inflammopharmacology 2023 31 1 145 169 10.1007/s10787-022-01115-7 36609717 PMC9823267 474. Marquez CA Oh CI Ahn G Shin WR Kim YH Ahn JY Synergistic vesicle-vector systems for targeted delivery J Nanobiotechnol 2024 22 1 6 10.1186/s12951-023-02275-6 PMC10763086 38167116 475. Zhang Y Liu Q Zhang X Recent advances in exosome-mediated nucleic acid delivery for cancer therapy J Nanobiotechnol 2022 20 1 279 10.1186/s12951-022-01472-z PMC9194774 35701788 476. Kar R Dhar R Mukherjee S Exosome-Based Smart Drug Delivery Tool for Cancer Theranostics ACS Biomater Sci Eng 2023 9 2 577 594 10.1021/acsbiomaterials.2c01329 36621949 PMC9930096 477. Peng S Xiao F Chen M Gao H Tumor-Microenvironment-Responsive Nanomedicine for Enhanced Cancer Immunotherapy Advanced Science (Weinheim, Baden-Wurttemberg, Germany) 2022 9 1 e2103836 10.1002/advs.202103836 34796689 PMC8728817 478. He Q Chen J Cai S Tumor microenvironment responsive drug delivery systems Asian J Pharm Sci 2020 15 4 416 448 10.1016/j.ajps.2019.08.003 32952667 PMC7486519 479. Zhao H Li Y Chen J Environmental stimulus-responsive mesoporous silica nanoparticles as anticancer drug delivery platforms Colloids Surf. B 2024 234 113758 10.1016/j.colsurfb.2024.113758 38241892 480. Ozawa R Saita M Sakaue S Redox injectable gel protects osteoblastic function against oxidative stress and suppresses alveolar bone loss in a rat peri-implantitis model Acta Biomater 2020 110 82 94 10.1016/j.actbio.2020.04.003 32348918 481. Yu H Jin F Liu D ROS-responsive nano-drug delivery system combining mitochondria-targeting ceria nanoparticles with atorvastatin for acute kidney injury Theranostics 2020 10 5 2342 2357 10.7150/thno.40395 32104507 PMC7019163 482. Cheng R Feng F Deng C Feijen J Zhong Z Zhong Z Glutathione-responsive nano-vehicles as a promising platform for targeted intracellular drug and gene delivery Journal of Controlled Release: Official Journal of the Controlled Release Society 2011 152 1 2 12 10.1016/j.jconrel.2011.01.030 21295087 483. Zhang M Hu W Cai C Wu Y Li J Dong S Advanced application of stimuli-responsive drug delivery system for inflammatory arthritis treatment Mater Today Bio 2022 14 100223 10.1016/j.mtbio.2022.100223 PMC8881671 35243298 484. Abed HF Abuwatfa WH Husseini GA Redox-Responsive Drug Delivery Systems: a Chemical Perspective Nanomaterials (Basel, Switzerland) 2022 12 18 10.3390/nano12183183 PMC9503659 36144971 485. Danhier F Ansorena E Silva JM Coco R Le Breton A Préat V PLGA-based nanoparticles: an overview of biomedical applications Journal of Controlled Release: Official Journal of the Controlled Release Society 2012 161 2 505 522 10.1016/j.jconrel.2012.01.043 22353619 486. Gong W Xia C He Q Therapeutic gas delivery strategies Wiley Interdiscip Rev Nanomed Nanobiotechnol 2022 14 1 e1744 10.1002/wnan.1744 34355863 487. Andrabi SM Sharma NS Karan A Shahriar SMS Cordon B Xie J Nitric Oxide: physiological Functions, Delivery, and Biomedical Applications Advanced Science (Weinheim, Baden-Wurttemberg, Germany) 2023 10 30 e2303259 10.1002/advs.202303259 37632708 PMC10602574 488. Jiang H Ji P Shang X Zhou Y Connection between Osteoarthritis and Nitric Oxide: from Pathophysiology to Therapeutic Target Molecules 2023 28 4 1683 36838671 10.3390/molecules28041683 PMC9959782 489. Kitano T Zerwekh JE Usui Y Edwards ML Flicker PL Mooney V Biochemical changes associated with the symptomatic human intervertebral disk Clin Orthopaedics Related Res 1993 1993 293 372 377 8339506 490. Gilbert HTJ Hodson N Baird P Richardson SM Hoyland JA Acidic pH promotes intervertebral disc degeneration: acid-sensing ion channel −3 as a potential therapeutic target Sci Rep 2016 6 1 37360 10.1038/srep37360 27853274 PMC5112591 491. Gannimani R Walvekar P Naidu VR Aminabhavi TM Govender T Govender T: acetal containing polymers as pH-responsive nano-drug delivery systems Journal of Controlled Release: Official Journal of the Controlled Release Society 2020 328 736 761 10.1016/j.jconrel.2020.09.044 32980419 492. Verkhovskii RA Ivanov AN Lengert EV Tulyakova KA Shilyagina NY Ermakov AV Current Principles, Challenges, and New Metrics in pH-Responsive Drug Delivery Systems for Systemic Cancer Therapy Pharmaceutics 2023 15 5 1566 10.3390/pharmaceutics15051566 37242807 PMC10222897 493. Ding H Tan P Fu S Preparation and application of pH-responsive drug delivery systems Journal of Controlled Release: Official Journal of the Controlled Release Society 2022 348 206 238 10.1016/j.jconrel.2022.05.056 35660634 494. Ohsawa I Ishikawa M Takahashi K Hydrogen acts as a therapeutic antioxidant by selectively reducing cytotoxic oxygen radicals Nature Med 2007 13 6 688 694 10.1038/nm1577 17486089 495. Taherzadeh-Fard E Saft C Akkad DA PGC-1alpha downstream transcription factors NRF-1 and TFAM are genetic modifiers of Huntington disease Molecular Neurodegeneration 2011 6 1 32 10.1186/1750-1326-6-32 21595933 PMC3117738 496. Ma L Wang Y Li X Tom70-regulated mitochondrial biogenesis via TFAM improves hypoxia-induced dysfunction of pulmonary vascular endothelial cells and alleviates hypoxic pulmonary hypertension Respir Res 2023 24 1 310 10.1186/s12931-023-02631-y 38093274 PMC10717060 497. Shi PZ Wang JW Wang PC Urolithin a alleviates oxidative stress-induced senescence in nucleus pulposus-derived mesenchymal stem cells through SIRT1/PGC-1α pathway World Journal of Stem Cells 2021 13 12 1928 1946 10.4252/wjsc.v13.i12.1928 35069991 PMC8727228 498. Massagué J Sheppard D TGF-β signaling in health and disease Cell 2023 186 19 4007 4037 10.1016/j.cell.2023.07.036 37714133 PMC10772989 499. Wu T Li X Zhu Z Krüppel like factor 10 prevents intervertebral disc degeneration via TGF-β signaling pathway both in vitro and in vivo Journal of Orthopaedic Translation 2021 29 19 29 10.1016/j.jot.2021.04.003 34094855 PMC8141503 500. Sun T Jiang C Stimuli-responsive drug delivery systems triggered by intracellular or subcellular microenvironments Adv Drug Delivery Rev 2023 196 114773 10.1016/j.addr.2023.114773 36906230 501. Mura S Nicolas J Couvreur P Stimuli-responsive nanocarriers for drug delivery Nature Mater 2013 12 11 991 1003 10.1038/nmat3776 24150417 502. Fang H Xu S Wang Y Yang H Su D Endogenous stimuli-responsive drug delivery nanoplatforms for kidney disease therapy Colloids Surf. B 2023 232 113598 10.1016/j.colsurfb.2023.113598 37866237 503. Huang Y Li P Zhao R Silica nanoparticles: biomedical applications and toxicity Biomed Pharmacother 2022 151 113053 10.1016/j.biopha.2022.113053 35594717 504. Ignacio RM Kim DH Sajo ME Immunotoxicity of silicon dioxide nanoparticles with different sizes and electrostatic charge Int J Nanomed 2014 9 Suppl 2 183 193 10.2147/IJN.S57934 PMC4279855 25565836 505. Hu J Zhang G Liu S Enzyme-responsive polymeric assemblies, nanoparticles and hydrogels Chem Soc Rev 2012 41 18 5933 5949 10.1039/c2cs35103j 22695880 506. Millward-Sadler SJ Costello PW Freemont AJ Hoyland JA Regulation of catabolic gene expression in normal and degenerate human intervertebral disc cells: implications for the pathogenesis of intervertebral disc degeneration Arthritis Res Therapy 2009 11 3 R65 10.1186/ar2693 PMC2714110 19435506 507. Hu Q Katti PS Gu Z Enzyme-responsive nanomaterials for controlled drug delivery Nanoscale 2014 6 21 12273 12286 10.1039/C4NR04249B 25251024 PMC4425417 508. Soh WT Zhang J Hollenberg MD Protease allergens as initiators-regulators of allergic inflammation Allergy 2023 78 5 1148 1168 10.1111/all.15678 36794967 PMC10159943 509. Chen D Jiang X Correlation Between Proteolytic Enzymes and Microangiogenesis in Degenerative Intervertebral Disc Nucleus Journal of Investigative Surgery: the Official Journal of the Academy of Surgical Research 2021 34 6 679 684 10.1080/08941939.2019.1679921 31851863 510. Lin IT Lin YH Lian WS Wang FS Wu RW MicroRNA-29a Mitigates Laminectomy-Induced Spinal Epidural Fibrosis and Gait Dysregulation by Repressing TGF-β1 and IL-6 Int J Mol Sci 2023 24 11 10.3390/ijms24119158 PMC10252628 37298111 511. Shahriari M Zahiri M Abnous K Taghdisi SM Ramezani M Alibolandi M Enzyme responsive drug delivery systems in cancer treatment Journal of Controlled Release: Official Journal of the Controlled Release Society 2019 308 172 189 10.1016/j.jconrel.2019.07.004 31295542 512. Gao B Jiang B Xing W Xie Z Zou W Zou W Discovery and Application of Postnatal Nucleus Pulposus Progenitors Essential for Intervertebral Disc Homeostasis and Degeneration Advanced Science (Weinheim, Baden-Wurttemberg, Germany) 2022 9 13 e2104888 10.1002/advs.202104888 35195356 PMC9069184 513. Zhang W Sun T Li Z Application of stem cells in the repair of intervertebral disc degeneration Stem Cell Res Ther 2022 13 1 70 10.1186/s13287-022-02745-y 35148808 PMC8832693 514. Ekram S Salim A Khan I Khan I Regulating the fate of stem cells for regenerating the intervertebral disc degeneration World Journal of Stem Cells 2021 13 12 1881 1904 10.4252/wjsc.v13.i12.1881 35069988 PMC8727226 515. Zhang YM Liu YH Liu Y Cyclodextrin-Based Multistimuli-Responsive Supramolecular Assemblies and Their Biological Functions Advanced Materials (Deerfield Beach, Fla) 2020 32 3 e1806158 10.1002/adma.201806158 30773709 516. Li Z Jiang Y Zhao H Liu L Ca(2+)-Chelation-Induced Fabrication of Multistimuli-Responsive Charged Nanogels from Phospholipid-Polymer Conjugates and Use for Drug/Protein Loading Langmuir: the ACS Journal of Surfaces and Colloids 2022 38 21 6612 6622 10.1021/acs.langmuir.2c00464 35578744 517. Kolluru GK Shackelford RE Shen X Dominic P Kevil CG Sulfide regulation of cardiovascular function in health and disease Nat Rev Cardiol 2023 20 2 109 125 10.1038/s41569-022-00741-6 35931887 PMC9362470 518. Sun HJ Wu ZY Nie XW Wang XY Bian JS Implications of hydrogen sulfide in liver pathophysiology: mechanistic insights and therapeutic potential J Adv Res 2021 27 127 135 10.1016/j.jare.2020.05.010 33318872 PMC7728580 519. Scammahorn JJ Nguyen ITN Bos EM Van Goor H Joles JA Fighting Oxidative Stress with Sulfur: hydrogen Sulfide in the Renal and Cardiovascular Systems Antioxidants (Basel, Switzerland) 2021 10 3 10.3390/antiox10030373 PMC7998720 33801446 520. Greabu M Totan A Miricescu D Radulescu R Virlan J Calenic B Calenic B: hydrogen Sulfide, Oxidative Stress and Periodontal Diseases: a Concise Review Antioxidants (Basel, Switzerland) 2016 5 1 10.3390/antiox5010003 PMC4808752 26805896 521. Xu D Jin H Wen J Hydrogen sulfide protects against endoplasmic reticulum stress and mitochondrial injury in nucleus pulposus cells and ameliorates intervertebral disc degeneration Pharmacol Res 2017 117 357 369 10.1016/j.phrs.2017.01.005 28087442 522. Kang J Li Z Organ CL Xian M: pH-Controlled Hydrogen Sulfide Release for Myocardial Ischemia-Reperfusion Injury J Am Chem Soc 2016 138 20 6336 6339 10.1021/jacs.6b01373 27172143 523. Wu J Chen A Zhou Y Novel H(2)S-Releasing hydrogel for wound repair via in situ polarization of M2 macrophages Biomaterials 2019 222 119398 10.1016/j.biomaterials.2019.119398 31487582 524. Zhou ZH Liang SY Zhao TC Overcoming chemotherapy resistance using pH-sensitive hollow MnO(2) nanoshells that target the hypoxic tumor microenvironment of metastasized oral squamous cell carcinoma J Nanobiotechnol 2021 19 1 157 10.1186/s12951-021-00901-9 PMC8157461 34039370 525. Sisakhtnezhad S Rahimi M Mohammadi S Biomedical applications of MnO(2) nanomaterials as nanozyme-based theranostics Biomed Pharmacother 2023 163 114833 10.1016/j.biopha.2023.114833 37150035 526. Chamoto K Zhang B Tajima M Honjo T Fagarasan S Spermidine - an old molecule with a new age-defying immune function Trends Cell Biol 2024 34 5 363 370 10.1016/j.tcb.2023.08.002 37723019 527. Niu C Jiang D Guo Y Spermidine suppresses oxidative stress and ferroptosis by Nrf2/HO-1/GPX4 and Akt/FHC/ACSL4 pathway to alleviate ovarian damage Life Sci 2023 332 122109 10.1016/j.lfs.2023.122109 37741320 528. Xing Y Zeng B Yang W Light responsive hydrogels for controlled drug delivery Front Bioeng Biotechnol 2022 10 1075670 10.3389/fbioe.2022.1075670 36588951 PMC9800804 529. Yuan Z Gottsacker C He X Waterkotte T Park YC Repetitive drug delivery using Light-Activated liposomes for potential antimicrobial therapies Adv Drug Delivery Rev 2022 187 114395 10.1016/j.addr.2022.114395 PMC11956556 35709884 530. Liu Y Chen L Shi Q Ma H Ma H Tumor Microenvironment-Responsive Polypeptide Nanogels for Controlled Antitumor Drug Delivery Front Pharmacol 2021 12 748102 10.3389/fphar.2021.748102 34776965 PMC8578677 531. Nemoto R Fujieda K Hiruta Y Liposomes with temperature-responsive reversible surface properties Colloids Surf. B 2019 176 309 316 10.1016/j.colsurfb.2019.01.007 30641302 532. Nagase K Thermoresponsive interfaces obtained using poly(N-isopropylacrylamide)-based copolymer for bioseparation and tissue engineering applications Adv Colloid Interface Sci 2021 295 102487 10.1016/j.cis.2021.102487 34314989 533. Tono Y Kojima C Haba Y Thermosensitive properties of poly(amidoamine) dendrimers with peripheral phenylalanine residues Langmuir: the ACS Journal of Surfaces and Colloids 2006 22 11 4920 4922 10.1021/la060066t 16700575 534. Mathivanan N Paramasivam G Vergaelen M Rajendran J Hoogenboom R Sundaramurthy A Hydrogen-Bonded Multilayer Thin Films and Capsules Based on Poly(2-n-propyl-2-oxazoline) and Tannic Acid: investigation on Intermolecular Forces, Stability, and Permeability Langmuir: the ACS Journal of Surfaces and Colloids 2019 35 45 14712 14724 10.1021/acs.langmuir.9b02938 31622110 535. Yuan W Zou H Shen J Amphiphilic graft copolymers with ethyl cellulose backbone: synthesis, self-assembly and tunable temperature-CO2 response Carbohydr Polym 2016 136 216 223 10.1016/j.carbpol.2015.09.052 26572349 536. Malonzo C Chan SC Kabiri A A papain-induced disc degeneration model for the assessment of thermo-reversible hydrogel-cells therapeutic approach J Tissue Eng Regener Med 2015 9 12 E167 176 10.1002/term.1667 23303720 537. Guo W Douma L Hu MH Hyaluronic acid-based interpenetrating network hydrogel as a cell carrier for nucleus pulposus repair Carbohydr Polym 2022 277 118828 10.1016/j.carbpol.2021.118828 34893245 538. Huang Y Huang L Li L MicroRNA-25-3p therapy for intervertebral disc degeneration by targeting the IL-1β/ZIP8/MTF1 signaling pathway with a novel thermo-responsive vector Ann Translat Med 2020 8 22 1500 10.21037/atm-20-6595 PMC7729380 33313245 539. Chen Q Wang J Xia Q Treatment outcomes of injectable thermosensitive hydrogel containing bevacizumab in intervertebral disc degeneration Front Bioeng Biotechnol 2022 10 976706 10.3389/fbioe.2022.976706 36213074 PMC9533143 540. Kang ML Kim JE Im GI Thermoresponsive nanospheres with independent dual drug release profiles for the treatment of osteoarthritis Acta Biomater 2016 39 65 78 10.1016/j.actbio.2016.05.005 27155347 541. Mi P Stimuli-responsive nanocarriers for drug delivery, tumor imaging, therapy and theranostics Theranostics 2020 10 10 4557 4588 10.7150/thno.38069 32292515 PMC7150471 542. Li J Gao Y Liu S Aptamer-functionalized quercetin thermosensitive liposomes for targeting drug delivery and antitumor therapy Biomedical Materials (Bristol, England) 2022 17 6 065003 10.1088/1748-605X/ac8c75 36001994 543. Municoy S Álvarez Echazú MI Antezana PE Stimuli-Responsive Materials for Tissue Engineering and Drug Delivery Int J Mol Sci 2020 21 13 4724 10.3390/ijms21134724 32630690 PMC7369929 544. Linsley CS Wu BM Recent advances in light-responsive on-demand drug-delivery systems Therapeutic Delivery 2017 8 2 89 107 10.4155/tde-2016-0060 28088880 PMC5561969 545. Kumar D Gerges I Tamplenizza M Lenardi C Forsyth NR Liu Y Three-dimensional hypoxic culture of human mesenchymal stem cells encapsulated in a photocurable, biodegradable polymer hydrogel: a potential injectable cellular product for nucleus pulposus regeneration Acta Biomater 2014 10 8 3463 3474 10.1016/j.actbio.2014.04.027 24793656 546. Chen P Ning L Qiu P Photo-crosslinked gelatin-hyaluronic acid methacrylate hydrogel-committed nucleus pulposus-like differentiation of adipose stromal cells for intervertebral disc repair J Tissue Eng Regener Med 2019 13 4 682 693 10.1002/term.2841 30808066 547. Lin CL Su YW Kuo CH Tu TY Tsai JC Shyong YJ BMSC loaded photo-crosslinked hyaluronic acid/collagen hydrogel incorporating FG4592 for enhanced cell proliferation and nucleus pulposus differentiation Int J Biol Macromol 2024 273 Pt 1 132828 10.1016/j.ijbiomac.2024.132828 38834125 548. Ramasamy T Ruttala HB Munusamy S Chakraborty N Kim JO Nano drug delivery systems for antisense oligonucleotides (ASO) therapeutics Journal of Controlled Release: Official Journal of the Controlled Release Society 2022 352 861 878 10.1016/j.jconrel.2022.10.050 36397636 549. Tao Y Chan HF Shi B Li M Leong KW Light: a Magical Tool for Controlled Drug Delivery Adv Funct Mater 2020 30 49 10.1002/adfm.202005029 PMC8415493 34483808 550. Agiba AM Arreola-Ramírez JL Carbajal V Segura-Medina P Light-Responsive and Dual-Targeting Liposomes: from Mechanisms to Targeting Strategies Molecules (Basel, Switzerland) 2024 29 3 636 10.3390/molecules29030636 38338380 PMC10856102 551. Rapp TL DeForest CA Targeting drug delivery with light: a highly focused approach Adv Drug Delivery Rev 2021 171 94 107 10.1016/j.addr.2021.01.009 PMC8127392 33486009 552. Shin Y Husni P Kang K Recent Advances in pH- or/and Photo-Responsive Nanovehicles Pharmaceutics 2021 13 5 725 10.3390/pharmaceutics13050725 34069233 PMC8157172 553. Shakya G Cattaneo M Guerriero G Prasanna A Fiorini S Supponen O Ultrasound-responsive microbubbles and nanodroplets: a pathway to targeted drug delivery Adv Drug Delivery Re 2024 206 115178 10.1016/j.addr.2023.115178 38199257 554. Chandan R Mehta S Banerjee R Ultrasound-Responsive Carriers for Therapeutic Applications ACS Biomater Sci Eng 2020 6 9 4731 4747 10.1021/acsbiomaterials.9b01979 33455210 555. Barzegar-Fallah A Gandhi K Rizwan SB Slatter TL Reynolds JNJ Harnessing Ultrasound for Targeting Drug Delivery to the Brain and Breaching the Blood-Brain Tumour Barrier Pharmaceutics 2022 14 10 2231 10.3390/pharmaceutics14102231 36297666 PMC9607160 556. Entzian K Aigner A Drug Delivery by Ultrasound-Responsive Nanocarriers for Cancer Treatment Pharmaceutics 2021 13 8 1135 10.3390/pharmaceutics13081135 34452096 PMC8397943 557. Negishi Y Omata D Iijima H Enhanced laminin-derived peptide AG73-mediated liposomal gene transfer by bubble liposomes and ultrasound Mol Pharmaceut 2010 7 1 217 226 10.1021/mp900214s 20020739 558. Chapla R Huynh KT Schutt CE Microbubble-Nanoparticle Complexes for Ultrasound-Enhanced Cargo Delivery Pharmaceutics 2022 14 11 2396 10.3390/pharmaceutics14112396 36365214 PMC9698658 559. Yang Y Li Q Guo X Tu J Zhang D Mechanisms underlying sonoporation: interaction between microbubbles and cells Ultrason Sonochem 2020 67 105096 10.1016/j.ultsonch.2020.105096 32278246 560. Kobayashi Y Sakai D Iwashina T Iwabuchi S Mochida J Low-intensity pulsed ultrasound stimulates cell proliferation, proteoglycan synthesis and expression of growth factor-related genes in human nucleus pulposus cell line Eur Cells Mater 2009 17 15 22 10.22203/eCM.v017a02 19598131 561. Zhang X Hu Z Hao J Shen J Low Intensity Pulsed Ultrasound Promotes the Extracellular Matrix Synthesis of Degenerative Human Nucleus Pulposus Cells Through FAK/PI3K/Akt Pathway Spine 2016 41 5 E248 254 10.1097/BRS.0000000000001220 26571160 562. Al-Jawadi S Thakur SS Ultrasound-responsive lipid microbubbles for drug delivery: a review of preparation techniques to optimise formulation size, stability and drug loading Int J Pharm 2020 585 119559 10.1016/j.ijpharm.2020.119559 32574685 563. Liang Z Chen H Gong X Ultrasound-Induced Destruction of Nitric Oxide-Loaded Microbubbles in the Treatment of Thrombus and Ischemia-Reperfusion Injury Front Pharmacol 2021 12 745693 10.3389/fphar.2021.745693 35082664 PMC8785684 564. Sutton JT Raymond JL Verleye MC Pyne-Geithman GJ Holland CK Pulsed ultrasound enhances the delivery of nitric oxide from bubble liposomes to ex vivo porcine carotid tissue Int J Nanomed 2014 9 4671 4683 10.2147/IJN.S63850 PMC4200074 25336947 565. He Y Zhang B Chen Y Image-Guided Hydrogen Gas Delivery for Protection from Myocardial Ischemia-Reperfusion Injury via Microbubbles ACS Appl. Mater. Interfaces 2017 9 25 21190 21199 10.1021/acsami.7b05346 28557412 566. Amin MU Ali S Tariq I Ultrasound-Responsive Smart Drug Delivery System of Lipid Coated Mesoporous Silica Nanoparticles Pharmaceutics 2021 13 9 1396 10.3390/pharmaceutics13091396 34575472 PMC8468042 567. Xia H Zhao Y Tong R Ultrasound-Mediated Polymeric Micelle Drug Delivery Adv Exp Med Biol 2016 880 365 384 26486348 10.1007/978-3-319-22536-4_20 568. Araújo EV Carneiro SV Neto DMA Advances in surface design and biomedical applications of magnetic nanoparticles Adv Colloid Interface Sci 2024 328 103166 10.1016/j.cis.2024.103166 38728773 569. Mok H Zhang M Superparamagnetic iron oxide nanoparticle-based delivery systems for biotherapeutics Expert Opin Drug Delivery 2013 10 1 73 87 10.1517/17425247.2013.747507 PMC4167583 23199200 570. Fragal EH Fragal VH Silva EP Magnetic-responsive polysaccharide hydrogels as smart biomaterials: synthesis, properties, and biomedical applications Carbohydr. Polym 2022 292 119665 10.1016/j.carbpol.2022.119665 35725166 571. Dadfar SM Roemhild K Drude NI Iron oxide nanoparticles: diagnostic, therapeutic and theranostic applications Adv Drug Delivery Rev 2019 138 302 325 10.1016/j.addr.2019.01.005 PMC7115878 30639256 572. Millart E Lesieur S Faivre V Superparamagnetic lipid-based hybrid nanosystems for drug delivery Expert Opin Drug Delivery 2018 15 5 523 540 10.1080/17425247.2018.1453804 29543082 573. Tong S Quinto CA Zhang L Mohindra P Bao G Size-Dependent Heating of Magnetic Iron Oxide Nanoparticles ACS nano 2017 11 7 6808 6816 10.1021/acsnano.7b01762 28625045 574. Bringas E Ö K Quach DV Triggered release in lipid bilayer-capped mesoporous silica nanoparticles containing SPION using an alternating magnetic field Chemical Communications (Cambridge, England) 2012 48 45 5647 5649 10.1039/c2cc31563g 22543447 575. Hu SH Chen SY Liu DM Hsiao CS Core/Single-Crystal-Shell Nanospheres for Controlled Drug Release via a Magnetically Triggered Rupturing Mechanism Advanced Materials (Deerfield Beach, Fla) 2008 20 14 2690 2695 10.1002/adma.200800193 25213891 576. Xu Y Zheng H Schumacher D Liehn EA Slabu I Rusu M Recent Advancements of Specific Functionalized Surfaces of Magnetic Nano- and Microparticles as a Theranostics Source in Biomedicine ACS Biomater Sci Eng 2021 7 6 1914 1932 10.1021/acsbiomaterials.0c01393 33856199 577. Dinakar YH Karole A Parvez S Jain V Mudavath SL Organ-restricted delivery through stimuli-responsive nanocarriers for lung cancer therapy Life Sci 2022 310 121133 10.1016/j.lfs.2022.121133 36306866 578. Wang Y Kang J Guo X Intervertebral Disc Degeneration Models for Pathophysiology and Regenerative Therapy -Benefits and Limitations Journal of Investigative Surgery: the Official Journal of the Academy of Surgical Research 2022 35 4 935 952 10.1080/08941939.2021.1953640 34309468 579. Poletto DL Crowley JD Tanglay O Walsh WR Pelletier MH Preclinical in vivo animal models of intervertebral disc degeneration. Part 1: a systematic review JOR spine 2023 6 1 e1234 10.1002/jsp2.1234 36994459 PMC10041387 580. Beckstein JC Sen S Schaer TP Vresilovic EJ Elliott DM Comparison of animal discs used in disc research to human lumbar disc: axial compression mechanics and glycosaminoglycan content Spine 2008 33 6 E166 173 10.1097/BRS.0b013e318166e001 18344845 ",
  "metadata": {
    "Title of this paper": "Comparison of animal discs used in disc research to human lumbar disc: axial compression mechanics and glycosaminoglycan content",
    "Journal it was published in:": "International Journal of Nanomedicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478456/"
  }
}