{
  "title": "Paper_537",
  "abstract": "Mol Ther Mol Ther 902 molther Molecular Therapy 1525-0016 1525-0024 American Society of Gene & Cell Therapy PMC11489532 PMC11489532.1 11489532 11489532 38946142 10.1016/j.ymthe.2024.06.037 S1525-0016(24)00454-4 1 Original Article Novel OX40 and 4-1BB derived spacers enhance CD30 CAR activity and safety in CD30 positive lymphoma models Kua Lindsay 1 8 9 Ng Chee Hoe 1 9 Tan Jin Wei 1 8 9 Tan Hwee Ching 1 Seh Cheah Chen 1 Wong Fiona 1 8 Ong Richard 1 8 Rooney Cliona M. 2 3 4 5 6 Tan Joel 7 Chen Qingfeng 7 Horak Ivan D. 1 8 Tan Kar Wai 1 8 Low Lionel lionellow@tikvaallocell.com 1 8 ∗ 1 2 3 4 5 6 7 ∗ lionellow@tikvaallocell.com 8 Present address: Tikva Allocell Pte Ltd, Singapore 138673, Singapore 9 These authors contributed equally 02 10 2024 29 6 2024 32 10 473117 3504 3521 22 6 2023 28 6 2024 02 10 2025 02 10 2025 20 10 2024 02 10 2025 © 2024 The American Society of Gene and Cell Therapy. Published by Elsevier Inc. All rights are reserved, including those for text and data mining, AI training, and similar technologies. 2024 The American Society of Gene and Cell Therapy The chimeric antigen receptor (CAR) derived from the CD30 specific murine antibody, HRS-3, has produced promising clinical efficacy with a favorable safety profile in the treatment of relapsed or refractory CD30-positive lymphomas. However, persistence of the autologous CAR-T cells was brief, and many patients relapsed a year after treatment. The lack of persistence may be attributed to the use of a wild-type immunoglobulin (Ig)G1 spacer that can associate with Fc receptors. We first identified the cysteine-rich domain (CRD) 5 of CD30 as the primary binding epitope of HRS-3 and armed with this insight, attempted to improve the HRS-3 CAR functionality with a panel of novel spacer designs. We demonstrate that HRS-3 CARs with OX40 and 4-1BB derived spacers exhibited similar anti-tumor efficacy, circumvented interactions with Fc receptors, and secreted lower levels of cytokines in vitro Graphical abstract Low and colleagues demonstrated the use of novel spacer domains derived from OX40 and 4-1BB receptors to optimize humanized CD30.CARs for potency and safety. In humanized mice models with high tumor burden, the novel CARs eliminated tumors with low serum cytokine secretion, providing a promising candidate for clinical development. Keywords CAR design spacer domain CD30 Hodgkin’s lymphoma non-Hodgkin’s lymphoma immunotherapy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Novel OX40 and 4-1BB derived spacers enhance CD30 CAR activity and safety in CD30 positive lymphoma models",
    "Journal it was published in:": "Molecular Therapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11489532/"
  }
}