{
  "title": "Paper_746",
  "abstract": "pmc Front Oncol Front Oncol 1755 frontonco Front. Oncol. Frontiers in Oncology 2234-943X Frontiers Media SA PMC12479286 PMC12479286.1 12479286 12479286 41035670 10.3389/fonc.2025.1643491 1 Oncology Review The paradoxical role of stem cells in osteosarcoma: from pathogenesis to therapeutic breakthroughs Su Zhengbing Fang Xiang Duan Hong  *  Department of Orthopedic Surgery, West China Hospital, Sichuan University Chengdu China Edited by: Guanmin Jiang Reviewed by: Subhadeep Das  Yan Yik Lim *Correspondence: Hong Duan, duanhong1970@126.com 16 9 2025 2025 15 480898 1643491 09 6 2025 06 8 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Su, Fang and Duan. 2025 Su, Fang and Duan https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Osteosarcoma (OS), the most prevalent primary malignant bone tumor in adolescents, exhibits a high metastatic potential and resistance to therapy. This characteristic results in a dismal prognosis in advanced cases even following multimodal therapies. This review synthesizes the dual roles of stem cells in OS pathogenesis and therapeutic innovation. Cancer stem cells (CSCs) drive tumor initiation, progression, and chemoresistance through dysregulated molecular pathways that include Wnt/β-catenin, Notch, and Hedgehog signaling, with key markers such as CD133 and CXCR4 contributing to stemness maintenance and metastasis. Concurrently, mesenchymal stem cells (MSCs) paradoxically influence OS progression. Although their tumor-homing capacity enables targeted drug delivery (e.g., IDD-1040-paclitaxel complexes) and immunomodulation, MSC-derived factors like TGF-β can promote cancer-associated fibroblast differentiation and immune evasion. The immunosuppressive tumor microenvironment (TME), characterized by hypoxia-induced HIF-1α activation, metabolic reprogramming, and M2 macrophage polarization, further facilitates CSC resilience and therapy resistance. Emerging strategies—including CSCs-targeted agents (AZD1080, DNMTi/HDACi), CRISPR/Cas9-engineered CD133-directed CAR-T cells, and MSC-mediated delivery of oncolytic viruses—show preclinical promise in overcoming these barriers. However, critical challenges persist: intratumoral CSC heterogeneity limits targeted therapy efficacy; MSC functional plasticity risks tumor promotion via fusion or batch variations; and inefficient cell homing due to pulmonary entrapment reduces therapeutic delivery. Future directions necessitate biomarker-guided combinatorial approaches, optimized MSC administration routes (e.g., intra-arterial injection), and integrated multi-omics profiling to address translational bottlenecks. Resolving these issues will advance personalized stem cell-focused therapies for OS. osteosarcoma cancer stem cells mesenchymal stem cells regulatory mechanisms translational barriers The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Molecular and Cellular Oncology 1 Introduction Osteosarcoma (OS), the most common primary malignant bone tumor in adolescents and young adults, is characterized by its aggressive nature and propensity for metastasis. Despite significant advancements in multimodal therapies combining surgery, chemotherapy, and radiotherapy, the prognosis for patients with metastatic or chemotherapy-resistant disease remains dismal, with survival rates stagnating below 20% over the past decades ( 1 2 Currently, there are still many crucial issues in osteosarcoma research that urgently need to be addressed. On the one hand, the heterogeneity of cancer stem cells (CSCs) and the mechanisms underlying the maintenance of their stemness have not been fully elucidated. Although pathways such as Wnt/β-catenin and Notch are known to be involved in regulation, the differences in the dependence of different CSCs sub-populations (such as CD133+ and CXCR4+) on these pathways, as well as their specific roles in chemoresistance and metastasis, remain controversial ( 3 4 5 7 6 This review systematically synthesizes the latest advancements in understanding the pathological mechanisms of OS, highlighting the dual roles of stem cells in disease progression and therapeutic innovation. By dissecting the molecular interactions among cancer stem cells (CSCs), mesenchymal stem cells (MSCs), and the tumor microenvironment (TME), we critically evaluate emerging strategies such as CRISPR-engineered chimeric antigen receptor T cells (CAR-T cells), epigenetic regulators, and optimized mesenchymal stem cell delivery pathways. Finally, we propose future directions to overcome translational barriers, advocating for a multidisciplinary approach that integrates pre-clinical research findings with clinical practice to improve treatment outcomes for osteosarcoma patients. 2 Pathological overview of osteosarcoma 2.1 Epidemiology and clinical features OS is the most common primary malignant bone tumor, which is divided into primary (central or surface) and secondary OS, originating from previous diseases ( 7 8 9 10 11 OS originates from osteogenic MSCs and has a higher incidence in the metaphysis of the distal femur, proximal tibia and proximal humerus ( 12 OS often carries total genomic mutations and rearrangements, including chromosomal translocations ( 13 15 15 16 17 13 18 19 20 Standard OS treatment includes surgery and chemotherapy. When combined treatment (neoadjuvant chemotherapy, surgery and adjuvant chemotherapy) is used, the 5-year survival rate for patients without metastatic disease at diagnosis is 60%-80% ( 21 22 23 24 25 2.2 Molecular pathological mechanism Multiple signaling pathways are involved in the development of OS and other types of cancers. OS is characterized by a high degree of genetic instability, which may hinder the understanding of its pathogenesis. Due to the dysregulation of the cell differentiation process, OS develops from osteoblasts and even more commonly from pluripotent precursor cells. 2.2.1 Wnt signaling pathway The Wnt signaling pathway is crucial for cell proliferation and differentiation. The Wnt pathway upregulates proliferation-stimulating oncogenes such as c-Myc, CCND1, and c-MET. For example, research has found that isoquercitrin (ISO) significantly inhibits proliferation, induces EMT migration, and induces apoptosis of OS cells in vitro In vivo 26 in vitro in vivo 27 2.2.2 FoxO signaling pathway The FoxO signaling pathway is responsible for cell cycle regulation and apoptosis. This pathway can be activated in the wnt signaling cascade. For example, compared with osteoblasts, OS cells express more fucosyltransferase 4 (FUT4). Inhibition of FUT4 expression significantly inhibits the proliferation, invasion and migration abilities of OS cells, and also increases the apoptosis of OS cells. The wnt/β-Catenin signaling pathway is blocked by up-regulating FOXO1 expression, and then FOXO1 expression is inhibited by inhibiting FUT4 expression ( 28 2.2.3 PI3K/Akt/mTOR pathway and MAPK pathway The PI3K/Akt/mTOR pathway and the MAPK pathway play crucial roles. For example, through transcriptome sequencing, it is found that the expression of HMGCL is down-regulated in OS and is related to the prognosis of OS patients. Overexpression of HMGCL can inhibit the activation of the PI3K/Akt/mTOR signaling pathway mediated by β-hydroxybutyrate (β-HB), thereby suppressing the proliferation, migration, and invasion abilities of OS cells, and simultaneously inducing an increase in the level of autophagy ( 29 30 2.2.4 Notch signaling pathway The Notch signaling pathway is a key pathway for controlling cell differentiation and preservation, including osteoblast differentiation and preservation of osteoblast stem cells ( 31 in vivo in vitro ( 32 33 2.2.5 NF-κB pathway The NF-κB pathway is responsible for cell proliferation, prevention of apoptosis, and transcriptional regulation of various genes in response to injury factors and cytokines, and plays a crucial role in the pathogenesis of OS ( 34 35 36 2.2.6 p53 gene Another important mechanism is the p53-dependent pathway, which is involved in DNA damage response, cell cycle arrest, apoptosis, and tumor suppression. For example, c-Myc (Myc) directly upregulates γ-glutamylcyclotransferase (Ggct) by binding to its promoter, and deletion of the Myc binding site by genome editing weakens the tumorigenic potential of p53-deficient OS cells ( 37 38 The balance between tumor cell apoptosis and survival depends on the activities of anti-apoptotic proteins Bcl-2, Wnt and NFκB signaling pathways, as well as the ratio between the activities of mitogen-activated protein kinase (MAPK) and phosphatidylinositol-3-kinase/protein kinase B (PI3K/Akt) signaling pathways. The main signaling pathways and mechanisms of OS pathogenesis are shown in  Figure 1 Figure 1 Signaling pathways and key genes in sarcoma (key genes are shown in bold italics). Diagram illustrating cell signaling pathways and interactions among various receptors, such as RTK, GPCR, integrins, and cytokine receptors. It shows the flow of signals from extracellular molecules like survival factors and cytokines, leading to intracellular events, including gene regulation and cell proliferation. Key molecules like Akt, NF-κB, and MAPK are highlighted, alongside processes like apoptosis and TCF activation, which influence cellular outcomes. At present, the treatment methods for OS mainly include surgical resection, systemic chemotherapy, and targeted radiotherapy. Chemotherapy drugs such as doxorubicin and paclitaxel are widely used clinically ( 39 40 41 18 2.3 The core role of CSCs in osteosarcoma 2.3.1 The relationship between tumor stem cells and drug resistance and metastasis CSCs in OS possess stemness properties and chemotherapy resistance and are one of the key reasons for poor chemotherapy response. CSCs exhibit several characteristics that may confer chemotherapy resistance, such as the abnormal expression of ATP-binding cassette proteins, activation of DNA repair capabilities, and overactive apoptotic regulatory elements ( 42 43 44 The clinical treatment of metastatic OS faces severe intratumoral heterogeneity, with its overall survival rate being less than 20% ( 45 46 47 48 2.3.2 Molecular mechanism of stemness maintenance The wnt/β-catenin signaling pathway is usually in an inactive state in normal bone cells and highly differentiated cancer cells. Its signal transduction depends on the interaction between the secreted glycoprotein ligands and the signal-receiving cells. This pathway is closely related to tumors derived from epithelium and mesenchyme. Besides leukemia, colon cancer, breast cancer, and prostate cancer, it is also associated with bone tumors ( 49 50 51 52 53 Notch signaling, as a key developmental pathway regulating stem cell self-renewal, has final effects that can be influenced by the differentiation state of somatic stem cells and crosstalk with other signaling pathways ( 54 55 56 57 58 As an important regulatory pathway in embryonic development, the Hedgehog signaling pathway is involved in cell differentiation, proliferation, and self-renewal processes, and plays a role in maintaining the homeostasis of adult cells and tissues as well as the renewal of stem cells ( 59 60 61 62  Figure 2 Figure 2 Mechanisms of CSCs in regulating osteosarcoma. Flowchart depicting the interaction of various cellular pathways in cancer stem cells (CSCs). It illustrates how a hypoxic microenvironment impacts pathways like Hedgehog, Notch1, and GSK-3β. These pathways activate different transcription processes, eventually leading to the upregulation of c-Myc/CCND1. The outcomes include enhanced stemness of CSCs, self-update, chemotherapy resistance, tumor recurrence, and treatment resistance. The SPRR1A inhibitor's role in lung metastasis is also shown. 2.3.3 Immunosuppressive role of OS-specific CSCs CSCs drive immune escape in OS by secreting immunosuppressive molecules and remodeling the microenvironment, and are key factors in the immunosuppression of the OS microenvironment. They are highly heterogeneous. Genes in the stemness maintenance and differentiation subgroups are involved in the communication with tumor-associated macrophages (TAMs). For example, RARRES2 plays a role in the intercellular communication between OSCs and TAMs, and insulin-like growth factor 1 secreted by TAMs can promote the stemness maintenance of OSCs mediated by RARRES2. This interaction is jointly involved in the immunosuppressive process of the microenvironment ( 63 64 However, the elevated heterogeneity of CSCs poses a huge challenge to the treatment of OS. There are significant differences in the mechanisms of promoting metastasis and immunosuppression among different sub-populations of CSCs. Some sub-populations may mainly promote metastasis by remodeling the microenvironment, while others focus on achieving immune escape by regulating immune checkpoint molecules or secreting inhibitory factors. The diversity of these mechanisms makes single-targeted therapy difficult to be fully effective. How to accurately distinguish and specifically intervene in different functional sub-populations remains a treatment bottleneck that urgently needs to be overcome. 3 Essentials of stem cell biology 3.1 Classification and characteristics of stem cells Stem cells are a type of undifferentiated cells that exist in embryonic, fetal, and adult stages. They are the growth foundation of tissues and organs and have the characteristics of self-renewal, cloning, and multi-directional differentiation (  Table 1 65 Table 1 Summarizes the biological characteristics of ESCs, MSCs and iPSCs. Stem cell types Source Differentiation potential Ethical restrictions Clinical application challenges ESCs Inner cell mass of blastocyst Totipotency Strict ethical restrictions Risk of immune rejection, limited to basic research ( 66 68 MSCs Bone marrow, fat, umbilical cord, etc. Multidirectional differentiation No ethical controversy Batch heterogeneity ( 74 75 iPSCs Somatic cell reprogramming (factors such as Sox2/Oct3/4) pluripotent (similar to ESCs) Potential carcinogenic risk of viral vectors The differentiation efficiency is low ( 79 81 3.1.1 Embryonic stem cell Embryonic stem cells (ESCs) are taken from the inner cell mass of blastocysts. A blastocyst is a hollow sphere mainly composed of cells. In humans, blastocysts form 3 to 5 days after the fertilization of an egg cell and a sperm. During normal development, the cells in the inner cell mass will differentiate into more specialized cells and then form the entire body, that is, all the tissues and organs of the human body. ESCs have the potential to generate all cell types in the body, but are subject to strict ethical and scientific limitations in basic research and clinical translation. The International Society for Stem Cell Research (ISSCR) emphasizes strict review of research on organoids, embryos, embryo models based on stem cells, chimeric embryos, and genome editing ( 66 67 in vitro 66 68 3.1.2 Adult stem cells Adult MSCs are distributed in different tissues and can be isolated and expanded from bone marrow fat, skeletal muscle, peripheral blood, liver, skin, lung tissue, dental pulp, and neonatal-related placenta, amnion, and umbilical cord tissue ( 69 70 71 72 73 With the advancement of basic research and clinical application of MSCs, it is found that MSCs encounter many problems to be solved in the process of clinical transformation. First, MSCs therapeutic products derived from autologous or allogeneic tissues have heterogeneity (difference) between batches and within batches, which hinders large-scale production of uniform and stable cell products. SCs derived from allogeneic tissues inherently lack the capacity for personalized autologous therapy. Second, MSCs products prepared through processes such as tissue isolation, purification, and amplification cannot obtain the minimum stem cell dose required for a single treatment at a low passage number. Continuous amplification in vitro in vitro 74 75 in vitro 3.1.3 Induced pluripotent stem cells The renowned Japanese stem cell researcher Shinya Yamanaka published a series of seminal papers ( 76 77 76 78 77 in vitro 79 81 The basic clinical transformation research of iPSCs is increasingly being conducted, and there are also more and more clinical transformation studies on the differentiation of iPSCs into other functional cells (  Table 1 82 83 84 87 3.2 Tumor stem cell theory Research has found that the origin of OS cells is closely related to MSCs ( 88 89 91 92 93 94 95 96 97 Among the transcription factors that regulate the differentiation of MSCs, transforming growth factor-β (TGF-β) is an important tumor-promoting factor by promoting tumor growth, inducing epithelial-mesenchymal transition (EMT), and enhancing invasion ability. There is evidence showing that TGF-β1 can mediate the differentiation of MSCs into CAFs in colorectal cancer, and OS cells can also induce the CAF-like transformation of MSCs by secreting TGF-β1 ( 98 100 101 102 103 104 3.3 Function and application of MSCs 3.3.1 Homecoming effect As an important mechanism of cell migration, cell homing has a significant impact on organism development, tissue regeneration, and disease progression. This concept was first used to describe the property of lymphocytes in circulating blood migrating to their origin sites such as lymph nodes, and its biological behavior is similar to the homing instinct of birds ( 105 106 in-vivo MSCs naturally possess the characteristic of migrating towards various chemokine signals secreted by tumor tissues or their microenvironments, enabling them to target and colonize tumor lesions. This unique property has prompted MSCs to become a new type of active carrier for delivering anti-tumor drugs and genetic materials. The delivery system constructed based on MSCs can achieve the targeted transport of chemotherapeutic drugs (such as doxorubicin, paclitaxel, etc.), effectively solving the problems of short half-life of traditional drugs and insufficient tumor specificity ( 107 108 109 110 In vitro in vivo ( 111 3.3.2 Immune regulation MSCs can efficiently mediate the targeted delivery of therapeutic genes through genetic engineering techniques, including tumor-killing genes and immune system regulatory genes. The mechanism is closely related to the specific expression of therapeutic genes at the tumor site to achieve tumor suppression or killing effects ( 112 113 114 In terms of immune cell regulation, MSCs transplantation can lead to an increase in the proportion of CD4+FOXP3+ regulatory T cells (Tregs) in peripheral blood monocytes, while the proportion of Tregs within the B cell population shows a downward trend ( 115 + 116 117 From the perspective of cytokine regulation mechanisms, TGF-β and interleukin 10 (IL-10) are involved in the proliferation and differentiation process of Treg cells. After MSC treatment, the concentration of TGF-β increases, but the change of IL-10 is not significant ( 118 119 MSCs promote the proliferation of pancreatic islet β cells and improve hyperglycemia through the PI3K/Akt signaling pathway ( 120 121 122 4 Dynamic interactions and paradoxical effects of stem cells in the microenvironment TME, which includes immune cells, peritumoral vasculature, fibroblasts, various signaling molecules and the extracellular matrix (ECM), plays an important role in tumor progression ( 123 124 125 126 127 4.1 The “double-edged sword” effect of MSCs on tumors MSCs are a type of precursor cells with self-renewal and multi-directional proliferation potential. Under specific conditions, they can differentiate into various mesenchymal lineage cells ( 128 129 130 131 132 The immunomodulatory function of MSC is achieved through the secretion of various cytokines, including transforming growth factor (TGF-β), prostaglandin E2 (PGE2), indoleamine 2,3-dioxygenase (IDO), nitric oxide (NO), etc ( 133 135 According to functional differences, MSCs can be divided into multiple subtypes. Among these, MSC1 and MSC2 represent two key phenotypes: MSC1 exhibits pro-inflammatory properties and primarily exerts anti-tumor effects, whereas MSC2 demonstrates immunosuppressive functions and may promote tumor growth. This two-way regulatory effect on tumor development is achieved through different mechanisms: the pro-tumor effects include the secretion of growth factors, the promotion of tumor angiogenesis, and the construction of the tumor stem cell microenvironment ( 136 137 4.2 Cooperative regulation of immune cells and stem cells In the TME, macrophages, as the innate immune cell population with the largest number of infiltrations, not only play a key role in anti-tumor immunity but also possess antigen-presenting functions to activate the adaptive immune response. This type of immune cell exhibits significant phenotypic heterogeneity and functional plasticity. It can undergo phenotypic polarization in response to different microenvironmental stimuli, presenting a continuous functional spectrum ranging from anti-tumor to pro-tumor. According to differences in activation states and biological functions, macrophages are mainly divided into classically activated M1 type (pro-inflammatory phenotype) and selectively activated M2 type (anti-inflammatory phenotype). Together with mesenchymal stem cells (MSCs) in the TME, they form a two-way regulatory network for tumor development ( 138 An increasing amount of evidence indicates that tumor-associated MSCs can induce the polarization of macrophages into the M2 type, enhancing the tumor immunosuppressive microenvironment. Research has found that exosomes derived from TAMSCs infiltrating into the TME of human breast cancer can induce the differentiation of monocytic-myeloid-derived suppressor cells (M-MDSCs) into M2 macrophages, promoting tumor immune escape. At the same time, it can also enhance the epithelial-mesenchymal transition (EMT) of breast cancer cells, facilitating tumor metastasis ( 139 140 141 The IL-17 accumulated in TME can promote the generation of inducible-nitric-oxide-synthase (iNOS) in TAMSCs, upregulate the programmed cell death 1 ligand 1 (PD-L1) on the surface of TAMSCs, inhibit the normal function of T cells, and promote tumor immune escape ( 142 143 4.3 Hypoxia and metabolic reprogramming Hypoxia-inducible factor-1α (HIF-1α) can promote the continuous differentiation of cells under hypoxic conditions, promote angiogenesis, and maintain the stemness of CSCs ( 144 145 146 in vitro 147 148 5 Treatment and challenges of OS based on stem cells In recent years, a variety of emerging strategies have been developed based on stem cell biology for the treatment of OS (  Table 2 in vivo Table 2 Comparison of treatment strategies related to osteosarcoma stem cells. Treatment category Mechanism of action Represent drugs/methods Advantages Challenge CSCs-targeted drugs Inhibit stemness-maintaining pathways to induce differentiation or apoptosis of cancer stem cells (CSCs) AZD1080; 1. Specifically target the core pathways of CSCs 1. The heterogeneity of CSC leads to differences in therapeutic efficacy. 152 161 Drug delivery mediated by MSC Utilize the tumor-homing characteristics of MSC to deliver anti-cancer drugs or gene therapy vectors IDD-1040-Paclitaxel Complex; Engineered MSC Delivery of IFN-β/Oncolytic Virus 1. Enhance tumor targeting 1. Cell retention due to pulmonary first-pass effect 172 173 Gene Editing and Cell Therapy CRISPR edits the antigen target of CSC to construct highly efficient CAR-T cells CRISPR-engineered anti-CD133 CAR-T; Oncolytic adenovirus vector (oAd-SA) 1. Precisely eliminate the CSC population 1. Poor penetration of solid tumors 152 161 Optimization of drug administration routes Change the stem cell infusion route, avoid pulmonary entrapment, and enhance target tissue engraftment. Intra-arterial injection (such as renal artery, pancreatic artery) 1. Increase the local cell concentration of the lesion. 1. The operation is complex and invasive. 181 186 5.1 Drug development targeting CSCs CSCs can self-renew, differentiate, and repopulate the entire heterogeneous cancer cell population, thus explaining cancer recurrence and metastasis ( 75 149 150 151 + 152 Aberrant epigenetic regulation is closely related to tumor cell occurrence of various diseases. The occurrence and development of cancer are jointly driven by genetic variations, changes in epigenetic modifications, and environmental factors. Epigenetic activation of oncogenes and epigenetic silencing of tumor suppressor genes are key mechanisms in tumor progression. Among them, abnormal functions of DNA methyltransferases (DNMTs), histone deacetylases (HDACs), and histone methyltransferases (HMTs) are common in many types of tumors, making them important targets for anti-tumor therapy ( 153 154 155 156 157 158 159 in vitro 160 However, intratumoral heterogeneity (ITH) promotes tumor evolution, leading to tumor lethality and treatment resistance ( 161 162 163 164 165 Despite the progress in treatment, the prognosis for most patients with malignant tumors remains unfavorable, mainly due to the continuous evolution and recurrence of these tumors. The high heterogeneity and plasticity of tumors often reduce the efficacy of single-target therapies. Targeting cell fusion can limit tumor evolution and offers a promising new approach for significant progress in cancer treatment. Recent studies have investigated various strategies to inhibit cell fusion in tumors. For example, syncytin-1, a fusion-promoting protein involved in physiological and tumor-related cell fusion ( 166 167 5.2 Mesenchymal stem cells as drug delivery carriers As a powerful method to improve the efficacy of MSCs, bioengineering methods can expand the application of MSCs-based therapies, especially in anti-cancer treatments. MSCs have been modified to deliver interferons, interleukins, anti-angiogenic agents, pro-apoptotic proteins, pro-drugs, or oncolytic viruses, in order to directly induce tumor apoptosis or activate immune cells to combat tumors ( 168 in vitro 169 170 Generate overexpression of interferon-β (IFNB, IFNB-iPSCs) through genetic engineering, so as to apply it to immunotherapy and overcome the adverse consequences caused by systemic administration ( 171 109 It is worth noting that during the treatment process, MSCs may differentiate into fibroblasts to promote fibrosis or facilitate metastasis through fusion. Safety remains the most concerning issue in the clinical application of MSCs. For example, in vitro 172 173 5.3 Gene editing and CAR-T cell therapy Clustered regularly interspaced short palindromic repeats (CRISPR)/associated protein 9 (CRISPR/Cas9) has brought a revolutionary change to the field of gene therapy ( 174 175 176 177 in vivo ( 178 As a breakthrough in cancer immunotherapy, CAR-T therapy offers new treatment options for patients with relapsed and refractory malignancies. CAR-T cells are T lymphocytes that have been genetically engineered to specifically recognize and eliminate tumor cells ( 179 180 5.4 Clinical trial treatment In clinical trials, the development of biomarkers is of great importance as they can dynamically monitor the CSCs load and guide personalized treatment. In recent years, researchers have successively developed a variety of biomarkers. For example, genes such as TBX15, IGF1, GATA2, PITX2, SNAI1, and VCAN have been discovered in mesenchymal stem cells from elderly donors, which can serve as potential biomarkers to diagnose the senescence state of donor mesenchymal stem cells and evaluate whether MSCs from elderly donors can be used for clinical treatment ( 181 182 However, clinical trials have shown that when MSCs are infused via the traditional intravenous (IV) route, due to the first-pass effect of the lungs, most of the cells are trapped, resulting in a significant reduction in the number of cells reaching the target organ ( 183 184 185 186 6 Conclusion Osteosarcoma remains a formidable challenge in oncology, with CSCs serving as the linchpin of therapy resistance, metastasis, and recurrence. This review synthesizes critical advances in understanding the dual roles of stem cells in OS pathogenesis and therapy: 1.CSC-driven mechanisms involving dysregulated Wnt/β-catenin, Notch, and Hedgehog pathways (e.g., CD133/CXCR4-mediated stemness) underpin chemoresistance and immunosuppression. 2.MSC paradox: While engineered MSCs offer promise as tumor-homing drug carriers (e.g., IDD-1040-paclitaxel complexes) and immunomodulators, their capacity to differentiate into cancer-associated fibroblasts (CAFs) via TGF-β secretion exacerbates tumor progression. 3.TME dynamics: Hypoxia-induced HIF-1α activation and M2 macrophage polarization create a permissive niche for CSC resilience, necessitating microenvironment-targeted strategies. Emerging therapies—including CRISPR-edited CD133-directed CAR-T cells, CSC-specific epigenetic inhibitors (AZD1080, DNMTi/HDACi), and intra-arterial MSC delivery—show preclinical efficacy but face translational barriers: 1. CSC heterogeneity and plasticity compromise the durability of targeted therapies. 2. MSC batch variations, tumor-promoting risks (e.g., fusion-mediated PD-L1 upregulation), and pulmonary entrapment impede delivery efficiency. 3. Antigen loss associated with CAR-T therapy and the off-target effects inherent in gene editing require solutions. Future efforts must prioritize: 1. Biomarker-guided combinatorial regimens (e.g., CSC pathway inhibitors + immune checkpoint blockers) to overcome compensatory activation. 2. Advanced delivery platforms: Microenvironment-responsive MSC engineering and optimized routes (e.g., intra-arterial injection) to enhance tumor localization. 3.Translational integration: Multi-omics profiling of CSC subpopulations, patient-derived organoid models, and AI-driven drug screening to accelerate clinical validation. Ultimately, a paradigm shift toward stem cell-focused personalized therapy—addressing CSC eradication while harnessing MSC delivery precision—holds transformative potential for OS treatment. Author contributions ZS: Writing – original draft, Software, Conceptualization. XF: Investigation, Writing – original draft. HD: Writing – review & editing, Validation. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. The author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Sarangdhar M Snyder J O’Brien E VanCauwenbergh B Basu M Pressey J Abstract 3155: High-throughput drug repositioning identifies dinaciclib as a potent osteosarcoma inhibitor Cancer Res 2025 85 3155–5 10.1158/1538-7445.AM2025-3155 2 Orrapin S Moonmuang S Udomruk S Yongpitakwattana P Pruksakorn D Chaiyawat P Unlocking the tumor-immune microenvironment in osteosarcoma: insights into the immune landscape and mechanisms Front Immunol 2024 15 10.3389/fimmu.2024.1394284 39359731 PMC11444963 3 Sonbol MB Ahn DH Bekaii-Saab T Therapeutic targeting strategies of cancer stem cells in gastrointestinal Malignancies Biomedicines 2019 7 17 10.3390/biomedicines7010017 30857342 PMC6466109 4 Bajetto A Thellung S Dellacasagrande I Pagano A Barbieri F Florio T Cross talk between mesenchymal and glioblastoma stem cells: Communication beyond controversies Stem Cells Trans Med 2020 9 1310–30 10.1002/sctm.20-0161 32543030 PMC7581451 5 Kim K Bou-Ghannam S Kameishi S Oka M Grainger DW Okano T Allogeneic mesenchymal stem cell sheet therapy: A new frontier in drug delivery systems J Controlled Release 2021 330 696 704 10.1016/j.jconrel.2020.12.028 33347942 6 Youssef E Fletcher B Palmer D Enhancing precision in cancer treatment: the role of gene therapy and immune modulation in oncology Front Med 2025 11 10.3389/fmed.2024.1527600 39871848 PMC11769984 7 Kundu ZS Classification, imaging, biopsy and staging of osteosarcoma Indian J Orthopaedics 2014 48 238–46 10.4103/0019-5413.132491 24932027 PMC4052020 8 Sara DS Vito P Sebastiano C Eleonora DA Chiara B Gianluca T Benign bone tumors: an overview of what we know today J Clin Med 2022 11 699–9 10.3390/jcm11030699 35160146 PMC8836463 9 Joon CH Jae RY The 2020 WHO classification of tumors of bone: an updated review Adv Anatomic Pathol 2021 28 119–38 10.1097/PAP.0000000000000293 33480599 10 Yoshikawa H Nakase T Myoui A Ueda T Bone morphogenetic proteins in bone tumors J Orthop Sci 2004 9 334–40 10.1007/s00776-004-0764-9 15168194 11 Plate AM Lee SJ Steiner G Posner MA Tumorlike lesions and benign tumors of the hand and wrist J Am Acad Orthop Surg 2003 11 129–41 10.5435/00124635-200303000-00007 12670139 12 Alessandro F Epidemiology and classification of bone tumors Clin cases Mineral Bone Metabol: Off J Ital Soc Osteoporosis Mineral Metabol Skeletal Dis 2012 9 92–5 PMC3476517 23087718 13 Chen X Bahrami A Pappo A Easton J Dalton J Hedlund E Recurrent somatic structural variations contribute to tumorigenesis in pediatric osteosarcoma Cell Rep 2014 7 104–12 10.1016/j.celrep.2014.03.003 24703847 PMC4096827 14 Kansara M Teng MW Smyth MJ Thomas DM Translational biology of osteosarcoma Nat Rev Cancer 2014 14 722–35 10.1038/nrc3838 25319867 15 Stephens PJ Greenman CD Fu B Yang F Bignell GR Mudie LJ Massive genomic rearrangement acquired in a single catastrophic event during cancer development Cell 2011 144 27 40 10.1016/j.cell.2010.11.055 21215367 PMC3065307 16 Lorenz S Barøy T Sun J Nome T Vodák D Bryne JC Unscrambling the genomic chaos of osteosarcoma reveals extensive transcript fusion, recurrent rearrangements and frequent novel TP53 aberrations Oncotarget 2016 7 5273–88 10.18632/oncotarget.6567 26672768 PMC4868685 17 Downing JR Wilson RK Zhang J Mardis ER Pui CH Ding L The pediatric cancer genome project Nat Genet 2012 44 619–22 10.1038/ng.2287 22641210 PMC3619412 18 Strauss SJ Frezza AM Abecassis N Bajpai J Bauer S Biagini R Bone sarcomas: ESMO-EURACAN-GENTURIS-ERN PaedCan Clinical Practice Guideline for diagnosis, treatment and follow-up Ann Oncol 2021 32 1520–36 10.1016/j.annonc.2021.08.1995 34500044 19 Mirabello L Troisi RJ Savage SA Osteosarcoma incidence and survival rates from 1973 to 2004: data from the Surveillance, Epidemiology, and End Results Program Cancer 2009 115 1531–43 10.1002/cncr.24121 19197972 PMC2813207 20 Blay JY Bertuzzi A Bielack S Bjerkehagen B Bonvalot S Boukovinas I Soft Tissue and Visceral Sarcomas: ESMO Clinical Practice Guidelines for diagnosis, treatment and follow-up (vol 25, pg iii102, 2014) Ann Oncol: Off J Eur Soc Med Oncol 2015 26 175–6 10.1093/annonc/mdu254 25210080 21 Bacci G Longhi A Versari M Mercuri M Briccoli A Picci P Prognostic factors for osteosarcoma of the extremity treated with neoadjuvant chemotherapy: 15-year experience in 789 patients treated at a single institution Cancer 2006 106 1154–61 10.1002/cncr.21724 16421923 22 Bielack SS Kempf-Bielack B Delling G Exner GU Flege S Helmke K Prognostic factors in high-grade osteosarcoma of the extremities or trunk: an analysis of 1,702 patients treated on neoadjuvant cooperative osteosarcoma study group protocols J Clin Oncol 2002 20 776–90 10.1200/JCO.2002.20.3.776 11821461 23 Meyers PA Heller G Healey J Huvos A Lane J Marcove R Chemotherapy for nonmetastatic osteogenic sarcoma: the Memorial Sloan-Kettering experience J Clin Oncol 1992 10 5 15 10.1200/JCO.1992.10.1.5 1370176 24 Ferguson WS Goorin AM Current treatment of osteosarcoma Cancer Invest 2001 19 292 315 10.1081/CNV-100102557 11338887 25 Davis LE Bolejack V Ryan CW Ganjoo KN Loggers ET Chawla S Randomized double-blind phase II study of regorafenib in patients with metastatic osteosarcoma J Clin Oncol 2019 37 1424–31 10.1200/JCO.18.02374 31013172 PMC7799443 26 Wei Z Zheng D Pi W Qiu Y Xia K Guo W Isoquercitrin restrains the proliferation and promotes apoptosis of human osteosarcoma cells by inhibiting the Wnt/β-catenin pathway J Bone Oncol 2023 38 100468 10.1016/j.jbo.2023.100468 36685044 PMC9846017 27 Wei Z Xia K Liu W Huang X Wei Z Guo W CGREF1 modulates osteosarcoma proliferation by regulating the cell cycle through the Wnt/β-catenin signaling pathway Mol Med 2024 30 260 10.1186/s10020-024-01038-9 39707194 PMC11661040 28 Yang Y Yan X Chen Y Liu J Xue J Sheng X Silencing FUT4 inhibits the progression of osteosarcoma through activation of FOXO1 Curr Pharm Des 2024 30 440–7 10.2174/0113816128269432240103052108 38343056 PMC11071653 29 Liu W Xia K Huang X Wei Z Wei Z Wang X HMGCL activates autophagy in osteosarcoma through β-HB mediated inhibition of the PI3K/AKT/mTOR signaling pathway J Transl Med 2025 23 219 10.1186/s12967-025-06227-6 39985081 PMC11846287 30 Yan R Wang H Cai Z Zeng Z Mechanism of corylin inhibiting the development of osteosarcoma: regulating HMGB1/p38 MAPK signaling Discov Med 2025 37 42 54 10.24976/Discov.Med.202537192.4 39851222 31 Zhu L McManus MM Hughes DP Understanding the biology of bone sarcoma from early initiating events through late events in metastasis and disease progression Front Oncol 2013 3 230 10.3389/fonc.2013.00230 24062983 PMC3775316 32 Cheng J Zhang Y Wan R Zhou J Wu X Fan Q CEMIP promotes osteosarcoma progression and metastasis through activating notch signaling pathway Front Oncol 2022 12 919108 10.3389/fonc.2022.919108 35957875 PMC9361750 33 Jiang S Zheng Z Yuan B Yan R Yao Q Chen H MFAP2 induces epithelial-mesenchymal transformation of osteosarcoma cells by activating the Notch1 pathway Trans Cancer Res 2024 13 2847–59 10.21037/tcr-23-2035 38988940 PMC11231794 34 He JP Hao Y Wang XL Yang XJ Shao JF Guo FJ Review of the molecular pathogenesis of osteosarcoma Asian Pac J Cancer Prev 2014 15 5967–76 10.7314/APJCP.2014.15.15.5967 25124559 35 Shi Y Tang Y Sun Z Sui P Shao Y Wang Z Scutellarein inhibits osteosarcoma growth by targeting the TLR4/TRAF6/NF-κB pathway Drug Des Devel Ther 2025 19 51 64 10.2147/DDDT.S489092 39803606 PMC11720808 36 Wang L Huang Y Zhang X Chen W Dai Z Exosomes derived from FN14-overexpressing BMSCs activate the NF-κB signaling pathway to induce PANoptosis in osteosarcoma Apoptosis 2025 30 880–93 10.1007/s10495-024-02071-z 39833632 PMC11946957 37 Ueno T Otani S Date Y Katsuma Y Nagayoshi Y Ito T Myc upregulates Ggct, γ-glutamylcyclotransferase to promote development of p53-deficient osteosarcoma Cancer Sci 2024 115 2961–71 10.1111/cas.16255 38924236 PMC11462974 38 Huang G Zhang J Xu Y Wu F Fu Y Zhang X SNPs Give LACTB Oncogene-Like Functions and Prompt Tumor Progression via Dual-Regulating p53 Adv Sci 2024 11 2405907 10.1002/advs.202405907 39324579 PMC11578386 39 Spalato M Italiano A The safety of current pharmacotherapeutic strategies for osteosarcoma Expert Opin Drug Safety 2021 20 427–38 10.1080/14740338.2021.1881060 33478264 40 Chen Y Liu R Wang W Wang C Zhang N Shao X Advances in targeted therapy for osteosarcoma based on molecular classification Pharmacol Res 2021 169 105684 10.1016/j.phrs.2021.105684 34022396 41 Kushlinskii NE Fridman MV Braga EA Molecular mechanisms and microRNAs in osteosarcoma pathogenesis Biochem (Mosc) 2016 81 315–28 10.1134/S0006297916040027 27293089 42 Menéndez ST Gallego B Murillo D Rodríguez A Rodríguez R Cancer stem cells as a source of drug resistance in bone sarcomas J Clin Med 2021 10 2621 10.3390/jcm10122621 34198693 PMC8232081 43 Zhang J Wang S Bai Y Ali AM Deng J Chen Y miR-197-3p promotes osteosarcoma stemness and chemoresistance by inhibiting SPOPL J Clin Med 2023 12 1177 10.3390/jcm12031177 36769824 PMC9917813 44 Erdogan MK Usca AB Gallic acid enhances olaparib-induced cell death and attenuates olaparib resistance in human osteosarcoma U2OS cell line Curr Issues Mol Biol 2025 47 104 10.3390/cimb47020104 39996825 PMC11854715 45 Fernandes I Melo-Alvim C Lopes-Brás R Esperança-Martins M Costa L Osteosarcoma pathogenesis leads the way to new target treatments Int J Mol Sci 2021 22 813 10.3390/ijms22020813 33467481 PMC7831017 46 Martins-Neves SR Lopes ÁO do Carmo A Paiva AA Simões PC Abrunhosa AJ Therapeutic implications of an enriched cancer stem-like cell population in a human osteosarcoma cell line BMC Cancer 2012 12 139 10.1186/1471-2407-12-139 22475227 PMC3351999 47 He A Qi W Huang Y Feng T Chen J Sun Y CD133 expression predicts lung metastasis and poor prognosis in osteosarcoma patients: A clinical and experimental study Exp Ther Med 2012 4 435–41 10.3892/etm.2012.603 23181114 PMC3503795 48 Xu E Huang Z Zhu K Hu J Ma X Wang Y Thrombospondin 1 promotes cytoskeleton remodeling, dedifferentiation, and pulmonary metastasis through ITGA1 and ITGA6 in osteosarcoma Int J Biol Sci 2025 21 2083–100 10.7150/ijbs.93678 40083708 PMC11900803 49 Danieau G Morice S Rédini F Verrecchia F Royer BB New insights about the wnt/β-catenin signaling pathway in primary bone tumors and their microenvironment: A promising target to develop therapeutic strategies Int J Mol Sci 2019 20 3751 10.3390/ijms20153751 31370265 PMC6696068 50 Neiheisel A Kaur M Ma N Havard P Shenoy AK Wnt pathway modulators in cancer therapeutics: An update on completed and ongoing clinical trials Int J Cancer 2022 150 727–40 10.1002/ijc.33811 34536299 51 Yu F Yu C Li F Zuo Y Wang Y Yao L Wnt/β-catenin signaling in cancers and targeted therapies Signal Transduct Target Ther 2021 6 307 10.1038/s41392-021-00701-5 34456337 PMC8403677 52 Qiao Y Shen L Zhang Y Zhou M Sun Z Boldine promotes stemness of human urine-derived stem cells by activating the Wnt/β-catenin signaling pathway Mol Cell Biochem 2024 479 243–54 10.1007/s11010-023-04721-3 37036633 53 Haipeng H Xueshun Y Yanyan C Tianyong H Baohui C Ruitian D Semaphorin 3A Confers Protection against Oxidative Stress-induced Damage in Periodontal Ligament Stem Cells through the Activation of the Wnt/β-catenin Signaling Pathway Curr Stem Cell Res Ther 2025 20 1 12 10.2174/011574888X343230250107145153 39871562 54 Majumder S Crabtree JS Golde TE Minter LM Osborne BA Miele L Targeting Notch in oncology: the path forward Nat Rev Drug Discov 2021 20 125–44 10.1038/s41573-020-00091-3 33293690 55 Misiorek JO Przybyszewska-Podstawka A Kałafut J Paziewska B Rolle K Rivero-Müller A Context matters: NOTCH signatures and pathway in cancer progression and metastasis Cells 2021 10 94 10.3390/cells10010094 33430387 PMC7827494 56 Moore G Annett S McClements L Robson T Top notch targeting strategies in cancer: A detailed overview of recent insights and current perspectives Cells 2020 9 1503 10.3390/cells9061503 32575680 PMC7349363 57 Wu F Yu H The role of the NOTCH1 signaling pathway in the maintenance of mesenchymal stem cell stemness and chondrocyte differentiation and its potential in the treatment of osteoarthritis J Orthopaedic Surg Res 2025 19 772 10.1186/s13018-024-05236-3 39754211 PMC11697486 58 Yan B Lu Q Gao T Xiao K Zong Q Lv H CD146 regulates the stemness and chemoresistance of hepatocellular carcinoma via JAG2-NOTCH signaling Cell Death Dis 2025 16 150 10.1038/s41419-025-07470-x 40032820 PMC11876685 59 Jeng KS Sheen IS Leu CM Tseng PH Chang CF The role of smoothened in cancer Int J Mol Sci 2020 21 6863 10.3390/ijms21186863 32962123 PMC7555769 60 Cheng DD Li J Li SJ Yang QC Fan CY CNOT1 cooperates with LMNA to aggravate osteosarcoma tumorigenesis through the Hedgehog signaling pathway Mol Oncol 2017 11 388 404 10.1002/1878-0261.12043 28188704 PMC5527480 61 Mingyang J Ke Z Yang H Shenyi L Guiqing W Kaicheng L The IFT80/hedgehog pathway regulates the osteogenic-adipogenic differentiation of bone marrow mesenchymal stem cells Curr Med Chem 2024 31 1 15 10.2174/0109298673300113240418050128 38644709 62 Zhang Z Yang J Liu R Ma J Wang K Wang X Inhibiting HMGCR represses stemness and metastasis of hepatocellular carcinoma via Hedgehog signaling Genes Dis 2024 11 101285 10.1016/j.gendis.2024.101285 39022130 PMC11252768 63 Ma J Chen Z Li Q Wang L Chen J Yang X RARRES2 is involved in the “lock-and-key” interactions between osteosarcoma stem cells and tumor-associated macrophages Sci Rep 2024 14 2267 10.1038/s41598-024-52738-5 38280909 PMC10821905 64 Guo L Yan T Guo W Niu J Wang W Ren T Molecular subtypes of osteosarcoma classified by cancer stem cell related genes define immunological cell infiltration and patient survival Front Immunol 2022 13 10.3389/fimmu.2022.986785 36059448 PMC9437352 65 Du P Wu J Hallmarks of totipotent and pluripotent stem cell states Cell Stem Cell 2024 31 312–33 10.1016/j.stem.2024.01.009 38382531 PMC10939785 66 Anthony E Lovell-Badge R Morrison SJ New guidelines for stem cell and embryo research from the ISSCR Cell Stem Cell 2021 28 991–2 10.1016/j.stem.2021.05.009 34087160 67 Clark AT Brivanlou A Fu J Kato K Mathews D Niakan KK Human embryo research, stem cell-derived embryo models and in vitro Stem Cell Rep 2021 16 1416–24 10.1016/j.stemcr.2021.05.008 34048690 PMC8190666 68 Matthews KR Moralí D National human embryo and embryoid research policies: a survey of 22 top research-intensive countries Regener Med 2020 15 1905–17 10.2217/rme-2019-0138 32799737 69 Li C Wang B Mesenchymal stem/stromal cells in progressive fibrogenic involvement and anti-fibrosis therapeutic properties Front Cell Dev Biol 2022 10 902677 10.3389/fcell.2022.902677 35721482 PMC9198494 70 Squillaro T Peluso G Galderisi U Clinical trials with mesenchymal stem cells: an update Cell Transpl 2016 25 829–48 10.3727/096368915X689622 26423725 71 Li C Zhao H Wang B Challenges for mesenchymal stem cell-based therapy for COVID-19 Drug Des Devel Ther 2020 14 3995 4001 10.2147/DDDT.S269407 33061304 PMC7533900 72 Li CH Zhao J Zhang HY Wang B Banking of perinatal mesenchymal stem/stromal cells for stem cell-based personalized medicine over lifetime: Matters arising World J Stem Cells 2023 15 105–19 10.4252/wjsc.v15.i4.105 37181005 PMC10173813 73 Devireddy LR Boxer L Myers MJ Skasko M Screven R Questions and challenges in the development of mesenchymal stromal/stem cell-based therapies in veterinary medicine Tissue Eng Part B Rev 2017 23 462–70 10.1089/ten.teb.2016.0451 28142381 74 Li C Zhao H Cheng L Wang B Allogeneic vs. autologous mesenchymal stem/stromal cells in their medication practice Cell Biosci 2021 11 187 10.1186/s13578-021-00698-y 34727974 PMC8561357 75 Gupta A Orchard PJ Miller WP Nascene DR Raymond GV Loes DJ Failure of intrathecal allogeneic mesenchymal stem cells to halt progressive demyelination in two boys with cerebral adrenoleukodystrophy Stem Cells Transl Med 2020 9 554–8 10.1002/sctm.19-0304 32020747 PMC7180290 76 Takahashi K Tanabe K Ohnuki M Narita M Ichisaka T Tomoda K Induction of pluripotent stem cells from adult human fibroblasts by defined factors Cell 2007 131 861–72 10.1016/j.cell.2007.11.019 18035408 77 Okita K Nakagawa M Hyenjong H Ichisaka T Yamanaka S Generation of mouse induced pluripotent stem cells without viral vectors Science 2008 322 949–53 10.1126/science.1164270 18845712 78 Aprile D Patrone D Peluso G Galderisi U Multipotent/pluripotent stem cell populations in stromal tissues and peripheral blood: exploring diversity, potential, and therapeutic applications Stem Cell Res Ther 2024 15 139 10.1186/s13287-024-03752-x 38735988 PMC11089765 79 Ikeda K Nagata S Okitsu T Takeuchi S Cell fiber-based three-dimensional culture system for highly efficient expansion of human induced pluripotent stem cells Sci Rep 2017 7 2850 10.1038/s41598-017-03246-2 28588295 PMC5460280 80 Murase Y Yabuta Y Ohta H Yamashiro C Nakamura T Yamamoto T Long-term expansion with germline potential of human primordial germ cell-like cells in vitro EMBO J 2020 39 e104929 10.15252/embj.2020104929 32954504 PMC7604613 81 Zweigerdt R Olmer R Singh H Haverich A Martin U Scalable expansion of human pluripotent stem cells in suspension culture Nat Protoc 2011 6 689 700 10.1038/nprot.2011.318 21527925 82 Jiang X Yang Z Dong M Cardiac repair in a murine model of myocardial infarction with human induced pluripotent stem cell-derived cardiomyocytes Stem Cell Res Ther 2020 11 297 10.1186/s13287-020-01811-7 32680540 PMC7368795 83 Xuan W Khan M Ashraf M Pluripotent stem cell-induced skeletal muscle progenitor cells with givinostat promote myoangiogenesis and restore dystrophin in injured Duchenne dystrophic muscle Stem Cell Res Ther 2021 12 131 10.1186/s13287-021-02174-3 33579366 PMC7881535 84 Lian Q Zhang Y Zhang J Zhang HK Wu X Zhang Y Functional mesenchymal stem cells derived from human induced pluripotent stem cells attenuate limb ischemia in mice Circulation 2010 121 1113–23 10.1161/CIRCULATIONAHA.109.898312 20176987 85 Jeong J Shin K Lee SB Lee DR Kwon H Patient-tailored application for Duchene muscular dystrophy on mdx mice based induced mesenchymal stem cells Exp Mol Pathol 2014 97 253–8 10.1016/j.yexmp.2014.08.001 25102299 86 Zhao Q Gregory CA Lee RH Reger RL Qin L Hai B MSCs derived from iPSCs with a modified protocol are tumor-tropic but have much less potential to promote tumors than bone marrow MSCs Proc Natl Acad Sci U S A 2015 112 530–5 10.1073/pnas.1423008112 25548183 PMC4299223 87 Huang J U K P Yang F Ji Z Lin J Weng Z Human pluripotent stem cell-derived ectomesenchymal stromal cells promote more robust functional recovery than umbilical cord-derived mesenchymal stromal cells after hypoxic-ischaemic brain damage Theranostics 2022 12 143–66 10.7150/thno.57234 34987639 PMC8690936 88 Gaebler M Silvestri A Haybaeck J Reichardt P Lowery CD Stancato LF Three-dimensional patient-derived in vitro Front Oncol 2017 7 203 10.3389/fonc.2017.00203 28955656 PMC5601986 89 Mueller MM Fusenig NE Friends or foes - bipolar effects of the tumour stroma in cancer Nat Rev Cancer 2004 4 839–49 10.1038/nrc1477 15516957 90 Liotta LA Kohn EC The microenvironment of the tumour-host interface Nature 2001 411 375–9 10.1038/35077241 11357145 91 Turley SJ Cremasco V Astarita JL Immunological hallmarks of stromal cells in the tumour microenvironment Nat Rev Immunol 2015 15 669–82 10.1038/nri3902 26471778 92 Ishii G Ochiai A Neri S Phenotypic and functional heterogeneity of cancer-associated fibroblast within the tumor microenvironment Adv Drug Delivery Rev 2016 99 186–96 10.1016/j.addr.2015.07.007 26278673 93 Zhihao Z Cheng J Xiaoshuang Z Yangguang M Tingyu W Yongyong Y Cancer-associated fibroblast infiltration in osteosarcoma: the discrepancy in subtypes pathways and immunosuppression Front Pharmacol 2023 14 1136960 10.3389/fphar.2023.1136960 37441535 PMC10333483 94 Zhang W Shao Z Research trends and hotspots in the immune microenvironment related to osteosarcoma and tumor cell aging: a bibliometric and visualization study Front Endocrinol (Lausanne) 2023 14 1289319 10.3389/fendo.2023.1289319 38027171 PMC10663373 95 Wang YM Wang W Qiu ED Osteosarcoma cells induce differentiation of mesenchymal stem cells into cancer associated fibroblasts through Notch and Akt signaling pathway Int J Clin Exp Pathol 2017 10 8479–86 31966700 PMC6965449 96 Pan C Liu P Ma D Zhang S Ni M Fang Q Bone marrow mesenchymal stem cells in microenvironment transform into cancer-associated fibroblasts to promote the progression of B-cell acute lymphoblastic leukemia BioMed Pharmacother 2020 130 110610 10.1016/j.biopha.2020.110610 34321159 97 Pietrovito L Leo A Gori V Lulli M Parri M Becherucci V Bone marrow-derived mesenchymal stem cells promote invasiveness and transendothelial migration of osteosarcoma cells via a mesenchymal to amoeboid transition Mol Oncol 2018 12 659–76 10.1002/1878-0261.12189 29517849 PMC5928379 98 Ge R Huang GM Targeting transforming growth factor beta signaling in metastatic osteosarcoma J Bone Oncol 2023 43 100513 10.1016/j.jbo.2023.100513 38021074 PMC10666000 99 Tan HX Cao ZB He TT Huang T Xiang CL Liu Y TGFβ1 is essential for MSCs-CAFs differentiation and promotes HCT116 cells migration and invasion via JAK/STAT3 signaling Oncol Targets Ther 2019 12 5323–34 10.2147/OTT.S178618 31308702 PMC6615717 100 Tan HX Xiao ZG Huang T Fang ZX Liu Y Huang ZC CXCR4/TGF-β1 mediated self-differentiation of human mesenchymal stem cells to carcinoma-associated fibroblasts and promoted colorectal carcinoma development Cancer Biol Ther 2020 21 248–57 10.1080/15384047.2019.1685156 31818187 PMC7012141 101 Zhang Y Xu Y Qiu G Luo Y Bao Y Lu J METTL3 mediated MALAT1 m6A modification promotes proliferation and metastasis in osteosarcoma cells Mol Biotechnol 2024 66 3538–48 10.1007/s12033-023-00953-2 37897586 102 Zhou X Yang Y Li Y Liang G Kang D Zhou B METTL3 Contributes to Osteosarcoma Progression by Increasing DANCR mRNA Stability via m6A Modification Front Cell Dev Biol 2021 9 784719 10.3389/fcell.2021.784719 35096816 PMC8790117 103 Wang Q Geng W Guo H Wang Z Xu K Chen C Emerging role of RNA methyltransferase METTL3 in gastrointestinal cancer J Hematol Oncol 2020 13 57 10.1186/s13045-020-00895-1 32429972 PMC7238608 104 Song C Zhou C HOXA10 mediates epithelial-mesenchymal transition to promote gastric cancer metastasis partly via modulation of TGFB2/Smad/METTL3 signaling axis J Exp Clin Cancer Res 2021 40 62 10.1186/s13046-021-01859-0 33563300 PMC7874610 105 Gallatin WM Weissman IL Butcher EC A cell-surface molecule involved in organ-specific homing of lymphocytes Nature 1983 304 30–4 10.1038/304030a0 6866086 106 Nakao N Nakayama T Yahata T Muguruma Y Saito S Miyata Y Adipose tissue-derived mesenchymal stem cells facilitate hematopoiesis in vitro in vivo Am J Pathol 2010 177 547–54 10.2353/ajpath.2010.091042 20558580 PMC2913350 107 Wei H Chen J Wang S Fu F Zhu X Wu C A nanodrug consisting of doxorubicin and exosome derived from mesenchymal stem cells for osteosarcoma treatment in vitro Int J Nanomed 2019 14 8603–10 10.2147/IJN.S218988 31802872 PMC6830377 108 Zhou Y Zhou W Chen X Wang Q Li C Chen Q Bone marrow mesenchymal stem cells-derived exosomes for penetrating and targeted chemotherapy of pancreatic cancer Acta Pharm Sin B 2020 10 1563–75 10.1016/j.apsb.2019.11.013 32963950 PMC7488356 109 Kong T Seo SK Han YS Seo WM Kim B Kim J Primed mesenchymal stem cells by IFN-γ and IL-1β Ameliorate acute respiratory distress syndrome through enhancing homing effect and immunomodulation Biomol Ther (Seoul) 2025 33 311–24 10.4062/biomolther.2025.004 39973472 PMC11893491 110 Wang C Rong X Zhang F Mu X Jiang J Cryo-trojan mesenchymal stem cells as non-living tumor-homing supercarriers for enhanced drug delivery and immune activation in prostate cancer Mater Today Bio 2025 32 101650 10.1016/j.mtbio.2025.101650 40151804 PMC11937679 111 Hou JY Wu H Li SM Li XJ Yang SJ Chen XX ELABELA promotes the migration and homing of bone marrow mesenchymal stem cells to myocardial injury sites through the ERK1/2/miR-299a-5p/Exo70 pathway Front Pharmacol 2025 16 1541869 10.3389/fphar.2025.1541869 39963243 PMC11831049 112 Hassanzadeh A Shamlou S Yousefi N Nikoo M Verdi J Genetically-modified stem cell in regenerative medicine and cancer therapy; A new era Curr Gene Ther 2022 22 23 39 10.2174/1566523221666210707125342 34238158 113 Almeida A Lira R Oliveira M Martins M Azevedo Y Silva KR Bone marrow-derived mesenchymal stem cells transplantation ameliorates renal injury through anti-fibrotic and anti-inflammatory effects in chronic experimental renovascular disease BioMed J 2022 45 629–41 10.1016/j.bj.2021.07.009 34333108 PMC9486239 114 Chen F Chen N Xia C Wang H Shao L Zhou C Mesenchymal stem cell therapy in kidney diseases: potential and challenges Cell Transpl 2023 32 4251 10.1177/09636897231164251 37013255 PMC10074620 115 Vivarelli M Colucci M Algeri M Zotta F Emma F L’Erario I A phase I study of autologous mesenchymal stromal cells for severe steroid-dependent nephrotic syndrome JCI Insight 2023 8 e169424 10.1172/jci.insight.169424 37561590 PMC10561718 116 Yuan X Qin X Wang D Zhang Z Tang X Gao X Mesenchymal stem cell therapy induces FLT3L and CD1c(+) dendritic cells in systemic lupus erythematosus patients Nat Commun 2019 10 2498 10.1038/s41467-019-10491-8 31175312 PMC6555800 117 Perico N Remuzzi G Griffin MD Cockwell P Maxwell AP Casiraghi F Safety and preliminary efficacy of mesenchymal stromal cell (ORBCEL-M) therapy in diabetic kidney disease: A randomized clinical trial (NEPHSTROM) J Am Soc Nephrol 2023 34 1733–51 10.1681/ASN.0000000000000189 37560967 PMC10561817 118 Sun L Wang D Liang J Zhang H Feng X Wang H Umbilical cord mesenchymal stem cell transplantation in severe and refractory systemic lupus erythematosus Arthritis Rheumatol 2010 62 2467–75 10.1002/art.27548 20506343 119 Trigo CM Rodrigues JS Camões SP Solá S Miranda JP Mesenchymal stem cell secretome for regenerative medicine: Where do we stand J Adv Res 2025 70 103–24 10.1016/j.jare.2024.05.004 38729561 PMC11976416 120 Gao X Song L Shen K Wang H Qian M Niu W Bone marrow mesenchymal stem cells promote the repair of islets from diabetic mice through paracrine actions Mol Cell Endocrinol 2014 388 41 50 10.1016/j.mce.2014.03.004 24667703 121 Ji AT Chang YC Fu YJ Lee OK Ho JH Niche-dependent regulations of metabolic balance in high-fat diet-induced diabetic mice by mesenchymal stromal cells Diabetes 2015 64 926–36 10.2337/db14-1042 25277392 122 Liu Y Chen J Liang H Cai Y Li X Yan L Human umbilical cord-derived mesenchymal stem cells not only ameliorate blood glucose but also protect vascular endothelium from diabetic damage through a paracrine mechanism mediated by MAPK/ERK signaling Stem Cell Res Ther 2022 13 258 10.1186/s13287-022-02927-8 35715841 PMC9205155 123 de Visser KE Joyce JA The evolving tumor microenvironment: From cancer initiation to metastatic outgrowth Cancer Cell 2023 41 374 403 10.1016/j.ccell.2023.02.016 36917948 124 Cheng M Chen S Li K Wang G Xiong G Ling R CD276-dependent efferocytosis by tumor-associated macrophages promotes immune evasion in bladder cancer Nat Commun 2024 15 2818 10.1038/s41467-024-46735-5 38561369 PMC10985117 125 Zhou Y Yang D Yang Q Lv X Huang W Zhou Z Single-cell RNA landscape of intratumoral heterogeneity and immunosuppressive microenvironment in advanced osteosarcoma Nat Commun 2020 11 6322 10.1038/s41467-020-20059-6 33303760 PMC7730477 126 Armingol E Officer A Harismendy O Lewis NE Deciphering cell-cell interactions and communication from gene expression Nat Rev Genet 2021 22 71 88 10.1038/s41576-020-00292-x 33168968 PMC7649713 127 van Niel G Carter DRF Clayton A Lambert DW Raposo G Vader P Challenges and directions in studying cell-cell communication by extracellular vesicles Nat Rev Mol Cell Biol 2022 23 369–82 10.1038/s41580-022-00460-3 35260831 128 Chen J Ji T Wu D Jiang S Zhao J Lin H Author Correction: Human mesenchymal stem cells promote tumor growth via MAPK pathway and metastasis by epithelial mesenchymal transition and integrin α5 in hepatocellular carcinoma Cell Death Dis 2019 10 488 10.1038/s41419-019-1721-z 31221997 PMC6586616 129 Mahjoor M Afkhami H Mollaei M Nasr A Shahriary S Khorrami S MicroRNA-30c delivered by bone marrow-mesenchymal stem cells induced apoptosis and diminished cell invasion in U-251 glioblastoma cell line Life Sci 2021 279 119643 10.1016/j.lfs.2021.119643 34048811 130 Mushahary D Spittler A Kasper C Weber V Charwat V Isolation, cultivation, and characterization of human mesenchymal stem cells Cytometry A 2018 93 19 31 10.1002/cyto.a.23242 29072818 131 Mahjoor M Afkhami H Najafi M Nasr A Khorrami S The role of microRNA-30c in targeting interleukin 6, as an inflammatory cytokine, in the mesenchymal stem cell: a therapeutic approach in colorectal cancer J Cancer Res Clin Oncol 2023 149 3149–60 10.1007/s00432-022-04123-w 35876950 PMC11797002 132 Montesinos JJ Flores-Figueroa E Castillo-Medina S Flores-Guzmán P Hernández-Estévez E Fajardo-Orduña G Human mesenchymal stromal cells from adult and neonatal sources: comparative analysis of their morphology, immunophenotype, differentiation patterns and neural protein expression Cytotherapy 2009 11 163–76 10.1080/14653240802582075 19152152 133 Soleymaninejadian E Pramanik K Samadian E Immunomodulatory properties of mesenchymal stem cells: cytokines and factors Am J Reprod Immunol 2012 67 1 8 10.1111/j.1600-0897.2011.01069.x 21951555 134 Mahmoudvand G Karimi Rouzbahani A Razavi ZS Mahjoor M Afkhami H Mesenchymal stem cell therapy for non-healing diabetic foot ulcer infection: New insight Front Bioeng Biotechnol 2023 11 1158484 10.3389/fbioe.2023.1158484 37122856 PMC10133463 135 Mirshekar M Afkhami H Razavi S Masjedian Jazi F Darban-Sarokhalil D Ohadi E Potential antibacterial activity and healing effect of topical administration of bone marrow and adipose mesenchymal stem cells encapsulated in collagen-fibrin hydrogel scaffold on full-thickness burn wound infection caused by Pseudomonas aeruginosa Burns 2023 49 1944–57 10.1016/j.burns.2023.01.005 38042618 136 Ramdasi S Sarang S Viswanathan C Potential of Mesenchymal Stem Cell based application in Cancer Int J Hematol Oncol Stem Cell Res 2015 9 95 103 25922650 PMC4410295 137 Atiya H Frisbie L Pressimone C Coffman L Mesenchymal stem cells in the tumor microenvironment Adv Exp Med Biol 2020 1234 31 42 10.1007/978-3-030-37184-5_3 32040853 138 Trivanović D Krstić J Djordjević IO Mojsilović S Santibanez JF Bugarski D The roles of mesenchymal stromal/stem cells in tumor microenvironment associated with inflammation Mediators Inflamm 2016 2016 7314016 10.1155/2016/7314016 27630452 PMC5007366 139 Biswas S Mandal G Roy Chowdhury S Purohit S Payne KK Anadon C Exosomes produced by mesenchymal stem cells drive differentiation of myeloid cells into immunosuppressive M2-polarized macrophages in breast cancer J Immunol 2019 203 3447–60 10.4049/jimmunol.1900692 31704881 PMC6994919 140 Babazadeh S Nassiri SM Siavashi V Sahlabadi M Hajinasrollah M Zamani-Ahmadmahmudi M Macrophage polarization by MSC-derived CXCL12 determines tumor growth Cell Mol Biol Lett 2021 26 30 10.1186/s11658-021-00273-w 34174813 PMC8236206 141 Yamada K Uchiyama A Uehara A Perera B Ogino S Yokoyama Y MFG-E8 drives melanoma growth by stimulating mesenchymal stromal cell-induced angiogenesis and M2 polarization of tumor-associated macrophages Cancer Res 2016 76 4283–92 10.1158/0008-5472.CAN-15-2812 27197197 PMC5033700 142 Wang S Wang G Zhang L Li F Liu K Wang Y Interleukin-17 promotes nitric oxide-dependent expression of PD-L1 in mesenchymal stem cells Cell Biosci 2020 10 73 10.1186/s13578-020-00431-1 32509271 PMC7249370 143 Cascio S Chandler C Zhang L Sinno S Gao B Onkar S Cancer-associated MSC drive tumor immune exclusion and resistance to immunotherapy, which can be overcome by Hedgehog inhibition Sci Adv 2021 7 eabi5790 10.1126/sciadv.abi5790 34767446 PMC8589308 144 Jianxin W Lei Y Yi L Bing X Xiaojian Y Hong Z Hypoxia regulates adipose mesenchymal stem cells proliferation, migration, and nucleus pulposus-like differentiation by regulating endoplasmic reticulum stress via the HIF-1α pathway J Orthop Surg Res 2023 18 339 37158945 10.1186/s13018-023-03818-1 PMC10169485 145 Kim W Park A Jang HH Kim SE Park KS Breast tumor cell-stimulated bone marrow-derived mesenchymal stem cells promote the sprouting capacity of endothelial cells by promoting VEGF expression, mediated in part through HIF-1α Increase Cancers (Basel) 2022 14 4711 10.3390/cancers14194711 36230633 PMC9562024 146 Lin S Zhu B Huang G Zeng Q Wang C Microvesicles derived from human bone marrow mesenchymal stem cells promote U2OS cell growth under hypoxia: the role of PI3K/AKT and HIF-1α Hum Cell 2019 32 64 74 10.1007/s13577-018-0224-z 30506278 147 Ren H Liu M Jihu Y Zeng H Yao C Yan H Hypoxia activates the PI3K/AKT/HIF-1α pathway to promote the anti-inflammatory effect of adipose mesenchymal stem cells Acta Histochem 2023 125 152042 10.1016/j.acthis.2023.152042 37137202 148 Kong F Xia P Shi Y Ye Z Zhang X Yu C Ultrasound-targeted microbubble destruction facilitates cartilage repair through increased the migration of mesenchymal stem cells via HIF-1α-mediated glycolysis pathway in rats Biochem Biophys Res Commun 2024 726 150229 10.1016/j.bbrc.2024.150229 38908346 149 Batlle E Clevers H Cancer stem cells revisited Nat Med 2017 23 1124–34 10.1038/nm.4409 28985214 150 Aadilah O Paul R Clement P Inhibition of the sonic hedgehog pathway using small molecule inhibitors: targeting colon cancer stem cells Curr Cancer Ther Rev 2023 19 138–55 10.2174/1573394718666220822175032 151 Choi JH Jang TY Jeon SE Kim JH Lee CJ Yun HJ The small-molecule wnt inhibitor ICG-001 efficiently inhibits colorectal cancer stemness and metastasis by suppressing MEIS1 expression Int J Mol Sci 2021 22 13413 10.3390/ijms222413413 34948208 PMC8704261 152 Saran U Chandrasekaran B Tyagi A Shukla V Singh A Sharma AK Corrigendum: A small molecule inhibitor of Notch1 modulates stemness and suppresses breast cancer cell growth Front Pharmacol 2024 15 1420266 10.3389/fphar.2024.1420266 38860169 PMC11163072 153 Yu X Zhao H Wang R Chen Y Ouyang X Li W Cancer epigenetics: from laboratory studies and clinical trials to precision medicine Cell Death Discov 2024 10 28 10.1038/s41420-024-01803-z 38225241 PMC10789753 154 Hanahan D Hallmarks of cancer: new dimensions Cancer Discov 2022 12 31 46 10.1158/2159-8290.CD-21-1059 35022204 155 Short NJ Kantarjian H Hypomethylating agents for the treatment of myelodysplastic syndromes and acute myeloid leukemia: Past discoveries and future directions Am J Hematol 2022 97 1616–26 10.1002/ajh.26667 35871436 156 Mullard A FDA approves an inhibitor of a novel ‘epigenetic writer’ Nat Rev Drug Discov 2020 19 156 10.1038/d41573-020-00024-0 32127673 157 Ferrer-Diaz AI Sinha G Petryna A Gonzalez-Bermejo R Kenfack Y Adetayo O Revealing role of epigenetic modifiers and DNA oxidation in cell-autonomous regulation of Cancer stem cells Cell Commun Signal 2024 22 119 10.1186/s12964-024-01512-1 38347590 PMC10863086 158 Irimia R Piccaluga PP Histone deacetylase inhibitors for peripheral T-cell lymphomas Cancers (Basel) 2024 16 3359 10.3390/cancers16193359 39409979 PMC11482620 159 Miyamoto T Fukase N Kawamoto T Fujiwara S Hara H Sawada R SPRR1A is a potential therapeutic target for osteosarcoma: in vitro in vivo Oncol Rep 2025 53 24 10.3892/or.2024.8857 39704263 PMC11667212 160 Guo P Lou Z Gong H Hou X Zhang C Wang B AZD1080, a specific inhibitor of GSK−3&beta;, inhibits stemness and Malignancies in osteosarcoma cancer stem−like cells Mol Med Rep 2025 32 248 10.3892/mmr.2025.13613 40641129 PMC12272150 161 Greaves M Evolutionary determinants of cancer Cancer Discov 2015 5 806–20 10.1158/2159-8290.CD-15-0439 26193902 PMC4539576 162 McGranahan N Swanton C Clonal heterogeneity and tumor evolution: past, present, and the future Cell 2017 168 613–28 10.1016/j.cell.2017.01.018 28187284 163 Melzer C von der Ohe J Hass R Enhanced metastatic capacity of breast cancer cells after interaction and hybrid formation with mesenchymal stroma/stem cells (MSC) Cell Commun Signal 2018 16 2 10.1186/s12964-018-0215-4 29329589 PMC5795285 164 Mawaribuchi S Iida M Haramoto Y Fusion of breast cancer MCF-7 cells with mesenchymal stem cells rearranges interallelic gene expression and enhances cancer Malignancy Biochem Biophys Res Commun 2024 736 150887 10.1016/j.bbrc.2024.150887 39461012 165 Tajima Y Shibasaki F Masai H Cell fusion upregulates PD-L1 expression for evasion from immunosurveillance Cancer Gene Ther 2024 31 158–73 10.1038/s41417-023-00693-0 37990063 166 Dittmar T Hass R Intrinsic signalling factors associated with cancer cell-cell fusion Cell Commun Signal 2023 21 68 10.1186/s12964-023-01085-5 37016404 PMC10071245 167 Han D He XY Huang Y Gao M Guo T Ren XH A multifunctional delivery system for remodulating cell behaviors of circulating Malignant cells to prevent cell fusion Adv Sci (Weinh) 2023 10 e2303309 10.1002/advs.202303309 37590231 PMC10582411 168 Švajger U Kamenšek U Interleukins and interferons in mesenchymal stromal stem cell-based gene therapy of cancer Cytokine Growth Factor Rev 2024 77 76 90 10.1016/j.cytogfr.2024.03.002 38508954 169 Abu-Lafi S Falah M Zeidan M Rayan M Rayan A Expanding paclitaxel’s therapeutic window: Investigating the pharmacokinetic, clinical formulation and mechanistic aspects of paclitaxel−lipoate conjugate Oncol Lett 2025 29 216 10.3892/ol.2025.14962 40093869 PMC11907689 170 Yang Q Shu Y Chen Y Qi Z Hu S Zhang Y Expression of SIRPα-Fc by oncolytic virus enhances antitumor efficacy through tumor microenvironment reprogramming Front Immunol 2025 16 1513555 10.3389/fimmu.2025.1513555 40070841 PMC11893986 171 Sheveleva O Protasova E Grigor’eva E Butorina N Kuziaeva V Antonov D The generation of genetically engineered human induced pluripotent stem cells overexpressing IFN-β for future experimental and clinically oriented studies Int J Mol Sci 2024 25 12456 10.3390/ijms252212456 39596521 PMC11595023 172 Yue F Zhao Y Lv Y Li S Wang W Li Y Anti-tumor effects of sheep umbilical cord mesenchymal stem cells on melanoma cells Int J Mol Sci 2025 26 426 10.3390/ijms26010426 39796281 PMC11720557 173 Lim SK Khoo BY An overview of mesenchymal stem cells and their potential therapeutic benefits in cancer therapy Oncol Lett 2021 22 785 10.3892/ol.2021.13046 34594426 PMC8456491 174 Wang JY Doudna JA CRISPR technology: A decade of genome editing is only the beginning Science 2023 379 eadd8643 10.1126/science.add8643 36656942 175 Manguso RT Pope HW Zimmer MD Brown FD Yates KB Miller BC  In vivo Nature 2017 547 413–8 10.1038/nature23270 28723893 PMC5924693 176 Vaghari-Tabari M Hassanpour P Sadeghsoltani F Malakoti F Alemi F Qujeq D CRISPR/Cas9 gene editing: a new approach for overcoming drug resistance in cancer Cell Mol Biol Lett 2022 27 49 10.1186/s11658-022-00348-2 35715750 PMC9204876 177 Dimitri A Herbst F Fraietta JA Engineering the next-generation of CAR T-cells with CRISPR-Cas9 gene editing Mol Cancer 2022 21 78 10.1186/s12943-022-01559-z 35303871 PMC8932053 178 Rouatbi N Walters AA Zam A Lim YM Marrocu A Liam-Or R CD47 knock-out using CRISPR-cas9 RNA lipid nanocarriers results in reduced mesenchymal glioblastoma growth in vivo Adv Sci (Weinh) 2025 12 e2407262 10.1002/advs.202407262 39888280 PMC11948039 179 Huang R Li X He Y Zhu W Gao L Liu Y Recent advances in CAR-T cell engineering J Hematol Oncol 2020 13 86 10.1186/s13045-020-00910-5 32616000 PMC7333410 180 Han Y Sun B Cai H Xuan Y Simultaneously target of normal and stem cells-like gastric cancer cells via cisplatin and anti-CD133 CAR-T combination therapy Cancer Immunol Immunother 2021 70 2795–803 10.1007/s00262-021-02891-x 33635343 PMC10991976 181 Hao M Jiang H Zhao Y Li C Jiang J Identification of potential biomarkers for aging diagnosis of mesenchymal stem cells derived from the aged donors Stem Cell Res Ther 2024 15 87 10.1186/s13287-024-03689-1 38520027 PMC10960456 182 Jiang X Jia Z Yang B Tang X Feng X Sun L Metabolomic analysis suggests thiamine monophosphate as a potential marker for mesenchymal stem cell transplantation outcomes in patients with SLE Lupus Sci Med 2025 12 e001197 10.1136/lupus-2024-001197 40074250 PMC11907080 183 Liesveld JL Sharma N Aljitawi OS Stem cell homing: From physiology to therapeutics Stem Cells 2020 38 1241–53 10.1002/stem.3242 32526037 184 Fischer UM Harting MT Jimenez F Monzon-Posadas WO Xue H Savitz SI Pulmonary passage is a major obstacle for intravenous stem cell delivery: the pulmonary first-pass effect Stem Cells Dev 2009 18 683–92 10.1089/scd.2008.0253 19099374 PMC3190292 185 Yamada Y Nakashima A Doi S Ishiuchi N Kanai R Miyasako K Localization and maintenance of engrafted mesenchymal stem cells administered via renal artery in kidneys with ischemia-reperfusion injury Int J Mol Sci 2021 22 4178 10.3390/ijms22084178 33920714 PMC8072868 186 Primavera R Regmi S Yarani R Levitte S Wang J Ganguly A Precision delivery of human bone marrow-derived mesenchymal stem cells into the pancreas via intra-arterial injection prevents the onset of diabetes Stem Cells Transl Med 2024 13 559–71 10.1093/stcltm/szae020 38530131 PMC11165159 ",
  "metadata": {
    "Title of this paper": "Precision delivery of human bone marrow-derived mesenchymal stem cells into the pancreas via intra-arterial injection prevents the onset of diabetes",
    "Journal it was published in:": "Frontiers in Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479286/"
  }
}