{
  "title": "Paper_1004",
  "abstract": "pmc Glob Qual Nurs Res Glob Qual Nurs Res 3140 gqn GQN Global Qualitative Nursing Research 2333-3936 SAGE Publications PMC12476508 PMC12476508.1 12476508 12476508 41024861 10.1177/23333936251375184 10.1177_23333936251375184 1 Special Collection: Palliative Care and Caring Practices Mixed Method Research Article Access and Early Integration of Palliative Care in the Non-Hospital Setting for Individuals Living with Cancer in the United States: A Mixed Methods Systematic Review https://orcid.org/0000-0002-1945-2598 Slusser Kim 1 Flynn Makic Mary Beth 1 Loresto Figaro 1 Leak Bryant Ashley 2 Coats Health 1 1 2 Kim Slusser, College of Nursing, University of Colorado Anschutz Medical Campus, 13120 East 19th Avenue, Aurora, CO 80045, USA. Email: Kim.slusser@cuanschutz.edu 27 9 2025 Jan-Dec 2025 12 478152 23333936251375184 24 12 2024 27 7 2025 31 7 2025 27 09 2025 29 09 2025 30 09 2025 © The Author(s) 2025 2025 SAGE Publications https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage The early integration of palliative care (PC) alongside standard cancer care is associated with decreased symptom burden, better adherence to cancer treatment, and enhanced quality of life for individuals living with cancer. The purpose of this mixed methods systematic review was to answer the following research questions (1) What are the characteristics of PC access in non-hospital settings in the US for individuals living with cancer?, and (2) What factors facilitate or deter whether PC is integrated early alongside standard cancer care? The study followed the Joanna Briggs Institute methodology for mixed methods systematic review and a convergent integrated data analysis design. The Conceptual Framework of Access to Healthcare and its five dimensions of access (approachability, acceptability, availability, affordability, appropriateness) guided the categorization and organization of the review’s findings. Fifty-one studies were included and findings illuminated facilitators and challenges of PC access and early integration. While findings supported the use of traditional PC approaches for early integration, embedded PC clinics, lay navigation, and telehealth were found to be promising alternatives, especially for historically minoritized and rural populations. The results of this review led to the development of the Conceptual Framework for Early PC Access and Integration for Individuals Living with Cancer. palliative care cancer healthcare access systematic review pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date January-December 2025 typesetter ts1 Background In 2025, there will be over 2 million newly diagnosed cancer cases in the United States (US); and nearly 700,000 individuals will be living with metastatic cancer ( American Cancer Society, 2024 Gallicchio et al., 2022 Dans et al., 2021 Early integration of PC alongside standard cancer care has been associated with decreased symptom burden, better adherence to cancer treatment, and enhanced QOL for individuals living with cancer; and care partners have reported improved QOL and satisfaction with the care provided to their loved ones ( Cheville et al., 2015 Hoerger et al., 2019 Kwon et al., 2013 Kamal et al., 2013 Meier et al., 2017 Meghani (2004) Sawatzky et al. (2016) While 95% of National Cancer Institute (NCI) Comprehensive Cancer Centers and 40% of all other cancer programs in the US have established outpatient PC ( Hui, Anderson, et al., 2020 Morin et al., 2017 Roeland et al., 2016 Belcher et al., 2023 Islam et al., 2021 Lee et al., 2021 Rubens et al., 2020 These challenges are further complicated by structural and regulatory barriers present in the US healthcare system. Barriers include fragmented healthcare services, inadequate and antiquated documentation standards for outpatient and interdisciplinary PC reimbursement ( Esch & Jones, 2024 Slusser et al., 2024 Dir 2640 US, 2025 The purpose of this mixed methods systematic review (MMSR) was to critically appraise and synthesize quantitative and qualitative data to answer the following research questions: (1) What are the characteristics of PC access in non-hospital settings in the US for individuals living with cancer and their care partners?, and (2) What factors facilitate or deter whether PC is integrated early alongside standard cancer care? Methods This study was conducted in accordance with Joanna Briggs Institute (JBI) methodology for MMSRs which included the following steps: formulation of review questions; evaluation of existent knowledge; establishing eligibility criteria; development of a search strategy; searching and retrieval of relevant studies; critical appraisal of included studies; and data extraction, transformation, integration, and synthesis ( Aromataris et al., 2024 Sandelowski et al., 2006 Stern et al., 2020 Olmos-Vega et al., 2023 The conceptual framework of healthcare access guided our study approach ( Levesque et al., 2013 Levesque et al. (2013) Table 1 Table 1. Five Dimensions of Access. Dimension Definition and corresponding abilities Approachability Describes when individuals identify that a service exists which includes concepts of transparency, information regarding available services, and outreach. The corresponding ability to perceive is influenced by health literacy, health beliefs, trust, and expectations. Acceptability Describes the cultural and social factors determining the possibility to accept the service. Contributing ability to seek is influenced by personal and social values, culture, gender, and autonomy. Availability Describes whether the service can be reached both physically and in a timely manner. Contributing ability to reach is influenced by living environments, transportation, mobility, and social support. Affordability Describes the economic capacity for individuals to spend resources and time to use the needed service. Contributing ability to pay is influenced by income, assets, social capital, and health insurance. Appropriateness Describes the fit between the services and the individuals’ need and interpersonal quality of the service provided. Contributing ability to engage is influenced by empowerment, information, adherence, and caregiver support. Source International Journal for Equity in Health 12 https://doi.org/10.1186/1475-9276-12-18 Evaluation of Existent Knowledge An initial search in PubMed, Cochrane, and PROSPERO was conducted to confirm a gap in existent reviews examining PC access and early integration in the non-hospital setting for individuals living with cancer and their care partners. This gap was confirmed after examining 77 publications about PC, inclusive of systematic, scoping, and integrated reviews. The 77 reviews focused on (1) patient outcomes such as QOL and mortality; (2) broad patient populations not specific to cancer or populations with a specific cancer diagnosis; (3) settings not limited to non-hospital locations, and (4) a singular PC delivery model such as telehealth or home care. Inclusion and Exclusion Criteria Population The inclusion criteria were intended to capture a diverse population based on gender, race and ethnicity, socioeconomic factors, and cancer type. Studies were considered if they included individuals living with cancer, care partners to those with cancer, or oncology and PC clinicians providing care to individuals living with cancer in the outpatient setting. Individuals living with cancer were defined as adults with solid tumors or hematologic malignancies being treated for their cancer in the outpatient setting. Care partners were defined as unpaid caregivers or family members. Clinicians included healthcare professionals providing care to those with cancer. Individuals identified as near the end of life (EOL) and under 18 years old were excluded. Phenomena of Interest Studies investigating and exploring PC integration alongside standard cancer care in the non-hospital setting were considered. The definition of early PC integration is inconsistent in the literature ( Hui et al., 2022 Context Studies in the non-hospital setting were included. The non-hospital setting was defined as stand-alone PC clinics, embedded PC clinics or teams within cancer clinics; home- and community-based PC; and telehealth PC. Exclusion criteria included studies examining PC access and use in nursing homes, extended care facilities, and inpatient units. All studies were conducted in the US. Types of Studies Quantitative, qualitative, and mixed methods studies were considered for inclusion. Quantitative studies included randomized clinical trials (RCTs), cohort studies, quasi-experimental studies, and cross-sectional studies. All types of qualitative studies were considered. Mixed methods studies where data from the quantitative or qualitative results could be extracted were also considered. Review studies, protocols, quality improvement (QI), gray literature, and published abstracts were excluded. Protocols, QI studies, and abstracts were excluded as they do not align with this MMSR’s intent to follow a standardized process for quality appraisal and synthesis of results. Search Strategy Aligning with JBI methodology, the search strategy followed the Preferred Reporting Items for systematic review and Meta-Analysis Protocols (PRISMA-P) standards ( Moher et al., 2015 Table 2 Table 2. Search Terms. Database Concept Search terms PubMed (MeSH and free text) Palliative care “Palliative Care”[Mesh] OR Palliative Care OR Palliative Supportive Care OR Supportive Care OR Supportive Oncology Non-hospital setting “Ambulatory Care” [Mesh] OR Ambulatory Care OR Outpatient[tiab] OR Clinic[tiab] OR Clinics[tiab] OR Home based OR Community based OR Telehealth OR Non hospital* OR At home OR Home health Cancer “Neoplasms” [Mesh] OR Oncology[tiab] OR Cancer* [tiab] CINAHL (Boolean/phrase) Palliative care “Palliative Care” OR Palliative Care OR Palliative Supportive Care OR Supportive Care OR Supportive Oncology Non-hospital setting “Ambulatory” OR Outpatient OR Clinic OR Clinics OR Home based OR Community based OR Telehealth OR Non hospital OR At home OR Home health Cancer Neoplasms OR Oncology OR Cancer Google Scholar Palliative care Palliative care Non-hospital setting Outpatient Cancer Cancer Study Selection Identified citations were uploaded into the citation management system, EndNote TM The EndNote Team, 2013 Covidence Systematic Review Software 2024 Page et al., 2021 Assessment of Methodological Quality The selected studies were independently assessed for methodological quality by study team members K.S. and F.L. using JBI’s qualitative and quantitative critical appraisal checklists ( Aromataris et al., 2024 Barker et al., 2023 Lockwood et al., 2015 Aromataris et al., 2024 Aromataris et al., 2024 Data Abstraction A data abstraction form was created in Covidence to correspond with JBI guidelines ( Aromataris et al., 2024 Data Transformation, Integration, and Synthesis Thematic analysis was conducted using a convergent integrated design ( Aromataris et al., 2024 Hong et al., 2017 Levesque et al., 2013 Results Study Inclusion The initial literature search yielded 5,092 citations. After removal of duplicates and title and abstract screening, 484 articles were identified for full text review. Three studies were unable to be retrieved. After full text review, 51 articles were selected for extraction (see Figure 1 Supplemental File 1 Figure 1. PRISMA for study selection. For accurate alt text generation, a high-quality image file is required. Please provide the image in a suitable format for processing. Methodological Quality All studies were appraised for methodological quality. Quality scores were moderate to high quality, scoring 62% to 85% for RCT studies ( n n n n n n n Dionne-Odom et al., 2018 Formagini et al., 2022 Hay, Lefkowits, Crowley-Matoka, Bakitas, Clark, Duska, Urban, Chen, et al., 2017 Hay, Lefkowits, Crowley-Matoka, Bakitas, Clark, Duska, Urban, Creasy, et al., 2017 Schenker et al., 2014 Siler et al., 2018 Yoong et al., 2013 Back et al., 2014 Bergman et al., 2016 Fink et al., 2020 Keim-Malpass et al., 2015 Dillon et al., 2021 Schenker et al., 2018 Bagcivan et al., 2018 Larson et al., 2023 McLouth et al., 2023 Sadang et al., 2023 Certain findings from the quality appraisals are worth noting. The quality scores for the RCTs reflected that the studies were not blinded to those delivering the treatment, which is understandable in PC intervention studies. Lower scoring qualitative studies lacked description of the philosophical perspective, limiting the ability to determine congruency with the research methodology. Lastly, a notable pattern with the mixed methods studies was the absence of researchers stating how their influence on the study was addressed. Characteristics of Included Studies The studies were conducted in all regions of the US ( United States Census Bureau n n n n n n Individuals living with cancer were the participants in most studies ( n n n Dionne-Odom et al., 2022 Fink et al., 2020 Larson et al., 2023 Bagcivan et al., 2018 Bakitas et al., 2015 Dionne-Odom et al., 2018 Fink et al., 2020 Keim-Malpass et al., 2015 Larson et al., 2023 Orsak et al., 2019 The definition and timing of early PC integration varied. Many of the studies described the delivery of PC as a standalone clinic within a cancer center or in close proximity to a cancer clinic. Yet, several of the studies described PC as embedded within the cancer clinic. The embedded PC services consisted of primary and specialty PC approaches. Other studies examined and compared standalone and embedded PC clinics. There were a few studies that solely examined the use of PC telehealth. One study examined a PC home-based program ( Fink et al., 2020 Supplemental File 2 Data Synthesis Describing PC Access and Early Integration The synthesized findings of PC access and early integration are provided in Table 3 Table 3. Synthesized Data Within the Levesque and Colleagues’ Five Domains of Access (2013). Approachability Acceptability Availability Affordability Appropriateness Unclear pathways and when to refer can be barriers to PC integration ( Anderson et al., 2022 Dillon et al., 2021 Keim-Malpass et al., 2015 Dillon et al., 2021 Formagini et al., 2022 Saravia et al., 2022 Hui, De La Rosa, et al., 2020 Rosenblum et al., 2023 Bergman et al., 2016 Saravia et al., 2022 Bansal et al., 2023 Rosenblum et al., 2018 Reddy et al., 2023 McLouth et al., 2023 Schlichte et al., 2024 Sadang et al., 2023 Dionne-Odom et al., 2018 Schlichte et al., 2024 Graul et al., 2020 Keim-Malpass et al., 2015 Rosenblum et al., 2023 Reinke et al., 2022 Formagini et al., 2022 Hay, Lefkowits, Crowley-Matoka, Bakitas, Clark, Duska, Urban, Creasy, et al., 2017 Bergman et al., 2016 Hui et al., 2018 Patients more likely to follow up with outpatient PC if referred for pain ( Saravia et al., 2022 Anderson et al., 2022 Hay, Lefkowits, Crowley-Matoka, Bakitas, Clark, Duska, Urban, Creasy, et al., 2017 Rosenblum et al., 2018 Agne et al., 2021 Hay, Lefkowits, Crowley-Matoka, Bakitas, Clark, Duska, Urban, Chen, et al., 2017 Agne et al., 2021 Hay, Lefkowits, Crowley-Matoka, Bakitas, Clark, Duska, Urban, Chen, et al., 2017 Keim-Malpass et al., 2015 Bergman et al., 2016 Hay, Lefkowits, Crowley-Matoka, Bakitas, Clark, Duska, Urban, Chen, et al., 2017 Rosenblum et al., 2023 Anderson et al., 2022 Bansal et al., 2023 Schlichte et al., 2024 Agne et al., 2021 Formagini et al., 2022 Sadang et al., 2023 Having ability to meet with multiple members of a PC IDT has positive impact on health ( Sun et al., 2015 Bagcivan et al., 2018 Bischoff et al., 2013 Orsak et al., 2019 Temel et al., 2017 El-Jawahri et al., 2021 Keim-Malpass et al., 2015 Rosenblum et al., 2023 Anderson et al., 2022 Dillon et al., 2021 Agne et al., 2021 Verma et al., 2023 Yu et al., 2019 Agne et al., 2021 Temel et al., 2017 Bansal et al., 2023 Yennurajalingam et al., 2018 Agne et al., 2021 Guay et al., 2014 Cervantez et al., 2018 Guay et al., 2014 Larson et al., 2023 Dionne-Odom et al., 2022 Fink et al., 2020 Sadang et al., 2023 Dionne-Odom et al., 2018 Agne et al., 2021 Offering PC did not take up more time in a surgical clinic ( Bergman et al., 2016 Sadang et al., 2023 Dionne-Odom et al., 2018 Sadang et al., 2023 Siler et al., 2018 Agne et al., 2021 Schenker et al., 2018 Nurse driven assessment and interdisciplinary PC can improve CGs social wellbeing, psychological distress, and CG burden and patient outcomes (Sun, 2015; Bagcivan et al., 2018 Bischoff et al., 2013 Dionne-Odom et al., 2015 El-Jawahri et al., 2021 Nguyen, 2018 Orsak et al., 2019 Dionne-Odom et al., 2022 Ferrell et al., 2015 Dionne-Odom et al., 2015 Dionne-Odom et al., 2022 El-Jawahri et al., 2021 Nguyen, 2018 Temel et al., 2017 Bagcivan et al., 2018 Bakitas et al., 2015 Bergman et al., 2016 Dillon et al., 2021 Temel et al., 2017 Verma et al., 2023 Bergman et al., 2016 Gast, 2022 Orsak et al., 2019 Gast, 2022 Azhar et al., 2018 Back et al., 2014 Bagcivan et al., 2018 Yoong et al., 2013 Guay et al., 2014 Wong et al., 2019 Approachability Individual and care partner lack of knowledge and misconceptions of PC were identified as a limiter to approachability. Provider decisions regarding information and explanations about PC they provide to individuals living with cancer and their care partners influenced individual and care partner PC knowledge and transparency of available PC services. Misconceptions of PC most often included equating PC with EOL ( McLouth et al., 2023 Schlichte et al., 2024 Anderson et al., 2022 Dillon et al., 2021 Keim-Malpass et al., 2015 Formagini et al., 2022 Hay, Lefkowits, Crowley-Matoka, Bakitas, Clark, Duska, Urban, Creasy, et al., 2017 The findings also highlighted the significance of outreach in enhancing or hindering approachability. While PC telehealth was found to be a successful strategy for outreach in rural and underserved populations, there was also evidence that the ability of PC telehealth to reach underserved populations was compromised due to limited technology literacy and access to the internet and devices ( Dionne-Odom et al., 2018 Sadang et al., 2023 Schlichte et al., 2024 Reddy et al., 2023 Bergman et al., 2016 Hui et al., 2018 Acceptability Several key factors were identified as influencing the acceptability of early PC integration, irrespective of the type of outpatient setting and whether the services were provided in rural or urban areas. Acceptability of early integration of PC hinges on whether individuals and clinicians view PC as desirable and compatible with their values, expectations, and needs. The preferences of individuals living with cancer and their care partners informed clinicians’ decision to refer to or discuss PC. Early PC integration was more readily accepted when individuals living with cancer were experiencing distressing pain ( Saravia et al., 2022 Schlichte et al., 2024 Hay, Lefkowits, Crowley-Matoka, Bakitas, Clark, Duska, Urban, Creasy, et al., 2017 Anderson et al., 2022 Bergman et al., 2016 Hay, Lefkowits, Crowley-Matoka, Bakitas, Clark, Duska, Urban, Chen, et al., 2017 Keim-Malpass et al., 2015 Rosenblum et al., 2023 Availability The availability of PC and early PC integration were influenced by PC proximity to the clinics. IDT and PC services coupled with proactive, intentional follow up supported early PC integration. However, PC IDT models were often limited to standalone PC clinics. This segregation from the cancer clinics posed a barrier to early PC integration compared to cancer clinics with embedded PC ( Agne et al., 2021 Guay et al., 2014 Cervantez et al., 2018 Guay et al., 2014 Fink et al., 2020 Dionne-Odom et al., 2018 Sadang et al., 2023 Affordability Affordability of early PC integration was either facilitated or hindered due to personal time requirements, socioeconomic factors, and policy considerations. Although some clinicians feared that PC would be too time-consuming or costly, evidence suggest that offering PC referral in the oncology clinic did not consume more clinician time ( Bergman et al., 2016 Agne et al., 2021 Schenker et al., 2018 Dionne-Odom et al., 2018 Sadang et al., 2023 Sadang et al., 2023 Siler et al., 2018 Appropriateness Studies consistently demonstrated that nurse driven assessments employing validated instruments to inform the PC plan of care were commonly regarded as a means to ensure appropriateness. Some of the most commonly validated instruments used were discussed in the ENABLE (Educate, Nurture, Advise, Before Life Ends) studies ( Bagcivan et al., 2018 Bakitas et al., 2015 Dionne-Odom et al., 2015 Dionne-Odom et al., 2022 Ferrell et al., 2015 Fink et al., 2020 Back et al., 2014 Yoong et al., 2013 Wong et al. (2019) Overlap Between the Access Dimensions Overlap and intersecting relationships between the five dimensions of access emerged. For example, the relationship between approachability and acceptability was highlighted by the significance of the role oncology clinicians have in facilitating PC access and early PC integration. Individuals living with cancer rely on their oncology clinician to be the gateway for information, guidance, and navigation of care which can influence approachability and acceptability. Furthermore, acceptability and availability of PC access and early integration were enhanced by implementation of embedded clinics and telehealth services, even if the traditional PC IDT model could not be realized. Affordability and accessibility considerations highlighted the challenges with cost of care in the US, especially for underserved populations, and the time cost to individuals who may have to travel or spend long days at clinician visits. Based on the conceptual framework for healthcare access ( Levesque et al., 2013 Figure 2 Figure 2. Conceptual framework for early palliative care access and integration for individuals living with cancer. Conceptual diagram highlights factors impacting quality palliative care accessibility and integration for cancer patients; aspects include care delivery, partnership, affordability, availability, acceptability, and appropriateness in US healthcare system. Discussion Using the conceptual framework of healthcare access ( Levesque et al., 2013 The screening process yielded a substantial body of literature, underscoring the significance of the focus on PC. Methodological quality assessment revealed a range of scores across different study designs with most studies being of moderate to high quality. The geographic distribution of the included studies was across all regions of the US; however, a sizable number of studies were conducted in the South, reflecting potential regional disparities in research conducted in other parts of the country. A gap in the literature critically reviewed also highlighted the lack of research of individuals with hematologic malignancies compared to those with solid tumors. One study indicated that the evidence of attitudes of hematology oncologists towards PC was a reason for study exclusion of individuals with hematologic malignancies ( Yu et al., 2019 El-Jawahri et al., 2021 Nevertheless, many studies were conducted in urban academic medical centers or NCI cancer centers and comprehensive cancer centers with a majority of the population representing participants of White race and high education level. Previous studies found regions in the US with historically higher income and education levels to have greater access to access and use of PC ( Osagiede et al., 2018 Rubens et al., 2020 Nadolny et al. (2023) Approachability emerged as a critical concept influenced by factors such as clinical pathways, clinician uncertainty, and individual and care partner misconceptions. The challenges identified in this MMSR resonate with findings from international literature that emphasize the complexity of integrating PC early in cancer care outside of specialized PC settings ( Öhlén et al., 2022 Sawatzky et al., 2016 Pesut et al., 2017 World Health Organization, 2022 Recommendations for Practice There are several implications for practice based on the findings from this study. Embedding PC within existing cancer clinics facilitates access in multiple ways. It provides PC access to individuals living with cancer and their caregivers, inclusive of opportunities for informal education and collaboration between oncology and PC clinicians. Optimizing telehealth and community outreach should be considered to address the unique challenges of both the patient/partner and proximity to a non-hospital-based clinic in which care is being delivered. Our current US healthcare financial model and varied state-to-state regulations affecting availability and reimbursement of PC needs to continue to be an area of clinician and healthcare system advocacy for policy and reimbursement structure changes. Strategies need to continue to address equity and inclusivity in PC regardless of background or socioeconomic status of individuals living with cancer. There are signals of positive change in regulatory and policy in the US that may facilitate PC access and early integration. Examples include a bill to expand access to PC which is currently being reviewed in Congress, and in January of 2024, Medicare policy changes now allow for reimbursement for navigation services ( American Cancer Society Cancer Action Network, 2023 Expanding Access to Palliative Care Act 2023 Unfortunately, this MMSR did not provide further consensus regarding the definition of early integration of PC which was a similar finding as Hui et al. (2022) Hui et al. (2022) Study Strengths and Limitations There are several strengths of this MMSR. The review was conducted using a comprehensive theory-driven design guided by Levesque et al.’s (2013) Conceptual Framework of Healthcare Access. The framework enabled the evaluation of multilevel factors influencing PC access and early integration within the five dimensions of access. Rigour was added by having independent study team member validation of studies selected for inclusion and quality appraisal of the included studies. Furthermore, by including both qualitative and quantitative studies and synthesizing results using a convergent integrated approach, this MMSR captured the complex nature of PC access and early integration, allowing for a deeper understanding than would be possible through a single-method review. It is also important to note the limitations of this study. While multiple study members were involved in independent review for inclusion and quality appraisal of the included studies, only one study member conducted the abstract and title screening which could increase risk of bias in elimination of relevant studies. Also, due to the vast number of studies, this review did not include other types of literature such as quality improvement and grey material which can increase the risk of publication bias as studies may be overrepresented with positive findings since studies with neutral or negative findings are less likely to be published. The thematic analysis was also limited to synthesizing results into the five dimensions of access which may have limited the discovery of new themes or concepts to be considered when evaluating PC access and early integration. Conclusion In conclusion, this MMSR led to the development of a new conceptual framework and offers a comprehensive understanding of the factors influencing access and early integration of PC in non-hospital settings in the United States for individuals living with cancer. As healthcare policy and reimbursement landscapes evolve, there is an opportunity to reimagine how PC is integrated alongside cancer care. This MMSR contributes meaningful insights to inform practice, policy, and future research aimed at improving person-centered, timely, and equitable PC for all individuals affected by cancer. Supplemental Material sj-docx-1-gqn-10.1177_23333936251375184 – Supplemental material for Access and Early Integration of Palliative Care in the Non-Hospital Setting for Individuals Living with Cancer in the United States: A Mixed Methods Systematic Review Supplemental material, sj-docx-1-gqn-10.1177_23333936251375184 for Access and Early Integration of Palliative Care in the Non-Hospital Setting for Individuals Living with Cancer in the United States: A Mixed Methods Systematic Review by Kim Slusser, Mary Beth Flynn Makic, Figaro Loresto, Ashley Leak Bryant and Health Coats in Global Qualitative Nursing Research sj-docx-2-gqn-10.1177_23333936251375184 – Supplemental material for Access and Early Integration of Palliative Care in the Non-Hospital Setting for Individuals Living with Cancer in the United States: A Mixed Methods Systematic Review Supplemental material, sj-docx-2-gqn-10.1177_23333936251375184 for Access and Early Integration of Palliative Care in the Non-Hospital Setting for Individuals Living with Cancer in the United States: A Mixed Methods Systematic Review by Kim Slusser, Mary Beth Flynn Makic, Figaro Loresto, Ashley Leak Bryant and Health Coats in Global Qualitative Nursing Research ORCID iD: https://orcid.org/0000-0002-1945-2598 Ethical Considerations: Funding: The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Supplemental Material: Author Biographies Kim Slusser Mary Beth Flynn Makic Figaro Loresto Ashley Leak Bryant Health Coats References Agne J. L. Bertino E. M. Grogan M. Benedict J. Janse S. Naughton M. Eastep C. Callahan M. Presley C. J. 2021 Too many appointments: Assessing provider and nursing perception of barriers to referral for outpatient palliative care Palliative Medicine Report 2 1 137 145 10.1089/pmr.2020.0114 PMC8241388 34223513 American Cancer Society 2024 Cancer facts & figures 2024 https://www.cancer.org/research/cancer-facts-statistics/all-cancer-facts-figures/2024-cancer-facts-figures.html American Cancer Society Cancer Action Network 2023 November 2 New Medicare reimbursement strategy for patient navigation services will better serve patients with cancer and other serious illnesses https://www.fightcancer.org/releases/new-medicare-reimbursement-strategy-patient-navigation-services-will-better-serve-patients Anderson T. M. Farrell M. M. Moss G. Gupta M. Mooney S. Daunov K. Savernick M. Frandsen J. Verrona K. Pecoraro A. Mance C. Garcia J. Lee R. T 2022 The perspectives of oncology healthcare providers on the role of palliative care in a comprehensive cancer center BMC Palliative Care 21 1 1 7 10.1186/s12904-022-01039-7 35999560 PMC9400235 Aromataris E. Lockwood C. Porritt K. Pilla B. Jordan Z. 2024 JBI manual for evidence synthesis JBI https://synthesismanual.jbi.global Azhar A. Wong A. N. Cerana A. A. Balankari V. R. Adabala M. Liu D. D. Williams J. L. Bruera E. 2018 Characteristics of unscheduled and scheduled outpatient palliative care clinic patients at a comprehensive cancer center Journal of Pain and Symptom Management 55 10.1016/j.jpainsymman.2018.01.015 29410087 Back A. L. Park E. R. Greer J. A. Jackson V. A. Jacobsen J. C. Gallagher E. R. Temel J. S. 2014 Clinician roles in early integrated palliative care for patients with advanced cancer: A qualitative study Journal of Palliative Medicine 17 11 1244 1248 10.1089/jpm.2014.0146 25390467 PMC4229713 Bagcivan G. Dionne-Odom J. N. Frost J. Plunkett M. Stephens L. A. Bishop P. Taylor R. A. Li Z. Tucker R. Bakitas M. 2018 What happens during early outpatient palliative care consultations for persons with newly diagnosed advanced cancer? A qualitative analysis of provider documentation Palliative Medicine 32 1 59 68 10.1177/0269216317733381 28952887 Bakitas M. A. Tosteson T. D. Li Z. Lyons K. D. Hull J. G. Li Z. Dionne-Odom J. N. Frost J. Dragnev K. H. Hegel M. T. Azuero A. Ahles T. A. 2015 Early versus delayed initiation of concurrent palliative oncology care: Patient outcomes in the ENABLE III randomized controlled trial Journal of Clinical Oncology 33 13 1438 1445 10.1200/jco.2014.58.6362 25800768 PMC4404422 Bansal V. V. Kim D. Reddy B. Witmer H. D. D. Dhiman A. Godley F. A. t. Ong C. T. Clark S. Ulrich L. Polite B. Shergill A. Malec M. Eng O. S. Tun S. Turaga K. K. 2023 Early integrated palliative care within a surgical oncology clinic JAMA Network Open 6 11 10.1001/jamanetworkopen.2023.41928 PMC10630898 37934497 Barker T. H. Stone J. C. Sears K. Klugar M. Tufanaru C. Leonardi-Bee J. Aromataris E. Munn Z. 2023 The revised JBI critical appraisal tool for the assessment of risk of bias for randomized controlled trials JBI Evidence Synthesis 21 3 494 506 36727247 10.11124/JBIES-22-00430 Belcher S. M. Lee H. Nguyen J. Curseen K. Lal A. Zarrabi A. J. Gantz L. Rosenzweig M. Q. Hill J. L. Yeager K. A. 2023 Financial hardship and quality of life among patients with advanced cancer receiving outpatient palliative care: A pilot study Cancer Nursing 46 1 3 13 10.1097/NCC.0000000000001052 34974507 PMC11195536 Bergman J. Ballon-Landa E. Lorenz K. A. Saucedo J. Saigal C. S. Bennett C. J. Litwin M. S. 2016 Community-partnered collaboration to build an integrated palliative care clinic: The view from urology American Journal of Hospice and Palliative Care 33 2 164 170 10.1177/1049909114555156 25326489 Bischoff K. Weinberg V. Rabow M. W. 2013 Palliative and oncologic co-management: symptom management for outpatients with cancer Supportive Care in Cancer 21 3031 3037 10.1007/s00520-013-1838-z 23794100 Cervantez S. R. Tenner L. L. Schmidt S. Aduba I. O. Jones J. T. Ali N. Singh-Carlson S. 2018 Symptom burden and palliative referral disparities in an ambulatory South Texas cancer center Frontiers in Oncology 8 443 10.3389/fonc.2018.00443 30374422 PMC6196262 Cheville A. L. Alberts S. R. Rummans T. A. Basford J. R. Lapid M. I. Sloan J. A. Satele D. V. Clark M. M. 2015 Improving adherence to cancer treatment by addressing quality of life in patients with advanced gastrointestinal cancers Journal of Pain and Symptom Management 50 3 321 327 10.1016/j.jpainsymman.2015.03.005 25975643 PMC5557268 Covidence Systematic Review Software 2024 Veritas Health Innovation [Computer Software] www.covidence.org Dans M. Kutner J. S. Agarwal R. Baker J. N. Bauman J. R. Beck A. C. Campbell T. C. Carey E. C. Case A. A. Dalal S. Doberman D. J. Epstein A. S. Fecher L. Jones J. Kapo J. Lee R. T. Loggers E. T. McCammon S. Mitchell W. Ogunseitan A. B. , . . . Campbell M. 2021 NCCN Guidelines® Insights: Palliative care, version 2.2021 Journal of the National Comprehensive Cancer Network 19 7 780 788 10.6004/jnccn.2021.0033 34340208 PMC10196810 Dillon E. C. Meehan A. Li J. Liang S.-Y. Lai S. Colocci N. Roth J. Szwerinski N. K. Luft H. 2021 How, when, and why individuals with stage IV cancer seen in an outpatient setting are referred to palliative care: A mixed methods study Supportive Care in Cancer 29 2 669 678 10.1007/s00520-020-05492-z 32430601 Dionne-Odom J. N. Azuero A. Lyons K. D. Hull J. G. Tosteson T. Li Z. Li Z. Frost J. Dragnev K. H. Akyar I. Hegel M. T. Bakitas M. A. 2015 Benefits of early versus delayed palliative care to informal family caregivers of patients with advanced cancer: Outcomes from the ENABLE III randomized controlled trial Journal of Clinical Oncology 33 13 1446 1452 10.1200/jco.2014.58.7824 25800762 PMC4404423 Dionne-Odom J. N. Azuero A. Taylor R. A. Dosse C. Bechthold A. C. Currie E. Reed R. D. Harrell E. R. Engler S. Ejem D. B. Ivankova N. V. Martin M. Y. Rocque G. B. Williams G. R. Bakitas M. A. Dionne-Odom J. N. 2022 A lay navigator-led, early palliative care intervention for African American and rural family caregivers of individuals with advanced cancer (Project Cornerstone): Results of a pilot randomized trial Cancer (0008543X) 128 6 1321 1330 10.1002/cncr.34044 PMC8882155 34874061 Dionne-Odom J. N. Taylor R. Rocque G. Chambless C. Ramsey T. Azuero A. Ivankova N. Martin M. Y. Bakitas M. A. 2018 Adapting an early palliative care intervention to family caregivers of persons with advanced cancer in the rural Deep South: A qualitative formative evaluation Journal of Pain and Symptom Management 55 6 1519 1530 10.1016/j.jpainsymman.2018.02.009 29474939 PMC5951755 Dir 2640 US 2025 March 2 US healthcare private vs public: Key differences explained https://dir-2640-us.com/us-healthcare-private-vs-public-key-differences-explained/ El-Jawahri A. LeBlanc T. W. Kavanaugh A. Webb J. A. Jackson V. A. Campbell T. C. O’Connor N. Luger S. M. Gafford E. Gustin J. Bhatnagar B. Walker A. R. Fathi A. T. Brunner A. M. Hobbs G. S. Nicholson S. Davis D. Addis H. Vaughn D. Horick N. 2021 Effectiveness of integrated palliative and oncology care for patients with acute myeloid leukemia: A randomized clinical trial JAMA Oncology 7 2 238 245 10.1001/jamaoncol.2020.6343 33331857 PMC7747042 Esch A. E. Jones C. 2024 January 2 Key 2024 palliative care billing updates every provider should know Center to Advance Palliative Care https://www.capc.org/blog/key-2024-palliative-care-billing-updates-every-provider-should-know/ Expanding Access to Palliative Care Act 2023 S.1845, 118th Cong https://www.congress.gov/bill/118th-congress/senate-bill/1845 Ferrell B. Sun V. Hurria A. Cristea M. Raz D. J. Kim J. Y. Reckamp K. Williams A. C. Borneman T. Uman G. Koczywas M. 2015 Interdisciplinary palliative care for patients with lung cancer Journal of Pain and Symptom Management 50 6 758 767 10.1016/j.jpainsymman.2015.07.005 26296261 PMC4666729 Fink R. M. Kline D. M. Siler S. Fischer S. M. 2020 A qualitative analysis of a palliative care-focused lay patient navigation intervention for Hispanics with advanced cancer Journal of Hospice and Palliative Nursing 22 4 325 346 10.1097/NJH.0000000000000666 32568935 Formagini T. Poague C. O’Neal A. Brooks J. V. 2022 “When I heard the word palliative”: Obscuring and clarifying factors affecting the stigma around palliative care referral in oncology JCO Oncology Practice 18 1 10.1200/op.21.00088 PMC8758121 34310185 Gallicchio L. Devasia T. P. Tonorezos E. Mollica M. A. Mariotto A. 2022 Estimation of the number of individuals living with metastatic cancer in the United States JNCI: Journal of the National Cancer Institute 114 11 1476 1483 10.1093/jnci/djac158 35993614 PMC9949565 Gast K. C. Benedict J. A. Grogan M. Janse S. Saphire M. Kumar P. Bertino E. M. Agne J. L. Presley C. J. 2022 Impact of an embedded palliative care clinic on healthcare utilization for patients with a new thoracic malignancy Frontiers in Oncology 12 10.3389/fonc.2022.835881 PMC8919515 35295997 Graul A. Haggerty A. Stickley C. Kumar P. Morales K. Bogner H. Burger R. A. Morgan M. Ko E. 2020 Effect of patient education on palliative care knowledge and acceptability of outpatient palliative care services among gynecologic oncology patients: A randomized controlled trial Gynecologic Oncology 156 10.1016/j.ygyno.2019.11.023 31831167 Guay M. O. D. Tanzi S. Arregui M. T. S. M. Chisholm G. de la Cruz M. Bruera E. Delgado Guay M. O. San Miguel Arregui M. T. De la Cruz M. G. 2014 Characteristics and outcomes of advanced cancer patients who miss outpatient supportive care consult appointments Supportive Care in Cancer 22 10 2869 2874 10.1007/s00520-014-2254-8 24771301 Hay C. M. Lefkowits C. Crowley-Matoka M. Bakitas M. A. Clark L. H. Duska L. R. Urban R. R. Chen L. M. Creasy S. L. Schenker Y. 2017 Gynecologic oncologist views influencing referral to outpatient specialty palliative care International Journal of Gynecological Cancer: Official Journal of the International Gynecological Cancer Society 27 3 588 596 10.1097/IGC.0000000000000893 28060140 PMC5315630 Hay C. M. Lefkowits C. Crowley-Matoka M. Bakitas M. A. Clark L. H. Duska L. R. Urban R. R. Creasy S. L. Schenker Y. 2017 Strategies for introducing outpatient specialty palliative care in gynecologic oncology Journal of Oncology Practice 13 9 10.1200/jop.2017.020818 PMC5598314 28763259 Hoerger M. Wayser G. R. Schwing G. Suzuki A. Perry L. M. 2019 Impact of interdisciplinary outpatient specialty palliative care on survival and quality of life in adults with advanced cancer: A meta-analysis of randomized controlled trials Annals of Behavioral Medicine 53 7 674 685 10.1093/abm/kay077 30265282 PMC6546936 Hong Q. N. Pluye P. Bujold M. Wassef M. 2017 Convergent and sequential synthesis designs: Implications for conducting and reporting systematic reviews of qualitative and quantitative evidence Systematic Reviews 6 1 1 14 10.1186/s13643-017-0454-2 28335799 PMC5364694 Hui D. Anderson L. Tang M. Park M. Liu D. Bruera E. 2020 Examination of referral criteria for outpatient palliative care among patients with advanced cancer Supportive Care in Cancer 28 1 295 301 10.1007/s00520-019-04811-3 31044305 PMC6824973 Hui D. De La Rosa A. Chen J. Dibaj S. Delgado Guay M. Heung Y. Liu D. Bruera E. 2020 State of palliative care services at US cancer centers: An updated national survey Cancer 126 9 2013 2023 10.1002/cncr.32738 32049358 PMC7160033 Hui D. Heung Y. Bruera E. 2022 Timely palliative care: Personalizing the process of referral Cancers 14 4 10 47 10.3390/cancers14041047 PMC8870673 35205793 Hui D. Kilgore K. Park M. Liu D. Kim Y. J. Park J. C. Fossella F. Bruera E. 2018 Pattern and predictors of outpatient palliative care referral among thoracic medical oncologists Oncologist 23 10 1230 1235 10.1634/theoncologist.2018-0094 29895629 PMC6263132 Islam J. Y. Deveaux A. Previs R. A. Akinyemiju T. 2021 Racial and ethnic disparities in palliative care utilization among gynecological cancer patients Gynecologic Oncology 160 2 469 476 10.1016/j.ygyno.2020.11.031 33276985 PMC8221248 Kamal A. H. Currow D. C. Ritchie C. S. Bull J. Abernethy A. P 2013 Community-based palliative care: The natural evolution for palliative care delivery in the U.S Journal of Pain and Symptom Management 46 2 254 264 23159685 10.1016/j.jpainsymman.2012.07.018 Keim-Malpass J. Mitchell E. M. Blackhall L. DeGuzman P. B. 2015 Evaluating stakeholder-identified barriers in accessing palliative care at an NCI-designated cancer center with a rural catchment area Journal of Palliative Medicine 18 7 634 637 10.1089/jpm.2015.0032 25897772 Kwon J. H. Hui D. Chisholm G. Ha C. Yennurajalingam S. Kang J. H. Bruera E. 2013 Clinical characteristics of cancer patients referred early to supportive and palliative care Journal of Palliative Medicine 16 2 148 155 23331085 10.1089/jpm.2012.0344 PMC3569943 Larson K. L. Mathews H. F. Melendez C. R. Hupp T. Estrada M. Moye J. P. Passwater C. C. Muzaffar M. 2023 Original research: Can a palliative care lay health advisor–nurse partnership improve health equity for Latinos with cancer? AJN American Journal of Nursing 123 7 18 27 10.1097/01.NAJ.0000944912.42194.33 37345777 Lee K. Gani F. Canner J. K. Johnston F. M. 2021 Racial disparities in utilization of palliative care among patients admitted with advanced solid organ malignancies American Journal of Hospice & Palliative Medicine 38 6 539 546 10.1177/1049909120922779 32372699 PMC8787808 Levesque J.-F. Harris M. F. Russell G. 2013 Patient-centred access to health care: Conceptualising access at the interface of health systems and populations International Journal for Equity in Health 12 1 1 18 10.1186/1475-9276-12-18 23496984 PMC3610159 Lockwood C. Munn Z. Porritt K. 2015 Qualitative research synthesis: Methodological guidance for systematic reviewers utilizing meta-aggregation International Journal for Evidence Based Healthcare 13 3 179 187 10.1097/XEB.0000000000000062 26262565 McLouth L. E. Gabbard J. Levine B. J. Golden S. L. Lycan T. W. Petty W. J. Weaver K. E. 2023 Prognostic awareness, palliative care use, and barriers to palliative care in patients undergoing immunotherapy or chemo-immunotherapy for metastatic lung cancer Journal of Palliative Medicine 26 6 831 836 10.1089/jpm.2022.0352 36912809 PMC10277982 Meghani S. H. 2004 A concept analysis of palliative care in the United States Journal of Advanced Nursing 46 2 152 161 10.1111/j.1365-2648.2003.02975.x 15056328 Meier D. E. Back A. L. Berman A. Block S. D. Corrigan J. M. Morrison R. S. 2017 A national strategy for palliative care Health Affairs 36 7 1265 1273 10.1377/hlthaff.2017.0164 28679814 Moher D. Shamseer L. Clarke M. Ghersi D. Liberati A. Petticrew M. Shekelle P. Stewart L. A. Group P.-P. 2015 Preferred reporting items for systematic review and meta-analysis protocols (PRISMA-P) 2015 statement Systematic Reviews 4 1 1 10.1186/2046-4053-4-1 25554246 PMC4320440 Morin L. Aubry R. Frova L. MacLeod R. Wilson D. M. Loucka M. Csikos A. Ruiz-Ramos M. Cardenas-Turanzas M. Rhee Y. Teno J. Öhlén J. Deliens L. Houttekier D. Cohen J. 2017 Estimating the need for palliative care at the population level: A cross-national study in 12 countries Palliative Medicine 31 6 526 536 10.1177/0269216316671280 27683475 Nadolny S. Schildmann E. Gaßmann E. S. Schildmann J. 2023 What is an “early palliative care” intervention? A scoping review of controlled studies in oncology Cancer Medicine 12 23 21335 21353 10.1002/cam4.6490 37902232 PMC10726823 Nguyen H. Q. Ruel N. Macias M. Borneman T. Alian M. Becher M. Lee K. Ferrell B. 2018 Translation and evaluation of a lung cancer, palliative care intervention for community practice Journal of Pain and Symptom Management 56 10.1016/j.jpainsymman.2018.07.018 PMC6248339 30076966 Öhlén J. Böling S. HamdanAlshehri H. Brännström M. Henoch I. Hessman E. Nilsson S. Ozanne A. 2022 Strategies for knowledge translation of a palliative approach outside specialized palliative care services: A scoping review BMC Palliative Care 21 1 39 10.1186/s12904-022-00929-0 35317795 PMC8939083 Olmos-Vega F. M. Stalmeijer R. E. Varpio L. Kahlke R. 2023 A practical guide to reflexivity in qualitative research: AMEE Guide No. 149 Medical Teacher 45 3 241 251 10.1080/0142159X.2022.2057287 35389310 Orsak G. McGaha P. Brandon P. Swan A. Singh K. P. 2019 A longitudinal pilot study for examining symptom reduction in patients with cancer in a palliative care program: A primarily rural Northeast Texas population Hospital Topics 97 2 54 59 10.1080/00185868.2019.1605322 31012812 Osagiede O. Colibaseanu D. T. Spaulding A. C. Frank R. D. Merchea A. Kelley S. R. Uitti R. J. Ailawadhi S. 2018 Palliative care use among patients with solid cancer tumors: A national cancer data base study Journal of Palliative Care 33 3 149 158 10.1177/0825859718777320 29807486 Page M. J. McKenzie J. E. Bossuyt P. M. Boutron I. Hoffmann T. C. Mulrow C. D. Shamseer L. Tetzlaff J. M. Akl E. A. Brennan S. E. Chou R. Glanville J. Grimshaw J. M. Hróbjartsson A. Lalu M. M. Li T. Loder E. W. Mayo-Wilson E. McDonald S. , . . . Moher D. 2021 The PRISMA 2020 statement: An updated guideline for reporting systematic reviews British Medical Journal 372 10.1136/bmj.n71 PMC8005924 33782057 Pesut B. Hooper B. Jacobsen M. Nielsen B. Falk M. O‘Connor B. P. 2017 Nurse-led navigation to provide early palliative care in rural areas: A pilot study BMC Palliative Care 16 1 37 10.1186/s12904-017-0211-2 28583176 PMC5460511 Reddy A. González J. B. Rizvi A. Nortje N. Dalal S. Haider A. Amaram-Davila J. S. Bramati P. Chen M. Hui D. Bruera E. 2023 Impact of an institution-wide goals of care program on the timing of referrals to outpatient palliative care Journal of Pain and Symptom Management 66 6 10.1016/j.jpainsymman.2023.08.019 PMC11815992 37643654 Reinke L. F. Sullivan D. R. Slatore C. Dransfield M. T. Ruedebusch S. Smith P. Rise P. J. Tartaglione E. V. Vig E. K. Au D. H. 2022 A randomized trial of a nurse‑led palliative care intervention for patients with newly diagnosed lung cancer Journal of Palliative Medicine 25 10.1089/jpm.2022.0008 35649214 Roeland E. J. Triplett D. P. Matsuno R. K. Boero I. J. Hwang L. Yeung H. N. Mell L. Murphy J. D. 2016 Patterns of palliative care consultation among elderly patients with cancer Journal of the National Comprehensive Cancer Network 14 4 439 445 27059192 10.6004/jnccn.2016.0050 Rosenblum R. E. Huo R. Scarborough B. Goldstein N. Smith C. B. 2018 Comparison of quality oncology practice initiative metrics in solid tumor oncology clinic with or without concomitant supportive oncology consultation Journal of Oncology Practice 14 12 10.1200/jop.18.00380 30537452 Rosenblum R. E. Rogal S. S. Park E. R. Impagliazzo C. Abdulhay L. B. Grosse P. J. Temel J. S. Arnold R. M. Schenker Y. 2023 National survey using CFIR to assess early outpatient specialty palliative care implementation Journal of Pain and Symptom Management 65 3 10.1016/j.jpainsymman.2022.11.019 PMC9928908 36460231 Rubens M. Ramamoorthy V. Saxena A. McGranaghan P. Bhatt C. Das S. Shehadeh N. Veledar E. Viamonte-Ros A. Odia Y. Mehta M. P. Kotecha R. 2020 Inpatient palliative care use among critically III brain metastasis patients in the United States American Journal of Clinical Oncology 43 11 806 812 10.1097/coc.0000000000000748 32804776 Sadang K. G. Centracchio J. A. Turk Y. Park E. Feliciano J. L. Chua I. S. Blackhall L. Silveira M. J. Fischer S. M. Rabow M. Zachariah F. Grey C. Campbell T. C. Strand J. Temel J. S. Greer J. A. 2023 Clinician perceptions of barriers and facilitators for delivering early integrated palliative care via telehealth Cancers 15 22 5340 10.3390/cancers15225340 38001600 PMC10670662 Sandelowski M. Voils C. I. Barroso J. 2006 Defining and designing mixed research synthesis studies Research in the Schools: A Nationally Refereed Journal Sponsored by the Mid-South Educational Research Association and the University of Alabama 13 1 1 29 PMC2809982 20098638 Saravia A. Kong K. A. Roy R. Barry R. Guidry C. McDaniel L. S. Raven M. C. Pou A. M. Mays A. C. 2022 Referral patterns of outpatient palliative care among the head and neck cancer population International Archives of Otorhinolaryngology 26 4 10.1055/s-0041-1741436 PMC9668430 36405476 Sawatzky R. Porterfield P. Lee J. Dixon D. Lounsbury K. Pesut B. Roberts D. Tayler C. Voth J. Stajduhar K. 2016 Conceptual foundations of a palliative approach: A knowledge synthesis BMC Palliative Care 15 1 5 10.1186/s12904-016-0076-9 26772180 PMC4715271 Schenker Y. Bahary N. Claxton R. Childers J. Chu E. Kavalieratos D. King L. Lembersky B. Tiver G. Arnold R. M. 2018 A pilot trial of early specialty palliative care for patients with advanced pancreatic cancer: Challenges encountered and lessons learned Journal of Palliative Medicine 21 1 28 36 10.1089/jpm.2017.0113 28772092 PMC5757080 Schenker Y. Crowley-Matoka M. Dohan D. Rabow M. W. Smith C. B. White D. B. Chu E. Tiver G. A. Einhorn S. Arnold R. M. 2014 Oncologist factors that influence referrals to subspecialty palliative care clinics Journal of Oncology Practice 10 2 10.1200/JOP.2013.001130 PMC3948709 24301842 Schlichte L. M. Hildenbrand J. Wolf S. Herring K. W. Troy J. D. LeBlanc T. W. 2024 Knowledge of palliative care and barriers to access among outpatients with cancer Journal of Pain and Symptom Management 67 2 115 125 10.1016/j.jpainsymman.2023.10.013 37848077 Siler S. Mamier I. Winslow B. 2018 The perceived facilitators and challenges of translating a lung cancer palliative care intervention into community-based settings Journal of Hospice and Palliative Nursing 20 4 407 415 10.1097/njh.0000000000000470 30063635 PMC6070356 Slusser K. Velasco R. A. F. Coats H. 2024 Patient, caregiver, and clinician perceptions of palliative care that influence access and use: A qualitative meta-synthesis The American Journal of Hospice & Palliative Care 41 4 452 464 10.1177/10499091231185344 37345634 Stern C. Lizarondo L. Carrier J. Godfrey C. Rieger K. Salmond S. Apóstolo J. Kirkpatrick P. Loveday H. 2020 Methodological guidance for the conduct of mixed methods systematic reviews JBI Evidence Synthesis 18 10 2108 2118 10.11124/JBISRIR-D-19-00169 32813460 Sun V. Grant M. Koczywas M. Freeman B. Zachariah F. Fujinami R. Del Ferraro C. Uman G. Ferrell B. 2015 Effectiveness of an interdisciplinary palliative care intervention for family caregivers in lung cancer Cancer 121 10.1002/cncr.29567 PMC4592403 26150131 Temel J. S. Greer J. A. El-Jawahri A. Pirl W. F. Park E. R. Jackson V. A. Back A. L. Kamdar M. Jacobsen J. Chittenden E. H. Rinaldi S. P. Gallagher E. R. Eusebio J. R. Li Z. Muzikansky A. Ryan D. P. 2017 Effects of early integrated palliative care in patients with lung and GI cancer: A randomized clinical trial Journal of Clinical Oncology 35 10.1200/JCO.2016.70.5046 PMC5455686 28029308 The EndNote Team 2013 EndNote Clarivate United States Census Bureau https://data.census.gov/map/010XX00US/ACSDP1Y2017/DP05?q=United%20States&layer=VT_2017_020_00_PY_D1&loc=43.3751,-113.1138,z2.6270 Verma M. Kalman R. Horrow J. Gallagher M. Woodrell C. Navarro V. 2023 Feasibility of a palliative care intervention within routine care of hepatocellular carcinoma: A pilot randomized controlled trial Journal of Palliative Medicine 26 10.1089/jpm.2022.0338 36149682 Wong A. Vidal M. Prado B. Hui D. Epner M. Balankari V. R. De La Cruz V. J. Cantu H. P. Zapata K. P. Liu D. D. Williams J. L. Lim T. Bruera E. 2019 Patients’ perspective of timeliness and usefulness of an outpatient supportive care referral at a comprehensive cancer center Journal of Pain and Symptom Management 58 2 275 281 10.1016/j.jpainsymman.2019.04.027 31029808 World Health Organization 2022 WHO regional technical briefing: Strengthening palliative care in the WHO European Region Meeting Report: Virtual Meeting Hosted by the WHO Regional Office for Europe November 29, 2021 WHO Regional Office for Europe https://iris.who.int/bitstream/handle/10665/351434/WHO-EURO-2022-4776-44539-63064-eng.pdf Yennurajalingam S. Prado B. Lu Z. Naqvi S. Williams J. L. Lim T. Bruera E. 2018 Outcomes of embedded palliative care outpatients initial consults on timing of palliative care access, symptoms, and end-of-life quality care indicators among advanced nonsmall cell lung cancer patients Journal of Palliative Medicine 21 12 1690 1697 10.1089/jpm.2018.0134 30067150 Yoong J. Park E. R. Greer J. A. Jackson V. A. Gallagher E. R. Pirl W. F. Back A. L. Temel J. S. 2013 Early palliative care in advanced lung cancer: A qualitative study JAMA Internal Medicine 173 4 283 290 10.1001/jamainternmed.2013.1874 23358690 Yu J. A. Ray K. N. Park S. Y. Barry A. Smith C. B. Ellis P. G. Schenker Y. 2019 System-level factors associated with use of outpatient specialty palliative care among patients with advanced cancer Journal of Oncology Practice 15 1 10.1200/jop.18.00234 PMC7010434 30407881 ",
  "metadata": {
    "Title of this paper": "System-level factors associated with use of outpatient specialty palliative care among patients with advanced cancer",
    "Journal it was published in:": "Global Qualitative Nursing Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476508/"
  }
}