{
  "title": "Paper_756",
  "abstract": "pmc Breast Cancer (Dove Med Press) Breast Cancer (Dove Med Press) 2249 bctt bctt Breast Cancer : Targets and Therapy 1179-1314 Dove Press PMC12479221 PMC12479221.1 12479221 12479221 41036093 10.2147/BCTT.S545308 545308 1 Original Research Efficacy of Trastuzumab Deruxtecan in HER2-Positive and HER2-Low Metastatic Breast Cancer: A Real-World Retrospective Cohort Study in China Yan et al Yan et al Yan Yuxin  1  2 Jin Yizi  1  2 Lin Mingxi  1  2 Zeng Ceng  1  2 Guo Qing  1  2 Zhou Teng  1  2 Li Dou Dou  3 Zhang Jian  1  4 1 Department of Oncology, Shanghai Medical College, Fudan University Shanghai People’s Republic of China 2 Department of Breast and Urinary Oncology, Fudan University Shanghai Cancer Center Shanghai People’s Republic of China 3 School of Clinical Medicine, Shanghai University of Medicine & Health Sciences Shanghai People’s Republic of China 4 Phase I Unit, Fudan University Shanghai Cancer Center Shanghai 200032 People’s Republic of China Correspondence: Dou Dou Li, School of Clinical Medicine, Shanghai University of Medicine & Health Sciences Shanghai People’s Republic of China Jian Zhang, Phase I Unit, Fudan University Shanghai Cancer Center No. 270, Dong’an Road Shanghai 200032 People’s Republic of China 25 9 2025 2025 17 479419 863 873 11 6 2025 20 9 2025 25 09 2025 01 10 2025 02 10 2025 © 2025 Yan et al. 2025 Yan et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Background Limited real-world data are available on the effectiveness and safety of trastuzumab deruxtecan (T-DXd, DS8201a) in patients with HER2-positive and HER2-low metastatic breast cancer (MBC), particularly within the Chinese population. Methods Between 2022 and 2025, 98 patients with MBC treated with T-DXd were retrospectively enrolled at Fudan University Shanghai Cancer Center. Patients were categorized as HER2-positive and HER2-low cohort. Clinical outcomes including objective response rate (ORR), progression-free survival (PFS), disease control rate (DCR), and clinical benefit rate (CBR), were assessed and compared between cohorts. The primary endpoint of the study was PFS, which was estimated using the Kaplan–Meier method and compared using the Log rank test. Results Among the 98 patients, the median PFS was 15.0 months. The ORR, DCR, and CBR were 48.0%, 69.4%, and 41.8%, respectively. HER2-positive patients experienced longer PFS compared to HER2-low patients (not reached vs 9.0 months). Among HER2-low patients, liver metastases were associated with poorer outcomes. Patients with brain metastases achieved a median PFS of 15.5 months and a 1-year PFS rate of 65.3%. Grade ≥3 adverse events included neutropenia (20.4%), nausea (5.1%), anemia (4.1%), and interstitial lung disease in 6.1% of patients, leading to discontinuation in 2.0%. Conclusion In this real-world analysis, T-DXd demonstrated robust clinical activity in both HER2-positive and HER2-low MBC, consistent with the findings from the DESTINY-Breast clinical trials. Notably, we identified several clinically relevant prognostic factors, including HER2 status, metastatic site, treatment line, and prior therapies. These findings support the broader clinical application of T-DXd and offer insights into individualized treatment selection. Keywords T-DXd prognosis real-world breast cancer HER2 National Key Research and Development Program of China National Natural Science Foundation of China 10.13039/501100001809 Shanghai Science and Technology Innovation Action Plan Beijing Science and Technology Innovation Medical Development Foundation Key Project This study was supported by National Key Research and Development Program of China (grant no. 2023YFF1205000); National Natural Science Foundation of China (grant no. 82373359); Shanghai Science and Technology Innovation Action Plan (grant no. 24SF1901700); and Beijing Science and Technology Innovation Medical Development Foundation Key Project (grant no. KC2022-ZZ-0091-6). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Breast cancer remains the most frequently diagnosed malignant tumor in women worldwide, accounting for approximately 32% of all new cancer cases in this population and over 42,000 annual deaths. 1 2 3 4 Approximately 60% of HER2-negative metastatic breast cancers exhibit low (Immunohistochemistry (IHC) 1+ or 2+ with negative in situ hybridization (ISH)) but detectable HER2 expression—a biologically distinct subgroup that has historically fallen outside the scope of traditional HER2-targeted therapies. 5 6 7 8 9 10 T-DXd is a next-generation HER2-targeted ADC that combines trastuzumab with a potent topoisomerase 1 (TOP1) inhibitor payload (DXd) via a cleavable tetrapeptide-based linker with a high drug-to-antibody ratio (DAR) of 8:1, developed to address these challenges. 11 12 13 14 15 These findings have catalyzed a paradigm shift in HER2 classification and therapeutic strategy. Consequently, T-DXd has been incorporated into clinical guidelines as a preferred treatment option for both HER2-positive and HER2-low advanced breast cancer. While randomized trials provide high-level evidence, their strict inclusion criteria often limit generalizability. Therefore, real-world studies are essential to validate efficacy in broader populations and to explore outcomes across heterogeneous clinical scenarios. 16 Materials and Methods Cohort Population From January 2022 to February 2025, 98 metastatic breast cancer patients treated with T-DXd were retrospectively enrolled at Fudan University Shanghai Cancer Center. Patients who met the following criteria were enrolled in the study: pathologically diagnosed of invasive breast cancer with HER2-positive or HER2-low status determined by immunohistochemical analysis; the presence of at least one measurable metastatic lesion in accordance with RECIST version 1.1 criteria; and baseline hematologic, hepatic, renal, and electrocardiographic assessments within normal reference ranges. To reduce potential selection bias, all individuals meeting these conditions were included without further restriction. T-DXd was administered intravenously at a dose of 5.4 mg/kg every 3 weeks until disease progression or unacceptable toxicity. We collected clinical characteristics, including age, ECOG performance status, hormone receptor status (ER and PR), HER2 status, and sites of metastasis, as well as data on PFS, OS, treatment responseand adverse events. HER2 status was assessed according to the ASCO/CAP guidelines using IHC as the primary method, with FISH performed for cases scored as IHC 2+. HER2-positive was defined as IHC 3+ or IHC 2+ with ISH amplification, while HER2-low was defined as IHC 1+ or IHC 2+ without ISH amplification. In cases where HER2 expression was near the threshold between IHC 0 and 1+, an experienced breast pathologist at Fudan University Shanghai Cancer Center conducted a secondary pathological review to ensure consistency and accuracy in HER2 classification. The relevant institutional review board or ethics committee of Fudan University Shanghai Cancer Center approved the study (1907204–8 for Fudan University Shanghai Cancer Center), which was conducted in accordance with the Declaration of Helsinki. All patients gave their signed informed consent. Efficacy Analysis The primary endpoint was progression-free survival (PFS), which was calculated from the beginning of treatment with T-DXd until disease progression or death from any cause. The response was evaluated according to the RECIST guideline 1.1. Secondary endpoints included overall response rate (ORR), clinical benefit rate (CBR), and disease control rate (DCR). ORR was defined as the proportion of patients who achieved either a complete or partial response (CR or PR); CBR referred to the percentage of patients who maintained disease control—defined as complete response, partial response, or sustained stable disease for at least 24 weeks (CR, PR, or SD for a minimum of 24 weeks); DCR was determined by evaluating the proportion of patients who achieved disease control (CR, PR, or SD). Duration of response (DoR) was defined as the time from the first documentation of objective response (CR or PR) to the first occurrence of disease progression or death from any cause. PFS2 was defined as the interval from the initiation of post-T-DXd therapy to the second progression or death, in patients who had experienced disease progression on T-DXd. Patients without documented progression or death were censored at the date of the last adequate tumor assessment. Adverse events were evaluated by NCI CTCAE (version 5.0). 17 Ethical Approval All procedures performed in studies involving human participants were in accordance with the ethical standards of the institutional and/or national research committee and with the 1964 Helsinki declaration and its later amendments or comparable ethical standards. The study was approved by the hospital ethics committee (1907204–8 for Fudan University Shanghai Cancer Center) and all patients gave their signed informed consent. Results Baseline Characteristics A total of 98 patients with MBC who received T-DXd were included in the final analysis. Table 1 Table 1 Demographic and Clinical Characteristics of the Patients Characteristic Overall Population HER2-Low HER2-Positive Age at inclusion (years) Median (range) 51 (31–74) 51.5 (33–74) 49 (31–74) ECOG performance status at inclusion ECOG≤1 92 (93.9%) 49 (94.2%) 43 (93.5%) ECOG=2 6 (6.1%) 3 (5.8%) 3 (6.5%) HR status of breast cancer Negative 44 (44.9%) 20 (38.5%) 24 (52.2%) Positive 54 (55.1%) 32 (61.5%) 22 (47.8%) Most recent known HER2 status (on primary or metastases) IHC 1+ 20 (20.4%) 20 (38.5%) 0 IHC 2+/ERBB2 ISH-negative 32 (32.7%) 32 (61.5%) 0 IHC 2+/ERBB2 ISH-positive 11 (11.2%) 0 11 (23.9%) IHC 3+ 35 (35.7%) 0 35 (76.1%) Ki67 index of breast cancer ≤20% 13 (13.3%) 10 (19.2%) 3 (6.5%) >20% 75 (76.5%) 37 (71.2%) 38 (82.6%) Missing 10 (10.2%) 5 (9.6%) 5 (10.9%) Number of metastatic sites at inclusion 1 28 (28.6%) 8 (15.4%) 20 (43.5%) 2 41 (41.8%) 14 (26.9%) 17 (37.0%) ≥3 31 (31.6%) 22 (42.3%) 9 (19.6%) Sites of metastasis at inclusion Liver metastasis 41 (41.8%) 25 (48.1%) 16 (34.8%) Lung metastasis 38 (38.8%) 23 (44.2%) 15 (32.6%) Brain metastasis 34 (34.7%) 17 (32.7%) 17 (37.0%) Bone metastasis 50 (51.0%) 30 (57.7%) 20 (43.5%) Previous anti‐HER2 therapy in any setting Yes 45 (45.9%) 0 45 (97.8%) No 53 (54.1%) 52 (100%) 1 (2.2%) Previous CDK4/6 inhibitor therapy Yes 34 (34.7%) 31 (59.6%) 3 (6.5%) No 64 (65.3%) 21 (40.4%) 43 (93.5%) Previous lines of treatment in any setting 1 9 (9.2%) 2 (3.8%) 7 (15.2%) 2 19 (19.4%) 8 (15.4%) 11 (23.9%) ≥3 70 (71.4%) 42 (80.8%) 28 (60.9%) Abbreviations Clinical Outcomes Overall, 98 patients received the recommended dose of T-DXd (5.4 mg per kilogram of body weight). In the overall cohort (n = 98), the mPFS was 15.0 months ( Figure 1A Table 2 Figure 1B Table 2 Response to T-DXd in 98 Metastatic Breast Cancer Patients Response Overall Population HER2-Low HER2-Positive Complete response (CR) 2 (2.0%) 1 (1.9%) 1 (2.2%) Partial response (PR) 37 (37.8%) 20 (38.5%) 17 (37.0%) Stable disease (SD) 29 (29.6%) 10 (19.2%) 19 (41.3%) Progressive disease (PD) 30 (30.6%) 21 (40.4%) 9 (19.6%) Figure 1 Progression-free survival (PFS) in patients treated with T-DXd. ( A B Subgroup Analysis In the HER2-low expression and HER2-positive expression groups, PFS was 9.0 months (95% CI, 4.73–13.27) and not reached, respectively ( Figure 2A B Figure 2 Efficacy of T-DXd and median PFS in HER2-low and HER2-positive patients. ( A B The Log rank test results showed that, in the HER2-low cohort, liver metastasis (p = 0.003) were significantly associated with the effectiveness of T-DXd, whereas age, brain metastasis, bone metastasis, and lines of previous treatment did not show a significant impact. In contrast, within the HER2-positive cohort, none of the evaluated factors—including age, liver metastasis, brain metastasis, bone metastasis, lung metastasis, prior anti-HER2 therapy, or lines of previous treatment—were significantly associated with T-DXd efficacy ( Table 3 Table 3 Log-Rank Analysis of Factors Associated with T-DXd PFS Characteristic Log-Rank Analysis p-value HER2-Low HER2-Positive Age (≥50 vs < 50) 0.373 0.355 Brain metastasis (yes vs no) 0.506 0.058 Liver metastasis (yes vs no) 0.003 0.447 Bone metastasis (yes vs no) 0.623 0.481 CDK4/6 inhibitor therapy (yes vs no) 0.346 Previous anti‐HER2 therapy in any setting 0.830 Lines of previous treatment (<3 vs ≥3) 0.273 0.572 In the HER2-low cohort, patients without liver metastases exhibited significantly longer PFS than those with liver metastases (15.0 months vs 6.0 months, p = 0.003) ( Figure 3A Figure 3B Figure 3 Subgroup analysis of factors associated with PFS in HER2-low and HER2-positive cohorts. ( A B Among the study cohort, 34 patients (34.7%) had brain metastases (BM) at the time of T-DXd initiation. In this subgroup, the median progression-free survival (PFS) was 15.5 months, and the 12-month PFS rate reached 65.3%. A further stratified analysis of patients who had received ≤2 prior lines of therapy in HER2-positive patients—a population similar to that enrolled in the DESTINY-Breast12 (DB-12) trial—showed that the median PFS in patients with BM was not reached, and the 12-month PFS rate reached 88.9%. In addition, five patients in our cohort presented with leptomeningeal metastasis (LM), of whom three had concurrent parenchymal brain metastases. Four out of five LM patients (80.0%) achieved disease control under T-DXd treatment, including one patient who attained a PFS of 9 months. In our retrospective study, we analyzed survival and response data of patients treated with T-DXd according to age and compared the findings to the outcomes reported in the DB-01, DB-02 and DB-03 studies ( Table 4 Table 4 Comparative Analysis of PFS, ORR, and DCR According to Age in Patients Receiving T-DXd DB-01 DB-02 DB-03 Present Study <65 (n=140) ≥65 (n=44) <65 (n=321) ≥65 (n=85) <65 (n=212) ≥65 (n=49) <65 (n=81) ≥65 (n=17) mPFS, (95% CI) 18.1 (13.8-NE) 19.4 (12.4-NE) 17.9 (14.1–20.8) 16.8 (12.7-NE) 30.4 (22.4-NE) 25.1 (14.1–37.3) 20.0 (4.8–35.2) 15.0 (3.8–26.2) ORR, (95% CI) 62.1 (53.6–70.2) 61.4 (45.5–75.6) 70.7 (65.4–75.6) 65.9 (54.8–75.8) 78.8 (72.6–84.1) 77.6 (63.4–88.2) 46.9 (35.7–58.3) 52.9 (27.8–77.0) DCR, n (%) 136 (97.1) 43 (97.7) 296 (92.2) 82 (96.5) 205 (96.7) 47 (95.9) 57 (70.4) 11 (64.7) Safety Grade ≥3 adverse events included neutropenia (20.4%), nausea (5.1%), and anemia (4.1%). Drug-related interstitial lung disease (ILD) occurred in 6.1% of patients, and 2.0% of patients discontinued medication due to ILD. Permanent discontinuation due to adverse events occurred in three patients (2.0%), including two cases of ILD and one case of renal impairment, indicating that the regimen was generally well tolerated. Discussion T-DXd has redefined the treatment landscape for HER2-expressing metastatic breast cancer, with clinical trial data supporting its use in both HER2-positive and HER2-low populations. In this real-world cohort, we observed meaningful clinical activity of T-DXd in heavily pretreated patients, consistent with results from the series of DB trials. In the overall cohort, the mPFS of 15.0 months and ORR of 37.0% were numerically lower than those observed in the DB-03 (mPFS: 28.8 months; ORR: 78.8%) and DB-04 (mPFS: 10.1 months; ORR: 52.6%) trials. This discrepancy likely reflects real-world complexity, including a higher burden of disease (eg, 44% with liver metastases), more extensive prior therapy (median of 3 lines), and inclusion of patients with poor prognostic features. Notably, patients with HER2-low tumors derived clinical benefit from T-DXd, with a median PFS of 9.0 months—comparable to the DB-04 population (10.1 months). However, outcomes remained inferior to those in HER2-positive patients, supporting the hypothesis that HER2 expression level continues to influence T-DXd efficacy. HER2 expression plays a critical role in predicting the efficacy of T‑DXd, making accurate and reproducible HER2 assessment indispensable in clinical practice. Currently, pathological evaluation of HER2 status relies predominantly on IHC and FISH, even though the original purpose of IHC was to distinguish HER2 IHC 3+ from lower levels of expression. 18 19 20 At the 2024 ESMO Congress, the DB-12 trial presented the first prospective data focusing on the management of brain metastases in patients with HER2-positive breast cancer following ≤2 prior lines of therapy. 21 Leptomeningeal metastasis (LM) from breast cancer is a highly invasive and clinically devastating complication that occurs in approximately 5–15% of advanced breast cancer patients, associated with significant neurological morbidity and poor prognosis. 22 23 Post–T-DXd progression remains a therapeutic challenge. In our study, PFS2 after T-DXd failure was short (median, 2.0 months), reflecting either intrinsic resistance or aggressive disease biology. Notably, a multicenter retrospective study involving 84 patients with HER2-low metastatic breast cancer reported a m PFS2 of 4.4 months with sequential T-DXd and SG treatment, suggesting that PFS2 may exceed 2 months in broader populations. 24 This study has limitations inherent to retrospective, single-institution analyses. Additionally, follow-up duration was modest, and survival data are immature. Ongoing studies and longer follow-up will further elucidate the long-term outcomes, explore mechanisms underlying resistance in HER2-low disease, and evaluate combinatorial strategies to enhance T-DXd efficacy in high-risk subgroups including liver metastases and other clinically aggressive disease phenotypes. Furthermore, our findings highlight the importance of multidisciplinary team (MDT) approaches in optimizing individualized treatment strategies, particularly for patients presenting with risk factors such as brain or liver metastases. In addition, proactive monitoring and management of interstitial lung disease (ILD), a known adverse event associated with T-DXd, remains critical to ensuring treatment safety and maximizing clinical benefit. These insights provide a framework for future clinical practice and research aimed at refining patient selection, sequencing therapies, and implementing comprehensive care models in the management of HER2-expressing metastatic breast cancer. In conclusion, T-DXd demonstrated robust efficacy in both HER2-positive and HER2-low metastatic breast cancer patients, with an excellent safety and tolerability profile. The results support its use in routine clinical practice and underscore the need for optimized patient selection and post-progression strategies. Acknowledgments The authors thank all the patients, investigators, and their institutions for the time and effort put into this study. This work was supported by grants from. Abbreviations ADC, Antibody-drug conjugate; AE, Adverse event; BM, Brain metastasis; CI, Confidence interval; CR, Complete response; DCR, Disease control rate; HER2, Human epidermal growth factor receptor 2; HR, Hormone-receptor; HR, Hazard ratio; ILD, Interstitial lung disease; ISH, In situ hybridization; LM, Leptomeningeal metastasis; mPFS, Median progression-free survival; ORR, Objective response rate; PD, Progressive disease; PFS, Progression-free survival; PR, Partial response; RECIST, Response evaluation criteria in solid tumors; SD, Stable disease; T-DM1, Trastuzumab emtansine; T-DXd, Trastuzumab deruxtecan. Author Contributions All authors made a significant contribution to the work reported, whether that is in the conception, study design, execution, acquisition of data, analysis and interpretation, or in all these areas; took part in drafting, revising or critically reviewing the article; gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work. Disclosure The authors declare that there is no conflict of interest in this work. References 1. Siegel RL Kratzer TB Giaquinto AN Sung H Jemal A Cancer statistics, 2025 CA Cancer J Clin 2025 75 10 45 10.3322/caac.21871 39817679 PMC11745215 2. Perou CM Sørlie T Eisen MB Molecular portraits of human breast tumours Nature 2000 406 747 752 10.1038/35021093 10963602 3. Slamon DJ Clark GM Wong SG Human Breast Cancer: correlation of Relapse and Survival with Amplification of the HER-2/neu Oncogene Science 1987 235 177 182 10.1126/science.3798106 3798106 4. Owens MA Horten BC Da Silva MM HER2 amplification ratios by fluorescence in situ hybridization and correlation with immunohistochemistry in a cohort of 6556 breast cancer tissues Clin Breast Cancer 2004 5 63 69 10.3816/CBC.2004.n.011 15140287 5. Schettini F Chic N Brasó-Maristany F Clinical, pathological, and PAM50 gene expression features of HER2-low breast cancer NPJ Breast Cancer 2021 7 1 10.1038/s41523-020-00208-2 33397968 PMC7782714 6. Tarantino P Hamilton E Tolaney SM HER2-low breast cancer: pathological and clinical landscape J Clin Oncol 2020 38 1951 1962 10.1200/JCO.19.02488 32330069 7. Stanowicka-Grada M Senkus E Anti-HER2 drugs for the treatment of advanced HER2 positive breast cancer Curr Treat Options Oncol 2023 24 1633 1650 10.1007/s11864-023-01137-5 37878202 PMC10643304 8. Badve SS Gokmen-Polar Y Hoersch S Role of tumor infiltrating lymphocytes (TILs) in HER2+ metastatic breast cancers (MBC) treated with trastuzumab emtansine (T-DM1) or lapatinib plus capecitabine (L+C) (EMILIA trial) J clin oncol 2016 34 607 10.1200/JCO.2016.34.15_suppl.607 9. Yang C Brezden-Masley C Joy AA Targeting HER2-low in metastatic breast cancer: an evolving treatment paradigm Ther Adv Med Oncol 2023 15 17588359231175440 10.1177/17588359231175440 37323186 PMC10262633 10. Montemurro F Delaloge S Barrios CH Trastuzumab emtansine (T-DM1) in patients with HER2-positive metastatic breast cancer and brain metastases: exploratory final analysis of cohort 1 from KAMILLA, a single-arm phase IIIb clinical trial☆ Ann Oncol 2020 31 1350 1358 10.1016/j.annonc.2020.06.020 32634611 11. Ogitani Y Hagihara K Oitate M Naito H Agatsuma T Bystander killing effect of DS-8201a, a novel anti-human epidermal growth factor receptor 2 antibody-drug conjugate, in tumors with human epidermal growth factor receptor 2 heterogeneity Cancer Sci 2016 107 1039 1046 10.1111/cas.12966 27166974 PMC4946713 12. Narayan P Osgood CL Singh H FDA approval summary: fam-trastuzumab deruxtecan-nxki for the treatment of unresectable or metastatic HER2-positive breast cancer Clin Cancer Res 2021 27 4478 4485 10.1158/1078-0432.CCR-20-4557 33753456 PMC8570919 13. Patient-reported outcomes and hospitalization data in patients with HER2-positive metastatic breast cancer receiving trastuzumab deruxtecan or trastuzumab emtansine in the phase III DESTINY-Breast03 study - PubMed Available from https://pubmed.ncbi.nlm.nih.gov/37179020/ Accessed September 22 10.1016/j.annonc.2023.04.516 37179020 14. Yamashita T Sohn JH Tokunaga E Trastuzumab deruxtecan versus treatment of physician’s choice in previously treated asian patients with HER2-low unresectable/metastatic breast cancer: subgroup analysis of the DESTINY-Breast04 study Breast Cancer 2024 31 858 868 10.1007/s12282-024-01600-7 38884900 PMC11341650 15. Curigliano G Hu X Dent RA Trastuzumab deruxtecan (T-DXd) vs physician’s choice of chemotherapy (TPC) in patients (pts) with hormone receptor-positive (HR+), human epidermal growth factor receptor 2 (HER2)-low or HER2-ultralow metastatic breast cancer (mBC) with prior endocrine therapy (ET): primary results from DESTINY-Breast06 (DB-06) J Clin Oncol 2024 42 1 10.1200/JCO.2024.42.17_suppl.LBA1000 16. Garrison LP Neumann PJ Erickson P Marshall D Mullins CD Using real-world data for coverage and payment decisions: the ISPOR real-world data task force report Value Health 2007 10 326 335 10.1111/j.1524-4733.2007.00186.x 17888097 17. Common terminology criteria for adverse events (CTCAE) version 5.0 Docslib 2017 Available from https://docslib.org/doc/4160269/common-terminology-criteria-for-adverse-events-ctcae-version-5-0-published-november-27-2017 Accessed September 22 18. Ivanova M Porta FM D’Ercole M Standardized pathology report for HER2 testing in compliance with 2023 ASCO/CAP updates and 2023 ESMO consensus statements on HER2-low breast cancer Virchows Arch 2024 484 3 14 10.1007/s00428-023-03656-w 37770765 PMC10791807 19. Wu S Shang J Li Z Interobserver consistency and diagnostic challenges in HER2-ultralow breast cancer: a multicenter study ESMO Open 2025 10 104127 10.1016/j.esmoop.2024.104127 39891991 PMC11841085 20. Bornstein-Quevedo L de Anda-González J Lara-Torres CO Navigating HER2-low testing in invasive breast cancer: update recommendations for pathologists J Pers Med 2024 14 467 10.3390/jpm14050467 38793049 PMC11122297 21. Harbeck N Ciruelos E Jerusalem G Trastuzumab deruxtecan in HER2-positive advanced breast cancer with or without brain metastases: a phase 3b/4 trial Nat Med 2024 30 3717 3727 10.1038/s41591-024-03261-7 39271844 PMC11645283 22. Thakkar JP Kumthekar P Dixit KS Stupp R Lukas RV Leptomeningeal metastasis from solid tumors J Neurol Sci 2020 411 116706 10.1016/j.jns.2020.116706 32007755 23. Vaz Batista M Pérez-García JM Garrigós L The DEBBRAH trial: trastuzumab deruxtecan in HER2-positive and HER2-low breast cancer patients with leptomeningeal carcinomatosis Med 2025 6 100502 10.1016/j.medj.2024.08.001 39265579 24. Huppert LA Mahtani R Fisch S Multicenter retrospective cohort study of the sequential use of the antibody-drug conjugates (ADCs) trastuzumab deruxtecan (T-DXd) and sacituzumab govitecan (SG) in patients with HER2-low metastatic breast cancer (MBC) NPJ Breast Cancer 2025 11 34 10.1038/s41523-025-00748-5 40234477 PMC12000457 ",
  "metadata": {
    "Title of this paper": "Multicenter retrospective cohort study of the sequential use of the antibody-drug conjugates (ADCs) trastuzumab deruxtecan (T-DXd) and sacituzumab govitecan (SG) in patients with HER2-low metastatic breast cancer (MBC)",
    "Journal it was published in:": "Breast Cancer : Targets and Therapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479221/"
  }
}