{
  "title": "Paper_1097",
  "abstract": "pmc Vaccines (Basel) Vaccines (Basel) 2764 vaccines vaccines Vaccines 2076-393X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474426 PMC12474426.1 12474426 12474426 41012167 10.3390/vaccines13090964 vaccines-13-00964 1 Systematic Review Strategies to Increase Vaccinations in Adult Cancer Patients: A Systematic Review https://orcid.org/0000-0002-9472-3263 Lo Moro Giuseppina 1 * Golzio Federica 1 Calabrese Sara Claudia 1 https://orcid.org/0000-0001-5189-1294 Scaioli Giacomo 1 Basile Alessandro 1 Siliquini Roberta 1 2 † Bert Fabrizio 1 3 † Simecka Jerry W. Academic Editor 1 federica.golzio@unito.it saraclaudia.calabrese@unito.it giacomo.scaioli@unito.it alessandro.basile@unito.it roberta.siliquini@unito.it fabrizio.bert@unito.it 2 3 * giuseppina.lomoro@unito.it † These authors contributed equally to this work. 11 9 2025 9 2025 13 9 497676 964 31 7 2025 04 9 2025 09 9 2025 11 09 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Although vaccinations are a priority for patients with cancer, achieving high coverage remains challenging. Evidence on effective strategies in oncology settings is still limited. This systematic review aimed to identify interventions to improve vaccination uptake or reduce hesitancy among cancer patients. Methods: A systematic search was conducted in PubMed, Embase, and Scopus, including studies published up to the end of 2023. The protocol was registered in PROSPERO (CRD42024511008). Results: Out of 10,927 non-duplicate records, 15 studies describing unique interventions were included. All studies were published between 2011 and 2022, primarily conducted in Europe/UK (40%) and in North America (40%). The most common study design was pre-post (60%), and 33.3% included a control group. Most interventions were multi-component (60%) and were classified into three main categories: educational materials/campaigns (46.7%), reminders (40%), and patient counselling (33.3%). Additional components included guideline development in two studies. Some studies also highlighted the importance of specific key figures, such as dedicated professionals, general practitioners, and pharmacists. Interventions mainly targeted patients (40%), with 33.3% addressing both healthcare professionals and patients and 26.7% professionals only. They most frequently concerned vaccinations against influenza and pneumococcal disease (26.7%), pneumococcal disease alone (26.7%), or Coronavirus Disease 2019 (COVID-19) (26.7%). Vaccination uptake was the primary outcome in 86.7% of studies, with 66.7% reporting significant improvements. Conclusions: This review identified a variety of strategies, with education, reminders, and counselling as key components. Multicomponent interventions and those involving both patients and providers were most promising. However, methodological limitations and limited generalizability highlighted the need for more rigorous research. cancer patients vaccination systematic review This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction According to the Global Cancer Observatory, the incidence of new cancer cases in 2022 was almost 20 million worldwide [ 1 2 3 4 5 6 Vaccination is an effective strategy to reduce the risk of infection-related complications and deaths [ 7 8 9 p 10 11 12 13 Indeed, although the immune response of oncological patients can be persistently suppressed, they can still reach seroprotection in many cases thanks to vaccines, thus making some of the most common infections in cancer patients vaccine-preventable [ 14 15 Although vaccinations are a priority for patients with cancer, available data highlighted the difficulty in achieving high coverage rates in this population. For example, despite a long-standing target of at least 75% influenza vaccination coverage among at-risk groups including cancer patients [ 16 17 18 19 20 19 21 22 15 Therefore, the present systematic review aimed to identify and synthesize existing interventions to improve vaccine uptake or reduce hesitancy among cancer patients and cancer survivors. In addition, this review sought to describe the efficacy of these strategies, providing an overview of the current evidence in this population. 2. Materials and Methods This review was conducted according to the latest version of the Preferred Reporting Items for Systematic reviews and Meta-Analyses (PRISMA) guidelines [ 23 24 2.1. Eligibility Criteria Methods and search strategy were planned in advance, after a preliminary literature analysis. The main review question was “Are there strategies to reduce vaccine hesitancy and/or improve vaccine adherence among cancer patients and/or cancer survivors? Are these strategies effective?” and the strategy was developed according to the PICO framework. About “Population”, all the studies about adult oncological patients were considered. We defined “adult” as any patient aged 18 years or older and “oncological patient” as any patient currently under treatment (chemotherapy, radiotherapy, and every other cancer therapy), newly diagnosed patients, patients currently in follow-up, and cancer survivors who had completed follow-up. Regarding “Intervention”, all the strategies or interventions that aimed to increase vaccine uptake or reduce vaccine hesitancy among cancer patients/survivors or enhance vaccine recommendations by HCPs were considered. Thus, the target of the intervention could be both patients and/or HCPs, as long as the ultimate broad aim of the intervention is to increase vaccine coverage among the oncological population. Considering “Comparison”, studies with any comparison were considered, including those without a control group. Lastly, for “Outcome”, studies with any primary outcome evaluating the efficacy of strategies to reduce the vaccine hesitancy and/or to improve vaccination adherence were considered; for instance: vaccine uptake/coverage in the oncological population, vaccine recommendations by HCPs, patients’ willingness to get vaccinated, knowledge on vaccinations among oncological patients/survivors and/or HCPs. We considered eligible only peer-reviewed research articles written in English, as this is the only language fully understood by all Authors in addition to their native language. We did not consider any restriction about country or publication year. In addition to the criteria defined by the PICO framework, we included any primary study with original data evaluating an intervention, regardless of design. Eligible study types included randomized controlled trials (RCTs), quasi-experimental studies (with or without control groups), case–control studies, and cohort studies. Research protocols, letters to the editor, and commentaries were excluded because they do not provide original data. According to this criterion, systematic and narrative reviews were excluded from data extraction. However, pertinent reviews were retained during the study selection to identify additional eligible primary studies in the bibliography. 2.2. Information Sources and Search Strategy We performed the primary search in three different databases (PubMed, Embase, and Scopus). PubMed and Embase were selected as they are considered essential databases for biomedical systematic reviews [ 25 26 27 28 The search strategy combined free-text terms and controlled vocabulary terms for three main concepts: vaccination (e.g., vaccine*, immuniz*, immunis*), cancer (e.g., cancer*, malignan*, tumor*, tumour*, neoplasm*), and vaccine hesitancy or uptake (e.g., hesit*, uptake*, coverage*, refus*). All the queries we used are shown in the Supplementary File (Supplementary File S1) 2.3. Selection Process First, four Authors (G.L.M., A.B., S.C.C., F.G.) manually removed duplicates using Rayyan. The Authors proceeded to screen the title and abstract of all retrieved records. As a training, the Authors initially reviewed 5% of the papers. After a consensus-based discussion, the team proceeded to screen all the remaining titles and abstracts. Then, the Authors screened the full texts of the papers selected in the previous steps. Only after full-text selection, the reference lists of included studies were screened to identify additional relevant publications. The Authors also screened the reference lists of systematic reviews related to vaccines, cancer patients, and vaccination strategies, provided these reviews had been deemed relevant after full-text screening. Every step of study selection was performed by at least two Authors independently and in duplicate and followed by a consensus-based discussion with the entire team to solve conflicts, except for the duplicate deletion. 2.4. Data Collection Process and Data Items Data extraction was performed using Microsoft Excel. The extracted data were: first author, year of publication, language, country; characteristics of the study, e.g., study design, sample size, presence of a control group, setting, length of the study and year of the study; characteristics of participants; characteristics of the intervention (and of the control group, if applicable), e.g., vaccine used, component of the intervention; outcome measures and results; presence of any declared conflicts of interest and funding sources; any other valuable comment. Following a discussion among all members of the research team, interventions were classified into categories and their main components were identified, to provide a narrative synthesis of the findings. Every step of data extraction was performed by at least two Authors blinded to each other and followed by a consensus-based discussion with the entire team to solve conflicts. 2.5. Study Risk of Bias Assessment To assess the risk of bias of the RCTs, we used the Cochrane risk-of-bias tool for randomized trials (RoB 2) version 2 [ 29 30 2.6. Synthesis Methods We conducted a narrative synthesis of the interventions. The synthesis focused on the types of strategies used and their reported primary outcomes and primary results. Due to heterogeneity in study designs, target populations, intervention components, and outcome measures no quantitative synthesis was performed. Along with a narrative synthesis, Summary of Findings tables were created to present the key characteristics and results of each included study. 2.7. Effect Measures, Reporting Bias Assessment and Certainty Assessment Due to the heterogeneity of interventions and as no quantitative synthesis was conducted, effect measures were not pooled across studies. Accordingly, no formal assessment of reporting bias was performed. We assessed the certainty of the evidence using the Grading of Recommendations Assessment, Development, and Evaluation (GRADE) approach [ 31 3. Results 3.1. Study Selection We screened 10,927 not-duplicate records. Figure 1 Supplementary Material (Supplementary Figure S1) 32 33 34 35 35 34 More than half of the studies (53.3%) declared no funding and only 2 studies (13.3%) did not report any information. Considering conflict of interests, 86.7% disclosed no conflicts and only 1 study (6.7%) did not have information about it. ( Supplementary Table S1 3.2. Study Characteristics All included studies were conducted between 2011 and 2022 (published between 2015 and 2023); 47% of studies were active in 2021. The studies occurred primarily in European/UK (40%) [ 34 36 37 38 39 40 41 42 43 44 45 46 47 48 49 34 36 37 38 40 41 43 44 48 46 49 Table 1 34 39 45 46 49 Table S1 The studies varied in length from the shortest (17 days [ 41 38 34 38 42 44 45 46 47 48 49 37 39 40 46 47 49 41 42 43 45 48 34 36 38 44 42 47 39 43 47 42 46 37 46 46 45 36 38 42 46 43 44 48 49 39 40 41 47 34 37 A large proportion of the interventions had multiple components (60%) [ 36 38 39 42 43 44 45 48 49 40 41 36 40 41 42 44 45 49 34 38 39 43 45 48 37 39 46 47 49 36 38 34 36 37 38 39 42 43 44 45 46 47 48 49 40 41 49 Table 2 Table 3 In conclusion, the included studies were highly heterogeneous, precluding quantitative synthesis. This heterogeneity was largely driven by substantial differences in intervention composition and target populations. For instance, focusing on the three most frequently reported outcomes, only in two cases did the studies with pneumococcal vaccination coverage as the primary outcome (n = 10) involve interventions that could be classified into similar categories; the remaining cases differed in their components. For influenza (n = 4) and COVID-19 vaccination coverage (n = 2), interventions were entirely distinct in composition. Differences in delivery modes, target groups, and outcome measures further limited comparability and made pooling of results infeasible. 3.3. Results Synthesis 3.3.1. Educational Materials and Campaigns Educational materials and campaigns were the most frequent component, being present in 7 interventions (46.7%) [ 36 40 41 42 44 45 49 40 45 49 36 44 41 42 36 42 44 45 49 In 5 interventions, it was the sole component [ 40 41 36 42 44 41 40 41 Among the multi-component interventions in which education was the main component [ 36 42 44 44 44 36 42 3.3.2. Reminders Reminders of any kind (e.g., text messages, telephone calls, personalized letters, pop-up alerts) were a component in 6 interventions (40%) [ 34 38 39 43 45 48 39 34 38 43 45 48 38 39 43 45 48 In 5 interventions, reminders were the only component [ 34 39 43 45 48 45 39 43 48 45 43 45 48 34 45 The single-component intervention [ 34 Three interventions included reminders both for patients and for HCPs [ 43 45 48 43 45 48 Lastly, in the intervention by Narinx et al. [ 39 It is also worth noting the sixth intervention that included reminders, although not as a primary component [ 38 3.3.3. Patient Counselling Patient counselling was included in 5 interventions (33.3%) [ 37 39 46 47 49 39 49 37 47 46 49 39 In 4 interventions, patient counselling was the only component [ 37 46 47 49 37 47 37 47 46 49 37 47 46 Last, Ozdemir et al. [ 49 3.4. Risk of Bias in Studies and Certainty of Evidence Among quasi-experimental and natural experimental studies (n = 13), two frequent sources of high risk of bias were identified: the absence of an independent control group (present in only 23.1% of studies; [ 34 39 45 42 Table S2 46 49 46 49 Figure S2 Due to the substantial variation across interventions, in most cases the certainty of the evidence using the GRADE assessment was based on a single study. Only in two instances (both concerning the primary outcome of pneumococcal vaccination coverage) two papers reporting interventions with similar components were considered together in the assessment. Across all three outcomes, the certainty of evidence was rated for each intervention as very low. This was predominantly due to risk of bias and imprecision ( Table S3 4. Discussion This systematic review identified strategies to improve vaccine uptake or reduce vaccine hesitancy among cancer patients. Despite heterogeneity in settings, populations, and intervention designs, several key themes emerged. Interventions fell into three main categories: education, reminders, and counselling. Educational materials and campaigns were the most frequently used components across interventions. These strategies targeted either HCPs, patients, or both. Among multi-component interventions where HCP education was the primary element, results were mixed. Interestingly, in one study [ 44 36 42 50 Reminders represented another key component and were consistently associated with significant improvements in vaccination uptake. Consistently, in other context, reminder-based interventions have proven effective in increase vaccine adherence among at-risk populations, especially when integrated into multi-modal strategies [ 51 52 53 54 55 56 Patient counselling was used in one-third of interventions and was consistently associated with improved vaccination uptake. In the two RCTs, counselling interventions were delivered by pharmacists, providing the most robust evidence. Our results are consistent with prior literature: the efficacy of counselling and recommendations has already been proved in other populations [ 57 58 59 21 60 61 62 63 Furthermore, additional important considerations emerged. The most commonly targeted vaccines were those against influenza, pneumococcal disease, and COVID-19. However, these represent only a portion of the immunizations currently recommended for cancer patients. According to the ASCO guidelines published in 2024 [ 15 64 51 65 66 51 65 66 Several limitations should be considered when interpreting the results of this review. First of all, there was a wide heterogeneity among the included studies, limiting possible quantitative analyses. The overall methodological quality of the studies was low: most were quasi-experimental, with few including independent control groups or pre-post comparisons. Only two studies were randomized controlled trials, and both were rated at high risk of bias, particularly in the randomization process. Indeed, considering the overall quality of evidence, our findings highlighted a very low quality. This does not necessarily indicate lack of efficacy but rather reflects the limited robustness, heterogeneity, and methodological weaknesses of the available studies. The outcomes were mostly limited to vaccination coverage, the specific contribution of each component within multi-component interventions could not be determined, and the included studies generally did not explore whether intervention efficacy varied according to patient characteristics. Moreover, long-term effects and sustainability of the interventions remained largely unexplored. Another limitation concerned the generalizability of findings. The majority of studies were conducted in Europe and North America, with limited representation of low- and middle-income settings. Considering our Methods, we acknowledge that limiting the search to three databases and including only papers written in English may have led to the exclusion of some relevant records. In conclusion, future studies should prioritize the development and evaluation of rigorously designed interventions, ideally through high-quality randomized controlled trials, to strengthen evidence in this field. Research should expand beyond influenza, pneumococcal disease, and COVID-19 vaccines and particular attention should be given to multi-component, oncology-tailored approaches that integrate educational, reminder-based, and counselling strategies, while exploring innovative digital solutions to engage both HCPs and patients. To effectively integrate the roles of oncologists, pharmacists, infectious disease specialists, and primary care providers, future research should also investigate resource needs, feasibility, and barriers, which are often highly context-specific. Moreover, studies should assess the differential impact of interventions across diverse patient subgroups, e.g., by cancer stage, and should evaluate long-term sustainability and cost-effectiveness. Another important direction is to explore strategies to protect cancer patients from misinformation and false rumors spread by anti-vaccination movements. Finally, extending research to low- and middle-income countries will be essential to ensure equitable access to vaccination and to generate context-specific evidence relevant to different healthcare systems. 5. Conclusions This systematic review highlighted a range of strategies mainly aimed at improving vaccine uptake among cancer patients. Interventions fell into three main categories (education, reminders, and counselling) all of which showed potential, particularly when combined. Educational initiatives targeting oncology professionals were common but appeared most effective when paired with other changes, such as designating a team member to oversee vaccinations or including patient education. Reminders consistently improved coverage and were also effective when they included primary care providers, a group often overlooked despite their central role in vaccine delivery. Patient counselling also showed positive outcomes and may be successfully delivered by a range of professionals, including pharmacists. However, most interventions focused on only a few vaccines and there were issues in the generalizability of results and in the methodology of the studies. Future studies should prioritize rigorous designs and the use of shared, standardized outcome measures to enhance comparability and evaluation. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/vaccines13090964/s1 67 Supplementary Materials Author Contributions Conceptualization, G.L.M., G.S., R.S. and F.B.; methodology, G.L.M., G.S., R.S. and F.B.; investigation, G.L.M., F.G., S.C.C. and A.B.; data curation, G.L.M., F.G., S.C.C. and A.B.; writing—original draft preparation, G.L.M., F.G., S.C.C. and A.B.; writing—review and editing, G.L.M., G.S., R.S. and F.B.; visualization, G.L.M., F.G., S.C.C. and A.B.; supervision, G.L.M., R.S. and F.B.; project administration, G.L.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: APRN Advanced Practice Nurse Practitioner ASCO American Society of Clinical Oncology EMR Electronic Medical Record GP General Practitioner HCP Healthcare Professional PICO Population, Intervention, Comparison, Outcome PRISMA Preferred Reporting Items for Systematic reviews and Meta-Analyses PROSPERO International Prospective Register of Systematic Reviews RCT Randomized Controlled Trial References 1. International Agency for Research on Cancer Cancer Today Absolute Numbers, Incidence, Both Sexes, in 2022 Available online: https://gco.iarc.fr/today/en/dataviz/pie?mode=population&group_populations=0&types=0&populations=900 (accessed on 30 July 2025) 2. Okoli G.N. Lam O.L.T. Abdulwahid T. Neilson C.J. Mahmud S.M. Abou-Setta A.M. Seasonal Influenza Vaccination among Cancer Patients: A Systematic Review and Meta-Analysis of the Determinants Curr. Probl. Cancer 2021 45 100646 10.1016/j.currproblcancer.2020.100646 32917396 3. Kunisaki K.M. Janoff E.N. Influenza in Immunosuppressed Populations: A Review of Infection Frequency, Morbidity, Mortality, and Vaccine Responses Lancet Infect. Dis. 2009 9 493 504 10.1016/S1473-3099(09)70175-6 19628174 PMC2775097 4. Zheng Y. Chen Y. Yu K. Yang Y. Wang X. Yang X. Qian J. Liu Z.-X. Wu B. Fatal Infections Among Cancer Patients: A Population-Based Study in the United States Infect. Dis. Ther. 2021 10 871 895 10.1007/s40121-021-00433-7 33761114 PMC8116465 5. Elhadi M. Khaled A. Msherghi A. Infectious Diseases as a Cause of Death among Cancer Patients: A Trend Analysis and Population-Based Study of Outcome in the United States Based on the Surveillance, Epidemiology, and End Results Database Infect. Agent. Cancer 2021 16 72 10.1186/s13027-021-00413-z 34972537 PMC8719405 6. Homsi J. Walsh D. Panta R. Lagman R. Nelson K.A. Longworth D.L. Infectious Complications of Advanced Cancer Support. Care Cancer 2000 8 487 492 10.1007/s005200000143 11094994 7. Lopez A. Mariette X. Bachelez H. Belot A. Bonnotte B. Hachulla E. Lahfa M. Lortholary O. Loulergue P. Paul S. Vaccination Recommendations for the Adult Immunosuppressed Patient: A Systematic Review and Comprehensive Field Synopsis J. Autoimmun. 2017 80 10 27 10.1016/j.jaut.2017.03.011 28381345 8. Kirkwood M.K. Aggarwal C. Bruinooge S.S. Williams J.H. Kaltenbaugh M. Ramos N. Gralow J.R. Garrett-Mayer E. Differential Survival Among Patients With Cancer by COVID-19 Vaccination Status: An Analysis of the ASCO COVID-19 Registry JCO Oncol. Adv. 2024 1 e2400034 10.1200/OA-24-00034 9. Bersanelli M. Verzoni E. Cortellini A. Giusti R. Calvetti L. Ermacora P. Di Napoli M. Catino A. Guadalupi V. Guaitoli G. Impact of Influenza Vaccination on Survival of Patients with Advanced Cancer Receiving Immune Checkpoint Inhibitors (INVIDIa-2): Final Results of the Multicentre, Prospective, Observational Study eClinicalMedicine 2023 61 102044 10.1016/j.eclinm.2023.102044 37434748 PMC10331809 10. Li C. Chen L. Lin H. Lee M. Hung S. Lai C. Huang L. Yu B. Hsu F. Chiou W. Impact of 23-valent Pneumococcal Polysaccharide Vaccination on the Frequency of Pneumonia-related Hospitalization and Survival in Elderly Patients with Prostate Cancer: A Seven-year Nationwide Matched Cohort Study Cancer 2021 127 124 136 10.1002/cncr.33203 32997342 11. Salem A. La E.M. Curran D. Patterson B.J. Carrico J. Lorenc S. Hicks K.A. Poston S. Carpenter C.F. Cost-Effectiveness of Recombinant Zoster Vaccine for the Prevention of Herpes Zoster in Hematopoietic Stem Cell Transplant Recipients and Other Immunocompromised Adults in the United States Pharmacoecon. Open 2023 7 975 985 10.1007/s41669-023-00438-7 37917310 PMC10721768 12. Cho B.-H. Stoecker C. Link-Gelles R. Moore M.R. Cost-Effectiveness of Administering 13-Valent Pneumococcal Conjugate Vaccine in Addition to 23-Valent Pneumococcal Polysaccharide Vaccine to Adults with Immunocompromising Conditions Vaccine 2013 31 6011 6021 10.1016/j.vaccine.2013.10.024 24148572 13. Avritscher E.B.C. Cooksley C.D. Geraci J.M. Bekele B.N. Cantor S.B. Rolston K.V. Elting L.S. Cost-effectiveness of Influenza Vaccination in Working-age Cancer Patients Cancer 2007 109 2357 2364 10.1002/cncr.22670 17457827 14. Robin C. Beckerich F. Cordonnier C. Immunization in Cancer Patients: Where We Stand Pharmacol. Res. 2015 92 23 30 10.1016/j.phrs.2014.10.002 25461457 15. Kamboj M. Bohlke K. Baptiste D.M. Dunleavy K. Fueger A. Jones L. Kelkar A.H. Law L.Y. LeFebvre K.B. Ljungman P. Vaccination of Adults With Cancer: ASCO Guideline J. Clin. Oncol. 2024 42 1699 1721 10.1200/JCO.24.00032 38498792 PMC11095883 16. Commission of the European Communities Council Recommendation on Seasonal Influenza Vaccination Commission of the European Communities Brussels, Belgium 2009 17. Amdisen L. Pedersen L. Abildgaard N. Benn C.S. Rørth M. Cronin-Fenton D. Sørup S. The Coverage of Influenza Vaccination and Predictors of Influenza Non-Vaccination in Danish Cancer Patients: A Nationwide Register-Based Cohort Study Vaccine 2024 42 1690 1697 10.1016/j.vaccine.2024.02.009 38350769 18. Chang A. Ellingson M.K. Flowers C.R. Bednarczyk R.A. Influenza Vaccination Rates Among Patients With a History of Cancer: Analysis of the National Health Interview Survey Open Forum Infect. Dis. 2021 8 ofab198 10.1093/ofid/ofab198 34322565 PMC8312520 19. Doornekamp L. van Leeuwen L. van Gorp E. Voeten H. Goeijenbier M. Determinants of Vaccination Uptake in Risk Populations: A Comprehensive Literature Review Vaccines 2020 8 480 10.3390/vaccines8030480 32867126 PMC7563537 20. Doherty M. Schmidt-Ott R. Santos J.I. Stanberry L.R. Hofstetter A.M. Rosenthal S.L. Cunningham A.L. Vaccination of Special Populations: Protecting the Vulnerable Vaccine 2016 34 6681 6690 10.1016/j.vaccine.2016.11.015 27876197 21. Chun J.Y. Kim S.I. Park E.Y. Park S.-Y. Koh S.-J. Cha Y. Yoo H.J. Joung J.Y. Yoon H.M. Eom B.W. Cancer Patients’ Willingness to Take COVID-19 Vaccination: A Nationwide Multicenter Survey in Korea Cancers 2021 13 3883 10.3390/cancers13153883 34359783 PMC8345425 22. Malik A.A. Ahmed N. Shafiq M. Elharake J.A. James E. Nyhan K. Paintsil E. Melchinger H.C. Team Y.B.I. Malik F.A. Behavioral Interventions for Vaccination Uptake: A Systematic Review and Meta-Analysis Health Policy 2023 137 104894 10.1016/j.healthpol.2023.104894 37714082 PMC10885629 23. Page M.J. McKenzie J.E. Bossuyt P.M. Boutron I. Hoffmann T.C. Mulrow C.D. Shamseer L. Tetzlaff J.M. Akl E.A. Brennan S.E. The PRISMA 2020 Statement: An Updated Guideline for Reporting Systematic Reviews BMJ 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 24. Calabrese S.C. Lo Moro G. Basile A. Golzio F. Scaioli G. Bert F. Siliquini R. Strategies to Improve Vaccine Adherence in Adult Oncology Patients: A Systematic Review Proceedings of the Atti 57° Congresso Nazionale Società Italiana Igiene, Medicina Preventiva e Sanità Pubblica (SItI) Palermo, Italy 23–26 October 2024 E490 25. Lefebvre C. Glanville J. Briscoe S. Featherstone R. Littlewood A. Metzendorf M.-I. Noel-Storr A. Paynter R. Rader T. Thomas J. Chapter 4: Searching for and Selecting Studies Cochrane Handbook for Systematic Reviews of Interventions version 6.5.1 Cochrane Higgins J. Thomas J. Chandler J. Cumpston M. Li T. Page M. Welch V. John Wiley & Sons Chichester, UK 2019 Available online: https://www.cochrane.org/authors/handbooks-and-manuals/handbook/current/chapter-04#section-4-7 (accessed on 3 September 2025) 26. Gusenbauer M. Haddaway N.R. Which Academic Search Systems Are Suitable for Systematic Reviews or Meta-analyses? Evaluating Retrieval Qualities of Google Scholar, PubMed, and 26 Other Resources Res. Synth. Methods 2020 11 181 217 10.1002/jrsm.1378 31614060 PMC7079055 27. Pranckutė R. Web of Science (WoS) and Scopus: The Titans of Bibliographic Information in Today’s Academic World Publications 2021 9 12 10.3390/publications9010012 28. Ouzzani M. Hammady H. Fedorowicz Z. Elmagarmid A. Rayyan—A Web and Mobile App for Systematic Reviews Syst. Rev. 2016 5 210 10.1186/s13643-016-0384-4 27919275 PMC5139140 29. Sterne J.A.C. Savović J. Page M.J. Elbers R.G. Blencowe N.S. Boutron I. Cates C.J. Cheng H.-Y. Corbett M.S. Eldridge S.M. RoB 2: A Revised Tool for Assessing Risk of Bias in Randomised Trials BMJ 2019 366 l4898 10.1136/bmj.l4898 31462531 30. Barker T.H. Habibi N. Aromataris E. Stone J.C. Leonardi-Bee J. Sears K. Hasanoff S. Klugar M. Tufanaru C. Moola S. The Revised JBI Critical Appraisal Tool for the Assessment of Risk of Bias for Quasi-Experimental Studies JBI Evid. Synth. 2024 22 378 388 10.11124/JBIES-23-00268 38287725 31. Guyatt G. Oxman A.D. Akl E.A. Kunz R. Vist G. Brozek J. Norris S. Falck-Ytter Y. Glasziou P. deBeer H. GRADE Guidelines: 1. Introduction—GRADE Evidence Profiles and Summary of Findings Tables J. Clin. Epidemiol. 2011 64 383 394 10.1016/j.jclinepi.2010.04.026 21195583 32. Butow P. Shaw J. Bartley N. Milch V. Sathiaraj R. Turnbull S. Der Vartanian C. Vaccine Hesitancy in Cancer Patients: A Rapid Review Patient Educ. Couns. 2023 111 107680 10.1016/j.pec.2023.107680 36842287 PMC9951090 33. Vanderpool R.C. Gaysynsky A. Chou W.-Y.S. Tonorezos E.S. Using Behavioral Science to Address COVID-19 Vaccine Hesitancy Among Cancer Survivors: Communication Strategies and Research Opportunities J. Behav. Med. 2023 46 366 376 10.1007/s10865-022-00304-7 35305205 PMC8933612 34. Kiderlen T.R. Trostdorf K. Delmastro N. Salomon A. Scholz C.W. Späth-Schwalbe E. Mansmann V. Roll S. Reinwald M. de Wit M. Controlled Non-randomised before–after Study Evaluating the Impact of a Focused Recommendation Card on Vaccination Rates of Oncological Patients—The Easy Vaccination in Oncology (EVO) Strategy Eur. J. Cancer Care 2022 31 e13725 10.1111/ecc.13725 36221170 35. Kiderlen T.R. Trostdorf K. Delmastro N. Salomon A. Scholz C.W. Späth-Schwalbe E. Mansmann V. Roll S. Reinwald M. de Wit M. Raising Immunization Rates among Cancer Patients Dtsch. Arztebl. Int. 2022 119 466 467 10.3238/arztebl.m2022.0167 36321685 PMC9639223 36. Rivière P. Penel N. Faure K. Marie G. Najem A. Rivière M.-K. Panaget S. Effect of Medical Staff Training on Vaccination Coverage in Outpatients with Cancer: An Interventional Multicenter before-and-after Study Vaccine X 2023 13 100261 10.1016/j.jvacx.2023.100261 36654840 PMC9841025 37. Sitte J. Frentiu E. Baumann C. Rousseau H. May T. Bronowicki J. Peyrin-Biroulet L. Lopez A. Vaccination for Influenza and Pneumococcus in Patients with Gastrointestinal Cancer or Inflammatory Bowel Disease: A Prospective Cohort Study of Methods for Improving Coverage Aliment. Pharmacol. Ther. 2019 49 84 90 10.1111/apt.15057 30485467 38. Toleman M.S. Herbert K. McCarthy N. Church D.N. Vaccination of Chemotherapy Patients—Effect of Guideline Implementation Support. Care Cancer 2016 24 2317 2321 10.1007/s00520-015-3037-6 26610767 39. Narinx J. Houbiers M. Seidel L. Beguin Y. Adherence to Sars-CoV2 Vaccination in Hematological Patients Front. Immunol. 2022 13 994311 10.3389/fimmu.2022.994311 36300128 PMC9588907 40. Tran V.-T. Sidorkiewicz S. Péan C. Ravaud P. Impact of an Interactive Web Tool on Patients’ Intention to Receive COVID-19 Vaccination: A before-and-after Impact Study among Patients with Chronic Conditions in France BMC Med. Inf. Decis. Mak. 2021 21 228 10.1186/s12911-021-01594-8 PMC8325218 34332570 41. Kelkar A.H. Blake J.A. Cherabuddi K. Cornett H. McKee B.L. Cogle C.R. Vaccine Enthusiasm and Hesitancy in Cancer Patients and the Impact of a Webinar Healthcare 2021 9 351 10.3390/healthcare9030351 33808758 PMC8003419 42. McGinnis J.M. Jones R. Hillis C. Kokus H. Thomas H. Thomas J. Alyafi M. Bernard L. Eiriksson L.R. Elit L.M. A Pneumococcal Pneumonia and Influenza Vaccination Quality Improvement Program for Women Receiving Chemotherapy for Gynecologic Cancers at a Major Tertiary Cancer Centre Gynecol. Oncol. 2021 161 236 243 10.1016/j.ygyno.2021.01.014 33526258 43. Church E.C. Banks R. Wilson B. Arfons L. Perez F. Jump R. Improving Pneumococcal Vaccine Uptake in Veterans with Chronic Lymphocytic Leukemia through a Virtual Clinic Curr. Oncol. 2018 25 95 98 10.3747/co.25.3756 PMC5832298 29507501 44. Delacruz W. Terrazzino S. Osswald M. Payne C. Haney B. Implementing a Multidisciplinary Approach to Enhance Compliance With Guideline-Recommended Prechemotherapy Pneumococcal Vaccination in a Military-Based Medical Oncology Practice J. Oncol. Pr. 2017 13 e966 e971 10.1200/JOP.2016.015602 28876159 45. Grivas P.D. Devata S. Khoriaty R. Boonstra P.S. Ruch J. McDonnell K. Hernandez-Aya L. Wilfong J. Smerage J. Ison M.G. Low-Cost Intervention to Increase Influenza Vaccination Rate at a Comprehensive Cancer Center J. Cancer Educ. 2017 32 871 877 10.1007/s13187-016-1017-2 27055536 46. Nipp R.D. Ruddy M. Fuh C.-X. Zangardi M.L. Chio C. Kim E.B. Li B.K.M. Long Y. Blouin G.C. Lage D. Pilot Randomized Trial of a Pharmacy Intervention for Older Adults with Cancer Oncologist 2019 24 211 218 10.1634/theoncologist.2018-0408 30341175 PMC6369952 47. Ganju P. Kalaiyarasi J.P. Karunakaran P. Veeraiah S. Mehra N. COVID-19 Vaccine Uptake in Patients with Multiple Myeloma and AL Amyloidosis: A Cross-Sectional Observational Study from India Indian J. Hematol. Blood Transfus. 2024 40 30 35 10.1007/s12288-023-01680-z 38312195 PMC10830937 48. Shapiro Ben David S. Shamai-Lubovitz O. Mourad V. Goren I. Cohen Iunger E. Alcalay T. Irony A. Greenfeld S. Adler L. Cahan A. A Nationwide Digital Multidisciplinary Intervention Aimed at Promoting Pneumococcal Vaccination in Immunocompromised Patients Vaccines 2023 11 1355 10.3390/vaccines11081355 37631923 PMC10458143 49. Ozdemir N. Aktas B.Y. Gulmez A. Inkaya A.C. Bayraktar-Ekincioglu A. Kilickap S. Unal S. Impact of Pharmacist-Led Educational Intervention on Pneumococcal Vaccination Rates in Cancer Patients: A Randomized Controlled Study Support. Care Cancer 2023 31 194 10.1007/s00520-023-07652-3 36856870 PMC9975445 50. World Health Organization Regional Office for the Eastern Mediterranean. Health Education: Theoretical Concepts, Effective Strategies and Core Competencies: A Foundation Document to Guide Capacity Development of Health Educators 2012 Available online: http://applications.emro.who.int/dsaf/EMRPUB_2012_EN_1362.pdf (accessed on 3 September 2025) 51. Cataldi J.R. Kerns M.E. O’Leary S.T. Evidence-Based Strategies to Increase Vaccination Uptake: A Review Curr. Opin. Pediatr. 2020 32 151 159 10.1097/MOP.0000000000000843 31790027 52. Du P. Jin S. Lu S. Wang L. Ma X. Wang J. Huang R. Luo Q. Yang S. Feng X. Strategies to Increase the Coverage of Influenza and Pneumonia Vaccination in Older Adults: A Systematic Review and Network Meta-Analysis Age Ageing 2024 53 afae035 10.1093/ageing/afae035 38476102 53. Bisset K.A. Paterson P. Strategies for Increasing Uptake of Vaccination in Pregnancy in High-Income Countries: A Systematic Review Vaccine 2018 36 2751 2759 10.1016/j.vaccine.2018.04.013 29661584 54. Morgan J.L. Baggari S.R. Chung W. Ritch J. McIntire D.D. Sheffield J.S. Association of a Best-Practice Alert and Prenatal Administration With Tetanus Toxoid, Reduced Diphtheria Toxoid, and Acellular Pertussis Vaccination Rates Obstet. Gynecol. 2015 126 333 337 10.1097/AOG.0000000000000975 26241423 55. Ruffin M.T. Plegue M.A. Rockwell P.G. Young A.P. Patel D.A. Yeazel M.W. Impact of an Electronic Health Record (EHR) Reminder on Human Papillomavirus (HPV) Vaccine Initiation and Timely Completion J. Am. Board Fam. Med. 2015 28 324 333 10.3122/jabfm.2015.03.140082 25957365 PMC4762366 56. Monier A. Puyade M. Hernanz M.P.G. Bouchaert P. Leleu X. Tourani J.M. Roblot F. Rammaert B. Observational Study of Vaccination in Cancer Patients: How Can. Vaccine Coverage Be Improved? Med. Mal. Infect. 2020 50 263 268 10.1016/j.medmal.2019.11.006 31848105 57. Ogliastro M. Ferrari A. Sticchi L. Domnich A. Zappa G. Di Biagio A. Massaro E. Giribaldi E. Orsi A. Effectiveness of a Counseling Intervention to Increase Vaccination Uptake among Men Who Have Sex with Men during the Mpox Outbreak Vaccines 2024 12 751 10.3390/vaccines12070751 39066389 PMC11281669 58. Oh N.L. Biddell C.B. Rhodes B.E. Brewer N.T. Provider Communication and HPV Vaccine Uptake: A Meta-Analysis and Systematic Review Prev. Med. 2021 148 106554 10.1016/j.ypmed.2021.106554 33857561 59. Al-Shaikh A. Mahmoud R.I. Boukerdenna H. Muthu N. Aidyralieva C. Bellizzi S. Counselling of Non-Communicable Diseases’ Patients for COVID-19 Vaccine Uptake in Jordan: Evaluating the Intervention Vaccine 2022 40 6658 6663 10.1016/j.vaccine.2022.09.083 36216648 PMC9527223 60. Lasagna A. Alessio N. Gambini G. Klersy C. Monaco T. Corallo S. Cicognini D. Pedrazzoli P. Vaccine Hesitancy in Patients with Solid Tumors: A Cross-Sectional Single-Center Survey BMC Public. Health 2024 24 2998 10.1186/s12889-024-20468-y 39472822 PMC11523769 61. Johnstone K. Cooper J. Smithson J. Glass B. Perspectives of Healthcare Professionals on the Pharmacist’s Role in Delivering Vaccinations for Patients with Cancer: A Qualitative Study Using Role Theory Int. J. Clin. Pharm. 2025 10.1007/s11096-025-01945-9 40522402 62. Le L.M. Veettil S.K. Donaldson D. Kategeaw W. Hutubessy R. Lambach P. Chaiyakunapruk N. The Impact of Pharmacist Involvement on Immunization Uptake and Other Outcomes: An Updated Systematic Review and Meta-Analysis J. Am. Pharm. Assoc. 2022 62 1499 1513.e16 10.1016/j.japh.2022.06.008 PMC9448680 35961937 63. Isenor J.E. Edwards N.T. Alia T.A. Slayter K.L. MacDougall D.M. McNeil S.A. Bowles S.K. Impact of Pharmacists as Immunizers on Vaccination Rates: A Systematic Review and Meta-Analysis Vaccine 2016 34 5708 5723 10.1016/j.vaccine.2016.08.085 27765379 64. Lo Moro G. Ferrara M. Langiano E. Accortanzo D. Cappelletti T. De Angelis A. Esposito M. Prinzivalli A. Sannella A. Sbaragli S. Countering Vaccine Hesitancy: A Systematic Review of Interventions to Strengthen Healthcare Professionals’ Action Eur. J. Public Health 2023 33 905 915 10.1093/eurpub/ckad134 37581903 PMC10567238 65. Rand C.M. Humiston S.G. Provider Focused Interventions to Improve Child and Adolescent Vaccination Rates Acad. Pediatr. 2021 21 S34 S39 10.1016/j.acap.2021.02.014 33958090 66. Aguolu O.G. Malik A.A. Ahmed N. Omer S.B. Overcoming Vaccine Hesitancy for Future COVID-19 and HIV Vaccines: Lessons from Measles and HPV Vaccines Curr. HIV/AIDS Rep. 2022 19 328 343 10.1007/s11904-022-00622-0 36114951 PMC9483354 67. McGuinness L.A. Higgins J.P.T. Risk-of-bias VISualization (robvis): An R package and Shiny web app for visualizing risk-of-bias assessments Res. Synth. Methods 2021 12 55 61 10.1002/jrsm.1411 32336025 Figure 1 PRISMA Flow diagram. vaccines-13-00964-t001_Table 1 Table 1 Main characteristics of the included studies. First Author Country Year of Study Target of the Intervention Type of Cancer Target VPD Multi-Component Toleman M.S. 2015 [ 38 UK 2012−2014 Quasi-Experimental, HCP Any Flu, Pneum. Yes Grivas P.D. 2016 [ 45 USA 2011−2013 Natural Experimental, HCP + Any Flu Yes Delacruz W. 2017 [ 44 USA 2015−2016 Quasi-Experimental, HCP Any Pneum. Yes Church E.C. 2018 [ 43 USA 2015 Quasi-Experimental, HCP + Chronic Lymphocytic Leukemia Pneum. Yes Nipp R.D. 2018 [ 46 USA 2017 RCT Patients Breast, gastrointestinal, or lung cancer. Flu, Pneum. No Sitte J. 2018 [ 37 France 2016−2017 Quasi-Experimental, Patients Gastrointestinal Flu, Pneum. (Diphtheria-Tetanus-Poliomyelitis, Hepatitis b, HPV) No Kelkar A.H. 2021 [ 41 USA 2020−2021 Quasi-Experimental, HCP + Any COVID-19 No McGinnis J.M. 2021 [ 42 Canada 2019−2020 Quasi-Experimental, HCP + Gynecologic Flu, Pneum. Yes Tran V. 2021 [ 40 France 2021 Quasi-Experimental, Patients Any COVID-19 No Kiderlen T.R. 2022 [ 34 Germany 2020−2021 Quasi-Experimental, HCP Any Flu, Pneum., Herpes Zoster and Hepatitis B No Narinx J. 2022 [ 39 Belgium 2021 Quasi-Experimental, Patients Hematologic COVID-19 Yes Ganju P. 2023 [ 47 India 2021−2022 Quasi-Experimental, Patients Multiple myeloma COVID-19 No Ozdemir N. 2023 [ 49 Turkey 2019−2021 RCT Patients Any Pneum. Yes Rivière P. 2023 [ 36 France 2019−2020 Quasi-Experimental, HCP Any Flu, Pneum. Yes Shapiro Ben David S. 2023 [ 48 Israel 2019−2021 Quasi-Experimental, HCP + Any Pneum. Yes Abbreviations: HCP healthcare professional, Pneum. Pneumococcal disease, VPD vaccine preventable disease. vaccines-13-00964-t002_Table 2 Table 2 Components of the included interventions. First Author Patient Patient Patient Counselling HCP HCP Other Toleman M.S. 2015 [ 38     X Development of vaccination guidelines * Grivas P.D. 2016 [ 45 X X *   X *  Delacruz W. 2017 [ 44    X *  Recruitment of APRN to review vaccination status and prescribe vaccine if not done by oncologist Church E.C. 2018 [ 43  X *   X * Pact between virtual clinic and primary care providers Nipp R.D. 2018 [ 46   X *    Sitte J. 2018 [ 37   X *    Kelkar A.H. 2021 [ 41 X *   X *   McGinnis J.M. 2021 [ 42 X *   X *  In-house vaccination program; pre-printed prescriptions for prescribing physicians Tran V. 2021 [ 40 X *      Kiderlen T.R. 2022 [ 34     X *  Narinx J. 2022 [ 39  X * X    Ganju P. 2023 [ 47   X *    Ozdemir N. 2023 [ 49 X  X *    Rivière P. 2023 [ 36    X *  Development of a vaccination protocol Shapiro Ben David S. 2023 [ 48  X   X * Preapproval for PCV13 is waived Components marked with an asterisk (*) indicate the main component of the intervention. Abbreviations: APRN Advanced Practice Nurse Practitioner, HCP healthcare professional. vaccines-13-00964-t003_Table 3 Table 3 Main outcomes and results of the included interventions. First Author Primary Outcomes Main Results Toleman M.S. 2015 [ 38 (1) Vaccination coverage: Flu (1) Flu: from 68.1% to 71.6% ( p p Grivas P.D. 2016 [ 45 Same day vaccination rate (Flu) (2 seasons) Absolute increase in eligible adults vaccinated: 2.4% ( p p Delacruz W. 2017 [ 44 Vaccination coverage (Pneum.) From 6.3% to 45.5% ( p Church E.C. 2018 [ 43 Vaccination coverage (Pneum.) Within 180 days, 62% received the vaccine. Significant difference in time to vaccination between pre and post-virtual clinic periods (log-rank test, p Nipp R.D. 2018 [ 46 (1) Vaccination coverage: Flu (1) Flu: intervention vs. control: 31.0% vs. 0.0% ( p p Sitte J. 2018 [ 37 Vaccination coverage (Pneum.) From 10.1% to 87.5% (<0.001) Kelkar A.H. 2021 [ 41 (1) COVID-19 Vaccine intention (1) From 71% to 82.5% (no p p McGinnis J.M. 2021 [ 42 (1) Vaccination coverage: Flu (1) Flu: from 36% to a monthly mean of 67% (no p p Tran V. 2021 [ 40 COVID-19 Vaccine intention Among the cancer patients who did not intend to be vaccinated at baseline, 18.0% changed their mind ( p Kiderlen T.R. 2022 [ 34 Vaccination coverage (Pneum.) Intervention vs. control: VC increase +21.5pp vs. −5.8pp p Narinx J. 2022 [ 39 Vaccination coverage (COVID-19) Vaccination rates: 88.9% among patients of the intervention group; 76.3% in the general population (control) (Standardized Incidence ratio: 1.17; 95%CI 1.12−1.22, p Ganju P. 2023 [ 47 Vaccination coverage (COVID-19) At least one dose: 86% (2 doses: 67%) (no comparisons, no p Ozdemir N. 2023 [ 49 (1) Pneum. vaccination knowledge (higher score = higher number of correct answers) (1) Intervention vs. control: median 10 (IQR = 3) vs. 8 (IQR = 4) ( p p p Rivière P. 2023 [ 36 (1) Vaccination coverage: Flu (1) Flu VC: from 42.6% to 55.1% ( p p Shapiro Ben David S. 2023 [ 48 Vaccination coverage (Pneum.) PCV13: from 11.9% to 52% ( p p Abbreviations: CI Confidence Interval, IQR Interquartile Range, OR Odds Ratio, Pneum. Pneumococcal disease, SD Standard Deviation, VC Vaccination Coverage. ",
  "metadata": {
    "Title of this paper": "Risk-of-bias VISualization (robvis): An R package and Shiny web app for visualizing risk-of-bias assessments",
    "Journal it was published in:": "Vaccines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474426/"
  }
}