{
  "title": "Paper_25",
  "abstract": "pmc Future Oncol Future Oncol 3069 futoncol Future Oncology 1479-6694 1744-8301 Taylor & Francis PMC12490404 PMC12490404.1 12490404 12490404 40878623 10.1080/14796694.2025.2550924 2550924 1 Version of Record Research Article Research Article Long-term safety and effectiveness of ruxolitinib in patients with myelofibrosis in Japan: an observational study Y. ARUGA ET AL. FUTURE ONCOLOGY https://orcid.org/0009-0002-2697-4404 Aruga Yusuke Hongo Wataru Lu Weizhe Development Devision, Novartis Pharma K.K Tokyo Japan CONTACT Yusuke Aruga yusuke.aruga@novartis.com Toranomon Hills Mori Tower, 1-23-1, Tranomon, Minato-ku Tokyo 105-6333 Japan 29 8 2025 2025 21 23 498190 3017 3026 29 08 2025 03 10 2025 03 10 2025 Integra 16 9 2025 Integra 16 9 2025 04 3 2025 19 8 2025 © 2025 Novartis Pharmaceuticals. Published by Informa UK Limited, trading as Taylor & Francis Group. 2025 Novartis Pharmaceuticals https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivatives License ( http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Aim To evaluate the safety and effectiveness of ruxolitinib in patients with myelofibrosis (MF) in Japan. Methods A multicenter, observational study of patients who received ruxolitinib for MF from July 2014. Results Of 892 patients (mean age: 70 years, 45.9% primary MF, ruxolitinib treatment median duration, 541.0 days), 67.7% had adverse drug reactions (ADRs) and 31.5% had serious ADRs. The most frequent ADRs were anemia and decreased platelet count. Incidences of ADRs by time of onset were 57.7%, 20.3%, 14.4%, 11.1%, 11.3%, 9.0%, and 1.8% from the treatment initiation to Day 182, and every 6 months thereafter until Day 1,093 or later, respectively. ADRs of special interest included myelosuppression (46.8%), infections (17.6%), hepatic impairment (13.5%), hemorrhagic events (10.2%), cardiac failure (2.5%), interstitial lung disease (1.5%), malignancy (1.4%) and tuberculosis (0.5%). Incidences of common ADRs were similar between patients with hepatic or renal impairment and patients without hepatic or renal impairment. At 6 months, spleen responses and symptom improvement were observed in 26.2% and 52.0% of patients, respectively. Median overall survival was not reached. Conclusion In a real-world setting in Japan, ruxolitinib demonstrated a reasonable degree of effectiveness with no new safety concerns. Results were similar to those from clinical trials. Plain Language Summary Myelofibrosis (MF) is a rare type of blood cancer that interferes with the process of blood cell production by the bone marrow. In patients with MF, the bone marrow becomes overactive, leading to scarring, and subsequently, there is a lack of healthy blood cells being produced. The main symptoms of MF include anemia, fatigue, weakness and pain or discomfort in the abdomen.Ruxolitinib became available in Japan as a MF treatment in 2014. In this study, we explored the safety and effectiveness of ruxolitinib in real-world settings in Japan. We assessed 892 patients who had MF and received ruxolitinib. Most patients (72.9%) were aged 65 years or older. Side effects (adverse drug reactions, ADRs) were reported in 67.7% of patients, and 31.5% had serious ADRs. The most common ADRs were anemia (27.8%) and low blood platelet counts (21.4%). Most of the ADRs were seen in the first 6 months of starting ruxolitinib and then became less frequent over time. Patients with liver or kidney problems had a similar number of ADRs as that in patients without these problems. After 6 months of ruxolitinib treatment, 26.2% of patients had a spleen response and 52.0% of patients had less symptoms. We could not calculate the median overall survival because the observation period ended before it was achieved. In a Japanese real-world clinical setting, our results did not show any new safety concerns and were similar to those reported in clinical trials. KEYWORDS Ruxolitinib myelofibrosis real-world JAK inhibition post-marketing surveillance Novartis Pharmaceuticals This study was sponsored and funded by Novartis Pharmaceuticals. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Myelofibrosis (MF) is a chronic, progressive, disorder of the bone marrow that can occur on its own (primary) or develop from myelofibrotic progression of essential thrombocythemia or polycythemia vera (secondary) [ 1 2 1 2 Patients with MF are typically aged over 65 years and present with unexplained abnormalities in blood counts, often experiencing a substantial burden of symptoms [ 3 3 4 5 Allogeneic hematopoietic stem-cell transplant (HSCT) is the only curative treatment currently available for MF. However, it is associated with substantial morbidity and mortality, and thus it is considered an option only for patients with MF who lack significant comorbidities, possess high-risk molecular features, and have an available donor [ 6 7 8 9–11 12 13 Ruxolitinib was approved for the treatment of MF in Japan in 2014 [ 14 9 10 15 2. Patients and methods 2.1. Study design This multicenter, non-interventional study was conducted in a real-world setting among patients with MF in Japan. The study was mandated by the Pharmaceuticals and Medical Devices Agency and was conducted in accordance with the Good Post-Marketing Study Practice for Drugs (GPSP) as ordained by the Ministry of Health, Labour and Welfare [ 16 This study included all patients who received ruxolitinib for the treatment of MF on or after 4 July 2014. The observational period lasted for 1 year after the first dose of ruxolitinib and extended up to 3 years if the patient continued ruxolitinib for more than one year. Patients who had previously received ruxolitinib or received ruxolitinib for the treatment of polycythemia vera (PV) were excluded. As a non-interventional study, there were no specifications concerning the treatment plan, diagnostic or treatment procedures, or visit schedule. The frequency of visits and assessments followed the typical routine medical care. For each patient, investigators completed case report forms (CRFs) documenting patient demographics, disease characteristics, ruxolitinib administration, concomitant medication, non-drug therapies for MF, spleen length, physician’s global assessment of improvement, laboratory tests, and adverse events (AEs). 2.2. Safety assessments AEs were identified through physical examinations, patient reports, laboratory values, and other tests conducted during the study period. All AEs were coded in accordance with the Japanese version of the Medical Dictionary for Regulatory Activities (MedDRA/J) version 25.1 and classified and graded according to the Common Terminology Criteria for Adverse Events (CTCAE) version 4.0. AEs were documented on the CRF, in addition to the onset of the AE, AE term, CTCAE grade, causal relationship to ruxolitinib, duration of AE, outcome, and whether the AE was considered a serious AE (SAE). Any events that were not initially deemed serious but were later considered serious based on further details – as well as any events resulting in death – were classified as SAEs. AEs that could not be ruled out as being unrelated to ruxolitinib based on the descriptions in the CRF were regarded as adverse drug reactions (ADRs). ADRs of special interest in this study included myelosuppression, infections, tuberculosis, hepatic impairment, hemorrhagic events, cardiac failure, interstitial lung disease, malignancy (secondary carcinoma), and ADRs in patients with hepatic impairment or renal impairment. 2.3. Effectiveness assessments For spleen size, length of the greatest spleen protrusion from the costal margin by palpation was measured before the start of ruxolitinib treatment and after 6 months and 1 year of treatment, or at treatment discontinuation. For patients receiving ruxolitinib for more than 1 year, spleen size was measured at 2 and 3 years, or upon treatment discontinuation. When the spleen was not palpable, the length was recorded as 0 cm. Physicians evaluated patients for symptom relief through Physician Global Assessments (PGA). These assessments were scheduled at 6 months and 1 year, or upon treatment discontinuation. For patients who continued ruxolitinib beyond 1 year, subsequent PGAs were scheduled at Years 2 and 3, or upon treatment discontinuation. Overall survival was assessed at 6-, 12-, 24-, and 36-months from the start of ruxolitinib treatment. 2.4. Statistical analyses The target number for the enrollment of patients with the 1 year follow-up period was 180. Descriptive statistics were generated for all continuous, categorical, and binary study variables; the data were presented as means, standard deviations (SD), medians and minimum and maximum values for continuous variables and as frequencies and percentages for categorical variables. The safety analysis set included all patients whose data were considered valid for analysis and excluded those patients for whom the CRF lacked a physician signature, where ruxolitinib administration was outside the contract period, patients were not enrolled or had unconfirmed enrollment, duplicate patients, off label use, patients who were not treated with ruxolitinib, and patients with prior ruxolitinib treatment. The safety analysis period spanned from the start date of ruxolitinib treatment until the end date of the observation period (or the date of ruxolitinib discontinuation) plus 28 days. Events that occurred outside the safety analysis period were excluded from the analysis. AE analyses included the proportion of patients with AEs and SAEs by MedDRA system organ class (SOC) and preferred term (PT), the proportion of patients with AEs leading to ruxolitinib discontinuation, and AEs leading to death. The occurrence of multiple AEs with the same MedDRA PT or within the same SOC for a single patient was regarded as one patient or event. ADRs were analyzed as per AEs. Additionally, the proportion of patients with ADRs in specific categories of patient characteristics was analyzed. Odds ratios of the ADRs were calculated for patient characteristics based on the following categories: sex (male or female), age ( <15 years, ≥15 to < 65 years, and ≥65 years), duration of disease (< 1 year, ≥1 year to < 3 years, ≥3 years to < 5 years, ≥5 years to < 10 years, and ≥10 years), presence of JAK mutations, platelet count at the start of treatment ( < 100,000/mm 3 3 3 3 3 3 The effectiveness analysis set included patients who met the inclusion criteria for the safety analysis set and excluded those for whom effectiveness was indeterminable. The proportion of patients, along with 95% CI, was calculated for each spleen shrinkage category (complete disappearance, ≥50%, ≥30 to < 50%, < 30%, unchanged, and increased), PGA improvement category (remarkable improvement, improvement, no change, exacerbation, could not be determined, or unknown/not specified), spleen responders (patients with complete disappearance or a ≥ 50% reduction from baseline in spleen size) and PGA responders (patients assessed as having remarkable improvement or improvement). Odds ratios of the PGA response rates were calculated by patient characteristics. Adjusted odds ratios were then calculated using a multivariate logistic regression model with patient factors whose 95% CI of the unadjusted odds ratio did not include 1. Kaplan – Meier curves for overall survival were plotted and 6-, 12-, 24-, and 36-month probabilities of survival with 95% CI were calculated using Greenwood’s formula. Additionally, Kaplan-Meier curves for overall survival were analyzed by patient characteristics. All statistical analyses were conducted using SAS version 9.4. There was no imputation for missing data. 3. Results 3.1. Patient disposition A total of 2914 patients with MF were enrolled. After excluding patients who were enrollment only or ineligible for this analysis, 892 and 891 were included in the safety and effectiveness analysis sets, respectively ( Figure 1 Figure 1. Patient disposition. 3.2. Patient characteristics For the 892 patients included in the safety analysis population, the median age at baseline was 70.0 years, with 72.9% (650/892) of patients being 65 years or older ( Table 1 Table 1. Patient demographic and clinical characteristics.  N = 892 Male, n (%) 491 (55.0) Age, years  Median a 70.0 (3–92) < 15 years 1 (0.1) ≥15 and <65 years 236 (26.5) ≥65 years 650 (72.9) Duration of disease, years  Mean (SD) 4.5 (6.2) <1 year 355 (39.8) ≥1 year and <3 years 130 (14.6) ≥3 years and <5 years 74 (8.3) ≥5 years and <10 years 101 (11.3) ≥10 years 139 (15.6) Unknown 93 (10.4) Reason for ruxolitinib treatment, n (%)  Primary MF 409 (45.9) MF progressing from PV 197 (22.1) MF progressing from ET 251 (28.1) Other MF 33 (3.7) Unknown 2 (0.2) JAK mutations, n (%) b 462 (51.8) Prognostic factors  Age ≥65 years 650 (72.9) Persisting pyrexia, night sweats, and 213 (23.9) Hb <10 g/dL 593 (66.5) WBC > 25,000/mm 3 236 (26.5) Peripheral bone marrow blasts ≥ 1% 441 (49.4) Platelet count at the start of treatment  ≥100,000/mm 3 624 (70.0) <100,000/mm 3 225 (25.2) Unknown 43 (4.8) ECOG Performance Status  0 319 (35.8) 1 366 (41.0) 2 129 (14.5) 3 66 (7.4) 4 12 (1.4) Medical history, n (%) 315 (35.3) Hepatic impairment 11 (1.2) Renal impairment 4 (0.5) TB 7 (0.8) Infections 92 (10.3) Complications, n (%) 590 (66.1) Hepatic impairment 71 (8.0) Renal impairment 71 (8.0) TB 2 (0.2) Infections 59 (6.6) Received prior medication, n (%) 546 (61.2) Primary disease treatment 514 (57.6) Suspected to be the cause of AEs 37 (4.2) Opportunistic infection prophylaxis 37 (4.2) Hematopoietic growth factors 8 (0.9) CYP3A4 inhibitors 22 (2.5) Safety analysis set. a b Abbreviations: AE, adverse event; CYP, cytochrome P450; ECOG, Eastern Cooperative Oncology Group; ET, essential thrombocythemia; Hb, hemoglobin; JAK, Janus kinase; MF, myelofibrosis; PV, polycythemia vera; SD, standard deviation; TB, tuberculosis; WBC, white blood cell. 3.3. Ruxolitinib treatment The mean (SD) daily dose of ruxolitinib was 17.8 (10.6) mg. The distribution of patients based on the initial daily dose of ruxolitinib was as follows: < 10 mg (126/892, 14.1%), ≥10 mg and < 20 mg (413/892, 46.3%), ≥20 mg and < 30 mg (175/892, 19.6%), ≥30 mg and < 40 mg (92/892, 10.3%), ≥40 mg and ≤50 mg (85/892, 9.5%), and > 50 mg (1/892, 0.1%). Apart from one patient who received a dose above 50 mg, ruxolitinib was administered within the approved dosage and administration ranges. Mean (SD) duration of ruxolitinib treatment was 587.0 (437.3) days and most (395/892, 44.3%) patients received ruxolitinib for a duration of 729–1092 days (Table S1). Of the 892 patients included in the safety analysis set, 64.0% (n = 571) discontinued the study (Table S2). The most frequent reasons for treatment discontinuation were AEs (237/892, 26.6%), exacerbation of primary disease (139/892, 15.6%) and hospital transfer (93/892, 10.4%). The discontinuation rate by the timing of treatment was lowest from the start of treatment to Day 14 (31/892, 3.5%) and ranged between 11.4% and 25.6% from Day 15 to the end of the study. 3.4. Safety outcomes The incidences of AEs and SAEs were 84.8% (756/892) and 53.3% (475/892), respectively. The most common AEs and SAEs included anemia, decreased platelet count, MF, primary MF, and pneumonia ( Table 2 Table 2. Incidence of AEs and ADRs. n (%) AEs SAEs ADR Serious ADR Patients with events 756 (84.8) 475 (53.3) 604 (67.7) 281 (31.5) Most frequent events a     Anemia 297 (33.3) 104 (11.7) 248 (27.8) 80 (9.0) Platelet count decreased 231 (25.9) 67 (7.5) 191 (21.4) 48 (5.4) MF 125 (14.0) 70 (7.9) 22 (2.5) 9 (1.0) Primary MF 104 (11.7) 66 (7.4) 12 (1.4) 7 (0.8) Pneumonia 73 (8.2) 62 (7.0) 37 (4.2) 33 (3.7) Safety analysis set (N = 892). a Abbreviations: ADR, adverse drug reaction; AE, adverse event; MF, myelofibrosis; SAE, serious adverse event. ADRs occurred in 67.7% (604/892) of patients and serious ADRs occurred in 31.5% (281/892) of patients ( Table 2 Owing to AEs, 32.1% (286/892) of patients discontinued ruxolitinib, while 16.0% (143/892) discontinued due to ADRs. Major AEs leading to treatment discontinuation (≥2%) were MF (43/892, 4.8%), primary MF (42/892, 4.7%), anemia (30/892, 3.4%), and decreased platelet count (29/892, 3.3%) and major ADR leading to treatment discontinuation were anemia (26/892, 2.9%) and platelet count decreased (23/892, 2.6%). AEs with a fatal outcome were reported in 25.9% (231/892) of patients; the most frequently reported AEs leading to death were primary MF (52/892, 5.8%), MF (50/892, 5.6%), pneumonia (20/892, 2.2%), sepsis (10/892, 1.1%) and leukemia (9/892, 1.0%). ADRs leading to death occurred in 7.0% (62/892) of patients; the most common ADRs were pneumonia (8/892, 0.9%) and MF (8/892, 0.9%). The ADRs of special interest (and the proportions of patients), were myelosuppression (417/892, 46.8%), infections (157/892, 17.6%), hepatic impairment (120/892, 13.5%), hemorrhagic events (91/892, 10.2%), cardiac failure (22/892, 2.5%) interstitial lung disease (13/892, 1.5%), malignancy (secondary carcinoma; 12/892, 1.4%) and tuberculosis (4/892, 0.5%; Table S4). The most frequently reported secondary malignancies were lung neoplasm malignant (2/892, 0.2%) and squamous cell carcinoma of skin (2/892, 0.2%); all other secondary malignancies (including basal cell carcinoma, carcinoid tumor of the gastrointestinal tract, gastric cancer lung adenocarcinoma, second primary malignancy, uterine cancer, neuroendocrine tumor, lung neoplasm malignant, prostate cancer and gingival cancer were reported in 0.1% [1/892] of patients each). The ADRs of special interest among the 71 patients with hepatic impairment, 76.1% (n = 54) had an ADR, and of the 71 patients with renal impairment, 83.1% (n = 59) had an ADR (Table S5). The type and incidence of ADRs were similar in patients with and without hepatic impairment, with the most frequently reported ADRs being anemia (31.0% [22/71] and 27.5% [226/821], respectively) and platelet count decreased (18.3% [13/71] and 21.7% [178/821], respectively; Table S5). Similarly, the most frequently observed ADRs in patients with and without renal impairment were anemia (32.4% [23/71] and 27.4% [225/821], respectively) and platelet count decreased (19.7% [14/71] and 21.6% [177/821], respectively; Table S5). In an analysis of the incidence of ADRs by patient factors, the 95% CI of the unadjusted odds ratio for age, platelet count at the start of treatment, and the presence or absence of renal impairment did not include 1 (Table S6). Likewise, the 95% CI of the adjusted odds ratio for these factors from a multivariate logistic regression analysis did not include 1. The incidence of ADRs by age was 60.6% (143/236) and 70.3% (457/650) in patients aged ≥ 15 to < 65 years and ≥65 years, respectively; the unadjusted odds ratio (95% CI) was 1.54 (1.13–2.10) and the adjusted odds ratio (95% CI) was 1.53 (1.11–2.12). Patients with a platelet count of < 100,000/mm 3 3 3 3 3.5. Effectiveness Among the 891 patients in the effectiveness analysis set, spleen size measurements were available for 319 patients at baseline and after the start of treatment. The mean (SD) spleen size at the start of treatment was 12.0 (7.4) cm, and 8.2 (7.0) cm at 6 months, 7.7 (6.5) cm at 12 months, 6.9 (5.9) cm at 24 months, 7.2 (5.4) cm at 36 months, and 9.5 (8.6) cm at the final evaluation. Among the 286 patients with a spleen measurement of > 0 cm at baseline, the mean (SD) of percent change from baseline was − 32.0% (36.2), −34.9% (41.5), −37.4% (46.7), −31.6% (44.7), and − 18.8% (63.4) at 6, 12, 18, 24, and 36 months, and at the final evaluation respectively. Among the 319 patients (including those for whom the spleen was not palpable and was calculated to be 0 cm), the proportion of patients with a spleen response (defined as complete disappearance or a ≥ 50% reduction in spleen size from baseline) was 26.2% (54/206), 33.1% (43/130), 38.1% (32/84), 30.6% (15/49), and 22.6% (72/319) at 6, 12, 24, and 36 months, and at the final evaluation, respectively ( Table 3 Table 3 Table 3. Proportion of patients with spleen shrinkage.  Complete disappearance ≥50% 30% to 50% < 30% Unchanged Increased Responders Response rate (95% CI) After 6 months 17 (8.3) 37 (18.0) 32 (15.5) 56 (27.2) 50 (24.3) 14 (6.8) 54/206 26.2 After 12 months 14 (10.8) 29 (22.3) 23 (17.7) 27 (20.8) 22 (16.9) 15 (11.5) 43/130 33.1 After 24 months 13 (15.5) 19 (22.6) 11 (13.1) 15 (17.9) 14 (16.7) 12 (14.3) 32/84 38.1 After 36 months 5 (10.2) 10 (20.4) 8 (16.3) 8 (16.3) 5 (10.2) 13 (26.5) 15/49 30.6 At the final evaluation 28 (8.8) 44 (13.8) 48 (15.1) 83 (26.0) 58 (18.2) 58 (18.2) 72/319 22.6 Efficacy analysis set (N = 891). Patients with a complete disappearance or ≥ 50% were classed as responders. Abbreviations: CI, confidence interval; n, number of patients in the specified category; N, total number of patients assessed. Among the 891 patients in the effectiveness analysis set, the response rate of PGA improvement in symptoms (defined as remarkable improvement or improvement) was 52.0% (463/891), 48.8% (297/609), 39.0% (201/516), 35.4% (139/393) and 30.3% (270/891) at 6, 12, 24, and 36 months, and at the final evaluation, respectively ( Table 4 Table 4. PGA of improvement in symptoms.  Remarkable improvement Improvement n (%) No change Exacerbation n (%) Could not be determined Unknown/ Responders Response rate (95% CI) After 6 months 70 (7.9) 393 (44.1) 229 (25.7) 33 (3.7) 166 (18.6) 0 463/891 52.0 After 12 months 40 (6.6) 257 (42.2) 213 (35.0) 30 (4.9) 67 (11.0) 2 (0.3) 297/609 48.8 After 24 months 26 (5.0) 175 (33.9) 223 (43.2) 43 (8.3) 48 (9.3) 1 (0.2) 201/516 39.0 After 36 months 24 (6.1) 115 (29.3) 178 (45.3) 41 (10.4) 34 (8.7) 1 (0.3) 139/393 35.4 At the final evaluation 40 (4.5) 230 (25.8) 352 (39.5) 101 (11.3) 164 (18.4) 4 (0.5) 270/891 30.3 Effectiveness analysis set. Patients with remarkable improvement or improvement were categorized as responders. Abbreviations: CI, confidence interval; n, number of patients in the specified category; N, total number of patients assessed; PGA, physician global assessment. Odds ratios and 95% CIs were calculated for patient characteristics using the same categories as those used for the ADR analysis. The 95% CI of the unadjusted odds ratio did not include 1 for four factors: the duration of disease (≥1 to < 3 years and ≥ 5 to < 10 years), platelet count at treatment initiation, the presence or absence of concomitant medication for the treatment of primary disease, and prophylaxis of opportunistic infections (Table S7). The adjusted odds ratio and 95% CI for these characteristics were calculated using a multivariate logistic regression model. The 95% CI of the duration of disease and the presence or absence of concomitant medication for the treatment of primary disease did not include 1. No consistent trend was observed between the duration of disease and response rate, which was lower in patients who had MF for (≥1 to < 3 years (20.2% [26/129]; unadjusted odds ratio [95% CI]: 0.59 [0.36–0.95]) and higher in those who had MF for ≥ 5 to < 10 years (43.6% [44/101]; unadjusted odds ratio [95% CI]: 1.79 [1.14–2.82]), as compared with those who had MF for less than 1 year (30.1% [107/355]). Adjusted odds ratios (95% CI) were 0.58 (0.35–0.96) in the ≥ 1 to < 3 years group and 1.87 (1.17–2.99) in the ≥ 5 to < 10 years group. A decrease in the response rate for patients receiving concomitant medications for the primary disease was observed compared with that in those who were not receiving medications (27.3% [138/506] vs 34.3% [132/385]; unadjusted odds ratio [95% CI]: 0.72 [0.54–0.96]). The adjusted odds ratio (95% CI) was 0.65 (0.47–0.90). No concerns necessitating special precautions were identified. Median overall survival was not reached at the end of the observation period. The estimated rates of overall survival were 92.2%, 87.1%, 78.4%, and 71.8% at 182 days, 364 days, 728 days, and 1092 days after the start of ruxolitinib treatment, respectively ( Figure 2 Figure 2 3 3 Figure 2. Kaplan – Meier curve for overall survival. (A) Overall survival for all patients. (B) Overall survival by IPSS risk category. (C) Overall survival by platelet level. (D). Overall survival by hemoglobin level. Abbreviations: Efficacy analysis set. CI, confidence interval; IPSS, International Prognostic Scoring System. 4. Discussion This PMS of ruxolitinib treatment in patients with MF in Japan, which included all patients treated with ruxolitinib since its approval in 2014, provides real-world evidence for the safety and effectiveness of this drug in Japan. In this analysis, ruxolitinib showed improvements in spleen size and symptom burden, and it was generally well-tolerated by Japanese patients. Ruxolitinib dosage for the treatment of MF ranges from 10 to 50 mg daily, although the dose can be adjusted according to the patient’s condition [ 8 Approval of ruxolitinib for the treatment of MF in Japan was mainly based on data from two Phase 3 clinical trials, namely COMFORT-I [ 9 10 15 9 10 15 15 10 15 9 10 While direct comparisons between the aforementioned studies and the PMS reported here cannot be made, the incidence of ADRs in this study (67.7%) was lower than that of 91.7% in Study A2202 and that of 81.1% in the pooled analysis of COMFORT-I and COMFORT-II (data on file). Similar to Study A2202, the incidence of ADRs in this PMS did not tend to increase in association with prolongation of the treatment duration [ 15 No new or unexpected AEs with ruxolitinib treatment were observed in this PMS, and the findings were consistent with toxicities observed in the aforementioned studies. As a JAK1/2 inhibitor, ruxolitinib is known to inhibit JAK2, which regulates thrombopoietin and erythropoietin signaling [ 17 18 9 10 15 Non-melanoma skin cancers (NMSCs), including basal cell, squamous cell, and Merkel cell carcinoma, have been reported in patients treated with ruxolitinib, however a causal relationship has not been established [ 8 19 20 8 The effectiveness of ruxolitinib in this PMS was evaluated by reduction in spleen size, the improvement of the PGA, and overall survival. Spleen response was achieved in 26.2% of patients at 6 months, and the mean reduction from baseline in palpable spleen size was 32%, indicating the effectiveness of ruxolitinib. This is consistent with the proportion of patients (30%) who experienced a ≥ 50% reduction in palpable spleen size at 24 weeks in a Japanese ruxolitinib early-access program, with a mean percentage decrease of 40.1% [ 21 22 In addition to improving splenomegaly, ruxolitinib significantly reduces symptom burden. However, making direct comparisons concerning symptoms is challenging owing to the use of various methods for evaluating symptom responses. In Study A2202, 49% of the total study population [ 15 22 9 In the analysis of PGA response rate by patient factors, the adjusted odds ratios of two factors (disease duration and the presence or absence of concomitant medication for the primary disease) did not include 1, and no consistent trend was observed with the duration of disease. Patients on concomitant medication for the primary disease had a lower response, suggesting that these patients might have a more severe disease profile, which makes the treatment more challenging. A pooled analysis of data from the COMFORT-I and COMFORT-II studies showed that ruxolitinib is associated with prolonged survival. At Week 144 (Day 1008), the Kaplan – Meier estimated overall survival rate was 78% in the ruxolitinib arm, 61% in the intent-to-treat control arm, and 31% in the crossover-adjusted control arm [ 23 5 3 24 11 25 26 27 28 4.1. Limitations The limitations of this study include its observational design, which lacks a control group, which makes it difficult to definitively associate the effects observed with the drug treatment. Another significant limitation lies in the different methods used to measure spleen shrinkage between this PMS and clinical trials. Unlike clinical trials that typically employ advanced imaging techniques such as magnetic resonance imaging or computed tomography to gauge spleen volume, this PMS used palpation – a much simpler method – for measuring spleen length. Therefore, caution is advised when making direct comparisons between these results and those obtained from clinical trials. Moreover, because the study was conducted under GPSP ordinance in Japan, source data verification was not carried out, as it is not a mandatory requirement under these regulations. The study does not provide detailed data on the transfusion status of patients before and after ruxolitinib treatment in the real-world setting in Japan. This represents a notable limitation of the study, particularly given the clinical significance of achieving transfusion independence after initiating ruxolitinib, which is often considered an indicator of successful therapy. 5. Conclusions This post-marketing surveillance was conducted in more than 800 patients with MF in Japan, and the study demonstrated a certain degree of treatment effectiveness associated with ruxolitinib, with no new safety concerns. The data from this report align with those observed in reported clinical trials. This long-term assessment presents the ruxolitinib treatment data in patients with diverse baseline characteristics in a real-world clinical setting, and it would guide the hematologists in Japan in therapeutic decision-making for the benefit of the patients. Supplementary Material Supplemental Material Article highlights  Ruxolitinib was the first JAK 1/2 inhibitor approved for the treatment of myelofibrosis (MF). In July 2014, the Japanese Ministry of Health, Labour and Welfare approved ruxolitinib for the treatment of MF. A condition of the approval was the implementation of an all-case surveillance on all patients treated with ruxolitinib until sufficient post-marketing data could be gathered. The post-marketing surveillance entailed a specified drug use results survey conducted on all ruxolitinib-treated patients starting from July 2014, with an observation period lasting for up to 3 years from the beginning of the treatment. A total of 892 patients were evaluated for safety and 891 for effectiveness. The most common adverse drug reactions were anemia and decreased platelet count. There were no new or unexpected safety signals in this study. Six months after treatment, this study showed that ruxolitinib reduced MFrelated splenomegaly in 26.2% of patients. Symptom improvement was observed in 52.0% of patients. These data demonstrated the effectiveness and safety of ruxolitinib therapy in realworld settings in Japan. Author contributions Yusuke Aruga, Wataru Hongo, and Weizhe Lu provided substantial contribution to the study design and/or collection, analysis, and/or interpretation of data; were involved in the drafting and/or critical review of the manuscript; provided final approval of the version to be published; and agree to be accountable for all aspects of the work in ensuring that questions related to the accuracy or integrity of any part of the work are appropriately investigated and resolved. Disclosure statement All authors are employees of Novartis Pharma K.K. The authors have no other relevant affiliations or financial involvement with any organization or entity with a financial interest in or financial conflict with the subject matter or materials discussed in the manuscript apart from those disclosed. Medical writing support was provided by Helen Findlow of Novartis Pharmaceuticals UK Ltd, London, UK, and funded by Novartis Pharmaceuticals. Reviewer disclosure Peer reviewers on this manuscript have no relevant financial or other relationships to disclose. Ethical declaration This was a prospective analysis of data from the post-marketing surveillance study of ruxolitinib in Japan. Since all treatments were at the physician’s discretion in actual clinical practice and the analysis was conducted anonymously, no patient consent was required for the present study under the regulations of Good Post-Marketing Study Practice. The study was conducted according to the regulations of Good Post-Marketing Study Practice. Data availability statement Novartis is committed to sharing access to anonymized patient-level data and clinical study reports from eligible studies with qualified external researchers. All data provided are anonymized to respect the privacy of patients who have participated in the trial in line with applicable laws and regulations. Supplementary material Supplemental data for this article can be accessed online at https://doi.org/10.1080/14796694.2025.2550924 References  Papers of special note have been highlighted as either of interest (•) or of considerable interest (••) to readers. 1. Passamonti F Mora B. Myelofibrosis Blood 2023 141 16 1954 1970 10.1182/blood.2022017423 36416738 PMC10646775 2. Tefferi A Myelofibrosis with myeloid metaplasia N Engl J Med 2000 342 17 1255 1265 10.1056/nejm200004273421706 10781623 3. Breccia M Palandri F Polverelli N Epidemiology and disease characteristics of myelofibrosis: a comparative analysis between Italy and global perspectives [Review] Front Oncol 2024 14 14 10.3389/fonc.2024.1382872 PMC11303153 39114304 4. Clarivate Epidemiology intelligence Myelofibrosis 2024 cited 2024 Aug 30 Available from: https://epi-intelligence.clarivate.com/disease/myelofibrosis/dashboard 5. Takenaka K Shimoda K Uchida N Clinical features and outcomes of patients with primary myelofibrosis in Japan: report of a 17-year nationwide survey by the idiopathic disorders of hematopoietic organs research committee of Japan Int J Hematol 2017 105 1 59 69 10.1007/s12185-016-2102-3 27761702 6. Gupta V Hari P Hoffman R Allogeneic hematopoietic cell transplantation for myelofibrosis in the era of JAK inhibitors Blood 2012 120 7 1367 1379 10.1182/blood-2012-05-399048 22700718 PMC5800543 7. Tefferi A Primary myelofibrosis: 2023 update on diagnosis, risk-stratification, and management Am J Hematol 2023 98 5 801 821 10.1002/ajh.26857 36680511 8. Novartis Jakavi highlights of prescribing information cited 2023 Oct 16 Available from: https://www.jakafi.com/pdf/prescribing-information.pdf 9. Verstovsek S Mesa RA Gotlib J A double-blind, placebo-controlled trial of ruxolitinib for myelofibrosis N Engl J Med 2012 Mar 1 366 9 799 807 10.1056/NEJMoa1110557 22375971 PMC4822164  •• Pivotal phase 3 COMFORT-I trial. 10. Harrison C Kiladjian JJ Al-Ali HK JAK inhibition with ruxolitinib versus best available therapy for myelofibrosis N Engl J Med 2012 Mar 1 366 9 787 798 10.1056/NEJMoa1110556 22375970  •• Pivotal phase 3 COMFORT-II trial. 11. Verstovsek S Gotlib J Mesa RA Long-term survival in patients treated with ruxolitinib for myelofibrosis: COMFORT-I and -II pooled analyses J Hematol Oncol 2017 10 1 156 10.1186/s13045-017-0527-7 28962635 PMC5622445 12. Shimoda K Takahashi N Kirito K JSH practical guidelines for hematological malignancies, 2018: I. Leukemia-4. Chronic myeloid leukemia (Cml)/myeloproliferative neoplasms (MPN) Int J Hematol 2020 112 3 268 291 10.1007/s12185-020-02964-0 32783166 13. Barbui T Tefferi A Vannucchi AM Philadelphia chromosome-negative classical myeloproliferative neoplasms: revised management recommendations from European LeukemiaNet Leukemia 2018 32 5 1057 1069 10.1038/s41375-018-0077-1 29515238 PMC5986069 14. PMDA Jakavi prescribing information 2023 cited 2024 Aug 6 Available from: https://www.pmda.go.jp/PmdaSearch/iyakuDetail/ResultDataSetPDF/300242_4291034F1029_1_10 15. Jung CW Shih LY Xiao Z Efficacy and safety of ruxolitinib in Asian patients with myelofibrosis Leuk Lymphoma 2015 56 7 2067 2074 10.3109/10428194.2014.969260 25315076  • Phase 2 trial (study A2202) ongoing at the time of ruxolitinib approval in Japan. 16. Ministry of Health, Labour and Welfare Ordinance No. 171 of 2004, ministerial ordinance on Good post-marketing study Practice for drugs (GPSP) Tokyo, Japan Ministry of Health, Labour and Welfare 2004 17. Vainchenker W Leroy E Gilles L JAK inhibitors for the treatment of myeloproliferative neoplasms and other disorders F1000Res 2018 7 82 10.12688/f1000research.13167.1 29399328 PMC5773931 18. Mesa RA Cortes J Optimizing management of ruxolitinib in patients with myelofibrosis: the need for individualized dosing J Hematol Oncol 2013 Oct 22 6 79 10.1186/1756-8722-6-79 24283870 PMC4222119 19. Al-Ali HK Griesshammer M Foltz L Primary analysis of JUMP, a phase 3b, expanded-access study evaluating the safety and efficacy of ruxolitinib in patients with myelofibrosis, including those with low platelet counts Br J Haematol 2020 Jun 189 5 888 903 10.1111/bjh.16462 32017044 20. Verstovsek S Mesa RA Livingston RA Ten Years of treatment with ruxolitinib for myelofibrosis: a review of safety J Hematol Oncol 2023 Jul 27 16 1 82 10.1186/s13045-023-01471-z 37501130 PMC10373260 21. Komatsu N Kirito K Shimoda K Assessing the safety and efficacy of ruxolitinib in a multicenter, open-label study in Japanese patients with myelofibrosis Int J Hematol 2017 105 3 309 317 10.1007/s12185-016-2130-z 27832516 22. Oritani K Okamoto S Tauchi T A multinational, open-label, phase 2 study of ruxolitinib in Asian patients with myelofibrosis: Japanese subset analysis Int J Hematol 2015 101 3 295 304 10.1007/s12185-015-1746-8 25638222  • Japanese subset analysis of study A2202. 23. Vannucchi AM Kantarjian HM Kiladjian JJ A pooled analysis of overall survival in COMFORT-I and COMFORT-II, 2 randomized phase III trials of ruxolitinib for the treatment of myelofibrosis Haematologica 2015 100 9 1139 1145 10.3324/haematol.2014.119545 26069290 PMC4800694 24. Gangat N Caramazza D Vaidya R DIPSS plus: a refined dynamic International prognostic scoring system for primary myelofibrosis that incorporates prognostic information from karyotype, platelet count, and transfusion status J Clin Oncol 2011 Feb 1 29 4 392 397 10.1200/jco.2010.32.2446 21149668 25. Al-Ali HK Stalbovskaya V Gopalakrishna P Impact of ruxolitinib treatment on the hemoglobin dynamics and the negative prognosis of anemia in patients with myelofibrosis Leuk Lymphoma 2016 57 10 2464 2467 10.3109/10428194.2016.1146950 26916563 26. Gupta V Harrison C Hexner EO The impact of anemia on overall survival in patients with myelofibrosis treated with ruxolitinib in the COMFORT studies Haematologica 2016 101 12 e482 e484 10.3324/haematol.2016.151449 27587385 PMC5479619 27. Maffioli M Mora B Ball S A prognostic model to predict survival after 6 months of ruxolitinib in patients with myelofibrosis Blood Adv 2022 6 6 1855 1864 10.1182/bloodadvances.2021006889 35130339 PMC8941454 28. Verstovsek S Kiladjian JJ Vannucchi AM Early intervention in myelofibrosis and impact on outcomes: a pooled analysis of the COMFORT-I and COMFORT-II studies Cancer 2023 Jun 1 129 11 1681 1690 10.1002/cncr.34707 36840971 ",
  "metadata": {
    "Title of this paper": "Early intervention in myelofibrosis and impact on outcomes: a pooled analysis of the COMFORT-I and COMFORT-II studies",
    "Journal it was published in:": "Future Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490404/"
  }
}