{
  "title": "Paper_52",
  "abstract": "pmc Small Small 379 blackwellopen SMLL Small (Weinheim an Der Bergstrasse, Germany) 1613-6810 1613-6829 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12490179 PMC12490179.1 12490179 12490179 40888234 10.1002/smll.202506429 SMLL70225 1 Review Review Synthetic Biology and Biomaterials Strategies to Deceive the Tumor Microenvironment in CAR‐T Immunotherapy Marsico Grazia https://orcid.org/0000-0003-2730-8016  1 * GC Sudarshan  1 * Siciliano Velia https://orcid.org/0000-0001-7734-9153  1 Velia.Siciliano@iit.it *   1 Synthetic and Systems Biology Lab for Biomedicine Istituto Italiano di Tecnologia‐IIT Largo Barsanti e Matteucci Naples 80125 Italy * Velia.Siciliano@iit.it 01 9 2025 02 10 2025 21 39 498134 10.1002/smll.v21.39 e06429 14 7 2025 28 5 2025 02 10 2025 03 10 2025 03 10 2025 © 2025 The Author(s). Small published by Wiley‐VCH GmbH https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Chimeric antigen receptor (CAR)‐T cell immunotherapy has emerged as a groundbreaking approach in cancer treatment, offering new hope across various malignancies. However, its success against solid tumors remains limited due to critical challenges, including off‐tumor, on‐target toxicity, immune resistance, poor T cell infiltration into the tumor microenvironment (TME), and T cell exhaustion. In response, interdisciplinary innovations in synthetic biology and biomaterials are redefining how can be engineer smarter, more responsive CAR‐T cells. Recent advances have introduced biomaterials not only as precision delivery vehicles but also as artificial antigen‐presenting cells (APCs), high‐throughput screening platforms, and tools to replicate the complex biomechanical landscape of the TME. This review highlights these cutting‐edge strategies, emphasizing how biomaterials and synthetic circuits can aid studies and strategies to enhance CAR‐T cell efficacy in solid tumors while minimizing adverse effects. Future directions at the intersection of tumor‐inspired biomaterials and T cell engineering, envisioning a new generation of CAR‐T therapies tailored to overcome the formidable barriers of the TME are also explored. A. Synthetic biology and biomaterials have emerged as tools to study and facilitate the treatment of solid tumors wi‐th chimeric antigen receptor‐CAR‐T cells. These strategies aim to resist the tumor microenvironment‐TME that presents cellular, biochemical, and mechanical immunosuppressive signals that hinder CAR‐T efficacy. B. The field of biomaterials has contributed to the development of hydrogels, nanoparticles (NP)s, or the combination to improve CAR‐T trafficking and proliferation directly injected into the tumor site. C. NPs have also been engineered as antigen presenting cells (APCs) to improve antigen presentation in the context of tumor antigen heterogeneity. D. 2D, 3D gel systems as well as patient tumor derived organoids (TDOs) and tumors on a chip, are promising tools that help to gain mechanistic insight of CAR‐T cell response to the TME stimuli, including the mechanical forces that remain understudied. biomaterials CAR‐T delivery systems ex vivo mechanical models immunotherapy solid tumor microenvironment synthetic biology HORIZON EUROPE European Research Council 10.13039/100019180 852012 Fondazione AIRC per la ricerca sul cancro ETS 10.13039/100020581 ID 29893‐2023 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2, 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:02.10.2025  G. Marsico S. GC V. Siciliano Synthetic Biology and Biomaterials Strategies to Deceive the Tumor Microenvironment in CAR‐T Immunotherapy Small 21 39 2025 e06429 10.1002/smll.202506429 PMC12490179 40888234 1 Introduction Cancer is one of the most lethal diseases with 20 million new cases and 9.7 million deaths worldwide only in 2022. The frontline therapies such as the combination of surgery, radiotherapy and chemotherapy, still present several challenges including tumor relapse, drug resistance, and off‐target toxicity. T cell‐based immunotherapy represents a revolutionary breakthrough in cancer treatment as it elicits a specific anti‐tumor immune response, facilitating its elimination. [  1 ] [  2  3 ] [  4  5 ] [ [  6 ] [  7  8 ] [  9 ] Figure  1 [  10 ] [  11 ] [  12 ] 1 [  13 ] [  14  15  16  17 ] 1 [  12  18  19 ] [  12  20  21 ] Figure 1 TME features that inhibit CAR‐T and potential solutions offered by cell and biomaterial engineering. The solid TME presents cellular, biochemical, and physical/mechanical compartments. Besides cancer cells, the TME presents myeloid‐derived suppressor cells (MDSCs), T‐regulatory cells (T‐reg), tumor associated macrophages (TAMs), dendritic cells (DCs), and fibroblasts. These cells secrete immune suppressive cytokines and chemokines such as TGF‐β, CLC2, CLC19, IL‐4, IL‐7, VEGF‐A. Other biochemical features are oxidative stress (ROS increase), hypoxia, acid pH, and the lack of nutrients. The physical environment is characterized by dysfunctional vasculature, increased ECM deposition, and aberrant microarchitecture. All these elements contribute to creating mechanical forces such as solid stress, matrix stiffness, and interstitial fluid pressure. The TME elements act in concert in inhibiting CAR‐T cell efficiency, by preventing infiltration and inducing exhaustion. Strategies to solve this challenge involve engineering CAR‐T with synthetic receptors and/or circuits to improve infiltration and revert exhaustion. Other strategies consist of engineering biomaterials as delivery systems to improve infiltration and trafficking and as artificial presenting cells that improve antigen presentation to CAR‐T. Figure created with biorender.com. 2 Engineering cells “From Inside‐Out”: Synthetic Biology to Improve CAR‐T Efficacy Founded at the dawn of 90′, [  22 ] [  23  24  25 ] [  3  14  16 ] [  16  22 ] Figure  2 [  26 ] [  7 ] Table  1 Figure 2 Overview of CAR‐T structure and synthetic biology strategies to engineer TME responsive CAR‐T. A) Most CARs consist in an extracellular antigen recognition domain (the immunoglobulin scFv fragment), a flexible hinge, a transmembrane domain, and the intracellular portion that is made of the costimulatory domain (CD28 or 4‐1BB) and the signaling domain (CD3ϛ). The design of this synthetic receptor varies depending on the TAA, and the target TME features. B) CAR designed to improve infiltration can be engineered to I) co‐express chemokine receptors (TGF‐β, IL‐4, CCL‐2, CCL‐19), II) secrete heparinase that degrade the ECM, III) to express bispecific receptors binding the TAA and the FAP presented by CAFs. C) CAR‐T cells designed to remodel the aberrant tumor vasculature I) specific for the VEGFR on endothelial cells, II) the CD248 on pericytes, III) and as switch‐on CAR expression triggered by SynNotch‐P‐selectin D) CARs able to respond to immunosuppressive biochemical inputs include CAR sensitive to i) hypoxia (HIF‐dependent switch ON CAR or a fusion CAR bearing HIFα as signaling domain, II) resistant to oxidative stress (CAR‐T cells with NRF2 knocked out), CAR‐T responsive to acidic pH (CAB‐CAR with scFv portion active only at pH 6.7), and CAR bearing a masking peptide with a linker cleavable by MMPs. E) CAR‐T cells responsive to immunosuppressive cytokines (CAR‐T and IL chimeric receptors co‐expression, SNIPR, armored CAR‐T with an interleukin inducer). F) Engineered cells targeting antigens on immunosuppressive cells include I) TAMs‐binding CAR‐T and II) gene‐modified NK cells bearing a chimeric receptor in which the activating receptor NKG2D is fused to the cytotoxic ζ‐chain of the Tcell receptor (NKG2D.ζ). G) Strategies to revert exhaustion include I) CAR‐T specific PDL1 (check point inhibitory receptors) and FASL (apoptotic signal), II) the coadministration of CAR‐T cells with anti PD1, anti CTLA antibodies already used in clinic, and III) CAR‐T knocked out for the exhaustion regulator TFs (TOX, NR4A2). Table 1 Synthetic biology strategies to engineer CAR‐T to resist the TME. TME feature Strategy Specific target CAR‐T specificity Model Research stage/Clinical validation Effect Refs.  Thick ECM Infiltration‐guiding chemokines TGF‐β, PSCA, IL‐4 1G.CAR  Human pancreatic ductal adenocarcinoma in mice Preclinical Selective antitumor effect on tumor site [ 156 CCL2 GD2.CAR Human neuroblastoma xenograft into SCID mice Preclinical Improved homing [ 30 Expressing IL‐17, CCL19 hCD20.CAR P815‐hCD20 tumor in mouse Preclinical Increased infiltration [ 32 Degrading ECM Heparanase secretion GD2.CAR Melanoma or neuroblastoma model in NSG mouse Preclinical Increased infiltration and antitumor activity [ 33 Attacking CAFs Targeting FAP FAP.CAR Malignant pleural mesothelioma, colorectal carcinoma, lung adenocarcinoma in mice NCT01722149 Increased antitumor activity [ 34 Targeting two antigens of TME Targeting FAP and GPC3 antigens FAP‐GPC3.CAR  Hepatocellular carcinoma (NSI mice) Preclinical Higher anti‐tumor efficacy compared to single target CAR [ 35 Attacking CAFs and engaging T cells Secreting anti‐FAP and anti‐CD3 Mesothelin.CAR Pancreatic adenocarcinoma in NSG mice Preclinical Significant binding to antigens, high antitumor activity [ 36 Targeting both tumor cells and CAFs Targeting FAP, SLAMF7 BCMA.CAR Multiple myeloma with BM‐CAFs in xenograft mouse Preclinical Improved effector functions [ 37 Irregular vasculature Targeting stromal cells N/A CD248.CAR Breast cancer, Lung cancer inmice Preclinical Tumor necrosis, reduced tumor size and metastasis [ 38  Targeting receptors of blood vessels VEGFR VEGFR2‐CAR Metastatic cancer NCT01218867 No clinical benefit in clinical trials [ 40 43 Targeting adhesion protein with SynNotch P‐selectin Anti‐GD2.CAR Neuroblastoma mouse model Preclinical Increased anti tumor efficacy [ 44 Hypoxia Harnessing oxygen availability of TME HIF‐1a Pan‐anti‐ErbB targeted CAR Hypoxic HN3 tumors in NSG mice Preclinical Anti‐tumor activity without off‐tumor toxicity [ 48 Oxidative stress Knockdown of Nrf2 Nrf2 CD19.CAR Melanoma, lymphoma, colon carcinoma, lung carcinoma in mice Preclinical Increase in antitumor activity and survival of CAR‐T cells [ 47 Matxix proteases Masking CAR Protease EGFR.mCAR Subcutaneous human lung cancer xenograft in NSG mice Preclinical Improved safety profile, increased antitumor efficacy [ 46 Immune‐suppressive biochemical signals Co‐expressing anti‐TAA and chimeric receptors for suppressive cytokines IL‐4 MUC1.CAR MDA‐MB‐435, ZR75, MCF7 cell lines, mouse model Preclinical MDA‐MB‐435 [ 53 Creating immune‐responsive phenotypes Secreting IL‐18 CD19.CAR EL4hCD19+ tumor in syngeneic mice Preclinical Enhanced in vivo expansion and persistence of CAR‐T cells [ 45  Immune suppressive cells Inhibiting TAMs F4/80 F4.CAR HKP1 lung tumors in cancer Preclinical Increased infiltration, antitumor activity [ 63 E Inhibiting MDSCc NKG2D GD2.CAR, NKG2D.CAR Neuroblastoma in mice Preclinical Improved antitumor compared to CAR‐T therapy alone [ 64  Targeting T‐r‐eg cells orthoIL‐2 and orthoIL‐2Rβ Transgenic CD8+ T cells Melanoma in mice Preclinical Reduced pro‐tumoral Treg cells [ 65 66 67 T cell exhaustion Triple knockout of TFs  Nr4a1, Nr4a2, Nr4a3  huCD19.CAR  Melanoma in mice Preclinical  Tumor regression, prolonger survival of tumor bearing mice [ 71  Knockout of transcription factor or checkpoint receptors TOX, PD1, TGF‐βR CD19.CAR, Mesothelin CAR, EGFR.CAR Melanoma in mice NCT03747965 NCT03545815 NCT04976218 Decreased exhaustion in preclinical [ 157  Co‐expression of immune checkpoint blockade single chain variable fragment (scFv) PD‐1 CD19.CAR or MUC16.CAR Peritoneal carcinomatosis, ovarian carcinoma in mice Preclinical Improved safety [ 158 Using Chimeric switch receptor PDL1 CD19.CAR or mesothelin.CAR or PSCA.CAR EMMESO flank tumor‐bearing NSG mice, PC3‐PSCA flank tumor bearing mice Preclinical Enhanced tumor lytic activity, cytokine secretion [ 69 Preventing FasL‐induced apopotosis FasL CD19.CAR or pmel‐1.CAR Melanoma in mice Preclinical Increased longevity, antitumor activity of T cells [ 70 John Wiley & Sons, Ltd. 2.1 Synthetic Biology for Designing TME ‐Responsive CAR‐T One of the challenges of translating CAR‐T cell therapy to solid tumors resides in the complexity of the TME that creates a biochemical and physical barrier that prevents them from infiltrating and eliminating cancer cells [  9 ] 1 [  10 ] [  27 ] Figure  1 2.1.1 Strategies to Improve the Infiltration of CAR‐T in the TME Engineering CAR‐T Responsive to the Infiltration‐Guiding Chemokines Several strategies have been explored to improve CAR‐T cell infiltration into the TME (Figure 2B 2BI 2BI [  28  29 ] 2BI [  30  31 ] 2BI [  32 ] Engineering CAR‐T Cells to Degrade the ECM in the TME Another strategy to enhance CAR‐T infiltration is by breaking down the ECM, which is denser and more rigid in solid tumors due to the presence of fibrous proteins, glycosaminoglycans, and proteoglycans (Figure 1 2BII [  33 ] NCT01722149 [  34 ] 2BIII [  35  36 ] Additionally, SLAMF7‐CAR‐T cells can target both CAFs and multiple myeloma cells, [  37 ] 2CII [  38 ] 2.1.2 Engineering CAR‐T to Remodel Cancer Blood Vessels Abnormal tumor vasculature is characterized by leaky vessels, high pressure, and hypoxia(Figure 1) hinders CAR‐T cell infiltration. [  39 ] 2CI [  40  41  42 ] NCT01218867 [  40  43 ] [  44 ] 2CIII 2.1.3 Engineering CAR‐T to Exploit and Remodel the Immune Suppressive Biochemical Cues of the TME Beyond improving infiltration, CAR‐T cells have been engineered to sense and respond to TME‐specific biochemical cues to enhance tumor specificity and reduce off‐target toxicity. These include hypoxia‐, reactive oxygen species (ROS), and pH‐responsive CARs, as well as protease‐activated and cytokine‐sensing designs (Figure 2D [  45  46  47  48  49 ] Engineering CAR‐T Cells to Respond to Hypoxia Hypoxia‐sensitive CAR‐Ts were found to exhibit a specific antitumor effect in some carcinoma xenografts. [  49  50 ] 2DI [  50 ] In a more recent study, the same HIFα sensing domain was fused to a CAR‐T specific for the carcinoembryonic antigen (CEA), obtaining also here a CAR‐T activation highly restricted to the hypoxic tumor environment (Figure 2DI [  49 ] 2DII [  51 ] Engineering CAR‐T Cells Sensitive to Acidic pH The TME also presents acidic pH, which is due to the increase of glycolysis rate in cancer cells and favors immune escape and inhibits the T cell growth. [  52 ] NCT03393936 2DIII Engineering CAR‐T Cells Sensitive to Matrix Proteases As the TME also brims of matrix proteases to facilitate invasion, another study generated a CAR‐T where the antigen‐binding site is masked with a protease‐responsive domain. In this way, the CAR can recognize the TAA only upon the cleavage of the peptide, therefore activating the cells only in the TME and avoiding non‐specific action on healthy tissue (Figure 2DIV [  46 ] Engineering CAR‐T Cells IL‐Responsive Chimeric receptors presenting IL‐4 receptor (IL‐4R) extracellular portion fused to either the cytoplasmic part of the IL‐2 receptor (IL‐2Rβ) [  53 ] [  54 ] [  53  54 ] 2DV [  29 ] [  55 ] [  45 ] 2DV [  56 ] Engineered T cells to present a subunit of IL‐23 which can reconstitute into a functional IL‐23 in TME, can enhance T cell proliferation, and minimize off‐target cytotoxicity. [  45 ] [  45  55  57  58 ] Taken together, these studies suggest that reshaping the TME through secreting antitumor cytokines could be a winning strategy in the CAR‐T fight against solid tumors. However, it is critical to control their expression and release to avoid systemic toxicities. 2.1.4 Engineering CAR‐T to Inhibit the Immune‐Suppressor Cell Types of TME As aforementioned, the TME also abounds of dysregulated cells that exacerbate the immune‐suppression and correlate with relapses and toxicity to CAR‐T therapy (Figure 1 [  59  60 ] [  61 ] [  62 ] 1 2F CAR‐T against TAMs, expressing the F4.CAR (specific for the macrophage F4/80) has been found to reduce growth and prolong survival in lung, ovarian, and pancreatic murine models (Figure 2Fi [  63 ] Parihar et al., developed NK cells expressing a receptor fusing the NK cytotoxic outer (NKGD2) domain with the CAR‐T inner portion, able to kill MDSCs in a neuroblastoma xenograft model (Figure 2Fii [  64 ] T‐reg cells in the TME hinder CAR‐T efficacy by competing for IL‐2 via their high IL‐2Rα expression. IL‐2 secretion or administration may unintentionally favor T‐reg expansion. To avoid this, engineered IL‐2 variants that selectively bind IL‐2Rβ on CAR‐T cells have been developed. A more precise solution uses orthogonal IL‐2/IL‐2Rβ pairs (orthoIL‐2/orthoIL‐2Rβ), promoting selective CAR‐T proliferation while minimizing T‐programmed death protein 1reg activation. [  65  66  67 ] This research highlights how insidious it is to unleash the CAR‐T in the solid TME, as the factors that drive immunosuppression are multiple and intricate. Combinatorial strategies that aim at remodeling the TME in diverse aspects are challenging and needed. 2.1.5 Engineering CAR‐T for Preventing Cell Exhaustion As mentioned above, one of the reasons for the inefficiency of CAR‐T in solid tumors is the onset of exhaustion upon chronic antigen stimulation and other stimuli imparted by the TME (Figure 2G [  68 ] [  69 ] 2GI [  70 ] NCT04577326 2G [  69 ] 2GII [  69 ] [  71 ] [  72 ] 2GIII [  73  74 ] 3 The Synergy Between Synthetic Biology and Biomaterials to Improve CAR‐T Efficacy Against TME Despite all these efforts from synthetic biology, the challenge posed by the TME requires a multidisciplinary and synergistic approach to reach therapeutic efficacy in solid tumors. Biomaterials have crossed the CAR‐T path in many ways: 1) as tools to enhance the CAR transduction efficiency 2) as in vitro platforms for CAR‐T cell expansion prior administration, 3) as a delivery system for CAR‐T in situ, 4) as artificial APCs, 5) in 2–3D system/organoids and microfluidic devices as platforms for mechanistic studies and CAR‐T efficacy screen. The first two in vitro applications have been thoroughly reviewed somewhere else, [  12  75  76 ] Figure  3 Table  2 [  77 ] 3.3 Figure  4 Table  3 Figure 3 Schematic representation of biomaterials used as delivery systems and artificial APCs for CAR‐T therapy. A) Delivery systems are I‐IV) injectable or V‐VI) implantable at the tumor site. Injectable systems include hydrogels based on I) Chitosan‐PEG or II) GelMA loaded with CAR‐T‐guiding cytokines, and hydrogels based on III) HPMC or IV) HA containing NPs (PEG‐PLA‐RGD, PLGA or platelet). NPs usually bear a cytokine cargo that directs CAR‐T cells. CAR‐T can also be delivered in situ through V) implantable nitinol‐fibrin films (functionalized with the binding‐activation antibodies (anti‐CD3, anti‐CD28, and anti‐CD137) and VI) through PLGA patches with porous microneedles. B) Micro/nanoparticles not only function as delivery systems, but also as artificial antigen presenting cells (APCs) for CAR‐T. APCs can be synthetic polymers I, II) NPs PLGA, III, IV), protein NPs (HSA) and V, VI) NPs can be functionalized with activation antibodies (anti‐CD3, anti‐CD28, and anti‐CD45) or cell adhesion peptides (iRGD). They can bear cargo cytokines (IL‐2, IL‐12), agonists (Il‐15 and αGalcer) or inhibitors (PIK3, A2A) that support CAR‐T function. In some cases the NPs can be conjugated to the CAR‐T through click chemistry or through fusion to a transmembrane protein. Figure created with biorender.com. Table 2 Biomaterials as delivery systems and APCs. System Material Functionalization/Enacapsulation CAR‐T Model Effect Refs. Hydrogel Chitosan‐PEG IL‐15 GD‐2.CAR‐T  Retinoblastoma, mouse model (In situ xenograft nude mice model) Prevents tumor recurrence [ 79 GelMA IL‐2, IL‐7 and IL‐15 HER2. CAR Melanoma, mice Improves anti‐tumor efficacy in both in vitro and in vivo conditions [ 80  Hydrogel+ nanoparticle HPMC‐C12 and PEG‐PLA nanoparticles IL‐15 B7H3‐ specific CAR Subcutaneous human medulloblastoma (MED8A) in NSG mice Enhances sustained survival, functionality and activation of CAR‐T cells [ 78 HA, PLGA nanoparticles IL‐15, anti‐PDL1‐conjugated platelets CSPG4.CAR Subcutaneous melanoma in NSG mice Enhances T‐cell persistence and anti‐tumor activity [ 82 Micromesh Nitinol, fibrin Anti‐CD3, Anti‐CD28 and Anti‐CD137 N/A Non‐resectable ovarian cancer, mice model Enhances expansion of T cells and direct delivery of T cells to the tumor [ 84 Nano/micr‐oparticles Silica, alginate Cyclic di‐GMP, anti‐CD3, anti‐CD28, anti‐CD137 NKG2D.CAR Subcutaneous melanoma model, orthotopic mouse model of pancreatic cancer High expansion of CAR T cells in tumor site [ 88 PLGA, DNA scaffolds, PEG, PLA Anti‐CD3, Anti‐CD28, IL‐2 HER2.CAR Leukemia cell line K562 xenograft tumor in NSG mice Presentation of priming antigens and efficient activation of CAR‐T cells [ 94 HSA, GSH, DBCO IL‐12 CD19.CAR NOD‐SCID mice injected with Raji‐luc cells Selective recruitment and enhanced expansion of CAR‐T cells in solid tumor [ 95 PEG, NHS‐SS‐NHS crosslinker Il‐15Sa, Anti‐CD45 ab, Glutathione EGFR.CAR B16F10 melanoma mouse model, U‐87 MG human glioblastoma in NSG mice Supports cell expansion [ 159  Cross‐linked liposomal vesicles, maleimide‐functionalized lipids SCH‐58261 Anti‐CD19 CAR SKOV3.CD19 ovarian cancer model and K562.CD19 leukemia model in NSG mice Prevents CAR‐T cells hypofunction [ 97  Lipid nanoparticles (DSPE‐PEG‐maleimide) iRGD, PI3K inhibitors, alpha‐GalCer agonist Anti‐ROR1 CAR 4T1 syngeneic breast cancer model and human glioma in mice Tumor localization signal [ 98 PLGA Indocynine green Anti‐CD19 Burkit lymphoma model  ECM loosening agent [ 160 INPs, Magnetic control Iron oxide nanoparticles (SPIONs) SPIONs CSPG4.CAR  In vitro model of Melanoma expressing chondroitin sulfate proteoglycan CAR‐T cell localization to tumor, Avoids off tumor toxicity [ 101  INPs, PPT  Smart gold (sAuNPs) OT‐1 transgenic T cells Melanoma murine model (F10‐OVA) Efficient infiltration [ 102 Gold Polydopamine, horseradish peroxidase (HRP) NALM 6 solid murine model Tumor elimination, persistent immune memory cells [ 104  Au/Cu 2‐ x Camouflaged with CAR‐T membrane CD19.CAR NALM6 solid tumor Tumor elimination [ 105 Chromium Polydopamine B7‐H3 CAR‐T Hepatocarcinoma and breast tumor bearing mice Improvement of CAR‐T cell infiltration and tumor growth inhibition [ 106 John Wiley & Sons, Ltd. Figure 4 Biomaterial systems, organoids, and microfluidic devices as platforms for mechanistic studies and CAR‐T efficacy screens. A) 2D and 3D gels mimicking the ECM stiffness effect on T cells used to evaluate T cell activation, proliferation, phenotype, and exhaustion. B) Tumor organoids and tumor on chips as ex vivo comprehensive platform of the cellular, biochemical the physical (stiffness, fluid pressure and microarchitecture) TME elements that have been used to evaluate infiltration, activation, killing capacity, antigen recognition, and effector cytokine release. Figure created with biorender.com. Table 3 Biomaterials for ECM‐mimicking mechanistic studies on T cells. Dimension Biomechanics Biomaterial Functionalization Method T‐cell Effect Refs. 2D Stiffness PDMS Anti‐CD3, Anti‐CD28 Adsorption CD8+ Mechanical stress supports CD8+ T‐cell exhaustion [ 114 PDMS Anti‐CD3, Anti‐CD28 Silanization CD4+ Softer substrate supports CD4+ T‐cell expansion [ 161 PDMS rCD2 Lipid bilayer formation on PDMS Jurkat Early TCR triggering is not mechanosensitive [ 131 PAA Anti‐CD3, Anti‐CD28, biotinylated antibody Biotin‐streptavidin binding CD4+/CD8+ Ligand density and intermediate stiffness induces T‐cell activation [ 133 Alginate GP 61–80 peptide Conjugation of RGD peptide to alginate CD4+ Stiffness suppresses proliferation via YAP induction [ 132 3D Stiffness, Density  Collagen hydrogel N/A Encapsulation TILs Reduction of T‐cell proliferation in high density matrix and vice versa [ 124 Viscoelasticity  Collagen‐PEG‐Norbonene hydrogel N/A Click‐chemistry CD8+ Role of matrix viscoelasticity of generating distinct T‐cell phenotypes [ 21 John Wiley & Sons, Ltd. 3.1 Biomaterial‐Based Constructs as CAR‐T Delivery System In Vivo The gold‐standard CAR‐T endovenous intravenous administration suffers poor penetration, growth, and scarce anticancer activity in the solid tumor site. [  16  78  79  80 ] [  81 ] [  75  76 ] [  82  83 ] 3A 2 [  84  85  86  87  88 ] 3A [  79 ] 3AI 3AII [  80 ] Some authors combined hydrogels with nanoparticles (NPs) to maximize the reservoir potential and obtained encouraging results in some tumor models (Figure 3AIII‐IV [  78  82 ] 3AIII [  78 ] Hu et al. [  79 ] 3AIII 3AIV 3AV [  84 ] [  88 ] An alternative method proposed by Li et al developed a PLGA porous microneedle patch loaded with CAR‐T cells that has been implanted subcutaneously in a mouse melanoma mouse model after post‐surgical resection of the 90% of the tumor (Figure 3AVI [  87 ] I Taken together, these preclinical results suggest that hydrogel or film‐based constructs hold great promise for the translation of CAR‐T to solid tumor immunotherapy. The potential of this therapeutic approach lies in the possibility of incorporating costimulatory co‐factors and exposing the tumor with a higher concentration of immune cells over a prolonged timeframe. Furthermore, the local presentation can increase the safety of therapeutic agents, as biomaterials also offer fine‐tunable support for surface functionalization, which is detrimental for modulating immune cell performance. Nevertheless, scaling up delivery systems still represents significant challenges like assuring reproducibility in mechanical strength during, degradation rate, biocompatibility, sterility, and safety. Computational modeling to predict optimal formulations and 3D printing hold the potential to standardize hydrogel fabrication in a large scale. [  89 ] 3.2 Biomaterials Such as Nano/Microparticles to Improve Antigen Presentations to CAR‐T in the TME and Delivery 3.2.1 Organic Nano/ Microparticle as Artificial APCs The immunosuppressive TME not only impedes CAR‐T infiltration but also disrupts activation and function, which rely on APCs. [  86 ] [  85  86  90 ] [  91  92  93 ] 3B 2 [  12  77 ] Desai's group. developed DNA–PLGA microparticles (∼2 µm) decorated with CD3/CD8 antibodies and IL‐2, which, when injected into leukemia‐bearing mice, attracted systemically delivered CAR‐T cells and led to tumor clearance (Figure 3Bi [  77  94 ] 3BII 3BII [  95 ] 3BIV 3BIII [  96 ] Following the same purpose, CAR‐T cell membrane has also been functionalized with lipid NPs loaded with some key immune‐stimulant molecules. For example, CD19‐CAR‐T cells conjugated with lipidNPs containing the A2 adenosine receptor (a T cell suppressor) antagonist SCH‐58261 (Figure 3BVI [  97 ] Some other lipid NPs were not only used as cargo but also presented a guiding signal for specific tumor localization (Figure 3BV [  98 ] 3BV [  98 ] In summary, organic NPs have been shown to boost CAR‐T cell therapy efficacy by improving the antigen presentation in the TME both by acting as artificial APCs and by remodeling the TME. The results in vivo encourage the validation of these complex fine‐tunable systems at the clinical level. Multiple parameters such as size, shape, stiffness, viscoelasticity, ligand density, and cellular contact zone need to be optimized in a larger scale for moving to clinical trials and commercialization. [  99 ] 3.2.2 Inorganic Nanoparticles (INP)s and Photothermal Therapy (PPT) Synergy to Boost CAR‐T Efficacy Several INPs in combination with PPT have been shown to potentiate CAR‐T delivery and efficacy in treating solid tumors. Their biocompatible nature and their capability to adsorb NIR light and converted into heat, has been exploited to guide and fine‐tune CAR‐T activity against solid tumor in several preclinical models (Table 2 [  100 ] Earlier this year, Pfister et al., functionalized CAR‐T cells with magnetically controllable iron oxide nanoparticles (SPIONs), to direct them into the tumor site and therefore avoid off‐tumor toxicity. The SPIONs specifically attacked melanoma cells expressing CSPG4. [  101 ] Gold nanoparticles (sAuNPs), ‐carrying T cells successfully infiltrate into tumor tissues (20%) and in combination with photothermal stimulation and showed complete tumor eradication after 21 days in a melanoma murine model (F10‐OVA) and furthermore as well as a survival rate of 100%. [  102 ] Despite many INPs are under clinical trials as drug depots, [  103 ] [  100 ] Indeed, Li, et al., developed a membrane‐coated multifunctional catalyst to improve tumor elimination. This consisted in encapsulating Ag 2 [  104 ] Another example of this synergetic strategy is provided by Wu et al., that developed Au/Cu 2‐ x [  105 ] Another method to address INPs potential toxicity consists in functionalizing nanoparticles with biocompatible layers as demonstrated by Zou et al. [  106 ] [  106 ] Another important application of metallic INPs is in vivo CAR‐T tracking through magnetic resonance imaging and photoacoustic tomography. Nevertheless, this topic goes beyond the scope of this review, and it is exhaustively discussed elsewhere. [  100  107 ] 3.3 Biomaterial Systems, Organoids, and Microfluidic Devices as Platforms for Mechanistic Studies and CAR‐T Efficacy Screens Despite advances in cell and biomaterial engineering, CAR‐T therapy remains ineffective in solid tumors, partly due to the biomechanical barriers of the TME. Key mechanical challenges include solid stress from tumor growth, interstitial fluid pressure, ECM stiffening from crosslinking, and abnormal tissue architecture (Figure 1 [  108 ] It is well‐known that when T cells interact with APCs or cancer cells, through the formation of immunological synapsis, and are subsequently subjected to tensile and traction forces, generated by membrane protrusions or retractions that result in cell spreading and activation through actomyosin cytoskeleton remodeling. [  109  110  111 ] [  112 ] The TME mechanical inputs can impair CAR‐T infiltration and promote exhaustion. [  113  114 ] [  115  116 ] [  114  117  118  119  120  121 ] [  122 ] 3.3.1 Biomaterial‐Systems to Evaluate the Impacts CAR‐T Function of TME Mechanical Features Nowadays, several reports have used 2D and 3D gels of different materials to investigate the impact of the ECM mechanical features both on cancer and T‐cell, [  21  114  123  124  125  126  127  128  129 ] [  130 ] Figure  4 3 4A [  131  132  133  134 ] [  131 ] 4A [  133 ] Beyond activation, it was also demonstrated that ECM stiffness can also affect T‐cell proliferation, cytotoxic function, ultimately leading to exhaustion. [  132  134 ] 4A [  132 ] 4A [  134 ] [  130 ] This data highlights the crucial role of biomaterials based 2D system in elucidating basic principles of T cell mechanosensing and the resulting cell response. Nevertheless, they fail to mimic the 3D environment of TME where T cells are embedded. To address this limitation, also 3D matrices have been adopted to examine the effects of mechanical properties on the T‐cell cycle. Majedi et al. encapsulated T cells and artificial APCs (dynabeads bearing the activation signal CD3/CD28) in alginate hydrogel with stiffness 4–40 kPa. There was an augmentation of both CD4+ and CD8+ T‐cell activation, proliferation, and migration speed in the stiffer 3D hydrogel as compared to softer materials. [  123 ] −1 −1 4A [  124 ] [  21 ] Taken together, these data suggest that the 3D models are reliable tools to discover mechanistic insights in T cell mechanical responses. As CD8+ and CD4+ T cells are commonly engineered for CAR‐T cell therapy, understanding the mechanical influences on these immune cells before engineering them is essential to optimize CAR‐T cell activation, proliferation, and cytotoxicity. Hence, biomaterials offer a valuable tool for investigating the mechanobiology of T cells before their use in immunotherapy. Additionally, these insights can inform priorities on mechanical features during the development of advanced preclinical models such as organoids and organ‐on‐a‐chip systems, which will be explored further below. 3.3.2 Tumor Derived Organoids (TDOs) for CAR‐T Efficacy Evaluation Once developed, CAR‐T cells cannot be effectively tested using only the 2D or even 3D models, as their efficacy depends mainly on multiple biochemical and mechanical factors rather than a single mechanical parameter. In the past decade, TDOs have emerged as a widespread 3D system for preclinical testing and drug discovery. TDOs are defined as complex, 3D ex vivo cell clusters derived from primary tumors. [  135 ] [  136 ] [  137 ] Organoids have been developed for most blood [  121  138 ] [  120 ] [  139 ] 4 Table 4 Organoids and Microfluidic devices (mimicking the mechano‐TME) and used as CAR‐T screening. System Approach Cancer Source Material CAR‐T  Effect Refs. Organoids Multi well plate MCL MCL biopsy Matrigel Anti‐CD19.CAR Increase in tumor killing activity of CAR‐T cells [ 50 Use of synNotch CAR‐T Ovarian cancer Resected OC tissues Cold cultrex growth factor BME type 2 HER2 CAR MSLN synNotch  Increase in infiltration and anti‐tumor activity of CAR T cells [ 162 Organoid lines of basal and luminal subtypes Bladder cancer Surgically resected MIBC tissues Cold matrigel MUC1.CAR  Specific antigen recognition, immune activation and increase in cytotoxicity [ 141 Generated directly from fresh tumor specimens without single‐cell dissociation Glioblastoma Microdisected tumor NA  2173‐BBz anti‐EGFRvIII CAR  Increase in CAR‐T cells expansion and cytotoxicity. Inability of highly specific CAR T cells to eradicate tumor cells with antigenic mutations. [ 163 Concurrent analysis of PDOs with patients in phase I study Glioblastoma Surgical GBM tissue NA  EGFR‐IL13Ra2 CAR  Cytokine release and degree of cytolysis in GBOs like patient response [ 143 System Design Perfusion Cancer Cells Matrix CAR‐T  Effect Tumor on chip PDMS chip with tumor chambers beneath an endothealized channel. Continuous perfusion (20 µl/h) Breast tumor Pleural effusion samples PDMS, dextran‐based hydrogel CD19.CAR  Increase in CAR‐T cell infusion, recruitment and infiltration in solid tumors [ 119  Microfluidic device with microwells for spheroid culture connected to a fluidic channel Static Breast tumor MDA‐MB‐468 3D spheroids EGFR.CAR Enhancement of CAR‐T cell cytotoxicity with anti‐PD‐L1 therapy and carboplatin chemotherapy [ 147  Top fluidic chamber, porous membrane, collagen gel block and shear flow channel Shear flow (0.25 dynes/cm 2 Melanoma B16F10‐ova cells 3D collagen gel CD8+ T cells  VEGF reduced T cell extravasation [ 164  Bioprinter with digital micromirror device and bioink of GelMA, GMHA, photoinitiator and GBM cells Static Glioblastoma SK‐N‐BE(2) neuroblastoma cells GelMA, Glycidyl methacrylate hyaluronic acid GD2‐CAR‐T cells  Material stiffness dampens CAR T cell infiltration and tumor cell cytotoxicity [ 151 John Wiley & Sons, Ltd. For example, Zheng et al. used HER2+/ MSLN+ ovarian cancer organoids composed of patient tumor cells and basement membrane extract to test synNotch CAR‐T cells targeting MSLN and secreting ECM‐degrading enzymes such as metallo‐proteases (MMP)9, (MMP)‐12, and heparanase. These CAR‐T cells showed improved infiltration and antitumor activity in both organoids and a murine ovarian cancer model. [  140 ] [  141 ] A key challenge of TDOs is heterogeneity from single‐cell dissociation during generation. Jacob et al. developed a glioblastoma organoid (GBO) biobank that preserved the parental tumors' histology, cellular diversity, gene expression, and mutations. In these models, anti‐ epidermal growth factor (EGFR)vIII CAR‐T cells effectively targeted tumor cells and secreted IL‐2, TNF‐α, IFN‐γ, and granzyme B. [  142 ] [  143 ] Collectively, these findings affirm TDOs as a powerful platform for CAR‐T screening that accounts for tumor complexity and the TME. However, while organoids replicate ECM features, they lack other mechanical aspects like tumor microarchitecture and interstitial pressure. Innovations in microfluidics and bioprinting may help model these elements more comprehensively (Figure 1 3.3.3 Microfluidic Devices and Tumor on Chips as Preclinical Models for CAR‐T Evaluation Microfluidic technology has emerged as a superior ex vivo tumor model. [  13 ] [  144  145 ] [  146 ] Even though only a few reports are available on microfluidic models to examine cancer–immune cell interactions and assess CAR‐T efficacy, their use is in rapid expansion (Figure 4B 4 For instance, a novel breast tumor‐on‐chip model successfully replicated key aspects of CAR‐T cell function, extravasation, tumor infiltration, and cytokine release, allowing the first patient‐specific in vitro assessment of CAR‐T efficacy and safety in solid tumors like breast cancer. [  119 ] Microfluidic platforms using 3D spheroid co‐cultures of cancer and stromal cells have also been developed to evaluate combinatorial immunotherapies, enabling CAR‐T immunoassays. OC3D microfluidic devices (ScreenIn3D Ltd, U.K.) feature microwells connected by channels, enabling fluid flow and precise cytotoxicity and specificity testing. [  147 ] To study CAR‐T infiltration, multilayered tumor‐blood vessel chips have been created. These models feature an endothelial layer over a collagen gel with embedded tumor cells. [  148 ] [  149 ] Further, the combination of microfluidics with 3D bioprinting offers high reproducibility, tunability, and scalability. [  150 ] [  151 ] Overall, tumor‐on‐chip platforms are powerful tools for testing CAR‐T therapies, though fully replicating the TME ex vivo remains challenging. Device customization and validation of in vivo data are essential to improve clinical relevance, with ongoing advances in tissue engineering and biomaterials driving progress. 4 Conclusion With 11 products already on the market, CAR‐T represents the biggest leap forward in the field of cancer adoptive immunotherapy. [  92 ] [  91 ] [  152 ] Furthermore, synergizing CAR‐T cell engineering with biomaterials is emerging as a promising cancer treatment strategy. Biomaterials have been used as in situ delivery systems, to bypass the obstacle of the extravasation through the tortuous and abnormal vasculature, to recreate a favorable niche for CAR‐T to proliferate and being gradually released, and as artificial APC to improve CAR‐T activation in a contest where the TAAs are difficult to reach and heterogeneous. [  77 ] Despite these encouraging results, there are several gaps between experimental progress and their clinical implementation. Indeed, none of these studies has reached the clinical stage yet. These challenges are due to technical limitations in scale up hydrogel and particles due to batch‐to‐batch variability, high production costs, and sterility maintenance. Long term effects of CAR‐T cell‐biomaterial systems on safety and immunogenicity still remain unclear, raising the need for longer preclinical tests. Additionally, biomaterial‐based stents or needles may cause infection and trauma in the patients, therefore safer strategies are demanded. Furthermore, the lack of standardized manufactory methods and evaluation criteria hinders the regulatory and ethical approval of biomaterial‐ assisted CAR‐T delivery. [  153 ] Lastly, further molecular and biological insights on how CAR‐T cells navigate TME are needed, to shed light on their function and distribution kinetics. A deep understanding of the biomechanical insults occurring in the TME combining genetics, epigenetics, proteomics, and metabolomics, can foster the design classes of CAR‐T that can reach this purpose, target tumor cells, and also persist the tumor‐induced premature exhaustion. This goal can be achieved using the ex vivo biomaterial‐based platforms. Indeed, 2D‐3D hydrogel systems, organoids, and tumors on chips offer the possibility to recapitulate desired characteristics of the TME alone or in concert and observe the response of T cells both from a functional and molecular point of view. These systems are already widely used to select drug combinations that overcome the TME‐induced resistance mechanisms. The immune components though, have been rarely incorporated in these systems [  154 ] The contribution of the mechanical TME to CAR‐T fitness remains poorly understood. 2D and 3D hydrogels, along with microfluidic devices have been proved to be reliable tools to mimic mechanical forces and study their influence in the anti‐cancer response. These systems can integrate specific biochemical and biomechanical characteristics (solid stress, stiffened ECM, fluid pressure) and therefore represent more comprehensive preclinical models to assess the efficacy and safety of CAR‐T cells. [  155 ] Synthetic biology, indeed, can rely on the multi‐omics studies obtained on these systems to develop sensors, synthetic receptors, or synthetic circuits that convert specific mechanic‐ TME‐clues into a favorable CAR‐T cell response that counteracts exhaustion and increases their fitness and efficacy. For instance, the knockout of the YAP and OSR2 mechano‐sensors, or a mechano‐based switch on CAR‐T, or a mechano‐sensor gene circuit that inhibits exhaustions are possible strategies to be explored. More synergistic efforts between these two fields are an open, promising possibility to be explored. Furthermore, the use of biomaterial‐based ex vivo models at the service of CAR‐T cell engineering opens the horizon of a personalized approach where each patient's tumor is used to establish organoids that can be analyzed with multi‐omics technologies. The resulting patient specific‐tumoral and TME features can be incorporated in specific biomaterial‐based 3D systems that can be not only to test used the efficacy of existing CAR‐T but also to develop patient‐ specific CAR‐T that can navigate the prominent patient‐specific TME characteristics and successfully eradicate solid tumors. Although all these combinatorial approaches are worthy of investigation, the high production cost remains one of the biggest challenges. Nevertheless, we envision that the synergy of interdisciplinary efforts such as those from synthetic biology and biomaterials, holds the potential of achieving the ambitious goal of developing efficient CAR‐T therapies for solid tumors. Conflict of Interest The authors declare no conflict of interest. Acknowledgements G.M. was supported by Fondazione AIRC Italy Post‐Doc fellowship 2024 ID 29893‐2023. V.S. was supported by the ERC Starting Grant Synthetic‐TrEX #852012. The figures were created with BioRender.com.  Grazia Marsico  Sudarshan GC  Velia Siciliano 1 N. P. Restifo M. E. Dudley S. A. Rosenberg Nat. Rev. Immunol. 2012 12 269 22437939 10.1038/nri3191 PMC6292222 2 H. J. Jackson S. Rafiq R. J. Brentjens Nat. Rev. Clin. Oncol. 2016 13 370 27000958 10.1038/nrclinonc.2016.36 PMC5529102 3 C. H. June R. S. O'Connor O. U. Kawalekar S. Ghassemi M. C. Milone Science 2018 359 1361 29567707 10.1126/science.aar6711 4 Administration, U. S. F. D. FDA approves tisagenlecleucel for B‐cell ALL, tocilizumab for cytokine release syndrome 2017 https://www.fda.gov/drugs/resources‐information‐approved‐drugs/fda‐approves‐tisagenlecleucel‐b‐cell‐all‐and‐tocilizumab‐cytokine‐release‐syndrome 5 Administration, U. S. F. D. FDA approves axicabtagene ciloleucel for large B‐cell lymphomaf 2017 https://www.fda.gov/drugs/resources‐information‐approved‐drugs/fda‐approves‐axicabtagene‐ciloleucel‐large‐b‐cell‐lymphoma 6 CRISPRMEDICINEnews. CAR‐T Cell Therapy Market Research 2024–2025: Size, Forecasts, Trials, Trends – Approved CAR‐T Therapies, Late‐stage Clinical Trials that Could Reach Commercialization Soon – ResearchAndMarkets.com 7 S. Rafiq C. S. Hackett R. J. Brentjens Nat. Rev. Clin. Oncol. 2020 17 147 31848460 10.1038/s41571-019-0297-y PMC7223338 8 A. Chow K. Perica C. A. Klebanoff J. D. Wolchok Nat. Rev. Clin. Oncol. 2022 19 775 36216928 10.1038/s41571-022-00689-z PMC10984554 9 G. Liu W. Rui X. Zhao X. Lin Cell Mol. Immunol. 2021 18 1085 33785843 10.1038/s41423-021-00655-2 PMC8093220 10 S. J. Kim D. Khadka J. H. Seo Front Immunol 2022 13 882718 35707536 10.3389/fimmu.2022.882718 PMC9189309 11 C. Zhang C. Zhang Q. Zhuang J. Liu X. Liu ACS Synth. Biol. 2022 11 1 35005887 10.1021/acssynbio.1c00256 12 H. Niu P. Zhao W. Sun Acta Biomater. 2023 166 1 37137403 10.1016/j.actbio.2023.04.043 13 H. Kim S. Kim H. Lim A. J. Chung Lab Chip 2024 24 1088 38174732 10.1039/d3lc00622k 14 Bo Zhu H. Yin Di Zhang M. Zhang X. Chao L. Scimeca M‐Ru Wu Cell Mol. Immunol. 2024 21 436 38605087 10.1038/s41423-024-01153-x PMC11061174 15 J. L. Blazquez‐Roman M. Pisani V. Siciliano New Frontiers, Applications of Synthetic Biology V. Singh Academic Press Cambridge, Massachusetts 2022 271 16 G. Bonfá J. Blazquez‐Roman R. Tarnai V. Siciliano Vaccines 2020 8 732 33287392 10.3390/vaccines8040732 PMC7761833 17 F. Caliendo M. Dukhinova V. Siciliano Front Bioeng Biotechnol 2019 7 43 30937303 10.3389/fbioe.2019.00043 PMC6431652 18 L. Xue A. S. Thatte D. Mai R. M. Haley N. Gong X. Han K. Wang N. C. Sheppard C. H. June M. J. Mitchell Nat. Rev. Mater. 2024 9 100 19 M. Xiao Q. Tang S. Zeng Q. Yang X. Yang X. Tong G. Zhu L. Lei S. Li Biomater. Res. 2023 27 47 37194085 10.1186/s40824-023-00369-8 PMC10189985 20 J. Hyun S. J. Kim S.‐D. Cho H.‐W. Kim Biomaterials 2023 297 122101 37023528 10.1016/j.biomaterials.2023.122101 21 K. Adu‐Berchie Y. Liu D. K. Y. Zhang B. R. Freedman J. M. Brockman K. H. Vining B. A. Nerger A. Garmilla D. J. Mooney Nat. Biomed. Eng. 2023 7 1374 37365267 10.1038/s41551-023-01052-y PMC10749992 22 H. H. McAdams A. Arkin Curr. Biol. 2000 10 R318 10801411 10.1016/s0960-9822(00)00440-1 23 G. Bonfá G. Martino A. Sellitto A. Rinaldi F. Tedeschi F. Caliendo L. Melchiorri D. Perna F. Starkey E. Nikolados F. Menolascina V. Siciliano bioRxiv 2025 632034 24 F. Cella G. Perrino F. Tedeschi G. Viero C. Bosia G.‐B. Stan V. Siciliano Nucleic Acids Res. 2023 51 3452 36912077 10.1093/nar/gkad151 PMC10123119 25 V. Siciliano B. DiAndreth B. Monel J. Beal J. Huh K. L. Clayton L. Wroblewska A. McKeon B. D. Walker R. Weiss Nat. Commun. 2018 9 1881 29760420 10.1038/s41467-018-03984-5 PMC5951936 26 G. Gross T. Waks Z. Eshhar Proc Natl Acad Sci U S A 1989 86 10024 2513569 10.1073/pnas.86.24.10024 PMC298636 27 E. J. Wherry M. Kurachi Nat. Rev. Immunol. 2015 15 486 26205583 10.1038/nri3862 PMC4889009 28 A. J. Gunderson T. Yamazaki K. McCarty N. Fox M. Phillips A. Alice T. Blair M. Whiteford D. O'Brien R. Ahmad M. X. Kiely A. Hayman T. Crocenzi M. J. Gough M. R. Crittenden K. H. Young Nat. Commun. 2020 11 1749 32273499 10.1038/s41467-020-15404-8 PMC7145847 29 S. Sukumaran N. Watanabe P. Bajgain K. Raja S. Mohammed W. E. Fisher M. K. Brenner A. M. Leen J. F. Vera Cancer Discov 2018 8 972 29880586 10.1158/2159-8290.CD-17-1298 PMC6428579 30 J. A. Craddock An Lu A. Bear M. Pule M. K. Brenner C. M. Rooney A. E. Foster J. Immunother. 2010 33 780 20842059 10.1097/CJI.0b013e3181ee6675 PMC2998197 31 E. K. Moon C. Carpenito J. Sun L‐C. S. Wang V. Kapoor J. Predina D. J. Powell J. L. Riley C. H. June S. M. Albelda Clin. Cancer Res. 2011 17 4719 21610146 10.1158/1078-0432.CCR-11-0351 PMC3612507 32 K. Adachi Y. Kano T. Nagai N. Okuyama Y. Sakoda K. Tamada Nat. Biotechnol. 2018 36 346 29505028 10.1038/nbt.4086 33 I. Caruana B. Savoldo V. Hoyos G. Weber H. Liu E. S. Kim M. M. Ittmann D. Marchetti G. Dotti Nat. Med. 2015 21 524 25849134 10.1038/nm.3833 PMC4425589 34 S. Shahvali N. Rahiman M. R. Jaafari L. Arabi Drug Deliv Transl Res 2023 13 2041 36840906 10.1007/s13346-023-01308-9 35 L. Zhou Y. L. D. Zheng Y. Zheng Y. Cui L. Qin Z. Tang D. Peng Q. Wu Y. Long Y. Yao N. Wong J. Lau P. Li Mol Ther:Oncol. 2024 32 200817 38882528 10.1016/j.omton.2024.200817 PMC11179089 36 M. Wehrli S. Guinn F. Birocchi A. Kuo Yi Sun R. C. Larson A. J. Almazan I. Scarfò A. A. Bouffard S. R. Bailey P. V. Anekal P. Montero Llopis L. T. Nieman Y. Song K. H. Xu T. R. Berger M. C. Kann M. B. Leick H. Silva D. Salas‐Benito T. Kienka K. Grauwet T. D. Armstrong R. Zhang Q. Zhu J. Fu A. Schmidts F. Korell M. Jan B. D. Choi Clin. Cancer Res. 2024 30 1859 38393682 10.1158/1078-0432.CCR-23-3841 PMC11062832 37 R. Sakemura M. Hefazi E. L. Siegler M. J. Cox D. P. Larson M. J. Hansen C. Manriquez Roman K. J. Schick I. Can E. E. Tapper P. Horvei M. M. Adada E. D. Bezerra L. A. Kankeu Fonkoua M. W. Ruff W. K. Nevala D. K. Walters S. A. Parikh Yi Lin D. F. Jelinek N. E. Kay P. L Bergsagel S. S. Kenderian Blood 2022 139 3708 35090171 10.1182/blood.2021012811 PMC11290597 38 S. L. Ash R. Orha H. Mole M. Dinesh‐Kumar S. P. Lee F. K. Turrell C. M. Isacke J Immunother Cancer 2024 12 008608 10.1136/jitc-2023-008608 PMC10900351 38413223 39 P. Akbari A. Katsarou R. Daghighian L. W. H. G. van Mil E. J. M. Huijbers A. W. Griffioen J. R. van Beijnum Biochim Biophys Acta Rev Cancer 2022 1877 188701 35202772 10.1016/j.bbcan.2022.188701 40 Phase I/II Study of Metastatic Cancer Using Lymphodepleting Conditioning Followed by Infusion of Anti‐VEGFR2 Gene Engineered CD8+ Lymphocytes 2010 41 W. Wang Y. Ma J. Li H.‐S. Shi L.‐Q. Wang F.‐C. Guo J. Zhang D. Li B.‐H. Mo F. Wen T. Liu Y.‐T. Liu Y.‐S. Wang Y.‐Q. Wei Gene Ther. 2013 20 970 23636245 10.1038/gt.2013.19 42 H. Xing X. Yang Y. Xu K. Tang Z. Tian Z. Chen Yu Zhang Z. Xue Q. Rao M. Wang J. Wang Cytotherapy 2021 23 810 34244079 10.1016/j.jcyt.2021.05.008 43 E. Lanitis P. Kosti C. Ronet E. Cribioli G. Rota A. Spill P. Reichenbach V. Zoete D. D. Laniti G. Coukos M. Irving J Immunother Cancer 2021 9 002151 10.1136/jitc-2020-002151 PMC8365827 34389616 44 K. C. Vogt P. C. Silberman Q. Lin J. E. Han A. Laflin H. A. Gellineau D. A. Heller D. A. Scheinberg Sci. Adv. 2025 11 ads3403 10.1126/sciadv.ads3403 PMC11753401 39841845 45 M. P. Avanzi O. Yeku X. Li D. P. Wijewarnasuriya D. G. van Leeuwen K. Cheung H. Park T. J. Purdon A. F. Daniyan M. H. Spitzer R. J. Brentjens Cell Rep. 2018 23 2130 29768210 10.1016/j.celrep.2018.04.051 PMC5986286 46 X. Han P. D. Bryson Y. Zhao G. E. Cinay Si Li Y. Guo N. Siriwon P. Wang Mol. Ther. 2017 25 274 28129121 10.1016/j.ymthe.2016.10.011 PMC5363190 47 Y. Jo J. A. Shim J. W. Jeong H. Kim S. M Lee J. Jeong S. Kim S.‐K. Im D. Choi B. H. Lee Y. H. Kim C. D. Kim C. H. Kim C. Hong Mol. Ther. 2024 32 3879 39169624 10.1016/j.ymthe.2024.08.019 PMC11573615 48 P. Kosti J. W. Opzoomer K. I. Larios‐Martinez R. Henley‐Smith C. L. Scudamore M. Okesola M. Y. M. Taher D. M. Davies T. Muliaditan D. Larcombe‐Young N. Woodman C. E. Gillett S. Thavaraj J. Maher J. N. Arnold Cell Reports Medicine 2021 2 100227 33948568 10.1016/j.xcrm.2021.100227 PMC8080111 49 X. Zhu J. Chen W. Li Y. Xu J. Shan J. Hong Y. Zhao H. Xu J. Ma J. Shen C. Qian Cancer Res. 2024 84 84 37874330 10.1158/0008-5472.CAN-23-1038 50 P. Kosti J. W. Opzoomer K. I. Larios‐Martinez R. Henley‐Smith C. L. Scudamore M. Okesola M. Y. M. Taher D. M. Davies T. Muliaditan D. Larcombe‐Young N. Woodman C. E. Gillett S. Thavaraj J. Maher J. N. Arnold Cell Rep. 2021 2 100227 10.1016/j.xcrm.2021.100227 PMC8080111 33948568 51 Y. Jo J. A. Shim J. W. Jeong H. Kim S. M. Lee J. Jeong S. Kim S. K. Im D. Choi B. H. Lee Y. H. Kim C. D. Kim C. H. Kim C. Hong Mol. Ther. 2024 32 3879 39169624 10.1016/j.ymthe.2024.08.019 PMC11573615 52 C. M. Worsley R. B. Veale E. S. Mayne Human Immunology 2022 83 399 35216847 10.1016/j.humimm.2022.01.014 53 S. Wilkie S. E. Burbridge L. Chiapero‐Stanke A. C. P. Pereira S. Cleary S. J. C. van der Stegen J. F. Spicer D. M. Davies J. Maher J. Biol. Chem. 2010 285 25538 20562098 10.1074/jbc.M110.127951 PMC2919118 54 A. M. Leen S. Sukumaran N. Watanabe S. Mohammed J. Keirnan R. Yanagisawa U. Anurathapan D. Rendon H. E. Heslop C. M. Rooney M. K. Brenner J. F. Vera Mol. Ther. 2014 22 1211 24732709 10.1038/mt.2014.47 PMC4048899 55 H. J. Pegram J. C. Lee E. G. Hayman G. H. Imperato T. F. Tedder M. Sadelain R. J. Brentjens Blood 2012 119 4133 22354001 10.1182/blood-2011-12-400044 PMC3359735 56 X. Ma P. Shou C. Smith Y. Chen H. Du C. Sun N. Porterfield Kren D. Michaud S. Ahn B. Vincent B. Savoldo Y. Pylayeva‐Gupta S. Zhang G. Dotti Y. Xu Nat. Biotechnol. 2020 38 448 32015548 10.1038/s41587-019-0398-2 PMC7466194 57 M. Chmielewski C. Kopecky A. A. Hombach H. Abken Cancer Res. 2011 71 5697 21742772 10.1158/0008-5472.CAN-11-0103 58 B. Hu J. Ren Y. Luo B. Keith R. M. Young J. Scholler Y. Zhao C. H. June Cell Rep. 2017 20 3025 28954221 10.1016/j.celrep.2017.09.002 PMC6002762 59 H. Lust S. Miller R. Karmali S. Chaudhury Blood 2022 140 4508 60 F. L. Locke S. Filosto J. Chou S. Vardhanabhuti R. Perbost P. Dreger B. T. Hill C. Lee P. L. Zinzani N. Kröger A. López‐Guillermo H. Greinix W. Zhang G. Tiwari J. Budka F. M. Marincola C. To M. Mattie M. Schupp P. Cheng A. Bot R. Shen D. Bedognetti H. Miao J. Galon Nat. Med. 2024 30 507 38233586 10.1038/s41591-023-02754-1 PMC10878966 61 M. Binnewies E. W. Roberts K. Kersten V. Chan D. F. Fearon M. Merad L. M. Coussens D. I. Gabrilovich S. Ostrand‐Rosenberg C. C. Hedrick R. H. Vonderheide M. J. Pittet R. K. Jain W. Zou T. K Howcroft E. C. Woodhouse R. A. Weinberg M. F. Krummel Nat. Med. 2018 24 541 29686425 10.1038/s41591-018-0014-x PMC5998822 62 J. Gao W.‐R. Liu Z. Tang J. Fan Y. Shi iLIVER 2022 1 81 40636417 10.1016/j.iliver.2022.06.002 PMC12212606 63 A. R. Sánchez‐Paulete J. Mateus‐Tique G. Mollaoglu S. R. Nielsen A. Marks A. Lakshmi J. A. Khan C. M Wilk L. Pia A. Baccarini M. Merad B. D. Brown Cancer Immunol. Res. 2022 10 1354 36095236 10.1158/2326-6066.CIR-21-1075 PMC10704925 64 R. Parihar C. Rivas M. Huynh B. Omer N. Lapteva L. S. Metelitsa S. M. Gottschalk C. M. Rooney Cancer Immunol. Res. 2019 7 363 30651290 10.1158/2326-6066.CIR-18-0572 PMC7906796 65 G. Parisi J. D. Saco F. B. Salazar J. Tsoi P. Krystofinski C. Puig‐Saus R. Zhang J. Zhou G. C. Cheung‐Lau A. J. Garcia C. S. Grasso R. Tavaré S. Hu‐Lieskovan S. Mackay J. Zalevsky C. Bernatchez A. Diab A. M. Wu B. Comin‐Anduix D. Charych A. Ribas Nat. Commun. 2020 11 660 32005809 10.1038/s41467-019-12901-3 PMC6994533 66 J. T. Sockolosky E. Trotta G. Parisi L. Picton L. L. Su A. C. Le A. Chhabra S. L. Silveria B. M. George I. C. King M. R. Tiffany K. Jude L. V. Sibener D. Baker J. A. Shizuru A. Ribas J. A. Bluestone K. C Garcia Science 2018 359 1037 29496879 10.1126/science.aar3246 PMC5947856 67 Z. Sun Z. Ren K. Yang Z. Liu S. Cao S. Deng L. Xu Y. Liang J. Guo Y. Bian H. Xu J. Shi F. Wang Y.‐X. Fu H. Peng Nat. Commun. 2019 10 3874 31462678 10.1038/s41467-019-11782-w PMC6713724 68 E. J. Wherry M. Kurachi Nat Rev Immunol 2015 15 486 26205583 10.1038/nri3862 PMC4889009 69 X. Liu R. Ranganathan S. Jiang C. Fang J. Sun S. Kim K. Newick A. Lo C. H. June Y. Zhao E. K. Moon Cancer Res. 2016 76 1578 26979791 10.1158/0008-5472.CAN-15-2524 PMC4800826 70 T. N. Yamamoto P.‐H. Lee S. K. Vodnala D. Gurusamy R. J. Kishton Z. Yu A. Eidizadeh R. Eil J. Fioravanti L. Gattinoni J. N. Kochenderfer T. J. Fry B. A. Aksoy J. E. Hammerbacher A. C. Cruz R. M. Siegel N. P. Restifo C. A. Klebanoff J. Clin. Invest. 2019 129 1551 30694219 10.1172/JCI121491 PMC6436880 71 J. Chen I. F. López‐Moyado H. Seo C‐W. J. Lio L. J. Hempleman T. Sekiya A. Yoshimura J. P. Scott‐Browne A. Rao Nature 2019 567 530 30814732 10.1038/s41586-019-0985-x PMC6546093 72 F. Alfei K. Kanev M. Hofmann M. Wu H. E. Ghoneim P. Roelli D. T. Utzschneider M. von Hoesslin J. G. Cullen Y. Fan V. Eisenberg D. Wohlleber K. Steiger D. Merkler M. Delorenzi P. A. Knolle C. J. Cohen R. Thimme B. Youngblood D. Zehn Nature 2019 571 265 31207605 10.1038/s41586-019-1326-9 73 A. C. Scott F. Dündar P. Zumbo S. S. Chandran C. A. Klebanoff M. Shakiba P. Trivedi L. Menocal H. Appleby S. Camara D. Zamarin T. Walther A. Snyder M. R. Femia E. A. Comen H. Y. Wen M. D. Hellmann N. Anandasabapathy Y. Liu N. K. Altorki P. Lauer O. Levy M. S. Glickman J. Kaye D. Betel M. Philip A. Schietinger Nature 2019 571 270 31207604 10.1038/s41586-019-1324-y PMC7698992 74 M. Babamohamadi Cell Death Dis. 2024 15 17 38191571 10.1038/s41419-023-06391-x PMC10774412 75 Ya‐T Qin Ya‐P Li Xi‐W He Xi Wang W.‐Y. Li Yu‐K Zhang Front Immunol 2023 14 1165576 37153571 10.3389/fimmu.2023.1165576 PMC10157406 76 Y. Lin Y. Chen Z. Luo Y.‐L. Wu Nanoscale 2024 16 3226 38284230 10.1039/d3nr05768b 77 G. Huang Z. Tang T. Yin A. Ma H. Gong Y. Zhang H. Pan L. Cai Cell Reports Physical Science 2024 5 102022 78 A. K. Grosskopf L. Labanieh D. D. Klysz G. A. Roth P. Xu O. Adebowale E. C. Gale C. K. Jons J. H. Klich J. Yan C. L. Maikawa S. Correa B. S. Ou A. I. d'Aquino J. R. Cochran O. Chaudhuri C. L. Mackall E. A. Appel Sci. Adv. 2022 8 abn8264 10.1126/sciadv.abn8264 PMC8993118 35394838 79 K. Wang Y. Chen S. Ahn M. Zheng E. Landoni G. Dotti B. Savoldo Z. Han Nature Cancer 2020 1 990 33898999 10.1038/s43018-020-00119-y PMC8061756 80 W. Zhou S. Lei M. Liu D. Li Y. Huang X. Hu J. Yang J. Li M. Fu M. Zhang F. Wang J. Li Ke Men W. Wang Biomaterials 2022 291 121872 36323072 10.1016/j.biomaterials.2022.121872 81 Z. Wang Cell Death Dis. 2025 16 211 40148310 10.1038/s41419-025-07454-x PMC11950394 82 Q. Hu H. Li E. Archibong Q. Chen H. Ruan S. Ahn E. Dukhovlinova Y. Kang Di Wen G. Dotti Z. Gu Nat. Biomed. Eng. 2021 5 1038 33903744 10.1038/s41551-021-00712-1 PMC9102991 83 I. Martin‐Padura P. Marighetti A. Agliano F. Colombo L. Larzabal M. Redrado A.‐M. Bleau C. Prior F. Bertolini A. Calvo Lab Invest 2012 92 952 22546866 10.1038/labinvest.2012.65 84 M. E. Coon S. B. Stephan V. Gupta C. P. Kealey M. T. Stephan Nat. Biomed. Eng. 2020 4 195 31819155 10.1038/s41551-019-0486-0 85 T. Imanishi T. Saito Trends Immunol. 2020 41 200 32035763 10.1016/j.it.2020.01.003 86 L. Labanieh R. G. Majzner C. L. Mackall Nat. Biomed. Eng. 2018 2 377 31011197 10.1038/s41551-018-0235-9 87 H. Li Z. Wang E. A. Ogunnaike Q. Wu G. Chen Q. Hu T. Ci Z. Chen J. Wang Di Wen H. Du J. Jiang J. Sun X. Zhang G. Dotti Z. Gu Natl. Sci. Rev. 2022 9 nwab172 35265340 10.1093/nsr/nwab172 PMC8900686 88 T. T. Smith H. F. Moffett S. B. Stephan C. F. Opel A. G. Dumigan X. Jiang V. G. Pillarisetty S. P. S. Pillai K. D Wittrup M. T. Stephan J. Clin. Invest. 2017 127 2176 28436934 10.1172/JCI87624 PMC5451231 89 E. Pérez Del Río ACS Appl. Mater. Interfaces 2024 16 50139 39285613 10.1021/acsami.4c06183 PMC11440455 90 K. M. Cappell J. N. Kochenderfer Nat. Rev. Clin. Oncol. 2021 18 715 34230645 10.1038/s41571-021-00530-z 91 A. Daei Sorkhabi L. Mohamed Khosroshahi A. Sarkesh A. Mardi A. Aghebati‐Maleki L. Aghebati‐Maleki B. Baradaran Front Immunol 2023 14 1113882 37020537 10.3389/fimmu.2023.1113882 PMC10067596 92 A. Mitra A. Barua L. Huang S. Ganguly Q. Feng B. He Front Immunol 2023 14 1188049 37256141 10.3389/fimmu.2023.1188049 PMC10225594 93 Y. Xue J. Che X. Ji Y. Li J. Xie X. Chen Chem. Soc. Rev. 2022 51 1766 35170589 10.1039/d1cs00786f 94 P. Hadley Y. Chen L. Cline Z. Han Q. Tang X. Huang T. Desai Nat. Protoc. 2023 18 3289 37853157 10.1038/s41596-023-00887-8 PMC10775953 95 Y. Luo Ze Chen M. Sun B. Li F. Pan A. Ma J. Liao T. Yin X. Tang G. Huang B. Zhang H. Pan M. Zheng L. Cai Biomaterials 2022 281 121341 34995901 10.1016/j.biomaterials.2021.121341 96 L. Tang Y. Zheng M. B. Melo L. Mabardi A. P. Castaño Y.‐Q Xie N. Li S. B. Kudchodkar H. C. Wong E. K. Jeng M. V. Maus D. J. Irvine Nat. Biotechnol. 2018 36 707 29985479 10.1038/nbt.4181 PMC6078803 97 N. Siriwon Y. J Kim E. Siegler X. Chen J. A. Rohrs Y. Liu P. Wang Cancer Immunol. Res. 2018 6 812 29720380 10.1158/2326-6066.CIR-17-0502 98 F. Zhang S. B. Stephan C. I. Ene T. T. Smith E. C. Holland M. T. Stephan Cancer Res. 2018 78 3718 29760047 10.1158/0008-5472.CAN-18-0306 PMC6030470 99 N. T. Nguyen Y. S. Youn Adv. Funct. Mater. 2025 n/a 2426047 100 W. Mao H. S. Yoo Biomater. Res. 2024 28 0086 39323561 10.34133/bmr.0086 PMC11423863 101 F. Pfister L. R. Carnell L. Löffler P. Boosz N. Schaft J. Dörrie R. Stein M. Lenz E. Spiecker C. M. Huber S. Haddadin C. Berking C. Alexiou C. Janko MedComm 2020 2025 6 70039 10.1002/mco2.70039 PMC11702464 39764559 102 H. Kim Y. Baek T. Ha D. Choi W. J. Lee Y. Cho J. Park S. Kim J. Doh Small 2023 19 2301377 10.1002/smll.202301377 37491793 103 S. Nardecchia P. Sánchez‐Moreno J. de Vicente J. A. Marchal H. Boulaiz Nanomaterials 2019 9 191 30717386 10.3390/nano9020191 PMC6409767 104 H. Li X. Yang Z. Wang W. She Yi Liu L. Huang P. Jiang ACS Nano 2023 17 11749 37319120 10.1021/acsnano.3c02592 105 W. Wu Small 2024 20 2401299 106 Q. Zou Ke Liao G. Li X. Huang Y. Zheng G. Yang M. Luo E. Y. Xue C. Lan S. Wang Y. Shen D. Luo D. K. P. Ng Q. Liu Adv. Mater. 2025 37 2407425 38899741 10.1002/adma.202407425 PMC11733712 107 X. Kang N. Mita L. Zhou S. Wu Z. Yue R. J. Babu P. Chen Pharmaceutics 2024 16 1228 39339264 10.3390/pharmaceutics16091228 PMC11435308 108 H. T. Nia L. L. Munn R. K. Jain Science 2020 370 10.1126/science.aaz0868 PMC8274378 33122355 109 R. Basu M. Huse Trends Cell Biol. 2017 27 241 27986534 10.1016/j.tcb.2016.10.005 PMC5367987 110 C. Hivroz M. Saitakis Front Immunol 2016 7 46 26913033 10.3389/fimmu.2016.00046 PMC4753286 111 M. Huse Nat. Rev. Immunol. 2017 17 679 28757604 10.1038/nri.2017.74 PMC6312705 112 H. Du J. M. Bartleson S. Butenko V. Alonso W. F. Liu D. A. Winer M. J. Butte Nat. Rev. Immunol. 2023 23 174 35974148 10.1038/s41577-022-00761-w PMC9379893 113 J. A. Pai M. D. Hellmann J. L. Sauter M. Mattar H. Rizvi H. J. Woo N. Shah E. M. Nguyen F. Z. Uddin A. Quintanal‐Villalonga J. M. Chan P. Manoj V. Allaj M. K. Baine U. K. Bhanot M. Jain I. Linkov F. Meng D. Brown J. E. Chaft A. J. Plodkowski M. Gigoux H. H. Won T. Sen D. K. Wells M. T. A. Donoghue E. de Stanchina J. D. Wolchok B. Loomis T. Merghoub Cancer Cell 2023 41 776 37001526 10.1016/j.ccell.2023.03.009 PMC10563767 114 J. Zhang J. Li Y. Hou Y. Lin H. Zhao Y. Shi K. Chen C. Nian J. Tang L. Pan Y. Xing H. Gao B. Yang Z. Song Y. Cheng Y. Liu M. Sun Y. Linghu J. Li Cell 2024 187 3409 38744281 10.1016/j.cell.2024.04.023 115 S. Piccolo T. Panciera P. Contessotto M. Cordenons Nature Cancer 2023 4 9 36564601 10.1038/s43018-022-00473-z PMC7614914 116 K. M. Young C. A. Reinhart‐King Curr. Opin. Cell Biol. 2023 83 102208 37473514 10.1016/j.ceb.2023.102208 PMC10527818 117 C. Li J. B. Holman Z. Shi B. Qiu W. Ding Materials Today Bio 2023 21 100724 10.1016/j.mtbio.2023.100724 PMC10359640 37483380 118 X. Liu Microsyst. Nanoeng. 2021 7 50 34567763 10.1038/s41378-021-00277-8 PMC8433302 119 T. I. Maulana C. Teufel M. Cipriano J. Roosz L. Lazarevski F. E. van den Hil L. Scheller V. Orlova A. Koch M. Hudecek M. Alb P. Loskill Cell Stem Cell 2024 31 989 38754430 10.1016/j.stem.2024.04.018 120 M. J. Mosquera S. Kim R. Bareja Z. Fang S. Cai H. Pan M. Asad M. L. Martin M. Sigouros F. M. Rowdo S. Ackermann J. Capuano J. Bernheim C. Cheung A. Doane N. Brady R. Singh D. S. Rickman V. Prabhu J. E. Allen L. Puca A. F. Coskun M. A. Rubin H. Beltran J. M. Mosquera O. Elemento A. Singh Adv. Mater. 2022 34 2100096 10.1002/adma.202100096 PMC8820841 34676924 121 S. B. Shah C. R. Carlson K. Lai Z. Zhong G. Marsico K. M. Lee N. E. Félix Vélez E. B. Abeles M. Allam T. Hu L. D. Walter K. E. Martin K. Gandhi S. D. Butler R. Puri A. L. McCleary‐Wheeler W. Tam O. Elemento K. Takata C. Steidl D. W. Scott L. Fontan H. Ueno B. D. Cosgrove G. Inghirami A. J. García A. F. Coskun J. L. Koff A. Melnick A. Singh Nat. Mater. 2023 22 511 36928381 10.1038/s41563-023-01495-3 PMC10069918 122 A. Massey J. Stewart C. Smith C. Parvini M. McCormick K. Do A. X. Cartagena‐Rivera Nat. Rev. Phys. 2024 6 269 38706694 10.1038/s42254-024-00707-2 PMC11066734 123 F. S. Majedi M. M. Hasani‐Sadrabadi T. J. Thauland S. Li L‐S. Bouchard M. J. Butte Biomaterials 2020 252 120058 32413594 10.1016/j.biomaterials.2020.120058 PMC7307918 124 D. E. Kuczek A. M. H. Larsen M.‐L. Thorseth M. Carretta A. Kalvisa M. S. Siersbæk A. M. C. Simões A. Roslind L. H. Engelholm E. Noessner M. Donia I. M. Svane P. T. Straten L. Grøntved D. H. Madsen J Immunother Cancer 2019 7 68 30867051 10.1186/s40425-019-0556-6 PMC6417085 125 K. T. Bashour A. Gondarenko H. Chen K. Shen X. Liu M. Huse J. C. Hone L. C. Kam Proc. Natl. Acad. Sci. USA 2014 111 2241 24469820 10.1073/pnas.1315606111 PMC3926067 126 V. Bhingardive A. Kossover M. Iraqi B. Khand G. Le Saux A. Porgador M. Schvartzman Nano Lett. 2021 21 4241 33989498 10.1021/acs.nanolett.1c00245 127 E. Judokusumo E. Tabdanov S. Kumari M. L. Dustin L. C. Kam Biophys. J. 2012 102 L5 22339876 10.1016/j.bpj.2011.12.011 PMC3260692 128 R. S. O'Connor R. S. O'Connor X. Hao K. Shen K. Bashour T. Akimova W. W. Hancock L. C. Kam M. C. Milone J. Immunol. 2012 189 1330 22732590 10.4049/jimmunol.1102757 PMC3401283 129 M. Saitakis S. Dogniaux C. Goudot N. Bufi S. Asnacios M. Maurin C. Randriamampita A. Asnacios C. Hivroz Elife 2017 6 23190 10.7554/eLife.23190 PMC5464771 28594327 130 A. Al‐K Yassin C. Ureña Martin G. Le Saux A. Pandey S. Tzadka E. Toledo J. J. Pandit T. Sherf I. Nusbaum B. Bhattachrya R. Banerji Y. Greenshpan M. A. Abu Ahmad O. Radinsky M. Sklartz R. Gazit M. Elkabets S. Ghassemi O. Cohen M. Schvartzman A. Porgador Adv. Mater. 2025 37 2412482 10.1002/adma.202412482 40348587 131 A. H. Lippert I. B. Dimov A. K. Winkel J. Humphrey J. McColl K. Y. Chen A. M. Santos E. Jenkins K. Franze S. J. Davis D. Klenerman Biophys. J. 2021 120 35 33248128 10.1016/j.bpj.2020.11.021 PMC7820804 132 K. P. Meng F. S. Majedi T. J. Thauland M. J. Butte J. Exp. Med. 2020 217 20200053 10.1084/jem.20200053 PMC7398163 32484502 133 D. J. Yuan L. Shi L. C. Kam Biomaterials 2021 273 120797 33878536 10.1016/j.biomaterials.2021.120797 PMC8214245 134 J. Zhang J. Li Y. Hou Y. Lin H. Zhao Y. Shi K. Chen C. Nian J. Tang L. Pan Y. Xing H. Gao B. Yang Z. Song Cell 2024 187 3409 38744281 10.1016/j.cell.2024.04.023 135 C. Rae F. Amato C. Braconi Int. J. Mol. Sci. 2021 22 10.3390/ijms22073483 PMC8038043 33801782 136 X.‐Y. Tang S. Wu Da Wang C. Chu Y. Hong M. Tao H. Hu M. Xu X. Guo Y. Liu Signal Transduction, Targeted Therapy 2022 7 168 35610212 10.1038/s41392-022-01024-9 PMC9127490 137 S. Musah H. Arzaghi Nat. Methods 2024 21 1575 39179910 10.1038/s41592-024-02393-5 PMC11479998 138 Le Tong W. Cui B. Zhang P. Fonseca Q. Zhao P. Zhang B. Xu Q. Zhang Z. Li B. Seashore‐Ludlow Y. Yang L. Si A. Lundqvist Med 2024 5 1351 39341206 10.1016/j.medj.2024.08.010 139 B. L. LeSavage R. A. Suhar N. Broguiere M. P. Lutolf S. C. Heilshorn Nat. Mater. 2022 21 143 34385685 10.1038/s41563-021-01057-5 PMC12276900 140 R. Zheng K. Shen S. Liang Y. Lyu S. Zhang H. Dong Y. Li Y. Han X. Zhao Y. Zhang P. Wang R. Meng S. Bai J. Yang G. Lu J. Li A. Yang R. Zhang Bo Yan Cell Mol. Immunol. 2024 21 1491 39472748 10.1038/s41423-024-01228-9 PMC11606952 141 L. Yu Z. Li H. Mei W. Li D. Chen L. Liu Z. Zhang Y. Sun F. Song W. Chen W. Huang Clin Transl Immunology 2021 10 1248 10.1002/cti2.1248 PMC7847802 33552510 142 F. Jacob R. D. Salinas D. Y. Zhang P. T. T. Nguyen J. G. Schnoll S. Z. H. Wong R. Thokala S. Sheikh D. Saxena S. Prokop D.‐A. Liu X. Qian D. Petrov T. Lucas H. I Chen J. F. Dorsey K. M. Christian Z. A. Binder M. Nasrallah S. Brem D. M. O'Rourke G‐Li Ming H. Song Cell 2020 180 188 31883794 10.1016/j.cell.2019.11.036 PMC7556703 143 M. Logun X. Wang Y. Sun S. J. Bagley N. Li A. Desai D. Y. Zhang M. P. Nasrallah E. L. L. Pai B. S. Oner G. Plesa D. Siegel Z. A. Binder G. L. Ming H. Song D. M. O'Rourke Cell Stem Cell 2025 32 181 39657679 10.1016/j.stem.2024.11.010 PMC11808387 144 M. Russo C. M. Cejas G. Pitingolo Prog Mol Biol Transl Sci 2022 187 163 35094774 10.1016/bs.pmbts.2021.07.022 145 R. M. Visalakshan M. K. Lowrey M. G. C. Sousa H. R. Helms A. Samiea C. E. Schutt J. M. Moreau L. E. Bertassoni Front Immunol 2023 14 1162905 37081897 10.3389/fimmu.2023.1162905 PMC10110941 146 X. Mu Y. S. Zhang Engineering Technologies, Clinical Translation M. M. Amiji L.S. Milane 2022 Academic Press Cambridge, Massachusetts 155 147 K. Paterson S. Paterson T. Mulholland S. B. Coffelt M. Zagnoni IEEE Open Journal of Engineering in Medicine, Biology 2022 3 86 35813488 10.1109/OJEMB.2022.3178302 PMC9252335 148 L. Grunewald T. Lam L. Andersch A. Klaus S. Schwiebert A. Winkler A. Gauert A. I. Heeren‐Hagemann K. Astrahantseff F. Klironomos A. Thomas H. E. Deubzer A. G. Henssen A. Eggert J. H. Schulte K. Anders L. Kloke A. Künkele Front Immunol 2021 12 689697 34267756 10.3389/fimmu.2021.689697 PMC8276678 149 J. Zhang H. Tavakoli L. Ma X. Li L. Han X. Li Adv. Drug Delivery Rev. 2022 187 114365 10.1016/j.addr.2022.114365 35667465 150 W. Wang Y. X. Fu Cell Stem Cell 2024 31 281 38458173 10.1016/j.stem.2024.02.002 151 M. Tang Y. Qu P. He E. Yao T. Guo Di Yu N. Zhang W. Kiratitanaporn Y. Sun L. Liu Y. Wang S. Chen Materials Today Bio 2024 26 101077 10.1016/j.mtbio.2024.101077 PMC11099333 38765247 152 G. Liu W. Rui X. Zhao X. Lin Cell Mol. Immunol. 2021 18 1085 33785843 10.1038/s41423-021-00655-2 PMC8093220 153 V. Albarrán‐Fernández L. Angelats J. Delgado A. Gros Á. Urbano‐Ispizua S. Guedan A. Prat Nat. Commun. 2025 16 1144 39880825 10.1038/s41467-025-56527-0 PMC11779857 154 S. R. Jeong M. Kang Int. J. Mol. Sci. 2023 24 14609 155 Z. Luo X. Yao M. Li De Fang Y. Fei Z. Cheng Y. Xu Bo Zhu Adv Drug Deliv Rev 2022 185 114301 35439570 10.1016/j.addr.2022.114301 156 S. Sukumaran N. Watanabe P. Bajgain K. Raja S. Mohammed W. E. Fisher M. K. Brenner A. M. Leen J. F. Vera Cancer discovery 2018 8 972 29880586 10.1158/2159-8290.CD-17-1298 PMC6428579 157 H. Seo J. Chen E. González‐Avalos D. Samaniego‐Castruita A. Das Y. H. Wang I. F. López‐Moyado R. O. Georges W. Zhang A. Onodera C.‐J. Wu L.‐F. Lu P. G. Hogan A. Bhandoola A. Rao Proc. Natl. Acad. Sci. USA 2019 116 12410 31152140 10.1073/pnas.1905675116 PMC6589758 158 S. Rafiq O. O. Yeku H. J. Jackson T. J. Purdon D. G. van Leeuwen D. J. Drakes M. Song M. M. Miele Z. Li P. Wang Su Yan J. Xiang X. Ma V. E. Seshan R. C. Hendrickson C. Liu R. J. Brentjens Nat. Biotechnol. 2018 36 847 30102295 10.1038/nbt.4195 PMC6126939 159 Li Tang Y. Zheng M. B. Melo L. Mabardi A. P. Castaño Yu‐Q Xie Na Li S. B. Kudchodkar H. C. Wong E. K. Jeng M. V. Maus D. J. Irvine Nat. Biotechnol. 2018 36 707 29985479 10.1038/nbt.4181 PMC6078803 160 Ze Chen H. Pan Y. Luo T. Yin B. Zhang J. Liao M. Wang X. Tang G. Huang G. Deng M. Zheng L. Cai Small 2021 17 2007494 10.1002/smll.202007494 33711191 161 Q. Zeng B. Xu J. Deng K. Shang Z. Guo S. Wu Colloids, Surfaces B: Biointerfaces 2024 239 113977 38776594 10.1016/j.colsurfb.2024.113977 162 R. Zheng K. Shen S. Liang Y. Lyu S. Zhang H. Dong Y. Li Y. Han X. Zhao Y. Zhang P. Wang R. Meng S. Bai J. Yang G. Lu J. Li A. Yang R. Zhang B. Yan Cell Mol. Immunol. 2024 21 1491 39472748 10.1038/s41423-024-01228-9 PMC11606952 163 F. Jacob R. D. Salinas D. Y. Zhang P. T. T. Nguyen J. G. Schnoll S. Z. H. Wong R. Thokala S. Sheikh D. Saxena S. Prokop Di‐Ao Liu X. Qian D. Petrov T. Lucas H. I Chen J. F. Dorsey K. M. Christian Z. A. Binder M. Nasrallah S. Brem D. M. O'Rourke G‐Li Ming H. Song Cell 2020 180 188 31883794 10.1016/j.cell.2019.11.036 PMC7556703 164 J. Lee S.‐E. Kim D. Moon J. Doh Lab Chip 2021 21 2142 33913456 10.1039/d1lc00182e ",
  "metadata": {
    "Title of this paper": "Phase I/II Study of Metastatic Cancer Using Lymphodepleting Conditioning Followed by Infusion of Anti‐VEGFR2 Gene Engineered CD8+ Lymphocytes",
    "Journal it was published in:": "Small (Weinheim an Der Bergstrasse, Germany)",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490179/"
  }
}