{
  "title": "Paper_785",
  "abstract": "pmc J Am Soc Nephrol J Am Soc Nephrol 612 jnephrol JASN Journal of the American Society of Nephrology : JASN 1046-6673 1533-3450 American Society of Nephrology PMC11452134 PMC11452134.1 11452134 11452134 39352862 10.1681/ASN.0000000000000457 JASN-2024-000385 1 3 Mechanisms of Kidney Diseases Neutralizing Antibodies Targeting BK Polyomavirus Clinical Importance and Therapeutic Potential for Kidney Transplant Recipients https://orcid.org/0000-0001-6884-2456 Helle Francois  1 Aubry Aurélien  1  2 https://orcid.org/0000-0003-2406-5223 Morel Virginie  1  2 https://orcid.org/0009-0001-0310-4150 Descamps Véronique  1  2 https://orcid.org/0000-0002-5456-6654 Demey Baptiste  1  2 https://orcid.org/0000-0002-8677-6349 Brochot Etienne  1  2 1 2 Correspondence: francois.helle@u-picardie.fr 10 2024 09 7 2024 35 10 472222 1425 1433 01 10 2025 01 10 2025 05 10 2024 01 10 2025 Copyright © 2024 The Author(s). Published by Wolters Kluwer Health, Inc. on behalf of the American Society of Nephrology 2024 https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the Creative Commons Attribution License 4.0 (CCBY) Most of the world's adult population is latently infected by the BK polyomavirus. It causes asymptomatic infection in healthy individuals but emerged as a threat to kidney transplant recipients because of virus-associated nephropathy caused by immunosuppressive therapy. In these conditions, when a functional cellular response is impaired by immunosuppression, neutralizing antibodies may play a major role because they can directly prevent infection of target cells, independently of cell-mediated immunity, by binding to the viral particles. Studying the contribution of anti-BK virus neutralizing antibodies in viral control has long been hampered by the lack of convenient in vitro kidney transplantation nephropathy Université de Picardie Jules Verne Francois Helle Centre Hospitalier Universitaire Amiens Etienne Brochot Université de Picardie Jules Verne Centre Hospitalier Universitaire Amiens pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes pmc-license-ref CC BY OPEN-ACCESS TRUE Read-along YES Introduction The BK virus is the first polyomavirus isolated in humans. 1 2 3 4 5 10 6 The BK virus genome is composed of two highly conserved regions coding for early and late proteins, separated by a noncoding control region. 5 1 7 8 Figure 1 Neutralization assays for BK virus. On the basis of nucleotide sequences, BK virus isolate genomes are categorized into four genotypes (I, II, III, and IV), two of which being divided into subtypes and subgroups (Ia, Ib1, Ib2, Ic, IVa1, IVa2, IVb1, IVb2, IVc1, and IVc2). 9 10 11 12 15 Serum antibodies can be detected in more than 80% of the individuals by the age of 21 years, suggesting that most of the world's adult population is latently infected. 4 16 17 18 in vitro in vivo de novo 19 Studying the contribution of neutralizing antibodies to BK virus control or reactivation has long been hampered by the lack of convenient in vitro 12 20 Anti-BK Virus Neutralization Assays A standardized and approved assay for the detection of anti-BK virus antibodies is not commercially available. However, different assays, such as hemagglutination inhibition test, ELISA, or multiplex immunoassays, have been developed to determine the presence of BK virus–specific antibodies in patient samples. 21 28 29 The first test to detect anti-BK virus neutralizing antibodies was described in 1986 by Flaegstad et al. 1 30 31 1 12 20 in vitro 20 31 BK Virus Serotypes Using pseudovirions and considering a definition of at least a 100-fold difference in neutralizing titer between two BK virus variants for at least one human serum sample, Pastrana et al. 12 DQ989796 Supplemental Figure 1 12 in vivo 12 BK Virus Neutralizing Antibody Serostatus and Risk of BK Virus–Associated Nephropathy Using serotype I infectious viruses, Abend et al. 31 P P de novo 32 41 P However, using pseudoviruses and analyzing sera from 69 donor–recipient pairs, Solis et al. P 14 10 P P Nonetheless, the rise of BK virus neutralizing antibody titers may not be the only effector of viral control/clearance. Indeed, Gras et al. 42 et al. 5 43 18 44 BK Virus Escape from Neutralizing Antibodies In 2018, Peretti et al. 34 45 46 47 49 50 51 34 et al. 52 53 Alternative mechanisms to evade neutralizing antibodies could also be exploited by BK virus. For instance, in vitro 54 en bloc 55 56 Human Intravenous Igs to Prevent BK Virus–Associated Nephropathy Studies described above support the potential benefit of administering neutralizing antibodies as a preventive or therapeutic strategy against BK virus infection. In this regard, several groups have considered injection of intravenous Igs (IVIG) to treat kidney allograft recipients with BK virus–associated nephropathy. IVIG is a blood product rich in IgG, derived from pooled human plasma of thousands of donors, which has been shown to be effective in the treatment of acute rejection as well as in the prevention and treatment of viral infections in patients receiving transplant. 57 13 15 58 61 10 et al. 14 15 62 The potential benefit of IVIG in the treatment of kidney allograft recipients was first described in 2006. 57 63 71 et al. 72 P et al. 1 10 n 2 10 n 3 10 n 62 P All these studies provide proof-of-concept evidence that IVIG administration could prevent BK virus DNAemia and associated nephropathy. However, they must be interpreted cautiously because of major methodological limitations, such as the lack of a control arm, small sample sizes, heterogeneous conventional therapy and/or IVIG doses (from 2 g/kg divided over 2–5 days to 150 mg/kg every 2 weeks), as well as the concomitant use of other antiviral strategies and/or a parallel reduction of immunosuppression. Some reports also argue against a beneficial use of IVIG in BK virus treatment. 73 76 NCT05325008 NCT04222023 1 NCT05325008 NCT04222023 10 15 Table 1 Randomized clinical trials evaluating the efficacy of intravenous Igs or monoclonal neutralizing antibodies against BK virus–associated nephropathy National Clinical Trial Number Trial Description Interventions Recruitment Criteria Primary Outcome Measures  NCT05325008 Treatment N IVIG+Immunosuppression reduction/modification versus immunosuppression reduction/modification Kidney or pancreas–kidney transplant recipients with BK virus DNAemia (≥5×10 3 Composite ordinal outcome on the basis of all-cause death, allograft loss, eGFR decline, acute allograft rejection or BK virus load ≥10 3  NCT04222023 Prevention N IVIG versus no drug Kidney transplant recipients (including patients receiving multiple-organ transplant) with nondetectable BK virus DNAemia and neutralizing antibody titers ≤4 log 10 The incidence of BK virus DNAemia (≥10 4  NCT04294472 Treatment N MAU868 versus placebo Kidney or pancreas–kidney transplant recipients with BK virus DNAemia (≥10 4 7 3 Time (weeks) to decrease of BK virus DNAemia by 1 log 10  NCT05769582 Treatment N AntiBKV versus placebo Kidney transplant recipients with BK virus DNAemia (≥10 4 3 Proportion of participants without detectable BK virus DNAemia at day 141 IVIG, intravenous Igs. Monoclonal Neutralizing Antibodies to Prevent BK Virus–Associated Nephropathy To specifically target BK virus, several teams also generated monoclonal neutralizing antibodies. 77 84 Supplemental Figure 2 78 81 Amplyx Pharmaceuticals and then Vera Therapeutics obtained exclusive global rights from Novartis for one of these monoclonal neutralizing antibodies called MAU868, in 2019 and 2021, respectively. MAU868 is a human IgG1 mAb with high pM binding affinity and sub-nM neutralizing activity against the different BK virus genotypes (EC 50 μ 90 μ 85 Supplemental Figure 2 NCT04294472 1 86 10 10 Another monoclonal neutralizing antibody (AntiBKV/MTX-005) developed by Memo Therapeutics recently reached the clinical trial stage. Memo Therapeutics previously patented two monoclonal neutralizing antibodies, 319C07 and 336F07, that broadly neutralize all BK virus serotypes by binding to conformational epitopes (EC 50 82 Supplemental Figure 2 Supplemental Figure 2 NCT05358106 NCT05769582 1 Other antibodies with novel structural features and/or improved properties may be patentable in the future. 87 Vaccine Induction of Neutralizing Antibodies to Prevent BK Virus–Associated Nephropathy Another strategy to protect kidney transplant recipients from BK virus–associated nephropathy would be to administer a vaccine while a patient is on the organ transplant wait list so that high levels of neutralizing antibodies will be present at the time of transplant. This approach was investigated by Christopher Buck, Diana Pastrana, and coworkers at the National Cancer Institute (Bethesda). 12 20 88 89 Escherichia coli 89 -µ 10 10 12 µ 10 89 Conclusion In the past decade, major progress has been made regarding the understanding of the role played by neutralizing antibodies in prevention of BK virus–associated nephropathy. This could help to anticipate the risk of nephropathy and improve patient monitoring. Recent data also support the potential benefit of administering broadly neutralizing antibodies, such as IVIG or monoclonal neutralizing antibodies, as a therapeutic strategy against BK virus infection. Because of potential escape mutations that accumulate over time, a mixture of neutralizing antibodies recognizing distinct epitopes may be required for optimal therapy. Bispecific antibodies could be used as an alternative strategy but also to broaden the genotype specificity. Besides, other bioengineering approaches on the basis of antibody fragments, such as antigen-binding fragments, single-chain variable fragments, or nanobodies, could improve the stability and solubility of these inhibitors and their bioavailability to the intragraft tubulointerstitial compartment. 90 91 in vivo Supplementary Material Acknowledgments We thank the editors and reviewers for their constructive comments. Disclosures Disclosure forms, as provided by each author, are available with the online version of the article at http://links.lww.com/JSN/E764 Funding F. Helle: Université de Picardie Jules Verne. E. Brochot: Centre Hospitalier Universitaire Amiens. Author Contributions Visualization: Writing – original draft: Writing – review & editing: Supplemental Material This article contains the following supplemental material online at http://links.lww.com/JSN/E763 Supplemental Figure 1 Supplemental Figure 2 References 1. Gardner SD Field AM Coleman DV Hulme B New human papovavirus (B.K.) isolated from urine after renal transplantation Lancet. 1971 1 7712 1253 1257 10.1016/S0140-6736(71)91776-4 4104714 2. Husseiny MI Anastasi B Singer J Lacey SF A comparative study of Merkel cell, BK and JC polyomavirus infections in renal transplant recipients and healthy subjects J Clin Virol. 2010 49 2 137 140 10.1016/j.jcv.2010.06.017 20667770 PMC2943003 3. Zhong S Zheng HY Suzuki M Age-related urinary excretion of BK polyomavirus by nonimmunocompromised individuals J Clin Microbiol. 2007 45 1 193 198 10.1128/JCM.01645-06 17093017 PMC1828952 4. Chong S Antoni M Macdonald A Reeves M Harber M Magee CN BK virus: current understanding of pathogenicity and clinical disease in transplantation Rev Med Virol. 2019 29 4 e2044 10.1002/rmv.2044 30958614 5. Helle F Brochot E Handala L Biology of the BKPyV: an update Viruses. 2017 9 11 e327 10.3390/v9110327 PMC5707534 29099746 6. Kotton CN Kamar N Wojciechowski D The second International consensus Guidelines on the management of BK polyomavirus in kidney transplantation [published online ahead of print Apr 12, 2024] Transplantation. 10.1097/TP.0000000000004976 PMC11335089 38605438 7. Hurdiss DL Frank M Snowden JS Macdonald A Ranson NA The structure of an infectious human polyomavirus and its interactions with cellular receptors Structure. 2018 26 6 839 847.e3 10.1016/j.str.2018.03.019 29706532 PMC5992339 8. Hurdiss DL Morgan EL Thompson RF New structural insights into the genome and minor capsid proteins of BK polyomavirus using cryo-electron microscopy Structure. 2016 24 4 528 536 10.1016/j.str.2016.02.008 26996963 PMC4826271 9. Morel V Martin E Francois C A simple and reliable strategy for BK virus subtyping and subgrouping J Clin Microbiol. 2017 55 4 1177 1185 10.1128/JCM.01180-16 28151406 PMC5377845 10. Zheng HY Nishimoto Y Chen Q Relationships between BK virus lineages and human populations Microbes Infect. 2007 9 2 204 213 10.1016/j.micinf.2006.11.008 17208484 11. Egli A Infanti L Dumoulin A Prevalence of polyomavirus BK and JC infection and replication in 400 healthy blood donors J Infect Dis. 2009 199 6 837 846 10.1086/597126 19434930 12. Pastrana DV Ray U Magaldi TG Schowalter RM Cuburu N Buck CB BK polyomavirus genotypes represent distinct serotypes with distinct entry tropism J Virol. 2013 87 18 10105 10113 10.1128/JVI.01189-13 23843634 PMC3754014 13. Randhawa P Pastrana DV Zeng G Commercially available immunoglobulins contain virus neutralizing antibodies against all major genotypes of polyomavirus BK Am J Transplant. 2015 15 4 1014 1020 10.1111/ajt.13083 25736704 PMC8320700 14. Solis M Velay A Porcher R Neutralizing antibody-mediated response and risk of BK virus-associated nephropathy J Am Soc Nephrol. 2018 29 1 326 334 10.1681/ASN.2017050532 29042457 PMC5748919 15. Velay A Solis M Benotmane I Intravenous immunoglobulin administration significantly increases BKPyV genotype-specific neutralizing antibody titers in kidney transplant recipients Antimicrob Agents Chemother. 2019 63 8 e00393-19 10.1128/AAC.00393-19 31160292 PMC6658761 16. Lu LL Suscovich TJ Fortune SM Alter G Beyond binding: antibody effector functions in infectious diseases Nat Rev Immunol. 2018 18 1 46 61 10.1038/nri.2017.106 29063907 PMC6369690 17. Trinick TR Laker MF Measurement of urinary immunoglobulins G, A and M by an enzyme linked immunosorbent assay (ELISA) Clin Chim Acta 1984 139 1 113 117 10.1016/0009-8981(84)90199-2 6723069 18. Aubry A Demey B Castelain S Helle F Brochot E The value and complexity of studying cellular immunity against BK Polyomavirus in kidney transplant recipients J Clin Virol. 2024 171 105656 10.1016/j.jcv.2024.105656 38412681 19. Lorentzen EM Henriksen S Rinaldo CH Modelling BK Polyomavirus dissemination and cytopathology using polarized human renal tubule epithelial cells PLoS Pathog. 2023 19 8 e1011622 10.1371/journal.ppat.1011622 37639485 PMC10491296 20. Pastrana DV Brennan DC Cuburu N Neutralization serotyping of BK polyomavirus infection in kidney transplant recipients PLoS Pathog. 2012 8 4 e1002650 10.1371/journal.ppat.1002650 22511874 PMC3325208 21. Gardner SD Prevalence in England of antibody to human polyomavirus (B.K.) Br Med J. 1973 1 5845 77 78 10.1136/bmj.1.5845.77 20791873 PMC1588750 22. Flaegstad T Nilsen I Skar AG Traavik T Antibodies against BK virus in renal transplant recipient sera: results with five different methods indicate frequent reactivations Scand J Infect Dis. 1991 23 3 287 291 10.3109/00365549109024312 1652788 23. Viscidi RP Rollison DE Viscidi E Serological cross-reactivities between antibodies to simian virus 40, BK virus, and JC virus assessed by virus-like-particle-based enzyme immunoassays Clin Diagn Lab Immunol. 2003 10 2 278 285 10.1128/cdli.10.2.278-285.2003 12626455 PMC150538 24. Moens U Van Ghelue M Song X Ehlers B Serological cross-reactivity between human polyomaviruses Rev Med Virol. 2013 23 4 250 264 10.1002/rmv.1747 23650080 25. Kardas P Leboeuf C Hirsch HH Optimizing JC and BK polyomavirus IgG testing for seroepidemiology and patient counseling J Clin Virol. 2015 71 28 33 10.1016/j.jcv.2015.07.305 26370311 26. Pietrobon S Bononi I Mazzoni E Specific IgG antibodies react to mimotopes of BK polyomavirus, a small DNA tumor virus, in healthy adult sera Front Immunol. 2017 8 236 10.3389/fimmu.2017.00236 28321224 PMC5338004 27. Wunderink HF de Brouwer CS van der Meijden E Development and evaluation of a BK polyomavirus serotyping assay using Luminex technology J Clin Virol. 2019 110 22 28 10.1016/j.jcv.2018.11.009 30529638 PMC8136301 28. Dakroub F Touze A Akl H Brochot E Pre-transplantation assessment of BK virus serostatus: significance, current methods, and obstacles Viruses. 2019 11 10 945 10.3390/v11100945 31615131 PMC6833059 29. Malhotra J Waterboer T Pawlita M Serum biomarkers of polyomavirus infection and risk of lung cancer in never smokers Br J Cancer. 2016 115 9 1131 1139 10.1038/bjc.2016.285 27632373 PMC5117783 30. Flaegstad T Traavik T Christie KE Joergensen J Neutralization test for BK virus: plaque reduction detected by immunoperoxidase staining J Med Virol. 1986 19 3 287 296 10.1002/jmv.1890190311 3016170 31. Abend JR Changala M Sathe A Correlation of BK virus neutralizing serostatus with the incidence of BK viremia in kidney transplant recipients Transplantation. 2017 101 6 1495 1505 10.1097/TP.0000000000001261 27854236 32. Bae H Jung S Chung BH Yang CW Oh EJ Pretransplant BKV-IgG serostatus and BKV-specific ELISPOT assays to predict BKV infection after kidney transplantation Front Immunol. 2023 14 1243912 10.3389/fimmu.2023.1243912 37809095 PMC10551174 33. Bohl DL Storch GA Ryschkewitsch C Donor origin of BK virus in renal transplantation and role of HLA C7 in susceptibility to sustained BK viremia Am J Transplant. 2005 5 9 2213 2221 10.1111/j.1600-6143.2005.01000.x 16095500 34. Peretti A Geoghegan EM Pastrana DV Characterization of BK polyomaviruses from kidney transplant recipients suggests a role for APOBEC3 in driving in-host virus evolution Cell Host Microbe. 2018 23 5 628 635.e7 10.1016/j.chom.2018.04.005 29746834 PMC5953553 35. Salakova M Ludvikova V Hamsikova E Pretransplantation seroreactivity in kidney donors and recipients as a predictive factor for posttransplant BKPyV-DNAemia Front Immunol. 2022 13 929946 10.3389/fimmu.2022.929946 35967393 PMC9364833 36. Schmitt C Raggub L Linnenweber-Held S Adams O Schwarz A Heim A Donor origin of BKV replication after kidney transplantation J Clin Virol. 2014 59 2 120 125 10.1016/j.jcv.2013.11.009 24361208 37. Schwarz A Linnenweber-Held S Heim A Framke T Haller H Schmitt C Viral origin, clinical course, and renal outcomes in patients with BK virus infection after living-donor renal transplantation Transplantation. 2016 100 4 844 853 10.1097/TP.0000000000001066 26720302 38. Thangaraju S Gill J Wright A Dong J Rose C Gill J Risk factors for BK polyoma virus treatment and association of treatment with kidney transplant failure: insights from a paired kidney analysis Transplantation. 2016 100 4 854 861 10.1097/TP.0000000000000890 27003098 39. Verghese PS Schmeling DO Knight JA Matas AJ Balfour HH Jr The impact of donor viral replication at transplant on recipient infections posttransplant: a prospective study Transplantation. 2015 99 3 602 608 10.1097/TP.0000000000000354 25148381 PMC4336214 40. Wunderink HF De Brouwer CS Gard L Source and relevance of the BK polyomavirus genotype for infection after kidney transplantation Open Forum Infect Dis. 2019 6 3 ofz078 10.1093/ofid/ofz078 30949528 PMC6440680 41. Wunderink HF van der Meijden E van der Blij-de Brouwer CS Pretransplantation donor-recipient pair seroreactivity against BK polyomavirus predicts viremia and nephropathy after kidney transplantation Am J Transplant. 2017 17 1 161 172 10.1111/ajt.13880 27251361 42. Gras J Nere ML Peraldi MN BK virus genotypes and humoral response in kidney transplant recipients with BKV associated nephropathy Transpl Infect Dis. 2023 25 2 e14012 10.1111/tid.14012 36748721 43. Lorentzen EM Henriksen S Kaur A Early fulminant BK polyomavirus-associated nephropathy in two kidney transplant patients with low neutralizing antibody titers receiving allografts from the same donor Virol J. 2020 17 1 5 10.1186/s12985-019-1275-9 31924245 PMC6954500 44. Kaur A Wilhelm M Wilk S Hirsch HH BK polyomavirus-specific antibody and T-cell responses in kidney transplantation: update Curr Opin Infect Dis. 2019 32 6 575 583 10.1097/QCO.0000000000000602 31567736 45. Verhalen B Starrett GJ Harris RS Jiang M Functional upregulation of the DNA cytosine deaminase APOBEC3B by polyomaviruses J Virol. 2016 90 14 6379 6386 10.1128/JVI.00771-16 27147740 PMC4936136 46. Baker SC Mason AS Slip RG Induction of APOBEC3-mediated genomic damage in urothelium implicates BK polyomavirus (BKPyV) as a hit-and-run driver for bladder cancer Oncogene. 2022 41 15 2139 2151 10.1038/s41388-022-02235-8 35194151 PMC8862006 47. Harris RS Dudley JP APOBECs and virus restriction Virology. 2015 479-480 131 145 10.1016/j.virol.2015.03.012 25818029 PMC4424171 48. Stavrou S Ross SR APOBEC3 proteins in viral immunity J Immunol. 2015 195 10 4565 4570 10.4049/jimmunol.1501504 26546688 PMC4638160 49. Vieira VC Soares MA The role of cytidine deaminases on innate immune responses against human viral infections Biomed Res Int. 2013 2013 683095 10.1155/2013/683095 23865062 PMC3707226 50. DeCaprio JA Garcea RL A cornucopia of human polyomaviruses Nat Rev Microbiol. Apr 2013 11 4 264 276 10.1038/nrmicro2992 23474680 PMC3928796 51. O'Hara SD Stehle T Garcea R Glycan receptors of the Polyomaviridae: structure, function, and pathogenesis Curr Opin Virol. 2014 7 73 78 10.1016/j.coviro.2014.05.004 24983512 52. McIlroy D Honemann M Nguyen NK Persistent BK polyomavirus viruria is associated with accumulation of VP1 mutations and neutralization escape Viruses. 2020 12 8 824 10.3390/v12080824 32751274 PMC7472262 53. McIlroy D Peltier C Nguyen ML Quantification of APOBEC3 mutation rates affecting the VP1 gene of BK polyomavirus in vivo Viruses. 2022 14 9 2077 10.3390/v14092077 36146883 PMC9504301 54. Sikorski M Coulon F Peltier C Non-permissive human conventional CD1c+ dendritic cells enable trans-infection of human primary renal tubular epithelial cells and protect BK polyomavirus from neutralization PLoS Pathog. 2021 17 2 e1009042 10.1371/journal.ppat.1009042 33592065 PMC7886149 55. Handala L Blanchard E Raynal PI BK polyomavirus hijacks extracellular vesicles for en bloc J Virol. 2020 94 6 e01834-19 10.1128/JVI.01834-19 31896595 PMC7158717 56. Morris-Love J Gee GV O'Hara BA JC polyomavirus uses extracellular vesicles to infect target cells mBio. 2019 10 2 e00379 e00319 10.1128/mBio.00379-19 30967463 PMC6456752 57. Sener A House AA Jevnikar AM Intravenous immunoglobulin as a treatment for BK virus associated nephropathy: one-year follow-up of renal allograft recipients Transplantation. 2006 81 1 117 120 10.1097/01.tp.0000181096.14257.c2 16421486 58. Puliyanda D Radha R Amet N IVIG contains antibodies reactive with polyoma BK virus and may represent a therapeutic option for BK nephropathy Presented at: American Transplant Congress 2003 2003 Washington, DC 59. Randhawa PS Schonder K Shapiro R Farasati N Huang Y Polyomavirus BK neutralizing activity in human immunoglobulin preparations Transplantation. 2010 89 12 1462 1465 10.1097/tp.0b013e3181daaaf1 20568674 PMC3075564 60. Urayama T Takahashi K Ideno S BK polyomavirus‐neutralizing activity of intravenous immunoglobulin products derived from donated blood in Japan ISBT Sci Ser. 2016 11 3 146 152 10.1111/voxs.12294 61. Sato N Shiraki A Mori KP Preemptive intravenous human immunoglobulin G suppresses BK polyomavirus replication and spread of infection in vitro Am J Transplant. 2024 24 5 765 773 10.1016/j.ajt.2023.11.007 37977231 62. Benotmane I Solis M Velay A Intravenous immunoglobulin as a preventive strategy against BK virus viremia and BKV-associated nephropathy in kidney transplant recipients-Results from a proof-of-concept study Am J Transplant. 2021 21 1 329 337 10.1111/ajt.16233 32741096 63. Sharma AP Moussa M Casier S Rehman F Filler G Grimmer J Intravenous immunoglobulin as rescue therapy for BK virus nephropathy Pediatr Transplant. 2009 13 1 123 129 10.1111/j.1399-3046.2008.00958.x 18822106 64. Anyaegbu EI Almond PS Milligan T Allen WR Gharaybeh S Al-Akash SI Intravenous immunoglobulin therapy in the treatment of BK viremia and nephropathy in pediatric renal transplant recipients Pediatr Transplant. 2012 16 1 E19 E24 10.1111/j.1399-3046.2010.01384.x 22248251 65. Vu D Shah T Ansari J Naraghi R Min D Efficacy of intravenous immunoglobulin in the treatment of persistent BK viremia and BK virus nephropathy in renal transplant recipients Transplant Proc. 2015 47 2 394 398 10.1016/j.transproceed.2015.01.012 25769580 66. Hwang SD Lee JH Lee SW Kim JK Kim MJ Song JH High-dose intravenous immunoglobulin treatment of polyomavirus nephropathy developing after T cell-mediated rejection treatment: a case report Transplant Proc. 2018 50 8 2575 2578 10.1016/j.transproceed.2018.01.021 29871774 67. Matsumura S Kato T Taniguchi A Clinical efficacy of intravenous immunoglobulin for BK polyomavirus-associated nephropathy after living kidney transplantation Ther Clin Risk Manag. 2020 16 947 952 10.2147/TCRM.S273388 33116544 PMC7549878 68. Piburn KH Al-Akash S Use of intravenous immunoglobulin in a highly sensitized pediatric renal transplant recipient with severe BK DNAemia and rising DSA Pediatr Transplant. 2020 24 1 e13600 10.1111/petr.13600 31657100 69. Moon J Chang Y Shah T Min DI Effects of intravenous immunoglobulin therapy and Fc gamma receptor polymorphisms on BK virus nephropathy in kidney transplant recipients Transpl Infect Dis. 2020 22 4 e13300 10.1111/tid.13300 32323406 70. Mohammad D Kim DY Baracco R Kapur G Jain A Treatment of BK virus with a stepwise immunosuppression reduction and intravenous immunoglobulin in pediatric kidney transplant Pediatr Transplant. 2022 26 4 e14241 10.1111/petr.14241 35122460 71. Karatas M Tatar E Okut G Efficacy of mTOR inhibitors and intravenous immunoglobulin for treatment of polyoma BK nephropathy in kidney transplant recipients: a biopsy-proven study Exp Clin Transplant. 2024 22 suppl 1 118 127 10.6002/ect.MESOT2023.O29 38385385 72. Kable K Davies CD O'Connell PJ Chapman JR Nankivell BJ Clearance of BK virus nephropathy by combination antiviral therapy with intravenous immunoglobulin Transplant Direct. 2017 3 4 e142 10.1097/TXD.0000000000000641 28405598 PMC5381735 73. Boonyapredee M Knight K Little D Increased BK viremia and progression to BK-virus nephropathy following high-dose intravenous immunoglobulin for acute cellular rejection Mil Med. 2014 179 6 e699 e702 10.7205/MILMED-D-13-00489 24902140 74. Maggiore U Medici MC Vaglio A Buzio C Increased viral load after intravenous immunoglobulin therapy for BK virus-associated nephropathy Transpl Infect Dis. 2010 12 5 470 472 10.1111/j.1399-3062.2010.00512.x 20487412 75. Naef B Nilsson J Wuethrich RP Mueller TF Schachtner T Intravenous immunoglobulins do not prove beneficial to reduce alloimmunity among kidney transplant recipients with BKV-associated nephropathy Transpl Int. 2021 34 8 1481 1493 10.1111/tri.13882 33872427 76. Vela C Jouve T Chevallier E Conversion to mTOR-inhibitors plus IV immunoglobulins in kidney-transplant recipients with BKV infection: a retrospective comparative study J Clin Med. 2022 11 24 7292 10.3390/jcm11247292 36555909 PMC9785214 77. Randhawa P Viscidi R Carter JJ Identification of species-specific and cross-reactive epitopes in human polyomavirus capsids using monoclonal antibodies J Gen Virol. 2009 90 Pt 3 634 639 10.1099/vir.0.008391-0 19218208 PMC3075566 78. Lindner JM Cornacchione V Sathe A Human memory B cells harbor diverse cross-neutralizing antibodies against BK and JC polyomaviruses Immunity. 2019 50 3 668 676.e5 10.1016/j.immuni.2019.02.003 30824324 79. Nguyen NK Devilder MC Gautreau-Rolland L A cluster of broadly neutralizing IgG against BK polyomavirus in a repertoire dominated by IgM Life Sci Alliance. 2023 6 4 e202201567 10.26508/lsa.202201567 36717250 PMC9887757 80. Abend J Dragic Z Feire A Inventors; Polyomavirus Neutralizing Antibodies. Patent WO2017046676A1 2017 81. Abend J Cornacchione V Lindner J Traggiai E Inventors; Polyomavirus Neutralizing Antibodies. Patent WO2019106578A2 2019 82. Weber M Schmitt S Esslinger C Schachtner T Huynh-Do U Provenzamo M Inventors; Anti-bk Virus Antibody Molecules. Patent WO2021250097A1 2021 83. Moran T Kraus T Duty J Tortorella D Inventors; Neutralizing Monoclonal Antibodies to Bk Virus. Patent WO2022192740A1 2022 84. McIlroy D Saulquin X Nguyen N Inventors; Bk Polyomavirus Antibodies and Uses Thereof. Patent WO2023175171A1 2023 85. Sathe A Knapp M Kim P Pre-clinical characterization of MAU868, a novel neutralizing antibody targeting BK virus Presented at: 62nd ASH Annual Meeting and Exposition Virtual 2020 86. Jordan S Brennan D Patick A Gasink L Lin C Limaye A A randomized phase 2 study of MAU868 vs placebo for BK viremia in kidney transplant recipients: BK viral kinetics and outcomes in two dosing cohorts Presented at: American Transplant Congress 2023 2023 San Diego 87. Lahrtz F How to successfully patent therapeutic antibodies J Biomol Screen. 2015 20 4 484 491 10.1177/1087057114567457 25614506 88. Buck C Pastrana D Inventors; Methods and Compositions for Inhibiting Polyomavirus-Associated Pathology. Patent WO2013012866A1 2013 89. Peretti A Scorpio DG Kong WP A multivalent polyomavirus vaccine elicits durable neutralizing antibody responses in macaques Vaccine. 2023 41 10 1735 1742 10.1016/j.vaccine.2023.02.002 36764908 PMC9992340 90. Wanner N Eden T Liaukouskaya N Koch-Nolte F Nanobodies: new avenue to treat kidney disease Cell Tissue Res. 2021 385 2 445 456 10.1007/s00441-021-03479-8 34131806 PMC8205650 91. Demey B Bentz M Descamps V BK polyomavirus bkv-miR-B1-5p: a stable micro-RNA to monitor active viral replication after kidney transplantation Int J Mol Sci. 2022 23 13 7240 10.3390/ijms23137240 35806242 PMC9266457 ",
  "metadata": {
    "Title of this paper": "BK polyomavirus bkv-miR-B1-5p: a stable micro-RNA to monitor active viral replication after kidney transplantation",
    "Journal it was published in:": "Journal of the American Society of Nephrology : JASN",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11452134/"
  }
}